{
  "post content": "I (22M) have been dating this girl (22F) for about 3 months. Let's call her Madison. She's smart, cute, nice, and pretty funny.  I'm typing this out because she broke up with me over conversations I had with my best friend. Let's call her Lana.\n\n&#x200B;\n\nA little after Madison and I started dating, I told Lana all about it. Lana naturally became curious about my relationship, asking what I liked about Madison and whatnot. I said it was too early to tell, but Madison seemed cool and smart. Then Lana asked if there was anything I didn't like about Madison. I told her again that it was too early to tell. I did mention that I thought Madison's boobs were too small, that she isn't all that fit, that she acted too Americanized (she is supposedly half Japanese), and that she doesn't like clubbing. But I did say I'd still give her a chance.\n\n&#x200B;\n\nYesterday Madison came over to my apartment and we napped together before I had class. She didn't have class yesterday so I expected to see her after I got back. I called her to see where she went. She said while crying, \"Do not ever talk to me again! Why did you even want to date me if you felt that way about me?\" I asked her what she was talking about. She said, \"I don't know, but maybe you and Lana do.\" Then I realized I had left my desktop on, so she was able to see all my imessage conversations. Why she snooped, I don't know. I tried calling and texting her last night again to find out I was blocked.\n\n&#x200B;\n\nToday, I tried to talk with her at school before she had class. As soon as I saw her, she was around one of her girl friends who was staring a hole into me. I already knew right then that Madison told her what happened. I saw Madison reassure her friend that she's got this, so her friend stepped away.  Madison had a death stare on her face as she waited for me to come to her.  Our conversation went like this.\n\n&#x200B;\n\nMe: Why did you snoop through my messages?\n\nMadison: That's really the first thing you have to say to me? Just tell me, is that how you REALLY feel about me?\n\nMe: (I stayed silent, and this is where I know I messed up)\n\nMadison: That's what I thought. (she shoulders me as she walks on by). Excuse me, I gotta go to class.\n\nHer friend catches up to her and yelled \"Suck on your own man tits, b\\*tch!\" as they walked away. Yup, Madison told her.\n\n&#x200B;\n\nI regret saying those things about Madison to Lana. But I did say some good things about her and I did say I would give her a chance. I think Madison is being really unfair and overreacting. And I think she was out of line for telling her friend about our business. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 110,
      "content": "Why would she be a out of line for telling her friend what happened, but you are casually chatting about her boobs being too small and her not being Japanese enough to your friend? Double standards much. ESH. You suck massive dick for your shitty comments, and she sucks for snooping. Leave her alone, damage is done, and she knows how you *really* feel now.",
      "id": 2,
      "comments": [
        {
          "score": -41,
          "content": "But Lana doesn't go to the same school. She's an outsider. I see her friend on campus pretty often. All I was trying to get was some outsider perspective. Madison was just trying to make herself feel better by airing out our dirty laundry.",
          "id": 3,
          "comments": [
            {
              "score": 37,
              "content": "Doesn't matter. Save the \"... she's an outsider\" bs. You fucked up with with you wrote to your friend. It's not airing dirty laundry to confide in your friends-- I mean you were talking shit about her to your friend??!!!! And wtf kind of outside perspective were you looking for? Her boobs are too small, what you send boob pic, for you know perspective? Don't try and back track saying when your friend was asking odd questions about the girl you are seeing that you was looking for perspective. You was stating how you really feel and using the \"not that fit, overly American small boobed girl\" as a place holder. You are just mad and seeking validation for getting caught talking shit about the girl you *were* dating.",
              "id": 4,
              "comments": [
                {
                  "score": -25,
                  "content": "I'm sorta new to relationships. Lana did ask me what I liked about Madison and what I didn't like so I was honest. She's always given me relationship advice or told me when or when it isn't worth pursuing a girl.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 35,
                      "content": "I have never had a friend ask me to list \"what I don't like\" about the person I am dating. And I have never ask that question to countless friends who were starting to date someone new. You are still the asshole for what you wrote. Just think if the roles were reversed and she was texting her friend about you? \"yes he cool, seems overly American wanting McDonald's every day and has a small dick, but it's too early to tell\".",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": ">Madison was just trying to make herself feel better by airing out our dirty laundry.\n\n.. but in this metaphor, you shit the bed. And then showed Lana your shitty laundry. And then got mad at Madison telling her friend you shit the bed. You’re not coming out of this well, is what I’m saying. \n\nYou’re probably not going to come back from calling a potential girlfriend a small titted, unfit “supposedly half Japanese” wretch that you’ll graciously “give a chance”, particularly when you’ve gossiped about her to another woman.\n\nI mean, would you date you at this point?",
              "id": 7,
              "comments": [
                {
                  "score": -2,
                  "content": "I suck with words but honestly I'm a nice guy. I wish she gave me the chance to explain myself.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Do you think what you said about Maddie was nice?",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Obvious excuses are obvious.",
              "id": 10,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "No she wasn't trying to make herself feel better. The person she was dating demeaned her, said she wasn't that fit and her tits were too small. She told her friends, to be honest I'd want to know if a guy said that kind of stuff about someone they were actively dating so I could avoid him",
              "id": 11,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 96,
      "content": "ESH\n\nYou sound like all of the worst kinds of stereotypes when you talk about your girlfriend being \"too westernized\" and having small breasts. You should probably examine some of what you value in a partner. It also seems pretty messed up to me that you know you hurt this person you presumably liked, and still went right to confronting her about snooping instead of apologizing for treating her like meat. That said I tend to agree about snooping in relationships. It's a worrying sign when people feel the need to snoop, especially when there has been no sign of broken trust yet.",
      "id": 12,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 53,
      "content": "YTA for saying all that shit about Madison, YTA for trying to shift the blame by accusing her of snooping, YTA for not knowing you’re CLEARLY the asshole. \n\nYou are not ready to call anyone a girlfriend.",
      "id": 13,
      "comments": [
        {
          "score": -15,
          "content": "You’re crazy if you think Madison did nothing wrong. OP was having a private conversation. Madison and her friends are huge bitches.",
          "id": 14,
          "comments": [
            {
              "score": 28,
              "content": "She’s insecure and needs boundaries, but she’s not an asshole. OP asked if he’s an asshole, and he is. he’s trying to make this about her snooping instead of him telling other girls a bunch of hurtful shit about his gf. 🤷‍♀️",
              "id": 15,
              "comments": [
                {
                  "score": -4,
                  "content": "Her being insecure explains why she snooped, but it doesn't excuse what she did. ESH",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -23,
          "content": "She did snoop though. There is no other way she would have known about my conversation with Lana because Lana and her haven't met.",
          "id": 17,
          "comments": [
            {
              "score": 36,
              "content": "Missing the point, chief. Doesn’t matter that she snooped, you said a bunch of negative shit about her to another girl and that doesn’t get negated because she looked through your shitty conversation. Be accountable for your actions and stop trying to weasel out of this.",
              "id": 18,
              "comments": [
                {
                  "score": 6,
                  "content": "It doesn’t get negated by her snooping but she still snooped, so it should be ESH",
                  "id": 19,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Naw. He acted thoughtlessly and said cruel things, and then he got caught and is now trying to shift blame. She’s insecure and needs to learn trust, but she doesn’t suck like he does. He’s TA for sure.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 52,
      "content": "[deleted]",
      "id": 21,
      "comments": [
        {
          "score": 32,
          "content": "No you're not the only one, I mean look at OP's other comments about Madison being part japanese, he's being a horrible asshole about it gosh. And his perception of \"ethnicity\" sounds totally fucked up and fetishist.\n\nOP is YTA. I think some of what he said in his original comment is toned down, and it seems nothing compare to a little insecurity on Madison's part.",
          "id": 22,
          "comments": [
            {
              "score": 4,
              "content": "Jesus. I don't know how to feel about Madison's snooping. Obviously it's wrong to snoop because invasion of someone's privacy is never conducive towards a relationship. On the other hand, she was able to find out what she needed to about this dipshit. She may have found out about how he felt later, but that probably would have been more time wasted for her. It's just a shitty situation all around.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "I'm so happy for Madison, I hope she meets someone amazing after this cause it can knock a girls confidence",
          "id": 24,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 22,
      "content": "YTA. Not even Japanese women are like your anime’s bro",
      "id": 25,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 20,
      "content": "[deleted]",
      "id": 26,
      "comments": [
        {
          "score": 0,
          "content": "I don't like Lana like that at all. I told this to Madison before.",
          "id": 27,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 18,
      "content": "ESH. \n\nShe shouldn't have snooped. You didn't say anything THAT bad about her, but still... and the \"too Americanized\" comment is raising some flags tbh. Too Americanized for what?",
      "id": 28,
      "comments": [
        {
          "score": -21,
          "content": "She claims to be half Japanese and doesn't know how to speak Japanese. I told her I liked Asian food and she cooked me chicken alfredo while I was in class. Maybe I meant to say she was not in touch with her own roots. Idk, I clearly made the wrong choices in saying that.",
          "id": 29,
          "comments": [
            {
              "score": 59,
              "content": "Sounds like you've got an Asian chick fetish and you're disappointed she's not living up to your fantasy.",
              "id": 30,
              "comments": [
                {
                  "score": -10,
                  "content": "It's not that. It just seemed like she didn't have any cultural ties with her ethnic background.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 29,
                      "content": "And why does this bother you?",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 36,
              "content": "Yoooooo. Are you even kidding me right now?  \n\n\nI'm about half Norwegian. Don't know how to begin preparing lutefisk. Can't speak the language. Happen to have an affinity for Mexican food and cook that as often as I can. It is WILD to me that you are upset that someone cooked chicken alfredo for you. It's wild to me that you think someone being half anything means they are automatically going to conform to your understanding of their ethnicity.  \n\n\nAlso, I live in Japan and the place down the street from my house makes a mean chicken alfredo. Get these weird stereotypes out of your head before you become the parody everyone here assumes every foreign guy is.",
              "id": 33,
              "comments": [
                {
                  "score": 0,
                  "content": "I guess at the time her pride in being half Japanese seemed fake since she does not have any cultural ties to it. I guess I'm wrong.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 24,
                      "content": "You can be proud of your heritage and not live like you are from those countries though. People do it all the time. Her being half Japanese is going to affect her life in ways you can't begin to see or understand, and they aren't the stereotypical ones like shy modesty or making katsudon for dinner every night. You're taking your definition of Japanese and applying it to an actual Japanese person, and then accusing her of being fake for not fitting your definition. \n\nIf you want to date a stereotype go find a stereotype, but our cultures, skin, and backgrounds touch us all differently. That doesn't remove us fom them.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I’m proud to be partly Russian-American but you won’t catch me eating aspic everyday",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "ESH. You probably shouldn’t have said those things to Lana, but snooping is never OK.",
      "id": 37,
      "comments": [
        {
          "score": -10,
          "content": "Agreed. Everyone’s entitled to an opinion tho, even if it’s not nice or hurts someone’s feelings tho\n\nNot sure if this makes me lean towards NTA but agreed, snooping is never ok",
          "id": 38,
          "comments": [
            {
              "score": -6,
              "content": "Yeah I was really debating between the too as well",
              "id": 39,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "ESH. She shouldn’t have gone through the messages, but you went too far telling your friend “she has small tits but I’ll give her a chance”. Imagine how you’d feel if your girlfriend said “eh small dick but let’s give it a try”.",
      "id": 40,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "Considering the shit you're telling your female best friend about your gf, I can only assume there's way more inappropriate behavior involving Lana which made your gf suspicious. Regardless of why she snooped though, YTA. Wtf is that too americanized comment?",
      "id": 41,
      "comments": [],
      "relation": "Attack"
    }
  ]
}