{
  "post content": "I’m 22 and she’s 25. My sister (Mia)’s son is 7 months old and the father is not in her baby’s life at all. He basically dipped the week after the baby was born. I’ve been supporting the both of them financially while my sister Mia gets back on her feet and looks for a job to pay the bills all on her own.\n\nFast forward to 2 days ago, she calls me excitedly, telling me she has big news. Deep down in my heart I already knew what she was about to say and my intuition was confirmed when she said she was pregnant again.\n\nShe went on and on about how she met a new guy she hadn’t told me about and how nice he treats her and the baby. That she really feels like he’s the one and how she can’t wait for the family she was supposed to have.\n\nI basically laid it out straight to her. She hasn’t been dating this guy for very long, and yet she’s already pregnant and wanting to marry him simply because he treats her and the baby “nicely”. He isn’t helping with bills, or providing in anyway. This was not likely to last and she’ll be a single mom of 2. Not to mention how dangerous it is to get pregnant this soon after giving birth.\n\nShe told me I was being “fake” and that I wasn’t acting like family. That I should support her like our mother is. Turns out, our mother is kissing her ass and only enforcing the rose colored glasses Mia has on the situation. Telling her stories of how our stepdad only knew her for 2 months before he married her and blah blah. \n\nI told her that I can’t support her or any other children should she decide to go through with this. I essentially said “I’m not pressuring you into anything. This is your choice, but I refuse to be financing this choice. You’re on your own Mia. I can’t enable you digging yourself further in holes you can’t climb out of cause of irresponsible unplanned pregnancies and I refuse to”\n\nOf course, she didn’t take that well. Started crying and saying how I just don’t want her to be happy, how much of a bitch I am and hung up. Our mother isn’t very happy with me now. I do feel bad. I don’t think I worded it the best, nor should I have called her irresponsible. \n\nI’m just at my breaking point. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 10376,
      "content": "Nta, you could've worded it better, but you're on the money, it's an irresponsible decision and she should know better. She's not entitled to your financial support and you have the right to cut that off.\n\nAlso, it makes me laugh that she calls you fake, because you're the only one being real with her.",
      "id": 2,
      "comments": [
        {
          "score": 3878,
          "content": "NTA and honestly, I don't think she should have been  nicer with her words. Her sister is an irresponsible, entitled leech. What does she expect OP to do? Provide for her for the rest of her life while she gets repeatedly knocked up by every \"true love\" she meets? - Let's be honest, no one thinks this one will last.) The mother is also delusional - it's nice that her own quick relationship actually worked out but if she wants the same thing for her daughter, she should be the one providing for her. I assume that's why she's angry at OP - she's eager to support Mia emotionally (because that costs nothing) but she doesn't want to spend her money on her.",
          "id": 3,
          "comments": [
            {
              "score": 2088,
              "content": "OP should tell Mom that if she’s so sure this “whirlwind romance” will work out, she should be happy to take over the role of wallet.",
              "id": 4,
              "comments": [
                {
                  "score": 641,
                  "content": "that's exactly what i was thinking. no wonder mom is so on board with this, she's not the one paying.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 300,
                      "content": "[removed]",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 132,
                      "content": "Oh how easy it is to spend other people’s money.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "she also doesnt want to be the one paying, thats why shes trying deflect responsibility to OP.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 64,
                  "content": "Exactly this. NTA. The sister is being irresponsible.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Blehh, she's downright stupid. \n\nNAH OP, definitely NAH.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 63,
                  "content": "Hi Mom, I packed her bags and left it on your front lawn",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "The role of wallet 😂😂😂. Exactly.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Op probably is also supporting the mom financially.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Yes! Exactly what I was going to suggest!",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "And be happy to provide them with a roof over their heads",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 116,
              "content": "Personally, I think the way to approach this once it’s clear that she plans to keep it is to be nice and congratulatory but be clear that the financial support ends in X months. X being before the new baby is born. That way she has time to deal with trying to get CS, finding a daycare for her children so she can start work after #2 is born etc. “I only promised to help until you could work again from baby #1. I can’t continue to do this for baby #2 but I wish you lots of luck with the new boyfriend!”",
              "id": 16,
              "comments": [
                {
                  "score": 142,
                  "content": "Their sister just called OP an asshole and treated them terribly and you want them to keep footing the bill? There are plans in place to take care of people who need it she really needs to work on getting government assistance instead. There's specifically programs for new moms that helps buy food and such for the babies. I get you're trying to help one person but you gotta remember it's costing another. They're doing it because theyre being nice, they don't deserve to be walked all over and still pay out like a paypig.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Does paypig mean piggy bank? It just made me laugh but I completely agree with your comment.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I was also wondering why, if she has a 7 month old, she isn’t on some form of government assistance… that’s the part that really gets me.  \nWe have systems in place for this type of situation.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Exactly.  OP is NTA.  Her sister should apply for the government handouts.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 56,
                  "content": "X months will just make it harder to get her hands out of the wallet. It should be done yesterday.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "What BS? Why on earth yall treat these kinda delulu women to be infantilized so bad? She wanna have kids, go have an entire cricket team, ON YOUR OWN EXPENSES.\n\nThrow the sister out. FO. Esp after that tone and disrespect, nah.",
                  "id": 22,
                  "comments": [
                    {
                      "score": -5,
                      "content": "Ppl here in this sub treat women like they are angels.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "Congratulate her for what? Bringing another baby into the world that she can't care for? Be nice why? She is using OP.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Worse - congratulate her for wanting the OP to support another child that isn't theirs.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "She called OP fake... Why does she need to keep footing the bill exactly? It was not her decision to make the baby or to keep the baby, so why op should pay for her sister's upkeep? Her sister is also older and should know better.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 0,
                  "content": "Yes, that would be polite. But also kind of fake",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "This!! I think Op’s sister needed to hear the truth no matter how harsh it sounds. She’s living in a fantasy and expects Op to finance her delusional lifestyle. I would cut her off so quickly if my sister got pregnant by two different deadbeat dads in less than one year!",
              "id": 28,
              "comments": [
                {
                  "score": 48,
                  "content": "Also, the sister has a 7 month old and is supposed to be job hunting - when and how did she meet this guy let alone have sex?  Sister should be very busy taking care of her baby plus looking for work \"to get back on her feet\" and yet, somehow, she found time to go out and meet guys and also get pregnant? I know folks with babies who are lucky to have time to shower!",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Some people shouldnt be allowed to breed\n\nCommon sense/iq test",
                  "id": 30,
                  "comments": [
                    {
                      "score": 0,
                      "content": "She got a job yall give her a break! The mattress company asked her to test out the bed springs! The bed spring bouncer broke and they saw her at the corner of Horniee Blvd and Brokarse St job hunting  so they offered and she accepted! Yep I going straighttohell for this one!😈",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "I knew a girl in high school who later had 3 kids and still lived with her parents.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 61,
                      "content": "Me too, the first one was an 'accident\" the second one was a \"mistake\". By the time she was pregnant with the third one her mom told her she was cut off and had to find a place to live with her kids and to go after the babies' fathers (3) for child support. The daughter was pissed beyond belief at her mother for not supporting her and told her with a straight face that she didn't want to financially burden the fathers (3) with child support payments.  This was years ago and I wonder how it turned out for them.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Yeah, she was probably nicer than I would be. She didn’t say anything MEAN that’s for sure",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Her relationship isnt even working out, she barely knows the dude, and is already pregnant. Just bc hes nice to her older baby doesnt mean hes a good person or parent. \n\nIf shes so in love, then her new baby daddy can give her money",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Agreed 100%",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Exactly! It shouldn't have been worded any nicer. She even deserved harsher words. She's an ungrateful entitled leech and extremely irresponsible. Poor kids! But it's not OP's responsibility, and OP was way too generous. It's time to stop being used and shift that responsibility to their delusional mother.\n\nEDIT: I forgot to say a huge NTA",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yes, this! Not to mention OP is younger: basically Sis and Mom are fine with stealing from OP's future for these irresponsible choices. Giving the benefit of the doubt for the situation with the first child, for Sis to just plunge headfirst into a relationship before getting herself together to provide for her first child like an adult is just mind blowing.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 607,
          "content": "I would add that if your mother gives you shit about this, send your sister and her expenses to your mother. If she is supportive of her choice, then she should be paying her expenses instead of you",
          "id": 39,
          "comments": [
            {
              "score": 161,
              "content": "Agreed! There really is no reason for op to be footing the bill here.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "NTA but if the new guy is so great then he should be more than willing to support the sister and his child - at the very least.,",
              "id": 41,
              "comments": [
                {
                  "score": 32,
                  "content": "I wouldn't put money in that horse, she had the same issue with baby daddy number 1. Some people really cannot learn from their mistakes",
                  "id": 42,
                  "comments": [
                    {
                      "score": 13,
                      "content": "She didn't see it as a mistake because she's been in her sister's wallet the entire time.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Oh yes. If the mother thinks it's all good than she can feed her daughter and grandkids. Why should OP. Even if OP was fifthly rich that wouldn't give softer the right to treat her like an atm",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Agreed!",
              "id": 45,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 258,
          "content": "I was with you until you said she could've worded it better. I know it's just your opinion, but I think she worded it fine. Heck, many people would've been even more stern considering the situation her sister has gotten herself into is mind blowing. They're both so young, and the younger sister is supporting her? When she's just one year past being able to buy herself a drink? Not to mention that their mother is completely on board with Mia, and upset with OP for deciding to cut her off financially? Many other sisters would've completely lost it on her! It also sounds like Mia and the mother are probably closer and more alike, therefore I wouldn't be surprised if she always has Mia's back when she makes bonehead decisions. Their mother emphasizing that she also got married after 2 months while Mia is fantasizing about her new beau is completely irresponsible. Yes, meeting someone, falling in love, getting married after 3 weeks and having 40 years of wedded bliss does happen, but unions like this are the exception, not the rule, and everyone knows this. Heck, I got married at 19, closed escrow on my first home at 22 while my husband and I were expecting our first child, and have managed to have an absolutely wonderful 26 year marriage with 3 amazing children, but I would NEVER advocate for my children to attempt to follow in our footsteps...ever. My husband and I have been incredibly blessed, and I'm old enough to know how rare our love story is. The likelihood that our children will be able to repeat our good fortune with odds such as extreme youth and still being in college is slight, and the same is true for OP's sister Mia. I truly hope she will be the exception, but she is stacking the odds against herself on top of the one's life already has. Not to mention that she's doing all this will being financially supported by her little sister? Her audacity and lack of responsibility boggles the mind, frankly. I think she needs a wake up call and fast, because she seems to be forgetting one crucial factor: She is about to be responsible for the care and well-being of 2 children! She's got to start making better choices, yesterday, because children need money and stability, she doesn't have either, and she doesn't seem to be concerned about her lack of them. She's got mammoth issues to overcome and she seems completely clueless. Her poor children; I hope she gets her head out of the sand very soon...",
          "id": 46,
          "comments": [
            {
              "score": 51,
              "content": "of course she worded it fine. her family is financially abusing her. the sister is emotionally manipulating her. they're awful. op needs to hand the bills to the mother and go nc with the lot of them.",
              "id": 47,
              "comments": [
                {
                  "score": 3,
                  "content": "I concur completely...",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "That's what gets me about the mother in this.  My mom met a dude,  got knocked up 3 months in,  & married 5 months into the relationship.  This year will be 30 years of marriage,  & even with some rough patches, mom & stepdad are solid AF. Stepdad is a great man, who dotes on her,  & dotes on all of his children (he had 3, mom had 2, & they have 1 together) both bio & step. \n\nWhen I told my mom I was marrying my husband after 7 months,  she told me that was the dumbest thing ever. Of course,  I pointed out she married sDad after 5 months,  & her response was \"Yeah, that's why I know it's the dumbest thing ever! \" 😅 She didn't try to talk me out of it,  which wouldn't have worked,  & would've likely alienated me.  She supported me,  even if she thought I was being dumb. \n\nThankfully,  my marriage has worked out so far,  my husband & I are a good match, my mom still thinks that getting married quickly was the dumbest thing ever,  even though the relationship itself is a good idea.  After 16 years,  I agree with my mom,  getting married so fast was for sure the dumbest thing ever,  & I'm amazed we've made it work for this long. We're the EXCEPTION,  not the rule. For every rushed marriage that works,  there's hundreds that don't,  the odds were not in our favor.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "👏👏👏👏 well said.\n\nNTA btw",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "There may be hope for her sister. I was in the same situation with mine, but she seems to have her shit together now and supports her own kids.",
              "id": 51,
              "comments": [
                {
                  "score": 2,
                  "content": "Here's hoping",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Totally agree with what you said but I also laughed at your first line \"I was with you until you said she could've worded it better.\" Cuz it's basically a really long way of saying you agree with the first three letters, NTA...it was just kinda funny to word it that way. No disrespect.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Agreed",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 181,
          "content": "OP is only 22 years old! They should be saving for their own future, not supporting someone else’s growing family.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 146,
          "content": "100 percent this all the way your doing more than some people would do she should he truing to get on her feet first before even thinking about another man",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "NTA, forget wording it better.  Tell her that someone else is paying for this baby factory and buy her a shirt with that as a logo.",
          "id": 57,
          "comments": [
            {
              "score": 19,
              "content": "I really like this idea!",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 110,
          "content": "Actually, OP needs to be as clear and direct as possible. Mia is already getting positive reinforcement from their mother. Both Mia and the mother are indulging in magical thinking and also believe that OP is obligated to help Mia as much and however needed. \n\nOP made it very clear what Mia can expect from them in terms of help. Anything else would have been a mistake. Some people need a wake up call that cannot be misinterpreted or twisted. If OP was soft or couched their words in platitudes, Mia likely wouldn’t have taken OP seriously. OP *needed* to decisively cut through and combat Mia’s fantasies and assumptions - well done OP.\n\nNTA",
          "id": 59,
          "comments": [
            {
              "score": 6,
              "content": "Exactly!",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "NTA. Such a situation requires a clear blunt response and sugarcoating it wouldn’t change a thing.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "OP, no matter what, I would cut her off financially. I would text her, \"I'm sorry for how I worded things on the phone. Feeling financially responsible for you colored my feelings, but now that I'm not financially supporting you, I just want to say I wish you the best! No doubt this man, or mom, will step up and make sure you and your babies are taken care of. This is such an exciting time! I can't wait to meet my new nephew or niece.\" \n\nBasically, make it clear you're done supporting her financially, point out who you're passing the buck off to, and then just play the role of supportive sibling! If she asks for money, remind her that you're just a sibling now, you're not financially supporting her, but she has two people to ask for money now!",
          "id": 62,
          "comments": [
            {
              "score": 42,
              "content": "No, she should not apologize for her wording. It was clear and definitive and that's what sister needs.\n\nIn fact, I don't think OP should contact her at all for the time being because all she's going to do is subject herself to her sister's rage and guilt-tripping because Mia gots ta get back on that gravy train before it leaves the station.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "No, she couldn't have worded it better. You can't gently lead someone out of delusion. Bashing their head into reality is The best chance you have, and if that doesn't work you're out of luck.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1794,
      "content": "YNTA. You have no obligation to support other peoples kids. You’re a good family for helping her with the one kid she has but bringing another kid into it when she can’t event support the first one is irresponsible. She hasn’t known this guy long enough and only time will tell if he will stick around for the baby. \n\nYou’re 22. You have your own life to live and grow into. You’re a good sister for supporting her and baby 1 but she is living in another universe if she thinks a second child is responsible or okay. Babies only bring more stress, they don’t fix anything. \n\nYou did the right thing. No pressure, it’s her choice, but you can’t afford it financially or psychologically.",
      "id": 65,
      "comments": [
        {
          "score": 606,
          "content": "You don't need the Y, NTA is enough. I don't think it counts for the contest mode if you add the y.",
          "id": 66,
          "comments": [
            {
              "score": 77,
              "content": "I would actually like to suggest OCNTA for this one (of course not the asshole).",
              "id": 67,
              "comments": [
                {
                  "score": 22,
                  "content": "At least make it OCNTA*, duh* then.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Well that would break this sub because it's full of redundant AITA questions as it is",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 44,
              "content": "'Contest mode' is the time in the first couple hours of a post's life cycle where comments are not sorted by their current Score - they are randomly sorted so that each comment has a chance to be seen and voted on. Contest Mode ends after 2 hours or so, but the voting continues for 12 hours. Contest Mode exists to help people get their comments seen and upvoted so that the first few comments don't have a massive advantage. It isn't synonymous with the voting period.\n\nYNTA is not a recognized judgement - but the voting bot will only check the most-upvoted comment because that's the one that wins. The bot doesn't count anything, it just relies on Reddit's existing voting mechanism. If a YNTA judgement were to become the top comment, the bot would read it - fail to find a valid judgement - and would kick the comment to the mod team for manual review and flairing.",
              "id": 70,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "I meant it to mean “you’re not the asshole”, so I will always write ‘YNTA’. I’m not really concerned with contest mode, just offering support. Thanks anyway tho.",
              "id": 71,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -25,
              "content": "why do u care sm lol",
              "id": 72,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 139,
          "content": "Honestly, I think you did your sister a disservice by supporting her all this time.  She now thinks that you'll support her forever. \n\nIt's not your job to take care of your fully-adult siblings.  You have your own life to consider.  Cut her off now.\n\nNTA.",
          "id": 73,
          "comments": [
            {
              "score": 12,
              "content": "Eh, shit happens and the US doesn’t have maternity leave. I’d support my sibling until she got on her feet the first time… after that though…",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1543,
      "content": "NTA. She's not living in reality. Why on earth did she think that her starting a family with someone else would mean you would continue to financially support her? Does she think you should pay for *another* child? Does she think her new boyfriend will pay for one kid, and you'll pay for her and the other one?\n\nShe's making stupid decisions because she's caught up in the \"romance\" of it. Better to pull the rug out now, before she gets fully used to the idea of you completely supporting her. Stop before it even starts for the new kid. She's a grown adult with more than one child now, she should be able to take care of herself if she can have another child.",
      "id": 75,
      "comments": [
        {
          "score": 238,
          "content": "Not only just in the \"romance\" of it, but also the hormones of being 7 months post partum!",
          "id": 76,
          "comments": [
            {
              "score": 1,
              "content": "So either she cheated on her first SO or she decided it was a good idea to have a baby 6 months into a relationship.",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 191,
          "content": "It’s pretty shocking how naive the sister is. She’s already been through this once and the guy dipped right after she had the baby.\n\nNow she’s pregnant again and she only just met the guy, but he’s the one and she’s so happy to have a big, happy family?! Does she not realize how this will potentially play out? 👀😔",
          "id": 78,
          "comments": [
            {
              "score": 122,
              "content": "Even if he is “the one”, there’s no rush to have a baby! She’s only 25. It’s almost like she’s trying to baby trap him, but that didn’t work with the first guy. \n\nAlso, where’s the child support from dad #1?",
              "id": 79,
              "comments": [
                {
                  "score": 24,
                  "content": "Yeah, it’s a very “Disney Princess, looking to find my happily ever after before seeing if we are remotely compatible” vibe 🧐",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Also if the baby is only 7 months and he’s already ‘so nice’ so the baby, that implies he’s already spent time with the baby. I would not let anyone meet my child when I’ve only been dating them a couple months. That’s weird.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It’s ok though since money is not an issue when she has her slave I mean sister taking care of her every need.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "The new bf will split too!!!!",
          "id": 83,
          "comments": [
            {
              "score": 117,
              "content": "My guess is the *second* he realises that his new pregnant girlfriend and her baby are going to be completely dependent on him he's going to start second guessing everything.\n\nI'm betting the kind of woman to get pregnant within a year of the last baby in a new relationship hadn't had the \"I'm completely financially reliant on my sibling\" conversation unless it was suffixed with \"and you can be too!\"",
              "id": 84,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "Did she spend her youth watching a bunch of soap operas or what?  You know the shows where the stars always do stupid things then everything works out.  Those shows have all been cancelled I believe.  Now Hallmark is the place to go for unrealistic romance.",
          "id": 85,
          "comments": [
            {
              "score": 29,
              "content": "It's very \"I'm having his baby and it will all be wonderful!\"\n\nLike, hunny, it didn't work with the last one, why would it work now?",
              "id": 86,
              "comments": [
                {
                  "score": 29,
                  "content": "I think it sounds like the sister is trying to baby trap the guy she's seeing. Her fantasy seems to be like \"hey 'guy nr2, I'm pregnant\" and that his response will be \"yaay! Let's get married!!\"\n\nBut that's not usually how guys react to someone he just mer getting pregnant.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 0,
                      "content": "[deleted]",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I had a friend like this. She has multiple kids with multipile Dads and a heap load of drama because she's on the misguided search for love. Revolving door of her Moms shitty boyfriends who ranged from Beloved Adoptive Father to Creepy Asshat Who Watches Too Much Porn. She thinks that *one day* she'll find her Prince Charming who will love her despite her flaws, all her kids, and all that jazz. It ain't never gonna happen, and I hate to watch it. Even from afar.",
              "id": 89,
              "comments": [
                {
                  "score": 7,
                  "content": "I told my children that they need to be selfish during their teen years.  It is their time to grow and discover themselves.  To chase their interests.  And they need to become what they want to be before they take on the responsibility of relationships.  Be it a romantic relationship or parental you need to be mature enough to handle life.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Exactly. Plus, no one has even met the guy! He could be an abuser trying to trap her, or he could be a nice guy that's getting trapped. No one knows how on board with this he was.\n\n Even if this was an oopsie baby, it's a bad start for everyone involved.",
          "id": 91,
          "comments": [
            {
              "score": 21,
              "content": "I'm betting the new boyfriend sees a woman doing \"well\" and hasn't realised that she's not funding herself. My cynical brain is pretty sure he leaves when there's no money.",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": ">Why on earth did she think...\n\nYour comment fell apart here! The whole problem is that sister isn't thinking. Right now she has a baby, another on the way, a 'loving' partner, and all her financial and emotional needs are met. She isn't thinking \"how\", just that they are. I'm willing to bet nearly any amount of money that the sister has been taken care of her entire life by family and has never had to fend for herself. She's just like an 8-year-old who knows money exists but assumes there is just a fountain it comes out of into the bank.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Honestly I’m surprised OP has supported the sister for so long. 7 months post-birth is more than what lots of people with jobs get in maternity leave payments. Time for her to get a job and/or get the new partner to start paying up. Surely she’s not so delusional that she expects financial support from OP when she’s in a relationship with the father of the second child?! NTA at all",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I think what else bothers me is that the sister is older then op. She has had more time being an adult, and i understand that no 2 adulthoods are the same and luck is a big part in things but man its like a child having another child and everyone is expecting op to deal with it because \"family\"",
          "id": 95,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 924,
      "content": "Tell your sister to go after the fathers of the children for child support is not your obligation to support your sister and her immature choices. She needs to be an adult and act like one. It is not up to you to support her if your mother so upset let her support her",
      "id": 96,
      "comments": [
        {
          "score": 137,
          "content": "This is what I was wondering, where’s the child support from dad #1?",
          "id": 97,
          "comments": [
            {
              "score": 99,
              "content": "Child support can be hit and miss in the USA. If the deadbeat doesnt pay, you just get nothing. The court doesnt just send checks to support you and come after him later. They charge the dude, shave a bit off the top and THEN send it to mom. If somebody dipped the week the baby was born, I doubt they have a current address much less the funds to get those papers served and prepared.\n\n\nI'm not tryna shit on constructive ideas, just presenting an icky reality that I've helped a few friends navigate. This is also assuming OP is in the USA. The system may be different elsewhere.",
              "id": 98,
              "comments": [
                {
                  "score": 73,
                  "content": "[deleted]",
                  "id": 99,
                  "comments": [
                    {
                      "score": 15,
                      "content": "That is a phenomenal expression!  I'm going to use if for everything now.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "This is my new favorite colloquialism",
                      "id": 101,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Well, there is flensing...",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "A lot of the deadbeats either stay jobless or get a job that pays under the table (illegal but still very common)so that they don’t have to pay child support.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Women can still get help if the father split. They’re not left to beg in the street.",
                  "id": 104,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Can’t believe I had to scroll so far for this comment",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 604,
      "content": "NTA ..\nI often wonder why people have the pleasure of getting pregnant and expect someone else to finance their pregnancy and life????",
      "id": 106,
      "comments": [
        {
          "score": 228,
          "content": "I’m convinced there are women who get positive attention for *nothing* other than popping out sprogs. They have absolutely nothing else in life that gets validation from others. Holding a cute baby you can convince yourself everyone is smiling at YOU.",
          "id": 107,
          "comments": [
            {
              "score": 66,
              "content": "Because you're the special unique princess that brought that cute little baby into the world! These people live in delusional fairytale lands",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 337,
      "content": "NTA.... It's one thing for her to have a kid with one deadbeat dad, but to get pregnant so quickly with baby #2 before getting married, she's likely to have picked a similar guy who will bolt the moment they have a fight.  You are correct and she's likely to need even more help if or when the second guy leaves.",
      "id": 109,
      "comments": [
        {
          "score": 134,
          "content": "At this point I'm wondering why Guy #1 fleed. Probably he was just a no-good guy who didn't want to take responsibility, but in light of what happened with Guy #2, I wonder if OP sister purposely gets pregnant because she thinks that's how she keeps the man.",
          "id": 110,
          "comments": [
            {
              "score": 29,
              "content": "Whatever the case, she doesn't have good judgement and would only land a good partner based on pure luck.",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "This!!! Sister has no interest or intention of getting a job and supporting herself and her children. Her “plan” seems to be baby trapping men into supporting her then falling back on family when he bails. OP is right to opt out of this shitshow now bc they have designated her as the “wallet” who pays for their foolish decisions.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 290,
      "content": "Does she not believe in birth control?",
      "id": 113,
      "comments": [
        {
          "score": 228,
          "content": "I think she just really wants love :/",
          "id": 114,
          "comments": [
            {
              "score": 331,
              "content": "Love is letting deadbeats nut in you",
              "id": 115,
              "comments": [
                {
                  "score": 64,
                  "content": "Wanting love will make people do stupid things that seem right in the moment",
                  "id": 116,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Sounds like she's trying to baby trap these guys",
                      "id": 117,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "Love is not having two under two by two baby daddies. Sorry but 25 is too old to be making such life choices!",
                  "id": 118,
                  "comments": [
                    {
                      "score": 4,
                      "content": "She probably has mental issues.",
                      "id": 119,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 143,
              "content": ">That I should support her like our mother is. Turns out, our mother is kissing her ass and only enforcing the rose colored glasses Mia has on the situation.\n\n>Our mother isn’t very happy with me now.\n\n... if this is a dynamic you've had throughout childhood, I really recommend you read Adult Children Of Emotionally Immature Parents, especially if your mother withheld love if you weren't behaving as she wanted. NTA",
              "id": 120,
              "comments": [
                {
                  "score": 42,
                  "content": "Good point. The whole dynamic of OP being the youngest here and the most mature makes me think her childhood must have been.... interesting. OP doesn't need to be raising a second generation of people who aren't her kids.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Love that book. Highly recommend for everyone to read, especially people will emotionally immature parents.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Perfect recommendation of a book. It helped me understand a lot of my childhood.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Great book",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "NTA tell nher to get child support and cut the financial help completely op\n\n\nAlso tell your moron mother since she is helping your sister to live in fantasy land she can finance her life.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "> I’ve been supporting the both of them financially while my sister Mia gets back on her feet and looks for a job to pay the bills all on her own.\n\n&#x200B;\n\n I’ve been supporting the both of them financially while my sister Mia goes partying, picking up other men\n\n… there I have corrected your typo\n\nSeriously, her baby is only seven months, how is she managing to met other men, have sex and know they are pregnant in that timeframe? Most new mums are frazzled and can’t think of sex again lol",
              "id": 126,
              "comments": [
                {
                  "score": 2,
                  "content": "Who was babysitting while Sis was on Her man hunt?",
                  "id": 127,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Letting a man that can’t even feed you shoot the club up (it’s a figure of speech Reddit) is not the way to find it… but I hope your mom and stepdad are prepared to finance her and her 2 under 2.",
              "id": 128,
              "comments": [
                {
                  "score": 1,
                  "content": "Eh, they have only been dating for a short time, it is not on the new man to start suddenly paying the sisters bills or providing for her. \n\nSister/OP say he treats her nice so likely is taking her out on dates/dinner. But that is a far cry from taking over supporting someone you just met.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 10,
                      "content": "But it’s okay to get her pregnant? If you aren’t prepared to support her, why are you fucking her raw?",
                      "id": 130,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "... and your money.",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Sounds like she should work on herself before getting into another serious relationship.\n\nDoes she think she can pressure the guy into marriage over the fact that she's pregnant?  Ngl, she sounds super naïve as well as desperate.\n\nNTA",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You’re probably right. \nSometimes they make their own people who will love them unconditionally because that’s what kids do for parents. Doesn’t matter if you have money or not.\n\nIt’s so sad, I see so many kids who love their parents even though those parents are toxic.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Love and sex are very different things.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I’d recommend therapy for her then.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Stuck in believing true love",
          "id": 136,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 217,
      "content": "\n\n>Our mother isn’t very happy with me now.\n\noh well. mom can step up and finance her. NTA",
      "id": 137,
      "comments": [
        {
          "score": 2,
          "content": "Fr. Everyone in this story needs to learn how to look after the children they carried to term.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 205,
      "content": "22-year-olds should not have to support their 25-year-old sister financially. She should make do with what she can make herself or what her new family unit can afford. You will need all the earning power you have to build up your own life. Her choices are hers, the consequences of her choices are also hers.\n\nThat said, you should have just congratulated her and told her that you will need to stop supporting her financially because you will need to take care of yourself - as should she.",
      "id": 139,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 133,
      "content": "NTA at all. I’m a firm believer of if u can’t support ur own children, then u shouldn’t be having them. She’s being insanely irresponsible. U r in no way obligated to finance her or her children.",
      "id": 140,
      "comments": [
        {
          "score": 15,
          "content": "Firm believer of this as well. Idc if people call this \"eugenics\" (because it isn't lmfao) I genuinely don't understand why people want and celebrate this.",
          "id": 141,
          "comments": [
            {
              "score": 8,
              "content": "Right. I get if there's an emergency situation and your start struggling financially, that's different. But to know you're struggling from day one, dad left, your sisters finances your life and then you get pregnant again and it's with a strangers child basically, that's another story. \n\nHow delusional.\n\nWonder if shell end up with a 3rd baby daddy",
              "id": 142,
              "comments": [
                {
                  "score": 2,
                  "content": "it’s not a matter of if, but when.",
                  "id": 143,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}