{
  "post content": "I (19M) visited the zoo today with my family and we were checking out the koalas, who I was especially excited to see. You may not know this, but koalas apparently need over eighteen hours of sleep a day to function or else they can get quite unhealthy quite quickly, and so any exhibit of them at a zoo will often come with an expectation that you maintain a certain level of silence while observing them. This zoo today was no exception - you are made to go through two gates, both of which have signage saying ‘Please be quiet, keep the noise down, silence please, etc’ and then the door to the koala house itself has another sign: ‘Please keep noise levels to a minimum’. \n\nWith all those reminders, I figured people would get the memo, but as soon as we entered the enclosure (which was a small room indoors with a glass window looking into the koala pen) I spotted a couple in their early thirties with two young kids and a baby. I somewhat apprehensively tried to observe the koalas (they were so cute and my little sister was happy to see them) but then, like clockwork, the baby starts crying. Hardly the baby’s fault - it’s a baby, they cry - so I gave the dad of the family the benefit of the doubt thinking he’d either take the baby out or calm her down. A few moments pass; the baby gets more annoyed and cries louder. The koalas scurry away, hiding in their cubby holes, and others wake up from their sleeping.\nI give the dad the look. I feel like everyone knows the look - we’ve either had someone give it to us or given it to someone else. I’m not sure I’d ever been on this end of it, but I’d definitely received some looks at times.\nBaby continues to cry. I (being a socially awkward autistic teenager) grapple with the idea that the dad might have missed my giving him the look so I do the classic: I shake my head and give a little sigh. No change. I throw another look his way - this time a little more firm - but I feel like I overdo it - my eyes are a little too intense, perhaps - because suddenly the dad is saying, in the voice of someone who’s just gotten a lecture ‘Well alright mate, it’s just a baby’ to which I reply with a gesture towards the sign ‘Silence, please’. \n‘But it’s a baby!’ he says. \n‘Well don’t bring a baby in here’ I reply, in a whisper. My parents jump on me, thinking I’m out of line and the couple and their kids give me the filthiest of looks and leave the enclosure, leaving me feeling very tense.\n\nWhat do we think? I feel like this is a very common struggle in a public place where there aren’t always members of staff to enforce the rules. We want to pick our battles, of course, but this family bringing their baby in spoiled my little sister’s magical moment seeing a koala for the first time. Surely they should’ve seen the signs and thought ‘Probably best to not bring little Charlie in’ or, if they really wanted to see the koalas, the dad could’ve stayed outside with the baby and the mum and the kids could’ve gone in. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 6284,
      "content": "NTA They obviously were able to read the signs, they just think it didn't apply. I think you did a GREAT job, it was mostly non verbal and dude FINALLY got the hint, but still tried to make excuses \"it's a baby\", well yes, but baby doesn't KNOW when and where is proper to be noisy...cause it's a baby, therefore BE a parent and also be mindful of other creatures, humans or not. So you did have to let him know that the signs are there for a reason, and you even whisper yelled, which showed that even you were trying to keep quiet out of respect. Librarians don't put up with that in their domain, koalas shouldn't have to either, but they can't speak, so they need an advocate, you are a great koala advocate!  \n\nGreat job OP, and you can tell your parents I said so, I'm a mom of two, grandmother of three and my kids would NEVER have kept a crying baby in a quiet place because I taught them manners, and I also took my crying babies out of church, a wedding and a theater -not an infant, a 5 year old who insisted he was old enough to go to the movies even though he was really sensitive to sound-I told him he wouldn't like it and he was feeling really left out because his friends went to the movies, so...yeah, too loud, not a scary movie, but the noise was too much and he got scared so he cried and we left. Because I knew that I was responsible for my little's noise in public.",
      "id": 2,
      "comments": [
        {
          "score": 1921,
          "content": ">my kids would NEVER have kept a crying baby in a quiet place because I taught them manners\n\nExactly! \"It's a baby!\" ... \"Yeah, and you're a parent, act like one\"\n\nEspecially since, in this case, it wasn't just annoying to the other people present, it was an issue of safety for the live, endangered animals that are just trying to get some sleep as they live their lives in dreary captivity to amuse your children.",
          "id": 3,
          "comments": [
            {
              "score": 847,
              "content": "This problem is pretty easily solved… if you have a baby and you’re someplace that requires low volume and the baby starts shrieking… you take the baby outside.\n\nI did this a million times with my own kids. It ain’t hard.",
              "id": 4,
              "comments": [
                {
                  "score": 331,
                  "content": "Especially since both parents were there, so one could go outside with the crying baby and the other could stay in the koala enclosure with the older kids. It's not rocket science.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 128,
                      "content": "people these days are too butthurt they might miss out on something. Never occurs to them that they can take turns, because, a good couple does everything TOGETHER.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "And then take turns",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 71,
                  "content": "Simple action.  Baby cries, walk outside.   This doesn't hurt the baby, but it will help everyone else there, especially the koalas.   \n\nNTA",
                  "id": 8,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Especially the Koalas!! \n\nAgreed. NTA.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Had to do it a lot at church when mine were babies.  Others have and still do it.  You take them out calm them down and then come back.  Wife could have stayed with the other children to see the Koalas.  NTA",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "That should be the norm anywhere. If your baby or child starts crying/screaming in public and won't stop, take them elsewhere. Have some consideration for people around you instead of saying, \"Tough shit.\" Many people, including myself, have misophonia triggered by children. Some of us become enraged. Some of us panic. Many of us end up fleeing places because of it. There's no cure, and it's not well-understood. Expecting us to just deal with it because parents can't bother to act like parents or be respectful is extremely isolating.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Right. It's in everyone best interest *including the baby/toddler* to remove them.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "“But it’s a baby!” Some people think that if they have a baby with them, other people should accept all kinds of shit and that same rules don’t apply to them because “it’s just a baby”. \n\nNTA OP!",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Agreed. I have left multiple restaurants, church services, other’s homes, stores… when my children cried. I feel as it’s MY problem that baby is crying, not everyone else’s.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Bless you for that. So many people have taken the whole \"children deserve to exist in public\" thing too far imo. Like. I agree, but there's also a teaching of public and situationally appropriate behavior involved in that",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I was at a museum with a family member and their kids. Older kid was really excited to see the exhibit, but little kid was getting bored and fussy. So I took little kid out to the hallway to calm down and let older kid and their parent enjoy the museum. Once little kid was calm and ready to go back in, we met back up with our family and enjoyed the rest of the day. \n\nSometimes being the caregiver of a baby/toddler means you miss out on things because the kid’s not ready to be a part of the experience.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": "One of my least favourite responses when I comment about unruly kids is \"It's just kids being kids\". That's fine as long as an adult steps in to \"educate\" them as to what's acceptable behaviour and what's not. I feel in this case it was entirely acceptable for OP to step in and remind the adult in question of his responsibilities. Good Job!",
              "id": 17,
              "comments": [
                {
                  "score": 93,
                  "content": "We have experienced this twice.\n\n1.)  Point Defiance Zoo, Tacoma.  The tiger is sitting right by the large glass window, almost like \"Take your pictures.  Am I not gorgeous?\"  It was magical.\n\nThen some a-hole family with a toddler come over, and the toddler starts pounding on the glass, screaming, so the tiger starts to walk away.  The parents did nothing.\n\nI did say something.  I said, \"It is a shame you ruined that for everyone.\"\n\n2.)  Cincinnati Zoo.  Gorilla.  My daughter had a once in a lifetime moment with the giant gorilla.  He sat with her and tried to offer his leaf for some reason.  She near cried.\n\nThen some a-hole kid came up and started screaming at the gorilla and making monkey noises.  The gorilla got upset and left.\n\nMy daughter looked at the kid right in the face and just said, \"Why?\"  Then she said let's go, and something about people being raised in a barn.  The mom got very angry.\n\nPeople suck, and they should be called out more.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Good for your daughter!",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I was in the Twilight cave (for bats) in Chester Zoo and they have a strict rule against flash photography for obvious reasons. That didn’t stop this idiot from taking pics on his phone with the flash. Bats predictably did not like this and started hiding in the trees. I was there with my mum and a friend of hers who works at the zoo so I just walked back to them and loudly pointed out the gentleman with his camera. He gave me a filthy look as he was asked to leave by my mums friend. I looked straight back at him and said ‘you were literally hurting the bats for the sake of a picture’. He had the good grace not to retort and left quietly.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 93,
                  "content": "Especially since one of the points of going to the zoo is to educate your kids about animals, right? \n\nWhen the baby started crying, dad could have taken the baby outside while mom explained \\*why\\* koalas need their sleep, along with how rare koalas are and why we need to protect them to the older kids.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Exactly. Turn it into a learning experience.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "The one I hate most is “haven’t you ever been young?”  Well yeah I’ve been young but I wouldn’t have dared to behave like that becaudse you know, my parents actually parented..",
                  "id": 23,
                  "comments": [
                    {
                      "score": 6,
                      "content": "👏🏻",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Right? A) I wouldn't act like that because I knew there were consequences for it. And B) I didn't particularly like other kids when I was one.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "If the kids are being kids, then the adults have to be adults.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Right? Like, yes! correct! Kids don't know better and can't always control their emotions/impulses/volume! That's why adults are supposed to explain to them why what they are doing can be disruptive!",
                  "id": 27,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I completely agree, but it's amazing how many parents seem not to care and carry on regardless.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": ">Exactly! \"It's a baby!\" ... \"Yeah, and you're a parent, act like one\"\n\nI would get the same BS from my upstairs neighbor when their baby would pound on the floor with what sounded like a hammer at 2 AM.  \"Hey, could you stop the pounding please?\"  \"It's the baby.\"  \"... and?\"  (Like they expected me to just say \"Oh, OK!\" and just live with the pounding.)",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "My observation as a parent and grandparent is that people worship family togetherness! Yes! Everyone HAS to be together ALL THE TIME. On this day at the Zoo the family was primed for FUN!!! and that meant nobody stayed home with the newborn. The newborn, who has no schedule and cries as necessary to get needs met. Mom and Dad probably both work full-time, so Sat/Sun outings ALWAYS include the baby because family.\n\nIt's just not realistic for parents to take all the kids everywhere, even when a normal age spread means at least one will be too old or too young for the event....and that's still not including the baby's demands.  But it's not realistic for them to do it any other way, either.\n\nI'm not hating on parents, being one myself, but unless parents are willing to try somewhat more focused outings, which will be more expensive, stuff like what OP complained will happen.\n\nAnd that isn't taking into account the difference in overall price in having everyone go somewhere at one time, instead of in smaller groups.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 155,
          "content": "God this reminds me of when I went to see the new Lion King with my family and the kid behind us talked the whole time. I finally turned around toward the end and asked him to please be quiet, and the dad responds with \"he's FOUR.\" Isn't that old enough to know you should be quiet in movie?",
          "id": 31,
          "comments": [
            {
              "score": 87,
              "content": "I took my oldest grandkid to his first movie.  Happy Feet.  He was 3.  He was told how to behave and did an awesome job.  He did clap very excitedly when the movie first started.  Everyone got a chuckle out of that.  Raise kids with manners and respect for the environment they are in.  It can be done! No one wants a brat around in a public place.  Parents should parent!",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Your anecdote is 50/50 for me cause that is a residual risk of going to a kids movie.",
              "id": 33,
              "comments": [
                {
                  "score": 147,
                  "content": "imagine every kid in a kids movie talked the entire time just because they're kids. That's not actually how it works. Kids aren't imbeciles, they're perfectly capable of watching a movie without jumping around and talking nonstop, and if they aren't, that's not a good place for them to be. \n\nYes it's a kids movie, which means other kids are also trying to watch it and not all of them are talking nonstop",
                  "id": 34,
                  "comments": [
                    {
                      "score": -18,
                      "content": "There’s a spectrum for kids that ranges from mature to Imbecile which I think quantifies the likelihood of them talking in a movie. Unfortunately, he got stuck in front of one that was an imbecile, a residual risk of going to a kids movie.\n\nPlease acknowledge that I’m focusing on the risk and not the lack of decorum in the situation. While I understand your point, you’re side-skirting the reality that his risk of interruption was greater cause of the type of movie he went to which a realistically, mindful individual would take into account.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 27,
                  "content": "I work at a movie theatre, and we have thresholds for the movies and volume levels. For kids movies, we expect it to be a bit noisier. I’m less inclined to get out a talking child during a popular showtime of a kids movie. That doesn’t apply to PG13 or R rated films though, we’re much less tolerant of that.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "And? It's not just annoying for the adults or teenagers there, but also for the other kids present in the theatre room.",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "I agree, time makes a difference too. There are literally times set up to bring babies/toddlers - some are kids movies for the toddlers, some movies are for the parents and less tend to bring a toddler.\n\nIf I go to one of those or a G movie during the day I expect noise.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 32,
              "content": "Dude it's the lion king. Yeah kids should be taught movie etiquette, they learn that with practice. Which they get from going to kid friendly movies, like the lion king.",
              "id": 39,
              "comments": [
                {
                  "score": 84,
                  "content": "Something being kid-friendly doesn't mean they get to talk during the entire movie. I knew how to stay quiet during a show or movie as a kid. It's not a difficult concept.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 4,
                      "content": "It is for some, if not MOST 4 year olds. Out of curiosity, what time of day did you go?",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 71,
                  "content": ">Which they get from going to kid friendly movies\n\nYes, and by their parents telling them \"You have to be quiet during the movie\" while they're there.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Age is not the determinant--ability to behave appropriately is. If the kid cant stop talking and his parents cant control him, he's not ready to attend a public performance.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Honestly, I think stuff like this is why I loved our local cinema when I had my first. They ran bubs in prams sessions. So the lights were a bit brighter. Volume was lower and everyone in there had babies so no one complained. \n\nExcept for one time when a guy accidentally brought the wrong session. He was algud and apologised once he realised and the staff just moved him. \n\nI wish more cinemas would do that.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 7,
                      "content": "This seems like a really good idea for families so you can bring younger kids with their older siblings to see a film without having to get a baby sitter.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "4 is borderline, they may need reminding. But this is why my husband and I didn't regularly take the kids to restaurants and theaters, sometimes where it was more kid friendly and with reminders and lots of discussion at home about how to behave. My son has ADHD so needs reminding a lot to keep quiet in certain settings still, parents need to be mindful. NTA op you weren't an aggressive jerk about it at all",
              "id": 46,
              "comments": [
                {
                  "score": 19,
                  "content": "I took my kids to restaurants from babies, as they got older, if their behaviour wasn't good I let them know it wasn't appropriate and I was ready to leave any time. If they enjoyed the experience they'd need to learn to behave appropriately or they wouldn't get taken places.\n\n This included explanations of how hard the waiting staff work, asked my kids if it was fair that staff had to watch out for kids getting out their seats etc. How would my kids feel if there was someone at another table just yelling etc.\n\nI haven't taken my son out in the same way and unfortunately his table manners aren't as good.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Yeah we do now, and they're very good. Reminders are still needed but overall decent table manners, definitely need to expose some in order for full understanding we just weren't wanting to disrupt others good times when they were too young",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "As a fellow mom of ADHD, I feel that. Our kid used to stand in front of his seat during movies. This let him move and bounce without disturbing others.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Disney on Ice was great for them, he was entranced the first time but all of the kids were bouncing and singing along, they loved it and it was totally expected and acceptable. He's really good at restaurants now, if he starts to get too loud a gentle reminder is all it takes. It takes patience and practice and we definitely carefully picked where we took them for quite a while. Drive in was a great alternative as well, windows up and still reminding them not to be too loud but it was less disruptive to others that way",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "My sister and I love to talk during movies but we know to keep our mouths shut at the cinema because the world doesn’t revolve around us. \nYou did good OP. I’m not sure where you are located but I’m Australian and the Koalas would have definitely appreciated you standing up for them. In our wildlife sanctuaries people are usually informed that if they have a crying child please step away from the animals so not to scare/distress them and then once the child has calmed down they are free to continue looking.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "That's old enough to understand when you're told not to talk. However, if the child is one who isn't going to listen then they shouldn't take him to the movies.\n\nAn occasional outburst is to be expected but not a constant dialogue.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My cinema does toddler /baby screenings,  these are very good if you've  vocally dodgy kids at the cinema. \n\nThe dads a dick .",
              "id": 53,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "It’s like the John Mulaney Lion King bit come to life.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yes, dad, that's why you're here - to teach him how to behave. That's why I'm blaming you and not him.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 146,
          "content": "This story is either fake or obviously embellished - nothing about the behaviour OP describes aligns with koala behaviour. I cant believe anyone who describes koala movement as \"scurrying\" has ever seen a koala move.\n\nMaybe the parents should have left when their kid started crying - I'm sure we're all in agreement it's rude to let your kid scream in public if there's a possible exit - but that has nothing to do with Koalas, who regularly exist right beside humans and their noise without giving a single fuck, so long as you don't handle them.",
          "id": 56,
          "comments": [
            {
              "score": 72,
              "content": "My immediate thought was this was fake too as the koala behaviour was just wrong. Koalas don’t go to the ground very often and noise definitely isn’t a reason. In some parts of the country (south east Queensland, specifically Brisbane and Gold/Sunny Coast come to mind) they literally live in people’s back yards and along busy roads. They don’t give a fuck about noise. And they don’t have cubby boxes. And someone below mentioned a door separating viewing area from back of house and I get that’s common in zoo enclosures but they would not get on the ground to go through a door unless the viewing area didn’t have a constant supple of food. They go where the food is. You give them constant fresh leaves they’ll sit in the same damn fork of a tree their whole life. They don’t even move to take a crap, they literally crap in their sleep.",
              "id": 57,
              "comments": [
                {
                  "score": 21,
                  "content": "I visited a wildlife park over the weekend and all three of their koalas were in an open air environment (just like they would be in the wild!) sleeping next to the branches provided to them for food. I bet so long as those little guys keep waking up to fresh food they'll never move. The park did have covered boxes on the ground but in all the time I've seen koalas on display (and I live in southern Australia so that's pretty often) I've never not seen them in a tree.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Saw a wild koala loping along the side of the road driving to Cape Otway a few months ago, and at our camp-site saw another one climb down from the tree it was in and waddle to a fresh tree, but I agree that generally they aren't on the ground unless there's a fire or something.  This post is cubic wombat shit lmao",
                      "id": 59,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "The way I bet this went down was that OP was annoyed by a crying baby, said something to the parents that didn't go over well (as evidenced by his own parents jumping on him for it), and made up the part about the sign requiring quiet and giving fake details about very un-koala-like behavior in order to come across as more sympathetic.",
              "id": 60,
              "comments": [
                {
                  "score": 15,
                  "content": "I pointed that out too and op title is misleading he gave dirty looks and did not ask them to leave",
                  "id": 61,
                  "comments": [
                    {
                      "score": -2,
                      "content": "I mean if your baby is crying in a place that has signs saying \"quiet please\" and people are giving you dirty looks, it's a clear way of saying \"take the baby out\".",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 25,
              "content": "And OPs weird \"I whispered\" stuff",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "Op says they were observing the animals from behind a glass wall....just like any other zoo the animals have a place to sleep where nobody can see them or bother them. Lol this one was fake, IMO",
              "id": 64,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "The only time I've seen anything close to a 'scurry' is an aggro male koala on the warpath chasing a dog out of his territory, and that's fucking LOUD. And rare.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": ">I cant believe anyone who describes koala movement as \"scurrying\" has ever seen a koala move.\n\nThey do occasionally scurry between trees and across the roads around where I live. Have you ever seen a koala outside of a zoo? Just for reference: https://youtu.be/M_LPM3F8Jm0\n\nBut unfortunately sometimes they're really slow at crossing the roads. There were at least two hit by cars in my area within the past month or so, and I know one of them died.\n\nNot here to verify the details in OP's story, I've just seen a few koalas around.",
              "id": 66,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "exactly and he pointed out in parathesis that he is autistic as if to get more sympathy from us. I really think this story is overdramatic or fake.",
              "id": 67,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "koalas scurry [https://www.youtube.com/watch?v=3wvVegFwrYE](https://www.youtube.com/watch?v=3wvVegFwrYE)",
              "id": 68,
              "comments": [
                {
                  "score": 12,
                  "content": "That's... not a scurry? That was a koala doing a little awkward lope down a hall because they're arboreal and extremely awkward on flat ground.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Would you like to draw us a diagram to illuminate the minute differences between a lope and a scurry?",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Looks like a scurry to me?",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Koalas sleeping in a tree don't scurry. They look at you and grunt. I've grown up around them my entire life and mowing the lawn under their tree warrants a blink and a grunt: a baby crying isn't going to warrant a 'scurry'.",
                  "id": 72,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 99,
          "content": "This post is fake. OP has never seen a koala in his life. Source: am an Australian who dealt with koalas daily.",
          "id": 73,
          "comments": [
            {
              "score": 55,
              "content": "Another Australian here who read this post thinking wtf! Definitely fake.",
              "id": 74,
              "comments": [
                {
                  "score": 21,
                  "content": "All Aussies reading this are thinking the same thing 😂",
                  "id": 75,
                  "comments": [
                    {
                      "score": 14,
                      "content": "So glad there's plenty of Aussies here all saying this!\n\nSeriously, \"scurrying\", hahaha!",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "100%! I was like, they sleep most of the day cause they are high on Eucalyptus and have inefficient digestive systems, they don’t give a crap about noise!",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Right. And good zoos rotate their koalas in the display area anyway every couple of hours. And I hate to say it, but koalas also live in the wild… which isn’t quiet.",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 86,
          "content": "Koala’s don’t need advocates in this specific instance. \n\nThey don’t “scurry away” or “hide in cubby holes” at noise - they’re no where near as noise sensitive as the poster claims. A decent zoo does not expect silence near koala exhibits, and koalas won’t “get quite unhealthy quite quickly” from a little noise.",
          "id": 79,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 60,
          "content": "Koalas really don’t give a shit about noise. The Australian bush or urban areas where you find them are obnoxiously noisy.",
          "id": 80,
          "comments": [
            {
              "score": 28,
              "content": "Plus Koala's can be bloody noisy. I don't know what's louder a chainsaw or a male koala's mating call.\nMy first thought was OP had wombats and Koalas mixed up.\nAlso had my niblings at Taronga Zoo (Sydney, Australia) last year. Open air Koala enclosure, full sun, hundreds of screaming kids, summer, midday. The Koalas were sleeping, scratching, yawning, eating, all the usual stuff.\nI'd say NAH but the zoo is Y T A for enforcing non natural behaviours/ environments on an animal.",
              "id": 81,
              "comments": [
                {
                  "score": 9,
                  "content": "Yes they’re really NOT sensitive little creatures",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Not me out in the bush having a lovely time with mates when a monster starts screaming.  One of my friends casually looked up and went \"oh, a koala\" and kept on about what we were doing for dinner 😂 we weren't crying baby loud but we weren't quiet either.",
                  "id": 83,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Koalas don’t give a shit. I went to San Diego Zoo and saw them. They were all outside and there was noise. They didn’t care.",
          "id": 84,
          "comments": [
            {
              "score": 3,
              "content": "Live in San Diego, ours are literally in an area thay can get quite noisy and the bus tours come right up to the area.  This guy is lying about the whole thing.",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "Love how this comment is #1 when the story is bullshit\n\nRead the comments from us Aussies and you’ll see this whole story is just an autistic redditor who hates babies. Simple",
          "id": 86,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 26,
          "content": "If koalas really needed silence, I would think the real AH is the zoo for not building them a proper enclosure? If they were able to construct a viewing enclosure with multiple gates, it seems like they could have designed it with thicker glass to keep the inevitable noise from babies and children from permeating?\n\nBut additionally, multiple people have pointed out that it is not true that koalas need silence.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "koala advocate is the best job you can have, frankly.",
          "id": 88,
          "comments": [
            {
              "score": 2,
              "content": "Except they pay in eucalyptus leaves.",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1077,
      "content": "NTA. Warning: rant incoming. \nI think you’re fine, you didn’t even say anything that mean? I disagree with everyone saying you were wrong to be passive aggressive. In social settings like this, some looks can save them the embarrassment (if they catch on, which this guy clearly didn’t) of them getting verbally called out. Also, it reduces the noise. OP would be a hypocrite to talk to the dad, making more noise himself, while he was mad about the family making too much noise. Sure, maybe you should’ve left it up to the staff. But I agree with you, people shouldn’t be stupid enough to bring a baby that will inevitably cry at some point into a silent place. There was an abundance of signs saying to be quiet. Can they not read? Your assessment of “maybe shouldn’t bring the baby in” is spot on imo. If a couple brought their baby into a movie theater, a place that has a similar expectation of remaining quiet, and their kid starts screaming…. People would get justifiably pissed! This is arguably worse than that because you’re disturbing animals. \n\nIf the couple really wanted to bring their older children in, they could’ve taken turns. One stays outside with baby, one goes in with the older children, then comes out to watch the baby, other parent goes in. Too inconvenient? Too bad. You chose to have kids and you can’t bring all kids everywhere all the time. You could also have just one parent go in with the older children and leave it at that. It’s not like it was a solo parent who had no choice but to bring all 3 inside. Or, better yet, don’t go see the koalas if you can’t follow the rules. Tons of options that don’t involve making other people and animals inconvenienced by your children. If the baby started crying and they left soon after, that would be fine. If the baby was in a deep sleep, that’s okay as long as they’re quiet. But as soon as the kid starts crying loudly, you need to take them out. He tried to say it was okay just because the baby doesn’t know better. Well, you should!! FFS. From how you’re describing it, it sounds like this kid was crying for awhile too. Not cool.",
      "id": 90,
      "comments": [
        {
          "score": 290,
          "content": "^ people need to stop making their lovely little inconveniences everyone else's problem.",
          "id": 91,
          "comments": [
            {
              "score": 36,
              "content": "For real! I know when my kid was a baby we left places a lot, or one of us would go outside with 'the baby' and switch off (she had cholic).   \nDinner out with family somewhere nice, baby starts crying, quick rock paper and see who is going out unless one volunteers. We didn't do movies unless we had a sitter. Zoo, when she was older but not as a baby- that could wake up sleeping animals.   \nHow many adult and young adults I see doing the baby at the theater (at LOUD non children movies), not taking the baby out when it starts crying at high end places for dinner and they let the baby cry... just, What the Hell? Who raised you?",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "YES!! Exactly! This!",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "I swear most people can't handle taking turns. We did the divide and conquer more than I can think of but it seems a lot of my friends are like no, we're married, therefore we do things together. Well you're both at the zoo together. It's like some couples cannot stand to be apart for more than it takes for one of them to pee. It's really off-putting and makes me think you're ill-equipped to handle life.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I get not like the crying baby and the quiet part. The problem I’m having is simple: the Koalas won’t care.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 955,
      "content": "NTA \n\nAnd to those saying it was not OP.s place to enforce the \"quiet please\" signs: \n\nYES IT WAS. The koalas cannot protect themselves. They depend on the humans to not DELIBERATELY hurt them by disturbing them with loud noise. And when some humans are dumb enough to not understand this, the smarter humans will have to tell them and make them stop.\n\nThe zoo should put a member of the staff in this room to stop this kind of nonsense, but since there was none, OP did the right thing.",
      "id": 96,
      "comments": [
        {
          "score": 538,
          "content": "I’m sorry but this whole story is bullshit. I live in Australia close to a koala breeding/rehabilitation centre. I have never seen a sign asking people to be quiet near them. Also koalas do not ‘scurry’ when it is noisy. They often live in suburban areas and mostly sleep during the day. They’re pretty good at ignoring loud noises like kids playing and dogs barking. There is no way a baby crying would bother them this much. If they moved it was because they were looking for a more comfortable spot or more food. Alternatively, your zoo has hoodwinked you and you were actually looking at dropbears which are much more sensitive to noise.\n  \nEDITED TO ADD: If you’ve ever heard a koala’s mating call, you’d be well aware that noise DOES NOT bother them this much.",
          "id": 97,
          "comments": [
            {
              "score": 288,
              "content": "Came here to say the same thing 😂 the koalas in Aussie zoos are generally in outside environments, with people (and kangaroos) walking in and around them all day. Heaps of people, and they barely even glance at you. Scurry away made me laugh 😂",
              "id": 98,
              "comments": [
                {
                  "score": 112,
                  "content": "Same!\n\nJeez. I'd definitely pay to see a scurrying koala 😂.\n\nThe noise issue in this post is bizarre. Never heard this in my life!",
                  "id": 99,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Right? 😂",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 76,
                  "content": "EXACTLY! I have up to 7 koalas in my back yard most days. Does this mean that I shouldn't go outside, have a party, watch tv?\n\nKoalas are some of the loudest animals themselves when they want to be, and probably make more noise than most of my parties do!",
                  "id": 101,
                  "comments": [
                    {
                      "score": 25,
                      "content": "I’ll print you up some signs so your visitors know to keep the noise down.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "i went to aussie and the koalas gave no shits about loud noises tbh, they still slept.",
                  "id": 103,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 199,
              "content": "Thank goodness someone said it! Cubby holes?! Scurrying? Noise issues?! LOL!!! Dunno what OP is on about - they are not describing koalas here...",
              "id": 104,
              "comments": [
                {
                  "score": 96,
                  "content": "Definitely more drop bear behaviour.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Best response.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "Maybe they meant wombats? They live in burrows,and can move quickly when they want to. But generally every single one I've come across at a zoo is snoring underground 🤣",
                  "id": 107,
                  "comments": [
                    {
                      "score": 33,
                      "content": "My local zoo has wombats…*allegedly*.",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 189,
              "content": "I'm glad someone else said this! I work at a facility that has koalas and have volunteered with koalas in the past, and they don't care about the noise at all. I'd also never use the term \"scurry\" to describe a movement of a koala either, they don't move fast enough.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "A study I read found that visitor numbers and noise in a zoo environment affected the “vigilance” levels in koalas. In other words, it made them feel fearful and stressed. In such a low-energy animal as a koala, that could have a really detrimental impact on their health. Their experience of the noise of the mating calls of their own species is gonna be completely different to the noise of humans. Maybe the zoo OP visited had taken this research into consideration when designing the koala enclosure and instructing visitors to keep their noise level low. Maybe this approach will spread to other zoos and koala sanctuaries in future. Koalas tolerating noise in urban areas could just be because they don’t have any choice, don’t have the energy to move, and need to stay where the food is. OP’s post seems legit to me, and I think he behaved reasonably. I’d probably do the same.",
              "id": 110,
              "comments": [
                {
                  "score": 70,
                  "content": "The area I live in had catastrophic bushfires come through a few years ago and the damage to the koala population and their environment was devastating. The facilities around me care for, rehabilitate and breed koalas. They invite and encourage visitors to come to increase awareness. A baby crying is not going to undo all the work they have done.\n  \nEdited to add: I’m assuming OP is from America so I’m going to say that living in an environment that is vastly different to their natural habitat is going to have more of an impact on their health.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Still, the zoo made it very clear they wanted visitors to be quiet. One crying baby probably won’t make that much difference, but I still think it’s reasonable to ask people to follow the rules.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "I assumed America as well until he said the dad responded with 'mate'.  Americans don't use that term so not sure where OP is.\n\nI'm not sure his post is making much sense to be honest.  Lots of inconsistencies about how he is describing koalas and also signs about being quiet.",
                      "id": 113,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "I know I would be more cautious around slow moving animals simply because it annoys me so much when my tortoises in Planet Zoo get stressed and I check them to see that they're taking the longest route possible to slooooooooowly get past the people and get somewhere quiet. 😂 \n\nAnd yes, I googled it when I read the post and found a bunch of stuff saying they prefer the quiet, including what I assume is the same 2014 study that you read. Zoos used to do a ton of shit that was bad for the animals (and many still do), practices change aswe learn more.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Living in a small room behind glass as OP describes is going to be far more detrimental to their health and stress levels than noise.  (Edit: seriously, this whole set-up, if it were true, sounds horrendous.)\n\nAustralia has many zoos, sanctuaries and rehab centres in which there are no such noise restrictions and in which koalas thrive. Are American zoos spectacularly noisy unless people are otherwise instructed? (Perhaps, given the aforementioned issues with the enclosure described).",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "yea the argument of “koalas in a diff geo location behavior differently” doesn’t rlly hold up well",
                  "id": 116,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "Thanks, from another Aussie. A single baby crying should not disturb the koalas to the extent OP describes. If it does, it seems like this zoo has conditioned them to be used to an unnatural level of silence. As the previous poster said, they often live in suburban areas where people are just living their lives: cars, music, kids playing, power tools, etc. To be fair, they may not appreciate the noise, but they're simply too freaking lazy to do anything about it. About the only time they show any urgency to their movement is when they're mating or fighting about mating.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "I was thinking the exact thing reading this. I also live in Australia and have never seen anyone worry about being quiet for koalas.",
              "id": 118,
              "comments": [
                {
                  "score": 32,
                  "content": ".",
                  "id": 119,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yes yes they are",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Accurate description",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 49,
              "content": "The Edinburgh Zoo literally has this type of set up, with the koala area closed off behind two sets of doors that say please be quiet to not disturb them. And I have been there myself and been annoyed when someone was having a really loud phone call right outside the doors and we could hear every word.",
              "id": 122,
              "comments": [
                {
                  "score": 37,
                  "content": "I believe that living in an environment that is not their natural habitat would have far more of an impact on koalas than someone having a phone call. Honestly, we had one on our back fence a few weeks ago and the kids were playing a few metres from it and it did not give a shit. Just went about it’s business finding a new tree to perch in. They often cross suburban roads (arguably louder than a phone call or baby crying) and people will stop traffic to let them cross then go about their day.",
                  "id": 123,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 39,
              "content": "Thank god I was literally about to send the same comment 🤣 literally seen a koala fall out of a tree give zero fucks climb back up it and go to sleep. A crying baby would be a non issue",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Thank God for some sanity! Ditto, I’ve worked with Koalas and this is nonsense.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Came here to say the same thing. I’ve seen koalas around Australia in the wild and in zoos. They never scurry and certainly don’t have ‘cubby holes’ they hide in. \n\nKoalas crash out in the branches of the eucalyptus trees they are getting high off. An awake koala is a rare and exciting sight!",
              "id": 126,
              "comments": [
                {
                  "score": 7,
                  "content": "Agree that OP is BS, but just to point out that they don't get high off the eucalyptus.  It jist takes a lot of energy to digest/metabolise, hence the sleeping :)",
                  "id": 127,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "I mean I think we are getting into ethical territory. By your reasoning the best protection for them would be to leave them in their natural habitat. Everyone who is in the zoo and the zoo itself is harming these animals.",
          "id": 128,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Except you have several Australians and experts commenting that koalas don’t need silence. Do you think nature is quiet?",
          "id": 129,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 756,
      "content": "What the ever loving fuck.\n\nYTA\n\nI'm an animal scientist and zookeeper in Australia, working exclusively with natives.\nKoalas sleep so much cause they eat food that gives them fuck all energy, on par with pandas in the dumbass animals working towards their own extinction category.\n\nYou're not gonna wake them up with a crying baby. And if you do they'll survive, it's not silent out bush. In fact koalas are loud af when they're looking to get some.\n\nIt's not on you to enforce the rules. It's also a dumb rule, but probably more for the keepers than the animals. You get real sick of kids screaming constantly.",
      "id": 130,
      "comments": [
        {
          "score": 369,
          "content": "Peak echo chamber when I have to scroll this far to find the first correct conclusion.\n\nI handled two of them when I was in Perth for a summer, they don't \"scurry away\", as they literally have the energy levels of me on a molly comedown in my late 20s.",
          "id": 131,
          "comments": [
            {
              "score": 79,
              "content": "Yeah I have had annual passes for a major Aus zoo where I take the kids for a few years now. No signs, outdoors and I don’t recall ever seeing the fuckers with their eyes open.",
              "id": 132,
              "comments": [
                {
                  "score": 91,
                  "content": "Exactly. I mean, they don't run from fucking wildfires, they're certainly not running from a crying baby.\n\nStrong chance is may have ran from his deranged eyeballing look though.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 299,
          "content": "Gotta love all the Aussies coming along with the YTA clearly flagging this fake as story haha, WHAT scurrying and hidey holes?!?! They don't live inside trees, they live ON trees. And I've had to stop to get Koalas off roads several times when they are crossing, even with people standing near them wildly flapping their arms trying to get them to move they don't give a fuck. The quickest I've ever seen a koala move is when the zookeepers were putting fresh leaves out in their enclosure, and even then it wasn't that bloody fast.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 184,
          "content": "God I know.\n\nThis is absolutely not about the koalas. It’s telling that them the complaint is that they spoilt the sister’s “magical” time seeing a koala for the first time.\n\nYou can straight up tell OP is exaggerating by saying the koalas scurried away to hide in a cubbyhole (wtf.)",
          "id": 135,
          "comments": [
            {
              "score": 43,
              "content": "Yeah, the way OP is saying it it sounds like it all happened over the span of a minute or 2 and that they were the only one that gave a shit. \nOP said they're on spectrum so could be more sensitive to sound but I still think they're TA for how they went about it",
              "id": 136,
              "comments": [
                {
                  "score": 18,
                  "content": "Him being the only one had me thinking, too. A room full of people enjoying the koalas and the only one giving side eye was the 19 yr old kid?  🤔\n\nI know nothing about koalas (other than they’re cute, lol) so thank you for all the info! Fascinating\n\nForgot to add that whether or not OP’s story is true (and it ain’t looking like that) any parent who doesn’t remove their crying baby from a situation where that type of situation would be TA",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Rule-breaking can be a big issue for autistic people as well.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Oh 100%\n\nAt my last facility I worked with our NDIS participants teaching them how to look after and interact with the animals and one participant would get very frustrated with the others when they wouldn't pay attention or varied the procedure slightly (for things like cleaning lizard enclosures where you could have some variation without impact on husbandry)\nHe was a sweetheart but spent a lot of time trying to police other participants, so I spent a lot of time reassuring him that it was okay and explaining why it's important to be strict on procedure in some instances but that in others it can be modified to how the person works best",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "I was feeling like I took crazy pill because just last week I took a relative to Lone Pine Koala Sanctuary and they had the koalas out in the open! Lots of families and noise! News to me that Koala need quiet!\n\nAlso, since when do Koala scurry and hide in cubby holes? This is either fake or OP wasn't at a Koala exhibit!",
          "id": 140,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 47,
          "content": "I just saw your comment after posting mine! THIS THIS THIS!\n\nThose fluffy little buggers aren’t “scampering” away from a baby crying 😂\n\nThis post is the fakest, stupidest thing I’ve seen in a while and makes me question if OP has ever seen a koala outside of Blinky Bill.",
          "id": 141,
          "comments": [
            {
              "score": 7,
              "content": "Fuck blinky bill was a great show tho",
              "id": 142,
              "comments": [
                {
                  "score": 5,
                  "content": "Damn straight it was!",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "\"I'm Blinky Bill!! My whole life's a thrill! I do exactly what I want, cause I'm Blinky Bill!!\"",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Mate 100%, OPs never heard a koala in their life.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Legit, this is some of the dumbest crap I've ever read. I've volunteered in a wildlife park in NSW and they really did not give 2 shits, they even have daily keeper talks where there's crowds of noisy kids looking at them lol",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Thank you! I was reading this and all the NTA replies and couldn't make sense of it! Koalas only sleep so much because they basically eat poison 😂 I have been woken up by horny Koalas screaming many times in the middle of the night when I lived out bush hahahaha",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "THANK YOU! Last I checked, children were people. By increasingly limiting them from public spaces, we are only reinforcing that they belong online. Let kids be kids- your adults, hopefully you can deal with that. \n\nUnless, of course, it is truly in the animals best interest to be kept away from children!",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Not related the original post but I vibe so hard in the pandas working towards their own extinction. It infuriates me. I've done some reading on it, it's it true they are capable of eating meat?",
          "id": 149,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 492,
      "content": "YTA for this majorly over embellished and fake story. Koalas don’t give a shit about noise. Most zoos have outdoor koala habitats. Koalas in the wild deal with loud noise all the time. They. Do. Not. Care. \nThey definitely don’t “scurry away”. The koala habitat at my local zoo is very close to the zoo train tracks. They hear a loud ass train all day long. There is no way that a crying baby, separated by glass, is going to bother them. Also, have you heard a koala make sounds? They are loud all by themselves. \nYTA for trying to make yourself sound like a martyr for caring about the health of the koala. If koalas needed quiet to be healthy, the zoo would make sure they had that. But they don’t. Because koalas don’t need quiet. They sleep through anything. \n\nIf you didn’t like the parents with the crying child, remove yourself from the location of the crying child and come back later when it’s quieter. Would it have been respectful for the parents to move the crying child out of the building? Sure. But you could have just as easily removed yourself. Or made this “AITA for saying something to parents with a crying child at the zoo?” The koalas have nothing to do with it. Zoos are public and parents with crying children have just as much right to be there as you do. \nAlso, if you want a quiet experience at the zoo, see if your zoo does quiet hours. Ours does, specifically for people who like a quieter experience. They turn the music off, reduce the lighting in a lot of buildings, and have staff in all buildings to keep the noise level down.",
      "id": 150,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 420,
      "content": "Lol YTA for this bs post. Every Australian will tell you the idea that koalas need quiet is laughable. Also, if you saw an animal scurry, it wasn't a koala\n🤣🤣",
      "id": 151,
      "comments": [
        {
          "score": 102,
          "content": "Truly - like f**k do Koalas need quiet.  Those little pricks sleep no matter what's happening, until you're trying to sleep and they start feeling sexy and making some God awful noise of their own.\n\nAnd \"scurry\"? Tell me you've never seen a koala without telling me you've never seen a koala.\n\n\nNow, if OP were talking about platypusses I'd understand\n...",
          "id": 152,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "A koala's mating sound also sounds like a demon exorcism, they're not quiet lol",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Clearly less about the animal and more about how OP hates kids",
          "id": 154,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Dying at that last part",
          "id": 155,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 265,
      "content": "[deleted]",
      "id": 156,
      "comments": [
        {
          "score": -1,
          "content": "They actually CAN scurry, but only briefly and rarely.  Also, if you've seen one moving quickly, it's hilarious.",
          "id": 157,
          "comments": [
            {
              "score": -6,
              "content": "[deleted]",
              "id": 158,
              "comments": [
                {
                  "score": 14,
                  "content": "Yeah, clearly I wasn't talking about traumatic incidences that nobody would find hilarious, but things like one koala scurrying to threaten another one away from a female, or trying to get to someone's camping food.  Want me to break it down further? Of course a koala scurrying to camping food isn't hilarious be ause it means that some campers are leaving food available to them and they're learning poor habits that undermine their natural tendencies that therefore threaten their survival.\n\nIf you've ever seen a koala scurry for completely normal and natural reasons, it's hilarious.",
                  "id": 159,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 264,
      "content": "I find this story perplexing. Koalas have been kept at the San Diego zoo for almost a hundred years and they have a thriving breeding program. The exhibit is open air and not at all quiet.",
      "id": 160,
      "comments": [
        {
          "score": 168,
          "content": "It’s perplexing because it’s bullshit.",
          "id": 161,
          "comments": [
            {
              "score": 36,
              "content": "I was trying not to get banned. ;) The mods of this sub can be reaaaaalllllly touchy, in my experience.",
              "id": 162,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Ok. But for real I did go to the zoo the other day and there were drunk dads everywhere screaming at the animals.  I am pretty sure a hippo just stayed in the water, even after his keeper fed and called for him, because of the screaming.",
              "id": 163,
              "comments": [
                {
                  "score": 6,
                  "content": "Oh I absolutely agree that people shouldn’t upset the animals in a zoo or wildlife park, and they should leave if their children are making too much noise.\n\nI just don’t think that’s what happened here.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 201,
      "content": "NTA. It’s a quiet space for a reason. Good for you for standing up to them",
      "id": 165,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 200,
      "content": "Something is wrong with this story.  This is not how koalas behave.\n\nThey don't scurry and hide.  They sit in their trees and sleep.  Any movement would be slow.\n\nSeen koalas at the zoo plenty of times (I'm Australian), and our zoo has an open air enclosure.  We'll be on a boardwalk a few feet away from the tree a koala is in, and it will take absolutely no notice whatsoever of any noise near it.  Through a glass window?  Absolutely no way.\n\nI've been a parent on school excursions, and seen koalas completely ignore the twenty 10 year olds near it, and believe me, they aren't quiet.\n\nI've also never seen any signs up telling people to be quiet near the koalas.",
      "id": 166,
      "comments": [
        {
          "score": 30,
          "content": "Yeaaaaah...story is fake.",
          "id": 167,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}