{
  "post content": "Sorry for any grammatical errors or formatting problems I’m typing on mobile. \n\nSo my birthday is tomorrow and I’m inviting some friends tomorrow to play smash ultimate. I really wanted this party to happen since last year my mom randomly signed me up for a weekend camp trip last year during my birthday weekend without telling me (I can post that story in the comments if someone wants to hear it). She just told me my dad invited one of his friends kids who’s around 10 years old.The kid decided he wanted to do stay the night and my dad said yes. So I don’t like surprises and I just want to be told things in time and not right before. They agreed on this yesterday and are just telling me today. Honestly I’m not against him staying the night I just don’t like how he just decided he wanted to and just is coming and that I don’t have a choice. I even asked if the friends I invited could stay the night too, and my mom said no.  \n\nAm I the a hole??\n\nEdit: I didn’t expect this to blow up like this . \nAnyway here’s some answers to some questions.\n\nI’m 14 turning 15 \n\nMy mom says I’ve seen this kid before, but I feel like it’s in the sense of that Aunty that changed your diaper when you were 1 year old that you don’t remember.\n\nI asked my mom if we’re cousins that I maybe didn’t know about . She said no.\n\nApparently my mom gives my old clothes to him . \n\nI don’t think I’ll stand up to my parents. Maybe if I were older and had something to fall back on.\n\nMy dad said the kid is staying because his mom wants to go to church and they live really far so it’s just easier to stay the night.\n\nThis isn’t the first time they pulled something and didn’t tell me. Around Christmas time my mom signed me up for volunteering at a Christmas play and she didn’t mention it until we got in the car.  We were there for 5 minutes and they didn’t mention we were doing this as a family. The Christmas play was late night and really long so it wasn’t what I wanted to do on my Saturday night. I guess they realized they were in the wrong and didn’t make me go.\n\n\n\nEdit 2:  Hey guys I’m back . I’m gonna tell you about my birthday party. So of the 5 people I invited only 1 came and the 10 year old. We had a good time laughing and stuff and I’m pretty friendly with the 10 year old now. The friend left around 15 minutes and we’re just here watching  American idol. I guess I became friends with him.",
  "id": 1,
  "comments": [
    {
      "score": 3837,
      "content": "NTA, it's your birthday and you should get to choose who's coming over",
      "id": 2,
      "comments": [
        {
          "score": 752,
          "content": "Yes. You're not the asshole here, dad is at least sort of.\n\nEven if we imagine a hypothetical where the kid *has* to go over to your house because of some sad circumstances, the way your dad communicated this was pretty disrespectful of your feelings.\n\nObviously it's your party, you care who's there. He could have talked to you about this like it would be something you'd care about. ",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 168,
          "content": "I would even go as far as saying they can cry if they want to.",
          "id": 4,
          "comments": [
            {
              "score": 123,
              "content": "He could even leave the 10 year old behind. Cause his dads friend don’t care, and if he don’t care, then his kid’s no friend of mine",
              "id": 5,
              "comments": [
                {
                  "score": 25,
                  "content": "I sang it",
                  "id": 6,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "fire",
                  "id": 7,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "[You would cry too, if it happened to you.](https://www.youtube.com/watch?v=bbOrjHBaDzQ)",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "But can he dance? Can he dance?",
                  "id": 9,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "well played. ",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "I mean, we have no idea why the dad is looking after the kid.            \n\n\nFor all we know his mum and dad are doing a massive last minute thing for a friends kid, which could be important. Definitely NTA, but I do think there is a bigger picture here.",
          "id": 11,
          "comments": [
            {
              "score": 65,
              "content": "I said the same exact thing. I think OPs dad is doing a favor for his friend by watching the kid and it really has nothing to do with the party.  The dad just kind of spun it that way, quite possibly to protect the kids from the truth.",
              "id": 12,
              "comments": [
                {
                  "score": 53,
                  "content": "Yeah, but spinning it as \"I decided this child gets to come to your birthday and stay for 12+ hours\" is making yourself sound like a dick.\n\nIf that's what's happening, dad needs to phrase it better. Because currently he's making it seem like he just doesn't notice or care that OP would have an opinion about this. ",
                  "id": 13,
                  "comments": [
                    {
                      "score": 16,
                      "content": "He was probably *trying* to make it sound fun,  maybe not understanding that his son would feel this way about it. Or how it would come across. Like \"this kinda stuff worked when he was younger, why wouldn't it work now?\"",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Hijacking the top comment simply to say that I love these wholesome AITA threads.  Kind of a nice change from the usual assholery that goes on around here.\n\nCarry on.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "My birthday when I was turning 16 my dad's boss was in town and my parents invited him to dinner. So my birthday dinner was super awkward and I was pissed off the whole time.",
          "id": 16,
          "comments": [
            {
              "score": 2,
              "content": "[deleted]",
              "id": 17,
              "comments": [
                {
                  "score": 7,
                  "content": "No this was more of a family dinner on my actual week night birthday with my favorite food & cake. Celebrated with friends that next weekend, but I was still pissed about feeling uncomfortable and like I had to watch my behavior for my birthday dinner!",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1567,
      "content": "[deleted]",
      "id": 19,
      "comments": [
        {
          "score": 1079,
          "content": "I have to disagree. They're within their rights to not allow his friends to sleep over, but not to choose a random friend to sleep over without even consulting the son. Maybe he doesn't want him there, or didn't want anyone to sleep over. ",
          "id": 20,
          "comments": [
            {
              "score": 473,
              "content": "If we’re talking about “rights”, they absolutely have the right to decide and even pick who stays in their home.\n\nBut let’s back up. We don’t know the full story, we’re just getting it through the perspective of a kid. What if the dad’s friend is going through some serious family crisis and needs some help with their son? Telling the daughter the true reason would risk letting the guest boy know, which could have been expressly against the wishes of that kid’s dad.\n\nAnytime you hear a story where it seems obvious that the other party is an asshole, it’s quite likely that you’re only viewing half of it.",
              "id": 21,
              "comments": [
                {
                  "score": 146,
                  "content": "Being an asshole is not just about if you’re legally in the right though, this sub always gets stuck up on that.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 38,
                      "content": "I’m not the one who used the word “rights” though.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 30,
                  "content": "the guy's 14 turning 15 he's mature enough not to tell that to anyone and they could just say \"they're having problems\" without mentioning them",
                  "id": 24,
                  "comments": [
                    {
                      "score": 40,
                      "content": "We don’t know him, though. Some people can keep a secret at age six, some people are 50 years old and still blab everything they hear. The dad was inconsiderate in how he told his son the friend’s child was coming over, but he could still have a good reason for keeping the details of why the kid is there a little quiet.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "So if a parent asks you not to tell the kids you should disrespect that and immediately tell your kid? No, the issue wouldn't be OPs drama it would be the friends drama, it's not up to OP to choose who that's shared with. In situations like this the person in OPs shoes are usually being asked because they don't have a more conspicuous option and they're replying on you to make sure their kid doesn't find out yet. That includes not telling your kid.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Aww.. No they aren't.\n\nI'm going to assume you yourself are of high school age. ",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "I guess you know the kid better than their own father. Who would have thought.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Fair enough, but the information we're getting is coming from OP. If the parents don't want to explain their reasoning, they're just being assholes and forcing their kid to do something he didn't want.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Or they’re respecting the wishes of a friend who doesn’t want their kid to find out. If we’re guessing, at least think of possibilities on both sides.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Have you ever lived with parents before? Most of a kids life is doing things they don't want to do.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Yeah. I could see this being a thing if there's something going on with the kid. Maybe the dad knows the kid might need a little time with other kids. Sometimes kids just need to be included, even in an awkward situation to get a little more confidence. ",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "OP edit add-on:\n\n> My dad said the kid is staying because his mom wants to go to church and they live really far so it’s just easier to stay the night.\n\n\nSo, yea, looks like the kid is staying for a different, valid reason and OP is just mad.\n\n",
                  "id": 33,
                  "comments": [
                    {
                      "score": 4,
                      "content": "What? Did you even read the first part? He literally says he didn't mind.\n\n> Honestly I’m not against him staying the night I just don’t like how he just decided he wanted to and just is coming and that I don’t have a choice.",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I completely agree with you, however, wouldn't it have been the right thing to do from the parents' part to at least speak with their child and explain the situation to them? \n\nFrom OP's post I figure they're at least older than 10, so they should be able to understand that the friend's kid must stay over because of said issues, it could have even been educational for OP (teaching your kid the right thing to do etc.).\n\nThe way their parents handled it just seems inconsiderate imho.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "[deleted]",
              "id": 36,
              "comments": [
                {
                  "score": 48,
                  "content": "Just because he bought the house doesn’t mean he can decide everything. It’s his son who lives there too, not a tenant and it’s his birthday too. His parents are kinda TA.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 64,
                      "content": "[deleted]",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "Yeah it does. You listen to your chikd's opinion and concerns and make a decision. I think mom is a ahole for not allowing his friends to stay over. Im on the fence about dad. Perhaps he thought his group of friends were going to stay and figured one more kid isnt going to matter and made plans. Or maybe he has theiving or disrespectful friends. Dont know the entire scenario. ",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "Yes he decides. His decision still makes him an asshole. The two are not mutually exclusive.",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Weird rule. Just because its his house doesn2mean he can just do as he pleases. Thats how a tyranny is started",
                  "id": 41,
                  "comments": [
                    {
                      "score": 14,
                      "content": "It's a house; not a country. He's not cutting OP's water rations or restricting his fridge rights. If anything, the father probably has his reasons. OP doesn't have the full story as there's no indication as to why this other 10 year old kid was even invited, so passing judgement at this stage towards either party is very presumptuous. ",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Reddit is very serious about this. There was once a young woman whose mother's boyfriend was dictating what she wore. The subs response - \"your moms house, her rules\". ",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Government tyranny is wildly different from an adult who owns the house deciding what goes on inside said house and not a teenager... ",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "That’s exactly what that means though. ",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My take. Dad's just trying to help his friends kid be around other kids. Not that weird and to a degree understandable. This has happened to me when I was kid countless times but it was usually younger family members being invited over when I didn't do it and what not. ",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "That presumes that the kid is there solely for OP.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "The soon has no obligation to entertain the kid though",
              "id": 48,
              "comments": [
                {
                  "score": 5,
                  "content": "Yeah if the parents are going to expect him to play host and spend his own birthday entertaining this strange kid who's 5 years younger, they're the assholes. \n\nParents better be prepared to play boardgames with him.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah, very much. If you're having a bunch of friends your age come over a kid (assuming that 10yo is at least 3-4 years younger) a much younger kid isn't gonna do anything except be annoying.\n\nAnd especially if some random kid gets to sleep over but not friends?\n\nParents are the assholes here.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "do you have preteen kids?\n\nthey have no rights. but you should still treat them like little adults and run this kind of stuff by them. ",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I don't think the kid sleeping over actually has anything to do with the party.  I think the dad just kind of worded it that way since it was an easy excuse.  Sounds to me like OPs dad is just watching his friends son as a favor and didn't want to tell the kids why to protect them.  More is going on here that the kids don't know in my opinion.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It's the dad's house, but it's also the kid's home. I kind of feel that there needs to be a certain amount of consideration given to the fact that when you have kids, you effectively make your home their home.  They can't go and get their own home from a practical and legal point of view, so they are stuck living with the parents. Kids are people, with their own needs and feelings, and when you bring a child into the world and thus into your home, you should recognise that it was your actions that put them there. They don't have a choice because they are your dependants, and you should take responsibility for not shitting on their emotional wellbeing just because you're old enough to have a paycheck and therefore have all the power. </probablyunpopularopinion>",
              "id": 53,
              "comments": [
                {
                  "score": 2,
                  "content": "Absolutely agree. ",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "> not to choose a random friend to sleep over without even consulting the son.  \n  \nlol the kid has NO rights to who comes and goes.  Doesn't pay taxes, isn't an adult... sorry, just no.  ",
              "id": 55,
              "comments": [
                {
                  "score": 19,
                  "content": "This isn't a law subreddit, it's about ethics and who's an asshole in the situation. You can be acting well within your rights and still be an utter douche bag about it",
                  "id": 56,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Fair point, but in this situation, the parent doesn't need to forfeit control of the house to avoid being an asshole.  The kid is being unreasonable and thinking that a birthday makes him \"king for a day\".  Sorry, I don't have any sympathy for kids making absurd demands \"just because\" they want it that way.   \n  \nSide point:  the person I responded to specifically was talking about being \"within their rights\".  ",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I disagree.  \n\nIt is his house, so, yes, the Dad is perfectly ok to have the kid over. Maybe he's babysitting as a favor to his friend or there was an emergency or something. Maybe he found out that the kid liked smash and felt left out of the party. What makes him TA is that he's making OP include the kid (forwhatever reason) without asking, explaining, or even simply acknowledging that this is a sacrifice for OP and thanking him for doing it  - especially on a night when he already had plans. \n\n&#x200B;\n\nOP is turning 15, having a 10 year old at the party is going to change the whole dynamic of the group. I get that sometimes things happen and there are no good options, but as a parent it's your responsibility to teach your teenager about these situations and how to handle them as a grown up. \n\n&#x200B;\n\nSomething as simple as \"I know this isn't something you want, and it's ok that you're unhappy about it, but this is our only option for that night. If you can do us this favor by including \\[kid's name\\] on your birthday you can have your friends over for a sleepover \\[future date\\]\" would go a long way.\n\n&#x200B;\n\nAnd if he's only inviting the 10 year old to keep him from feeling left out, I'd argue that he's not really doing the kid any favors by forcing him on a group of high schoolers who probably don't want him there.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "Why do people say this over and over “my house, my rules” to their kids?\n\nWhat an asshole perspective. Of course it’s your house, but it’s also your kid. It’s a real dick move to pull that card because it’s essentially saying “what you think is irrelevant”...\n\nWhich is BS. You have substantial obligation as a parent to feed, clothe and shelter your child. Doing those basic things doesn’t mean your child is your property though.\n\nThe dad is welcome to give proper rationale - “my friend wanted his son to stay over, we can only host one kid” etc. that’s decent parenting and my dad has certainly said no before and given me reasons why.\n\nJust saying “my house my rules” is terrible.",
          "id": 59,
          "comments": [
            {
              "score": 26,
              "content": "Agreed times a billion. I HATE that mindset. Fucking duh it will NEVER be the child’s house in any scenario, so just fuck whatever the child thinks then? Hell no. If dad wants the 10 yr old over, dad can hang out with and entertain the 10 yr old ",
              "id": 60,
              "comments": [
                {
                  "score": 24,
                  "content": "The parents own the *house*. But it should be the kids' *home* just as much as it's the parents'.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 8,
                      "content": "It's my house, but our home.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "thank you for this im getting so irritated reading this my house my rules BS. OP appears to be a well spoken teenager who just wants to be communicated with. Parents don't seem to realize kids go through stages of growth and development, he's at an age now where he should start being part of this kind of decisive making especially on such an important day! \n\nYou can't treat your kids like toddlers who can't question your authority all the way up to age 17 then on their 18th birthday expect them to pop up, with fully developed critical thinking and reasoning skills. Those things are taught and developed. How? By starting in childhood and slowly giving them more responsibility, explaining your reasoning instead of saying \"because I said so!\", and including them in decision making. \n\nAs a kid I also got mega pissed when told last minute about things and still do as an adult. Happy Birthday OP!",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 53,
          "content": "Just because his dad can do something doesn’t mean he should.",
          "id": 64,
          "comments": [
            {
              "score": 29,
              "content": "[deleted]",
              "id": 65,
              "comments": [
                {
                  "score": 21,
                  "content": "Then why is his dad also NAH?",
                  "id": 66,
                  "comments": [
                    {
                      "score": 12,
                      "content": "[deleted]",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Sounds like his parents just signed themselves up to babysit the 10 year old after the party. Either that or they pay OP for babysitting the 10 year old. ",
          "id": 68,
          "comments": [
            {
              "score": 5,
              "content": "If they make him babysit on his birthday then it’s double the fee!",
              "id": 69,
              "comments": [
                {
                  "score": 4,
                  "content": "Lol make it a win win! I think OPs dad did sign up to babysit the kid honestly and this has nothing to do with the party.  It seems to me like he is doing a favor for his friend and just spun it as the kid wants to go to the party to avoid further questions. More is going on here in my opinion.  ",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "What is the difference between being an asshole and being inconsiderate ",
          "id": 71,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "You can be within your rights and still be an asshole. Not telling someone this in advance when they effortlessly could have is plain inconsiderate behavior, typically deeming of the asshole award here ",
          "id": 72,
          "comments": [
            {
              "score": 3,
              "content": "I just think there is a difference between inconsiderate and asshole ",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Yeah it's his right because it's his house, but that doesn't mean his parents aren't assholes.  You mean to tell me they couldn't prioritize their own kid over a stranger for one night?\n\n&#x200B;\n\nParents are the assholes here.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 922,
      "content": "Wait a minute...\n\nWhy is your dad hosting a sleepover party for someone else's kid? Like... Its not his kid. Nor are the kids that kid is inviting. And you are not friends or same age range as those kids....\n\nThis is sketchy scenario. Your dad is weird.\n\nAll while your birthday is happening the same night? \n\nEdit: its only just the one 10 year old (no extra friends of his)... Which makes it even weirder. Given that lone 10 year old is not friends with op and is sleeping over by himself for OPs dad.... On ops birthday... Against ops own request for his actual friends sleeping over.",
      "id": 75,
      "comments": [
        {
          "score": 813,
          "content": "I don't think he's saying it's a sleepover party. Just that the one kid is sleeping over. My guess is that the dad's mate needed a sitter and the dad offered to have the kid come to his place or something. Really not that weird. ",
          "id": 76,
          "comments": [
            {
              "score": 83,
              "content": "The kid is the one who asked OPs dad to sleepover.\n\nSomething is off here.",
              "id": 77,
              "comments": [
                {
                  "score": 268,
                  "content": "We maybe had very different upbringings lmao. If I knew I was already going over to someone's house and they had kids that I liked/thought were cool I'd often ask to stay over. I'm really struggling to decipher the creepiness you're seeing here. ",
                  "id": 78,
                  "comments": [
                    {
                      "score": 92,
                      "content": "[removed]",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 42,
                      "content": "The kid has no relationship or friendship with OP.\n\nOP is a teenager.. The kid is 10 and is clearly stated by OP (the teenager) that the 10 yr old is son from a friend of OPs dad.\n\nThe 10 year old is also the one who asked to sleepover after being there already and ops dad approved (did he consult the 10 yr olds dad?) ... All the while on his actual sons birthday.... Which is a completely different social group (these kids arent friends)\n",
                      "id": 80,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "You’d ask the parents if you could stay over? Not the kid? Damn, that’s weird.",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "Eh I know a lot of kids that’d hear about this party and beg to sleepover. Sleepovers and video games are super exciting for kids. \n\nSource: I’m a nanny",
                  "id": 82,
                  "comments": [
                    {
                      "score": 9,
                      "content": "But then OP's mother canceled everyone else coming over. \n\nIt's not that they made him hang with the kid, that's lame but not terrible. It's that they made him cancel his prior plans to do it instead of just including the kid a bit. ",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "OPs dad is definitely just watching the kid as a favor to his friend.  It has nothing to do with the party at all. There is most likely a reason the kid needs to be watched and the parents do not want to tell them why to protect the kids so they used the party as an excuse. This isn't creepy at all.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Maybe it's a cultural difference, but my mom would have given me so much shit if Kid Me essentially invited myself over to someone's house or asked to stay longer than the agreed time of the visit, barring our house burning down or something. To her (and me), it's imposing and rude. ",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Where did you get that info from? I didn't see it in the post.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 2,
                      "content": "He edited the original post",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Yea I was thinking that too and I’m surprised at all the NTA comments, I mean you can’t always get what you want etc etc and he’s still seeing his friends. I guess it’s not being an asshole in a technical sense though",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 63,
          "content": "Love this rush to judgement without knowing the full story. What if the other father had serious personal or familial issues to handle and asked for some discreet help? That seems entirely plausible, and it’s just one example.\n\nAnd you’re totally misreading the post. The kid was invited over *for* the birthday party. It’s not just him and the dad hanging out.",
          "id": 89,
          "comments": [
            {
              "score": 7,
              "content": "Yeah NAH. I dont think the dad asked the kid to stay rather the other way around. And if there is already a party going on it is easier for the dad and everyone since there is a lot of people.\nIt will be weirder if it was just op and the 1pnyear old kid. You cant pay him 0 attention is there is more poeple there",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yeah but from the perspective of the 14 almost 15 y/o posting this would be sucky regardless of parents reasonings and OP is definitely not being the ass hole. ",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 42,
          "content": "[deleted]",
          "id": 92,
          "comments": [
            {
              "score": 15,
              "content": "I think you're right. I wouldn't just jump to the conclusion that OP's dad is weird, but there's likely circumstances around this OP is not privy to",
              "id": 93,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Yeah. Thats all I can think of regarding the 10 year old.\n\nTo put that much effort over OPs actual friends for that kid to sleep over is suspect.\n\nHope it works out fot the lil guy.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "Ever heard of babysitting? ",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "You’re reading way too much into this. Sounds like the Dad is just clumsily trying to do something nice. ",
          "id": 96,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "I mean based on OP's edit it sounds like his dad is just doing the family a favor and watching their kid for a night. ",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Feels like youre accusing this kids dad of being a pedo...",
          "id": 98,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 668,
      "content": "Sooooo.... this will probably end up you being an unofficial babysitter on your birthday. 🤔 Update us if that's what happens. ",
      "id": 99,
      "comments": [
        {
          "score": 184,
          "content": "Alright sure ",
          "id": 100,
          "comments": [
            {
              "score": 111,
              "content": "ask your mom why the rest of your friend's cant stay or better ask your Dad it's your birthday. ",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "RemindMe! 2 days",
              "id": 102,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "RemindMe! 2 days",
          "id": 103,
          "comments": [
            {
              "score": 6,
              "content": "I will be messaging you on [**2019-02-17 17:29:33 UTC**](http://www.wolframalpha.com/input/?i=2019-02-17 17:29:33 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/AmItheAsshole/comments/aqwgtf/aita_for_being_upset_at_my_dads_friends_son_for/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/AmItheAsshole/comments/aqwgtf/aita_for_being_upset_at_my_dads_friends_son_for/]%0A%0ARemindMe!  2 days) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! egjiop2)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|",
              "id": 104,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "is it weird to be friends with someone that young,\ni mean my brother and i are close and we are 5 years apart and i am friends with someone 4 years younger than me(for reference i am 14)",
          "id": 105,
          "comments": [
            {
              "score": 2,
              "content": "Not weird at all.",
              "id": 106,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 324,
      "content": "NAH except for your mom also I’m down to hear the other story ",
      "id": 107,
      "comments": [
        {
          "score": 609,
          "content": "Last year my plan for my birthday was to watch black panther and relax for the rest of my 3 day weekend. For some reason though, my mom signed me and my dad up for a camp thing. I was upset but she told us it was like a thing at a hotel so I thought it wasn’t so bad. The day of we go to the church and just see a school bus waiting there so I wasn’t really enthusiastic.  We bought other stuff like water jugs and sleds. Somehow I didn’t put together that you don’t bring jugs to a hotel. We rode for hours and just stopped to get burgers. When we got there finally it was night and we had to walk to our cabin. Keep in mind we live in Michigan and it was really icy and dark. We got there and they told us to walk to the cafeteria which was the other side. Along the way we fell from walking into a random haystack just there. \n\nOnce we got there they started a speech about god or something and were there for what felt like eternity. We left,we went to bed on our leather bunk beds, and tried to sleep. We did a bunch of random crap I don’t remember but I do remember some of the worse things. The event itself was a thing for dads and little kids. I was the only teen there. When we tired to sleep they’d run in screaming like every 30 seconds. My dad fell multiple times in the ice and was limping around. I hurt my foot while getting up on the top bunk. The beds were really uncomfortable. No shower or fresh water. We always had to walk to the cafeteria in the ice multiple times a day. \n \nOne kid tried to steal my phone. No WiFi so I couldn’t connect with anyone.  We rode in the bus so we couldn’t just leave.\n\nAll this while my mom and grandma had the time of their lives. ",
          "id": 108,
          "comments": [
            {
              "score": 498,
              "content": "So your mom lied to you about the \"exciting\" birthday weekend plans she made for you without your knowledge, clearly knowing you wouldn't have been hyped. Basically her birthday gift to you was a weekend alone for herself without you, how sweet.",
              "id": 109,
              "comments": [
                {
                  "score": 342,
                  "content": "Yeah she just kind of signed me up without thinking twice\n \nEdit: it is important to mention though that I got to watch black panther before I went",
                  "id": 110,
                  "comments": [
                    {
                      "score": 323,
                      "content": "Your parents seem weird as fuck. Did they learn their parenting skills from Timmy's fucking mom and dad on Fairly Odd Parents? \n\nI don't know how old you are, but life is gonna be hard as fuck for you as you become an adult and they're gonna be the reason. Put in the work now so you can be ready to move out ASAP when you're old enough. If you're still in education, put your life on hold for a while and get the best grades you can.",
                      "id": 111,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 49,
                      "content": "Your parents sound like the unhinged parody of parenting you get on most 90s cartoons. ",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Oh don't believe that shit. That was a calculated decision.",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Seems to keep happening for her to not think about it. It's like you're just an extension of her. \n\nEta: not a fan of your dad either imo he's lying.\n\nYou're Nta.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yeah, what a cunt!",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "It was a father/son activity.... ",
                  "id": 116,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 89,
              "content": "That’s awful man. I can relate to that story a lot though since I got sent to camps like that throughout my child hood even though I repeatedly told my parents I didn’t enjoy them or believe in god",
              "id": 117,
              "comments": [
                {
                  "score": 84,
                  "content": "That last part is probably why they kept sending you, you weren't indoctrinated enough",
                  "id": 118,
                  "comments": [
                    {
                      "score": 45,
                      "content": "Yup that’s correct. Had to continue to shove it down my throat ",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "I'd say judging by these two stories that you and your dad are NTA, but mon is TA",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "My mom used to sign my sister and I up for camping trips without our knowledge. It was with the girl scouts, and luckily, we had the time of our lives. We would always be bummed out at first because it was unexpected and not what we planned for ourselves.\n\nYour situation, however, really sucks. It kind of reminds me of a comedy plot or something. Mom signs hubby and son up for \"exciting\" camping trip where everything that can go wrong, does. Mom stays home and has a blast. This had me lmao.\n\nI'm sure your mom expected it to be fun for you.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "This sounds horrible. And on your birthday? If this is your moms idea of a good time, why didn't she go?",
              "id": 122,
              "comments": [
                {
                  "score": 40,
                  "content": "It was a father son thing at our church ",
                  "id": 123,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Sounds horrible. I would refuse to go but that's me.",
                      "id": 124,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "Your Mom is a liar. You know that now and not to trust her. Normal patents consult thier children on decisions like these, not just spring upon them as surprises.",
              "id": 125,
              "comments": [
                {
                  "score": 5,
                  "content": "The mom sounds like she may be the selfish type who arranges things for other people to do because it will be good for them, when really it's  good for herself to have some alone time. Last year she got rid of two birds with one stone. This year the birthday \"party\" is a mandatory babysitting job. Maybe next year OP's parents will let him bake a cake and do a little yardwork.",
                  "id": 126,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Your mom is TA",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "So... yeah, you're parents are coming off as pretty weird... actually as very dismissive of you and your wants and needs. Meanwhile, catering to this 10 year old boy you don't know who asked to-then was immediately allowed-spend the night at your house for your birthday while your friends were barred from doing so.\n\nI just do not get why your parents, especially mother, has this pattern of just trying to get rid of you during birthdays and holidays. \n\nWhy does it feel like you are going to find out in 3 years that you are adopted, and that the 10 year old was actually your mother or father's illegitimate child that you 'should remember' from when you were 4 or 5 and there was drama kept away from you.",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "That sounds like a pretty shitty time. But hey. Now youll always have that one time you went to a horrible camp with your dad for your birthday\n....give it a few years and itll be a story that's funny in hindsight",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You’re going to turn 18 and really distance yourself, and I guarantee your parents won’t have any idea why. My parents were never on my side either dude, so I feel you. ",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "“Hey Bill, is it ok if little Bobby stays over at your place on Friday?”\n\n“Ah, would like to help out, but it’s my daughter’s birthday and she’s having a party. I wouldn’t want to spring that on her.”\n\n“Here’s the thing Bill.. you’re one of the only close friends I have. My wife might have cancer. We need to drive out of state for a second opinion, and the appointment is first thing in the morning, so we need to travel the night before. We don’t really know if it’s serious, so we want to avoid scaring Bobby if it’s not necessary. I want to keep things quiet. Really sorry to put you in this position, but we really could use some help.”\n\n“Jesus Harold Fuck Bill, I’m so sorry. Yes, of course, he can stay. My daughter will be a bit confused, but I know she’d want the same thing. I won’t tell her since she’s a little young to be trusted with secrets. Best of luck to you and your wife. The party starts at 3, feel free to bring Bobby by at any time before then.”",
          "id": 131,
          "comments": [
            {
              "score": 28,
              "content": "You're not the only one thinking random normal/abnormal scenarios",
              "id": 132,
              "comments": [
                {
                  "score": 18,
                  "content": "Given what little information we have from OP, there's tons of space to speculate.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "What if\n\n\"Hey Bill, is it ok if little Bobby stays over at your place on Friday?\"\n\n\"Ah, of course dude. Totally ok\"\n\n*A few hours later*\n\n\"Oh dayyum. My daughter's birthday is at Friday. I totally forgot. But I can't tell my close friend \"Hey dude.. I know I said little Bobby can stay over my place place but he can't because my daughter's birthday is on friday...\" soooo nevermind. She'll be ok with it.\"",
              "id": 134,
              "comments": [
                {
                  "score": 2,
                  "content": "Yeah, you’re right, we don’t have enough information to know whether the parent was being an asshole. Thanks for helping to prove the point.",
                  "id": 135,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "OP's a guy tho...",
              "id": 136,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 254,
      "content": "INFO  \nI want to make sure I'm understanding this right.  \nSo you're dad invited his friend's son to your birthday party.  \nFriend's son will be at the party with you and all of your friends.  \nBut when everyone else leaves, it becomes a birthday sleepover with just you and friend's son?  \nAlso, how old are you? Just asking since we know his age but not yours. ",
      "id": 137,
      "comments": [
        {
          "score": 156,
          "content": "14 turning 15",
          "id": 138,
          "comments": [
            {
              "score": 126,
              "content": "Was my summary about accurate?",
              "id": 139,
              "comments": [
                {
                  "score": 138,
                  "content": "Pretty much ",
                  "id": 140,
                  "comments": [
                    {
                      "score": 244,
                      "content": "then that's super weird. It's crazy that your parents think ninth-graders want to hang out with a fifth grader, or even that the fifth grader would enjoy being there.   \nAT the very least, point out to your parent show weird it is that you'll be having a sleepover with only one other person and that it's the one you know the least and are the furthest from in age. If he's going to be sleeping over, all of your other friends should be invited to.   \nNTA. It feels like your dad pities his friend's son and is trying to make him feel better using your party. ",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "INFO - are you required to spend time with this kid while he's over? Or can he crash on the couch while you spend the night on your own then sleep in your own room? \n\nI think it's pretty terrible if your parents refuse to let your friends spend the night AND force you to spend your birthday night with someone you aren't close to. NTA.\n\nBut if it has nothing to do with you except the timing, well, your parents explained it in a very assholish way but I'd say NAH overall. Especially if there's a reason they aren't telling you about why they need to look after the kid.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 148,
      "content": "Wat so you dont get your friends over for a sleep over on your birthday, but this kid gets to stay because the dads are mates. Totally ok to be a bit pissed of.",
      "id": 143,
      "comments": [
        {
          "score": 26,
          "content": "The adult side though is likely there's something going on in dad's friend's life that the kid needs a place to stay.  I think it comes across weird because it coincides with the birthday party of OP.\n\nNot that it's something OP is going to know about and it sucks to have to be the functional safety net for something not OPs fault, but this screams to me that there's shit going down in Dad's friend's life.",
          "id": 144,
          "comments": [
            {
              "score": 7,
              "content": "Ditto this. My first guess is that there is more backstory on the dad‘s friend’s situation. \n\nSecond though was that dad’s want to get drunk or high and don’t want to worry about childcare and want to pass the kid off to hang out with other kids. ",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 97,
      "content": "OP how old are you?\n\nIf you are less than about 14 then I completely get why you are pissed...\n\nIf you are almost an adult then it's kind of a different story, having a single 10 year old kid sleep over as a favour for a friend isn't quite the same as hosting half a dozen late teens. ",
      "id": 146,
      "comments": [
        {
          "score": 114,
          "content": "He said he's 14 turned 15 in another comment. His parents make no sense lol.",
          "id": 147,
          "comments": [
            {
              "score": 4,
              "content": "He also said his mom gives this kid his old clothes. Possibly this is a kind of charity (or at least helping out a friend that's struggles a little financially). I dunno I think NAH. Kid stuff is weird and I get being frustrated that your parents are forcing you to socialize with someone that's not your friend and is even younger than you but I don't think this qualifies as \"asshole\" behavior.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 80,
      "content": "NTA\n\nr/raisedbynarcissists may be of help, that camp story raises some alarm bells",
      "id": 149,
      "comments": [
        {
          "score": 50,
          "content": "And here it is. Every single thread that has to do with a parent someone has to play armchair psychologist and call them a narcissist. ",
          "id": 150,
          "comments": [
            {
              "score": 17,
              "content": "I agree with you and used to follow that subreddit until recently. There is A LOT of armchair psych going on. Narcissim is a spectrum of behavior that is probably displayed by everyone at some point but also a legit psych disorder in other cases. But it becomes real easy to just slap diagnoses on everyone that does something unhealthy. It's a matter of degree, consistency, etc. \n\nThat said I think the parents have illustrated they are woefully inconsiderate of their son's wishes and that is something worth being frustrated about. So - here are some related adjectives that could describe the behavior given we don't know the motive: aloof, inconsiderate, self-focused, stupid, misguided, passive-aggressive, neglectful, tactless. Narcissistic could be one of them as well. \n\n",
              "id": 151,
              "comments": [
                {
                  "score": 6,
                  "content": "The problem is people confuse two things and think they are the same. Everyone has a bit of narcissism in them,  it's  not a big deal. How ever people from raisedbynarcissists had a parent that had NPD, narcissist personality disorder, something that is a completely different thing.\n\nNPD gets lapped sometime in the same group as psychopaths and sociopaths and there is a spectrum aswel. Their children are mentally and emotionally broken from all the mindgames and crazyness going on.\n\nI wish more people were aware of this because honestly having narcissim flying around like a buzzword is starting to really be frustrating and seeing that subreddit that is a safe haven for the victems linked in most threads is just getting ridiculous.\n\nI don't get NPD from this story. Like you said maybe inconsiderate or misguided but  not NPD.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Even though my parents often did worse, what else would you say \"Schedule a weekend camping trip on his birthday without telling him until the day they left\"?  \n\n\nThat is part of narcissism, where you believe everything you do is okay. Part of it is also knowing other people will respond negatively so that narcissism says \"Make the plans now, force it on them later. They don't know any better, and if I do it this way, they have less time or ability to complain or change MY plans\"\n\n&#x200B;",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It's not about determining whether or not someone is a narcissist. That community is for anyone who's parents are controlling/manipulative/abusive etc. It is extremely helpful to know you aren't alone.",
              "id": 154,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "[deleted]",
          "id": 155,
          "comments": [
            {
              "score": 6,
              "content": "that's my guess too.  There is more about this kids situation that OP is unaware of.. I probably would have been annoyed as a teenager but from my adult perspective, it's not so bad. ",
              "id": 156,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "As a subscriber to r/raisedbynarcissists, I'm not seeing it. There are some alarm bells in the camp story, but I'd hesitate to jump straight to \"narc!\"\n\nAre these parents controlling? Yes. Lacking understanding? Yes. Doing some things that, from the perspective we're seeing, arent great? Absolutely yes. But not every sub-par parent is a narc. \n\nEdit: there's potential for them to be narcissists, but I'd say more religious-controlling than narcissistic from the info we're given. We don't know the whole story though, so only OP can say for sure. ",
          "id": 157,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 63,
      "content": "INFO - Really depends on what the situation is with the kid. There are lots of possible reasons why the kid was invited to your house, and then invited to stay the night. It is certainly unfortunate that he was invited on your birthday, but his home might be unavailable for a multitude of reasons.",
      "id": 158,
      "comments": [
        {
          "score": 28,
          "content": "My thoughts exactly.  There's clearly something going on completely unrelated to OP's birthday that the dad has not decided to share, either because it's too sensitive or OP would be too young to understand/sympathize.  \n\nBest case scenario, we might just be looking at an anodyne situation where dad's friend wants a date night with his wife and asked dad for a solid, and it just sucked on the timing for OP.  More likely, there's some issue with the 10-year-old's home life that taking him out of it for a night was a real favor to both the kid and dad's friend.  \n\nSaying this because I've very much been that 10-year-old.  I used to go to sleepovers at friends' houses at a young age often simply to get away from (or be put away from) my extremely toxic family.  Usually by choice, but not always.\n\nOP is NTA [EDIT: I really mean NAH], but I would say that if he's not expected to entertain the 10-year-old he shouldn't be particularly upset.  It really may be that the younger kid needs a place to briefly camp for any number of perfectly valid reasons that don't directly affect OP and won't interfere with his birthday.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Solid rational answer. I get a distinct \"two sides to every story\" vibe from this. ",
          "id": 160,
          "comments": [
            {
              "score": 16,
              "content": "Yeah, as another commenter mentioned, it seems like there is more info that the parents haven't shared with op yet.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This is exactly what I’m thinking. \n\nOP’s old clothes go to him, it’s a friend of the dads, I’m betting this might be a “kid needs a good meal, and a warm place to sleep for a day or two”. Might be more, might be less, but this is definitely not something done out of spite or to ruin OP’s birthday. ",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "True, but at the same time, if there is an emergency, why can't his parents entertain the kid? Why does the kid HAVE to be a part of the party.",
          "id": 163,
          "comments": [
            {
              "score": 4,
              "content": "The event hasn't happened so I'm sure his parents might try but ultimately a 10 year old is going to want to hang out with the cool teens playing smash, not the parents doing whatever",
              "id": 164,
              "comments": [
                {
                  "score": 2,
                  "content": "The parents are the adults - it's their responsibility to set limits with the kids they are taking care of. The kid could always play smash with OP before or after the party, or the next morning.\n\n&#x200B;\n\nRuining your kid's birthday party because you don't want to disappoint someone else's kid seems like an asshole move to me.",
                  "id": 165,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}