{
  "post content": "I (54M) have two children (23F and 21M) with my wife (52F). When the kids were young, my parents set up education funds for both of them, which was very generous of them.\n\nMy wife and I always expected our kids to attend college and then graduate school, as we have done. I have a PhD, my wife has a master's. Because of this, we decided not to use the funds for our kids' undergrad degrees and did not tell them about the money.\n\nMy daughter has always been more into the liberal arts, while my son is more of a STEM guy. My wife and I worried about her ability to find a job, but she insisted on studying music and film in college. She was accepted to some top schools and chose to attend a rather expensive one, but she had scholarships to cover almost all of her tuition. Everything else, plus living expenses, was her responsibility. She lived in a very small apartment shared with friends in a not-so-nice area far from campus, but she was fine and learned how to budget effectively. After graduating, she luckily found a job that doesn't pay extremely well but she enjoys, and scrapped the idea of grad school.\n\nMy son decided to do engineering, and he also expressed that he had no interest in grad school. My wife and I were disappointed, but accepted it since at this point he is already all set up with a very good job when he completes school. Since he did not receive as many scholarships as his sister, we decided to use his education fund to cover his tuition and living expenses. He was able to get a large and nice apartment of his own close to the school, which is important since his classes are so demanding and he needs a comfortable space to work.\n\nMy daughter was confused and asked how he could afford this, and he told her about the education fund. She called us and asked why she didn't have one, and we told her she did, we just didn't use it because we hoped she would attend grad school. She seemed hurt by this and asked if there was any way she could have the money now. We explained that there would be a fee to simply withdraw the money for non-education uses, and if we chose to do that it would belong to her grandparents so they could put it towards their own use. She's been quiet and short when answering our texts, and hasn't answered our calls at all since then. I know that it seems unfair to her, but it's not really her money in the first place and she's no longer in college. Plus, her brother only received it for educational purposes and it wouldn't be right for her to just have it to spend now. AITA?\n\nUPDATE: I understand the consensus is that my wife and I are the AH. I texted my daughter to ask if she wanted us to withdraw the money for her/what she wanted to do. This was her response: \"I don't care. Maybe they can transfer it to \\[other grandkid who is 5\\] if the fee is seriously too much. Idk about grad school I haven't thought about it much recently. If I do apply it wouldn't be for another couple years and I hadn't been counting on having any financial help in the first place so it really doesn't even matter. Thanks for asking tho.\"\n\nUPDATE 2: My wife and I are discussing our daughter's response and our next actions to resolve this situation. For context, my wife has always had a strained relationship with my daughter and did not approve of many of her life choices. She believes we should take our daughter's words at face value and assume she no longer wants the money. From some of the responses here, I fear that my daughter's response was out of resentment and I suggested taking out as much money as her brother was given so at least they received the same amount. She could use it responsibly towards rent, groceries, transportation, etc. or in some other way to further her career, so it would still be for \"educational\" purposes in a sense. My wife is standing firm in her opinion, and we will continue talking it through tomorrow. \n\nMany have asked about where my parents stand on this. At this point, they are not mentally aware enough to really participate in the discussion. They did know about our grad school stipulation and thought it was fine. They also knew that we took out some money for our son once we were certain he was not pursuing an advanced degree, and were fine with that as well. They said it was our decision as parents what to do with our daughter's fund, and they would support whatever we decided for her. It wouldn't be useful to ask them what to do with it now, but I have always said that whatever is unused will go back to their care. I have tried to call my daughter with no luck, which is why I sent the text. Despite what many have said here, I hope this does not end our relationship. ",
  "id": 1,
  "comments": [
    {
      "score": 66123,
      "content": "YTA and Im surprised between your PHD and Masters degrees you couldn't figure that out.",
      "id": 2,
      "comments": [
        {
          "score": 12703,
          "content": "MASSIVE YTA. I feel for your daughter - it would be super hurtful to hear that your parents could have helped you but chose not too. You’re a PHD for sure but not the educational type.",
          "id": 3,
          "comments": [
            {
              "score": 18671,
              "content": "And the worst part was that the daughter was PUNISHED for getting scholarships and had to live in a shit area with roommates while the son had a nice apartment on his own in a good area.\n\nPart of this is, I believe, judgment against her choice of going into the humanities as opposed to her brother who went into engineering (and the implication that his studies were more rigorous).\n\nThe other part of this is their misogyny. They believe their son is more important than their daughter.",
              "id": 4,
              "comments": [
                {
                  "score": 6267,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 6844,
                      "content": "Whereas everyone knows artists can only achieve greatness if they contract tuberculosis while starving in a tiny, drafty garrett. /s\n\nI hope she ends up winning a Grammy *and* an Oscar and in her acceptance speech thanks her parents for the square root of absolutely fuck all.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 342,
                      "content": "Ugh it makes me want to spit. Then barf. And I think it bothers me even more that her mother is the one digging in her heels about it. Nice mom. Fucking nice.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 49,
                      "content": "I have an arts degree and in my 3rd year we were sometimes doing 14 hour days/nights and were advised it's best not to have a job as well in 3rd year because the workload was so huge. \n\nFuck these parents, they are massive AH.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 46,
                      "content": "Right! The favoritism is so completely blatant! OP & his wife both favor the brother! No wonder OP's wife doesn't have a good relationship with her daughter! When you clearly favor one kid, that happens! Notice how OP downplayed the daughter's accomplishments because she isn't in a STEM field! These types of parents make me sick! They are stealing money earmarked for her, while giving the son money earmarked for him, when neither of them is going to grad school! So clearly grad school wasn't the issue! Totally YTA!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "Absolutely. They clearly value his life  choices but disrespect the daughters. Also, he’ll have a STEM degree  and these pay better (generally) than liberal arts degrees. You think if they valued their daughter they’d be even more inclined to help her out but no, gotta punish her for not being what they wanted. Asses",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "Yeah, like OP's daughter didn't need a comfortable space to practice instruments, spend hours editing a film, store important gear, etc. Massive eye roll at OP.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 30,
                      "content": "I got a headache from my eye roll at that one.\n\nAlso, what are the chances the daughter made choices about grad school based on having no support for school in the first place? More debt, living with little to no money for several more years, calculating how long she would take to 'reach zero' depending on stopping now or continuing with a longer education?\n\nAnd then there is her choice of school in the first place, did she go where she wanted of where she felt she could afford?",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "This was the line that really cemented the YTA for me. Do they think their daughter never had a hard time during her studies? OPs daughter’s choices have been completely devalued.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "How much sexism is present here? Is it really just hard arts versus soft arts?\n\nI'd believe anything about OP.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "A friend of a friend of mine is sending his male child to private school for a levels and a prestigious engineering school for architecture, but his daughter goes to state school and isn't being encouraged to go to uni. Reason? 'She's less cerebral than him, so why waste the money?'\n\nSide note: This dude is a huge homophobe. His son got into art at school drawing lots of men in what I can only describe as risqué poses. Not saying he's gay for sure, but the lad sure does like drawing naked dudes...",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3115,
                  "content": "The wild thing is that, generally speaking, you don't declare your major until your sophomore year, so they were preemptively punishing their daughter by not helping her with living expenses from the get-go. Who's to say that she wouldn't have gone into STEM classes if she had had more time for doing homework in her quiet, single-occupancy home or getting tutoring, instead of having to work or commute from her apt.\n\nThey set up Bro from the beginning, but punished Daughter for exploring her options (like one is supposed to do in college).",
                  "id": 16,
                  "comments": [
                    {
                      "score": 688,
                      "content": "I agree with you on the parents being dicks. \n\nThe vast majority of engineers I know including myself started as an engineer from day one in college.  My school had mandatory freshman engineering classes, so transferring in second year in would have put a person very behind if they were on a 4 year plan.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 800,
                  "content": "Ding ding ding ding ding!\n\nAND “favoring the younger child” syndrome",
                  "id": 18,
                  "comments": [
                    {
                      "score": 28,
                      "content": "It was reversed in my family. I think it's generally the boy that is favored.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "Favouring the \"male\" child you mean",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 324,
                  "content": "But think about the parents! They get to tell everyone about their son, the engineer or some other bigshot title. Their friends are going to say, \"Hey, don't you also have a daughter? What does she do?\"\n\nImagine their embarrassment when they have to hang their heads and say she makes movie soundtracks or documentaries or some other such foolishness. \n\nIf you can't tell I am being 100% sarcastic. OP, YTA and you suck as a parent. I hope your daughter becomes immensely successful at whatever she does and refuses to acknowledge your existence for the rest of your life.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Or when she goes NC with them and they have to say \"I don't know what she does.\"",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "My mind went there too. Can’t wait for her to win the Nobel Prize for Literature or whatever, and NEVER thank OP in any interviews etc.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 51,
                  "content": "And OP has the fucking audacity to say that her living in a shit area far from school \"taught her budgeting\". AS IF HE WAS DOING HER A FAVOR?!? Like wtf?! And what did the son learn by having everything handed to him on a fking silver platter? I'm infuriated for the poor girl.",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 47,
                  "content": "I have a bachelor's in music and am currently pursuing a bachelor's in electrical engineering. I can confirm that they are both equally as rigorous. I don't know how spending 4+ hours in a practice room every day on top of 2+ hours of rehearsal every other day isn't rigorous.\n\nIn case it isn't clear, OP is TA.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Agreed. I have three master's--one in literature, one in education, and one in technology. The literature one was an absolute bitch and the only one for which I had to write and defend a thesis with an external examiner (who'd written a book in my area).\n\nI can't figure out why people think studies in the humanities are easier.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "Ok, I’m glad you said it because I was scratching my head looking at some of the other comments. What I inferred from OP was he gave money from the fund to his son because of his job prospects after college (and didn’t give it to his daughter for the same reason). \n\nI don’t get that at all. She obviously worked very hard to get all those scholarships. Her life could have been a lot easier if she had that money —which by all accounts was its purpose. \n\nI feel like an old man saying this, but I was STEM in college. I studied biology. I also worked a full time job while sharing a room with another person. Hearing his son needed a large apartment because he needs comfort for studying just irks me. \n\nShe not only deserves the money, she’s entitled to it. The grandparents set it up for *college*. I don’t know if his daughter took out loans or worked a job to pay for living expenses (assuming the former), but either way that money should go to her.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 22,
                      "content": "I'm loving how apparently the mother is doubling down by telling OP to take what daughter wrote at \"face value\" when OP is starting to realise that they might actually be the AHs. Op is, definitely, but wife is just a new level of petty. \"We hated your choice of education and career so withold your funds specifically meant for your education /that I had nothing to do with/. Yeah, your brother needed it because he chose to go into a field we approve of, while you went into one that I didn't, worked hard for that scolarship, therefore we were completely in the right to withold funds we didn't contribute to and didn't specify that you get the money only if you study something your parents agree with. Now you are angry at us for purposely witholding funds and denying your request to have the money now, so imma gonna be petty and take what you said at face value while being emotional over our betrayal and lack of suppor and redirect your funds. That'll teach you!\"\n\nAt this point, their course of action might decide between no contact or low contact.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "The worst part is that she lived far and in a dangerous area. If that doesn't spell \"I don't love you\". I don't know what does. She probably was done with them the second she realized. She is probably not even angry, just totally shut off of the relationship. To realize all of the sudden that your safety and well-being means nothing to your parents, it just crazy.\n\nThey could have helped her so she was close and in a safe area. They didn't have to even give her money for tuition. I makes me really sad.\n\nYTA.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "Absolutely. The daughter is going to believe her parents don’t love and support her as much as her brother, and she’ll be right. She’ll also never forgive them for this and she’ll never see them the same again. She’ll be right in this too. I hope she lives a joyous and fulfilling life despite them. And I hope these parents go to therapy and try to figure out how they can ever hope to have a real relationship with their daughter before they die.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Congrats on never meeting your future grandchildren.",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2028,
              "content": "Agree. YTA, OP. Favoring your son as you have will have/has embittered your poor daughter. Terribly unfair, and sounds like STEM son is flaunting it. Your daughter will NEVER forget your cruel treatment of her.",
              "id": 32,
              "comments": [
                {
                  "score": 722,
                  "content": ">Terribly unfair, and sounds like STEM son is flaunting it. \n\nI agree with everything you said except this part.  Going by what was posted, their is literally zero evidence of the son flaunting it.  Sister asks how he could afford a nice apartment by school and he answered about the fund he was given. \n\nYou're just making an assumption on the son with no evidence given showing he did that.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 374,
                      "content": "Yeah, the son may not have known they withheld the money. I come from a narc fam and my brother the golden child is actually a really nice guy. In fact, he just cut contact with our narc dad because of how abusive he is and how badly he messed up our family dynamics even though my brother got the very least of the abuse.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1557,
              "content": "It’s not even the parents money. They withheld funds given by the grandparent for the intended use of college. If the grandparents didn’t have restrictions on how it was to be used, the parents had no right to add their own.  I hope the grandparents are PISSED the money sat unused. Shocked the grandparents never brought up the fund to the grandkids around high school graduations",
              "id": 35,
              "comments": [
                {
                  "score": 775,
                  "content": "Not only did OP and his wife not have the right to set stipulations that were not there to begin with, they had the RESPONSIBILITY to deploy the trust as the grandparents wanted it. OP, you are a moral vacuum and definitely YTA.",
                  "id": 36,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 63,
                  "content": "It sounds like the grandparents trusted OP before they became incapable.  Bad choice.  If someone reading this has some inheritance in mind, get it in writing.  You never know if your own kid is going to turn out to be a tone-deaf AH.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Well you know, you'd think that parents, even if they don't like their own kid, since they brought them into the world, would at least give them the best start they are able to.\n\nObviously, the grandparents were wrong in this regard. Obviously, this set of parents values their own opinions more than doing their parental duties, like not mishandling funds. (Failure to pay out funds set aside for educatipn to daughter when she was studying sounds like mishandling funds to me, even if not in the legal sense.)",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "I would love to know what the OP is intending to do with the funds.  If they're not being given to the people that they're intended for, I have to ask what he intends to do with them?",
                  "id": 39,
                  "comments": [
                    {
                      "score": 54,
                      "content": "He updated and said the funds would go back to the grandparents. Originally saying it would go back to them to use on their expenses, but after updating that they are no longer in great mental states, said that extra \"non-educationally-used' money would be put towards taking care of them. \nWhen people set up funds they aren't planning on getting any return from it. This wouldn't be the \"grandparents getting their money back\". This would be the OP spending it on his parents care instead of his own money or however their care is currently being paid for.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1052,
              "content": "It was her money! Her grandparents set it up for HER! OP didn’t say there were any stipulations on it!",
              "id": 41,
              "comments": [
                {
                  "score": 380,
                  "content": "OP talking about it is not her money but yet they acting like it is there money by not even tell her about it. \n\n  \nI bet the grandparents will be pissed when they find out (it seems they are still alive)",
                  "id": 42,
                  "comments": [
                    {
                      "score": 55,
                      "content": "I’m honestly really curious about the legality of this. I think education funds have strict rules. I wonder if there is some kind of legal recourse for withholding the money from her.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 642,
              "content": "How are people like this so oblivious to the pain they cause? I feel so bad for this poor woman, I couldn't imagine doing this to my kids.",
              "id": 44,
              "comments": [
                {
                  "score": 50,
                  "content": "Intellectual snobbery:  they see it as a punishment for the daughter not doing the degree that they wanted.  I'd love to say that it's something new, but I was on the receiving end of it at University, some 22 years ago.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "My mother just died and left 95% of her assets/money (almost 1 mil) to my wealthy brother who has lived on the other side of the\nworld for over 25 years. Never mind that I'm a single parent, I looked after her,.spent a week at her hospital bedside when she was very ill several years ago (even got shit from my boss for taking the week off), I was sometimes her only friend, did anything she needed for her, of course. House prices and rent are crazy where I live, too. \n\nFunnily enough, my brother is an engineer and I have a lowly arts degree.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "And I Love her response to you. I can’t believe 2AHs raised such a wise woman.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I would have been beyond pissed to find out my grandparents had money set up for me but my parents chose NOT to tell me. Who knows what other choices she would have made if she knew about the money. I am sure it could have been used to aide her in some way while in school. Or used for money for a house etc. \n\n&#x200B;\n\nAnd then to find out your sibling was in a nicer bigger apartment!?",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8047,
          "content": "[removed]",
          "id": 49,
          "comments": [
            {
              "score": 4881,
              "content": "[removed]",
              "id": 50,
              "comments": [
                {
                  "score": 3910,
                  "content": "Exactly. This is a perfect example of why kids go NC with their parents. \n\nYTA big time. Like PhD level YTA.\n Dr. Assh**le",
                  "id": 51,
                  "comments": [
                    {
                      "score": 1661,
                      "content": "by the way of her resoponse the NC/LC era just begun",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 274,
                      "content": "Dr. And Mrs. Asshole, M.A.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I know it's misogynistic in this day and age, but that should be \"Dr & Mrs. Asshole\". They both took part in this.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2174,
                  "content": "The classic \"Let's punish our kids for not doing exactly as we think they should.\"\n\nThey let their daughter live in a shitty area to teach her a lesson. Their lesson will be no kids in contact with them.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 1108,
                      "content": "I can’t believe he’s so blasé about letting his daughter live in a “not-so-nice” area.  What an AH.",
                      "id": 56,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 954,
                      "content": "Not only that but they rewarded the son for his average efforts and punished her for achieving scholarships. WTAF is that.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 443,
                      "content": ">Their lesson will be no kids in contact with them.\n\nI agree. From OP's edit, it seems the daughter has already realized that she is on her own. She will continue to pull away from the family I think.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 420,
                      "content": "And I love how it was perfectly okay for their son to decide against grad school, but not their daughter.  Not sure if it's sexism, her choice in major, or s combination of the 2.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 89,
                      "content": "The lesson for not choosing the correct field of study, apparently.",
                      "id": 60,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 26,
                      "content": "And let's not forget that she was able to cover her tuition and SURVIVAL expenses on scholarships and work alone. All he would have had to take from her education fund (which was set up for her, for her education, by people other than him) was enough to upgrade her to the same \"digs\" his son enjoyed during his studies, a \"large and nice apartment close to school.\" His son was less successful in covering his own college expenses, but got treated like a king while in school, even though both kids had money available to keep them SAFE and comfortable.\n\nYTA OP, and that you don't realize it means that goes double.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "But he says that thanks to them she now knows how to budget her money. That has to count for something, right? /S",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 803,
              "content": "Education does not equate intelligence. Or self awareness.",
              "id": 63,
              "comments": [
                {
                  "score": 143,
                  "content": "And while it can reduce things like sex or perceived stability based favoritism, it sure doesn't eliminate it.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Also, common knowledge =/= common practice. \n\nThe husband and wife sound like a typical book smart, reality dumb type of people.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I’m confused even by the logic of saving money for grad school, especially based on the STEM bias they seem to have. Most STEM grad programs outside the medical field ‘pay’ for themselves through a research or teaching assistantship (at least in the US), so the undergrad degree is typically more expensive.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 324,
              "content": "You can be highly educated and still be a dumbass",
              "id": 67,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 47,
              "content": "And this, ladies and gentlemen, is the difference between knowledge and wisdom.\n\nAlso, get your kids to work backwards from happiness rather than forwards from an arbitrary educational standard you have set based on a sample size of two! Seriously, teach your kids to be happy, not just conventionally successful!",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "This omg. When your kid gets their talent  validated by getting into a top school  you don't shoot them down. You sit down and have a logical  conversation and say \"hey we love you and support  your dreams but you could be the best artist in the world and still never get your lucky break. If you still want to take this chance we support you but be smart and have a backup plan!\"",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Two highly educated assholes.",
              "id": 70,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2968,
          "content": "[removed]",
          "id": 71,
          "comments": [
            {
              "score": 775,
              "content": "Lots of posts from creative writers on here.",
              "id": 72,
              "comments": [
                {
                  "score": 886,
                  "content": "It's hard sometimes, because with posts like this you *want* it to be fake. ...But I know so many people in real life who are so much like this, I really have no reason to assume it's fake.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 774,
                      "content": "I personally wanted to believe that was fake… But then I remember all the conversations with my father about how I needed to get a real job like my sister, despite the fact that I was working in admin full-time for above minimum wage with great benefits as my first job…… He also tried to sabotage my attempts to find a solution to almost going homeless because, as he said to my mom (his ex wife for very obvious reasons), “couch surfing for a year or so will build character and probably convince her to go back to school.”\n\nIf my dad was actively trying to make me **homeless** because he wanted me to go to post secondary (on my own dime), I can 110% believe that someone like OP exists.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 328,
                      "content": "Yeah, something similar to OP happened to me, and I only found out about it in my 40's. My older sister went to college, and I had assumed she got scholarships and student loans. Then I went to college, and while I did get some scholarships, it wasn't enough, so I had student loans, work study, and I still had to get 2 part time jobs to cover my expenses. My parents never helped me financially. What my dad DID do, though, was gripe at me for the amount of hours I worked, outside of school. But he never offered me money. \n\nTurns out, while I was struggling, my dad was sending my sister lots of money every month, and paid her student loans back as well.\n\nThe mental gymnastics parents must do to think that's fair, just astounds me.\n\nEdited for spelling",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2356,
          "content": "YTA- I predict 10 years from now you’ll be posting. “I can’t figure out why my daughter will have nothing to do with me.” For two people that are so very” smart” you both sure are stupid. Stop trying to make your children little models of the two of you. Their grandparents gave them an education fund to be used for schooling and just because you chose to say it could only be used for a masters or higher isn’t, in line with how it was originally designated. \n\nBy your own admission, your daughter did very well in school, went into a career that she loves, paid for all of her extra expenses and housing. Meanwhile, your son, I’m sure because he was an engineering, basically got to have a free ride. You guys are both are treating your daughter terribly. \n\nYou should at the very least pay her back for all of her expenses incurred during her degree. \n\nAlso, as a sidenote, I went through school in the career field that my parents wanted for me, and I hated every minute of it. I then spent the next 20 years struggling working in that field. It took me till my 40s to find my way and start doing what I’m really passionate about. Don’t do this to your daughter because she’s choosing to follow a different path than you .",
          "id": 76,
          "comments": [
            {
              "score": 549,
              "content": "I'm seeing the future OP complaining about how the daughter has children, but OP and his wife aren't allowed to see them, so the AITA post will be about them using the unused College funds to pay for a lawyer for 'Grandparent's rights'.",
              "id": 77,
              "comments": [
                {
                  "score": 55,
                  "content": "Good call! Either way, I see in estrangement in the future",
                  "id": 78,
                  "comments": [
                    {
                      "score": 59,
                      "content": "I'd say that it's already started - I highly doubt that the daughter would want the parents at her graduation, let alone any wedding or baptisms.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I hope so.  I’m terrified thinking the daughter might be used to this abuse and will accept it…",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Lmao, my thoughts exactly..and now he's trying to BUY his daughter back instead of doing the 'right' thing to start with.\n\nDaughter is far better off telling them to shove ~~T~~HE~~I~~R money where the sun don't shine, what a judgemental \\*&%$!",
                  "id": 81,
                  "comments": [
                    {
                      "score": 20,
                      "content": "The mom is an AH too",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "In addition, the argument about the fees are nonsensical.\n\nIf someone steals something from you and damages that property as a direct result, it's on the person who deprived you of that property in the first place to make you whole and make up the difference. \n\nIn other words, those extra fees are not \"her\" problem, they're the parent's problem now. Anyway, I wonder what the grandparents have to say about this.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Especially the update makes it even worse. The daughter is rightfully pissed, but OP's wife doubles down. They will loose their daughter in the long run. I hope it was worth it. YTA, OP, and your wife is an even bigger one.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Can concur. I had my career planned out, but it didn't fit with what my mother wanted. She cut my education off halfway through, so now I'm stuck in this field I don't want to be in. I hate being stuck, I hate not being allowed to do what I wanted to, I'm bitter against her, and worst of all, if I decide to go back to school I'd have to start all over. I'm having to deal with the sexism angle too.\n\nI can only _imagine_ this poor girl.\n\nEdit: typos. Darn it, autocorrect, do better.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1839,
          "content": "Goes to show, no matter how fancy of a degree you have, when you have room temperature IQ, you have room temperature IQ!",
          "id": 86,
          "comments": [
            {
              "score": 361,
              "content": "I’ve always loved the phrase “ room temperature iq”. \n\nOP = YTA.  Seriously what kind of BS you trying to pull?",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "And sub zero EQ!",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "200 IQ with the emotional IQ of a damn rock.",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1129,
          "content": "Bet the son has always been the favorite.",
          "id": 90,
          "comments": [
            {
              "score": 862,
              "content": "IMO, they disagree with her major, so she did not get any money.   They were okay with the son’s major and got the money.",
              "id": 91,
              "comments": [
                {
                  "score": 793,
                  "content": "And that's trash of them because the grandparents didn't say \"here's money for grad school if they pick a good field of study\" they said \"here's money for college\" period. Shite parenting.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 298,
                      "content": "Yeah imagine if it were for their first house instead.\n\nDaughter buys a fixer-upper and they decide she'll need the money for renovations instead so they withhold. She decides to live in it as-is so they keep the money.\n\nSon buys a brand new home on the top of the hill and they shell out for it.\n\nLike, what?? The mental gymnastics they must have gone through to justify this choice...",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "Exactly. Because he has a high paying job now. Nevermind the work and dedication the daughter put in before college to earn her scholarships....golden boy over here is making mommy and daddy proud with his \"status\". I hope the daughter has a fulfilling life and career far away from her family.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "Absolutely this. They have no idea that there can be some very lucrative jobs in the daughter's field of study. Along with the rest of the things they have no idea about, like fairness, parenting, and yours/mine/ours identification.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 359,
              "content": "Therein lies the major issue with having favorites.  It can drastically change the lives of the children.  Why parents would do that to their own children is beyond me.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 723,
          "content": "Right!! How can they not know they're the AH? I think its actually elitism around what their kids decided to study - they seem to think engineering is more demanding course wise, so the son deserved access to the fund. I'm also concerned that they were happy for their daughter to live in a 'not so nice place far from campus' - when they had funds to allow her to get a different, potentially safer, place... it's wild to me that they can't see this.\n\nEdited to make more sense and fix mistakes.",
          "id": 97,
          "comments": [
            {
              "score": 64,
              "content": "But they were teaching her to budget! /s\n\nThis is a pretty crazy scheme: OP's kids have college accounts that OP didn't even have to contribute to, and instead of using for, you know, college, they kept it a big secret. The only way to attain the money was to say the secret password: grad school! \n\n**OP**, it never occurred to you and your wife that your kids might not decide to go to grad school? That is, there was no Plan B as to what to do with the money? \n\nINFO: What do the grandparents have to say about all this? Didn't they set up the accounts so that the kids could attend COLLEGE? Do they even know about your super-secret grad school scheme? If I were them, I'd be furious with you and your wife. And I'd demand you give both kids the amount in the accounts and eat the penalties yourself. \n\nYTA. Big time.",
              "id": 98,
              "comments": [
                {
                  "score": 44,
                  "content": "If his daughter had known about the college fund, she might have actually gone to grad school. It seems like finances might have been what deterred her in the first place.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "one of the (many) unfair things is that the bro got the money and easy way through college though DESPITE not saying the secret password/fulfilling the totally made up grad-school requirement either!??!?!\n\nIt's almost as if they bend the rules based on who it is or which life choices they more approve of..  /s\n\nWhich is hypocritical too because parenting most likely had an influence on her life choices. Ughh.. And it's not even theirs, they wouldn't have had to sacrifice a single own cent, yet they decided to omit it just to spite daughter for..  whatever ominous reasons.\n\nIt's so awful, they can never undo this hurt.\n\nEven if they now decide to graciously give her the amount now.. Despite it not fulfilling the still held up arbitrary rule of having to be used for educational purposes.. Except imo it still is for education in hindsight, since she got herself through college with her ownhard-earned money.\n\nOuff this post really hurt my heart. So sad for OP's daughter.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 61,
              "content": "Or the presumptuous comment about the daughter \"learning how to budget\"...  doesn't the son need to learn how to budget too???",
              "id": 101,
              "comments": [
                {
                  "score": 68,
                  "content": "Well given that she's already at a financial disadvantage statistically due to her gender, and now compounded by her parents asshole-ness, sure, she probably does need to budget carefully whereas the brother doesn't. Ugh I really hate these parents.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 47,
                      "content": "I went to a fancy music school, getting in was HARD, getting scholarships to cover almost all tuition is even harder. Like she must truly have massive talent. Meanwhile golden boy needs that one bedroom apt near school since he's gotta try twice as hard because he didn't earn the scholarships. They invested in the wrong one.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "The visceral level at which I loathe these parents is unreal.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 603,
          "content": "I’m calling bullshit on this one.\n\nIt’s just such an obvious YTA. The genuine posters leave out stuff like “the daughter shared a tiny shithole in a dangerous area while the son live alone in a nice palace cos his studies are hard.”\n\nBUUUULLSHIIIIIT",
          "id": 105,
          "comments": [
            {
              "score": 352,
              "content": "I promise you I know highly educated people who are genuinely this oblivious.\n\nMy favorite example all-time was the gynecologist who went to TOP schools. At a dinner table with his family and another family - including, between them, five children all under the age of about 12 - he announced, “You know, I’ve noticed that for some of my patients, their hair color ‘down there’ is a different color from the hair on their head. I’ve never figured out why.”",
              "id": 106,
              "comments": [
                {
                  "score": 76,
                  "content": "This is almost as good as the medical student finding out fish/ chicken were in fact the animals fish and chicken.",
                  "id": 107,
                  "comments": [
                    {
                      "score": 75,
                      "content": "Oooh, I've got one!\n\nMale final year medical student was scratching my dog's tummy and telling him what a good girl he was. Dog penises kind of stick out, you know? So I told him, \"Look, my dog doesn't give a rat's arse about being misgendered, but he's a boy\" (pointing to the penis).\n\nFinal year med student: No, it's a girl dog. Just look at the nipples!\n\nMe: \\[Long pause\\]. Umm... Have you ever looked at yourself shirtless in a mirror before, dude?\n\nFYMS: \\[Even longer pause\\] Oh. OH! \\[turns bright red and makes an excuse to leave\\]\n\nHow do they get to the end of a \\*med degree\\* without knowing male mammals have nipples????",
                      "id": 108,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 68,
                  "content": "As a woman, I can assure that *most* gynecologists are morons. Example: \"My patients regularly vomit, pass out, and cry because they're in so much pain during this procedure but they're all wrong.\"",
                  "id": 109,
                  "comments": [
                    {
                      "score": 33,
                      "content": "The grotesque misogyny of the medical system is just intolerable.",
                      "id": 110,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 26,
                      "content": "And before the procedure they’ll be all like, “it’s not painful but it does cause some discomfort.” Honey I’m uncomfortable when the weather is so warm that I come out of the shower already sweating, if I need to spend a whole entire afternoon laying in bed in fetal position afterwards, that shit is PAIN.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "There's a lot of highly educated morons out there unfortunately.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "I second this. Two of the dumbest people I ever worked with were a guy studying to become a medical doctor and a law school scholarship student. \n\nThe scholarship student put ice-cream in the microwave because the customer wanted hot chocolate topping on their ice-cream. Even when he pulled out the chocolate cream soup he didn’t understand what he’d done and asked what happened. The poor manager just sighed and said “When I told you to put it in the microwave, I was talking about the SAUCE, not both together.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Yep. I’ve met lawyers who went to Harvard who didn’t have the sense God gave a termite.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "The part that made it seem fake to me is that OP is allegedly a PhD, but doesn’t know that many grad programs are fully funded with a stipend. If you get accepted, you get that award, period. It seems like a major red flag that OP and wife decided to save the education fund for grad school when undergrad programs are hardly ever covered.",
                  "id": 115,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 532,
          "content": "Originally, the sole requirement was to go to college, which both of the kids did. Then, they require grad school. Then, they require \"useful\" degrees. Then, they let the son skimp by those requirements and not the daughter. These bookworms aren't that smart.",
          "id": 116,
          "comments": [
            {
              "score": 18,
              "content": "I truly don’t understand the grad school thing. It would be so much more beneficial to receive help in undergrad because you’re still so young and inexperienced… while grad school implies you’ve either spent time working professionally to support yourself and save up, or you’re going to a program where assistantships or stipends may be built into the program",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 254,
          "content": "I don't understand the \"withdrawal\" fee why is OP acting like a callous pseudo-bank",
          "id": 118,
          "comments": [
            {
              "score": 458,
              "content": "I mean, that's more than likely true though. There are several types of accounts that carry penalties for using them for purposes other than their stated purpose (HSA's, retirement accounts, etc). If they put it in a 529 account or something, there would absolutely be penalties for pulling it out for non-educational purposes. Which is exactly why the daughter is so rightfully pissed, because OP pissed away a bunch of her grandparent's money and she lived in a rathole apartment far away from campus to save money when she a) didn't have to, and b) really fucking shouldn't have, because OP snubbed her aspirations and desire to not seek education past undergrad and thus didn't tell her about the money.",
              "id": 119,
              "comments": [
                {
                  "score": 16,
                  "content": "Do they disallow withdrawal structured as reimbursement for educational expenses already incurred and paid?",
                  "id": 120,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Must be during the same tax year. Otherwise it’s subject to a penalty/tax. There is a real problem with parents withdrawing money in December and not paying tuition until January. Those are the rules. \n\nIn this case, I think the parents should pay the tax and penalties in full to *try* to make up for their blunder.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "They can usually be used for things like paying off student loans and the like, but not for things like \"this student paid for their housing themselves by working because they were kept purposefully ignorant about their grandparents having an educational fund for them\".",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I agree that it sounds  like a 529. Such a waste they didn't help her.  With the scholarships, she may have had enough to live in better accommodations and cover most of grad school. \n\nMaybe she would have had the energy to continue to grad school if she didn't have to struggle like she did.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 21879,
      "content": "YTA oh dear, just goes to show you that having PhD and a Masters does neither make you a good parent or smart in anyway.",
      "id": 124,
      "comments": [
        {
          "score": 6239,
          "content": "Also graduate degrees are cheaper, especially PhDs. Most doctoral programs pay you to be there. This was all around really dumb & YTA\n\nETA: I’m from the US & have a AA (free), BA (loan$), MS (GA stipend & tuition reduction & part loans), PhD in progress (scholarships). In the end for me the BA was the most expensive. I still took out loans in MS degree for living expenses but really shouldn’t have. All state schools and non-Stem although research based degrees.",
          "id": 125,
          "comments": [
            {
              "score": 2558,
              "content": "Right!! Like if anything undergrad would’ve been the time to use the money lmao",
              "id": 126,
              "comments": [
                {
                  "score": 2207,
                  "content": "This poor girl. This has \"Golden Child\" written all over it, if it's true. I hope she lets her grandparents know what happened and they absolutely rip into OP for being delusional. Why in the world would the grandparents want back the money they put in an account for their grandchild to have an easier start to life???",
                  "id": 127,
                  "comments": [
                    {
                      "score": 1679,
                      "content": "I can't get over the she lived in a bad neighborhood but survived and learned to budget. 🤦🏻‍♀️ YTA.",
                      "id": 128,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 418,
                      "content": "i would bet their daughters whole education fund that both parents degrees are stem related and they did not like that the daughter didn’t go into stem like their son did.",
                      "id": 129,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 618,
                  "content": "Using the money to have a good start in an undergrad degree would greatly improve the chances of her going on to postgraduate study (which is more likely to include opportunities for funding/teaching/internships). By forcing her to do it without any support she got burnt out and doesn’t want to study anymore. YTA.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "And if she had the fund, she could have had a better learning environment and less stress so that she could focus better in undergrad. That could lead to higher grades and a better chance of getting great grad school grants, TAships, and advisor placement",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 398,
              "content": "You would think they know this, since they have a Master's and a PhD.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 662,
          "content": "Textbook Wisdom versus Intelligence. Some college educated folks have the slimmest grasp of etiquette, life skills, or the ability to not set themselves on fire.",
          "id": 133,
          "comments": [
            {
              "score": 22,
              "content": "I used to work in the medical field. Met plenty of doctors and surgeons severely lacking in common sense.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 191,
          "content": "Hey, the daughter has a job that doesn't pay well, so that's why she should go back to school.\n\nOf course, she is going to go back to grad school - she just doesn't know what she wants. /s",
          "id": 135,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 109,
          "content": "You deserve all the upvotes for this comment.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18955,
      "content": "So let me get this right…your daughter attended college and had a scholarship. Your son attended college with no scholarship. You chose to not let your daughter use her college fund for everything that her scholarship didn’t cover and you let your son use his for everything. The college fund you said “wasn’t even her money” but isn’t yours either!! What exactly do YOU plan to do with HER college money? YTA FOR THIS.",
      "id": 137,
      "comments": [
        {
          "score": 7746,
          "content": "Not to mention a college fund her grandparents set for her. He’s basically stealing her money. Major YTA",
          "id": 138,
          "comments": [
            {
              "score": 1135,
              "content": "Exactly my feelings too.",
              "id": 139,
              "comments": [
                {
                  "score": 2217,
                  "content": "YTA, and ditto.  She had a college fund, went to college, and you didn't tell her or use it on her behalf.  Yet, you did so for your son.  That's very unfair and did not follow the intent of your parents when they set up the fund.  She should be reimbursed out of the fund for all of her college expenses.  And learn to respect your childrens' choices if you want to be a positive part of their lives.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 3576,
                      "content": "But you don't understand! She wanted to study *music* and he has a demanding *STEM* course! And he has found a high paying job after graduation and she has a low paying one! She *chose* to live in a hovel!\n\n/S\n\nOp is a sexist AH",
                      "id": 141,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 963,
              "content": "Let us also not forget that he let his young daughter live far off campus in a sketchy area because he couldn't use those funds to help her. Yet his son who is also not going to grad school gets a nice cushy apartment close to campus.",
              "id": 142,
              "comments": [
                {
                  "score": 339,
                  "content": "But he needs to be safe and comfortable (sarcasm)",
                  "id": 143,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Its not like women are the ones attacked, stalked, raped or killed often. They can totally handle living in dangerous areas. Their precious son is the one who should have a safe environment \n\n/s obvs",
                      "id": 144,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 258,
                  "content": "Only STEM fields are _demanding_, y’know. /s",
                  "id": 145,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 28,
                  "content": "Also the costs associated with travel and time to and from campus put her at a further financial disadvantage. God these people suck so bad.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 533,
              "content": "this should be higher up. he STOLE from her, it literally is her money.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 277,
              "content": "Sounds like the grandparents are still alive, so if I were in the daughter's shoes I'd be calling them and explaining the whole situation of clear favoritism. OP already indicated \"it's the grandparents money\" but clearly isn't involving them in how/when it's used.\n\nIf the fund is specifically in her name, she may even be able to sue the parents to recoup what she had to spend out-of-pocket during her undergrad since they intentionally withheld money set aside to cover those expenses.",
              "id": 148,
              "comments": [
                {
                  "score": 44,
                  "content": "Yes this, I'm wondering if the grandparents knew about their fantastic plan.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 25,
                      "content": "They definitely didn’t",
                      "id": 150,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": "Would love to know what her grandparents think about it too!",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "ALSO, let’s not forget that the son was able to get a very large apartment and lives comfortably (thanks to the college fund) while sis was slumming it in a “not so good” area with roommates. She could have had a much  better living arrangement with the help of that fund. \n\nOP YTA. A huge AH",
              "id": 152,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "I gotta stop reading this sub. I never thought there was so many clueless, rage inducing, god awful parents out there. Like tell us you have a favourite child without telling us you have a favourite. He has the nerve to gate keep money that is litterally not his.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1321,
          "content": ">What exactly do YOU plan to do with HER college money?\n\nProbably give it to their son for a down payment on a house or something because his house needs to be close to his STEM job but the daughter can live in a dump because she needs to learn to live as a \"struggling artist/musician\"",
          "id": 154,
          "comments": [
            {
              "score": 274,
              "content": "NAIL ON THE HEAD! OP makes me sick honestly.",
              "id": 155,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Op apparently looks at his daughter and thinks she’s Phoebe Buffay while his son is the next Elon Musk in his eyes",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "Sounds like a 529 plan where the $$ can be withdrawn, tax free, for higher education (& in some states for private school tuition for grade schooling) which is why OP specified if it's withdrawn for non-educational purposes the owner of the $$ would default to the original contributors (the grandparents).",
              "id": 157,
              "comments": [
                {
                  "score": 27,
                  "content": "Well the grandparents could give the money to the daughter after they hear the entire story. Sounds like OP just didn't want to give the money to their daughter",
                  "id": 158,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "Right? She had to pay for her additional expenses, but the son just gets them covered because the parents assume his degree is harder (being in stem). Absolute AHs",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "On top of that they were also okay with her sharing a small apartment in the \"unsafe part of town.\" She had scholarships and was paying stuff on her own. Didn't they want to take some burden off of her and just get her a nicer apartment at least. I don't understand.",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14368,
      "content": "Do you know why all that you did seems unfair to your daughter? Because it is unfair to your daughter. You had the ability to use the funds to cover her living expenses during undergraduate. (This, of course, is a bit bizarre. Are you a trustee of a trust? Or did the grandparents set up a 529 plan and give you full control over it.) Yet you did not even tell your daughter about these funds. Talk about a faithless trustee.\n\nAt this point, you need to grovel. You need to apologize for substituting your judgment as to the best way to use the funds for your daughter's judgment. You need to make amends. Then you need to circle back and see what the terms of your parent's bequest were. (And, honestly, I'd get an attorney to do this for you as you've already demonstrated your judgment is beyond suspect.) Most trusts have provisions for disbursement of the corpus if the purposes cannot be fulfilled. I doubt, honestly, though, that your parents meant for their gift to be returned to them in the event that their grandkids didn't go to college or in the event that they didn't need the money for college.\n\nAnd don't even get me started on the favoritism. You use the funds for your son to enjoy a cushy life during his undergraduate studies but didn't do the same for your little girl? Really? Seriously?\n\nIn case there was any doubt, YTA truly and completely.",
      "id": 161,
      "comments": [
        {
          "score": 5357,
          "content": "Beautifully stated. YTA\n\nI’m also curious, if daughter hadn’t gotten so many scholarships, would OP have given her the money?  Seems like she was punished for doing better than brother and getting scholarships.",
          "id": 162,
          "comments": [
            {
              "score": 8159,
              "content": "I think he also punished her for going into the Arts. The son *needed* a nice comfy apartment because STEM is soooooo demanding.   \n\n\nYTA OP.",
              "id": 163,
              "comments": [
                {
                  "score": 1602,
                  "content": "Exactly what I was going to say. Because no one in America has ever made a decent living in music or film /s",
                  "id": 164,
                  "comments": [
                    {
                      "score": 690,
                      "content": "I'm primarily a print designer and layout artist, and I make a pretty good living. I use my studio art minor way more than my college major.",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I’m glad OPs daughter didn’t get hurt living in a “not so nice area”, if only there was some way for her to afford an apartment in a better area closer to campus/s. you’re an exceptionally large YTA OP and at least your daughter is intelligent/resourceful enough to make it on her own when she goes no contact with you.",
                  "id": 166,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 666,
              "content": " they definitely punished her for her degree. the way he describes her education and career says it all.",
              "id": 167,
              "comments": [
                {
                  "score": 21,
                  "content": "[deleted]",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 256,
              "content": "More like punished for not going to a \"good\" education path.",
              "id": 169,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1410,
          "content": "I have a young daughter and can't imagine being okay with her living in a sketchy area far from campus when the money was easily and intentionally available.",
          "id": 170,
          "comments": [
            {
              "score": 660,
              "content": "Oh, no, that'll teach her what life with a liberal arts degree is going to be like. (/s)",
              "id": 171,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 573,
              "content": "This is the part that stood out to me the most.  Like yes, let's heighten the risk that she gets raped or even murdered, and force her to live in a place where car and home break-ins and muggings are considered a common nuisance.  Best case she just lives in fear for her safety every day.  Being catcalled and having to constantly look over your shoulder isn't fun.  Young women who are dressed like a college student and walking to class alone stick out in a \"sketchy area\".  I've been that girl.  And being harassed by mentally ill homeless people is disconcerting, even if they may be ultimately \"harmless\".  All because you wish she went into STEM.  And having one PhD isn't as impressive as OP thinks it is.",
              "id": 172,
              "comments": [
                {
                  "score": 184,
                  "content": "Let's be honest - if something did happen to her, she would never tell these asshat parents because it would have been HER OWN FAULT.",
                  "id": 173,
                  "comments": [
                    {
                      "score": 42,
                      "content": "It could have already happened, and that’s a big reason why she’s so upset. Her parents let her stay in an unsafe environment for reasons.",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 105,
              "content": "He has the gall to say the money cant be used for educational expenses",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Let his daughter live in a sketchy area says all he needs to say about which kid he cares about. \nDon’t worry, I have a son. The daughter is just a spare if she gets murdered. Jesus. I hope she walks away from this misogynist a$$hat.",
              "id": 176,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 662,
          "content": ">My son decided to do engineering, and he also expressed that he had no interest in grad school. My wife and I were disappointed, but accepted it since at this point he is already all set up with a very good job when he completes school. Since he did not receive as many scholarships as his sister, we decided to use his education fund to cover his tuition and living expenses. He was able to get a large and nice apartment of his own close to the school, which is important since his classes are so demanding and he needs a comfortable space to work.\n\nI cant understand how they said they didnt use the educational funds for non education. purposes when they covered his living expenses. OP is leaving alot out and thinking he can get away with this. \n\nHe made his daughter living a bad area for what exactly to learn how to budget?",
          "id": 177,
          "comments": [
            {
              "score": 310,
              "content": "Apparently you can use 529 money on room and board but OP is still YTA. Hope daughter goes NC and has a wonderful life pursuing her passions.",
              "id": 178,
              "comments": [
                {
                  "score": 178,
                  "content": "Like honestly what i copied into my comment is what is annoying me he says no using money only for grad school then turns around and uses the money for undergrad and still hasnt told his parents and now is saying they cant its their parents money. \n\nLike which one is it?",
                  "id": 179,
                  "comments": [
                    {
                      "score": 215,
                      "content": "Only for grad school unless you are a special, special boy who needs a lovely convenient apartment because of all your hard work.",
                      "id": 180,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "And it's his DAUGHTER. When my dad was helping me find an apartment in a new city, he took one look at this one place and asked the realtor: \"would you let your daughter live in this shithole? Because I don't think you don't care about her...\"\n\nI was 28 and I was paying my own way. This is how fathers should treat their daughters. And their sons of course, but op is already doing that.\n\nEDIT: thumbs suck.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "PLUS they just changed the rules for 529s… you can roll them over to a Roth IRA in the beneficiary’s name. So she may be better set up than the golden child after all.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8423,
      "content": "You paid for your son to have a large apartment to himself close to his school but forced your daughter to pay for her own shitty appartement across town? \n\nObvious asshole",
      "id": 183,
      "comments": [
        {
          "score": 2963,
          "content": "This. My son deserves a comfy apartment. My daughter figured out how to make it.",
          "id": 184,
          "comments": [
            {
              "score": 1942,
              "content": "The son didn’t get scholarships but doesn’t need to learn how to budget, apparently.",
              "id": 185,
              "comments": [
                {
                  "score": 434,
                  "content": "[deleted]",
                  "id": 186,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Sounds terrible lol",
                      "id": 187,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Yeah the daughter will figure out that she can make it without her parents. I wouldn't be surprised if she goes NC.",
              "id": 188,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 286,
          "content": "Not even paid for his, but intentionally withheld from hers.",
          "id": 189,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 33,
          "content": "Shitty apartment in a not so nice area to boot. She could have been attacked, raped, murdered or all three but hey, you saved that money OP. Oh! I know.... you could have used it for funeral expenses!! \n\nIf she ever speaks to you again you need to be on your knees begging for HER forgiveness. Huge YTA.",
          "id": 190,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "He didn't pay for it, he released the college fund his parents paid into to pay off his son's education, but left his daughter in the lurch. I'm guessing since \"artsy-fartsy\" majors and a B.A. diploma isn't worth the paper it's printed on /s.\n\nYTA OP!",
          "id": 191,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6510,
      "content": "YTA.  I assumed this would be the classic \"my kid didn't go to college and wants their college fund\" - but it isn't even.  Neither child went to grad school, but you decided to give money to one but not the other, so it's not even about grad school like you pretended.  You basically decided your daughter's goals didn't meet your approval so you didn't give her the money that had been set aside for her.",
      "id": 192,
      "comments": [
        {
          "score": 1273,
          "content": "I thought it was gonna be a \"it's my money and I can do what I want with it\" type thing but it isn't even that!! It wasn't OP's money.... OP's kid went to school... of course OP is the AH!! Give your daughter HER money!!",
          "id": 193,
          "comments": [
            {
              "score": 561,
              "content": "Not to mention the decision to go to grad school and be based on money. Maybe both daughter AND son decided that it wasn't financially feasible or worth it to do further studies after university, but had they known about how much was in their trusts, they may have.  After getting my masters I toyed around with the idea of going for my PhD, but it wasn't workable money-wise. I needed a full time job to pay my mortgage, bills, car etc, and the job that I have in my field is intense and I can't just be doing an itty bitty thesis on the side. Free time in my career is hard enough to come by as it is just to do household chores. Perhaps your children may have had the same line of thinking.\n\nAlso YTA for your blatant favouritism.\n\nedit  \nAccording to your update this is exactly the case! Even worse is that she expressed interest in getting her doctorate, but due to fiscal reason that YOU imposed unnecessarily, she did not think it would be a realist finical decision. Worse still, as it has been so long until she found out about the money (on accident mind you since her parents didn't gain to tell her, which would have been a nasty blow) where she is in the point in her life and career means that grad school is no longer feasible at this point and time as it might have been directly after undergrad!!! You are not just TA, you and your wife have screwed up more than I think you realise.  \nAlso, your comment about daughter not being good with money in high school, many kids aren't and perhaps living out of home during college would have given her the opportunity to show she was cable of being responsible, oh wait it did! If you were worried about her spending habits you did not have to give her carte blanche with the money but just assist her in the same way you have done with your son.",
              "id": 194,
              "comments": [
                {
                  "score": 41,
                  "content": "Dudes gonna have a fun retirement home set up for him",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "Also interesting the daughter didn't confide to her parents about toying with the idea of attending grad school. Like OP hasn't even considered there may have been a reason she kept her cards close to her chest. I wonder how often she heard the spiel about art school and knew that even mentioning the possibility of continuing further education in that field would only invite more conflict.\n\nOPs worried about ruining his relationship and doesn't even realize his daughter has already been pulling back for years.",
                  "id": 196,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Like seriously, I don't think the money being primarily for grad school is necessarily an issue, but the kids 100% should have known that the funds were available to them, so they can plan accordingly. If they want their kids to go to grad school use that as a carrot to encourage the kids to pursue that, keeping it secret just makes no sense to me",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 231,
          "content": "Even if they did want to go to grad schools, most grad programs worth their salt are partially funded by assistantships. So it’s really weird that they would earmark the money for that instead of the bachelors degree.",
          "id": 198,
          "comments": [
            {
              "score": 20,
              "content": "That's what makes me think this may be fake. Two parents with graduate degrees likely in stem would know this.",
              "id": 199,
              "comments": [
                {
                  "score": 24,
                  "content": "Plus OP says there would be a penalty for using money for non-educational expenses, but in the edit says whatever is left will go towards his parents’ care. 🙄",
                  "id": 200,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "And all I can think is, maybe she would have chosen to go to grad school had she known it was covered. I want to tear my own hair out on this one.",
          "id": 201,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4637,
      "content": "YTA. You need to pay her back for the money she spent on her education, which her grandparents tried to ensure that she wouldn’t have to do. \n\nAlso, info: what happens to the money now that you’re not giving it to her?",
      "id": 202,
      "comments": [
        {
          "score": 1721,
          "content": "If it’s a 529 it can be rolled over to an IRA free of penalty thanks to new legislation, or she could still save it for other education in the future. But if it’s set up in her name then it does belong to her and she can withdraw it and pay the fines. The real problem as I see it is the opportunity cost of keeping it hidden from her during college. She might have used her time very differently and even pursued different opportunities if she knew that she could have covered her expenses using a college fund.\n\nEdit: Many have pointed out the account probably still legally belongs to grandparents, and is not a custodial account as I had pictured.",
          "id": 203,
          "comments": [
            {
              "score": 396,
              "content": "You're right about rolling the funds over, and that's exactly what the grandparents should do. It is still legally their money, though - 529 plans legally belong to the person who sets up the account, not the child intended to receive the account. This is an important detail when it comes to the FAFSA and getting loans and financial aid. (And keeping large amounts of money from any irresponsible 18 year olds who will take the money, pay the penalty and then waste the funds.)\n\nBut good lord, the opportunity cost here is so big... And the emotional toll too. I'm furious just reading the post, so I can't imagine how furious the daughter is.",
              "id": 204,
              "comments": [
                {
                  "score": 290,
                  "content": "Based on the edit it sounds like she’s absolutely done with her parents bs. Although I wouldn’t be surprised if there were more examples throughout her childhood of their blatant favoritism.",
                  "id": 205,
                  "comments": [
                    {
                      "score": 266,
                      "content": "Yeah, im worried that OP has interpreted her \"it doesn't matter\" as \"water under the bridge\" instead of \"oh, the bridge is collapsing\".",
                      "id": 206,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 63,
                      "content": "This is definitely the cherry on top of a shit parenting sundae. The fact that he read her response text at face value is also concerning. OP might be book-smart but their emotional intelligence is looow.",
                      "id": 207,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "You nailed it, the opportunity cost can never be reimbursed. Op played God with his daughters opportunities and it doesn’t sound like he cares about the loss to her, he just wants to know if he is a good guy or not!!!",
                  "id": 208,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Her allowance on time is what I’m curious! Was she made to get a job or take out a loan? Then the father should feel awful with his double standards. She could have spent more time focus on her studies, research, networking, all stuff that would motivate to go to grad school. And those opportunities are better at a top school, which she went to. She was probably burnt out to even think of grad school! \n\nHonestly, I’m curious of what the OP’s and wife degrees are in, which gave them the warped perception that the son needed more luxuries because “STEM is Hard”, but if the daughter was going to a top school for liberal arts, those courses are very intense compared to a lower tier school because those schools know how to produce those scholars.\n\nI also think the parents higher education also blinded them. They were so focus grad school they forgot how important undergrad is. They basically made her life harder and shittier when if they gave her the money for undergrad, she could perhaps have gotten a better paying job after undergrad or even think about grad school. \n\nAlso very strange that a family with two grad degrees couldn’t cover the cost of her living when most of the tuition was covered.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "The parents should pay the fine - it's being incurred because of their completel shitful behavior.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Opportunity Cost!!   This is why she's always going to be too busy to come home for Christmas.  I'm doing a masters program after working for ten years with a bachelor's, saving up, got a part time job that I can do part time tland gives me insurance. Student loans for tuition.   If I found out there was money and I could have done this years ago....it's a miracle she responds at all.   Your wife is a demon for the whole passive aggressive well let's do what she says remark.   Failures as parents.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I wonder if she could sue the parents for the fees. After all they defrauded her for years.",
              "id": 212,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 620,
          "content": "[deleted]",
          "id": 213,
          "comments": [
            {
              "score": 35,
              "content": "Exactly. And the arts cost money to pursue, whether in materials or instruments or tools. She could definitely use that money now to get better materials and advance her skills.",
              "id": 214,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "My favorite comment by far and super accurate.  \nYTA on so many levels, OP.",
              "id": 215,
              "comments": [
                {
                  "score": 20,
                  "content": "[deleted]",
                  "id": 216,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 423,
          "content": "Maybe the parents can use it to get a degree in \"Not Being TA.\"",
          "id": 217,
          "comments": [
            {
              "score": 166,
              "content": "I doubt there's enough in there to cover the cost of those courses.",
              "id": 218,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 165,
          "content": "So education funds are 529 plans (typically) and can only be spent by the named person (the son or daughter in this case) on educational expenses. They can be passed on to your children but can’t be used for anything else. It shows these parents literally did not understand the nature of the funds, when they chose to use them this way. The grandparents cannot use the money. They cannot use the money. Only the named person on the account can, usually with a person named as distributor. In our home it’s my MIL when my kids get to school, if something happens to her, my husband and I are named as distributors.",
          "id": 219,
          "comments": [
            {
              "score": 39,
              "content": "It's possible to take the money out of a 529, it's just that there's a penalty that has to be paid to do so. Which is what OP said in the comments that the grandparents will do if she doesn't go to grad school. \n\nOP is a major AH, but I wanna know why the grandparents let the parents make the decision about spending the money when the parents had zero legal or beneficial interest in the funds. Why didn't the grandparents tell their granddaughter they had the money to get her a safer place to live??",
              "id": 220,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "So true!!!! I think OP should cover the fees for taking it out at this point. What an idiot and their spouse is also to blame. Like whooooo would let their spouse just do this without raising an issue.",
          "id": 221,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2237,
      "content": "YTA you paid for your son’s living expenses out of the fund but not your daughter’s when they made the same decisions. Yet your daughter achieved scholarships and your son didn’t, so you make her effectively struggle and have to pay for herself… whereas your son didn’t achieve those scholarships, nor covered his own expenses, nor had to live in a lower standard because you favoured him and allowed him the fund. I wouldn’t want to talk to you both either after making me work harder than my brother when the funds were there to make a difficult time easier. What do their grandparents think about how you’ve treated them?",
      "id": 222,
      "comments": [
        {
          "score": 1079,
          "content": "The son was rewarded for failure (not that he actually failed, but he achieved far less than his sister) while daughter was punished for being successful in the arts (often derided for its association with femininity). Typical, oppressive blueprint. Congratulations, OP, you’ve passed generations of sexist conditioning onto your children and done a massive disservice to them both.",
          "id": 223,
          "comments": [
            {
              "score": 315,
              "content": "No son was rewarded because his choice of engineering for his degree was acceptable to op but his daughters music degree was considered worthless to op.",
              "id": 224,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2192,
      "content": "YTA. You stiffed her because you didn't like her field of study. Also, as someone who has a MS in a STEM field and only made about 35k annually after graduating with it, your obsession with grad school is weird",
      "id": 225,
      "comments": [
        {
          "score": 731,
          "content": "As a lawyer with 200k in student loan debt I have to agree",
          "id": 226,
          "comments": [
            {
              "score": 223,
              "content": "My college roommate made what I make now coming straight out of undergrad. Never even thought about grad school. If someone wants to do it, I say go for it. But doing it for the sake of doing it is a waste of time and money",
              "id": 227,
              "comments": [
                {
                  "score": 27,
                  "content": "Exactly, grad school is only worth it if you plan to use it to massively accelerate your career and have already made an effort to allow it to do so.",
                  "id": 228,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 94,
              "content": "As a lawyer, technically isn't it stealing from her own daughter?",
              "id": 229,
              "comments": [
                {
                  "score": 43,
                  "content": "I’m not an estate planning attorney, but no. It’s weird but the beneficiary (the daughter) of the education fund is not the owner of the fund. It is unclear whether the parents or grandparents own the fund. It kind of sounds like the parents are the owners of the fund because of the way this post was phrased - “we” took our money for our son etc. but they still assert that the money belongs to the grandparents. If there is an education fund that goes unused, it can just remain there and the beneficiary changed to someone else - they could leave it for her if she wants to go to grad school like they wanted or even change it to one of her kids or one of her brother’s kids down the line if there are any. The beneficiary can change as many times as the owner wants it to. If they take the money out and use it for non-educational purposes however it’s then taxable income. Which is probably one reason why they don’t want to give it to her now. Either they or her grandparents (probably they) would have to pay a 10% penalty on the earnings and any earnings growth would be added to their income for tax.",
                  "id": 230,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "As a current STEM PhD student his obsession with grad school is weird. Both my sibs have better job prospects after their bachelors than I do. I just... am at a loss.",
          "id": 231,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2041,
      "content": "Just FYI, if the edit you made is genuinely all the effort you made to put things right, you're pathetic. You need to give her the money and make up the difference for the fee, as you've stolen her money\n\n\nYTA even after the edit",
      "id": 232,
      "comments": [
        {
          "score": 177,
          "content": "Yup, they owe that girl so much more than the money.  Her life could have been different, so much better - and even after the secret was revealed, she had to ask and was denied.\n\nWhat a slap in the face from your own parents, that's a wound that won't heal...",
          "id": 233,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}