{
  "post content": "Throwaway because my friends know my main account.\n\nI (M17) and my mum (F39) moved in with my step dad \\[SD\\] (M46) and step brother \\[SB\\] (M15) around two years ago.\n\nSo I have a nice sneaker collection that I have amassed through working a casual job and reselling sneakers. Now SB, who hasn't showed any interest in my sneaker collection previously, I guess is at the age now where it matters more. He has been coming into my room more often to have a look at the collection, and he has also recently grown into the same size as me... this is important.\n\nRecently he has been asking me to let me wear some of the shoes in my collection. I'm opposed to this because:\n\n1. They're my shoes. I feel like I should have the final say in who gets to wear them.\n2. He is not careful and absolutely thrashes his shoes.\n3. Common sense, but wearing a shoe decreases it's value significantly. I like to hold some unworn in case the price spikes.\n\nSo every time he's asked I've told him no. Recently he told me that he has a very important outing he's going to (he's just going out with friends) and wants to wear one of the shoes. I told him no, but this time he threw an absolute fit and got SD involved. SD told me that I'm being greedy and that I should just let SB wear one since I have so many. I told him that I value each and everyone of them and told him the resell value of the pair and SD was absolutely shocked. This devolved into an argument about me paying rent, when really I paid for the RETAIL price and not the RESELL price which he does not seem to understand. SD and SB left when they realised I wasn't budging.\n\nI thought the situation was over. I headed off to work on Saturday. However, on the bus ride home I was scrolling through Instagram and SB posted a picture of himself wearing the exact shoe that I did not let him wear. I was so angry, and I commented \"Why the fuck are you wearing my shoes?\". He deleted my comment, but it seems like it was too late. Some of his friends saw, which embarrassed him because he had told them that the shoes were his. He told SD about what happened who called me in a fury asking me why did I have to embarrass his son like that, and that the shoes were worth fuck all. I yelled at him back that SB had no business wearing my stuff and I had the feeling that SD encouraged it to, so fuck the both of you and hung up.\n\nWhen I got home I got full on yelled at. He told me that I should be lucky that I am allowed to live under this roof. My mum stepped in to defend me and now they have been arguing for the past day and a half. I asked SB to give me my shoes back and he did. I told him to never touch my shit again and have been holing it up in my room since.\n\nThings are really tense in the house now.\n\nSo Reddit, AITA for not allowing my brother to wear my shoes, and then embarrass him on Instagram when he did so anyways?",
  "id": 1,
  "comments": [
    {
      "score": 25803,
      "content": "NTA. Your stepdad sounds abusive. You're 17, he shouldn't be demanding rent or threatening to throw you out. It's his job as the parent to provide housing. \n\nYour stepbrother deserved to be called out. He stole something to pass off as his, and it's his own fault he got negative reactions when the truth was out.",
      "id": 2,
      "comments": [
        {
          "score": 8251,
          "content": "Also. OP should consider buying a doorknob with a lock and key or an electronic lock. Something he can lock up while he’s not there.",
          "id": 3,
          "comments": [
            {
              "score": 6127,
              "content": "Something tells me SD is the type of guy who would lose his shit if he did this. He very much seems like a “you don’t get to lock your door in MY house” kind of guy.",
              "id": 4,
              "comments": [
                {
                  "score": 2291,
                  "content": "Maybe by the lock for his closet?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2045,
                      "content": "Or a secure foot locker.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 52,
                      "content": "Do this!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "Locking suitcase also an option",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 398,
                  "content": "Then these parents wonder why their kids go low contact when they become adults.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 30,
                      "content": "[deleted]",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 185,
                  "content": "So Boobie traps It is. But for real, OP could Invest in a lockable display case for his collection.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 135,
                      "content": "I think this is a great idea. OP is very proud of their collection so having a cool display case would probably excite them a lot. Plus display cases are lockable, like you said.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 105,
                  "content": "He should tell his mom to tell the SD that the collection is no different than baseball cards or comics. That they are an investment and that's why they are not to be worn",
                  "id": 13,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Maybe OP should charge step-dad/ step-brother the loss of revenue they would have gained in reselling the shoes in unworn condition. It would help drive the point home about them being an investment. If the price difference is significant enough they could even threaten to go to small claims court. People do it for the baseball cards and comics.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I'm pretty sure OP has already tried to make this point multiple times to both step dad and step bro.  They just don't believe / care.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 75,
                  "content": "Back when I was a teen, this would’ve been even MORE of a reason to get a lock on the door - just to piss that fucker off ha ha",
                  "id": 16,
                  "comments": [
                    {
                      "score": 17,
                      "content": "In my house, being defiant got me injured, and OP's SD sounds pretty similar to mine.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 75,
                  "content": "And take the door off completely because he’s an entitled prick just like he’s raised his son to be. \n\nNTA Op. I’m glad your Mom is seeing this side of him now and protecting you.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "He should put motion censor cameras too so when the SD comes in to destroy stuff, cos it sounds like he will OP has proof and can get him charged and get damages.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "What's worse though? A blow up over a locked door, or potential irreparable damage to the collection? Because to me that's the vibe of where this is headed. OP needs to find secure storage space for his shoes, as well as take pictures of and document every pair in their current condition. That way if something, god forbid, does happen, he has the evidence to take the matter to court for destruction of property. If the shoes are worth as much as he says they are, this needs to be done ASAP.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 8,
                      "content": "This needs to be higher! Lots of people saying that OP should secure the shoes somehow, and he should if he can, but regardless of that he should absolutely take photos and document every pair, the condition they're in, and what they're worth.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Get those security cam that is set up easily on the computer and alert you through motion sensor of any passerby. Just like a ring doorbell",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "where the fuck is OP's mom through all of this?  100% she should be intercepting this argument and telling stepdad to get his son in hand.  OP works for his money, he can spend his money how he likes as he's a fucking minor, and everyone needs to gtfo of his room",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 170,
              "content": "I'd say something like a safe for the shoes, anything else he deems valuable, and his personal documents. He can hide it in the back of his closet or under his bed or a desk. This seems like a situation he'll have to leave at 18 tbh. I'm glad his mom is sticking up for him though, it might not be so bleak.",
              "id": 24,
              "comments": [
                {
                  "score": 330,
                  "content": "If he’s worried about SD going even more ballistic or them trying to damage the shoes, maybe OP could even move the shoes to a trusted friend’s house for the time being?",
                  "id": 25,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Or rent a small storage unit?",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Take the guns out of the gun safe and put the shoes in",
                  "id": 27,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Unsecured firearms are not going to improve this situation.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I would suggest OP should find somewhere secure outside his SD/ SB home to store the shoe collection and seriously start considering where he is going to live after he turns 18 because this seems like it’s only going to get worse. \n\nOP is NTA\n\nA lock on the door is unlikely to work. Likewise a safe or other security device inside the house will be an argument “starter”. At this point it’s clear the SD has no respect for OPs possessions and views them as “family” asserts which SD has control over.\n\nAlso, not just the shoes. Anything OP has would likely fall into this category of “family goods SD controls.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Or, if SD won't allow a lock on the door he should buy a lock for the closet and keep all the shoes in there.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "At least some way to lock up his inventory.\n\nI have a doll collection and I would be livid if someone walked in and snatched one of my girls off the shelf for a kid to terrorize 'because you have so many'.\n\nSome of my dolls are vintage, some antique, and some irreplaceable. They're not there to be manhandled.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "OP should look into a storage unit for his shoes tbh. They won't ever be safe in that house",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 514,
          "content": "Not to mention, stepbrother posted about using the shoes in a public forum that OP could see. Not the brightest bulb if he didn’t want to be called out. This part of it makes me laugh.\n“Why are you wearing my shoes” doesn’t sound like a malicious attempt to embarrass someone.\nNTA. Kudos to mom for defending OP over her husband.",
          "id": 33,
          "comments": [
            {
              "score": 204,
              "content": "Oh, sb wanted OP to see that he was wearing the shoes. \"Haha, dad said I could wear the shoes, you are powerless\" is the unstated message here.",
              "id": 34,
              "comments": [
                {
                  "score": 46,
                  "content": "I considered that. Even if it was intentional, it still wasn’t smart. SB assumed OP wouldn’t call him out. There is an old saying about assuming...",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 120,
              "content": "In high school, my little sister was struggling with impulsive pathological lying as some sort of coping mechanism to fit in at her all girls christian boarding school (she chose to go but instantly regretted it). She would take pictures off the internet and caption them as \"me in ballet class as a baby\" or \"rainy day with my umbrella\", but I could easily figure out they weren't her because a) I know what she looks/looked like and b) I would google \"baby ballet\" and \"girl with umbrella\" and immediately find the images. \n In her case, I would privately call her and ask why she was doing this (she always had a lie like \"oh mom sent them to me how weird\") and I'd gently tell her to take them down before someone at her school figures it out. I didn't do this to shame her, but I was genuinely concerned about her lying going unchecked.\n\nThat being said, if she was stealing my stuff or achievements, I'd FOR SURE go public and comment on the pics. Especially if we'd already discussed it beforehand. NTA OP. SB fucked around and found out.",
              "id": 36,
              "comments": [
                {
                  "score": 30,
                  "content": "You sound like a good sibling",
                  "id": 37,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Thank you. We definitely fought quite a bit growing up but I always made sure not to use the lying against her, because I knew in her mind these lies were her reality.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I really would love to understand the psychology behind ppl who do this. Like why. What is the point, and why tell lies that are so easily disproven?",
                  "id": 39,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I could never understand either, but I always assumed it had something to do with her being the youngest of 3 siblings and a child of divorce, and inherited from my mother who has a history of embellishing stories that she seems to believe to be true. \n\nFortunately, she's mostly grown out of this behavior and now lives a relatively successful life independently :)",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 244,
          "content": "I'd go farther with that and say that OP should encourage his mom to divorce the asshole. Boundary stomping isn't the only thing he's guilty of.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 220,
          "content": "Why the fuck can't the step-dad buy his own son his own shoes??",
          "id": 42,
          "comments": [
            {
              "score": 124,
              "content": "I'm guessing that step dad also knows the kid is destructive with his shoes. Since it sounds like these are brands that are probably upward of 150 new, he probably doesn't want to spend his money on something that will get trashed, and instead wants OP to be out the money.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 178,
          "content": "The problem is, SB stole something, got called out on it on a deleted Instagram post, and SD *went berserker over that against OP* multiple times. \n\nSB is fifteen. And he's learning from his father that people are horrible monsters for accusing him for theft whenever he steals.\n\n*This is not going to end well.*",
          "id": 44,
          "comments": [
            {
              "score": 3,
              "content": "Perfectly stated.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "Pay rent?  Dafuq?!  My kid is that old and I would never ask him for rent. MY KID IS MY RESPONSIBILITY.  \n\nGlad the mom stepped in and hopefully put the kibosh on it. \n\nOP needs a lock in their door and to start saving money. Because I have a feeling SD is going to be a monster on that 18th birthday. \n\n\nAbsolutely NTA OP.",
          "id": 46,
          "comments": [
            {
              "score": 16,
              "content": "Right? I would want my 17 year old to focus on school and figuring out whether they want college or trade school or whatever. Not to focus on if they're going to make rent this month.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "Jumping on top comment to say to sue your stepdad. He's responsible for his son's ruining the value of the shoes. You shouldn't have to eat the loss of monetary value in them.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "When you steal, we label you a thief and call you out! So if SD and SB don't want to be embarrassed then SB (sh***y brother) should not steal!\n\n🤣🤣🤣🤣🤣",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "It’s so messed up that demanding rent was his first response to finding out that a teenager has a decent amount of money. NTA but I hope OP’s mom realizes what an AH stepdad is",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Also, an older brother calling out another brother for something like wearing their shoes is normal sibling behavior. SD sounds insane. Good on your mom for having your back. NTA",
          "id": 51,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9645,
      "content": "Tell him if he wants to start charging you rent you’re gonna start charging his son with theft…\nHe knew you were part of the package when he married your mom and moved you into his house.",
      "id": 52,
      "comments": [
        {
          "score": 1682,
          "content": "I really LIKE this suggestion.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1603,
          "content": "Stepdad sounds like the kind of guy that wanted the mom but was hoping she'd drop her son with his dad or relatives. Feel sorry for OP.",
          "id": 54,
          "comments": [
            {
              "score": 600,
              "content": "While full on expecting her to spoil his son rotten",
              "id": 55,
              "comments": [
                {
                  "score": 184,
                  "content": "All of this. My heart hurts for anyone in situations such as this. It's got to be so uncomfortable, just downright horrible to be somewhere you're not wanted. SD and SB both sound like childish. Hope you can move away from this living situation soon.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 77,
              "content": "I know, what planet do these people come from, ferchrissakes???",
              "id": 57,
              "comments": [
                {
                  "score": 8,
                  "content": "Ues, op should tell stepdad if he wants his son to be able to waer fancy sneakers, he can pony up for them",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "God I would love to see that in eviction court. Stepdad trying to throw out underage son. Judge would have a field day.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 257,
          "content": "Considering they're back in his possession the cops won't do anything. You could very much take them to small claims court though for the loss in value of the shoes. The brother even kindly provided photographic evidence.",
          "id": 60,
          "comments": [
            {
              "score": 93,
              "content": "I don't know where this story takes place, but the theft still happened. In most jurisdictions it doesn't matter if you get the stuff back after it's been nicked. At the very least, the cops should give \"words of advice\", which basically means the telling off her never got from his actual parental figures.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "OP should make sure he gets screenshots of SB wearing the stolen shoes.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 201,
          "content": "Not sure if OP has done this already or not but make a catalog of all of them with photos and prices in case something happens and you have to report theft. Also NTA your SD and SB are tho.",
          "id": 63,
          "comments": [
            {
              "score": 17,
              "content": "This \\^\\^\\^\\^\\^\\^\\^ exactly!!",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 118,
          "content": "Why didn’t the stepdad yell at his son for not hustling harder?",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "I can’t upvote this idea enough",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Why didn’t the stepdad yell at his son for not hustling harder?",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Genius lol",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "This, and also remind step-dad you can't tell your son or stepson you have to pay to live there whilst still under 18. I'm sure that'll fly with CPS if OP has to take it that far.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4393,
      "content": "You’re 17. They can’t charge you rent legally. Your SD is an all around AH (in this case at least)\n\nMaybe he should encourage his son to work for what he wants rather than steal it.",
      "id": 70,
      "comments": [
        {
          "score": 789,
          "content": "Or if its that much of a big deal buy his son the sneakers.",
          "id": 71,
          "comments": [
            {
              "score": 472,
              "content": "They likely aren't interested in doing the work to pay the lower values like OP did. Some shoes release for $170 but at such a low value they resell at $500-1000 within a day.",
              "id": 72,
              "comments": [
                {
                  "score": 271,
                  "content": "As a mild sneakerhead I can vouch for this - those things can sell out in under an hour, easily. Then the aftermarket will have it's way with you. It feels like videogame console/graphic card scalpers have got nothing on sneaker/toy scalpers.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 68,
                      "content": "Man I've seen shoes sell out in minutes",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "this is actually a good idea imo, OP should tell his father to just buy the shoes for him. He’d then see the difference between retail and resale prices and why OP wouldn’t let his SB wear them.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "An *abusive* AH.",
          "id": 76,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 42,
          "content": "Unfortunately, depending on where OP lives, parents can charge for rent after age 16.",
          "id": 77,
          "comments": [
            {
              "score": 34,
              "content": "Do you have a source for that? Everything that I find when I try to look this up says that a parent in the United States (not sure where op is from) has to provide their underage child with food and shelter as a bare minimum.",
              "id": 78,
              "comments": [
                {
                  "score": 61,
                  "content": "Not everywhere is the US.\n\nOP says mum, so that suggests they’re not in  the US. In the UK it’s perfectly legal to charge a 16 year old rent/board.\n\nAlso - NTA OP!",
                  "id": 79,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Don’t they say “trainers” and not “sneakers” in the UK though?",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "Legal age to live alone in the UK is 16. Plenty of people get hoofed out at that age. It’s disgusting. OP says his mum in the post so he’s not American.",
          "id": 81,
          "comments": [
            {
              "score": 15,
              "content": "I call my mom mum on occasion and am American.",
              "id": 82,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1837,
      "content": "NTA, at all. \n\nThey don't respect you bor your private property, that's theft.\n\nYou should start looking for an affordable storage where you can put your shoes very far from their hands.",
      "id": 83,
      "comments": [
        {
          "score": 476,
          "content": "I wouldn't put it past SD to try and sell his shoes as payback.",
          "id": 84,
          "comments": [
            {
              "score": 245,
              "content": "My thoughts exactly, that SD might attempt to cash on them since OP told him how valuable they are. \n\nNTA btw. You paid for the shoes, you get to decide what happens with them.",
              "id": 85,
              "comments": [
                {
                  "score": 57,
                  "content": "SD would totally sell them to pay for the rent he shouldn't be charging his step-son.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 182,
              "content": "OP PHOTOGRAPH AND DATE EVERYTHING YOU HAVE",
              "id": 87,
              "comments": [
                {
                  "score": 29,
                  "content": "this! I hope you get to see this comments on time to protect your shoes,",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I was just about to say this exact thing. Photograph and also get the receipts together to prove ownership.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Someone else suggested renting a cheap storage lockup or some sort of safe deposit box off-site, which would be a better option if this is a concern. SD doesn't even need to know about it, OP could say he sold the shoes.\n\nAlso, if this is part of a legit business, you should be able to get some sort of insurance to cover assets? Not an expert though, so probably sensible to research that properly.\n\nEdit: fixed a dumb typo.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "This would be my suggestion as well. Move your stuff there and get out dodge as soon as you can",
          "id": 91,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1165,
      "content": "NTA\n\nCan your mom help defend you in all this?  The comments like \"living under my roof\" and wanting you to pay rent smack of evil step parent.   \n\nIf mom cannot or wont defend you, is your bio dad in the picture?  Or some other adult family member?",
      "id": 92,
      "comments": [
        {
          "score": 1250,
          "content": "My bio dad unfortunately passed away when I was very young.\n\nI don't know she gets pissed on my behalf but I don't think it has really gone anywhere. My relationship with SD has always been tense and we don't really talk unless it's over dinner and it is never about anything meaningful but this is the first time he's proper blown up at me.",
          "id": 93,
          "comments": [
            {
              "score": 976,
              "content": "Sooner or later SD will confiscate some or all your shoes in the name of rent or something. Get a storage unit and store them in there. You surely can find a way to finance it until you move away.",
              "id": 94,
              "comments": [
                {
                  "score": 469,
                  "content": "This is answer. Store your stuff. Don’t tell them. Just say the collection is no more. Save 3 or 4 pairs to wear and start your escape plan.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 327,
                  "content": "I agree. Also keep documention of the shoes (receipts, photos of serial number) in the off chance that he does sell them so you can charge him.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 138,
                      "content": "This is good advice. Both police and insurance companies will want proof that you owned them in the first place.\n\nI'd also suggest getting some basic contents/asset insurance, depending on if this is a business or personal. Most places will do some sort of student rate for just your stuff and not the room it's in.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 95,
                  "content": "This is a good idea. That way, your stuff can't be taken under \"his\" roof.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 78,
                  "content": "Storage unit or a friends house that you TRUST not to wear them and knows their value/importance to you. I’d say car, because that’s where i put stuff I don’t want people messing with, but I know heat/humidity can do damage to shoes so unless you’re somewhere cold rn, that’s probably not a good idea lol. \n\nMy uncle also collects shoes and other things and has some he wears and duplicates that are selling ones. He stores it at my grandmas house and everyone knows not to touch stuff in his closet without asking him when we are over for holidays lol",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "And get an insurance policy on the shoe collection, whether you put them in a storage unit, which has risks, or if you find a way to secure them at home",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 117,
              "content": "Have you told her everything? Like how SD threatened to start charging you rent and kick you out? You and she should talk privately about everything that’s been going on. She needs to have all the facts.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "Can you at least get a lock on the door? You can also install a lock on the closet door if they won’t let you look the room itself.",
              "id": 102,
              "comments": [
                {
                  "score": 50,
                  "content": "He might not be allowed a lock on the closet either. SD seems controlling and like the type to demand access to everything. Storing off the property altogether is probably a better way to go if OP can swing it.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "So at the next dinner, this is what you are going to do. You are going to be excited that step brother is interested in sneakers and you are going to encourage him to invest in them, too. Encourage him to get a job, like you have, so he can afford his own shoes. Then, tell him you will take him to buy the shoes he wants when he has the money to do so. Focus on the fact that while your shoes are 100% off limits, you are willing to teach him what he wants to know.\n\nWhen they both decline and get upset, emphasize the fact that you are willing to share your knowledge but not your investment. Or maybe if the household is all about sharing investments now, its time for SD to share his 401K shares with you... because you know... we're sharing.",
              "id": 104,
              "comments": [
                {
                  "score": 13,
                  "content": "It makes me so sad that I have to scroll down so far to see a comment that actually tries to find a non-conflict way out of this whole sh*tshow… \n\nHonestly, this community seems to suit people who want to be told they’re right - not people who would genuinely live in peace with the people who also live in their house….",
                  "id": 105,
                  "comments": [
                    {
                      "score": 7,
                      "content": "How is getting a locked box or storage unit conflict?",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "NTA. Honestly, call your local domestic violence agency and tell them you live with an emotionally abusive step parent and works like their help planning for your safety and the safety of your belongings. They might be able to help you plan and navigate this. They might not have any experience with a minor calling about a step parent, but some agencies will have experience helping. Also, I’d rent a storage unit and move them off site from SD’s home.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Honestly, you may want to have a conversation with your mom. You should ask her if your SD is more important to her than you, and if so, you will be cutting contact as soon as you are eighteen and leave the house. I would also take the advice here and think about securing your property. Your SD sounds like a vengeful ass and will probably ruin your collection. At the very least, make sure that you document the shoes you own with pictures and face several copies so that you can go to the authorities should something happen. But you honestly need to sit your mom down and have this important conversation about the abuse you are suffering. If she doesn’t do something, I would get a counselor and family involved because that is the only way you will be secure. Also think about saving up to leave their home. I can assure you that your SD is planning to throw you out the day you are 18.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 51,
          "content": "His mum DID defend him",
          "id": 109,
          "comments": [
            {
              "score": 102,
              "content": "Powerlessly defended him.  Clearly, SD rules the roost and mom doesn’t get a vote.\n\nGet you mom to rent and-storage thing for you, and move everything that is truly yours to it.  The change the lock from the one your mom put on it - she has no power to keep it from SD when he notices and demands it.\n\nIs your mom safe in that relationship?\n\nWhatever your plans for after high school are, make sure they involve moving out as soon as possible!  It is more difficult to start out as an adult without the help and support of your family, I won’t lie - but it is possible, it won’t hold you back from creating the life you want for yourself, and you can do it.\n\nReach out to extended family members - could you stay with them until you get on your feet?  IN between semesters at college?",
              "id": 110,
              "comments": [
                {
                  "score": 62,
                  "content": "Once his mom knew the situation she stepped in immediately from the sounds of it. They have been arguing for 1.5 days. Doesn't sound like she's just letting it go. It sounds like she is properly sticking up for her kid to make sure this doesn't happen again. \n\nAlso keep in mind that mom likely doesn't know that SD asked for rent or anything SD said directly to the kid. She just knows that her SS stole her sons sneakers and SD backed up that behavior. From this one situation we can't really evaluate if SD is abusive, hates OP or anything like that. It may come about that he apologizes to OP and realizes he screwed up. Most likely not but that would be ideal.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 36,
                      "content": "And, OP, this is where you need to sit down and tell your Mom EVERYTHING. Every altercation, every financial request, every time he's tried to throw his power. She needs to know the full picture.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 614,
      "content": "NTA and just so you're clear your mum and stepdad aren't arguing because of you. They are arguing because of him and his mis-treatment of you. I hope you see the difference. You didn't cause it, he did.",
      "id": 113,
      "comments": [
        {
          "score": 59,
          "content": "Brilliant point - and totally accurate.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "This comment should be higher!",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I feel like this is the tip of the iceberg, there's probably some really bad shit going on between the mother and SD that OP doesn't know about.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 459,
      "content": "NTA. He literally stole from you and his dad is yelling at you for embarrassing him? Personally, if people in my house couldn’t respect my things, I’d lock them away. Either have a lockable cupboard or lock my whole room",
      "id": 117,
      "comments": [
        {
          "score": 74,
          "content": ">if people in my house couldn’t respect my things, I’d lock them away.\n\nyo, that’s false imprisonment. not cool.",
          "id": 118,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 439,
      "content": "NTA that was highly disrespectful of him to wear your personal stuff after you told him NO. It doesn’t matter how many pairs you have, NO means NO and SD is also an AH",
      "id": 119,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 295,
      "content": "Stepbrother is a thief. He straight up stole from you, posted proof on social media and then tried to pass them off as his for clout. Tell mom she needs to get involved with this, you can’t be worried about your only personal properties’ safety. I would demand the price of the damage for the shoes too if there is any (idk I’m no sneaker person) like did he scuff it and it needs to be now cleaned or does wearing them drop the resale value by 15%?\n\nNTA!! SD, SB are the AHs. And mom if she doesn’t defend you and your stuff in this situation!",
      "id": 120,
      "comments": [
        {
          "score": 72,
          "content": "So much this!  He definitely devalued the shoes by wearing them.  The souls are going to be scuffed and you can't sell them as new anymore.  \n\nNTA",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 265,
      "content": "NTA  I didn’t understand anything about sneakers until I watched this Ted Talk: [The Secret Sneaker Market - and why it Matters](https://youtu.be/q49LtMyXK7Q). It was astonishing. If your step brother lowered the value of your shoes, you should charge him. You should also consider keeping your collection some place more secure.",
      "id": 122,
      "comments": [
        {
          "score": 74,
          "content": "Next, he's going to deliberately harm the shoes to get back at you. And his Dad will continue to defend him. \n\n> You should also consider keeping your collection some place more secure.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "That was fascinating, thanks for sharing the link!",
          "id": 124,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}