{
  "post content": "My wife is on her first and *last* pregnancy. She's in her early twenties but has had holes in her uterus in the past and miscarried previously.  This one is super high risk and the doctors visits have been frequent and stressful. After this my wife will be getting sterilized and I'll be getting a vasectomy. She's currently 7 months pregnant and all she's been craving is plain grilled ground beef *SOAKED* in garlic powder , red crushed pepper and Sriracha and peanut caramel marzipan. As the person who has to smell it and kiss her I prefer to spoil her with the marzipan and it's much quicker for her to be able to eat. I'm doing my best to spoil her because this is her first and only full term pregnancy she'll be able to experience. \n\nI bulk bought some marzipan candies for her and placed them in her cubby in the pantry (where she keeps her maternal vitamins, anti-nausea pills and snacks). My wife's sister came to visit with her daughter for two weeks (This Sunday) and we welcomed them to the pantry but asked that fhey not touch anything in the cubbies because those are especially for us. \n\nI went out to run errands the other day and came home to my wife on the couch holding her stomach and crying. I assumed the worst and asked what's wrong and she told me that niece had eaten up all her marzipan and there was no ground beef and it's all she wanted and everything else smelled disgusting. I asked my SIL about it and she said it was just candy and my wife shouldn't be eating so much sugar during her pregnancy anyways and that she can't expect a kid not to want candy. I asked her to replace it and she said no, and that I could buy it since it was so \"precious\". I told her to leave the next morning and she groaned and grunted around about how bad I'm treating family around the house til she left. My wife's family is calling me an ass for kicking them out over something so silly and that I could've just bought more. It all feels so silly but I'm beginning to doubt myself here.\n\nExtra INFO: My wife does have a balanced pregnancy diet (approved by her OBGYN) we try to adhere to, consisting of oatmeal, fruit, rice and beans chicken (baked or grilled) vegetables, mineral water and vitamins. The cravings are not ALL she eats, it's just what she eats when she's *craving* it. Please have a little more faith in me as a husband that I won't gorge my wife on sweets while she's in a high risk pregnancy.\n\nFINAL EDIT: I received my verdict,  however when things calm down I will be speaking to my SIL and trying to make ammends if she's willing to apologize.  My niece is nowhere at fault because her mother should have parented her. My wife is fine now, she's eating a big bowl of ground beef as I type this. I showed her the comments from other pregnant women and she really appreciated them, she doesn't feel so alone in her \"mommy madness\" anymore. Thank you all for your time.",
  "id": 1,
  "comments": [
    {
      "score": 13296,
      "content": "NTA\n\nYou gave a clear boundary, they crossed it. Your wife has specific cravings, your Doctors would be the ones to give you the food advice and whether its too much etc not the family. After the trauma your wife has been through these people seem to have no empathy for her.",
      "id": 2,
      "comments": [
        {
          "score": 4259,
          "content": "[deleted]",
          "id": 3,
          "comments": [
            {
              "score": 3146,
              "content": "I would be asking your wifes family \"Why do you hate my wife? Why is SIL kid more important than my wife? Do you want to ever meet our child?\" And then have your wife block everyone who hasn't been 100% supportive so you can still record their terrible takes that make it clear and in writing they don't deserve a place in your wife. Yes, this is a nuclear option, so only do so if you and your wife agree about it, but SIL deliberately sabotoged you guys with her actions and with her words. Unless she gives an actual apology (that should include marzipan candies that she doesn't steal again) she is banned from the house, as is anyone who supports her. Hell, she might even be jealous if she has been the only daughter with a child and wants to add stress to your wife in bopes to keep that status quo. Idk your situation, but I would not let this go and be clear with family that you and your wife will not tolerate bad behaviour.",
              "id": 4,
              "comments": [
                {
                  "score": 918,
                  "content": "I would block them just so the high-risk pregnant lady doesn’t get stressed unnecessarily.  It is a silly fight, but one that they’ve started and escalated. And your SIL saying your wife is too precious is just mean. Very mean.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 156,
                      "content": "I agree that it is mean, but not about it being a silly fight.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "She said the candy is too precious, not the wife is too precious.   Different meaning, but still mean.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Maintain as little contact with this person and her family as you can. This will not be the first time she pulls some stunt like this and once the baby is here there's no predicting her actions.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 83,
                  "content": "Thats not nuclear. Its appropriate.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Sometimes the nuclear option is also the appropriate response.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": ">Why is SIL kid more important than my wife?\n\nIt is hard to believe that a kid ate a bulk quantity of marzipan so fast. I suspect that SIL took it away as \"an intervention\".",
                  "id": 11,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I don't know, OP's marzipan sounds really good. It would certainly be in danger around me. Lol but I would have been embarrassed I ate it and replaced it. I binge eat sometimes and it's not great. But your suggestion that she just took it is also plausible.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I didn't even think about the status quo!! Holy Hell!!",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": ">make it clear and in writing they don't deserve a place in your wife\n\nPretty sure you meant life and not wife!!",
                  "id": 14,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Did you really just try to imply that the sister did this to try and make OP's wife have a miscarriage? And this got thousands of upvotes and awards... What the actual fuck is wrong with the people on this sub...",
                  "id": 15,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yeah nah, this sub is full of totally normal and rational people who are 100% in touch with reality, and anyone who thinks otherwise is GASLIGHTING!!1",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "you sound lonely",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Manipulative much? Is everything OK at home?",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "THIS RIGHT HERE!!!",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -7,
                  "content": "Yes, let’s just blow up family relationships over CANDY. I get the frustration. It was rude of the SIL and niece. But this is ridiculous.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Including the context and her reaction to being confronted, it was *beyond* rude. The entitlement is so astonishing I would not trust someone like that in my house again.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 338,
              "content": "There is a possibility they have no idea about the trauma. Most people do not talk about early-term miscarriages. There is a chance they think this is her first pregnancy and she is being obsessive about what she wants to eat. \n\nI still think it is fine to be like \"look, we said don't eat what's in this pantry, and you did anyways, so out you go\", because they aren't accepting clear boundries as house-guests, and won't even replenish them! But they also might not get why this is such a big deal to the couple.",
              "id": 22,
              "comments": [
                {
                  "score": 242,
                  "content": "It's her SISTER.  Of course she knows.  But even if it wasn't her sister, she still needed to respect the boundaries--and the worst thing of all, after learning what she'd done, a decent person would apologize and hurry out to replace them!",
                  "id": 23,
                  "comments": [
                    {
                      "score": 87,
                      "content": "It's absolutely possibile that family didn't know, even as close as sister. Especially if previos miscarriages were after short pregnancy. Many people don't say they are pregnant until later months and big reason for that is not having to talk about that hurtful experience when something bad happens.\n\nedit as a reply to comment below (/justdafaxt): i'm just disagreeing with comment above which claimed that people 100% know about miscarriages of their sisters. In many cases they don't.\n\nI absolutely don't defend stealing snacks. Sister had a rule that she didn't follow. She was given an option to fix this which she refused. Kicking them out was imo justified.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 39,
                      "content": "My sister's don't know about my miscarriages. I will never tell them because I cannot trust them with that information. It will be used to hurt me. So I chose to withhold it even once I could speak on it. It took years for me to tell anyone. The casual cruelty of her sister who would shame a pregnant woman and ignore boundaries makes me question if the wife would in fact disclose this. It is hard to be vulnerable when you know it will just bring more pain. I am glad you have experiences that didn't bring to mind distrust. Not sarcasm but sincere note for text tone. It's just not all of us do.\n\nOp NTA. Pregnancy or not this is clearly a boundary being stomped and a consequence. What would come next? More of that. Your obviously has good taste in partners and I hope you both have a healthy baby and easy labour",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "None of my family knew about my IVFs and losses because I already was clued into some potential toxicity.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 194,
                  "content": "If they are religious you could even tell them, Adam and Eve got kicked after being told not to eat from 1 single tree, that all the other were fine, **just not that one**, they did OUT they went...",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "yeah, sometimes AH'es might not be aware of how big of an AH they're being, even if giving them benefit of the doubt still would make them somewhat of an AH.\nfor example, raiding your liquor cabinet not knowing how valuable the bottle was",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "She even had the chance to replace it, but scoffed. NTA",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Right? He's supposed to respect that the daughter wants candy but not respect that the wife wants candy.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yeah and he buy in bulks, the kid finished it in one go, so inconsiderate. If im the pregnant one, I'll be the one who kicked them out.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "And then had the audacity to say OP was treating family bad. I can smell SIL’s entitlement from here, ugh.",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1190,
          "content": "NTA it was literally the one thing you asked of them and they went and opened the cubbies anyway and helped themselves. They shouldn't even have touched them. And refusing to replace them too??? Wtf??? \n\nThis isn't about candy, it's about them being absolutely entitled and disrespectful.",
          "id": 33,
          "comments": [
            {
              "score": 282,
              "content": "You're absolutely right. It isn't about the candy",
              "id": 34,
              "comments": [
                {
                  "score": 341,
                  "content": "The Iranian yoghurt is not the issue here!",
                  "id": 35,
                  "comments": [
                    {
                      "score": 171,
                      "content": "Man the curiosity got me and I had to google that... I'm still laughing! I'm so sad there was no update from the account.\n\nFor anyone else wondering: https://www.reddit.com/r/AmItheAsshole/comments/bjd41e/aita_for_throwing_away_my_boyfriends_potentially/",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 35,
                      "content": "I almost keeled over laughing.  IYKYK.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Perfect line drop. Absolutely dying 😂 I wonder if that guy ever realised his one liner became part of Reddit history?",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 35,
                  "content": "all i can hear in my head is james from vanderpump rules yelling ITS NOT ABOUT THE PASTA!!\n\noh, and OP is definitely NTA.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 15,
                      "content": "My two worlds colliding right now. Lol. Love a Bravo reference in the wild.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 159,
              "content": "Not to mention. (Okay tbf idk if they were see through cubbies) but if they werent seethrough, what do you wanna bet that the sister went out of her way to look in to see what was in them BECAUSE they were told they couldnt have it and she could stand it and showed her kid and then gave her all the candy because now kid sees it and is gonna whine????\n\nEdited to fix some wording",
              "id": 41,
              "comments": [
                {
                  "score": 48,
                  "content": "She also could have told her daughter that is aunt’s special candy then offer to go get other candy",
                  "id": 42,
                  "comments": [
                    {
                      "score": 75,
                      "content": "[deleted]",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "also the fact that OP said he bought the candy in bulk and the kid went through the ENTIRE SUPPLY in less than a day. even if it was just a normal off-limits stash of sweets, the absolute least SIL could've done was pay for it.",
              "id": 44,
              "comments": [
                {
                  "score": 60,
                  "content": "And if SIL is so worried about diabetes, what about her child consuming that much sugar in one day?\n\nOP is NTA.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "This right here! I mean to refuse to replace it is just such a trashy thing. Absolute lack of respect",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "I can't understand so many hpuse guest AITA.  Sure, your kid wanted whatever at some inhospitable time.  First thing I would do is say, oh so sorry. My kid got into your candy, where or how can I replace it immediately?\n\nI'm a fucking guest, not my house, not my family, it's my responsibility to be gracious as a guest, thanking those who took care of me away from home, my duty to repay whatever kindesses I can.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "You know, even if the sister had texted OP and said \"shit, my daughter ate the marzipan, can you pick up some more while you are out?\", this probably would have gone over sooooo much smoother",
              "id": 48,
              "comments": [
                {
                  "score": 3,
                  "content": "Have him pick up an emergency supply and also buy a bunch of marzipan and ground beef as a host gift. That probably could have changed this from a fight to one of those funny stories you tell at holidays. Could have turned the tears into laughter, but SIL just HAD to be the AH.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I'm not convinced that this wasn't a deliberate act.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 378,
          "content": "[removed]",
          "id": 51,
          "comments": [
            {
              "score": 125,
              "content": "Not to nitpick, but you're giving them (the SIL and niece) too much credit here. They weren't evicted because they weren't living there; they were visiting for 2 weeks. And they got that visit cut rightfully short.",
              "id": 52,
              "comments": [
                {
                  "score": 9,
                  "content": "Oh tbh I feel like kicking them out from a long-term stay would have been MORE reasonable. If it were just 2 weeks, I'd just put my head down and put up with them, but then decline to host them in future. But then in this case, considering the wife was having a high-risk pregnancy, I wouldn't risk her emotional and mental wellbeing (since you can miscarriage from stress) even just for 2 weeks.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "The above comment was stolen from [this one](http://np.reddit.com/r/AmItheAsshole/comments/qdryua/aita_for_kicking_out_my_sil_after_her_daughter/hhp3474/) elsewhere in this comment section.\n\nIt is probably not a coincidence; here is some more evidence against this user:\n\nPlagiarized | Original\n-------- | -----------\n[NTA at all. As someone wh...](http://np.reddit.com/r/AmItheAsshole/comments/qdt3ws/wibta_for_reporting_a_cashier_to_her_supervisor/hhp40uz/) | [NTA at all. As someone wh...](http://np.reddit.com/r/AmItheAsshole/comments/qdt3ws/wibta_for_reporting_a_cashier_to_her_supervisor/hhov998/)\n[NTA. Sister is disrespect...](http://np.reddit.com/r/AmItheAsshole/comments/qdrif9/aita_for_asking_my_sister_to_stop_wearing/hhp3tv4/) | [NTA. Sister is disrespect...](http://np.reddit.com/r/AmItheAsshole/comments/qdrif9/aita_for_asking_my_sister_to_stop_wearing/hhp1q6h/)\n[NTA. If your MIL is expec...](http://np.reddit.com/r/AmItheAsshole/comments/qdqqi1/wibta_if_i_make_my_brosis_inlaw_lose_their_free/hhp3wt3/) | [NTA.  If your MIL is expe...](http://np.reddit.com/r/AmItheAsshole/comments/qdqqi1/wibta_if_i_make_my_brosis_inlaw_lose_their_free/hhovoaz/)\n\nbeep boop, I'm a bot -|:] It is this bot's opinion that  [/u/kspiterivcxvdfxtg](https://np.reddit.com/u/kspiterivcxvdfxtg/) should be banned for karma manipulation. Don't feel bad, they are probably a bot too.\n\nConfused? Read the [FAQ](https://www.reddit.com/user/reply-guy-bot/comments/n9fpva/faq/?plagiarist=kspiterivcxvdfxtg) for info on how I work and why I exist.",
              "id": 54,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 129,
          "content": "Also if you went and bought more I bet the next day they will be gone again. Ohh kid wanted candy so I gave them to her it's just candy you can get more mantra again. You pretty much spend money just for her kid to eat. She should pa for them to be replaced.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 103,
          "content": "Even ignoring the pregnancy, NTA.\n\nWhen the host says your welcome to everything except what’s in this one cabinet. There is no reason to even open said cabinet.",
          "id": 56,
          "comments": [
            {
              "score": 24,
              "content": "> When the host says your welcome to everything except what’s in this one cabinet. There is no reason to even open said cabinet.\n\nI can understand a kid being curious - hell, even an adult!- and seeing what's in there.  However, the true AH moment for the sister is when she refuses to replace the items her child devoured.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Exactly!\n\nIf they stay in contact with any of that side of the family the next they are round for a birthday they should arrive and immediately start eating the cake before candles and singing. Anyone complains just say they are precious",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "Yeah, this wasn't about eating something. After all, the daughter ate ALL of them, not just a few. This was about stomping your boundaries in a passive aggressive way and giving you the middle finger.",
          "id": 59,
          "comments": [
            {
              "score": 4,
              "content": "Maybe sis had a few too? Blaming the kid is easy....",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "[removed]",
          "id": 61,
          "comments": [
            {
              "score": 31,
              "content": "That's the kicker. If they're not visiting to help wife around the house while she's pregnant & take care of her, then why are they visiting during a high risk pregnancy?",
              "id": 62,
              "comments": [
                {
                  "score": 4,
                  "content": "Good point!",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "As another comment stated, perhaps the sister's kid is the only grandkid on that side, so sister's trying to keep the status quo of her having the only grandkid?",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Either massive favoritism or they got a well-spun story. Very astute observation on your part...and you may well have pegged it.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "I totally agree that he's NTA. \n\nOP made one mistake though - he should have kicked SIL out **immediately**, instead of letting them stay overnight after this.\n\nShe only had to do one thing - stay out of the cupboard, but she crossed the line. Not only did she cross the she made your wife miserable in the process. This is a GET THE F\\*CK OUT NOW moment.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "[removed]",
          "id": 67,
          "comments": [
            {
              "score": 4,
              "content": "The above comment was stolen from [this one](http://np.reddit.com/r/AmItheAsshole/comments/qdryua/aita_for_kicking_out_my_sil_after_her_daughter/hhp0osn/) elsewhere in this comment section.\n\nIt is probably not a coincidence; here is some more evidence against this user:\n\nPlagiarized | Original\n-------- | -----------\n[NTA, but practice a cold...](http://np.reddit.com/r/AmItheAsshole/comments/qdt3ws/wibta_for_reporting_a_cashier_to_her_supervisor/hhp4rgo/) | [NTA, but practice a cold...](http://np.reddit.com/r/AmItheAsshole/comments/qdt3ws/wibta_for_reporting_a_cashier_to_her_supervisor/hhp2t2n/)\n[NTA. Your sister is haras...](http://np.reddit.com/r/AmItheAsshole/comments/qdrif9/aita_for_asking_my_sister_to_stop_wearing/hhp4mwl/) | [NTA. Your sister is haras...](http://np.reddit.com/r/AmItheAsshole/comments/qdrif9/aita_for_asking_my_sister_to_stop_wearing/hhox5ug/)\n[NTA. If your MIL is expec...](http://np.reddit.com/r/AmItheAsshole/comments/qdqqi1/wibta_if_i_make_my_brosis_inlaw_lose_their_free/hhp4p0y/) | [NTA.  If your MIL is expe...](http://np.reddit.com/r/AmItheAsshole/comments/qdqqi1/wibta_if_i_make_my_brosis_inlaw_lose_their_free/hhovoaz/)\n\nbeep boop, I'm a bot -|:] It is this bot's opinion that  [/u/ivoibsvcxvxzfrsa](https://np.reddit.com/u/ivoibsvcxvxzfrsa/) should be banned for karma manipulation. Don't feel bad, they are probably a bot too.\n\nConfused? Read the [FAQ](https://www.reddit.com/user/reply-guy-bot/comments/n9fpva/faq/?plagiarist=ivoibsvcxvxzfrsa) for info on how I work and why I exist.",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "If OP bought more, the incontrolable jerk niece and her mother would have eaten that too!  NTA!!",
          "id": 69,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3912,
      "content": "NTA - She insulted you and your wife while she was your guest. I wouldn’t say you kicked them out for eating the marzipan at all, in fact, you said they could replace it and that would be fine. She refused to replace it and insulted you, and that’s why they are kicked out.",
      "id": 70,
      "comments": [
        {
          "score": 661,
          "content": "Really. I mean wtf kind of guest doesn't ask someone if they can have 'x item' that their kid fancies, having seen it in a see-through cubby? It's YOUR food, in YOUR house. My mind just boggles at the sheer gall and bad manners here. And then to not replace it as well. I just can't with OP's relatives. Who dragged them up? Fagin?",
          "id": 71,
          "comments": [
            {
              "score": 139,
              "content": "The kind of relative that leaves while complaining instead of just paying to replace said item.",
              "id": 72,
              "comments": [
                {
                  "score": 6,
                  "content": "Garbage people aren't family. I've got many friends better than family I can count on, and they won't touch my marzipan... or at least they'd fucking replace it.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "it's called accountability. SIL won't own up to it and is probably like this with all interactions. Victim mentality and emotional manipulation is also evident here.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Also a container you were specifically told was out of bounds.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "The kind that thinks being a family member = no boundaries",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Honest question: Is it so usual to have guests stay for two weeks? For me, the stay duration was the \"uh oh\" moment.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My stepdad. \n\nMy dad had just died, and when I got home my husband told me he didn’t love me and I had to go. Asked my step dad to help since I was states away from anyone I knew.\n\nI had a pack of 5 full sized Milky Way candy bars for myself. Dad asked if he could have one and I said sure. Went to get one later and he ate all 5! I asked him if he ate them all and he lost it.\n\nHe was the “guest” and it was on me to provide for him. Yeah I’m in the mental space for that right now.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "And to add, OP should definitely tell their side of the story here. It’ll be he said she said to the fam, but trust that SIL made herself the victim of the story. My heart breaks at a child who has a parent that has no sense of accountability. NTA",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": ">My wife's family is calling me an ass for kicking them out over something so silly and that I could've just bought more. It all feels so silly but I'm begin\n\nI bet you it wasn't even the kid who ate them. It was probably the sister and she just blamed the kid.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "This! I'm imagining a young daughter, and kids can do shitty things. Kicking them out because a child did a shitty thing would be a bit mean. Still marginally okay, because mom needs to pay attention to the kid better, but… eh. But in this case, they removed all doubt about who's TA. Mom has a responsibility to make things right after the kid does something shitty, and she chose to be an ass instead.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1969,
      "content": "NTA\n\nIf your SIL wants the candies, she can buy them herself. Also, it's so rude of her to help herself to that one thing you told her not to touch!",
      "id": 82,
      "comments": [
        {
          "score": 505,
          "content": "And even more rude to eat ALL of them! NTA",
          "id": 83,
          "comments": [
            {
              "score": 273,
              "content": "Right! He bought them in bulk!! What kid should eat that much sugar!",
              "id": 84,
              "comments": [
                {
                  "score": 232,
                  "content": "Honestly I highly doubt the kid ate any, or if she did, not all of them. Sister probably threw them out or hid them because she's the arbiter of all things pregnancy.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Agreed.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "She can stop at the store on her way home now!  How convenient.\n\nOP is very, very NTA, and Mrs OP has a supportive spouse!",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "And then to watch her sister there crying on the couch. That part I can’t get over. You don’t treat family like that.",
          "id": 88,
          "comments": [
            {
              "score": 24,
              "content": "Yeah that was fucked up. Like yeah, she was crying over candy and meat. But she's pregnant and full of hormones, and she's had a very hard time and is most likely stressed out/worried about her pregnancy and herself. So to ruin the one little thing that made her really happy in a really hard time, and then watch her be really upset and crying, and THEN to insult them and gaslight the two of them, is just sick. I feel like this is not the first time the sister has been a major asshole to the wife...",
              "id": 89,
              "comments": [
                {
                  "score": 5,
                  "content": "It's also now going to associate one of the two things she can eat with bad feelings of conflict with her sister and stress. What an absolute AH behavior by the SIL.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "You don’t treat anyone like that, let alone family",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1513,
      "content": "NTA. Coming from a pregnant person, you can't eat just replace a craving. Food aversions are very real and when there's only so many things you can eat without vomiting, it's a big deal when you don't have them. You set the boundary with them to not eat specific things and they broke it. You were just being a good partner to your wife.",
      "id": 92,
      "comments": [
        {
          "score": 458,
          "content": "When I was pregnant, all I could really eat was BLTs, lemonade made from real lemons, and apple oatmeal. Every thing else made me sick. Good times. Not. LOL",
          "id": 93,
          "comments": [
            {
              "score": 114,
              "content": "I feel ya completely! Mine would change because I was so sick. I would think I found something but nope…puked it up.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 99,
              "content": "Mine was Wendy’s baconator and bagels with cream cheese. Tbf I was carrying twins lol",
              "id": 95,
              "comments": [
                {
                  "score": 121,
                  "content": "My daughter was probably half bagels and cream cheese at birth.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 41,
                      "content": "Like bagels for the lower 50% and cream cheese for the waist up? Or like an ice cream swirl mixture of chocolate/vanilla, but of bagels and cream cheese? I just woke up from a nap after a very long day and your comment bizarrely set off my imagination in some hilarious ways. I mean I absolutely visualize both. And my favorite is the little miss with bagel bread legs, lightly toasted and with sesame seeds, and a wiggly, jiggly cream cheese top half as she runs along as a toddler, with her arms out, touching everything!, leaving sticky fingerprints on the fridge door, walls, furniture. And you just know it'll be worse when she goes to bed. Oh my God, the sticky, and I'm a gal who can't stand having sticky hands. \n\nOh! What must laundry look like? Would diapers be buttery? Would diaper rash be like stale bread? What would her hair be made of? There are some molds that grow on dairy products that are very pretty hair-like purple fuzzies. \n\nNo. I haven't been drinking hahaha",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I couldn't even go into a fast food place or any place that had strong scents when I was pregnant *(a hundred years ago LOL)*.",
                  "id": 98,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 43,
              "content": "I ate iceberg lettuce, cucumber and real bacon bits salad, no dressing, and watermelon.  That was all I could keep down.  I had a woman who whose husband worked with mine.  She brought her obnoxious kid and ate my salad and watermelon and just left her kid to trash my house while she zoned out.  I could not believe this pregnancy would not end in a miscarriage.  So I would sit there watching her eat my salad and watermelon and want to growl at her like a junkyard dog, but none of the best people do that.  Pregnancy can make you downright territorial about food..  Good times, not.",
              "id": 99,
              "comments": [
                {
                  "score": 22,
                  "content": "I was pregnant when I was in the military and the job I had was pro-dominantly male, and most of them had no kids or experienced a pregnant woman, so it was rare I ever worked with anyone who knew anything about pregnancy. One day I went on lunch and grabbed myself food and brought it back to the shop to eat, and one of the newer airmen jokingly asked for my food. Imagine the look on his face when I nearly ripped his head off for that one 😂😬 poor kid wasn’t ready for all those pregnancy hormones",
                  "id": 100,
                  "comments": [
                    {
                      "score": 6,
                      "content": "You go!  I was a dental hygienist in the Army.  I think I growled at someone before I lost my first because they were eyeing my food.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I get it... No body touched my safe foods without risking life and limb. I was ruthless. \n\nWith my youngest son, all I could eat, for the longest time, were these giant cinnamon rolls made by the wife of this little tiny grocery store not far from my farm. There were days that they'd be out and I would just go hungry vs. feeling like I was roadkill. Not long into my pregnancy, the wife started saving some for me. I bought those every day even after I was able to eat. Love that lady!",
                  "id": 102,
                  "comments": [
                    {
                      "score": 3,
                      "content": "We all are kind of crazy about anyone who makes home made cinnamon rolls.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "My wife was fortunate. All of her cravings fell within my culinary and horticultural range. And all were (relatively) healthy. She did, for the only time in her life, develop a taste for sweets, but it was mostly limited to cheesecakes, fruit tarts, and berries. Lots of kale and beet smoothies, fresh from the garden. We tell our daughter she's half made of kale. And, yeah, more than a few bacon cheeseburgers, but I use whole grains and fresh ingredients and no nitrates, so it isn't that bad.  \n\n\nI would make her like six things she might be able to eat before leaving for work each day, and there were still days she couldn't do any of them.",
              "id": 104,
              "comments": [
                {
                  "score": 7,
                  "content": "The most humorous aversion I had was to the smell of yeast thanks to Fred Meyers grocery store. I went in there and the scent of yeast was so overpowering that I became extremely ill several days. It took me several years just to be able to bake with yeast and a  good 15 years before I could step in that store without getting queasy.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "There was a point in time during my pregnancy where all I could keep down was crackers and kfc chicken 😂",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My third and final successful pregnancy, I could eat almost nothing through the entire gestation because everything made me vomit. The only thing I could keep down for most of the time was a sort of soft taco or wrap sandwich made of bacon, guacamole and sour cream. I went from 215 pounds at the start of the pregnancy to 195 pounds after delivery. Got my tubes tied after that, because each of my pregnancies was worse than the last, and my OB/GYN had trouble stopping an active bleed after delivery. I didn't need to think twice about it.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My mom really can't stand peanut butter in general but when she was pregnant with my brother she ate so many of those cheese sandwich crackers with the peanut butter 😂 to this day she can't even smell them but it got her through it. Apparently when she was pregnant with me my dad would bring her bags of the fun size Twix bars, and with my sister she craved hoagies from a specific restaurant. Pregnancy is WILD",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I couldn’t eat anything that was heated up or cooked without throwing it back up, I learned the hard way after eating a foot long meatball sub.",
              "id": 109,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Mine was Cornish pasties, beef jerky and pineapple juice.",
              "id": 110,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "I was thankfully okay with most things, but my\nHusband could NOT use his flag grill in the house. Idk how to describe the smell, but it would sit in my stomach with nausea for days later.",
              "id": 111,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 160,
          "content": "Reading this brought back the trauma of wanting to eat, but not being able to hold down anything but that ONE thing (oatmeal with a small bit of honey and butter, no sugar) and being OUT. I was also on modified bed rest as I was in preterm labor and trying not to give birth so I couldn't go to the store and get more, I could only get up long enough to put it on the microwave and then sat while it cooked, then took it to the couch to eat. That's all I could do. I cried and cried. My husband had to leave a meeting to tell me another can was up a shelf behind the sugar. I cried more while I made it. \n\nDon't fuck with a pregnant woman and her food. It's literally one of the saddest disappointments I've ever experienced. \n\nNTA. You're amazing.",
          "id": 112,
          "comments": [
            {
              "score": 56,
              "content": "I feel that. Our refrigerator door opens toward you in the galley...my tummy would get in the way so I couldn't get into the fridge. I cried. I cried when I couldn't reach the things in the higher up cabinets because my belly was in the way. I ugly cried when I got a cinnabon after craving one for over a month (the one closest to us closed due to the pandemic so we drove almost an hour for me to get a box and a fresh one to eat in the car). You absolutely don't mess with pregnancy cravings. You literally can't help it.",
              "id": 113,
              "comments": [
                {
                  "score": 8,
                  "content": "I feel you on the fridge thing.  But damn, now I want a Cinnabon.  Those were my cravings during my first pregnancy, but WOW, they're calorie bombs.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I remember when I was pregnant, it was late at night so most restaurants weren’t open, and I just sat in bed BAWLING my eyes out because I was heavily craving meatloaf and mashed potatoes and had absolutely NO WAY of getting any 🥲 couldn’t even make it because I didn’t have any ingredients to do so.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": ">Don't fuck with a pregnant woman and her food\n\nDamn straight. I remember when heavily pg with my second. Husband had gone out to the pub and asked me if i wanted anything on the way back from the takeaway. I really, really craved a doner kebab (don't judge me! :P ) . They got the order wrong and got one with mega spicy sauce on instead of mild, and I cried for ages over that delicious smelling kebab that i couldn't eat, while drunken husband clucked  over me trying to fix me, offering his chicken burger in compensation :D\n\nMy first pregnancy I craved coffee, red bull, or tomato soup.\n\nOp's SIL is very lucky her sister didn't stab her over her marzipan (which sounds delicious btw, i want some, but i will buy my own ;))",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I completely relate to this. I spent my final month of pregnancy on hospital bedrest and because of Covid I could only get outside food when my partner came from 11pm to 8am so my food choices were very limited. I had awful food aversions to the point of losing 15lbs during pregnancy and it would have been so nice to be able to eat the food I was craving so that I could actually *eat*",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "Thank you. I’m currently 13 weeks and barely able to tolerate anything but when I have a craving I take full advantage. If someone ate those foods I’d be LIVID.",
          "id": 118,
          "comments": [
            {
              "score": 23,
              "content": "I’m almost 40 weeks and I can sympathise with you. I know this is going to sound silly but try KFC chicken. A few ladies at work gave me this advice because it worked for them and I’m so glad they did. I gave it a go and it was the only thing I was eating for a week or so until it settled down lol.",
              "id": 119,
              "comments": [
                {
                  "score": 10,
                  "content": "Interesting, I will definitely give it a shot!! Thank you kind stranger!",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I can share my list of easier foods with you if you want!\n\nI was sick for 9 months three times and mostly lost weight during pregnancies. The last pregnancy I could not do anything but lay down and wait till I was through. There were so many things people told me to eat that didn't do anything and I got sick of the recommendations. So I'm asking before sharing :) \n\nI cried when my husband accidentally ate the last few bits of my sandwich that I had saved for the next morning. I couldn't eat anything else, and he thought it was like the other things that I suddenly couldn't eat anymore halfway through. He could have been right, but this time he wasn't and I cried like it was the end of the world for me. He understood perfectly while I thought I was pathetic, haha. \n\nHang in there and focus on the days passed instead of the days to go. You can do it!",
              "id": 121,
              "comments": [
                {
                  "score": 5,
                  "content": "Currently 18 weeks pregnant. My husband, the saint he is, just doesn’t get the “saving for later”/“unable to eat” 😂 I NEEDED some Kraft Mac and cheese the other day. I don’t even know if I’m to “pregnancy cravings” stage yet, but there was going to be hell to pay on the world if I didn’t get it. I also have only been able to eat essentially half meals for a while now.  \nHe cooks me the Mac and cheese and he brings me the *the whole damn box.* I eat like 8 bites and I’m like “ahhhh, crisis averted.” And he’s so crestfallen - “that’s all you’re going to eat??”Sweetie, it’s all I *can eat.* you know this. Come back in an hour and I’ll have eaten another 8 bites 😂 (then the ‘….are you done? That sounds really good now.’ for cleanup!)",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "Omg the aversions were AWFUL when I was pregnant. Like no veggies, most fruits, nut butters, and grains. I could eat chicken, beef, plain pasta with an olive oil sauce, and cheese. Everything else made me barf. We got really good at hiding veggies into dishes!\n\nOP, NTA. You didn’t kick them out for eating the candy, you kicked them out for doing the one thing you told them not to do and then they insulted you and your wife. You ILs are WAY out of line.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "you'd think OP's SIL would've had more empathy towards her pregnant sister since she (SIL) has a child herself, unless she adopted the kid or somehow doesn't remember any part of the pregnancy",
          "id": 124,
          "comments": [
            {
              "score": 39,
              "content": "10 bucks says easy pregnancy and now she assumes everyone else is a liar/drama queen.",
              "id": 125,
              "comments": [
                {
                  "score": 14,
                  "content": "I've heard similar with woman doctors who are AHes to female patients - it wasn't like that in their personal experience so they think the other lady is BSing. at least guys might know they don't know.",
                  "id": 126,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "THIS. My baby is almost a month old and I never had any of these intense cravings (kind of feel like I missed out), but I'm not gonna throw shade at all the women who did. It's obviously something a huge percentage of the population experienced.\n\nDefinitely had aversions though. If I even *smelled* an egg, I was a goner.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I still have an aversion to tomato sauce, a decade later. I can eat it, but it surely is not my favorite thing. Before that pregnancy I really liked red sauce. Not anymore.",
          "id": 128,
          "comments": [
            {
              "score": 4,
              "content": "15 years later, I can't stand the smell of subway restaurants. \n\n13 years later, can't stand the smell or taste of any flavor gatorade, or saltines.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yep. NTA and updated info not needed! Pregnancy can be miserable. The balance, the changes, visits. Snacks aren't trivial when the body is fighting for balance! Partner said don't eat X, SIL said okay we won't eat X, SIL let her child eat X. Game over. NTA.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Exactly. When I was pregnant, all I could stomach for like the first 6 months was grapes, clementines, and peanut butter. No idea why. But anything else made me so sick. Even just smelling something else.",
          "id": 131,
          "comments": [
            {
              "score": 2,
              "content": "Oh peanut butter. \n\nDuring mine, literally, I would wake up in the middle of the night to go make myself some toast slathered in crunchy peanut butter more often than I want to admit. My bf just learned to buy like, 8 peanut butter jars every grocery trip.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Wierdest food related thing during my pregnancy was when I wanted to eat something and baby didn't, so surreal experience. I put that food in my mouth liked the taste but was unable to swallow it. I wanted it and didn't want in the same time. Tried couple of times than went for different food and ate it with no problem...Pregnancy is weird.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Same. My first pregnancy was horrible and I could only eat certain things. I had to avoid cooking meat and meat that looked even slightly pink. I still to this day, 5 yrs later, can hardly eat hamburger meat without wanting to vomit.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1040,
      "content": "NTA. This is, as you've noted, a high risk, high stress pregnancy. This may seem like a small thing, but the distress your wife was in is very real, and it isn't negligible. \n\nYour sister-in-law and niece couldn't manage to follow very basic rules for even a single day. This was arguably small, but it demonstrates an utter disregard for how delicate this situation and your wife's condition is. \n\nBetter they leave now before they're given a chance to do more things to elevate your wife's stress levels and discomfort.",
      "id": 135,
      "comments": [
        {
          "score": 328,
          "content": "This is exactly where my head was going. When you’re going through a stressful pregnancy, it’s so important to have something to help decompress, and it sounds like for OP’s wife it’s marzipan. Don’t f*** with the pregnant woman’s cravings. NTA",
          "id": 136,
          "comments": [
            {
              "score": 174,
              "content": "not just decompress, but literally something to *eat*. when i was pregnant, even when i tried force feeding myself for the baby's nutrition, a lot of things made me gag and throw up repeatedly. i could only eat certain food and sometimes without those foods on hand, i'd be so hungry",
              "id": 137,
              "comments": [
                {
                  "score": 88,
                  "content": "And being hungry makes you nauseous. A lovely cycle of suckitude",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 73,
                  "content": "During the first half of my pregnancy with my daughter, literally the only thing I could keep down was milk.\n\nI couldn't drink it cold, or gulp it. I had to let it warm up to body temperature in my mouth and then tip my head back. Teeny swallows, and sometimes even that was too much.\n\nI threw up all over the sidewalk in front of my neighbour's house because I could smell toast. Even food-scented candles were a no-no.\n\nThe first time I was able to eat something solid and keep it down, I cried with happiness.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 50,
                      "content": "I have been there. I had terrible nausea, pretty much HG, with both pregnancies, and there was a time where all I could stomach was mashed potatoes. Anything else made me gag and vomit. It was bad. By the time it faded, I was too pregnant, especially with my giant son, to eat much at a time. There wasn't room in my body cavity to fill my stomach. Eating was just uncomfortable. Add GERD, and I was a mess.\n\nI still distinctly remember the first food the nurses brought me after being moved to my room after my son was safely out: a cup of nearly ice cold grapes of various kinds. There were some cheese cubes in there too, but those cold, fat, juicy grapes were the best thing I could ever remember eating in my life. I have never enjoyed anything as much as I enjoyed those fucking grapes. Meanwhile the only good channel they had was playing a marathon of Diners, Drive-ins, and Dives, so, strangely, Guy Fieri has a special place on my heart too. Lol.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "My thought is that stress itself can cause a miscarriage, which is already going to be a factor in a difficult and high-risk pregnancy. So yeah, they're not just candies. They help manage her stress which is vital.",
          "id": 141,
          "comments": [
            {
              "score": 45,
              "content": "That, and their reaction just promised that this wasn't the last stressful thing they would do. \n\nWaiting for the next shoe to drop is intensely stressful.",
              "id": 142,
              "comments": [
                {
                  "score": 3,
                  "content": "It probably wasn't the first asshole move the sister has pulled on the wife, either. The sister sounds like she could be an emotionally abusive asshole, and the wife does not need to deal with that shit ever, especially during a high risk pregnancy.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "I don’t even think it makes a difference that it’s a high risk pregnancy, that just makes it so much worse!!! The off limits food eating is disrespectful and now adding endangerment to both mom to be and unborn child-  sis would have known this was a high risk pregnancy which makes it so so much worse. This coming from someone who has never been pregnant but have my own issues about food in my house- if it’s off limits, that’s it!! (Brother used to eat anything I brought home if I didn’t eat it with in whatever time he ate it… ended up severely underweight…… not a great relationship with food but that’s not important, sorry I went off on a tangent).",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Even without the pregnancy in the mix, this is total bs on the sister's part. The couple is going through a really hard time and are most likely really stressed out and worried right now. So to ruin the one little thing that made the wife pretty happy, during a time of distress, is sickening. And it seems like she did it on purpose, as she was told not to do it. But then to watch your sister having a meltdown because you did the one thing you weren't supposed to, and have the audacity to refuse to apologize and fix it, and insult/gaslight your sister too? I just can't. The sister sounds like she might be an emotionally abusive asshole.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": ">Your sister-in-law and niece couldn't manage to follow very basic rules for even a single day.\n\nI am pretty sure that it was intentional meddling.",
          "id": 146,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 384,
      "content": "NTA\n\nThis would be reversed if they offered to replace the snacks, but what a shitty response from them. And how disrespectful to your wife. Totally in the right for kicking them out for not at least taking responsibility for eating your wife's snacks. As someone whose wife also had crazy cravings during her pregnancy, those food are sacred, you don't let people even look at them.",
      "id": 147,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 371,
      "content": "Fark for a minute I thought the marzipan was going on the ground garlic beef",
      "id": 148,
      "comments": [
        {
          "score": 55,
          "content": "Same and I can’t believe this comment is so far down.",
          "id": 149,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 54,
          "content": "Same! I was thinking beef with garlic, pepper and Siracha, not so bad...but soaked in peanut butter caramel marzipan as well? ??? I don't even think that's an Oxford comma issue, that's just a flat out missing comma.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Pregnancy does weird shit to taste buds.",
          "id": 151,
          "comments": [
            {
              "score": 7,
              "content": "Right? Which is why I shrugged and said okay ... I have had a grilled burger with peanut butter that was pretty interesting so maybe this is not too different.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "During her first pregnancy my wife used to dunk green olives in chocolate milk. It made me gag watching her eat that.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 366,
      "content": "NTA. they are lucky you didn't kick them out immediately. What age is the child?",
      "id": 154,
      "comments": [
        {
          "score": 252,
          "content": "12",
          "id": 155,
          "comments": [
            {
              "score": 483,
              "content": "12 is way too old to be eating that much candy after being told not to, I mean, all of it?  That child has some problems that need to be addressed.",
              "id": 156,
              "comments": [
                {
                  "score": 309,
                  "content": "I wonder of the kid ate some, her mom ate the rest, and/or squirreled it away in her purse for \"later.\"",
                  "id": 157,
                  "comments": [
                    {
                      "score": 94,
                      "content": "Right? He bought them in bulk. Plus they were out of sight.",
                      "id": 158,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 61,
                      "content": "Or just threw it away, because SIL thinks she's the pregnancy diet police",
                      "id": 159,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "It was also very intentional. SIL opened and ate that candy with the full intention to take it all and leave none for OPs wife.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 90,
                  "content": "That's old enough to know better.  My 6 year old knows to land mommy's special treats alone.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Exactly! Kids get their special treats and mom does too.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "The main problem the child has seems to be bad parenting.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "NTA. How rude. 12 is way, way too old to be eating all of a host's off-limits snacks.",
              "id": 164,
              "comments": [
                {
                  "score": 41,
                  "content": "Right? I assumed the kid was under 5 or something.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 6,
                      "content": ">kid was under 5 or something.\n\nI have met 3 year olds that had more respect for the word no then OP's in laws",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "I would be very surprised if the niece actually ate all of the marzipan. My guess is that SIL gave niece a few and then tossed or hid the rest, because she was either judgmental about what OP's wife was eating during her pregnancy or just being cruel.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 88,
              "content": "[removed]",
              "id": 168,
              "comments": [
                {
                  "score": 39,
                  "content": "Right? I had two rough pregnancies with my girls. When my sister was pregnant with hers, I was so protective of her. We were driving to the beach on a trip and the traffic was terrible. I knew that she was nauseous and it was stressing me out watching her be so nauseous. I just wanted to get there so that she could relax and not feel that way anymore. Maybe because she’s my baby sister I felt that way!?",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Agreed. What kind of sister eats her pregnant sister’s special stash of overly garlic saturated ground beef and candies? That’s ridiculous. I’m not even on good terms with my sister but I’d be making sure the freezer has beef back ups and that I replace whatever I’m eating out of her fridge so she doesn’t need to run more errands while in a high risk pregnancy.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 44,
              "content": "So, old enough to know better. She could have had the class to only eat a piece,  but pigged it all up.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Really? Your SIL needed to be kicked out. NTA.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "What? I thought of half that age max. Unbelievable.",
              "id": 173,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "A 12 year old should know better",
              "id": 174,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 241,
      "content": "NTA. You were very specific that they could have anything except what was in that cubby. The sister and her child showed a tremendous amount of disrespect by eating it, being verbally rude to you and refusing to buy more. Not only did you do the correct thing in telling them to leave, I'd not let them stay ever again. If they want to visit, they can come, stay in a hotel, and you can meet them anywhere except in your home.",
      "id": 175,
      "comments": [
        {
          "score": 52,
          "content": "Plus 2 weeks really is a long time unless they are planning on helping around the house or specifically helping to get ready for the baby",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "Yes!! And all while wife was CRYING!! Who the hell goes out of their way to do all of that and then ignores their own sister having a breakdown, cause those cravings can be seriously intense!",
          "id": 177,
          "comments": [
            {
              "score": 10,
              "content": "Someone who did it intentionally.",
              "id": 178,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 151,
      "content": "(Edit: spelling mistake) \n\nNTA \n\nGood on you for standing up for your wife! Her family should be more understanding of how high-risk she is. \n\n \nWhile I've never been pregnant, I know many people who have, and those cravings can be UNBEARABLE. Also, commenting on what your wife is eating while she's growing a whole human? Unacceptable. \n\nKids can be kids - it'd be one thing if your niece got into the snacks when nobody was looking, and your SIL apologized, then promised to replace it. \n\nI would be really careful with having her around in the future. If she can't listen to a basic request like, \"don't eat this specific thing\", I wouldn't trust her with some of the bigger things.",
      "id": 179,
      "comments": [],
      "relation": "Support"
    }
  ]
}