{
  "post content": "Whenever I buy something out of the ordinary with a specific dinner purpose in mind, my husband manages to find it and eat it. I am sure if I was planning to bake something and bought yeast, I would come home to find him completely distended and surrounded in empty yeast packets. I usually stick to the same grocery list every week, and I feel like if I buy something out of the ordinary that is clearly an ingredient for a larger meal, he could at least ask before devouring it. Last night, I bought two baguettes, which I have only every purchased to make French bread pizza for him and our kids. I bought these at 11pm, and they were not even here twelve hours when I saw them on the counter, with the first six inches ripped off of each loaf, scanned the house, and saw my husband chewing. If it had been one loaf, okay. If he had used a knife, maybe. But the fact that he didn’t ask if they were going to be for dinner and then ripped the top off of both of them like that final boss bloater in The Last of Us that lumbers out of the hole and rips the guy’s head off, this is unforgivable. He insists I should tell him when I buy things if they are for a specific purpose. I say I am already taking on the burden of grocery shopping and cooking and the least he can do is ask. Am I the asshole here?\n\nEdit: Some pertinent information:\n1) We have two snack cabinets that he is free to snack from, not to mention whatever’s in the fridge.\n2) The bread was in a cabinet that is mostly ingredients.\n3) There was regular sandwich bread for the taking that was unharmed.\n4) For those who have stated that this is raccoon-like behavior, it really does feel like I am running a wildlife rehab operation, but the only patient is a 37 year-old software programmer.\n5) To the dude who said that my husband is going to “leave me for another woman who will give him peace,” tell me you’re still bitter about how things ended with Sheila without telling me you’re still bitter about how things ended with Sheila.\n\nUpdate: Wow, I was not expecting this to blow up, or for so many people to have such strong feelings about bread. Thank you for all of your input, especially my sister who unexpectedly chimed in. This may be the most validating experience of 7 years of living together. I shared this with my husband, and he accepts his AH status and apologized. We are going to work on communicating better, and he is going to work on his weaponized incompetence. He wants you to know he occasionally cooks rice and beans, and lately has been making us late-night quesadillas when the kids are asleep. But most of all: “I was just hungry.” -my husband",
  "id": 1,
  "comments": [
    {
      "score": 10105,
      "content": "NTA. OP shouldn't have to label every food item that comes into the house. Especially since this is a pattern, the husband should learn to ask first. It's not hard to say, \"Hey, are you saving these baguettes for something? Because if you're not, I want to tear six inches off each one and leave the mangled remains on the counter.\"",
      "id": 2,
      "comments": [
        {
          "score": 3009,
          "content": "That’s exactly how I feel!",
          "id": 3,
          "comments": [
            {
              "score": 2869,
              "content": "He knows what he's doing. In my house we know what certain items aren't normal to keep on hand and my hubs will actively pester me about the rare find in our fridge. Probably because he's looking forward to eating whatever it gets made into but still. Have some decency! He can ask he just chooses not to.",
              "id": 4,
              "comments": [
                {
                  "score": 1282,
                  "content": "This reminds me of a post a while back where some lady’s husband liked to “taste” everything, so he would open everything take a few bites and put it back (including putting jars of sauce back in the pantry)",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1005,
                      "content": "OMG I remember that! And he would put the not-shelf-stable-after-opening items back in the damn cupboard to cover up his crimes!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 236,
                      "content": "There was another post where OP had a girlfriend that would always eat the first bite of his food whenever he got it. She thought it was cute and that all women did this with their boyfriends.\n\nCame to a head when OP made a cake for his friend’s birthday and left it in the fridge, and when he got home every slice had a bite missing from it.\n\nhttps://www.reddit.com/r/NotHowGirlsWork/comments/wmikxy/found_on_aita_woman_thinks_that_every_girl_takes/",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 99,
                      "content": "This also reminded me of the guy who was helping his sister with her new bakery so he made her frosting.  Later that night he found his gf eating the frosting with her fingers",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 35,
                      "content": "There was another one as well where OP had a girlfriend who would always take a bite out of his food because she thought it was cute.\n\nOP didn’t think it was cute when he made a cake for a friend and got home to find that every slice had had a bite taken out of it.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I would commit a felony. Oh my god.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "There was a similar post about a woman who had to taste whatever it was her partner/spouse made (which I believe were to be sold), only she had to stick her fingers in the pots and jars. It was INSANE.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "God I would never do that but the *urge* to do that is so real for me lmao",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "oh I would destroy someone if they did this to me under my own roof. the amount of stuff that would go bad if I didn't check it to see if it had been opened...",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I'm chill. Sooo chill, and I try to understand where people are coming from and meet them half way, but if someone put opened jars back in my pantry there would be Reprisals.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 155,
                  "content": "[removed]",
                  "id": 15,
                  "comments": [
                    {
                      "score": 114,
                      "content": "My feeling is there is absolutely NO F'ing REASON why hubby should think it is okay to eat parts of EACH baguette. Even if OP bought them just because, the fact he tore off (or even sliced off) from each one tells me he is a complete AH and I don't know that I could live with that. I certainly couldn't be intimate with someone who couldn't figure out how bad of behavior that is.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 59,
                      "content": "Our house is a little different because we like to try new recipes a lot so our shopping trips aren’t that uniform.  We just communicate so that we know what is for a recipe and what is open.  It takes like five seconds to be like, that Brie cheese is for a pasta I’m making Friday or whatever.  When there is ever doubt, we ask before consuming, or find out when it’s being used to determine if there’s enough time to make a replacement.  It’s often pretty obvious what is recipe ingredients and what is not, but there’s always those times that the Fritos which are usually for snacking are actually an ingredient for walking taco casserole.\n\nETA - OP is NTA.  Husband should know to ask or avoid eating “rare” things.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Yeah I had to have this same conversation with husband. I'd buy something specific/ unusual for dinner or baking - he'd eat it. Somehow the fact that I menu plan and do grocery shopping to that menu plan completely passed him by... \nA (slightly tense - I still can't believe he was so oblivious) conversation later he now knows to check. and even checks the menu so he can cook some nights. Sometimes if we're not going to see each other due to work/kid dropoffs I write sticky notes if something is purchased during the week.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "NTA, Put a lock on the cabinet to save it from the devourer with the abyssal stomach.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "My partner sometimes buys croissants, and I know he’s got plans for breakfast the next day, so I just gaze longingly at them all day.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Exactly this, I know what my wife normally buys and what recipes it goes into. I'd bet almost no one keeps fresh real bread (baguettes, etc. things that go bad in 3-5 days) as just a snack, it's for a specific dish typically. Hubby is definitely just thinking, \"I want to eat this, fuck what my wife has planned.\"",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 289,
              "content": "I'd ask him to go buy new ones. Whatever it is. Every time. Maybe he'd get tired of having to replace what he ate.",
              "id": 22,
              "comments": [
                {
                  "score": 138,
                  "content": "And at that moment, not later.  Especially if there is a 24 hour store in the area where he has to go if you discover it at 1AM.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 60,
                  "content": "That’s our “punishment” in the house if we eat anything that was meant for something specific. We live in a small town so we gotta go out of our way to get anything late, so we’ve gotten really good at making sure that we won’t be missing ingredients lol",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "This. I was just thinking- hand him the car keys. I don’t care if he is in the middle of a football game, a Nintendo game, or whatever. He needs to replace the dinner item, right now. Only consequences is going to stop this kind of behavior.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 12,
                      "content": "The thing is, her post history has her asking for financial assistance to afford winter clothes and mentions that they're on SNAP, which is US-based government food assistance. So I'm guessing that the food budget is very limited, which means he probably can't afford to just replace things. That makes this so much worse. \n\nI think I'd tell him that if he eats a thing that was intended for [meal] then he forfeits his portion of [meal]. When resources are tight, you really can't afford to deviate from the meal planning.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 158,
              "content": "There is zero rational reason for him to rip the first 6 inches off of each and leave them.\n\nIf he is not mentally unwell, I do not understand how this isn’t obvious to everyone? This is more than thoughtlessness. \n\nThere is no reason. So. The behavior stops immediately or his reason is actually malicious.",
              "id": 27,
              "comments": [
                {
                  "score": 78,
                  "content": "Look, I have a handful of psychiatric disorders, and none of them possibly justify this. Let’s just call it like it is: dude’s lazy.\n\nEdit: lazy and *absurdly* selfish.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Well no. \n\nLazy doesn’t explain why the two different first 6 inches.\n\n*Some* sensory disorders might justify it, but then they would need to navigate through these things differently and he would still be a jerk for doing it when she has asked him not to, but they could find a solution.\n\nNo. Mental health and lazy doesn’t explain it.\n\nThere is no reason. He either has to provide a reason and then take responsibility and manage it. Or the reason is abusive control. \n\nThoughtlessness and selfishness are the *least* abusive reasons, but with the repetition of the ask from OP to leave food alone AND the fact that he took the first 6 inches *from both* means that this has crossed over into maliciousness.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I honestly feel this way too.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "His behavior kinda reminds me of what my parents went through with 5 teenagers smoking weed and eating ridiculous shit. But op would probably mention if her husband was blazing every day.",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "It sounds like the logic of someone who’s very inebriated.",
                  "id": 32,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "He maybe felt that it was somehow..fresher? To \"open\" a new baguette instead of continuing eating the \"used\" one?\n\nIdk, but OP should just use what is left to make pizza for her and the kids, and husband isn't getting any (except some grated cheese and tomato sauce) since he already ate his share",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "Also, who eats raw yeast straight out of the packages??  \n\n\nThis - and the way he mangled those baguette is what conviced me that this isn't about kitchen rules, grocery rules, your husband not knowing, or him being hungry. This is willfull ignorance. It's your husband exerting control and wrecking things just because he can. \n\n\n(PS:  I love bread. The way your husband mistreat those baguette made me want to type choice words that might result in me getting the ban.)",
              "id": 34,
              "comments": [
                {
                  "score": 197,
                  "content": "lol, the yeast was just a funny hypothetical, not one that actually happened. Yet.\n\nShe's just frustrated that no matter *what* she buys that's special it is gone.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Yet",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "The yeast bit is a hypothetical scenario: “I am sure if I […] bought yeast, I would come home to find him [having eaten it]”. He didn’t actually do it (yet)",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 94,
              "content": "[deleted]",
              "id": 38,
              "comments": [
                {
                  "score": 5,
                  "content": "He’ll just make a sandwich or order pizza.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 9,
                      "content": "[deleted]",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 86,
              "content": "Do you think he is doing it to intentionally annoy you? The second loaf makes it seem intentional",
              "id": 41,
              "comments": [
                {
                  "score": 57,
                  "content": "I think he was too lazy to reach his arm far into the paper bread bag, so he ripped off easily accessible end of the second loaf",
                  "id": 42,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Maybe OP's husband is actually a T Rex and can't reach all the way into the bag or hold a bread knife in his tiny claws!",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This seems likely to me",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "Personally, I would have made the pizzas for myself and anyone else who was NOT husband.  He already ate his share.",
              "id": 45,
              "comments": [
                {
                  "score": 30,
                  "content": "Yeah, he would get a bowl of some shredded cheese and tomato sauce, since he already ate the bread part of the pizza",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "It seems so intentional and proprietorial....like the king of the realm announcing, \"Everything I lay my eyes on is MINE MINE MINE!!\"\n\nI think I'd have to go into his den/office/side of the bedroom and just start taking stuff and hiding it. \n\nLike, if he's a gamer, take the controller and when he comes looking for it say, \"Oh, it was the perfect size and shape to rest my curling iron on, so I took it.\" \n\nNTA.\n\nHe's TA.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "Make him do the grocery shopping, meal planning and cooking for a week. Then roam the kitchen at night and grab fistfuls of random ingredients.",
              "id": 48,
              "comments": [
                {
                  "score": 8,
                  "content": "He would just cock it up intentionally so op doesn't ask again. I would \"accidentally\" use things he had plans for to show him how annoying it is.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Well HE would still have to eat it, as well as the kids. So it would just be a problem for himself if OP just sticks with it and don't let him weaponize incompetence",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "its passive aggressive behavior, from what you described.\n\nNTA, at least for feeling upset, the question is, what is he upset about to do this type of behavior?\n\nBecause, as you said, he knows by now that certain foods are not for snacking but for future planned meals.\n\nSo he is intentionally doing this to irritate you or inconvenience your meal making plans.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 254,
          "content": "I bought the large size of chips and then bagged them in   snack bags for the kids' lunches.  I stored them in a box on top of the refrigerator, out of sight.  \n\nI went to make their  lunches the next morning,  there were no bags of chips for snacks.  In the mancave, in the trash can, were ten empty snack bags. We had words.  A few days later, he was angry because he had gained 5 pounds, and it was, of course, all my fault.  So he missed something important with the Reserves.  \n\nAll my fault.  The kids liked to have snack bags with chips, as well as the apple slices and veggie \nsticks/ slices.",
          "id": 52,
          "comments": [
            {
              "score": 141,
              "content": "[removed]",
              "id": 53,
              "comments": [
                {
                  "score": 149,
                  "content": "I let them know, and got more, pre packed this time, and hid them better.  \n\nA different time, I had similar problems with my homemade chocolate chip cookies.  ( scratch)  I baked, packed them up.  I worked in evenings.  I would get back,  and see 3  of the  30 cookies left.   I am so glad I divorced him.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 66,
                      "content": "> I would get back, and see 3 of the 30 cookies left.\n\nSounds like every time I bake cookies, too (it's just me in the house).",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": ">   I am so glad I divorced him.\n\nI am glad you did too! There is no forgiving a cookie thief! (unless it's a dog)",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": ">and hid them better\n\nFrustrates me so bad that after all that you still couldn't trust him to have some restraint to not eat his own kids' lunchtime snacks!!",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "[removed]",
                  "id": 58,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "That would only get him well into a temper.  He would yell, punch walls, and just for me he would try to strangle.  I divorced him, and cost him a great deal of \n$$$.  And the house.  FA FO..  I had a very good lawyer.",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "It is a power, passive aggressive, move. Consciously or unconsciously it is still a power move. He needs to learn how to communicate his emotions and feelings because this behavior is usually born from feelings of inadequateness in his relationship.\n\nMy ex was the master of passive aggressive and during the divorce it came out that he did it to pay me back for being more competent and popular with family and friends.",
          "id": 60,
          "comments": [
            {
              "score": 26,
              "content": "Yeah, I think it's more passive aggressive than oblivious too.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "like that dickhole husband that cut the centre out of the lasagna his wife made for her niece's birthday.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Jesus Christ that's insane..",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 113,
          "content": "*why* both of them?",
          "id": 64,
          "comments": [
            {
              "score": 196,
              "content": "Because either he’s an AH and doing it on purpose or he’s to stupid to breathe without instructions. OP could always ask her MIL how many times he was dropped on his head as a child, because this is not normal, civil behaviour.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "Because he’s doing it on purpose",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "The left ends taste better.",
              "id": 67,
              "comments": [
                {
                  "score": 42,
                  "content": "If you flip it after eating there first half then the second half also becomes the left end. #protip",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "And who tf eats that way?? Taking only half of 2 of the exact same loaves of bread?? Like that's so wasteful, I'd be pissed even if the bread wasn't meant for something else.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Dude exposed himself by eating part of both baguettes. No way he can argue that he had to be told not to do that. At this point it’s intentional or something deeper",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "But if he asks, and she say \"Yes, I'm saving them\" then he doesn't get to eat them. So he's not going to ask because he wants what he wants and he doesn't give a shit. Does he have impulse control in other areas of his life or just with food?\n\n&#x200B;\n\n(NTA)",
          "id": 71,
          "comments": [
            {
              "score": 3,
              "content": "I wonder if he just does whatever he wants at work?",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "On there other hand, this is a *fantastic* excuse to label EVERYTHING in the house with \"okay to eat\" or \"don't eat\" - including doors, walls, furniture, etc - and become a legend of Petty Revenge. \n\nBut yeah. Husband is being willfully obtuse. NTA for sure.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3381,
      "content": ">...the first six inches ripped off of each loaf, scanned the house, and saw my husband chewing. \n\nIt's like he's marking his territory, lol.\n\nYou are NTA.  May I suggest that whenever he does this you simply refuse to cook unless he goes to the store and replaces what he ate.  Also, hang a sign in the kitchen, \"All food in this kitchen is for a specific purpose. Ask before mindlessly devouring.\"\n\nHe won't stop until he realizes the problems his actions are causing you.  You have to make this his problem.",
      "id": 74,
      "comments": [
        {
          "score": 1350,
          "content": "Sounds like there’s enough baguette left for wife and kids, so she should make pizza for them and none for him.  Maybe he’ll figure it out when he goes hungry for dinner.  Or he has to come up with a meal, shop for it and cook for that night since he ruined her plan for dinner that night.",
          "id": 75,
          "comments": [
            {
              "score": 1552,
              "content": "“Sorry, you already ate yours.” (Hands him a bowl of sauce, cheese and pepperoni)",
              "id": 76,
              "comments": [
                {
                  "score": 139,
                  "content": "LOL! Perfect.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 80,
                  "content": "Nahh, with half of the bread gone, kids will be hungry. Not a pepperoni or morsel of cheese to spare.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Not a square to spare!",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yeess!",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 218,
              "content": "Perhaps his pizza should be on slices of Wonder bread.\n\nFeed the kids earlier than regular dinner .",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 168,
              "content": "Oh, that's perfect. I'd definitely say if he eats something that was meant for a meal OP should take it as him volunteering to make dinner. Don't feed him and don't cook for the kids either unless there's enough left like with the bread. Weaponize those kids! When they come to mom whining that they are hungry, point them straight at Dad \"I was going to make X, but Daddy ate the ingredients so he's making dinner tonight.\" \n\nIf he's such an awful partner that he'd let the kids go hungry rather than cook, it's time to think about divorce. NTA",
              "id": 82,
              "comments": [
                {
                  "score": 99,
                  "content": "This was supremely effective for me. Now my kids put things in the fridge and say \"Daddy please don't eat all of  this in the middle of the night.\" He hates it! But also deserves it.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 85,
              "content": "The problem is that once the crust is off, you only have a certain amount of time before the bread hardens and isn't good.  If they were for tomorrow's dinner, then tomorrow they'll be too hard for dinner.  \n\nThere are ways to mitigate this, i.e. immidately sealing the bread after you cut it, only doing a small part so only a small part gets hard, etc, but it sounds like the husband did the very thing that would ensure both would be ruined with little hope of mitigation!  This is what makes him an asshole, he specifically did the thing that would ruin the bread the most.",
              "id": 84,
              "comments": [
                {
                  "score": 52,
                  "content": "Just a heads up. Hard bread can be brought completely back to just-baked status by rinsing it under the sink and putting it in the oven while it preheats. It comes out perfect. It's a really good hack!\n\nNot defending the husband at all. But you basically never need to throw out hard bread. It really comes out good as new!\n\n*Edited for spelling",
                  "id": 85,
                  "comments": [
                    {
                      "score": 36,
                      "content": "I'm skeptical but going to try this soon.  If it doesn't work, I'm coming back and typing to you in all caps.",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Yes this.  It works every time.  Preheat the oven to 400F.  Quickly pass the bread under running water (only the crust parts - not the open parts) and put it in the hot oven right away.  You get a nice crunchy crust and still soft inside.  Chef’s trick my mom taught me. She’s a chef",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Sounds fair to me, lol!",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Dude will just get pissy and order take out. Probably something that will make the kids want it causing them to misbehave and then he'll make OP deal with that as well.",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Serve him the rest of the toppings just cooked on baking paper, while everyone else's in on the remaining baguette.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "those plans always backfire. oblivious selfish people won't learn from passive aggressive hints. He won't \"figure it out.\" If you stop making him dinner he'll just go grab fast food and eat it and bring nothing back for anyone else.  He'll need the rules clearly spelled out.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 602,
          "content": "humorous treatment mindless shaggy quaint absurd concerned market gold alive\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
          "id": 92,
          "comments": [
            {
              "score": 80,
              "content": "I 100% agree, just...who does that?? LOL!",
              "id": 93,
              "comments": [
                {
                  "score": 105,
                  "content": "At Panera the side piece of baguettes are usually ripped off, to be fair though we dock it before baking so that it's easier to rip it. The thing that really gets me is that he ripped both of them, like if you want 12 inches of a bread just take it all from the same loaf. The fact that he took from both seems like an extra f u to op",
                  "id": 94,
                  "comments": [
                    {
                      "score": 41,
                      "content": ">Ripping pieces off **separate** baguettes",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "I was about to say, since he can't seem to control himself, maybe he needs a special snack basket with his name on it, and padlocks on the rest of the kitchen since he clearly can't control his indiscriminate eating. Sheesh.",
              "id": 96,
              "comments": [
                {
                  "score": 59,
                  "content": "OP said they have a whole snack cabinet! He specifically went into the ingredients cabinet to get the bread that was clearly for a meal.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 41,
                      "content": "That's even worse! Plus doing it to both loaves, it sounds like some kind of passive aggressive shit to me for sure.",
                      "id": 98,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "I feel that's less control and more a very conscious action. He ripped into both baguettes?! He couldn't start and finish one, leaving the other untouched? I'd be so mad, too.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yeah I really don't have any explanation other than malice, honestly. Not when it was both loaves. I don't know if he hates the pizzas, if he's mad about something else, or he's just being a dick. This is so bizarre to me that I'm just kind of sitting here going \"what the fuck\" and thanking the stars that my spouse would never do anything like this.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "What is it with some dudes and just ripping food off for snacking? I know someone that does it with blocks of cheese and I guess it doesn't really harm anyone but it kind of grosses me out seeing the jagged edges",
              "id": 101,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Right, like what sort of absolute animal opens both breads to rip off half of each with their bare hands, instead of just eating one?\n\nAlso you're 37 with kids bro, you can't just eat a loaf of bread for dinner.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 131,
          "content": ">He won't stop until he realizes the problems his actions are causing you.  You have to make this his problem.\n\nHe won't stop until they become HIS problems.  He should have to go out and replace stuff immediatly.",
          "id": 103,
          "comments": [
            {
              "score": 7,
              "content": "Yep. If it was me, with how often this has apparently happened at this point, I would be handing him his keys, wallet, and shoes, and saying he has five minutes to be on his way to the grocery store before I start packing the car to spend the rest of the week with my nearest relative.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "Or just refuse to cook what you were planning for him. Make something for you. Keep this up until he realizes his behavior is not being tolerated and rewarded anymore.",
          "id": 105,
          "comments": [
            {
              "score": 7,
              "content": "Honestly I'd tell the kids \"daddy had his dinner already\" and he can eat something else if he's still hungry. He ate more than just his portion too",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This happens at my house except with dishes. I cook, and my husband is responsible for the dishes. Sometimes he’ll just throw everything in the dishwasher instead of washing by hand, which I don’t usually mind. The problem is when he does it and doesn’t run the dishwasher. If I don’t have clean pots and pans to cook with, I don’t cook.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "I was gonna say she should get a spray bottle. If he’s gonna act like an animal, he’s gonna get sprayed like one too /s",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "“He won’t stop until he realizes his actions are causing *him* problems.” FIFY.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Exactly. There need to be consequences. And maybe a rebalance of household duties? How much of the mental load do you carry, OP?\n\nNTA",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "This is actually a really good solution. This way you don't have to get angry at him. \n\n\"Honey, I told you to ask me before eating things like this. Can you please go to the store to get some more so that I can make dinner?\"\n\nIf he refuses.... you can just calmly say that you can't make dinner (or only make it for you and the kids of there is enough of the ingredient left over, and he can eat PB&J or something from the snack cabinet)\n\nIf he continues to do it, then it might be time for him to take over shopping and cooking for awhile to give you a break, and for him to learn how difficult and time consuming it is.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "THIS - he created the problem, he needs to fix his own mistake. Every time.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2002,
      "content": "He ate pieces of \\*different\\* loaves. Either he has failed basic comprehension of food safety and storing, or he is intentionally eating things you bring for dinner. You also said it was in the \"do-not snack\" area. Consider a divorce before it becomes your keys, your wallet, etc. NTA, but your husband loves being one.",
      "id": 113,
      "comments": [
        {
          "score": 503,
          "content": "Wow, if he chooses to snack on OP's keys, that's some hardcore hunger there...",
          "id": 114,
          "comments": [
            {
              "score": 126,
              "content": "It'll unlock a new taste.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "Hey, pica is a crazy disease 😅",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 135,
          "content": "I would also say that husband should be grocery shopping at least occasionally.  If he wants something different he can buy it.  \n\nHe’s acting like he never gets anything special.  Still op is NTA.",
          "id": 117,
          "comments": [
            {
              "score": 46,
              "content": "Ugh I upvoted you because I agree but even if he doesn’t grocery shop, he is welcome at any point to say “hey, would you mind getting me some X?” \n\nSource: “Was it on the list?” is now a famous tongue-in-cheek saying in my household. The reason being that for the longest time, my husband would ask me if I’d gotten milk/his yoghurt/the biscuits he likes, when we had a shared grocery list. I got sick of checking in and didn’t have the mental space to keep track of when his items were out.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "Who even needs a fucking do not snack area, is everyone here just dating children that do not communicate and make food together or for each other?? Wtf",
          "id": 119,
          "comments": [
            {
              "score": 4,
              "content": "Some people are just really selfish and refuse to change their ways. My mom has a small fridge so we leave drinks (12 packs of soda, water bottles, Capri Suns,  etc.) on the floor and replace as needed. I put a 12 pack of sodas my mom likes in the fridge and 2 cans of mine. She finished her box of soda and then drank my drinks. She had another 12 pack on the floor and so did I, and she didn't bother replacing them. It's a common occurrence and leads to constant fights but she won't stop doing it.\n\nShe also does this with medicine. She takes aspirin every day and then says \"Oh no! I'm out of aspirin! I need you to go get more or else I won't be able to get out of bed tomorrow!\" I ask her if she didn't know yesterday that she took the last of the pills? That you can generally see through pill bottles and see \"Oh, I've only got 6 left.\" She just leaves it until the last minute because she isn't inconvenienced at all and she isn't paying for the replacements.",
              "id": 120,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "I mean, divorce? For this? OP is NTA but to even think of divorce before labeling things is ridiculous. I don’t think she should have to label things that she’s saving but it’s certainly a better alternative than divorcing the poor bastard.",
          "id": 121,
          "comments": [
            {
              "score": 75,
              "content": "The point of marriage is to make your life better. Sure, that won’t be the case for *everything*. If he improves OP’s life in other ways she’s welcome to just disregard advice like that.\n\nHowever if all he does is inconvenience her, make life harder, ignore her communications and disregard her feelings time and effort, etc, why stay married? What’s the point?\n\nI think there is a kind of subconscious belief that incompetent men deserve someone to take pity on them, as you said, “the poor bastard.” But the purpose of women isn’t to be miserable so that men’s lives can be easier. A lot of folks seem to think it is, sadly.",
              "id": 122,
              "comments": [
                {
                  "score": 10,
                  "content": "I agree. But we don’t have all the info on IF he does the things you’re saying (I understand you bring them up as hypotheticals, not accusatory). Based on what OP has said, divorce is waaaaaay too far. There are many steps between this and divorce.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I'm sorry but if your partner is deliberately stealing food from your children then it's divorce time",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "I think it's likely he does far more than what's in this post.\n\nWhat she's describing is a fundamental lack of respect and disregard for what she contributes.\n\nShe took the time and energy to plan the meal, shop, put the food away, and eventually cook the meal.\n\nHe has ignored all of that work because he wanted to. He wanted to eat part of each baguette more than he wanted to respect his wife's time and effort.\n\nNow if he's showing that lack of disrespect over something as a minor as \"I wanted to have some baguette RIGHT NOW, rather than as dinner\", I'll bet you he's showing a lack of respect and a disregard for her efforts in other ways as well.\n\nIt's even worse if you consider him eating the yeast packets. Who the fuck does that? Those aren't pleasant or particularly edible all by themselves so he intentionally ate something awful and ruined his wife's plans and efforts. That's either pure spite or mentally ill. Either way it means his behaviour probably isn't isolated to just this.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "You’re kind of right — but a lot of advice is “IF he does this, then consider ____”\n\nIt’s a valid concern at least, considering OP stated that he does chronically eat ingredients, and *intentionally* ignores her when she says “don’t eat X”\n\nThat makes it more likely than not that this is a pattern of behavior. I also know first hand how helpless it makes you feel when communicating never works no matter how many times you try — even if it’s “just” over food ingredients and nothing else, Op has established that it is a pattern. And it’s really degrading and depressing even if it’s just food that you’re constantly ignored about.\n\nI can respect this though. Totally fine to want more info and to suggest things like couples counseling before going that far. Though if someone is done, and too exhausted and can’t recover from the disrespect, it’s okay to go right to divorce.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Is it? He ate half of two different loaves of bread. He either needs a social worker or therapy for passive aggressive narcissistic behaviors, Stupidity or cruelty are the only two options here. I am genuinely asking what another alternative is, for him eating \\*two separate\\* halves of \\*two separate\\* loaves.",
              "id": 127,
              "comments": [
                {
                  "score": 18,
                  "content": "Some of the comments here are almost unbelievable naive. Once someone goes this far, there is no way back. Life in a supermax or permanent exile to the Yukon are the only options here.",
                  "id": 128,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "r/AmITheAsshole, where people get upvoted for recommending divorce over bread.",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Definitely sounds like an intentional thing. There's not a bread problem, but a husband problem, OP needs to uncover why he does that.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Not telling someone to get divorced on Reddit challenge (impossible)",
          "id": 131,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1365,
      "content": "NTA. Just because he ate off of both loaves before finishing the first one. Who the heck does that?",
      "id": 132,
      "comments": [
        {
          "score": 511,
          "content": "Animals. Animals do that, lol.",
          "id": 133,
          "comments": [
            {
              "score": 97,
              "content": "yes, my cats will do that in a heartbeat, but they are cats fighting over food, not an adult human desecrating 2 loaves of bread for no good reason.",
              "id": 134,
              "comments": [
                {
                  "score": 5,
                  "content": "But...but...he was *hUnGry!* /s",
                  "id": 135,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 222,
          "content": "an AH who knows they shouldn’t eat an entire baguette, so they eat half of two baguettes so their gluttony doesn’t look as bad.",
          "id": 136,
          "comments": [
            {
              "score": 71,
              "content": "It backfired. Looks so much worse. 😬",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "It's like the guy eating the party sub all over again...",
              "id": 138,
              "comments": [
                {
                  "score": 5,
                  "content": "OK WHAT, link please!?",
                  "id": 139,
                  "comments": [
                    {
                      "score": 10,
                      "content": "[Party Sub is way worse form of gluttony, but it's a classic read]( https://www.reddit.com/r/AmItheAsshole/comments/ca7bdz/aita_because_i_ate_more_than_my_share_of_a_6_foot/)",
                      "id": 140,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 81,
          "content": "Someone on a power trip",
          "id": 141,
          "comments": [
            {
              "score": 62,
              "content": "It really does feel like he did that on purpose just to show he could.",
              "id": 142,
              "comments": [
                {
                  "score": 6,
                  "content": "yes, only slightly better than peeing on things to claim them.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": "I know right? NTA.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1003,
      "content": "nutty unwritten puzzled marvelous bake steep spark plant reply frightening\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
      "id": 145,
      "comments": [
        {
          "score": 569,
          "content": ">Sounds like someone with zero social awareness tbh.\n\nor someone who never has to worry about or deal with meal planning, grocery shopping and cooking \n\nNTA OP, and I'd take this as an opportunity to let the husband take over dinner and all the related tasks you currently do\n\nthis [checklist for gender](https://vardgivare.skane.se/siteassets/3.-kompetens-och-utveckling/projekt-och-utveckling/jamstallt-foraldraskap/material-foraldrar---fillistning/checklist-for-gender-equality-in-your-everyday-life.pdf) equality might be interesting to look through with your husband!",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 188,
          "content": "I wonder if OP is married to the party sub guy. They seem to have the same amount of bread related social awareness",
          "id": 147,
          "comments": [
            {
              "score": 55,
              "content": "Ah! party sub guy. I loved that one - laughed for weeks.",
              "id": 148,
              "comments": [
                {
                  "score": 12,
                  "content": "Oh god got a link?  Sounds like a great read",
                  "id": 149,
                  "comments": [
                    {
                      "score": 21,
                      "content": "https://old.reddit.com/r/AmItheAsshole/comments/ca7bdz/aita_because_i_ate_more_than_my_share_of_a_6_foot/",
                      "id": 150,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Party sub guy haunts my nightmares.",
              "id": 151,
              "comments": [
                {
                  "score": 6,
                  "content": "I had to convert the inches to normal measuring system first, and after doing that he never left my nightmares either.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "She said he's a software programmer so it tracks.",
          "id": 153,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": ">Sounds like someone with zero social awareness\n\nOP later clarified that he's a software programmer",
          "id": 154,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 852,
      "content": "NTA, he's doing it on purpose. He resents that you are expecting him to NOT have free access over every single piece of food that comes into your house, and he's making a point to eat anything he sees that you obviously have plans for. It's selfish behavior. \n\nIt's either that, or he's insufferably stupid. \"He can't read her mind!\" but he shouldn't HAVE to, it should be obvious that if something is there that isn't normally there, you ASK why it was bought before you rip into it like an animal. \n\nSo. Either he's too stupid to understand that not all food belongs to him, or he's doing it for control. And I'm leaning towards the control. He even made sure to tear up BOTH loaves, so there wasn't even one intact loaf to use! That was on purpose!",
      "id": 155,
      "comments": [
        {
          "score": 120,
          "content": "“Never ascribe to malice that which is adequately explained by incompetence”",
          "id": 156,
          "comments": [
            {
              "score": 161,
              "content": "I have heard that. But I've also heard of this exact thing happening for the exact reasons I've stated. Sometimes malice IS the more adequate explanation.",
              "id": 157,
              "comments": [
                {
                  "score": 110,
                  "content": "Alsooo not to overgeneralize but people like this do specifically use the excuse of ignorance to hide their malicious behaviors.\n\nWe have really dropped the ball in this way, especially for women. We keep telling them their partners hurt them by accident, he’s just a dumb oaf, etc. But people **purposefully* take advantage of women and then feign ignorance. We need to stop pretending this never happens and that every man hurting a woman is just a silly dumb baby who has never interacted with people before in his life.\n\nMen are way way more self aware than they’re given credit for, it’s just they’ve been *allowed* this excuse for so long, that they get away with it all the more easily.",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "Definitely an element of disrespect regardless of motivation!",
                  "id": 159,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Absolutely. This is not the first time they've discussed the topic, that much is clear!",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 62,
              "content": "I use this frequently (Hanlon's Razor) but also remind people of the corollary:\n\nSufficiently advanced incompetence is indistinguishable from malice.",
              "id": 161,
              "comments": [
                {
                  "score": 28,
                  "content": "OG weaponised incompetence",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "\"Any sufficiently advanced incompetence is indistinguishable from malice\"",
              "id": 163,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "It sounds like things are more or less resolved (to a point) between OP and her husband, but I find myself wanting info since I can't imagine this is a new behavior and they have been together for 7 years... How has it gone on this long?\n\nAs others have picked up on, it would seem that there are tastier things available to eat if \"I was just hungry\" was the true motivator, plus \"just hungry\" would explain eating one full loaf, even both of them, but does not adequately explain *half of two separate loaves*. That behavior, it's conspicuously destructive nature, is what suggests something more going on. And the fact that he still falls back to a \"just hungry\" defense suggests he's still refusing to be honest with himself and/or his spouse.\n\nI completely dismiss the possibility that this is due to stupidity, but I also think it is too deliberate for it to be mere selfishness. I think there has to be something deeper than that going on to act in such a way... One of the things I wonder is if he exhibits other instances of poor impulse control, but what I think is probably more likely and interlaces well with how childlike his actions are is that this is some latent response to being a kid raised in a household that was repressive in a similar way as far as what could be eaten and when.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 610,
      "content": "> I am sure if I was planning to bake something and bought yeast, I would come home to find him completely distended and surrounded in empty yeast packets. \n\nNTA because that's the funniest sentence I've read in a while.",
      "id": 165,
      "comments": [
        {
          "score": 117,
          "content": "It's wild to me that the savaged baguettes are getting more attention than eating fucking yeast packets",
          "id": 166,
          "comments": [
            {
              "score": 128,
              "content": "Because the yeast packets are hypothetical, and the baguettes are not?",
              "id": 167,
              "comments": [
                {
                  "score": 71,
                  "content": "Ohh totally skipped over the key words. The imagery was so vivid I thought it was something he did",
                  "id": 168,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Omg he would need to spend some time in the psych ward",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "This whole post is poetry",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "She's NTA because she's hilarious. \n\nAnd right. \n\nBut hilarious. \n\nOP: my professional advice, as your Friendly Internet Proctologist, is that you get a divorce and find someone who is just as hilarious and capable as you are, and turn this awful story into an illustrated children's book about the evils of sloth, spite, and gluttony. u/Previous_Mood_3251",
          "id": 171,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 600,
      "content": "I had an ex like this, if I bought myself a drink on the way home and popped it in the fridge to chill it was immediately gone, more than once he ate my packed lunch for the next day, sometimes while I was actively cooking he would try to take all of something I'd just chopped up that was supposed to go in the dish. It was about entitlement and control and it didn't stop with food and that's why he's an ex.",
      "id": 172,
      "comments": [
        {
          "score": 162,
          "content": "Good on you for recognizing that you're worth more than that and dropping that moldy old sausag.",
          "id": 173,
          "comments": [
            {
              "score": 113,
              "content": "sausage never had a chance to go moldy around him",
              "id": 174,
              "comments": [
                {
                  "score": 8,
                  "content": "😂",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "My ex would eat all of his meals really fast. It was really annoying. If I spent 40 minutes cooking, it would be nice if he didn't scarf everything down within 4 minutes. One time he guzzled and finished an entire sprite all at once, then grabbed my Diet Coke and guzzled that too. There were many cans already in the fridge, he just didn't want to get up!",
          "id": 176,
          "comments": [
            {
              "score": 26,
              "content": "In my experience, people that eat with such speed and singular focus, in such a visceral manner are usually pretty fuckin dumb",
              "id": 177,
              "comments": [
                {
                  "score": 8,
                  "content": "Actually, everyone I’ve ever asked about this grew up with siblings that would steal their food",
                  "id": 178,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I was once at a friends house who had loads of siblings, and her mum made everyone wait until I’d served myself before letting them go, because it was like I blinked and it was all gone",
                      "id": 179,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Hahahaha! I will say this guy was very intelligent. It also had nothing to do with siblings because he only has one younger brother who he mildly bullied as kids, so if anything he was probably the food thief in the family. I think it has something to do with ADHD and impulse control. I also have ADHD and my impulse control issues manifest different. Our relationship began right before covid and ended almost a year ago, so we didn't eat with other people very often, but I do remember being embarrassed on at least one occasion. I was almost dreading introducing him to my parents, they can be quite judgmental.\n\nHe used to have an executive position at a highly specialized software company, and his job required constantly flying to big cities in North America and Europe for conferences and meetings with clients. He talked about some of the famous restaurants he'd been taken to and I couldn't help but wonder if he checked his manners on these occasions. Who knows?",
                  "id": 180,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "My friend eats a very strict diet and meal-preps every Sunday. Her husband knows this. She has been doing this for years. And yet… a couple times a month he eats her prepped meals.",
          "id": 181,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "My spoon on his knuckles would teach him to touch food while it's being prepped.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "My wife was like this sometimes. For example, I would ask her if she wanted fries, she would say \"no\", but then eat mine anyways.\n\nInitially it was a little annoying, but then I figured it wasn't a big deal. I just got extra fries and if she really doesn't want to eat it, then I have extra!\n\nI do this now for everything and not just with my wife. I bring Costco loads of stuff for my friends and family.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "My ex husband was v similar - if a leftover was mine it was like it was glowing and beckoning him. I started writing warnings and curses on the packages. As in “anyone other than she who eats these fajitas shall have their genitals shrivel and fall off in the night” type curses. Or “SHE WILL LEAVE YOU OVER THIS IF NOT MURDER YOU”. \n\nIt merely slowed him down vs stopping him. \n\nOne of the worst things he ever did was eat the homemade pickles my mom made just for me that she had labeled at my own. SHE ALSO MADE HIM A JAR, but he just had to eat both.\n\nI was inconsolably, unimaginably angry with him. He says that to this day he thinks I was angrier about that than I was when I found out he cheated on me. Maybe I was.\n\nA decade on, we’ve become…cordial? But he’s not allowed to eat jack shit at my house. And he has finally learned to respect that boundary.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 365,
      "content": ">ripped the top off of both of them like that final boss bloater in The Last of Us that lumbers out of the hole and rips the guy’s head off\n\nI'm dying! NTA.",
      "id": 185,
      "comments": [
        {
          "score": 87,
          "content": "Right? I got so distracted laughing at that line I forgot there was supposed to be a judgment.",
          "id": 186,
          "comments": [
            {
              "score": 47,
              "content": "The yeast is what got to me lmao",
              "id": 187,
              "comments": [
                {
                  "score": 6,
                  "content": "The yeast line was particularly inspired, I agree.",
                  "id": 188,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Same!",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I know! And I saw some people taking the last part of that line \"unforgivable\" literally and giving OP shits about it... That line was exaggerated for humor, people! 🙄",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Seriously. This killed me 😆",
          "id": 191,
          "comments": [
            {
              "score": 8,
              "content": "The edit is even more fun. \n\nOP? If you and Racoon Boy should ever split, give me a call OK?",
              "id": 192,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 274,
      "content": "NTA.  He's behaving like a child.  In future, make him do a fair share of the cooking and/or shopping.  Sounds like he is not involved enough.",
      "id": 193,
      "comments": [
        {
          "score": 36,
          "content": "seconding this! make HIM do atleast a third of the meals. he sounds like a kid",
          "id": 194,
          "comments": [
            {
              "score": 3,
              "content": "Make him do half at least tbh",
              "id": 195,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}