{
  "post content": "Friday night was spent shredding it up at the local skatepark with a group of friends. I leave my wallet, backpack, key’s, and beers by my friends things so it’s all grouped together. A grom we normally skate with came over and told me there was a kid hanging out by our gear and looked suspicious. So I immediately skate over to where he is. The kid runs into the porta potty while I’m approaching him. I go and check my bag and behold, my wallet is missing. I run over to the bathroom he’s in and politely ask him to give the wallet back. After about five minutes of him denying taking anything he finally opens the door and hands me my wallet. He’s got a brand new longboard in the stall with him so I snatch it and said “it sucks when someone takes something from you huh”.  Instead of calling the police, I gave him my phone number and said “I’m keeping the longboard until your mother calls me.”  AITA for taking this kids board!?",
  "id": 1,
  "comments": [
    {
      "score": 102,
      "content": "ESH, stealing is wrong even if you’re stealing from a thief. You don’t know this kids situation either, what if he didn’t have a mom or his mom was working somewhere and couldn’t take a call?",
      "id": 2,
      "comments": [
        {
          "score": 32,
          "content": "The child appeared to be well kept, and had money. Had a brand new iPhone and was carrying around a MacBook Pro. So I can assume he’s living pretty comfortably. I gave him my number as a contact in his phone. Not to call on the spot because it was a brand new phone and he didn’t have his parents number in it yet. So I told him to have his mom call me if he wants the board back. I want his parents to know what he tried to do.",
          "id": 3,
          "comments": [
            {
              "score": 16,
              "content": "Why does it matter how well off he is? You still took his possession. If you ended up more 'well kept' than he, would it be okay to take your wallet? I dont disagree with what you did, I agree with making sure his mom knows he's a hooligan, but your logic here is hard to follow. I think you did the right thing, but you're still an asshole especially if this is how you justify it. More importantly, this kids rich mom pretty much has proof you stole her kids shit (even if it was \"justified\") and she might not take it was well as you did finding out your stuff is gone, and might flip shit and call you for reasons other than an apology.",
              "id": 4,
              "comments": [
                {
                  "score": 5,
                  "content": "Worst case scenario, OP gets a call, in person, from the police.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Thieves don’t normally give their phone numbers",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "So you stole his property and he has your contact info so he can go straight to the police. That's kind of you",
              "id": 7,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 45,
      "content": "I'm going to go with ESH. The kid is obviously a jerk, and he shouldn't have stolen your wallet, and he probably deserves whatever he gets. But he did return the wallet to you, and what you did in response is illegal. You stole a child's longboard. If he reports you to the police, you could be in trouble, despite the circumstances. All the police have is your word that he ever stole your wallet. You should have either let it go or, if you were that upset/concerned, called the police.",
      "id": 8,
      "comments": [
        {
          "score": 2,
          "content": "My friends saw what happened and would be able to back up my story.",
          "id": 9,
          "comments": [
            {
              "score": 24,
              "content": "You still stole a kids longboard, it doesn’t matter  if you have a witness saying he stole something from you first.  ESH.",
              "id": 10,
              "comments": [
                {
                  "score": 7,
                  "content": "ESH is what the cops would say too.",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Back up your story that you stole something from him?",
              "id": 12,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 35,
      "content": "NTA, fuck that kid, hope he learned his lesson.",
      "id": 13,
      "comments": [
        {
          "score": 7,
          "content": "How does stealing his shit make OP not an asshole as well?\n\nThis isn’t /r/pettyrevenge",
          "id": 14,
          "comments": [
            {
              "score": 3,
              "content": "He hasn’t stolen it. He has taken it as a way to get the kid’s parents involved. At least that was my interpretation.",
              "id": 15,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Because the kid wasn't going to give this guy his wallet back. It should be a toighy learning experience for the kid so he doesn't keep doing shit like that.",
              "id": 16,
              "comments": [
                {
                  "score": 2,
                  "content": "Ok but that doesn’t mean OP can’t pull an asshole move. He can be morally right and still be an asshole. There was a big meta post about it as well.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Not sure what a meta post is, but this guy is asking Reddit's opinion on whether or not he's an asshole. I've stated mine. Have a good day.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 16,
      "content": "deleted  ^^^^^^^^^^^^^^^^0.8774  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/69254)",
      "id": 19,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "ESH. Regardless if the kid took your wallet, you took his property as well. You could get in trouble for it because by the base definition, what you did was theft. The kid taking your wallet was shitty too, and him being a kid is no excuse for it.",
      "id": 20,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "NTA. You probably mad a bad choice legally by taking his board but I see where you are coming from. You let the kid just go and he never learns. You call the cops and it fucks up his life. You do what you did and at least his parents know and can deal with it. \n\nTo protect yourself I would probably just call the cops next time. You could still get in trouble for this if his parents are assholes. He learned it from somewhere so that might be the case.",
      "id": 21,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "YTA, and if the kid/parents decide to call the police, you will be charged with Theft.",
      "id": 22,
      "comments": [
        {
          "score": 3,
          "content": "and possession of stolen property.  not even close to worth it OP.  been there (bike, not a longboard), and had to hire a lawyer.  unless you have a cool 10k to burn, id highly recommend returning that board immediately.",
          "id": 23,
          "comments": [
            {
              "score": 2,
              "content": "Right? OP should also apologize profusely and pray that the kids parents have mercy and don't file a report.  What an idiot.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "ESH an eye for an eye makes the whole world blind as they say",
      "id": 25,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "ESH. Two wrongs don’t make a right, and it’s not your job to teach the kid a lesson. He gave you your wallet back and probably felt seriously embarrassed for getting caught.",
      "id": 26,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "Eh YTA  and this could backfire on you since you did steal from him, could cause some legal issues. I see your point but I have a feeling that this isn’t gonna go how u want it to go lol",
      "id": 27,
      "comments": [],
      "relation": "No"
    }
  ]
}