{
  "post content": "Sorry for the length and vagueness and general going down a couple rabbit holes for backstory.\n\nMy bf and I have been together three years. We went to colleges in different states and agreed when we graduated we would find jobs in a big city in my home state. We both interned there and mine led to a job offer but despite them liking him, his company couldn’t hire him at the time. He searched for another job there for a the few months before he graduated but I never felt like he tried as hard as he could have. He did not find a job there and instead took a job approximately 1800 miles away with the agreement that it was what it was and I would just find a job there since I graduated second. I interviewed a few places and found a job there after much searching. I gave up the job close to my hometown which was also a job that I really loved and was passionate about and moved with him. \n\nFast forward eight months, I hate my job and miss my family and he loves his job and doesn’t want to leave. The company he interned with near my hometown now wants him back, with a 35% raise but he doesn’t want to leave his job despite it paying less and he liked the other job equally as much. I think he is just comfortable and likes his team a lot, and the weather and surrounding area here. I feel for him but I also can’t help but want to leave and go back to my job that I loved and was passionate about and the city that I loved and grew up near. We are software engineers and it is hard to get a job like that without connections. All my connections are in the other city and my family is as well. His family is in a different city but he hardly visits them even though he could, he has stockpiled vacation days but won’t go anywhere without me. I have gone to visit my family and they’ve visited me a couple times and I really miss them so it seems like that’s a higher priority for me than for him. \n\nFrom my perspective, it seems like he won’t give up a great job for another great job that pays more, leaving me with a job I hate instead of a job I love. On top of, he would rather stay in a place he likes the weather and surrounding area where neither of our families are, rather than an equally nice place but he likes slightly less where my family is. It hurts even more because I gave up a job I loved originally for a job I knew I wouldn’t like so that I could live with him, on the assumption that he couldn’t get a job in the other city and now I feel he won’t do the same. So AITA for wanting him to take the job?",
  "id": 1,
  "comments": [
    {
      "score": 10,
      "content": "> I think he is just comfortable and likes his team a lot, and the weather and surrounding area here. \n\nSo basically he likes living there. You try and belittle this as best you can in the post but it's clear that your boyfriend must really like his current job if he is willing to ignore a 35% pay increase. You aren't an asshole necessarily for wanting him to move back to your hometown but there is a lot of me me me in this post while you attempt to completely negate his feelings. \n\nNAH",
      "id": 2,
      "comments": [
        {
          "score": 5,
          "content": "Shouldn't it be YTA then?",
          "id": 3,
          "comments": [
            {
              "score": 4,
              "content": "No, she's not an asshole for wanting to leave he isn't an asshole for wanting to stay. It's a tough situation. I was just calling attention to the fact that when she is laying it out it's a lot about her feelings and very little about his and what she does include she takes the time to belittle which is shitty behavior that was probably meant to predispose readers to her side but I digress...",
              "id": 4,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NAH - This is a tough situation, and I don’t think neither of you are really assholes here. But there has to be a compromise, and I am on your side with this one. There are many more pros to going back to your home state versus pros of staying where you are. You are two individual people with your own passions and career goals, but you are also a *team*. Yes, we ARE only hearing your side, but the fact he loved both jobs AND he’s being offered a raise seems to show moving states is the better decision. Right now he’s just comfortable and likes the weather - that’s not a good enough reason to stay there when you factor in your circumstance.",
      "id": 5,
      "comments": [
        {
          "score": 1,
          "content": "And though money and family aren't issues *now*, if this is a situation where you've talked about marriage and kids, those things will *become* issues later. You need to sit him down and talk this through. You guys had a plan and when it didn't work on his end you made the sacrifice and moved an incredibly large distance to make it work. Now you're asking him to follow through with your original plan and he's not willing to budge? It seems like he's disregarding the fact that you hate your job and miss your family.",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "While I have been there and understand how you feel, YTA. Its his job and his choice. You have a right to miss him if he doesn't leave with you, but I don't think you are right to think of the situation the way you are because he is not making you do anything. If you stay at a job you dislike that is your choice, not his. He is happy where he is, and you can ask him to come with you if you want, but if he says no he isn't the bad guy. Worst case scenario- sometimes life just takes people in different directions. Don't resent him for it. Be happy that he's doing something he wants to do that makes him happy. It's ok for you to do the same for yourself.",
      "id": 7,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "NTA  \n  \nAre you sure that he wants to stay in the relationship with you and that he isn't using this situation to make you be the one to break off the relationship?   \nCause taking a job that is 35% higher in salary, ultimately has the same job satisfaction, AND has the ability to make sure that you are happy in your career with a forward path for both of you, is a no brainer to me.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSorry for the length and vagueness and general going down a couple rabbit holes for backstory.\n\nMy bf and I have been together three years. We went to colleges in different states and agreed when we graduated we would find jobs in a big city in my home state. We both interned there and mine led to a job offer but despite them liking him, his company couldn’t hire him at the time. He searched for another job there for a the few months before he graduated but I never felt like he tried as hard as he could have. He did not find a job there and instead took a job approximately 1800 miles away with the agreement that it was what it was and I would just find a job there since I graduated second. I interviewed a few places and found a job there after much searching. I gave up the job close to my hometown which was also a job that I really loved and was passionate about and moved with him. \n\nFast forward eight months, I hate my job and miss my family and he loves his job and doesn’t want to leave. The company he interned with near my hometown now wants him back, with a 35% raise but he doesn’t want to leave his job despite it paying less and he liked the other job equally as much. I think he is just comfortable and likes his team a lot, and the weather and surrounding area here. I feel for him but I also can’t help but want to leave and go back to my job that I loved and was passionate about and the city that I loved and grew up near. We are software engineers and it is hard to get a job like that without connections. All my connections are in the other city and my family is as well. His family is in a different city but he hardly visits them even though he could, he has stockpiled vacation days but won’t go anywhere without me. I have gone to visit my family and they’ve visited me a couple times and I really miss them so it seems like that’s a higher priority for me than for him. \n\nFrom my perspective, it seems like he won’t give up a great job for another great job that pays more, leaving me with a job I hate instead of a job I love. On top of, he would rather stay in a place he likes the weather and surrounding area where neither of our families are, rather than an equally nice place but he likes slightly less where my family is. It hurts even more because I gave up a job I loved originally for a job I knew I wouldn’t like so that I could live with him, on the assumption that he couldn’t get a job in the other city and now I feel he won’t do the same. So AITA for wanting him to take the job?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH money isnt everything and if you arent stuggling financially then its possible that he doesnt care about it.  But i understand where you’re comming from, feeling slighted that he isnt jumping at the opportunity to return the favor of moving states...",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "ESH\n\nPersonally unless there's further conversations you omitted it seems as though you never had a conversation with him regarding moving back being an option in the future. Yes I understand that you loved that job and your family is there but now you suddenly spring this on him and expect him to uproot his whole life to move back to appease you.\n\nI highly doubt he sought out this job which tells me that you did the footwork for him with the expectation that he would just say yes. You call him selfish yet that's equally selfish of you to push this on him without his consent.\n\nIn the same token however I still agree that it's foolish of him not to want to take it. A raise is a raise and 35% is nothing to laugh at. Add to that that'd it'd be a better opportunity for you and you'd be happier to be close to family knowing he would still love the new job. So yes he's being foolish as well which is why I'm going with ESH",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH He likes where he is, you don't. This is where you give yourself the space to make the best decision for you instead of centering your plans on him. He's not willing to make sacrifices for you. You can stop making sacrifices to stay with him any time you like. I'd probably start the process now if I were in your shoes.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": -3,
      "content": "NTA. He is being very selfish.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    }
  ]
}