{
  "post content": "My fiance (25M) has braces. He refused to get them when he was a child/teen cause he feared people would make fun of him, but he finally accepted to get them after the dentists told him clearly that it wouldn't be recommended to replace his extracted teeth till he fixes his crooked ones. The issue is that our wedding was supposed to be coming up soon, but now I plan to postpone till my fiance gets rid f his braces. I have nothing against him wearing braces. I even encouraged him to get them to finally fix his bad teeth, but did you ever saw of a groom wearing braces at his wedding photos ? I don't think so.\n\nI thought my fiance would be understanding, but instead he got mad at me and accused me of being ashamed with him. That's obviously no true, I just want our wedding photos to be as esthetically pleasing as possible and that's why I want to postpone our wedding till his braces come off. I also told him he could've avoided all this if he got invisible braces, but he said these were much more expensive and wanted to save money specifically for our wedding and honey moon and didn't think his fiancee would be so shallow to care about it. He ended up saying that if I postpone the wedding now I might as well just call it off altogether, which I think is incredibly unfair of him to do, but maybe I should've insisted on this issue either.\n\nAITA ?",
  "id": 1,
  "comments": [
    {
      "score": 32262,
      "content": "He should postpone the wedding until you mature. YTA",
      "id": 2,
      "comments": [
        {
          "score": 10970,
          "content": "_\"You ever saw of a groom wearing braces at his wedding photos? I don't think so....I just want our wedding photos to be as esthetically pleasing as possible.\"_\n\n_\"He ended up saying that if I postpone the wedding now I might as well just call it off altogether.\"_\n\nI wouldn't blame the fiance if he eventually walks away. OP seems to value having pretty pictures more than starting her marriage and her overall relationship.",
          "id": 3,
          "comments": [
            {
              "score": 2936,
              "content": " OP is showing her true colors. What if at some point in their marriage he is injured or maimed and has a scar or loses a limb. She'll probably leave him.",
              "id": 4,
              "comments": [
                {
                  "score": 1973,
                  "content": "That’s such a reach. The problem in this situation is that there will be pictures taken that last a lifetime so she just wants them to be as good as they can. She doesn’t care if he has braces 364 days a year, but for wedding photos it’s normal to want everything to be as pretty as possible on that day. That doesn’t automatically mean she won’t love him if he becomes less attractive due to an accident or something. (Reserving my judgment because idk how long she wants to push the wedding back)",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2592,
                      "content": "Yeah, no. The braces can be Photoshoped out.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 722,
                      "content": "Most of the pictures, for most of the people attending, will last a week on social media and never be seen again. 1 or 2 photos will be framed and hung in the couple's house, maybe the parents' houses, and that's pretty much it. \n\nThe memory of his fiance's rejection will last a lifetime too.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 364,
                      "content": "Honestly the wedding seems like it's more about the \"image\" for her than it is about love. \n\nAccording to my wife she was the heaviest she's ever been during our wedding.. but I never noticed.. everytime I look at the photos I don't see a difference.. all I see is the beautiful angel I am so lucky to have married..",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 98,
                      "content": "And how much it will cost to push the wedding back",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 65,
                      "content": "I'd rather have a strong marriage that can last a lifetime instead of chipping away at my fiance's insecurities for the sake of some pictures that I may look at once every couple of years....",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "She cares more about looks than she does the person. I’m so sick of brides thinking people, ESPECIALLY the groom, are props for a photo. My best friend/MoH was going to be bald in my wedding photos and I never would have dreamed of postponing until she had the right “look” for the photos.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Photos that no one cares about. Literally no one. In the history of ever, cares about your wedding photos. People don’t want to look at them. They don’t care.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Who tf cares about braces being on their fiancé though? Pictures can still be perfect without worrying about such a meaningless thing",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "People put a lot of emphasis on Wedding Photos. They're expensive and I understand that. But they're supposed to be about the emotion of the day. To convey the happiness you were feeling and to remind you who you were at the time. If that involves braces, a burn, a pregnancy, grey hairs, whatever... Then that should be there. It's part of the story. Part of the emotions of the time. People seem to forget why we memorialize things. It shouldn't be \"Look how pretty I was.\" That route just runs people into the ground as they age and change.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "She did encourage him to “fix his bad teeth”\n\nCrooked teeth are not bad teeth anymore than having a crooked nose means having a bad nose. She wants to live in a world where everything is perfectly beautiful. You can’t make a life with someone who is not ready to accept imperfections as part of it.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "He refused to get braces as a child/teen because he didn't want to be made fun of. So he waits til adulthood for her to humiliate him??? She is Queen Asshole!!",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "The title in itself is pretty telling !! MY wedding ... And then long story short : i don't care about my husband's health. He is going to ruin the aesthetic ! Damn ...",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "This!!!!",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "“True colors”—I have a real question-I genuinely want to know, do weddings really *really* drive people bonkers where they loose all sense of rationality and start to act entitled, rude and pretty much like major jerks under the premise that it is “their day” (in preparation for and just for that day)? Or is this some behavior that has been/is “latent” and unlocks itself under the pressure of the situation/big life-changing event? *In other words, can nice people be infected with “bridezilla-ism” as well?*",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 374,
              "content": "The crazy thing is it would be super simple to edit the braces out of the photos.",
              "id": 20,
              "comments": [
                {
                  "score": 178,
                  "content": "Or smile with your eyes and keep your mouth closed",
                  "id": 21,
                  "comments": [
                    {
                      "score": 70,
                      "content": "I was going to say this. It's easy to smile without showing teeth.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Or, he could have photos showing him happy, in love and depicting just how he looked/felt on his wedding day....",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Not with braces on. It can be hard to keep your lips closed in general with braces on your teeth.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "OP is the one who needs to keep their mouth closed, not the groom.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 97,
                  "content": "I'm not sure that's true. I asked my photographer to edit my husband's braces out and she said it would be really difficult. But this was 4 years ago.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 182,
                      "content": "I have the most basic photoshop skills (as in used photoshop a lot in 2010s)  and I can tell you right now your photographer was lying and/or has no idea about post editing pictures.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 49,
                      "content": "It really all depends.   Close up photos would be more difficult,  but honestly far from hard.   \n\nAt a distance/group photos?  Easy peasy.\n\nI mean there are phone apps that do an acceptable job of it.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "She just didn't know how to do it.  I learned how to do it in college 10yrs ago\n\nShe could always have the brackets switched to clear ones too",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Assuming the photographer shoots digital, a decent graphic designer can edit the braces out. I’d choose some favorite images to edit, as it could get pricey to do the full series.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "It was one of the standard retouch options when my son had his senior pictures taken last summer.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 50,
                  "content": "That is very time consuming and costly, and there’s no guarantee you’ll even like the result. If I were a photographer I’d charge a lot more to do that. \n\nAs a dentist, I would recommend asking the orthodontist to simply remove the wires and brackets temporarily and polish the teeth. Do your wedding, then have them placed back on. They would charge for the service, but it would be a lot cheaper than having a photographer edit each picture.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 6,
                      "content": "That's what mine did, just removed the front brackets",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "He could have his upper braces removed for the day.  We had to do that when my daughter needed an MRI.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Photographer here.. Not true…",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I feel like he’s get mad about that too",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 223,
              "content": "OP's General Statement to Fiance: You're not aesthetically pleasing right now, so I want to wait until I think you are.",
              "id": 37,
              "comments": [
                {
                  "score": 181,
                  "content": "Yup. Imagine a dude wanting to postpone the wedding because she needs to lose weight or something. Firestorm.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Actually never thought about it from that point of view!",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "This right here ^",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "This! The Photoshop-the-braces-out comments are really odd. I can’t think of any other physical aspect that would be fair game for editing. “You’re not going to be fat forever, this is just one stage of your life!” “Yes you’re bald right now but wedding photos are eternal”. If you want to marry someone who cares if the picture isn’t ‘perfect’? Isn’t it better that the wedding photos reflect who you really were at that stage of your life and how much you’ve changed over the years?",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 172,
              "content": "I am so tired of people caring more about the pictures than the wedding and marriage.",
              "id": 42,
              "comments": [
                {
                  "score": 14,
                  "content": "It’s like their sole reason for marriage is social media “clout”.  Make believe world.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 109,
              "content": "Yep. OP wants to get married, not BE married.",
              "id": 44,
              "comments": [
                {
                  "score": 8,
                  "content": "[deleted]",
                  "id": 45,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "This is going to be reposted in so many other subs.. I just can’t believe she’s real lol",
              "id": 46,
              "comments": [
                {
                  "score": 3,
                  "content": "Women can be trash humans too.\n\nDifficult concept for a lot of people.",
                  "id": 47,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "Bingo...very shallow here...hope she doesnt get a zit or need a mole removed right before the wedding. Just plain vain...definitely yta.",
              "id": 48,
              "comments": [
                {
                  "score": 3,
                  "content": "i hope she does, then the fiancé can say \" lets postpone, you arent aesthetically pleasing right now\" wonder how she'd feel if it was the other way around and she were the one with braces..",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I hope she DOES get a zit. Right on the middle of her nose. A big one",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "I mean, of course she does. Don’t you know that the most important function of a wedding is to provide content for the bride’s insta?",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "My brother had braces on his wedding day (also glasses because he forgot his contacts) - my SIL somehow didn't seem to give a shit and still married him. OP isn't starting out this whole marriage thing well.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I feel so bad for OP’s fiancé. He was too self conscious to get braces as a kid because he didn’t want the other kids to make fun of him. Finally gets to a place where he’s confident enough to do it, and OP ends up basically doing what he was afraid of in school. I know that she’s not making fun of him, exactly. But IMO, having the person you love and want to spend the rest of your life with saying “I can’t marry you until those hideous things in your mouth go away” would feel so much worse than having some kids you don’t really care about in the long run calling you Brace Face.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1065,
          "content": "Holy hell!     \nOP didn't get braces as a child because he didn't want to be...made fun of.     \nSo he gets them as an adult, at the encouragement of his fiance, then that same fiance uses his braces as a reason to postpone the wedding because of how his braces will look in the photos???     \n     \nThat is so, so, so much worse than being bullied as a child for having braces.  Kids are stupid, mean, and don't have a reason to support you.  But as an adult your fiance should not be treating you worse!          \n     \nYTA       \n     \nAt least you've revealed to your fiance how shallow you are.",
          "id": 54,
          "comments": [
            {
              "score": 27,
              "content": "Right? That was my exact thought. OP knew that he was afraid of being made fun of, so she then tells him “hey you’re too ugly with those for pictures, we’ll wait till you get them off”",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Not only this but she says \"I even encouraged him to get them\" as though she's being supportive, but the way the rest of this reads I think it's a cosmetic flaw that bothered her so it probably was more about that than supporting his decision to finally do it.",
              "id": 56,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Yeah, that's the part that solidified my YTA. It's one thing if *the fiance* wanted to wait because of pictures, or even if OP wanted to wait because of how self-conscious fiance is. But to straight up say to someone super self-conscious that you want them to be more aesthetically pleasing for your wedding? What the actual fuck? \n\nLike, if fiance is going to spend the wedding trying to smile with his mouth closed or something because he's worried, that's a valid thing. That's not about aesthetics, it's about comfort. But holy hell this OP is out to lunch.",
              "id": 57,
              "comments": [
                {
                  "score": 6,
                  "content": "OP should think of it this way, if the fiance wanted her to postpone the wedding till she could lose weight to appear prettier in the photos? What would be her reaction? \n\n\"I don't think you look ugly when fat. You could be **thicc*** for 364 days a year and I would still love you. But I want perfect wedding photos. Have you ever seen beautiful photos of a fat bride with back rolls beneath her dress? This would never have happened if you had gotten that liposuction/tummy tuck.\" \n\nHate hearing this? This is similar to how the fiance would be feeling right now with regards to his braces. \n\nYTA OP",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yeah, the irony is real! He didn't get braces because he was scared to be bullied. Now he got them and IS bullied. And it's much worse because he's bullied by someone who's supposed to be his best friend.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 592,
          "content": "[deleted]",
          "id": 60,
          "comments": [
            {
              "score": 334,
              "content": "[deleted]",
              "id": 61,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 32,
              "content": "This 100% this",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 134,
          "content": "Fukn zinggghh!",
          "id": 63,
          "comments": [
            {
              "score": 23,
              "content": "[removed]",
              "id": 64,
              "comments": [
                {
                  "score": 3,
                  "content": "Found the fiance",
                  "id": 65,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 132,
          "content": "Do you OP take this man in sickness and in.....braces.",
          "id": 66,
          "comments": [
            {
              "score": 11,
              "content": "She does not. Obviously.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Eeew! No thanks! And I'll prove it by having many many Redditors behind me, they'll know what I mean and support me!",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 103,
          "content": "YTA you have made his childhood fear come true!",
          "id": 69,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 84,
          "content": "I'll notify the burn ward.",
          "id": 70,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 77,
          "content": "Yeah, you’re marrying your husband, not his teeth. Also he probably feels insecure about it and you’re making it worse.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I love that her concession isn’t “maybe I shouldn’t have said anything” but “maybe I should have said this horrible thing sooner” YTA",
          "id": 72,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "She should cancel the wedding all together since she doesn’t want to marry him. She only wants some future “improved” version of him!",
          "id": 73,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9422,
      "content": "I can´t believe this...\n\n*\"I just want our wedding photos to be as esthetically pleasing as possible\"*\n\nYTA",
      "id": 74,
      "comments": [
        {
          "score": 4643,
          "content": "It really is unbelievable! This poor guy avoided getting braces because he was afraid of being bullied, and here he is, being bullied by his own fiancée because *aesthetics* \n\nYTA, OP, your fiancé deserves better",
          "id": 75,
          "comments": [
            {
              "score": 462,
              "content": "This was my first thought when reading it. YTA OP.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 219,
              "content": "I thought that was funny! She’s shallow and can’t spell! Sounds like the fiancé might be winning if she postponed the wedding.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "My thoughts exactly. OP was as sensitive as a ton of bricks.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "THIS EXACTLY it’s so fucking sad! like that the fuck man ?????",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Thank you! The spelling error is making my eye twitch.",
              "id": 80,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 410,
          "content": "YTA OP. I blame this on social media. Everybody is obsessed with appearances because of “the photo.” It’s toxic and OP needs to grow up. A wedding is about celebrating the beginning of your married life with the partner that you love. It’s not about the f-ing photo for your Instagram.",
          "id": 81,
          "comments": [
            {
              "score": 176,
              "content": "That was happening well before social media lol",
              "id": 82,
              "comments": [
                {
                  "score": 155,
                  "content": "This is true. 30yrs ago a family member wanted a 5yr old physically forced into have her long hair cut off so her hair wasnt longer than the brides.\n\nBride suggested 'compromises' like cutting 2 inches off at night twice a week so the kid 'wouldnt notice' - as if a kid isnt going to notice her hair is 8inches shorter than it was 2 weeks ago, and think something is wrong with either her body or her mind\n\nEdited to add: After a lot of fighting, they ended up with a french plait/braid with the end tucked under, so the length didnt show.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 56,
                      "content": "[deleted]",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "I need an end to this story, which is also disgusting. I just need to know about that poor child. \n\nHow can a grown adult be so jealous of a child that they think their life and wants are more important",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "It's about frequency though. \n\n\n\nWe have always had shallow people but we have not always had this many people of moderate-to-poor income acting like they need a $30,000 wedding with flawless pictures.\n\n\n\nThis is a dude with fucked up teeth and visible braces. This is not a couple with a decent amount of cash and messing up their relationship for the \"esthetics\" is nuts. This chick's got no money and can't spell! They should be having a potluck in mom and dad's backyard with cousin Gary as photographer.\n\n\n\n\nThis is no different than the growth in luxury goods being driven by people who live with their parents. Poor folks are getting fooled into wasting their time, money and energy into maintaining a facade that no one else is going to believe anyways. \n\n\n\nOP shouldn't squander her money or her relationship on this fake shit. Her friends, family and future husband are what count and none of them are going to be fooled by good pics that they're going to \"like\" on social media and immediately forget about.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Who wouldn't just suggest styling the kids hair up for the pictures in the first place?",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 86,
              "content": "The crazy part to me is that I've been to many homes over the decades and very few of them had wedding photos up. The handful that did it was just one more photo around. It's not like we come in and admire your photos like we're at the Louvre.\n\nFamily photos should capture the memories as they were, not some spackled over fake universe that never existed.",
              "id": 88,
              "comments": [
                {
                  "score": 6,
                  "content": "I love our wedding photos, they make me very happy. There's currently not a single one up in my home -- I have a favorite in a frame somewhere, but it hasn't been hung up since we moved last summer.",
                  "id": 89,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Yeah most wedding photos are just a smaller picture on the desk or the mantle. You have it to remember the day, not to show off to people",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I blame the wedding industry and wedding mentality. It makes people go crazy.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "To quote John Oliver, “if you couldn’t instagram your wedding, would you still be getting married?”",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Well said. But even just the idea that braces will ruin a photo is ridiculous.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Braces were actually a trend a few years ago. Whats pretty and what not just shifts hella fast",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "YES the photos have become a beast of their own, fed by elements of the wedding photog industry and of course social media.   \n\nWe used to hold the wedding you wanted, and photograph the day as a momento. Then the role and importance of the photos kept inflating, until the entire wedding (for some) is an event in service of creating perfect wedding photos! Like, photos should capture the experience, the experience shouldn't be dictated by the photos. Obvs there are posed photos and considerations of what would look good, but IMO, the way people talk, it's turned into a monster.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 172,
          "content": "It’s like something a rote rom-com villain bridezilla would say to establish shallowness.",
          "id": 97,
          "comments": [
            {
              "score": 76,
              "content": "You nailed it! And then the (ex)groom finds his true love and after a miscommunication that almost derails that relationship, they find true love that they seal with a kiss. The true love is either the dog walker, wedding planner, or maybe a caterer?",
              "id": 98,
              "comments": [
                {
                  "score": 81,
                  "content": "The true love in this rom-com is clearly the orthodontist!",
                  "id": 99,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Brilliant",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "At no point in the film's 80-minute runtime does anyone examine whether this is appropriate behavior between the orthodontist and a patient.",
                      "id": 101,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": ">they find true love that they seal with a kiss.\n\nAnd their braces get caught together.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Which they laugh about because they are cool humans. And the photographer captures this moment.\n\nThey decide that this is the best photo to remember the day forever. They put it over the mantle that they could afford because the husband was responsible with his money.\n\nThey live happily ever after.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "The florist he meets when he goes to visit his mom in his small hometown (who he hasn't visited in years) to cool off from this fight?",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "The dental hygienist is the true love",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I hope it’s her free-spirited bohemian cousin Serafina whom OP has always scorned because *she’s so ridiculous.*",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "I mean, does the marriage even matter if you can't have pretty photos? That's the whole point of having a wedding - the pictures. /s",
          "id": 107,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 76,
          "content": "It always amuses me when people are like, \"My wedding pictures MUST be PERFECT,\" because though you get 1,000 pictures of that day, most people only end up displaying a handful, and the rest are in an album that you pull out every so often. I got married 15 years ago, and I have only one of our wedding pictures displayed - it's the group photo with all of my and my husband's family. (I actually liked the vibes of our engagement photos better than my wedding photos - I've got two photos from our engagement session displayed.)   \n\n\nPlus, there's this thing called Photoshop, where a skilled photographer can erase the braces off your fiance's teeth if it's really that important to you. YTA.",
          "id": 108,
          "comments": [
            {
              "score": 14,
              "content": "the only thing photoshop can't fix is if you are truly happy or not in the pictures. Someone so worried about how other people will look at their pictures and judge them on \"aesthetic perfection\" doesn't sound like someone who will be truly happy.",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "\\#1 rule in photography is for every 100 photos there is only 10 okay ones and 1 really good one. So take as many photos as possible.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "The number of people on this sub who prioritize weddings and wedding photos over actual people and relationships is kind of insane.",
          "id": 111,
          "comments": [
            {
              "score": 8,
              "content": "Why I refuse to have a wedding and spend $1,000s to not even be happy. I’m eloping and going to Europe or Hawaii. I’m spending my money on me and investing it in an experience for our relationship instead of a giant party",
              "id": 112,
              "comments": [
                {
                  "score": 6,
                  "content": "I’m with you. If I ever get married, it’ll be at the courthouse. I hate being the center of attention for shmaltzy things though, ha ha. I probably wouldn’t even announce it on social media—people will know when they know. Lmao.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yassss. Normalize keeping things simple and not telling every person you met once lol",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "This was the same excuse a \"friend\" gave me when she kicked me out of her wedding party because of my pregnant belly. We no longer speak. Good people don't value vanity and pretty pictures over their relationships",
          "id": 115,
          "comments": [
            {
              "score": 5,
              "content": "I would have had my preggo friends in my ceremony. And had she gone into labor, we would have talked faster, signed a paper, and zipped her to the hospital (her labors are long enough that we could use those 15 or so minutes lol) and then held a half ass reception in rhe waiting room with paper cups of coffee and cheers when the baby got born",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "That’s so gross. I’m so sorry. Probably wouldn’t have been a good friend once you had the baby either. A lot of my friends never talked to me, tried to see my kid, anything bc they only liked being able to party and go out, etc. They didn’t care about me as a person. Her loss",
              "id": 117,
              "comments": [
                {
                  "score": 3,
                  "content": "Thank you. It was a long time ago, but still stung. She was so nice and kind until she wasn't. Great learning lesson that if nobody else in your life likes a certain friend/partner and they only tolerate them for your sake, then take that as a sign, haha",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Honestly though, couldn't the photographer photoshop the braces out of the pictures too?",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I am so fucking sick of people placing \"aesthetics\" over the feelings of their loved ones. YTA, OP. If aesthetics are more important than your fiance, marry a fucking tooth model and let this man find a woman who loves him for all that he is.",
          "id": 120,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "She’s immature *and* can’t spell aesthetically. If she wants to have an adult marriage OP needs to learn a few lessons.",
          "id": 121,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6993,
      "content": "> “he accused me of being ashamed of him, which isn’t true”\n\nIt is though. YTA",
      "id": 122,
      "comments": [
        {
          "score": 1514,
          "content": "OP is exactly why he was afraid to get braces as a kid. Poor fiance",
          "id": 123,
          "comments": [
            {
              "score": 197,
              "content": "[removed]",
              "id": 124,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "Also he could have gotten invisible ones if he was not saving for the wedding & honeymoon.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 222,
          "content": "I mean, based on what's written that's a pretty fair take. I'm trying to give OP the benefit of the doubt here in thinking that she doesn't want her hubby to look at the photos and see the braces and be reminded of all the torment but it sounds like hubs has finally moved on from the ordeal and in no way does OP really sound like she's doing it for his wellbeing rather than pretty photos.\n\n&#x200B;\n\nOP, reread your post objectively from an outside perspective. If hubs is OK with them in the photos, you should be too.",
          "id": 126,
          "comments": [
            {
              "score": 170,
              "content": "Except OP says that she wants photos that are aesthetically pleasing. She wanted him to get invisible braces. So it doesn't sound like she was doing it for him; she was asking for herself. She never makes mention of being worried about his reaction to the photos, so I don't see that being the reason.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 160,
              "content": "I feel like a lot of people are already viewing her as an evil shallow bridezilla. But as a person who had adult braces, I feel like it's a reasonable ask.\n\nI had adult braces and they completely change your smile in photos. Especially in photos that are far away, they make you look like your mouth is all dark or like you have no teeth. I personally don't find that aesthetically pleasing And I'm glad no major life events happened for the year and a half I had braces on.",
              "id": 128,
              "comments": [
                {
                  "score": 119,
                  "content": "Agreed, my braces totally changed the shape of my mouth/face too. I look super weird in all pictures from that time. \n\nIf it were me I would want to wait, but I think it depends on how long they would have to wait, have they booked anything yet, is there any benefit to getting married earlier rather than later, etc. Like there isn't much difference between being engaged vs being married, so what's the big deal with waiting a couple months or a year?\n\nIf it were interrupting some other life plans, like they wanted to start having kids soon but not while unmarried, then yeah it's not worth it to wait. Like many things in life, it depends.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 5,
                      "content": "According to OP, the wedding is supposed to be this year and the venue is booked.",
                      "id": 130,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 109,
                  "content": "Agreed. People pay thousands for these photos and they’re of what’s one of the most important days of your life. It’s not like these are permanent fixtures in his mouth, a deformity, or something else that would otherwise be permanent, nor is it easily hidden. I don’t think she’s being a bridezilla for wanting to look back at pictures of her wedding and not see her fiancé’s braces. The monetary investment alone is enough to want everything to be just right.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 80,
                      "content": "Yup, braces are temporary! People here are being incredibly dramatic and comparing braces to facial disfigurement. Which in my humble opinion, are not similar in the slightest.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 79,
                  "content": "I got braces at 15 and I was so relieved I was able to get them off before I had to take senior pics for graduation.  I didn’t care the rest of the time but for some events it’s okay to care about how the pictures will turn out.",
                  "id": 133,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I had braces while a senior in high school and my mom had them taken off so that I could get senior pictures. It might have been a few days or a week total that I had them off and I don't remember their replacement being a big deal. I hate to recommend this as an option in this case.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I get that, but I think it’s a little different to say “I want to look a certain way” vs. “I want YOU to look a certain  way.”\n\nI think it would be fair to, with his permission, pick a favorite photo or two and have the photographer remove the braces with photoshop. But to say, let’s not get married until your braces are gone is different.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Agreed. It's a relatively minor request but I'm not sure it's enough to postpone a wedding after they've already planned it all out. Every comment calling OP a bridezilla is insane though, people on this site love to blow things out of proportion.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Yes, this. I'm going NAH. Weddings are very expensive and many of the rituals are shallow. Most couples do try to look their best. But the groom has every right to be upset about postponing. His braces don't define him, and in that sense they're both right.",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This! I'm just thinking that he is so caught up in his insecurity about having bracing he isn't thinking about how he will feel AFTER they are gone. Forces this wedding and then turns to her one day and goes maybe we should've waited until I didn't have them. She is willing to POSTPONE the wedding and go the extra mile so that he can look and feel his best on their wedding day. Also I have a feeling that he may look SUPER young with them on. Imagine looking at your unedited wedding photos and feeling like you married a teenager.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "ABSOLUTLEY the best take in the thread and I don't get why people are tearing OP apart. \n\nAs someone who got braces after they got engaged like OP's fiance - It's SO WEIRD that he decided to get braces months before his wedding. New braces, especially where you have missing teeth, suck ALL the joy out of life. The joy leaks out of the wire slices on the insides of your puffy swollen cheeks. He also already flagged he's self conscious so why would he choose to add non-urgent braces to his day when theres so much focus on the couples mouths (smiling, calls to kiss the bride etc)? I am DESPERATE to know his thought process! I am very, very invested in this AITA, this is so nuanced and personal to me.  \n\n\nAlso - why didn't they seemingly didn't talk about it beforehand of his steps in taking a reasonably big and pricey general life decision? Before I got my braces my fiance took me out for a 'last meal' of all the things that get banned (mostly corn on the cob and chicken wings!) - we planned it as soon as I found out my brace-face-date. Do they not talk about their day? Their plans for the week?",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Reminded of what torment? He didn't get them as a kid and his only bully now is her...",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Also OP is doing exactly what he was afraid of as child (treating him differently for having braces)",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4076,
      "content": "YTA because you are prioritizing your wedding photos over everything else.  Over your fiancee's feelings, over your marriage, over the wedding itself. If the photos are the most important thing to you, I hope your fiancee reconsiders what he's getting into.",
      "id": 142,
      "comments": [
        {
          "score": 1333,
          "content": "It’s simple, she’s still emotionally immature and wants a wedding, not a marriage. Aesthetics are important because it’s about the show. If it was about just being with this guy forever, she’d realize his mental health and self esteem are worth more than her desire to have the perfect wedding pictures. \n\nOP is an asshole and her boyfriend’s new bully.",
          "id": 143,
          "comments": [
            {
              "score": 173,
              "content": "This right here. My wedding was in simple sun dresses with ten people and a family dinner and cake from a grocery store because we were at the height of the pandemic and didn’t want to wait any more to be married. Being married was way more important than photos or pretty cakes, or anything else. \n\nOP being this concerned about the show of a wedding, even at the cost of the feelings of one of the people entering into that marriage tells me they aren’t ready to get married yet. Op, it isn’t about the wedding photos. It’s about spending your life with someone you love. You have to either decide between aesthetics and love and this frankly shouldn’t be a hard choice.",
              "id": 144,
              "comments": [
                {
                  "score": 62,
                  "content": "Had a simple wedding because I was (still am) poor. \n\nBeen married for 18 years and counting.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 9,
                      "content": "My parents went to one of those tiny Vegas churches that are seen as a joke. They've been married 40 years",
                      "id": 146,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "$1000 for us (Canadian, so like three dollars USD). Married almost 32 years.",
                      "id": 147,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "My wedding was similar, maybe 15 people total in attendance including hubby and I, I got a $500 wedding dress, got married on a public beach, and afterwards we all went to dinner. Hubs and I are still going strong.  \n\n\nGlad you were able to have your wedding mid pandemic!",
                  "id": 148,
                  "comments": [
                    {
                      "score": 8,
                      "content": "My wedding was at our local courthouse, with our son as the ring bear. I had been planning a big wedding but family from both sides were being horrible assholes to each other. So I was done and called it off and we privately eloped. It was amazing. The look of horror from both families after we told them we eloped was priceless. Now 15 years later, family a gets along from both sides and we are extremely happy.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "Excellent point. She \"wants a wedding, not a marriage.\" Very well said!",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Totally agree here. It is about the wedding not about joining their lives together. \n\nIf he doesn't have an issue then what is the big deal \n\nAlso I don't get the need to have \"perfect\" wedding photos. We looked at ours once when we got them and then never again. It's been over a decade now. Of course our wedding was about starting our lives together. \n\nYTA. Get over it or he'll get over you.",
              "id": 151,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "I had a co-worker that was in one of those wedding stories shows.  She brought her wedding album to work all the time (got married before we became co-workers) and was always taking / bragging about HER wedding.  \n\nThey were divorced within 2 years.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "> she wants a wedding, not a marriage\n\nPerfection.  I've never heard this summed up so succinctly or correctly.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yes she wants the wedding…which is what this is? Idk can’t you get married legally, elope or whatever, and then wait for the wedding until the braces are off (INFO: how long is that?). I don’t see a problem with this if they still get married, but wait for the celebration/party with family. The point (for a lot of people) is to dress up nice, you’re paying for the portraits, etc why not look as nice as you can? People postpone weddings to lose weight first, to get their skin clear, all sorts of superficial reasons. I assume by reading this the date hasn’t been set yet and this is what the discussion was around. \n\nThe main problem I see here is the fiancé is not down for it. Maybe you should have approached it differently, more like a conversation that what it sounds like it was demanded or expected a little bit. Not sure. Anyway, I don’t think the OP needs to be demonized for wanting them to look the best they can for the wedding party. Somethings might be unreasonable but just waiting for braces to come off that would end up being off in another, say, half year anyway? What does it matter to wait for the party. \n\nGet married now, elope, do a mini moon. Have the wedding party later. Easy.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 50,
          "content": "If all you want is pretty pictures, hire a photographer to do a photo shoot. If you want to be married to someone, their teeth should not matter to you. You need to grow up a bit before marriage.",
          "id": 155,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "If she sends me her picture, I'll download some wedding photos from some wedding magazines and photoshop her head onto them. Problem solved.",
          "id": 156,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2633,
      "content": "YTA\n\nEven for kids and ESPECIALLY for adults braces HURT. \n\nSo you encouraged him to get them but then you're ashamed to be seen with him while wearing them.\n  \n\nYou are LITERALLY the epitome of why he didn't get them in high school.",
      "id": 157,
      "comments": [
        {
          "score": 364,
          "content": "This is spot on. OP would have turned him down for Prom. I hope her fiance walks.",
          "id": 158,
          "comments": [
            {
              "score": 99,
              "content": ":( I didn’t think about this and I feel sad for him now. He deserves to be loved, braces and all. Can’t believe she is willing to put their life on hold over some photos that can be edited!\n\nAnd YTA op",
              "id": 159,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "He will! And she's gonna be mad AF bc he'll look amazing once they come off since his confidence will surely increase. I can't wait for them \"I want to win him back\" posts🤣🤣",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "Not only do they hurt, they take several years to work.  OP isn't putting things off a few months.  She basically called off the wedding and maybe it will happen in the future sometime.",
          "id": 161,
          "comments": [
            {
              "score": 28,
              "content": "Yeah, that’s what stood out to me the most. I feel kind you need to wear braces for AT LEAST a year or two for significant results. He won’t be able to get them taken off in just like a few months and have the wedding then. It’s basically her saying have the wedding in 2023 with braces or push it to 2025 or 2026 to have it without braces, and I can understand why the fiancé wouldn’t want to wait that long. Especially if they’ve already been together for a while and want kids or whatever, it doesn’t make sense logistically.",
              "id": 162,
              "comments": [
                {
                  "score": 3,
                  "content": "But - why then didn't he just wait 2-4 more months to get them put on? That would make WAY more sense especially because they weren't urgent. He's already flagged he's self conscious so why would he choose to add non-urgent braces to his day when theres so much focus on the couples mouths (smiling, calls to kiss the bride etc)? PLUS they hurt like heck all the time, cut up your cheeks, and limit what you can eat and drink which I would hate on my wedding day.   \nI am DESPERATE to know his thought process!",
                  "id": 163,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Well op said she convinced the fiancé to get braces lol so yeah I don’t understand the thought process from op and the fiancé when they could have just waited until after the wedding. I feel like op must not know much about braces, or maybe she didn’t know much before the fiancé got them. I have no idea.",
                      "id": 164,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yes and no one warns you of how much it hurts! I had days I couldn’t play the flute because the pain of it against my mouth was too much",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2115,
      "content": "So he didn’t get braces when he was younger because he was afraid of what people would say. And now you, his fiancée, are confirming his fears. Wow. YTA.",
      "id": 166,
      "comments": [
        {
          "score": 234,
          "content": "Exactly. He didn't get braces for fear of bullying, and now she's his bully.\n\nYTA",
          "id": 167,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 39,
          "content": "My first thought also.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1131,
      "content": "YTA - that is a mighty shallow view point.",
      "id": 169,
      "comments": [
        {
          "score": 58,
          "content": "Yeah. My reaction too. That and, \"Boy, this guy is marrying a real winner, isn't he?\"",
          "id": 170,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 45,
          "content": "Prime example of someone getting married because of the *idea* of it and not to solidify a relationship",
          "id": 171,
          "comments": [
            {
              "score": 3,
              "content": "This post, and this comment are exactly why I promised myself to never get married. Modern weddings are for narcissistic brides who have no problem spending 5 or 6 figures of other peoples money for a 1 day party, who rub their family and \"friends\" faces in the fact the day revolves around them. \n\nIf you really wanted to commit to someone, take that money, go 50/50 on a small house, get a spiritual wedding outside of the law, sign a prenup, and then let's see how committed the brides REALLY are to the men they claim to love and \"spend their life with\"",
              "id": 172,
              "comments": [
                {
                  "score": 4,
                  "content": "People get married for a ton of reasons. I just happened to marry my spouse because I couldn't imagine myself ever being with someone else so why not get the tax and social benefits that come with the marriage tag. Marriage is NOT for everyone though and far too many people get married for purely religious or self-righteous reasons. OP has probably dreamed of her perfect wedding day all her life and has looked past the implications of who she is *actually marrying*. \n\nAlso weddings are mad expensive, we spent 5k on ours mostly out of our own pocket because we like to party. Booze isn't cheap for 100 people",
                  "id": 173,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "When you prioritize the wedding pictures over the actual groom, it’s a massive red flag 🚩. You know OP would be that bride that dictates what the wedding guests can and can’t wear and the whole bridal party will need to be within a certain height/weight category to qualify to stand beside her in pictures.",
          "id": 174,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 770,
      "content": "Honestly, if he's happy to go ahead, YTA. \n\nYour wedding isn't supposed to be a photoshoot, the photos are just supposed to be a reminder of the day, you know? And he DOES have braces right now, and you love him and want to marry him right now - so is it really reasonable to put your lives on hold until you prefer how he looks? \n\nWhen you're old and looking back at the pictures, I'm sure a couple of extra years worth of your marriage will seem WAY more valuable than the photos being aesthetically pleasing. \n\nWhy not get a photoshoot done once he gets them off so you have some braces-free photos as well?",
      "id": 175,
      "comments": [
        {
          "score": 527,
          "content": "Could you imagine if dude was like \"I'm postponing the wedding until you lose 25lbs so the pictures look good\"? Holy fuck.",
          "id": 176,
          "comments": [
            {
              "score": 152,
              "content": "Not just that, but that after the bride already has issues about her weight",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Exactly! This is what it comes out to be and it is so shallow. Im appalled how can she think she is in the right here?",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I was waiting for this comment. That’s the same as the groom telling the bride how to do her hair/makeup/dress at a wedding. It’s weird behavior. Imagine postponing vowing eternal love for ✨ aesthetics ✨",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "Would also be great to have photos like that if their kid ever needs them, could tell them the story about how dad was scared, but that mom convinced him to get them and how no one really cared that he had them and everyone enjoyed the wedding.\n\nPragmatism should be taught in schools. Heck that's an entire children's story book about braces.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 621,
      "content": "INFO:  When is the wedding planned for and how much longer does he need to wear braces?\n\nAlso have you already setup the wedding date, venue, put down any money etc?",
      "id": 181,
      "comments": [
        {
          "score": 252,
          "content": "Asking these questions is correct, and OP your answers make YTA. \n\nI could understand it if your fiancé agreed, and you didn’t have a date yet and you suggested ‘instead of summer 2024 why don’t we make it autum 2024/a few months later/when your braces are off so you feel more confident?’\n\nBut completely cancelling a booked date for THIS YEAR? That’s been booked since last year? When your fiancé has no problem with how he looks?  YTA.\n\nOP - have you sent save the dates or invites, given it’s only a few months away? Have you told people why it’s being cancelled/postponed?",
          "id": 182,
          "comments": [
            {
              "score": 6,
              "content": "On the flip side - why did the fiance not just wait a few more months to get the braces installed? I don't understand at all his thought process to do it just before his wedding because braces are painful and uncomfortable and fresh ones would make for a miserable time at a wedding for the groom.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 410,
      "content": "Guy: I don't want braces, I'm afraid people will ridicule me!\nDentist: your teeth will go bad\nGuy: OK, I'll get braces\nWoman : Urgh, I won't marry you as long as you're looking like that!\nLady, you are prioritising pretty pictures over getting married. YTA.",
      "id": 184,
      "comments": [
        {
          "score": 13,
          "content": "Am I the only one that thinks braces on adults is just so nerdy cute and adorable? \n\nMy sibling was like OPs fiance and waited til late in life to get them and got the full train track set we had as kids, and oh my god she looked so freaking cute that year. Some of our favourite pics were of all of us all dressed up and her grinning away with her lil metal mouth in her late 20s. \n\nYTA, OP. You could have just embraced the charm and realness of your wedding photos instead of aiming for \"esthetically pleasing\". Beauty is in the eye of the beholder and I bet your fiance looks sweet, which you missed.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}