{
  "post content": "Hello there, I’m currently typing this from my car, after my wife has told me she doesn’t want me near her right now. Hoping this thread will be a wake up call to her.\n\nMy wife (F33) is a big nerd, which I normally appreciate, but she is taking things way too far today. She took today off of work, so she could be up at 4AM to play her online game at launch. I didn’t wake up until about an hour ago (10:30, and she was still playing. I mentioned that I was\nHungry, hoping we could make breakfast together , which we like to do together. She instead said that I should “order us something from doordash, im in the middle of a dungeon and may be a while.” I didn’t really wanna get takeout, because we had already discussed ordering pizza tonight for dinner, and that’s a lot of take out food in one day. I calmly explained this, and she got pissed and shrieked at me that she just wanted one weekend to focus on her video game. I said that it was unfair to our family for her to isolate all weekend, and she got even more mad, telling me that I have two hands and can feed the goddamn cat. I was in tears at this point, and I did raise my voice and said that I was worried she’s obsessed with this game and maybe she needs professional help. She threw her car keys at me and said that I need to get out of her face, that she’s works all the time and doesn’t ask for much, and I need to leave her be and get out of her face for a few hours.\n\nI am truly concerned that she has become obsessed with this online game, and I’m hoping that maybe reading this thread will wake her up to it, but I might’ve been the AH too.\n\nEdit: some additional info I forgot: ir isn’t just today, for the last few weeks she’s been hyping herself up for this. When the game got delayed, she MOVED HER VACATION time rather than just keep her previous day off and spend it with me. She’s been absolutely freaking out about this game and I don’t understand it and it scares me.",
  "id": 1,
  "comments": [
    {
      "score": 52882,
      "content": "Dude, she isn’t obsessed with a game. A lot of people wake up early/stay up late for the launches of games, it’s not unusual. It sounds like you’re just mad that she’s not cooking for you and that you have to feed yourself and the cat. When you mention you like to make breakfast together, how much do you do in that?  I also call bullshit on the “calmly explained and she freaked out and went hysterical” portion of this. Chances are, you whined about it and she got annoyed. And do you have kids? Because if you don’t, and it’s just you two and the cat, then how is playing a game for a few hours “unfair”? If she works all the time, and this is her way to unwind, let her. She’s not hurting anyone and you are a grown adult capable of taking care and entertaining yourself. I also see that she said the dungeon might take a few hours, not 2-3 days. You didn’t want this thread to “wake her up”, you just wanted validation from strangers online about your whining. Tl:dr, YTA",
      "id": 2,
      "comments": [
        {
          "score": 11704,
          "content": "This!!! Couldn’t have said it better myself. OP sounds like the hysterical one.",
          "id": 3,
          "comments": [
            {
              "score": 8013,
              "content": "Right? I'd expect this kind of behaviour from a toddler.\n\nYou're wife is allowed her own time and interests.\n\nShe doesn't have to spend all of her vacation just with you. She doesn't have to immediately stop what she's doing because you're hungry. This is one day, you're not being neglected, but you are ruining something she has been looking forward to for likely months because it's getting more attention than you for the day.\n\nSeriously, the way she's acted indicates this isn't just  about the game. Sounds like she'd thoroughly pissed off she's having to look after you and can't have her own space.\n\nEdit: dear gawd the typos",
              "id": 4,
              "comments": [
                {
                  "score": 3976,
                  "content": "I like to play Sims 4 on my weekends off. My SO finds his own shit to do when I play my game. I can’t imagine having to deal with mantrums (man tantrums) when I’m literally just trying to unwind and enjoy me time. Ugh I feel bad for his wife.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2023,
                      "content": "YTA, OP. I play Sims, too, and easily stayed up all night playing right before a college exam. Does that mean I need 'professional help' too?\n\nI seriously think the bigger problem is, you DON'T understand her interests and have no desire to do so. That would make me upset, too. Especially when accompanied by someone who expects his SO to have their attention on them 24/7 when they're not at work.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 542,
                      "content": "Yeah! I finished nights yesterday morning and then had to take the cat for a suprise hospital visit (nothing bad, she'd pulled her feeding tube out a bit). Cancelled my plans with my bf and handed instead as I was exhausted. And he was a decent and understanding person. I feel so bad for this guys wife!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 358,
                      "content": "Sims can easily take up a whole weekend and all",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 115,
                      "content": "Lara Croft is like meditation for me. If I can get my sh*t together I'm getting a lappy and Lara Croft because I miss it.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I hear ya! Sunday afternoons at my home, for about about four hours, it is understood that ALL inquires go to Dad, my headphones are on and I play house with farmer sim whose stocking up on her canning right now.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I play sims3 90% of the time, and my husband downloaded my sims4 onto his laptop and plays next to me because he likes seeing what I like about the Sims. He wants to do something with me and it doesn't involve making me stop my game so we can do something he wants to do.  \n\nI agree, poor woman just wants to dungeon crawl.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2102,
                  "content": "well op was in tears at one point over *checks notes* cooking their own breakfast. are we sure they're not a toddler?",
                  "id": 12,
                  "comments": [
                    {
                      "score": 1031,
                      "content": "*And* feeding the cat…",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "I KNOW! I was like, jeez, did they literally cry because their spouse didn't want to help make breakfast? \n\nI'm kinda glad they don't have kids at this point.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I wonder if his wife is allowed to go to the bathroom with the door closed?   Maybe he has to sit at her feet with some picture books while she pees.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "This sounds like so much OP trying to force his wife to choose between her hobby and him, on his terms and when he wants. I’m getting big “I tried to distract her and it didn’t work so now I’m mad” energy.\n\nFlip genders and it’s, “honey why do you have to go to poker night this month? WhY dOnT yOu EvEr WaNt To SpEnD tImE wItH mE???”",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1930,
                  "content": "I cannot - I CANNOT - with grown ass, able-bodied people (let's face it, it's usually men) who think they can just tell their partner they're hungry, and their partner will just drop what they're doing to fix them a snack or a meal.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 892,
                      "content": "But...don't vaginas have magical sandwich making skills or something? If not, I'm questioning everything, including my own sandwich making abilities...I...I'm NOT the only one capable??? What does the world even mean now?????  \n\n\n(The preceding paragraph was entirely sarcastic and not meant to be taken seriously by anyone, ever.)",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 62,
                      "content": "OMG this is what I thought.\n\nIf my husband is hungry and I'm in the middle of something (whether its watching t.v. or painting the living room) he goes to the kitchen and gets something to eat.  Like any sane, rational adult does.  He even asks me IF I WOULD ALSO LIKE SOMETHING.\n\nIf I was in the middle of something and my husband was standing in the room saying, \"I'm hungry.\" I would say, \"Well, go get yourself something to eat.  Your legs aren't broken.\"\n\nThis guy KNEW she was in the middle of something and thought it was unfair that she didn't snap to attention when he said, \"I'm hungry.\"?  Is he five years old?????\n\nIf they \"make breakfast/brunch together\" then maybe he could just go do it himself and offer her some as well?\n\nNote:  I am not a gamer.  But I like different t.v. shows than my husband does.  So sometimes I get up early on the weekends to watch them while he is still sleeping.  Or stay up really late on weekends to watch them.\n\nHim saying, \"I said to her 'i'm hungry.'\" like really boiled my blood.\n\nAnd then the dude started CRYING when he explained to her he didn't want to order out because they discussed ordering pizza for dinner that night and THAT didn't get her off her game to cook for him????",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": ">My wife (F33) is a big nerd, which I normally appreciate\n\nExcept when she doesn't do your bidding.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "I mean, my vagina does make a pretty mean sub.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1095,
                  "content": "\n“Your wife is allowed her own time and interests.”\n\nThis.\n\nOP is TA",
                  "id": 22,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Ugh.  The \"I'm so worried about her\" is such bullshit.  She wants him to get out of her face and he's acting like she's broken.  He sounds so clingy and obnoxious.  It was super clear his major concern was getting his breakfast made for him and having her full attention.  My shoulders are going up around my head in sympathy. I need alone time just from reading this.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 917,
                  "content": "\"I was in tears\" jfc OP needs to get a grip",
                  "id": 24,
                  "comments": [
                    {
                      "score": 1013,
                      "content": "Who thinks the \"I wanted to make breakfast together\" was really \"I wanted her to make me breakfast while I stood by\"?",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 316,
                      "content": "Seriously, beyond pathetic. YTA, OP. They're roasting you in the guild chat rn, and you deserve it.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 64,
                      "content": "I can't imagine being in tears because someone was consumed by a video game for less than a day. I've literally spent longer playing Pokemon.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 51,
                      "content": "Feeding a cat can be tricky.  They are after all Satan's handmaidens on earth.  The cat might stare at him, scowl or meow!  The terror!!!  If he thinks his wife was mean just wait until he has to deal with the angry cat.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 717,
                  "content": ">Right? I'd expect this kind of behavior from a toddler.\n\nThis is EXACTLY what I thought. I have a toddler and a 5 year old. OP is acting like the toddler, the 5 year old can make themselves milk and cereal if needed.\n\nWhy was he in tears beacuse he had to make breakfast himself like an adult (or elementary school student?). Seriously, what is wrong with OP? Is he super dupper needy? Shockingly helpless? Can't not be the center of attention for a couple hours? I honestly don't understand. He literally acts like my child who is about to turn two. It's concerning.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 63,
                      "content": "She even yeeted the phone and told him to door dash something... which he didn't want to do because \"That's a lot of takeout and WE'RE GETTING PIZZA LATER\" I've never met any sane adult who whines over being told \"Yeah we got the budget for takeout\" and refuses to get it. Even my dad, who was stingy if we had it in the budget, we were getting take out.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 535,
                  "content": "Yeah OP knew the wife would be busy on this particular day so I really don’t see why he thought they would have breakfast together.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 630,
                      "content": "[deleted]",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 52,
                      "content": "Because he doesn't respect her hobby.  He looks down on her for gaming and doesn't see it as an important stress relieve.   He can't even name the game here in his post because he probably doesn't know the name.  I'm really curious too because I don't know of any big games that came out today.",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 52,
                      "content": "The thing is they could still have had breakfast. he could just have used his grown as adult abilities to make it and sit next to her and eat with her while she plays",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 436,
                  "content": "> you are ruining something she has been looking forward to for likely months because it's getting more attention than you for the day\n\nNot just the day... it was 10:30am, and OP had just woken up.\n\nHe'd been without her attention for all of what, 20 minutes before he whined?\n\nYTA OP",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 56,
                  "content": "\n>Seriously, the way she's acted indicates this isn't just  about the game. Sounds like she'd thoroughly pissed off she's having to look after you and can't have her own space.\n\nHe's probably been whining about how excited she is and she's over his shit.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": ">She doesn’t have to spend all of her vacation just with you. \n\nI’m currently on a two weeks vacation alone while my husband is at home. Weirdly, said husband isn’t throwing a hissy fit, even if he has to feed himself* and the two cats, because he’s a grown-ass adult. The only things he’s said about my vacation are “enjoy”, “have fun”, “relax” and “you deserve it”. \n\n*To be fair, he’s the one who does most of the day-to-day cooking, so it’s not surprising that he’s capable of feeding himself without me. Damn, now I’m really starting to miss his food 😂",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1918,
              "content": "EXACTLY.\n\nOP has been watching their wife get psyched up for this for weeks in preparation. they know how important this is to her.\n\nIn knowing this, OP's behaviour is super selfish and dismissive.\n\nIn addition; pathologizing wifey for being passionate about a hobby that OP doesn't appreciate... I dunno there is something a bit manipulate and gaslight-ey about OP's stance here, calling your wife \"obsessive\" etc.",
              "id": 38,
              "comments": [
                {
                  "score": 1490,
                  "content": "And the guy is incredulous that she MOVED her vacation day when the game launch was delayed. Ummm...if I booked time off to attend a concert out of town and they changed the date of the concert, I would likewise change the date of my day off because that makes perfect sense?",
                  "id": 39,
                  "comments": [
                    {
                      "score": 502,
                      "content": "Lol what logic!\n\n“I’m supposed to have surgery, but my doctor had to reschedule it. I guess I just don’t get my spine fixed now, because moving vacation days around isn’t a thing”. \n\nOP either doesn’t have a job or has a really crappy one, because it’s not a big deal to change days off in a decent company.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "They release Dragon Quest games on weekends because people were skipping so much work and school it was messing stuff up XD",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 824,
                  "content": "I'm betting this is the new expansion to Final Fantasy 14 too, since it was delayed nearly a month and queuing times for dungeons are *apparently* awful.\n\nI don't play, I have friends that do and I've seen memes.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 694,
                      "content": "It is absolutely ffxiv. It was delayed two weeks. I also moved my vacation (although sadly not today). I got up at 1 am to make sure it was downloaded and played until I had to go to work, and am totally planning on playing as much as I can for the next few days, lol. OP is totally TA, like he's never taken time for himself to do something he was hyped for. I bet he interrupts a lot of her play time.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 308,
                      "content": "Oh thats today? I know what my wife will be doing tonight lol.",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 25,
                      "content": "Yep, I knew as soon as he said she’d been up since 4am because my bf has been up since then too lol\n\nBut we conveniently are both self-sufficient adults so not only have I managed to feed myself and the cats, I even cleaned the litter boxes, worked a few hours, and put my own show on. \n\nHe’s having an amazing time and I’m super happy he’s happy. Like OP, I knew he’d be enthralled all weekend and we deliberately planned to do our own things. Like self-sufficient adults.\n\nOP, YTA.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "100% it's FF14. And this is a huge expansion update with new jobs to play, multiple new places to explore, dungeons to run, etc., not just a minor story update with a couple new dungeons and some quests.\n\nAnd yes, depending on what role you play, queue times for dungeons can be 30+ minute wait times. It's better with early access/new dungeons, but then the dungeons themselves take longer because figuring out mechanics, etc. etc. Easily an hour or two time investment.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "My youngest has been waiting for this. Unfortunately, they have school today, but damn sure will be playing as soon as they're out of class. Everyone in our household games...we each have our favorites. Hell, I remember when one or another of the WoW games launched, we stayed up until midnight for the launch. Arrange vacations around the launch date, whatever.  \n\n\nOP, YTA. Let your partner enjoy her game.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "100% is FF14: Endwalker.. all my friends took today and the weekend off to play when the expansion hit as well. I quit the game but this is _literally_ common behavior for fans of the game. Expansion launches drop only like, once every 2-3 years for this game. Makes him an even bigger AH in my eyes knowing how hyped everyone in the fandom was to nuke the moon.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 327,
                  "content": "Right? Tell me you've never dated a gamer, without actually telling me you've never dated a gamer",
                  "id": 49,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Tell me your partner is clingy without telling me your partner is clingy 😂.",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Yeah right? He can’t cook breakfast by himself but she’s the obsessed one. He sounds co-dependent.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "It’s so gross to me that he’s known about this for weeks and still tried to frame it like his wife is this neglectful person who is “obsessed”. If my wife were planning something like this I’d be psyched for her and order her favorite takeout. \n\nThis dude cried about breakfast and a cat while trying to gaslight the entire sub by playing the victim card. I legitimately cannot get over the fact that a grown man cried about this and then went on a rant to a bunch of strangers trying to make it sound like his wife had some type of addiction that was destroying their family and he was just a super scared and caring husband lol.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "For real. My fiance doesn't game at all, but knows I love Legend of Zelda and when he found out about BOTW 2 (before I even knew about it!) he instantly pre-ordered and let me know (so we didn't both buy it). I also work a lot and he always tells me to make some time for myself on the weekend to unwind and game or on nights when I've had a stressful day at work because that's how I relax. \n\nHe'll even ask about what games I'm playing and how far I am and stuff. *That's* a supportive SO. Not someone who can't handle making their own breakfast when their SO is having ONE morning to themselves.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "You nailed it. Knowing this was important to his wife, something she took seriously and planned in advance to fully enjoy, he did everything possible to ruin her pleasure. OPs selfishness and entitlement is what’s pathological. OP is a huge AH.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 244,
              "content": "Ah I'm so glad when I see people explaining thing much better than I would and not siding with TA.\n\nOP YTA lol. Make ur own breakfast!",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 38,
              "content": "I couldn't help but laugh when OP said \"At this point I was in tears..\". Sorry but this situation isn't something worth crying over. Unless there's more context OP left out, I feel like OP is way overreacting.",
              "id": 56,
              "comments": [
                {
                  "score": 18,
                  "content": "Lmaoo same! And I saw another comment from OP saying he didn’t know how to feed the cat by himself 🤣",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Yep. \"In tears\" because she won't make breakfast for him. Good lord. YTA OP.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "He was *in tears* because his wife wouldn't cook him breakfast one morning...\n\nSMH. He's fucking delusional.",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Yep, every time my favorite game has a new expansion, I take the day off, stay up so I can start playing when it drops at midnight or whenever, and I definitely speed run the first time all the way through. I usually play for 2 days straight with naps here and there. My husband plays too, and he tries to keep up, but he usually goes to bed by mid-afternoon. He certainly doesn't expect me (or anyone else) to drop what we're doing and make him food. \n\nOP is being a big baby. YTA",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Anytime I read \"I calmly explained and she started shrieking\" or some other variation of how one person was sooo calm and logical and the other person was hysterical, I immediately am on the other person's side.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "YTA ITA She took a day off so she could enjoy something she likes doing- a hobby. That’s healthy. He wants her to stop doing that so that she can cook him (“help with cooking”) breakfast.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Many years ago I went to a midnight launch party for a very famous book series' finale and then took the entire next day (which was a weekend anyway) to just read the whole thing (I read fast but it was long). By OP's standards I'm clearly obsessed and need psychological help.",
              "id": 63,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5675,
          "content": "OP clarified in response to one of my comments that the \"family\" is just the couple and their cat.\n\nAnd I can guarantee the cat would prefer doordash and video games over whatever histrionics and pancakes the OP had planned. OP has some serious stones assuming the cat was on his side.",
          "id": 64,
          "comments": [
            {
              "score": 3827,
              "content": "Saying ‘it’s unfair on our family’ is so wildly manipulative, I’m actually blown away. If they had two kids under like 10, maybe OP would have a point. But nope. Just a cat who’ll most likely prefer to be left alone anyway.",
              "id": 65,
              "comments": [
                {
                  "score": 1948,
                  "content": "Ok so I wasn't the only one who caught that. \n\nDude said family and I thought \"dang she's shutting out some kids and a husband.\" Then OP said the cat and I lost respect for him. \n\nYou sound like my brother, OP. Do better. Make a PB&j and take a nap. Maybe you'll wake in a better mood.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 549,
                      "content": "Like an angry toddler. \n\nHave a snack & chill out. Maybe watch her play or go find something else to do for a little while. \nLeave her alone.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "I thought they had kids too from that comment. So manipulative. I feel bad like if they ever do have children because he won’t be able to do shit without her right under his and the kid’s ass. Everybody needs something for their self from time to time. \n\nJudgement, YTA op. Feed the cat, feed yourself and leave her to enjoy her game.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Or he could, I dunno, play with his wife. Make an account, try it out.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Even if there were kids, she still deserves 1 weekend off as a mother every 2-3 years.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1487,
                  "content": "[deleted]",
                  "id": 71,
                  "comments": [
                    {
                      "score": 1023,
                      "content": "you...put the cat food, in the bowl. You don't have to \\*do\\* anything. The cat food is premade. You take it out of the can or bag and you put it in the bowl. That's it.",
                      "id": 72,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 587,
                      "content": "How the bloody hell do you not know how to feed your own cat? If it's dry, grab a cup and put it in the bag, fill the cup and then dump the contents in the cup in the cats food dish. If it's canned, open the fucking can. Empty the contents of the can into the cats food dish. Like holy fuck",
                      "id": 73,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 488,
                      "content": "Oh my GOD what does this dude even bring to the relationship? Sounds like just loads of whining and attention seeking, which I bet Wife could train the cat to provide if necessary",
                      "id": 74,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 440,
                      "content": "After lying in bed til half 10 then asking for breakfast! This is so funny it's unbelievable.",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 290,
                      "content": "WUT\n\nTalk about weaponized incompetance",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 163,
                      "content": "I mean sounds like he's trying to sound incompetent so he doesn't have to do anything. Like how fucking hard is it to open a fucking wet cat food tin or a dry cat food scoop into a bowl.",
                      "id": 77,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 102,
                      "content": "I saw and I’m not surprised, just… dumbfounded.",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "Which also implies that when he says “we” make breakfast, it means SHE makes breakfast and he talks to her while she’s doing it.\n\nThe entire tone of OPs post rubbed me the wrong way. HE doesn’t like video games, so the fact that she does and wants to spend ONE weekend playing is “obsessive”? Give me a break. OP sounds suffocating to be married to.",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "WTF?  What grown adult can't figure out how to feed a cat?",
                      "id": 80,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 266,
                  "content": "He should frankly be embarrassed",
                  "id": 81,
                  "comments": [
                    {
                      "score": 132,
                      "content": "I am for him",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 93,
                  "content": "Yep. As long as they get their meals they're pretty content to laze around. Probably more comfortable in wife's dungeon than OP's hysterical realm.\n\nEdit typo",
                  "id": 83,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I know I would be.",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Honestly the whole post, especially the \"she's neglecting our family,\" feels like gender-swapped clickbait so someone can complain about \"see, they say it's ok for a woman to play video games but always label the guy an AH for doing it.\" Except that when a guy is labeled an AH for playing games, it's for quite a bit more than.....playing a game for one weekend and having someone else get one meal for a cat.",
                  "id": 85,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "The crazy thing is it’s not even manipulative to his wife, because she knows that’s bs. He’s so manipulative he’s trying to manipulate *us*",
                  "id": 86,
                  "comments": [
                    {
                      "score": 17,
                      "content": "You can see it in other places, too. She \"shrieked\" but he \"raised his voice\". It's very loaded language.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 315,
              "content": "Histrionics and Pancakes would be a great name for a memoir.",
              "id": 88,
              "comments": [
                {
                  "score": 19,
                  "content": "I may use it as my next band name!",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "“Histrionics and Pancakes” sounds like the best morning TV show ever.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Even if she had human kids… she hasn’t had a weekend to herself in *two years* but he has *weekly* D&D games according to some of his comments. Everyone deserves time to themselves, but that is wildly lopsided. In my experience, a D&D session is never less than 3 hours and is usually closer to 5 once you include planning, travel, waiting for everyone else to arrive, breaks, eating, etc. That’s like 150-250 hours a year and she’s asking for 48 in 2 years.\n\nAnd contrary to some of the comments further down the thread, I would have the exact same opinion if the genders were reversed.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1628,
          "content": "How dare his wife plan a single weekend for herself instead of waiting on him hand and foot?? Doesn’t she know that she’s not allowed to enjoy things without his explicit permission?? He even ‘hinted’ to her that she should drop her long-anticipated plans to do what HE wanted and for some reason she got upset ??? \n\n/s\n\nOP, leave her alone. She’s not hurting you, and she’s allowed to enjoy things.",
          "id": 92,
          "comments": [
            {
              "score": 672,
              "content": "I really can’t wait for his wife to see this thread 😂🤣",
              "id": 93,
              "comments": [
                {
                  "score": 557,
                  "content": "He didn't get the vote he wanted so I doubt he'll show it to her, hopefully she'll find it.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 543,
                      "content": "It's circling in online communities dedicated to this game already. I think she's gonna see it.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 154,
                  "content": "Yeah especially since OP wants her to. 😂 Um, u come here to ask if ur an AH not to give ur SO a wake up call. I knew from that already it was gonna be a YTA.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "A wake up call, indeed. To dump him.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I hope OP hasn't read any of the comments and blindly show his wife the thread. He'd make himself look like a bigger asshole.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 467,
              "content": "This one honestly made me laugh out loud because of how *sure* he is that he's in the right and she's being unfair. And yet, even telling the story from his perspective, he comes off really rude and inconsiderate. She woke up early for a launch. He slept an additional 7 hours and then interrupted something she was clearly excited for to whine about breakfast and the cat. Like, dude. Come on. 🤣 YTA",
              "id": 99,
              "comments": [
                {
                  "score": 23,
                  "content": ">u/No-Injury-7232\n\nI really really really want his wife to come on here and comment. PRETTYPRETTY PLEASE",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1199,
          "content": "YTA hard\n\nIt's FF14! Endwalker!!! Not only that it's common in the MMO community to take vacay for expansion drops. To add to that, this is the LAST expansion for this MMO, minus some updates like they usually do afterwards.\n\nEdit - you can stop telling me it's not the end end. It's still an end though and a must for die hands to be on for 1st day release!",
          "id": 101,
          "comments": [
            {
              "score": 465,
              "content": "Right???\n\nShe takes one day off for the most exciting expac and poor OP wants pancakes. His hands must’ve fallen off.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "No more expansions? First I heard of this. \n\nAre they going to start focusing on XVII?",
              "id": 103,
              "comments": [
                {
                  "score": 192,
                  "content": "Nah it's not the last expansion. Just the conclusion to the current storyline. Yoshi-p considers this his life's great work and I can't see him ever giving it up\n\nAlso how bad is it that I knew OP was talking about end walker immediately? (Yeah I definitely woke up at 4am too...)",
                  "id": 104,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Lol I knew what it was as soon as I saw \"4am\". I play with my husband and have for YEARS. I wouldn't want to show OP how much game time I have. Maybe OP should, I dunno, try it himself and enjoy it with her? OP is TA for sure. Poor boo boo can't make his own bweakfast! He needs to get over it and let her enjoy things.",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1135,
          "content": "This, OP. YTA. \n\nI can tell you that a LOT of us video games folks obsess about release dates on things we’re excited about. Some people get excited when tour de France comes on or when the football season is on or when a new car gets released. We get excited about pixels that we share with many other people. And yes, we hype about it for months before it comes out. It’s *normal*.\n\nAnd that she used the word “dungeon” and that it may take a while (not something she can just pause) could very well imply she’s doing it with other people. Real people. As real as you, OP. Sitting on their own chairs in front of their own computers being all excited about this new game release. Together. \n\nShe took a day off work, so she could do a thing she enjoys doing, something she has been extremely excited about, looked forward to and you made it about you. *You* were hungry, *you* wanted her attention, *you* made her hobby into a disease and made her feel like something was wrong with her. Dude. Seriously. What. The. Fuck. \n\nYou don’t have to understand something to appreciate that it makes your wife happy. So long as she maintains a normal life, you still get to spend time with her etc then she gets to take her vacation time and use it on what she wants. It’s no different than a woman going on a girls trip with her girlfriend during her vacation - where a bf would also not be included. Grow up. Okay? \n\nMake your own food, feed the cat. Tell her you’re sorry and let her enjoy her goddamn hobby in peace if you can’t be supportive. And next time you think about calling her obsessive over something like this, tell yourself that a lot of us gamers have left partners who made us feel the way you made her feel.",
          "id": 106,
          "comments": [
            {
              "score": 61,
              "content": "I can almost guarantee she's playing Final Fantasy XIV's Endwalker expansion that just released. Much hype was leading up to it and yes, it is an mmo so no pause is available.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "THIS!! Whatever her hobby is -- gaming, fishing, playing in a band, how DARE OP shame her for it. She has a right to a little time alone, and given how needy he is, probably really NEEDS it....",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 898,
          "content": "Knowing full well this is about FFXIV, respectfully OP, mind your damn business and give her the weekend to enjoy herself.\n\nThe reason this has been so hyped up is because it's the ending of the game story they've been telling for five years. She very likely has a community of other friends she's made plans to enjoy this with.\n\nIt's 2-3 days of taking care of your own damn self. Figure it out. YTA.\n\n(And just know that she's very likely venting about your whining to those same friends, who are probably asking her to seriously consider if you're worth the headache.)",
          "id": 109,
          "comments": [
            {
              "score": 67,
              "content": "I hope her friends are spamming her with links to this AITA because that'll be hilarious.",
              "id": 110,
              "comments": [
                {
                  "score": 44,
                  "content": "Oh, to be a fly on the wall of that Discord chat",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "Oh man it's FF? I don't play and even I know that's a huge fucking deal.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Seriously! OP could have taken the opportunity to plan some a guy's weekend or take time to do something he's interested in.",
              "id": 113,
              "comments": [
                {
                  "score": 47,
                  "content": "I don't think he has many friends. Judging by how high maintenance he is and how absolutely unable to care for himself, and how whiny.\n\nYTA, OP!",
                  "id": 114,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Supposedly he has a weekly D&D game with friends.... where she makes and brings him food while he plays.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": ">(And just know that she's very likely venting about your whining to those same friends, who are probably asking her to seriously consider if you're worth the headache.)\n\nWhoa now, don't go giving him hints. That's unfair \\*cough\\*",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "five? it's closer to ten.",
              "id": 117,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 708,
          "content": "OP is absolutely TAH, look at his comments:\n\nHe calls her obsessed and “crazy” for being annoyed he interrupted, but then INSISTS THAT SHE LEAVE HIM ALONE WHEN HE PLAYS DUNGEONS AND DRAGONS. This hypocritical OP nerds out every week, but suddenly it’s a problem when someone else does it once?\n\nAnd to top it off, SHE BRINGS HIM DINNER AND SNACKS—but our AH here can’t even make himself breakfast or feed their cat. Claiming she’s abandoning the family is hysterical, the only baby in the family is u/No-Injury-7232",
          "id": 118,
          "comments": [
            {
              "score": 437,
              "content": "By his own admission she plays just a few hours a week, and the last time she spent a weekend playing was two years ago. His wife sounds like a perfectly healthy well balanced person with a fun hobby and horrible taste in men.  And he can’t feed a cat!!!",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "Yeah this is yet another case of \"OP wants a wife who is a mom in every way but fucking him\" and a super doting mom at that",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "I'm not surprised OP cried. He's a neckbeard.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 476,
          "content": "Not to mention you knew your wife was super excited about this game/event and made sure to act in a way to ruin her enjoyment of it. You continually interrupted her when you know she was busy with something, after she explicitly told you she was busy. You tried emotional manipulation in a few ways (but I just want to make breakfast with you, don't you want to do that show how much you love me and I love you, but think of the poor kitty you are neglecting who totally couldn't get anything from me instead). You then straight up picked a fight with her to ensure she was angry and no longer having fun during this thing she planned out ahead of time and even took time off of work to do. Something that hasn't happened in years per your own comment.\n\nDo you also stomp on sand castles at beaches, or is it only people you are close to that you want to steal joy from?\n\nHuge, huge YTA. \n\nMaybe you should sit down and try to figure out what's wrong with you that you are so upset over this. Clearly this is a you problem, not a her or we problem.\n\nSometimes a cigar is just a cigar, but I think I'll go with Freud on this one.",
          "id": 122,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 398,
          "content": "*- she MOVED HER VACATION time rather than just keep her previous day off and spend it with me.*\n\n**This was a HUGE red flag for me.** How dare she move the day for the reason originally intended, instead of calling it a total wash to spend it with him. What a bitch!\n\n\n/s",
          "id": 123,
          "comments": [
            {
              "score": 14,
              "content": "Yeah, red flags all over this one....",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 351,
          "content": "Also OP waking up at 1030am, lucky you man! If you want to spend your extra hours sleeping in, sure as hell your wife can spend it on her games.",
          "id": 125,
          "comments": [
            {
              "score": 39,
              "content": "But she took a vacation day, why is OP sleeping in until 10:30? Lol",
              "id": 126,
              "comments": [
                {
                  "score": 54,
                  "content": "Methinks it’s because he always does, because he doesn’t actually work. Or it’s just a coincidence that he’s off today and the previous day that she took a vacation day for?",
                  "id": 127,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "That got me too.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 21289,
      "content": "She’s obsessed with a game she’s only been playing for that day? Yeah, okay, lol.\n\nLook, she took time off to play a game she’s looking forward to for a while. You mentioned  that she barely games, and that she claims to “work all the time”. Let her have her fun. You could always make yourself some breakfast instead of ordering. It’s only one day.\n\nBased on your analysis that she’s “obsessed” with the game, I’m not buying that she shrieked at you.\n\nYTA",
      "id": 129,
      "comments": [
        {
          "score": 4599,
          "content": "This.\n\nMust. Up Vote. Harder.\n\nI have 1,500 hours in Animal Crossing. And I went ape shit when it launched. Not to mention the recent upgrade. Think Templeton the Rat. 😉",
          "id": 130,
          "comments": [
            {
              "score": 2027,
              "content": "I've been a fan of Fallout since the 90s. Every time a new game hits, I'm basically unreachable until I've played through most of it at least once.\n\nI was heavily pregnant with our second when 4 came out & my husband actually ordered me a special thing that helped prop me up in bed so I could keep playing even when the computer chair became too uncomfortable to sit in.\n\nI'd put our toddler down for her nap & disappear into the Commonwealth for a couple of hours. NBD\n\nYTA OP. She’s your wife, sure, but she’s still a person. You don't own her. She's allowed to have outside interests.\n\nAlso what kind of grown ass adult needs help feeding a cat???",
              "id": 131,
              "comments": [
                {
                  "score": 434,
                  "content": "Right? My partner is also a big Fallout fan. Times his holidays for the new release, and I do my own thing for ten days while he lives his nuclear wasteland narrated by Ron Perlman type dream. This is not a bit deal, if you're not a needy cling-on masquerading as a grown ass human.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "Yep. My husband has multiple games where when they release I know I’ll lose him for a day or two. I understand and accept this. I can hang out with him in the room if I feel like it. Been like this our entire relationship and since we have no children he’s not leaving me to do that all on my own. Though perhaps I need to tell him to help me with feeding the cats on these days. How could I possibly do it on my own?",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Haha that's what I was thinking. So the \"family\" is him, his wife, and a cat?",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I was supposed to be recovering from surgery when Fallout 76 came out. I dragged my husband to the store to pick up my reserved copy. He didn't want to leave me alone at home and I wanted to see what gaming merchandise the store had. \n\nOp needs to understand sometimes hobbies are just worth getting up and playing early for.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "My husband loves Fallout too. Once the kids are in bed he has totally stayed up all night playing the game. I’m not a gamer so I chill in the other room and watch something on streaming I know he doesn’t care about and make coffee when the kids inevitably wake him up in the morning. People are allowed to have hobbies. OP YTA. Doordash some Dunkin and shut up.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "That rat song immediately started playing in my head",
              "id": 137,
              "comments": [
                {
                  "score": 15,
                  "content": "You're welcome. 🤣",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Oo 1500 hours, nice going! I haven’t checked mine for a while, now I’m interested to see if I can compete with this number…",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1027,
          "content": "I guarantee it's Final Fantasy XIV. The new expansion dropped at 4am this morning. \n\nShe *could* be obsessed, except for the mention that she barely games and works all the time.",
          "id": 140,
          "comments": [
            {
              "score": 471,
              "content": "Came to say this. My dear husband has been playing it since it first came out and Endwalker has been the main talking point for months. If they had delayed the release again I might have had to kill him. At least now he's not talking about it all the time, the peace and quiet is pretty sweet.",
              "id": 141,
              "comments": [
                {
                  "score": 72,
                  "content": "Yeah, it's definitely a big deal if you're involved in the game. It makes sense to set aside the day if you can and play a bunch.",
                  "id": 142,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Absolutely! Husband wanted to do the same but with the delay it wasn't possible. OP should leave his wife alone!",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "I appreciate that this is your take with your spouse. You don’t have to be in the trenches with them to be supportive. Simply holding space for their hobby and not having a mental breakdown when they don’t cook breakfast for you is amazing.",
                  "id": 144,
                  "comments": [
                    {
                      "score": 36,
                      "content": "It's like literally the easiest thing to do, the only thing that is asked for is that I don't ask him to look at every kitten I find on the internet for a while. It takes zero effort, that's how easy it is. It also gives me a great opportunity to zone out with a game of my own.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Came here to say this.\n\nSo, yes to the AH question.\n\nAlso, to those not knowing about MMO expanions releases... They are bi-annual releases that completely shift the landscape of the game. Being a few days behind can hinder the development of your character, guild, etc\n\nMore power to his partner for loving what they play!",
              "id": 146,
              "comments": [
                {
                  "score": 26,
                  "content": "Yeah, for sure. Even without the context he's the AH for how he talked to his wife and described her actions. But with that added context, it's even worse. This was a scheduled activity with months of excitement leading up to it.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 30,
                      "content": "That brings up an interesting point: why didn’t OP understand why she was so gung-ho about this? He doesn’t have to like the same things she does of course, but if she’s HUGE into FFXIV and he doesn’t care enough to have even a cursory understanding of the game and her love for it, that’s a bit dodgy imo.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Not too mention, as an avid player of FF14, this expansion is a huge deal. The MMO has been ongoing for 7 years and this expansion is the ending to the story that started all those years ago. For anyone who has been following it, this is the biggest deal for that game.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Definitely has to be FFXIV Endwalker. So many arguments about online gaming, whether between partners or parents and kids or whatever, could be mitigated if the non-player was just a little bit more understanding about the implications of “PAUSE DOES NOT WORK IN CERTAIN ONLINE GAMES!!!”  While he was trying to occupy her time to have a “reasonable discussion” she was in the middle of a 4-player activity (the dungeon run he mentioned) where taking her attention off the screen or setting down the controller to do something else can bring things to a bad end for her and three other people who didn’t sign up for waiting for someone to walk away in the middle of combat and waste their time… which would have happened if the OP got his way. This is why she took time off for the game- so she could enjoy the vast amount of new content at her pace without anyone throwing a wrench into the works, which he tried to do.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "It definitely has to be. My bf is in love with it and already warned me that he will be hard to reach when it comes out. We're both gamers though, so I get it. He's been talking about this release for months, I'm perfectly fine with him getting wrapped up in for a few weeks because I know how much he loves it. Not like he hasn't played it for years already, he'll be back to normal in a few days.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 585,
          "content": "Yeah, I don’t get why his only options where to have her cook with him or order take out. Looks like she is the one cooking by herself… I don’t understand why he can’t cook his own breakfast",
          "id": 152,
          "comments": [
            {
              "score": 376,
              "content": "Because mommy cooks breakfast",
              "id": 153,
              "comments": [
                {
                  "score": 52,
                  "content": "OP need mommy milky\n\nI am so, so sorry for typing this but I’m gonna post it anyways just to hurt others lol",
                  "id": 154,
                  "comments": [
                    {
                      "score": 32,
                      "content": "It's literally the energy he's giving off though, so...",
                      "id": 155,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": "At 10:30 in the morning no less. I'm leaning heavily towards troll on this one. I mean, crying because she won't make you bwekfast. Give me a break.",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Seriously. Even if he can't cook at all, there are tons of options. Cereals galore. Oatmeal and grits both have microwave versions. And Eggo came out with this French Toast that is actually pretty damn good if you cook it according to directions (through the toaster twice but on the low setting). I usually hate stuff like that but it's really awesome for freezer food. Not to mention the hundreds of other microwave biscuits, burritos, etc. Or just Google scrambled eggs and figure it the fuck out like my daughter did when she was 9 and wanted scrambled eggs when I was sick.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 313,
          "content": "So, my guess is it's Endwalker, which is an expansion to FFXIV an MMO.  It released today.   \nOdds are she already has the game and has played for a while, this is a wave of new content that she is excited about - so the claim on obsessed with a game that released today may be a bit less empty.  \n\n&#x200B;\n\nThat said, the rest of the post still comes of as him not being able to take care of his business.  Let her have her fun.",
          "id": 158,
          "comments": [
            {
              "score": 105,
              "content": "Usually by this point in a mmo you’re basically done with content though. Many people stop playing for the last months of an expansion because there’s nothing to do. So it’s unlikely she’s obsessed just because she’s played it before. Especially since he didn’t mention a single thing about playtime before today, and you know if it supported his argument he would. I’m also a little biased though since my brother also took off today to play the new expansion.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Minecraft dropped the second part of the Caves and Cliffs update two days ago. It's amazing! And I've been obsessed since then. I'm a 50yo woman and my husband loves when I get into a game so he can focus on his game play. \n\nDude needs to stop acting like a clueless Archie Bunker and learn to cook his own damn food.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I’ve literally waited YEARS for a game to come out. Years. If I want to spend 12 hours straight playing it, two days straight, a WEEK straight playing it I will. I work 40+ hours a week, I’m chronically depressed, the world is shitty, let me enjoy one fucking thing",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "> She’s obsessed with a game she’s only been playing for that day?\n\nShe played an MMO for 6 hours on launch day (most of which would be spent queuing) and OP's calling her obsessed. Massive YTA to OP.",
          "id": 162,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18518,
      "content": "YTA. You  mention in another comment that the last time she did this was over two years ago. So every couple of years, your wife wants a weekend to herself. That is not unreasonable. \n\nWhat *is* unreasonable is that even after she made it very clear she wanted to be left alone, you insisted on continually inserting yourself until she snapped at you, after which you immediately took on the victim role and turned it into a major argument. Almost like that's exactly what you wanted. \n\nGee, I wonder why she needs a weekend to herself now and then...",
      "id": 163,
      "comments": [
        {
          "score": 4393,
          "content": "I couldn’t have put it better myself.\n\nThe edit to include that she moved a vacation for this makes OP an even bigger asshole. There is no way OP didn’t know she was *on vacation* and still wanted her to work for him. OP, please show her this thread so she can show you the door.\n\nYTA.",
          "id": 164,
          "comments": [
            {
              "score": 1456,
              "content": "I want to believe this isn't real, but I've known wayyyyyy too many people like this. Emotionally needy, while being functionally handicapped. Good lord.",
              "id": 165,
              "comments": [
                {
                  "score": 303,
                  "content": "Dang, I was sure this was fake. Now I really feel sorry for his wife.",
                  "id": 166,
                  "comments": [
                    {
                      "score": 317,
                      "content": "This thread is one of those where it's 50/50 as to whether the person who typed this situation up and hit \"submit\" is actually living it. But whether they are or not, you know that somewhere out there, someone is. This kind of behavior is way too common. \n\nIt's definitely a true story. It just might not be true for OP.",
                      "id": 167,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 250,
                  "content": "\"emotionally needy, functionally handicapped\" is perfect as the album title for the band that will be named \"histrionics and pancakes\" from another comment. Y'all are dropping GEMS on this comment section ❤️",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 220,
              "content": "> OP, please show her this thread so she can show you the door.\n\nThis thread's gonna be a wakeup call for OP's wife alright. Just not in the way he was hoping for.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Down in lower comments, OP said he knows she reads this subreddit. So she will. And I'm guessing she won't be real impressed.",
              "id": 170,
              "comments": [
                {
                  "score": 29,
                  "content": "I hope she posts here with a tongue in cheek “AITA for divorcing my husband because he can’t feed our cat” and then lays into his history of emotional abuse for us all to enjoy.",
                  "id": 171,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Totally. He made that edit like it would help his case instead of make him look like even more of needy, whiney ass. She used a vacation day so that she could play a game he KNOWS she has been excited about for weeks+ and when the day comes he just bugs her and whines about having to feed the cat alone.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 835,
          "content": "Also the fact that OP created the post for the comments to be a “wake up call” to her, calling her obsessive, and just brushing over “I may have been the a*hole because i yelled”.\nIt’s called “Am I the Asshole” because it’s for people to see different perspectives and reflect on their own actions, NOT to gather comments to show to your partner in a “LOOK!!!! THE INTERNET SAYS I’M RIGHT” way to win an argument.",
          "id": 173,
          "comments": [
            {
              "score": 315,
              "content": "Posts like this are my favorite, \"This group will totally be on my side, I'm obviously right.\" And then they Surprise Pikachu Face when the unanimous vote is OP being the AH.",
              "id": 174,
              "comments": [
                {
                  "score": 46,
                  "content": "Especially when it’s about gaming. \n\nWhy post this on Reddit? Look at the demographics! Look at how many subs there are dedicated to gaming at all levels.\n\nIf he wants to paint her as the “evil wife who ignores her family to play silly video games” and get validation…Idk. Maybe post on a Facebook mommy group or something?\n\nMaybe he’s really unfamiliar with Reddit, but you would think you would consider the audience before posting something that’s meant to be a “gotcha!”",
                  "id": 175,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 532,
          "content": "I hope she gets the pets in the divorce.",
          "id": 176,
          "comments": [
            {
              "score": 500,
              "content": "Considering OP apparently can't even feed a cat by their own omission, I think that's likely.",
              "id": 177,
              "comments": [
                {
                  "score": 93,
                  "content": "Yeah... Very sad. Not. Resume game.",
                  "id": 178,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 250,
          "content": "Who has two hands and can feed himself and the cat? OP\n\nImagine how pissed he’d be if the shoe was on the other foot. There’s some sort of event that’s so important to him that he takes the day off work and she’s whining because she can’t feed herself.",
          "id": 179,
          "comments": [
            {
              "score": 181,
              "content": "Apparently not! According to OP, they/he can't feed the cat because they/he don't know how. THEY DON'T KNOW HOW TO FEED A CAT. \n\n(Yea, I'm assuming OP is a guy too. MisAAnnnndRRRYyyYYYYY!)",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Wait until his next D&D game when she doesn’t bring any snacks over for him. “what do you mean I have to do it myself?!”",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "Over two years ago was the Shadowbringers Launch for FFXIV. OP, YTA for being a child because your wife won't make you breakfast once every 2-3 years because of a game she's interested in but will take time every week to bring you food for your interest.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "She should ditch this joy-sucking buffoon and enjoy every weekend free of his whining",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "It is unreasonable. \n\nShe should be taking more than a weekend every few years.",
          "id": 184,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "OP is the one with an obsession: his wife. He wants her undivided attention and can't stomach the idea that she has her own interests that don't involve him. His fantasy that she has a gaming addiction is just how he rationalizes trying to dominate her behavior.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7474,
      "content": "Well, is she right? Here are a few questions to mull:\n\n1) Does she work a lot?\n\n2) Does she not ask for much, most of the time?\n\n3) Was it a special launch day, rather than just a regular day?\n \n\nIn that case, make your breakfast, feed the cat and find something to do. \n\nIf she spends most of her leisure time online and you guys don't share regular meals, that's therapy time.  \n\n>She took today off of work, so she could be up at 4AM to play her online game at launch.\n\n>we had already discussed ordering pizza tonight for dinner,\n\n>I mentioned that I was Hungry, hoping we could make breakfast together , which we like to do together.\n\nBut from what you've said, this was a special launch that she took a vacation day for, you guys often do breakfast together and you'd already planned for dinner together. There's also something unpleasantly manipulative about how you present the story and that's never a good sign. You're either not self aware enough to know you're trying to bias the readers or you genuinely can't see both sides of an argument.  I'd say its therapy time but for you both.\n\nYTA",
      "id": 186,
      "comments": [
        {
          "score": 1856,
          "content": ">There's also something unpleasantly manipulative about how you present the story and that's never a good sign. You're either not self aware enough to know you're trying to bias the readers or you genuinely can't see both sides of an argument. I'd say its therapy time but for you both.\n\nI agree. Sometimes I wonder if AITA stories like this are actually written by the \"offending\" party to disprove the other's point of view, but failing to maintain a consistent perspective. I've seen a few clear cut examples of that here - though this one is ambiguous enough that I couldn't say.\n\nIn this case, it would be the wife writing the scenario from her husband's point of view, but then subtly defending herself at times so that the overall perspective doesn't quite jive.",
          "id": 187,
          "comments": [
            {
              "score": 848,
              "content": "With posts like this I always wonder if it's one of the many poorly written attempts of a gender swapping story. So the writer can say the sub is biased. \"It's okay for girls to play video games but guys are always the AH\" that nonsense. They never seen to realize why someone was the AH. Like in this if the GF was neglecting a child or spending money they don't have it'd be a problem.\n\nThat's not to say some people aren't biased but this post is bizzare.",
              "id": 188,
              "comments": [
                {
                  "score": 733,
                  "content": "People who do stuff like that don't understand nuance at all. They're like oh yesterday there was a OP who wanted to game on launch day and y'all dog piled him cuz he's a man but when you go read it it's like I work 4 full time jobs to support my family and my husband is a sahd/ unemployed. He forgot this game was launched on a day we made plans, AITA for being upset he won't make time for me? \n\nAnd like yeah, that guy would be the asshole. Because the situations are completely different! They only see man play games bad woman play games good without any understanding of the actual situations",
                  "id": 189,
                  "comments": [
                    {
                      "score": 399,
                      "content": "Oh this. I've seen a bunch of near copy/paste stories with the genders switched, and then like half the time they add details to one to try to keep people off the scent that *completely* changes the situation and it's like??? *Yeah there's a reason we're ragging on this guy now but not that chick from yesterday*",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 81,
                      "content": "Yeah it happens like that a lot.",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 181,
                  "content": "Ding ding ding.   That’s exactly what I was thinking this is, so later on some galaxy brain can complain about how AITA is sO sExIsT aGaInSt MeN.  And yet meanwhile I think everyone would be asking the same questions - is this common?  Did he really yell out of the complete blue?  Or is this a one time thing and maybe just leave him alone?",
                  "id": 192,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "I dunno, as a woman I can't imagine a wife who can't cook and also doesn't know how to feed a cat. It's really the cat one that gets me more than cooking (I'm no iron chef myself and my husband is the master chef in our family) but if I really couldn't make some eggs I'd just pour some cereal and milk not stand there paralyzed about what to do for brekky. I really can't imagine the person of any gender who is this helpless.\n\nRegardless of gender, OP is the AH.",
                  "id": 193,
                  "comments": [
                    {
                      "score": 42,
                      "content": "I can't imagine a *human* who doesn't know how to feed a cat. Food goes in bowl. Fuck, doesn't even have to be human. The cat certainly knows how a cat is fed. A mouse probably can grasp the concept. You've got to get down to nearly protozoan levels of intelligence before you can get to \"doesn't understand how food works.\" I think it's just something OP said as an excuse without thinking about how absurdly stupid it sounds.",
                      "id": 194,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 378,
          "content": "I can answer number 3. \n\nI’m very confident this is the latest expansion of Final Fantasy 14. It got delayed from its original launch date of Nov 19, until today. \n\nIt’s also the expansion that wraps up the main overarching story arc that’s been in the making over the past 8 years. I know a lot of people who have been VERY hyped for the release and organizing groups to run dungeons together with friends.",
          "id": 195,
          "comments": [
            {
              "score": 38,
              "content": "Thank you.   \nOp: YTA.",
              "id": 196,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 220,
          "content": "It’s the endwalker release for FFXIV. It’s the end of the series and was postponed.  So the hype is there. She’ll be 90 in no time",
          "id": 197,
          "comments": [
            {
              "score": 33,
              "content": "Right, minimum of 10 years building up at this point. I'm passed at OP for this. Sitting here in a queue that keeps erroring out for hours this afternoon T_T",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 121,
          "content": "Never take someone like OP to therapy. This is narcissistic behaviour shown in OPs post and OP would likely use therapy to further the manipulation. OP's wife needs to turn tail and run asap - OP will only get worse.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "> She took today off of work,\n\nAlso... Why was OP still at home!?",
          "id": 200,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 22,
          "content": ">Was it a special launch day, rather than just a regular day?\n\nEndwalker dropped today, latest xpac for Final Fantasy XIV and it marks the conclusion to the BIG storyline/conflict that's been at the story's heart since 1.0 so yeah. It's a Big Fucking Deal for those who play the game. Given other details, it sounds like she takes time off when the new expansions drop.",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "You are right. OP sounds VERY manipulative, immature, and annoying AF. His wife clearly communicated that she was looking forward to this game, and wanted some time to herself to enjoy a hobby that she greatly enjoys. And, OP is actively trying to ruin her experience by making her feel that there is something wrong with her and weaponizing \"family time\" aka him and the cat. It doesnt sound like she is the one in need of help - OP does - since he started throwing a tantrum, standing in front of the TV, and demanding to be fed after only a few minutes.....\n\nOP, your wife doesnt sound obsessed. You sound super needy and manipulative. Leave her alone. You only want your wife to stop what she is doing so that she can make you breakfast. Sit and let the cat peacefully ignore you - your claims that you will \"feed the cat wrong\" are BS. Let her enjoy her hobby.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6324,
      "content": "YTA\n\nNo, this is going to be a wake up call for you.\n\nYour wife is not your mother, she's doesn't have to make you food, you are perfectly capable to do it yourself. I wonder who does the cleaning in your house. \n\nShe gave you a reasonable option and you pouted. It sounds like your wife works extremely hard and just wanted time to enjoy something she enjoys and be by herself, which isn't a bad thing at all.\n\nLeave her be and look after yourself.",
      "id": 203,
      "comments": [
        {
          "score": 1968,
          "content": "B..b…but then who’s gonna pay attention to him? 🙄🙄🙄🙄🙄",
          "id": 204,
          "comments": [
            {
              "score": 602,
              "content": "I know, it's actually cringy",
              "id": 205,
              "comments": [
                {
                  "score": 263,
                  "content": "Cringe AND clingy.",
                  "id": 206,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "*cries*",
              "id": 207,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 658,
          "content": "I'm trying to figure out if by \"family\" he just means him and the cat? Or if he could possibly be a cat? \n\nBecause, like, my pet likes to park itself in front of me and whine for food, but my husband would be absolutely mortified if it looked like he couldn't take care of himself well enough to pour some cereal into a bowl.\n\nOP, YTA",
          "id": 208,
          "comments": [
            {
              "score": 381,
              "content": "I know at first when he said family, I thought \"OK if she has kids she can't be spending so much of the day playing it\" but then he said it was a cat and I wondered if he was actually serious, like cats are very independent and will eat pretty much anything you give them, its not difficult.",
              "id": 209,
              "comments": [
                {
                  "score": 133,
                  "content": "I thought that at first too, but also… this was planned, and really there’s no reason she shouldn’t be able to take a day off (while still being in the house in case of actual emergency), even if they are human kids and not just a cat (I own cats and of course they’re not *just* a cat, but they’re rather more self-sufficient than a child, and, apparently, OP).",
                  "id": 210,
                  "comments": [
                    {
                      "score": 73,
                      "content": "Yeah, I mean my husband has been planning for this since it was announced, so I planned around him not being able to parent this weekend. It's exactly like when I take a weekend camping trip. All parents deserve breaks and that's the biggest point of an equal partnership",
                      "id": 211,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "> cats are very independent and will eat pretty much anything you give them\n\ngod I wish. Some cats are like that. Ours are fussy eaters (who have different preferred foods, even) and crave attention. The latter is... pretty cute though, admittedly. One of them will stop eating to come over and chirp at us until we're paying enough attention for her to go back to eating. She wants to chat over breakfast!\n\nNot arguing on the point though, it's just funny to me how different cats can be from one another.",
                  "id": 212,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "OP- \"I have a family\"\n\nReality- its just a single cat.",
              "id": 213,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Lmao at him being a cat 🤣🤣",
              "id": 214,
              "comments": [
                {
                  "score": 13,
                  "content": "That would explain a lot. Only a cat would distract the shit out of you on launch day.",
                  "id": 215,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I had to scroll down WAY too far for someone to address this. Even if it was actual human children; there’s no reason homeboy couldn’t put together *at least* some cereal or toast or something, but the fact that it’s a cat made me lose my mind, and that he calls being in the same building but mostly unavailable for activities for a day “abandoning their family” really did it for me. I just can’ttttttt",
              "id": 216,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 198,
          "content": "I'm very curious of OP's definition of \"making breakfast together\". Feels like someone wanted mommy to make him pancakes.",
          "id": 217,
          "comments": [
            {
              "score": 26,
              "content": "Right??? Couldn’t he just make her pancakes and surprise her?",
              "id": 218,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "> No, this is going to be a wake up call for you.\n\nFrankly I would sooner try to wake the dead than OP. Seems like better odds.",
          "id": 219,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Weaponized incompetence. OP specialty.",
          "id": 220,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5058,
      "content": "YTA. It was launch day. She doesn't do this all the time. You overreacted. You state in another comment that she makes you dinner and snacks during your WEEKLY DnD game. Last time she did this was 2 years ago. You also state she plays a few hours a week aside from this. Why couldn't you have made her breakfast and a snack while she gamed? She would have done that for you. I'm hoping reading this thread gave YOU the wake up call that you need. Cause it sounds like your wife isn't the wrong one here.",
      "id": 221,
      "comments": [
        {
          "score": 932,
          "content": "Lol wtf are you? A toddler helping mommy stir the pancake batter?? \"she's better than me at cooking\" isn't an excuse.",
          "id": 222,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 419,
          "content": "It's really rich of him to be so hysterical over the time she's putting into the game for one weekend when he plays weekly D&D sessions. I don't know about other groups but my group plays a good 6 hours at a time. If his sessions are going so long that she brings him not just snacks but makes a full meal for the group then they're lasting several hours. \n\nHe's a massive hypocrite as well as an AH.",
          "id": 223,
          "comments": [
            {
              "score": 91,
              "content": "Yeah I don't think he got the reaction out of this post he was hoping for",
              "id": 224,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4217,
      "content": "You're also the AH for labeling her as obsessive and trying to paint her that way to others, when from your comment about how often she does this you said last time was TWO YEARS ago. Clearly not obsessive but you're trying to paint yourself as the victim by writing that.",
      "id": 225,
      "comments": [
        {
          "score": 809,
          "content": "Right I was at least expecting a \"she does this a few days a week where she just completely checks out\" but in reality it's \"sometimes there's a game she really likes and she spends a few weeks being excited about it and then plays for a few hours.\"",
          "id": 226,
          "comments": [
            {
              "score": 317,
              "content": "I literally game every day for a couple hours after kids are in bed and chores are done. I’m not obsessed. OP’s wife could be at the bar but she’s at home enjoying herself \n\nOP go get the woman some snacks and cheer her on!",
              "id": 227,
              "comments": [
                {
                  "score": 37,
                  "content": "Lol me too! I move my ass from my desk at work to my desk at home. I have breaks every hour for making food checking in with my wife, Getting us drinks or snacks. It's been our routine for 11 years now. Probably not gonna change.",
                  "id": 228,
                  "comments": [
                    {
                      "score": 19,
                      "content": "yeah my hubby games too and its something we can do together. And gaming with our friends helps me get my socializing out but keeps my introverted husband safe at home lol",
                      "id": 229,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4055,
      "content": "\"I mentioned that I was Hungry, hoping we could make breakfast together\"\n\nI feel like this is code for \"I want *you* to cook breakfast for *me*\" you are an adult who is perfectly capable of making their own breakfast.\n\nYTA",
      "id": 230,
      "comments": [
        {
          "score": 861,
          "content": "but...but...but....it's their love language!!!! /s",
          "id": 231,
          "comments": [
            {
              "score": 130,
              "content": "Lmao you mean it isn't OP behind his wife with his hands on her hands, like the movie Ghost, as she sensually shakes a skillet?\n\nSeriously, how many jobs are there in a single kitchen for _breakfast_? How hard is it to throw some bacon in this pan, and some eggs in that one, OP? Good grief.",
              "id": 232,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 637,
          "content": "Imagine if instead of pouting (why isn't he at work BTW, but I digress) he made breakfast for both of them and brought it to her? That would have made him very cool and not an AH. Unfortunately, he chose to cry.",
          "id": 233,
          "comments": [
            {
              "score": 647,
              "content": "She apparently makes and brings snacks for him every week during his D&D sessions, then leaves him alone. So the fact that he couldn't reciprocate this one time is ridiculous.",
              "id": 234,
              "comments": [
                {
                  "score": 634,
                  "content": "HE PLAYS D&D ON THE REG AND SHE CAN'T HAVE ONE DAY FOR A FEW HOURS TO HERSELF??? AND she caters to him while he does? \n\nOP you really suck. Be a better husband.",
                  "id": 235,
                  "comments": [
                    {
                      "score": 59,
                      "content": "But he’s *worried* she’s addicted. This is for her own good. /s obvi",
                      "id": 236,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 44,
                      "content": "yeah D&D takes way more hours than a weekend  launch to play the day",
                      "id": 237,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "I bet he plays a ranger",
                      "id": 238,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "what????? I refuse to believe this story is real 🤦‍♀️",
                  "id": 239,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Welcome to the world of being life partners with a man...",
                      "id": 240,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "IKR...rolling out of bed at 10:30 am feeling sorry for themselves. Maybe OP works weird hours or something but this got my blood boiling for this poor woman.",
              "id": 241,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "She took a vacation day, making me wonder the same thing. What was OP doing asleep till 10:30 on presumably a workday?",
              "id": 242,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 275,
          "content": "I bet \"together\" means \"I hang out with her in the kitchen while she does everything and maybe I wash a plate\"",
          "id": 243,
          "comments": [
            {
              "score": 57,
              "content": "\"... but only if she asks.\"",
              "id": 244,
              "comments": [
                {
                  "score": 48,
                  "content": "\"...twice.\"",
                  "id": 245,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 199,
          "content": "Reading his comments, that’s it exactly.",
          "id": 246,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "I stopped reading there because when I read \"hoping\" I instantly knew he never actually said it and was being passive at his wife expecting her to drop everything to decode his wants and rush to meet them. Rather than him using his words to clearly state \"let's make breakfast together\". And yes that whatever he actually said wasn't code for together but code for her to do it all.",
          "id": 247,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "But he wanted her to make her homemade biscuits! And he's not sure exactly how to feed the cat! And other than this weekend, and also two years ago, she plays games for *a few hours a week!* She's obsessed! Obsessed!",
          "id": 248,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3833,
      "content": "INFO: Did you actually plead a case for family togetherness on behalf of your cat?",
      "id": 249,
      "comments": [
        {
          "score": 1487,
          "content": "Info: Can I marry OP’s wife after they divorce? She sounds like my kinda lady. I’ll even make her breakfast",
          "id": 250,
          "comments": [
            {
              "score": 609,
              "content": "Right? I’ll play video games with her, and I’ll make crepes. OP, give me your wife’s gamer tag.",
              "id": 251,
              "comments": [
                {
                  "score": 565,
                  "content": "My IRL best friend. Met someone on FF14. They played online.  This guy kept telling her that her husband was a dick (he was) and she could do better (she could) whenever the husband would berate my friend while she played. They ended up falling for each other, and she got divorced.  they dated and both moved to a new city to be together. 100% total upgrade. she went from mommy slave wife (they had no kids) to adult partner who's views matter. She's living a much better life.",
                  "id": 252,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 223,
              "content": "No I want to marry her so that she and I can both take a vacation day 2 years from now when the new ffxiv expansion drops so we can both get up at 4 am on launch day to play and squeal about the new main story quests together",
              "id": 253,
              "comments": [
                {
                  "score": 29,
                  "content": "A whole new story at that",
                  "id": 254,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 146,
              "content": "Sure thing /u/notyetaserialkiller.",
              "id": 255,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 41,
              "content": "Can we form a commune or something? I know the MMO OP's talking about and we could totally form a static raid party.",
              "id": 256,
              "comments": [
                {
                  "score": 16,
                  "content": "I’m in!",
                  "id": 257,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 351,
          "content": "Not enough people are considering the needs of the poor neglected cat.",
          "id": 258,
          "comments": [
            {
              "score": 324,
              "content": "Including OP, who doesn't even know how to feed it!",
              "id": 259,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 145,
          "content": "INFO: What DC is she on, I need a tank to power level my Sage",
          "id": 260,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2757,
      "content": "If you hope to communicate to her via this Reddit thread, YTA.",
      "id": 261,
      "comments": [],
      "relation": "No"
    }
  ]
}