{
  "post content": "First of all, I'm on mobile and non-native english speaker.\n\nSo in early 2020 there was a concert, to which a group of our friends wanted to go (tickets were sold pre covid, then the concert got delayed due to covid). It is an expensive concert, but I really wanted to go there at that time. My husband didn't want to go, and after thinking about it I didn't want to go without him, so we decided not to buy tickets... \n\nFast forward to today, the new date for the concert is next Saturday, and one friend who originally wanted to go can't go anymore. My husband was offered the ticket, and now he wants to go to the concert. \n\nI don't want him to go, as it is one day before we go to our family vacation and we have a lot of things to prepare (we have to kids 3 years and 9 month old, so I can't do any of the packing alone) and also because originally I was the one who wanted to go. \n\nBut I feel like I might be the A-Hole here if I tell him that I don't want him to go...",
  "id": 1,
  "comments": [
    {
      "score": 14,
      "content": "Couldn’t he just pack early and you all can be done with trip preparations? That way he can go and you also won’t be stressed about the trip",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "My thoughts exactly!",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "That's true, and that's what I would offer him, but there is still this feeling left of \"originally it was me who wanted to go, and all of a sudden it's you who gets the chance\"",
          "id": 4,
          "comments": [
            {
              "score": 8,
              "content": "I get the jealousy completely. But don’t react from a place of jealousy. I agree with the above poster. Pack early. NAH (yet).",
              "id": 5,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Your feelings are valid but do not rob your husband of something he wanted to do or got opportunity to do just because you can’t do it.\nDid you ask him for the ticket considering he is not into it as much as you?",
              "id": 6,
              "comments": [
                {
                  "score": 0,
                  "content": "I didn't ask for the ticket for me when I knew that the friend couldn't go, because I thought it would be too stressful one day before our vacation.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Did you tell your husband that? Maybe he should have allowed the ticket to float to another friends boat and just not gone.\n\nBtw, I still would make him promise to take you to another concert in the future, whether he wants to or not.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Sometimes life is like that.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "INFO: Why doesn't he just help you pack early and still go to the concert? Everyone wins right?",
      "id": 10,
      "comments": [
        {
          "score": 0,
          "content": "Not really, she still doesn't get to go.",
          "id": 11,
          "comments": [
            {
              "score": 5,
              "content": "Ahhh, so since she can't go neither of them should go?",
              "id": 12,
              "comments": [
                {
                  "score": 0,
                  "content": "But overall, it's not win-win for her, because the solution you propose is that it's a win for her if she's not stuck with *all* the family work and also doesn't get to go to the concert.\n\nIt's a neutral for her, at best.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 2,
                      "content": "So he wins and she's neutral. Do you see a better outcome?",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "In this case I \"don't win\" because originally it was me who wanted to go to this specific concert and not him.",
          "id": 15,
          "comments": [
            {
              "score": 3,
              "content": "So if you can't win, he shouldn't either?",
              "id": 16,
              "comments": [
                {
                  "score": -1,
                  "content": "That's not it. I guess I just would have wanted him to be more considerate. We will talk when the kids sleep",
                  "id": 17,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Outside of helping extra with the kids when you go to sleep, what else could he do here to be more considerate for you?",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NAH, life is unfair, you feel like you got cheated out of something you wanted to do only for it to get handed on a silver platter to someone else who didn't really care at first. Just make him promise to take you to the next concert you want to go to.",
      "id": 19,
      "comments": [
        {
          "score": 5,
          "content": "I really like your approach ❤️",
          "id": 20,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "YTA you seem to be mostly jealous he is going and not you. He can help before the concert.",
      "id": 21,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the A-Hole because my husband also deserves some fun time, even if he didn't want to go to that specific concert 2 years ago.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 22,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "You didn't buy a ticket because *he* didn't want to go, now he wants to go and leave you with all the family work? Is that correct? \n\nNTA.",
      "id": 23,
      "comments": [
        {
          "score": 2,
          "content": "I think the important thing here is that her husband didn't ask her not to go. She decided she didn't want to go without him, so she didn't buy the ticket. But she could have. And there is still only one ticket. So if OP is still against going without her husband, she still wouldn't want the ticket. OP feels like she would sound like TA for saying basically \"I don't want to go alone but I don't want you to go without me either, so if there's only one ticket neither of us can go.\"\n\nI understand why OP is frustrated, especially if she is going to be stuck packing alone when he gets to go to the concert that he didn't want to go to before, but has OP expressed this to him? \n\nOP, I suspect you have a lot of feelings that you haven't communicated to your husband. Did you explain to him in the first place, in 2020, that it was really important to you for him to go with you, and he still refused? Or did you just quietly decide not to buy tickets if he didn't want to go?\n\nHe could pack for the trip ahead of time, so that's clearly not the issue.\n\nOP, NAH. Just sit down and talk with your husband honestly about how you feel about the whole thing and I think it's likely he either will decide not to go or you'll decide you're ok with him going.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Yes this is 100% correct",
          "id": 25,
          "comments": [
            {
              "score": 0,
              "content": "Well has he told you why he thinks this is OK?",
              "id": 26,
              "comments": [
                {
                  "score": 1,
                  "content": "He said that he changed his mind and that he now wants to go ..",
                  "id": 27,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Yeah but has he explained why dumping all the work on you and you not getting to go is OK? I'm sure he does want to go, but I don't see why he thinks that has much to do with it...",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA for feeling that way. He didn't even want to go to the concert, but now that a ticket is available, he is willing to leave you with all the trip planning work? That is rude.",
      "id": 29,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. \n\nHe should help out with preparing for the trip. Best case would be you both pack and prepare in advance and then go to the concert.",
      "id": 30,
      "comments": [
        {
          "score": 5,
          "content": "Indeed. She could ask him what his plan is for getting the prep for the trip done and see whether it even entered his head that he's got responsibilities he'll have to sort out before he thinks of doing anything else.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA - I get it because you originally wanted to go but because he didn't want to, you changed your mind and you guys didn't spend the money for **two** tickets. However, now he (who originally did not want to go) has an opportunity to go for free. \n\nDid he offer to let you take the ticket since you originally wanted to go? Regardless,  the cost would be less since you guys would purchase *one* ticket now instead of two, could you buy one ticket and join him? Is this a possibility, or is it completely sold out? \n\nI feel like as much as you want to go, it's best not to act on jealousy and find the best solution so you can both still enjoy the concert.",
      "id": 32,
      "comments": [
        {
          "score": 2,
          "content": "It is not for free if he goes now, he still has to pay! \nAnd I can't join if there even was the possibility for a ticket because someone has to take care of the kids... Two years ago my mum would have taken care of our son, and it's sold out.\n\nWhen we discussed this today he did offer me to go, but somehow it didn't feel like he really wanted that.",
          "id": 33,
          "comments": [
            {
              "score": 3,
              "content": "I would let him go, then he would 'owe you one'...promise to take you to another concert together....and make sure he does all his/kids  packing beforehand.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Hmm, it is a difficult situation because it seems like now you *both* want to go, but feel bad about it since there is only one ticket. He might have realized after 2 years of a pandemic that he misses concerts and wants to attend one. \n\nI feel like to be \\*fair\\* neither should go, but you shouldn't hold your S/O back from having fun, do you know what I mean? It will feel crappy for the night but at least one of you gets to enjoy it instead of neither. I'm glad he still tried to offer it to you (even if deep down he wants to go too). I wish there was a way for you to both go!",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "But you don't really want him to go! That's exactly the same situation in reverse, if you shouldn't go because he doesn't really want you to, then he shouldn't go because you don't really want him to. And it sounds like you have the greater claim to the ticket because you wanted to go originally.\n\nAlso, can whoever goes help do a lot of the packing in advance?",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFirst of all, I'm on mobile and non-native english speaker.\n\nSo in early 2020 there was a concert, to which a group of our friends wanted to go (tickets were sold pre covid, then the concert got delayed due to covid). It is an expensive concert, but I really wanted to go there at that time. My husband didn't want to go, and after thinking about it I didn't want to go without him, so we decided not to buy tickets... \n\nFast forward to today, the new date for the concert is next Saturday, and one friend who originally wanted to go can't go anymore. My husband was offered the ticket, and now he wants to go to the concert. \n\nI don't want him to go, as it is one day before we go to our family vacation and we have a lot of things to prepare (we have to kids 3 years and 9 month old, so I can't do any of the packing alone) and also because originally I was the one who wanted to go. \n\nBut I feel like I might be the A-Hole here if I tell him that I don't want him to go...\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 37,
      "comments": [],
      "relation": "No"
    }
  ]
}