{
  "post content": "I’m currently in a relationship with my Gf of 4 years, and she has a daughter (we’ll call Susie) who is 7 years old, who we share with her Dad every other week. Recently we found out through the new Gf of the dad (through social media, mutual friend who makes shirts) that they had “Family shirts” done for a Disneyland trip. So we ask Susie, “why didn’t you tell us you were going to Disneyland?” out of genuine curiosity. And she looks at us confused has no idea what we’re talking about. \n\nFast forward a month or so, we pick up Susie from school on the beginning of our week, and she’s going on about how much fun she had at her Grandmas house. During a school week. We then found out that the Dad, new GF, and 2 sons, had gone off on a Disneyland trip with out his ACTUAL daughter, during the school week, and couldn’t even let us have her a day early, (but that’s not that important). The 2 sons, are from the new GFs previous relationships, no way related to the Dad. We ask Susie why didn’t they take her too. And she says because then it would be an odd number and not everyone can go on the ride at the same time (or some bull crap excuse like that). \n\nSometime during our week we’re in the car talking about this situation amongst my GF and I. Then Susie shouts, “they said they’re going to bring me back a gift to make up for it, and they’re going to take me next time”. I then say, “whether they bring you a gift or not, they still both suck for not taking you”. So then when she goes back on her week, she ends up telling her dad what I said, and honestly. I didn’t give a shit because I meant it. This if screwed up in my book, how do you exclude a little girl from a trip to Freaking DISNEYLAND. \n\nNext time we meet to exchange Susie, the dad walks up to my window and says I better keep my F****** mouth shut and stop telling my daughter bad things about him, and threatens me, and on and on. Granted, this is the first time I’ve ever said anything about the dad, because drama isn’t my thing. So I get out of the car, (because I ain’t no bitch and am size-ably larger than him, just in case if had to hold my own ground, ididnt want to have to defend myself from the seat of my car) and just explained I wasn’t lying, and asked him man to man, in front of his daughter and my Gf, “Why couldn’t Susie go with you guys to Disneyland?” He had a couple of excuses. That it was his new GFs sons first time going, and they wanted it to be about them, not that my GFs daughter couldn’t go, but because she wouldn’t have enjoyed it as much as someone who hasn’t been there before. He then also said, because she had already been there with us that she didn’t need to go this time (we had taken my GFs daughter to Disney land, the 3 of us, about 2 years ago). He then keeps going back to how he never talks bad about me (even though they do) and that he’s a good dad and that he doesn’t suck. The exchange never escalated past some mild shouting, and both parties left. \n\nMy GF is annoyed that the situation didn’t need to happen, but does agree what the Dad and New GF did wasn’t okay. So, AITA for being honest in front of the daughter and saying her dad and “step mom” sucked. \n\nTLDR: Child gets excluded from Disney land family trip (Dad, Step mom, and step moms sons go, but not his biological daughter) I tell her that her Dad and Step mom suck. Dad attempts to confront me in person, but then put him on the spotlight in front of daughter, and explains that they have another trip planned for her in the future. Also says since we’ve already taken her to Disneyland, it’s okay she misses this trip. Dad claims I’m manipulating daughter, but have never said anything about Dad before. Gf gets annoyed, but agrees with me. ",
  "id": 1,
  "comments": [
    {
      "score": 153,
      "content": "NTA. looking at the comments this is apparently an unpopular opinion but I think you're not the asshole. That little girl deserves to have someone sticking up for her and not let people get away with treating her shitty. If everyone acts like what her dad did was fine she is just going to think this is how she deserves to be treated. You stood up for her and let her know she's right to be upset and she has someone who cares enough about to get to not let people get away with being shitty to her. ",
      "id": 2,
      "comments": [
        {
          "score": 26,
          "content": "That’s all it really comes too, the fact that the daughter was upset, but was okay with it. Any other family trip “might” be acceptable, but Disneyland, the place where dreams come true, gets taken away from you for no reason at all. Still kills me. ",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Agreed NTA. \n\nIt starts with her being excluded from Disneyland and it'll escalate to school fees, family dinners and a whole lot worse. Better you made it clear that it shouldn't happen, she isn't second to any other kids in the picture and you won't let it happen. \n\nAlso \"because I ain’t no bitch\" made my day ahahha. ",
          "id": 4,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Agreed, NTA. Thank you for having this little girl's back.",
          "id": 5,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Everyone is a psychologist & behavioral expert in these threads. With an unhealthy amount of fake internet moralism.",
          "id": 6,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 152,
      "content": "ESH- While the Dad does suck very much, you should show a little more tact when talking about a kids parents in front of them. Not that you weren't completely justified.",
      "id": 7,
      "comments": [
        {
          "score": 2,
          "content": "Yup - ESH. Not your place to talk poorly about her dad. Custody is shared, this man is someone you’re going to have to interact with, and, current situation aside, we don’t know that he’s a bad father. If you can’t speak well of him in front of Susie, don’t speak of him at all.",
          "id": 8,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 82,
      "content": "YTA. Seriously, wtf is wrong with you?? She’s SEVEN. And you’re gonna try to make her feel like complete crap and try to poison her against her own father in the process? \n\nYou are way out of bounds. First off, this is really none of your business in the first place.  Second, if you had something to say then you should have spoken to the adults in the situation (who probably would have told you to mind your business) but leave the kid out of it. \n\nIf you have any intention of being a half-decent stepparent, you need to learn lesson #1. You do not talk shit about the biological parents to the children. Ever. Especially not over something as petty as a Disneyland trip. \n\nThis really angered me. I think you have a lot of growing to do. ",
      "id": 9,
      "comments": [
        {
          "score": 169,
          "content": "While I’d usually agree with you about my shitting on bio parents... I don’t here. \n\nFirst, The stepdad isn’t trying to poison the relationship with the father. The father did that when he excluded his own daughter from a trip to Disney land. \n\nSecond, the daughter needs to know that this kind of behavior isn’t okay. If no one stood up for her/told her that the dad’s actions are wrong, she would accept it as normal. And that’s NOT normal. Allowing her to think that being excluded by her father is normal sets her up for major boundary issues in the future. No one told me the shit my extended family said to me was wrong to “keep the peace” and I ended up letting people walk all over me as a teenager because I thought that was acceptable behavior. \n\nThird, it is his business. If he’s been dating the GF for 4 years and she’s 7, hrs been involved in the daughter’s life since she was three. Given he himself took her to Disney, it obvious he plays a parental role in this girl’s life. Parental figures need to stand up for their children, even if they’re step-kids. \n\nOP doesn’t seem to be using the kid as a weapon in the divorce. He seems to genuinely care about this child and is upset that her father is treating her like shit. I don’t love how he handled the situation, it was kind of immature, but his heart was in the right place and he is NTA. The bio dad is. A trip to Disney as a 7 year old isn’t petty. That’s a big deal and she was excluded from that, which I’m sure would make her feel excluded from the family. ",
          "id": 10,
          "comments": [
            {
              "score": -8,
              "content": ">Second, the daughter needs to know that this kind of behavior isn’t okay. If no one stood up for her/told her that the dad’s actions are wrong, she would accept it as normal.\n\nThere are better ways to handle it than telling her her daddy sucks.  How about \"sweetie, I'm sorry your feelings were hurt.  We'll talk to your dad and try to make this better.\"  That way she knows her mom and OP are sticking up for her, without making her feel like she has to pick sides between her parents.  ",
              "id": 11,
              "comments": [
                {
                  "score": 13,
                  "content": "I agree, wording was not great. I don’t love how he handled it. But I don’t think wording it poorly makes him an asshole. ",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 121,
          "content": "I’m a kid of divorce and my folks used me as a weapon to each other.  That sucked.  But if I did have a Step-dad and he stuck up for me when my dad was being shitty, I would have felt like a million dollars.  I’m not saying anyone is right, it’s a screwed up situation, but kids get things a lot more than adults give them credit for.  I hope that little girl gets that he gives a shit about her and will stick up for her.  And I hope the shame of what he did makes the dad act right from here on out.",
          "id": 13,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Don't you think if no one had stood up for her she would have just thought this is how she deserves to be treated because no one cares to say her dad was wrong? I wish I had someone to validate me when I was a kid and my parents would do shitty things, to let me know it wasn't my fault and I didn't deserve it. If every adult in her life acts like it's ok she's going to think she's wrong to be upset.",
          "id": 14,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I agree with some of what you said, and then there is the part where you said it’s not his business. WRONG!!! Totally his business. I mean if the guy is in a relationship with kids and step parents in the picture, it just means it is super complicated and he has to be extremely careful and smart about his actions. I agree that he is totally the asshole for dragging his step daughter into a very complex and complicated situation, but it is completely his issue. He has to deal with the biological dad and his SO. I think you are right it was immature to drag the girl in but he has every right to be a part of the argument, including straightening out the dad when he fucks up, he just needs to not drag kids into it. ",
          "id": 15,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "By this logic if tell someone there spouse is cheating on them I'm in the wrong because I'm gonna make that person \"feel like crap\" and \"poison them\" against there spouse, this is some grade A bullshit",
          "id": 16,
          "comments": [
            {
              "score": -3,
              "content": "That’s a false equivalency. Most people’s spouses aren’t impressionable seven-year-olds. If they are, you have bigger problems than infidelity. \n\nThere’s nothing positive that comes from making a small child feel like her dad doesn’t love her. In fact, parents have lost custody battles over doing petty crap like this. Someone else explained the concept of parental alienation somewhere in this thread but it got downvoted and buried for some reason. ",
              "id": 17,
              "comments": [
                {
                  "score": 4,
                  "content": "There is also nothing positive with not informing a child of what bad or favoritist behavior is and how the person is how acts in such manner is a dick. \n",
                  "id": 18,
                  "comments": [
                    {
                      "score": -3,
                      "content": "What are you even saying? There’s tons of damage that comes of it. Do you have any idea how damaging it is to a child’s self-esteem and sense of worth when you imply that her father is a bad person who doesn’t care that much about her? Wtf is the kid even supposed to do with that information? I really hope you reevaluate your position if you have/plan to have children. ",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "I agree that he should have spoken to the father away from the children and not bad mouthed the dad in front of her but seriously the dad sounds like a demonstrable asshole. Leaving your own daughter behind on a trip to Disneyland? Gotta be a pretty shitty father to think that is ok. \n\nAnd for the record it is definitely his business if he is now helping to raise the kid, biological father or not. I actually think he was right for calling the father out on it, just not in saying something to the kid",
          "id": 20,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yeah if her dad wanted to pursue parental alienation against her mom he could.  If he ever wants more custody or something he could bring up moms boyfriend talking bad about him to his daughter.  A one time comment isn't a huge deal legally but if he keeps doing it it very well could be.",
          "id": 21,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -10,
          "content": "My stepdaughter no longer legally has a father because his rights got terminated when she was 2 following some sort of child sex offense.  Even still, I am noncommittal when she brings him up.., I couldn’t imagine telling her “your real dad is a kiddie diddler” or, as in this case, “your real dad sucks.”",
          "id": 22,
          "comments": [
            {
              "score": 5,
              "content": "Err.... no, please inform your child of pedophiles, and how to protect themselves/other kids and future children. WTF ",
              "id": 23,
              "comments": [
                {
                  "score": 1,
                  "content": "I can tell her that without talking about her biological father.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 1,
                      "content": "[deleted]",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -14,
          "content": "I'm pretty sure this might count as parental alienation IANAL but I think it's also illegal",
          "id": 26,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 55,
      "content": "ESH.\n\nDon’t put parents down to kids if at all avoidable. If she was upset and you agreed that it wasn’t fair and you don’t know why they’d do that to her... okay. But to talk about dad in front of her and insult him is so not okay.\n\nAnd then to get into a shouting match with dad in front of her? Also not okay.\n\nHe’s HORRIBLE. I’d be raging too. But you can’t rage to or in front of her. You can validate her if she’s upset. You can press her mom to tell dad how bad that was. You can love and support her daughter. But don’t blow up in front of the kid.",
      "id": 27,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 49,
      "content": "ESH. You can support your girlfriend’s daughter and make her understand that the way she is being treated isn’t okay without escalating things and causing more drama for your girlfriend.\n\nFurthermore, this can be seen as parental alienation and the courts can take away or lessen your girlfriend’s visitation time over it. You NEED to follow your girlfriend’s lead on this.\n\nBut seriously fuck that guy. Her ex sucks.",
      "id": 28,
      "comments": [
        {
          "score": 17,
          "content": "That’s pretty much the jist of it. I accept saying what I said in front of the daughter wasn’t very smart. But, excluding your own daughter and taking 2 new kids that aren’t yours, is what drove me to this happening. I actually even offered to pay for her ticket if that was the problem. He declined. ",
          "id": 29,
          "comments": [
            {
              "score": 2,
              "content": "Because for him it’s about pride.",
              "id": 30,
              "comments": [
                {
                  "score": 6,
                  "content": "That, or his new gf was in his ear about not taking her. I'd bet it was at least partly that. But that's just speculation. Idk.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Probably both.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 33,
      "content": "YTA. Though your irritation is justified it is absolutely not your place to tell a 7 year-old that her dad sucks, especially when she’s not even yours. Express it to your gf, but don’t put the kid in the mix. ",
      "id": 33,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 27,
      "content": "NTA, while it is very bad parenting to bad mouth a kids parents to the kids. You are right to stand up to them.  They should not have excluded her and one day she'll remember that you stood up for her when shes old enough to understand the situation. Kudos, but try not to bad mouth her dad, it's like saying half of her is bad. ",
      "id": 34,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 19,
      "content": "ESH\n\nEven if the guy is an asshole you don’t need to further alienate him from his daughter.",
      "id": 35,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 16,
      "content": "ESH. I felt that they did suck but you don’t say that in front of the child (because children are snitches) I felt that confronting him was a good idea but a “why didn’t we get [name of daughter] then” (depending how far you guys live from each other school could be a non factor but if given enough time you could still take her out of school so that it’s still a vacation for you daughter.) standpoint because  unless the biomother agreed that the daughter could stay with the grandma because  in my experience I would rather have my mom than my grandparents(nothing against them but I didn’t get to see my mom all too much hell even if I did I would still rather my mom)This conversation  can be turned to a conversation about not taking her to Disneyland depending . And it’s fucking Disneyland the more the merrier wtf the dad and stepmom thinking ",
      "id": 36,
      "comments": [
        {
          "score": 2,
          "content": "Thank you. For last sentence",
          "id": 37,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 16,
      "content": "YTA, but only a little bit. Fuck that scumbag who doesn't even know the meaning of father, but you can't bring her into that. Poor kid is already going through enough, you've got the INCREDIBLY tough road of being the better man. You can do it though, I believe in you",
      "id": 38,
      "comments": [
        {
          "score": 3,
          "content": "Appreciate this a lot. Honestly. ",
          "id": 39,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}