{
  "post content": "Sorry for formatting, am on mobile.\n\n\nI (16M) am diagnosed autistic and have been for around ten years now. I’m currently living with my mom, stepdad, and two sisters who are 12 and 7.  The 7 year old is the only one referenced in this post, so we’ll call her M.\n\nSo because I am autistic, I get overwhelmed fairly easily and often have to do some form of stimming, such as flicking my hands or playing with a small toy, to calm down. Recently I found a weird squishy thing laying around the house that I really enjoy using. It’s one of those balls with holes in it and a sac of little colored balls that come out of the holes. I can’t paste a link here because of character limits, but just Google “orbeez mesh ball”. The thing is, it’s painted to look like some sort of green spider, and it’s got a fairly realistic spider body hanging off of it.\n\nNow this wouldn’t be a big deal, but it is as we’re pretty sure M has a few issues of her own (she was in the process of being tested for autism as well but we have to wait due to COVID). Relating to that, she’s got a lot of anxiety about certain things. Mostly bugs.\n\n... I’m sure you can see where this is going, right? Today, I had the spider thing laying on the couch next to me while I was doing schoolwork, which at times will leave me a bit overwhelmed if I get stuck, so I had it there for easy stim breaks. M came in, sat on the floor, and started watching TV. She didn’t notice the toy up until I started squeezing it. \n\nIt makes a little noise when you squeeze it, so she heard it, looked over, saw only the spider body hanging out of my hand, and began crying and screaming for our mom (she’s usually the only one able to calm her during the meltdowns). Our mom came running in to comfort her and I got up with my stuff and left the room, because loud noises and shouting also overwhelm me and it was getting pretty loud in there.\n\nFast forward a few hours, my mom comes in my room and she’s clearly upset. I asked her what was wrong and she exploded about how I “purposely triggered my sister with a disgusting fake bug”. I didn’t even understand that she was talking about the spider toy until she grabbed it from my table and insisted that I give it up to her.\n\nI basically told her, that’s mine and it helps me calm down. I forgot about M’s anxiety. I love my sister, I would have never done something on purpose to upset her. I won’t use it in the room with M again but no, you can’t take it from me. She yelled at me a bit for being “disrespectful”, but eventually left it when she saw I wasn’t going to give up my toy. \n\nIt’s been another hour since, and her and my stepdad (who I assume was told the story by her) have both called me an asshole. My other sister (who heard it from me) said she doesn’t think I was an asshole per se, but I still should have just given it up.\n\nSo, was I an asshole?",
  "id": 1,
  "comments": [
    {
      "score": 48,
      "content": "NAH  Ask your parents for a less spidery orbeez replacement.",
      "id": 2,
      "comments": [
        {
          "score": 14,
          "content": "Yes this! Especially since this is something that it sounds like she just recently found. That means there's no real sentimental attachment. Just get a different one that does the same thing and doesn't freak anyone in the house out. NAH",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I have a unicorn one, it was under $5. Extremely easy solution.",
          "id": 4,
          "comments": [
            {
              "score": 2,
              "content": "Where can I find an animal shaped one? I just googled mesh orbeez ball and I can’t come up with cute ones :( but I feel like these would help my anxiety and stress",
              "id": 5,
              "comments": [
                {
                  "score": 1,
                  "content": "I got it in store at a store that's now closed down. I'm sure ebay or Amazon will have them. I just googled water ball squishy ball and some frog ones and space ones came up. Good luck!",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "https://www.ebay.com.au/itm/193733851725 here's a narwhale one - they're the unicorns of the sea.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 1,
                      "content": "God bless your soul. Thank you so much!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "Cant you order one of those balls without the spider?",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "_Soft_ YTA\n\nNot for using the toy of course, you didn't know and it was a unfortunate accident. \n\nThat being said, _knowing_ that your sister has some similar issues, you shouldn't use it where she can see. You mentioned leaving the room when she started yelling, because it's triggering for you. Now pretend your sister now uses yelling every time as a way to calm herself, even though it's upsetting to you. It would be difficult for you to be around her not knowing if she would yell. That's how she feels: it's uncomfortable for your sister not knowing if she is going to come across that bug ball thing. \n\nI would talk to your sister and apologize for unintentionally upsetting her, and explain it is something that helps you feel better. Ask her if you promise to keep it in your room, if she can handle that. Even better, go get one without a bug on it! \n\nI don't want to assume you have difficulties with empathy, but this is a perfect situation where empathy is valuable; being able to put yourself in your sister shoes can help you see that keeping your ball might be more trouble then it is soothing.",
      "id": 10,
      "comments": [
        {
          "score": 8,
          "content": "I did tell my mom that I wouldn’t use it in the room with M anymore, but I think at this point I’m just going to listen to everyone else in this thread and get a ball without the spider. Thanks for the advice.",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NTA - as long as you’re not using it around her I don’t see what the problem is? \n\nConsidering you explained yourself to your mother I’m inclined to say your parents are TA’s if they actually called you an asshole.",
      "id": 12,
      "comments": [
        {
          "score": 1,
          "content": "My stepdad did, but to be fair to my mom she never actually said “asshole”.",
          "id": 13,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA. Your parents both unfortunately jumped to one conclusion without even hearing your side of the story. If they had, perhaps they would have realized the misunderstanding and elected to get you a similar stim toy that wasn’t themed as a bug because that’s the obvious solution. Yelling at you and possibly triggering your anxieties was never going to solve anything, but in their defense tensions are running high everywhere this year. So hopefully you can all get it worked out.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. Those balls are very cool, and they come in all kinds of different shapes. Maybe your parents can buy a set for you and a set for your sister that won't scare her. Think unicorns or teddy bears.",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 16,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSorry for formatting, am on mobile.\n\n\nI (16M) am diagnosed autistic and have been for around ten years now. I’m currently living with my mom, stepdad, and two sisters who are 12 and 7.  The 7 year old is the only one referenced in this post, so we’ll call her M.\n\nSo because I am autistic, I get overwhelmed fairly easily and often have to do some form of stimming, such as flicking my hands or playing with a small toy, to calm down. Recently I found a weird squishy thing laying around the house that I really enjoy using. It’s one of those balls with holes in it and a sac of little colored balls that come out of the holes. I can’t paste a link here because of character limits, but just Google “orbeez mesh ball”. The thing is, it’s painted to look like some sort of green spider, and it’s got a fairly realistic spider body hanging off of it.\n\nNow this wouldn’t be a big deal, but it is as we’re pretty sure M has a few issues of her own (she was in the process of being tested for autism as well but we have to wait due to COVID). Relating to that, she’s got a lot of anxiety about certain things. Mostly bugs.\n\n... I’m sure you can see where this is going, right? Today, I had the spider thing laying on the couch next to me while I was doing schoolwork, which at times will leave me a bit overwhelmed if I get stuck, so I had it there for easy stim breaks. M came in, sat on the floor, and started watching TV. She didn’t notice the toy up until I started squeezing it. \n\nIt makes a little noise when you squeeze it, so she heard it, looked over, saw only the spider body hanging out of my hand, and began crying and screaming for our mom (she’s usually the only one able to calm her during the meltdowns). Our mom came running in to comfort her and I got up with my stuff and left the room, because loud noises and shouting also overwhelm me and it was getting pretty loud in there.\n\nFast forward a few hours, my mom comes in my room and she’s clearly upset. I asked her what was wrong and she exploded about how I “purposely triggered my sister with a disgusting fake bug”. I didn’t even understand that she was talking about the spider toy until she grabbed it from my table and insisted that I give it up to her.\n\nI basically told her, that’s mine and it helps me calm down. I forgot about M’s anxiety. I love my sister, I would have never done something on purpose to upset her. I won’t use it in the room with M again but no, you can’t take it from me. She yelled at me a bit for being “disrespectful”, but eventually left it when she saw I wasn’t going to give up my toy. \n\nIt’s been another hour since, and her and my stepdad (who I assume was told the story by her) have both called me an asshole. My other sister (who heard it from me) said she doesn’t think I was an asshole per se, but I still should have just given it up.\n\nSo, was I an asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 17,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "NTA. She shouldn’t have said you purposefully did it but it did upset your sister so maybe you can work out a middle ground. \n\nCan’t you get the same toy but without the spider?",
      "id": 18,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": -2,
      "content": "NTA.\n\n>... I’m sure you can see where this is going, right? \n\nYes, and so should your mom have done, whether she's neurotypical or not. \n\nEveryone makes a thoughtless mistake every now and then that fails to take into account someone else's feelings. Having autism makes you more likely to make these mistakes, which the people you live with should also know. It's not like you were waving the toy at her, your purpose was innocent. So too was your poor sister's reaction. \n\nYou overplayed your hand in telling your mother what she couldn't do in her own house: She most certainly can take whatever she wants from you. I imagine she gave you the benefit of the doubt, and took you instead to mean \"It would be a really bad idea to take this from me over this\", which I think it would've been. \n\nIt would have been more appropriate for others to give you the opportunity to apologize for accidentally hurting her feelings, instead of skipping straight to denouncing you. If this hurt your feelings, it would be good to tell them that. \n\nConsider apologizing to your mother for backtalking her. Definitely apologize to your sister for frightening her with the toy. The holiday season is coming, maybe you can buy her one to give to you as a two-way peace offering... one that doesn't look like a giant horrible arachnid :)",
      "id": 19,
      "comments": [
        {
          "score": 1,
          "content": "A child defending themselves isn't \"back talk\". Kids have every right to defend themselves especially when the parent is clearly siding with the other kid. Kids have their own feelings and needs and they don't always match the parents. He doesn't have to apologize because he didn't \"back talk\"",
          "id": 20,
          "comments": [
            {
              "score": 0,
              "content": "\"You can't take this from me\" is factually incorrect and puts mom in the position of either proving it or backing down from a child with an ultimatum. Neither's a good option",
              "id": 21,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}