{
  "post content": "My twins (both 11m) have started this thing on the weekends where they wake up at the ass crack of dawn and wake me up because they’re hungry. Most of the time, I get up and make them food but sometimes (like today) I don’t feel very well and I tell them to make themselves some cereal, make something microwaveable, or grab a snack until I fully wake up. (I’m a slow riser— I can’t just get up and go) They refuse and keep demanding I get up and make them food. My partner believes that I’m in the right when I do this and that they’re 100% capable of feeding themselves. While I’m honestly not sure. I understand that eating something cooked by your mom is special and an act of love and maybe that’s why the boys are so pushy about it. I admittedly have a hard time finding the line between coddling my kids and pushing them to have more independence. So that is why I’m here, looking for outside opinions.\n\nAdding a little edit: Had a talk with the kiddos. They were jealous that my sister does big buffet style breakfasts on the weekends when they stay over. I explained that she does that because 1.) They’re there and 2.) Her kids are still small and NEED their mom to make them breakfast. They apologized for being A-holes. They’re sick and not feeling good and wrongfully took those feelings out on me. I appreciate some of the tough love I’ve got and got some inspiration on how to discuss this with them and I even appreciate the big AHs taking jabs at my parenting. I’m not perfect and there’s definitely things I can do better and now I feel happy with the outcome of this. We’ll see how next weekend goes.",
  "id": 1,
  "comments": [
    {
      "score": 6668,
      "content": "NTA, 11 is a great age to start letting your children make their own decisions, learn to take care of their own needs, and take just a little work off your shoulders. It’s normal for them to push back, but as they grow older they’ll become more independent if you set them on the right track. Good luck!",
      "id": 2,
      "comments": [
        {
          "score": 3758,
          "content": "Thanks, u/ButtPlugJesus <3",
          "id": 3,
          "comments": [
            {
              "score": 2268,
              "content": "There’s a phrase I never thought I’d read",
              "id": 4,
              "comments": [
                {
                  "score": 598,
                  "content": "[removed]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 337,
                      "content": "It’s amazing how the association with a simple name like u/buttplugjesus can warp such an innocent comment.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 242,
                      "content": "My 5 and 4 year olds can get cereal and snacks for themselves.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 46,
                      "content": "My 18mo ‘helps’ feed the dogs. I can’t wait until he gets the hang of it properly - one less chore for me 😂",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 28,
                      "content": "Exactly, my 6 year old knows how to make scrambled eggs.  This isn't rocket science...",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "My six year old feeds himself, too. I have healthy snacks he can reach. He can eat those anytime he wants.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "My six year old will make himself a sandwich. He likes to asks first. But he likes to do it. \n\nNow if he would just put his dishes in the sink…",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "My 6 year old does the same. Lets the dogs out, feeds them, grabs a bar or something and has a full breakfast an hour or so later when we get up. It’s kind of great.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I could make a hot whiskey at 5. By the time I was 7 I was feeding myself and the horses",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Hell, my two year old has her \"snack cabinet\" she can go to when she's hungry. Obviously we don't let her have complete free-reign, but it definitely is helping her be more independent.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Hm. Bot?",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 287,
                  "content": "I think it's worse realizing it was posted by u/pussyandbananabread",
                  "id": 16,
                  "comments": [
                    {
                      "score": 104,
                      "content": "Sounds yeasty",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 38,
                  "content": "Right?  Yet a phrase that needed to exist.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "But you thought you’d read u/pussyandbananabreaw?",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "r/brandnewsentence",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "The “u/“ adds so much",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Me neither 😆",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 368,
              "content": "At 11, they should be able to make themselves an egg and toast or something like that. \n\nHell, I was in cooking and baking competitions at that age. \n\nI think it's time they learn to cook actual food. It's a great skill for kids. I hated it when I was younger, but I'm super grateful as an adult.",
              "id": 23,
              "comments": [
                {
                  "score": 148,
                  "content": "OP says in a later comment that they aren't allowed to use the stove. So, as she's gatekeeping their abilities to fend for themselves, I would say that it falls squarely on OP's shoulders. She won't let them cook, but then gets upset because they wake her to cook for them. Classic catch-22.\n\nAt 11, the sky was the limit pretty much in my house. Both my brothers and I were savvy enough to make just about anything our little hearts desired.\n\nOP - YTA. They are acting this way because of limits you placed on them. Make it right.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 658,
                      "content": "There are still toasters, microwaves, air fryers and refrigerators in kitchens. If she doesn’t want them using the stove, they can have toast, bagels, cereal, etc.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 336,
                      "content": "It’s great that you were able to freely use the stove at 11! So was I! But I definitely know some children who at 13 I would 100% NOT trust to use the stove unsupervised. We don’t know if OPs children as individuals ought to be allowed to use the stove and as their parent, OP is the one who has to make that call. \n\nThe kids could easily make themselves some cereal, pop tarts, or toaster waffles or something to hold them over until OP makes breakfast. It feels like a stretch to say there are any AH here because it’s pretty trivial.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 120,
                      "content": "They can make cereal, toast, sandwiches....stop acting like there's a lock on the fridge. Nobody is \"gatekeeping\" the 11 year old children from preparing themselves a snack before OP wakes up.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 85,
                      "content": "Umm my 9 year old absolutely cannot use the stove. He can microwave the sausage egg and cheese croissants, or Jimmy dean biscuits, or pop tarts, or cereal and milk, or muffins, bagels, or a peanut butter sandwich, or ham and cheese sandwich, or a pack of raisins, or anything else in the house. \n\nI’ll make brunch with eggs to order, bacon, homemade biscuits, and gravy. When I wake up. \n\nI’m rested. You’re fed. We all live. \n\nOp, NTA!",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 70,
                      "content": " Why do they need a stove to make breakfast? You really think two 11 yos who refuse to pour cereal are suddenly going to whip up some pancakes?",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 41,
                      "content": "There are a ton of other forms of food for breakfast that don't involve the stove.  While it's time to start learning, not using a stove isn't a boundary to making a breakfast.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "I don’t know, I think the rules she’s set down are a fair compromise. I’ll cook breakfast for you when I wake up, but if you get up before the time we’ve agreed on, there are plenty of options besides using the stove. Not wanting your preteen to use the stove unsupervised isn’t “gatekeeping,” it’s sensible parenting, if OP knows her own children. Plus, it’s kind of a parent’s job to “gatekeep” in the sense that she can decide what they can and can’t do.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "There's cereal. Toast. a bagel. English muffins. There's HB eggs in the frige. I didn't want my kids using the stove while I was asleep. Though I will make an exception for the induction burner but there's something about fire shooting out of an appliance + my kids that doesn't sit right with me lol",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 22,
                      "content": "Gee, at age 11, I could cook three full meals a day and make cookies, candies, and pastries. I helped with canning too. \n\nOP, teach those kids to cook!",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "At the age of nine I learned how to make fried bread. I loved fried bread and made it all the time till I tipped a frying pan of hot fat on my hand. Eleven is a fair bit older than nine but I totally get not using the burners unsupervised (including parents still asleep). \n\nLoads of breakfast can be made without it. I live in the land of the morning fry-up (the U.K.) but I don’t eat it every damn morning…",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Agree, I was also cooking dinner by the time I was 10/11 and that they need to learn to cook. OP should have slowly taught them to be independent earlier",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I was the youngest, and by 11 I could definitely cook for myself. We even had a really good children's cookbook.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Try teaching a preteen with ADHD how to cook.... oy vey! He can just about manage an egg and leaves the kitchen looking like a nuclear bomb site!!",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "This, the youngest contestant on Junior MasterChef Australia was 9 years old, most were 10-12 years",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "I was getting the bus to the shops for ingredients....",
                  "id": 39,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "glad to see /u/ButtPlugJesus and /u/pussyandbananabread getting along so well :'))",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "Breakfast Snack Station! Which they get to help set up the night before (and advance to setting up). Gameify it! They get points for using the station, more points for setting it up, still more points for clean up afterwards. With enough points they Level Up and can choose a different ingredient / option, next level is adding a Skill they're allowed to develop eg boiling / frying their own eggs. The jackpot of points is bringing you your desired coffee / breakfast in bed. LET THE BREAKFAST GAME... COMMENCE! \n\n(Also children of that age have a strong sense of fairness so they should totally be engaged in creating the rules and points system. This could last two years if you're lucky.)",
              "id": 41,
              "comments": [
                {
                  "score": 46,
                  "content": "Jesus, this sounds exhausting",
                  "id": 42,
                  "comments": [
                    {
                      "score": -4,
                      "content": "Welcome to childrearing…",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "have you ever had children? If I did this they'd eat it all by the end of the first day and there woudln't be anything left lol",
                  "id": 44,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Yes, mine would too.",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Give it a couple of years and they won’t surface til\nNoon",
              "id": 46,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "I agree that this age is perfect for learning to do something on your own around the house, specially make yourself breakfast or some snack. I would recommend to make an agreement for example that if you are awake you would gladly make them breakfast, but if you're still sleeping or not entirely awake they will do breakfast themselves. And for beginning they can do the breakfast with you, they'll learn where everything is in the kitchen and how to safely operate.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "r/rimjob_steve",
              "id": 48,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "💀",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Lol you just wanted to say Butt Plug Jesus",
              "id": 50,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Plus, it is an act of love to cook WITH them and teach them how to cook. They should cook one meal a week by the time they are 13.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "I was making my own tea at the age of 7.\n\nMind you, looking back, I probably could have used some supervision, considering I used to put 4 teaspoons of sugar and have 6-12 biscuits every morning.\n\nBreakfast is one of those things that a kid can at least make a basic version of fairly young. Perhaps not eggs, beans, sausages, or anything that requires use of the stove. But cereal, toast, tea, and a load of other breakfast items can be done",
          "id": 52,
          "comments": [
            {
              "score": 51,
              "content": "At eleven most kids should be able to safely use a stove and fry some eggs.",
              "id": 53,
              "comments": [
                {
                  "score": 22,
                  "content": "Depends on the stove. Ours is gas and our kid didn’t respect it enough and wasn’t careful enough about making sure it was off. So no stove for him until he was older.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 0,
                      "content": "With all due respect, that's not an issue that \"depends on the stove\". It's an issue that depends on your kid.",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "My now 11yo made me a steak and egg breakfast for Mother's Day this year. He is 11 now but his birthday was over the summer, so he was only 10 on Mother's Day.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Safely, yes, but I don't think I'd personally be comfortable with a kid under 14 or 15 using the stove/oven unsupervised. Like, are they probably gonna burn the house down? No, but I'd prefer to at LEAST be awake, alert, and in the other room in case something happened or they needed help. I was a sophomore in high school before I was allowed to use the stove/oven while home alone, which was the year I was 14 turning 15. I feel like that was a very reasonable age, and I was honestly a rather mature kid. Though of course whether or not kids are allowed to use the stove in these situations depends on the family and child themself. Either way, OP is NTA. If the boys aren't allowed to cook, or haven't been taught to yet, there's always cereal, waffles, fruit, granola bars, microwave food, etc.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Age 11 is good for pancakes or French toast as well! My kids were delighted when I taught them how to make those.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "I did this with my kids.  My MIL was horrified when she discovered that my 7 year old male knew how to cook.  How dare I corrupt the male!!  I'm pleased to state that all of my kids now can cook, keep house, do laundry, handle yard work, general maintenance and basic car maintenance.  AKA - Life skills.",
          "id": 59,
          "comments": [
            {
              "score": 26,
              "content": "I will never understand why people keep thinking cooking is a woman's job.  I think the existence of people like Gordon Ramsey would have put a stop to that a long time ago.",
              "id": 60,
              "comments": [
                {
                  "score": 33,
                  "content": "Money making chefs are allowed to be men. Domestic labor cooking can only be done by women.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Which is the pure definition of a double standard.",
                      "id": 62,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Money making chefs are men.  Ftfy\n\n:(",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "Damn straight, weekends were \"here's some Pop tarts, waffles and cereal. Figure it out or starve or wake me and be grounded and starve.\n\nBut hey it led to my kid developing a love for cooking, he was BBQing at 12 for the family...with minor supervision...and now at 15 with none.",
          "id": 64,
          "comments": [
            {
              "score": 2,
              "content": "I didn’t really enjoy cooking until my 30s. But as a kid, it was in my best interest to get food for my sister and I and hustle on down to the basement for some cartoons, because waking our parents up meant they would get a jump on whatever boring adulty crap they wanted to do that day.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Agreed. My stepson is 7 now, 6 when we started with this, and he wants to make his own breakfast. We agreed I put a bowl and a spoon on the counter and he can make his own cereal. When I was in my 1000th month of pregnancy this was great because his dad and I could sleep a bit longer. Now, when my 1 year old is awake I am also awake. This is usually around the time my stepson wants to watch his television shows (he is only allowed to watch them in the morning). So I am awake but he still makes his own breakfast because we are firm believers of letting our sons do their own things so he learns how to be self sufficient. Now it is breakfast but we hope this will help him later in life with other / bigger things. \n\nWe also have a special clock that turns from blue to yellow when it is his time to wake up and then he is allowed to go to the living room. Before that he came to our room every 15 minutes to ask if he is allowed to go to the living room already, starting at 5 in the morning. He was cranky all day because he woke up so early. The clock was kind of his idea and it changed everything.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "age 11, yes.  I first read that as 11 months, and my mouth was hanging open!",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Besides, they can feed themselves in the buttcrack of dawn, and you all can make brunch together when you wake up.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "NTA... but these are life skills you need to be actively cultivating now... \nMy kids are 11.5/9.5 and 4\nThey all could get themselves cereal and a glass of milk by 3. \nPut the milk in a container in the fridge with a spigot so there's no jug dumping and voila.\n\nYour kids need to figure it out, and I hope this isn't salty sounding at you.... we as moms always want to do what works best in our families, and all families are different. \n\nI'd spend some time figuring out what you want and expect of them as they are getting older and lay out some very clear rules and skills building to help them achieve what is age appropriate.",
          "id": 69,
          "comments": [
            {
              "score": 2,
              "content": "This whole array of responses is such a marvel of how different parenting is now from my childhood - in a good way!\n\nMy parents had rather sharp tones and elbows in the kitchen, and my mom *hated* us snacking, especially unsupervised (hello, disordered eating 🙃), so the bulk of my \"learning\" experience was being told to plan dinner, summoned to help cook it, then almost immediately getting shooed to dish duty. I'm excellent at dishes, good at conceiving a menu, and I *can* cook - some things very well - but it's something I dread most of the time.\n\nMy nieces - going on 12 and 14 - are allowed pretty free rein. The elder will make a whole jerk chicken dinner with sides and bake a cake almost entirely on her own, but with her adhd, requires more supervision, mostly on the cleanup front. They both need help with some knife work, and younger is more basic, but she's less likely to leave flour and other ingredients in inauspicious places 😂 I love that for them both so much, and reading through all of these kids getting similar experiences.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "My mom had to go back to work when I was 12 and my youngest sister was 3. I ended up the default babysitter. My mom expected me to feed her. No problem! Except her go to sandwich was cheese and pickle. I'm allergic to pickles and can't handle them. (It would make me nauseous just to be around the open jar.) So, I taught the three year old how to make the sandwiches and supervised from four feet away! On her next day off, my mom was astounded when this sister started making her own sandwich!",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "My son has been making his own breakfast of cereals, or toast, since he was eight. Now he’s ten he bakes cakes and all sorts. Your twins are being unreasonable.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1569,
      "content": "NTA \n\n11 year olds are perfectly capable of making their own breakfast. They should be quite independent by now, to be honest.",
      "id": 73,
      "comments": [
        {
          "score": 349,
          "content": "It's really not that difficult. My seven year old feeds herself and our cat while I sleep in.",
          "id": 74,
          "comments": [
            {
              "score": 109,
              "content": "Does she feed the cat with a knife and fork, or just fill the bowl?  If the former, that is truly impressive.",
              "id": 75,
              "comments": [
                {
                  "score": 144,
                  "content": "Haha, no, she just opens the bag and put the wet food on  a plate. But then she uses a -gasp- knife to make herself a sandwich.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 121,
                      "content": "She sounds like a wonderfully capable 7 year old, whose skills vastly exceed my attempts at humour.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "My son just turned 10 and he also feeds our cats as he makes himself breakfast - he even dispenses the older cat’s daily medicine at the same time: proud of himself he can get past the child lock cap on the bottle. \nThe only downside I’ve recently discovered is that he was classing a Nutella spread sandwich (also made with *gasp* a knife) as a fulfilling and nutritious breakfast… \n\nso we had words about that bit. \n\nOP - you are coddling those kids and also, tbh, they need some manners. Pestering and pestering even after you’ve said no to something is rude and at that age they definitely know it is.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I should teach my kid to feed our cats with a knife and fork lol",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I initially read that as “my seven year old cat feeds herself” and i was like yes my cat does the same 😂 Daily pet care (i.e., food, water, playing) is a great task for kids to have some independent responsibility! Also, depending on how vocal your cat is, doing morning food for kitty can be very fulfilling as you quell the incessant meowing lol",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Getting my son to remember to feed the cat is honestly such a battle. The cat cuddles him all morning! Doesn't take him to the bowl and meow, just waits until I get up.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Same. I wrote a long thing about my 7 year old managing her own breakfast for years but forgot that she also feeds the kitten most mornings, too! It’s not even that easy—she has to go get him a bowl, take him to my office, ONLY let him in while keeping the other cats out (they are too far to have access to kitten food lol), open a can, pour it out, and get back out of my office with the can and not let the other cats in. She doesn’t have to but likes to surprise us with having done it for us. It’s really sweet.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "My five year old can also feed himself if he wakes up before us. He developed a habit at about 4 of waking up at 6 am, silently leaving his room, and coming down to the living room to watch TV in peace 😅 he can get a gogurt (and open it himself) or granola bar, and his water bottle is in the fridge. He's actually quite happy to be by himself during that time until we get up! That way he gets to decide what's on TV",
          "id": 83,
          "comments": [
            {
              "score": 55,
              "content": "When they were young, my niblings enjoyed getting free screen time by not disturbing me in the morning.\n\nI would come down, ask if they had eaten, which they always had, and then ask them how many shows they had watched so far. We have an honest relationship, so they were honest. Sometimes it was terrifying. I was like you got up at 5:00 in the morning just so you could watch a screen uninterrupted? 😳\n\nTBC, a lot of times the reason they were up early is because I live in a more rural setting than their mom, so outside noises would wake them up!  🤣 The birds here start tweeting very early and I understand that it's pretty loud if you're not used to bird noises!  🤣",
              "id": 84,
              "comments": [
                {
                  "score": 15,
                  "content": ">ask them how many shows they had watched so far. ... Sometimes it was terrifying. I was like you got up at 5:00 in the morning just so you could watch a screen uninterrupted?\n\nI explicitly told my kids that the screen time limits didn't start until I was out of bed. Letting mama sleep in is the cheat code to getting to watch all the shows you want!",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "This puts such an adorable image in mind. My mom would put some cereal and bowls in a lower cupboard so if I woke up early I could make myself breakfast. I was probably 5 or so at the time she started this because like all hyper little kids I was an early riser. So if I got up before my mom or dad I'd just make myself a bowl of cheerios and watch some cartoons.",
              "id": 86,
              "comments": [
                {
                  "score": 8,
                  "content": "And you could also use a mixing bowl for cereal because why not? ;)",
                  "id": 87,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I still do that.  It is just easier than a small ass bowl that I have to refill 3 times to actually feel full.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "The trick is to make Saturday morning chore day.\n\nThe second mom/dad wake up, chores start!\n\nYou won't hear those kids until you wake up. I guarantee it.",
              "id": 89,
              "comments": [
                {
                  "score": 6,
                  "content": "This is what my parents did. If they get up, there’s like an 80 percent chance they were going to want to do something I didn’t want to do. Flea market, garage sales, antiquing, chores, home improvement stores. Even going out for breakfast was something we did a lot when I was a kid and I would have rather been in front of the TV in my pajamas with a bowl of Apple Jacks.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I love that. It's good to instill independence in little kids in small doses like that.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "When i was little i would get up early on the weekends so i could go downstairs, make food, and play the xbox before my parents woke up",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "If at age 11 I had woken my mother up on a weekend and demanded breakfast I honestly think she would have murdered me \n\nBy that age you’re perfectly capable of pouring cereal and milk in a bowl, not just on weekends but every day",
          "id": 93,
          "comments": [
            {
              "score": 3,
              "content": "Same. Besides, if I was quiet and went downstairs and got my own breakfast, I could have an hour of brother free peace (and full control of the remote control).",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Yeah, 11 is pretty old to be helpless in the kitchen. I get if they just want mom’s breakfast because it’s better, but they should also be fully capable of feeding themselves by this point.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Oh! Year!!! OP had m in there so I was horrified at the idea of an eleven month old rolling around in the kitchen.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "They literally have the option of cereal. Cereal can be eaten with or without milk and no actual cooking required. They should be long past a parent making them every single meal all the time.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": "It depends, they can obviously grab their own cereal but if OP normally fries up a movie-style breakfast they're likely too young to use the stove without supervision and would make a huge mess.",
          "id": 98,
          "comments": [
            {
              "score": 8,
              "content": "My family was taught to cook and was using the stove at around 8. 11 is a tween, in many school systems they are taking home ec/cooking at that age (for systems that still offer such classes). An eleven year old is almost surely old enough unless there's some health issues.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "11 is plenty old enough to use a stove, a toaster, or a microwave safely. It's also old enough to not make a huge mess and clean up after themselves. I was babysitting my 3 younger siblings at that age, one of which was a baby. I also was baking cakes, cookies, and occasionally made family dinner. 11 year olds aren't idiots.",
              "id": 100,
              "comments": [
                {
                  "score": 2,
                  "content": "That is very true. I was just saying they might have a legitimate reason to want OP to make a breakfast they can't handle themselves. Obviously OP is also very much in the right to say no.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 762,
      "content": "Nta but now is the time to start teaching them to cook.  My son has always liked a hot breakfast, specifically eggs.  He loves eggs.  I taught him how to cook and he makes his own breakfast outside of special occasions…hus birthday and holidays.  Teaching kids how to cook is a valuable life lesson.",
      "id": 102,
      "comments": [
        {
          "score": 359,
          "content": "I actually have started teaching them to cook. They help me with dinner, but I don’t feel comfortable with them using the stove while I’m asleep just yet. (Kitchen is upstairs on the opposite side of the house from my bedroom)",
          "id": 103,
          "comments": [
            {
              "score": 239,
              "content": "Microwave is safe",
              "id": 104,
              "comments": [
                {
                  "score": 126,
                  "content": "You can make scrambled eggs in the microwave. Just Crack an Egg. I make my own because it's cheaper and more diverse. You could even help them prep it the night before.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 53,
                      "content": "There's also Just Egg, which is a vegan egg alternative that goes in the microwave and is like a little almost-scrambled egg you can put in a breakfast sandwich or scramble up on a plate. I'm not vegan and I use them because they're quicker/more portable than real eggs.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "I know that it can be done, but as someone who cannot stand eating runny eggs, the idea of cooking them in a microwave makes me gag.",
                      "id": 107,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "You absolutely should not cook eggs in the microwave bc they run a very real chance of exploding even when they've been scrambled. How To Cook That on YouTube has a whole video about it.",
                      "id": 108,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "My kid once set the microwave on fire, so there’s that…",
                  "id": 109,
                  "comments": [
                    {
                      "score": 31,
                      "content": "My stepfather once set my microwave on fire, so theres that.",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "Get some frozen waffles they can put in the toaster, or some breakfast sandwiches they can heat up in the oven.     \n\nBut I would suggest showing them how to make eggs on the stove a few times, and then letting them try it by themselves (while you're awake and just in the other room). That way you'll be up and available if they need help, and you'll be able to know when they're capable of doing it totally on their own. As long as they know how high to turn on the burner and know to keep towels and other flammable things away, the worst they can really do is just burn the food.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "They're 11 and not 6, they should be doing far more than you have them doing. You're being very overprotective.",
              "id": 112,
              "comments": [
                {
                  "score": 2,
                  "content": "Yeah both my kids made their own fried eggs by 10.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "I started cooking for my family when I was 6 years old. I used to drag a chair over to the stove so I could be tall enough to reach. My mom would watch over me until I was about 8 years old. Then I started cooking by myself. I would often make breakfast for my mom and brothers while she was still sleeping. We also had a rule that we weren’t allowed to disturb my mom before a certain time. So for me, 11 is definitely old enough to cook for themselves. Each to their own I suppose.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "[deleted]",
              "id": 115,
              "comments": [
                {
                  "score": 11,
                  "content": "How well a kid can handle the stove depends entirely on the kid. There is nothing wrong with recognizing your kid isn’t responsible enough yet to use a gas stove unsupervised. There are plenty of other ways to make food.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "That's why I am actually thankful that my school taught us how to cook and use the kitchen safely in general. That way even those who hadn't been taught by their parents learned to cook.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 1,
                      "content": "[deleted]",
                      "id": 118,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "By 12 I was definitely able to bake my own cakes and cookies if I wanted without a parent hovering over me. Granted my grandma had me in the kitchen with her since I was 3. Even had my own little step stool so I could reach the counter better.",
                  "id": 119,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "They are old enough to take care of breakfast and lunch. At 5! my daughter got up , put out dog, fed dog and cats, fixed cereal and a banana for sister 1.5 years younger and then watched tv or played till we got up at 7:30. By 11 your children cook eggs, and cook some simple meals for lunch, should also be able to work the washer to do own bedding. Let your children have more responsibilities so they are better prepared to live on their own someday",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "The little dash egg cooker is great for hard boiled eggs and easy for 11/12 year olds to use.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Microwave or toaster also work for warm food. Or there is cereal, yogurt, bagels, fruit, poptarts, hard boiled eggs, etc that all can be breakfast food. They are way too old to need you to cook for them every morning.",
              "id": 122,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I'd say they can make cereal and simple stuff early and you can have the \"hot food from mom\" experience later in the morning or for lunch. Win win.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Maybe a waffle maker? A microwavable plate to cook bacon? They even have those breakfast mugs you can cook in the microwave. \n\nThey have quite a bit of options as you help increase their independence in using the stove.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "My 4 and 5 year old grandsons love to help cook as well.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 386,
      "content": "Nta. You children are 11 and they are making demands of you??? They are old enough to make their own meal.  On the other hand you are a bad parent if you have raised your children to believe at 11 years old they have the right to demand you get up and make breakfast.  You are raising very spoiled disrespectful immature asshole children.  Do a better job of parenting and you won't have this kind of problem.",
      "id": 126,
      "comments": [
        {
          "score": 148,
          "content": "I guess that’s fair. Although I can confidently say they ONLY behave this way with me and sometimes their father. They are very respectful and kind kids otherwise. However, I know this needs nipping in the butt quickly before it DOES bleed into their interactions with other people. That’s the last thing I want.",
          "id": 127,
          "comments": [
            {
              "score": 212,
              "content": "1. It's nipping in the bud, not the butt lol      \n\n2. Just because they only do it to you and their father doesn't make it okay. They should be able to get breakfast for themselves without *demanding* you to cook for them. Cereal or oatmeal are still perfectly fine for breakfast.",
              "id": 128,
              "comments": [
                {
                  "score": 79,
                  "content": "1.) I was second guessing the moment I hit reply lmao thank you\n2.) I know it’s not okay. I just wanted to make it clear my kids aren’t menaces to society. Just to their parents. 😅 Their teachers, school staff, family members, any adult they encounter constantly rave about how sweet and respectful they are and I’m always like yeaaahhhh they have a dark side at home. I guess they gotta have some kind of outlet for being so sweet all the time but this is out of control lol",
                  "id": 129,
                  "comments": [
                    {
                      "score": 65,
                      "content": "That's still not a good thing. Who is going to be their outlet once they leave home? Roommates? Partners?",
                      "id": 130,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -6,
                      "content": "At this rate they WILL be a menace to their future partners who will have to deal with their demands, regulate their emotions, and shoulder the mental load for them. You are raising the kind of boys that make women prefer to remain single.",
                      "id": 131,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I would even say it's worse doing it to the parents. It makes them feel OK being demanding and not nice to people who live them /who they love. It's exactly the people they should learn to empathize the most with",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "This is probably a dick move to them, but if I were you I’d start interrupting their leisure time with chores and not taking no for an answer. I’m guessing it would fix the problem real quick",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": ">Although I can confidently say they ONLY behave this way with me and sometimes their father.\n\nWell yeah they know they can walk all over you and get away with that behavior. They probably tried that when they were younger on other people but got told off so they know they won't get away with it with others but you.\n\nDo you want to be seen as nothing but a doormat to your children? Making their own breakfast or going a bit hungry until actual breakfast time isn't going to kill them.",
              "id": 134,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "You forgot the /s.\n\nIf not, you are literally unhinged if that is your response.",
          "id": 135,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "This feels like a very judgey reply. EVERY child has things that need improvement. That does not make this person a bad parent. It means there's an area as a parent that needs improvement. Also saying something like \"do a better job of parenting\" isn't helpful as it doesn't offer anything constructive. \n\nJust because a child is demanding in one area it does not necessarily make them \"very spoiled disrespectful immature asshole children\". It means there's is an area where they still need to learn.\n\n No eleven year olds is perfect, and no parent is perfect. It doesn't make a parent a bad parent if their kids struggles with behaviour in certain areas.",
          "id": 136,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "This is pretty harsh. Let your kids know that you are tired and do not want to be woken up until a certain time. If they don’t respect that request go from there.",
          "id": 137,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Dude, way too harsh.",
          "id": 138,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 193,
      "content": "NTA- this isn’t about them wanting a “special act of love” this is about them not wanting to do it them selves. They are 11, they should be way more then capable of making a bowl of cereal or a microwave meal. Eggs, pancakes, French toast",
      "id": 139,
      "comments": [
        {
          "score": 73,
          "content": "The reason I believe it *is* about the “act of love” is bc my sister and my dad cook big breakfasts on the weekends for my nieces. I’m talking pancakes, waffles, eggs, bacon— breakfast buffet level. \n\nWhen they stay the night over there, they also get the big yummy breakfast and I think it may be a bit of jealousy. \n\nThe difference though, is that 1.) My sister has always been an early riser and her kids are too. They get up at 6am EVERY morning and 2.) My nieces are 2 and 5. So still very much small and dependent on mommy-made (and papa-made) breakfast. and 3.) They’re not there during the times when my sister just CANT and is throwing pop-tarts at her kids and telling them to eat up lol \n\nOn the flip side, up until somewhat recently, my kids have not been big on breakfast. They also are notorious for waking up late. The only reason they get up early at all is because of school. We’ve always been a cereal, toast and jam or scrambled eggs type of family. \n\nI definitely need to have a talk with them and remind them that every family does things different and that their “Tete” does what works best for *her* family and I do what works best for *ours*",
          "id": 140,
          "comments": [
            {
              "score": 83,
              "content": "Everyone loves special family breakfasts, but those don't need to be every weekend and they definitely don't need to be early in the morning. We do brunch. If the kids are hungry before then, they can make cereal or toast. \n\nHonestly, my bigger concern is that they're not only waking you up, they're also continuing to nag after being told no. They're 11-- that's completely inappropriate. It's basic courtesy not to wake other people up, and they need to see you as a human being with feelings and needs. My kids knew by around 6yo that on weekends, they did not wake me or their dad up before 9, and they did not ask us for anything until we had drunk our coffee (barring emergencies). It's a matter of respect. I treat them the same way now that they're teens and starting to enjoy sleeping in. \n\nAre they insistent about other things? Do they interrupt you when you're reading or watching a show and expect you to cater to them then? I think it's time for some major boundaries to be set about how to treat people and be a respectful family member and housemate.",
              "id": 141,
              "comments": [
                {
                  "score": 18,
                  "content": ">We do brunch. \n\nYes! Brunch is such a wonderful concept as I am a night owl.  As my kids got older, Sunday Brunch became a thing. Usually half of the year Saturday was travel sports, so up early, grab something on the road once we're all more awake. On the Saturdays that weren't sports, everyone slept in happily and grabbed their own breakfast when they finally got out of bed. \n\nKids are grown and on their own now, but my husband and I (and the dog lol) still do brunch on Sunday.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "reasons i know i shouldn’t be a parent: as soon as the kids started nagging me like that i’d be squirting them with a spray bottle like when my cat is being a jerk",
                  "id": 143,
                  "comments": [
                    {
                      "score": 3,
                      "content": "As the parent of a toddler… I’m taking notes.",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "You know your sisters' 2 and 5 year olds very well might someday talk about how cool it is that at their friend's house there are always waffles in the freezer and how they get to feed themselves. It's normal to appreciate different things and it's not a criticism of how you do things.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "You know what I do with our 2-year-old twins?\n\n\nThey get a slice of bread, or pre-sliced fruit or veggies, or a bowl of cereal when they are REALLY hungry early on the weekend, but then we eat a proper, brunchy breakfast when my husband and I have had a chance to get up properly, take a shower etc. around 10ish.\n\n\nI don't know how you've survived 11 years with twins without pushing back against their demands, but it seems you are ignoring the potential for compromise as a family. You're doing yourself and your children a disservice if you give them what they want, when it's not what you want, to often. I've started to learn that myself only recently, but by now, our twins even let me knit while they play when I request it.\n\n\nTake back your agency, please, it'll do you all some good!",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Make special breakfasts on special occasions- first day of school, their birthday, holidays like Christmas. You can help them make breakfast for dad on Father’s Day and he can help them make it for you on Mother’s Day (assuming dad is in the picture). But for everyday, they need to make their own breakfasts. Remind them their cousins are little children. Their mother makes them breakfast because they aren’t able to. But those little kids also have earlier bedtimes and fewer opportunities than older kids have through school or elsewhere. Different stages of life bring different experiences. Different families also prioritize different things and have different schedules. They are old enough to understand that.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -7,
          "content": "She won't let them use a stove. Thus, they cannot make the breakfast food they want.\n\nIt's her fault they are behaving this way.",
          "id": 148,
          "comments": [
            {
              "score": 5,
              "content": "Oh woe is them, they can’t have exactly what they want at all times. Is she supposed to get up and run to the store on command if there is an ingredient missing, too?\n\nThey have plenty of options without the stove, including eggs. They do not need to be able to personally make any dish they might possibly want.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 110,
      "content": "[removed]",
      "id": 150,
      "comments": [
        {
          "score": 31,
          "content": "Fair enough.",
          "id": 151,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 76,
      "content": "YTA for allowing your 11 tear old kids to order you around.  Here's a tip. Once you get up on weekends, act like a parent instead of a slave and have them start their Saturday chores.  They'll never wake you again.\n\nFrom a very young age, I could fix breakfast, eat it, and be outside exploring without waking anybody.  My parents git to sleep in a bit, and I got 2 to 3 hours of blissful freedom.",
      "id": 152,
      "comments": [
        {
          "score": 17,
          "content": "Better yet, OP should just teach them how to cook breakfast themselves instead of banning them from using the stove. This is a perfect teaching moment that OP is passing up. \n\nOP plenty of people were cooking on stoves at 11 years old. Time to teach them how to make their breakfast and start giving them some trust.",
          "id": 153,
          "comments": [
            {
              "score": 20,
              "content": "And plenty of kids are not safe to use the stove unsupervised until older than 11. It is not a one size fits all activity, and the stove is not actually required to make perfectly reasonable meals.",
              "id": 154,
              "comments": [
                {
                  "score": 4,
                  "content": "But if OP taught them how to safely use the stove, then the problem would be solved?",
                  "id": 155,
                  "comments": [
                    {
                      "score": 6,
                      "content": "This is not a case of teaching. You cannot make a kid have more of an ability to focus and remember things than they currently have just by showing them the stove. Those are skills that develop over time through doing things where if they don’t get it right, they don’t burn down the house. Until those skills are sufficiently developed, the stove unsupervised is simply not safe even if they are a gourmet chef with it when supervised. Our kid wasn’t really safe with it until he was 13 because he’d just forget he had it on, etc. when he was younger.\n\nLack of a stove is also not a significant barrier to making plenty of tasty food items. It is not stopping these kids from making themselves breakfast.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "This seems unnecessarily aggressive.",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "Making breakfast for your kids = being a slave. Reddit is hilarious",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 69,
      "content": "NTA my 8 year old can fix cereal for themselves. Kids don't need a cooked breakfast every day.",
      "id": 159,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 51,
      "content": "NTA. 11 year old should be capable to make their own breakfast - or even breakfast for the whole family.",
      "id": 160,
      "comments": [
        {
          "score": 16,
          "content": "I first thought the kids were 11 months old",
          "id": 161,
          "comments": [
            {
              "score": 16,
              "content": "Ahahahah I do that all the time as well with these kind of posts that are talking about boy children. I’d be a major A H if I told my 11 month olds to make their own breakfast lol",
              "id": 162,
              "comments": [
                {
                  "score": -1,
                  "content": "You shouldn't treat boys different than girls in that regard. They'll have to learn the same. And if you don't they'll become those kinds of men who won't do  housework because its a '' woman's job\". I've once heradt (don't know if it's true) that boys need to be brought up with more structure, rules and actual consequenzes than most girls to become decent people. Please don't slack on that",
                  "id": 163,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Those 5 brain cells need to work harder",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 31,
      "content": "NTA, you get plenty of occasions of making something special for them during the day, doesn't have to be breakfast which they are old enough to handle,  think cereal, microwaved waffles, bread and spreads, fruit, etc. Just leave them at hand with clear instructions.\n\nWhat about your husband , can he pick up that task instead?",
      "id": 165,
      "comments": [
        {
          "score": 33,
          "content": "He frequently does and is handling it today. Sometimes he works on the weekends and others he’s just not feeling all that great. I think my problem with this is their attitudes. They’re kind of jerks about it. They said they don’t WANT any of those things— they want cooked food. -_- I told them they can either grab something small to snack on while they wait on one of us to get up or just be hungry. They chose to wait and be hungry.",
          "id": 166,
          "comments": [
            {
              "score": 39,
              "content": "Their choice, stick to your guns, they are oldenough to sort themselves out something",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I would say the next time they want whatever specific thing for breakfast, They need to make it 100% themselves.\n\nI mean you of course be there, but if they're going to want this they need to be sitting there. Happy butts in the kitchen with you during the entire thing.  Tell them to take notes. There will be a test.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Have you told them they are being jerks about it? Have your pushed back or issued any consequences for their rude behavior and demands? What are you- the parent- doing to teach them?",
              "id": 169,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}