{
  "post content": "Throwaway bc she knows my reddit.\n\nSo, here's the deal. My (28M) girlfriend (27F) of two years and I planned a two-week vacation to Italy. I paid for the flights, hotels—everything, because I make more than she does, and I wanted it to be a stress-free trip for both of us. Everything was great until the last day when she tells me she wants to stay longer to \"find herself\" and think about our relationship without me. She didn't discuss this with me beforehand, and it completely blindsided me.\n\nI was hurt and told her that if she feels she needs time alone, then she should also be independent financially during this extension of her trip. I said I wouldn’t be paying for her new return ticket whenever she decides to come back. Now, she's upset, calling me unsupportive and selfish, and some of our friends are saying I'm being an a-hole because I left her stranded in a foreign country without financial help.\n\nSo, Reddit, AITA for refusing to pay for her new plane ticket home after she chose to extend her trip without any heads-up?\n\n\n\nUpdate: Thank you to all the people who responded, especially the early ones who gave some outside verification of me probably not being the asshole. I don't feel comfortable saying I'm completely blameless here because you're only getting one side of the story and I need to take responsibility for my part in this whole thing such as it is. But I guess I never realized how good my gf was at making me feel like unreasonable shit was normal and rational and that I was the crazy one. \n\nSo here's the update. We're both back in America now and she's packing her shit to go stay with her family for a bit until she can find a new place. Soon after I posted, it was time to go to the airport, so I did...without her. I'm one of those people who arrives really early because I never think I'll get to the gate in time because everything that could go wrong probably would go wrong (it never does but, especially with how I was feeling my luck was going, I didn't want to push it). \n\nI was there for about an hour by myself mulling things over and talking to my mom. I looked at a couple responses to this post but I didn't trust that I wouldn't lose it if I started responding and I definitely didn't want to burst into tears while I was in the airport. \n\nAs I was talking to my mom, my gf showed up. I guess she thought I was bluffing but had a rude awakening when the hotel staff kicked her out of the room because I'd only paid through that day. I took no small amount of satisfaction in this, ngl. She'd been so concerned about the plane ticket that she didn't even stop to think about where she was going to stay...\n\nAs many of you guessed, she met someone while we were in Italy. She was quick to tell me that it was just a physical attraction and that they hadn't done anything, but she had his @ and was wanting to see if it'd go anywhere. I guess that's what I get for not feeling well and wanting to stay in one night while she went out to explore...\n\nObviously, I told her things were over between us. Even though she tried to make it sound like nothing had happened, the fact was a. I couldn't feel like I could trust her when she said that and b. I don't really want to be with someone who feels like it's okay to still \"keep her options open\" when she's been in a monogamous relationship for the past 2 years. \n\nThe flight home was awkward as fuck and she tried really hard to give another pitch for why we should stay together on the drive home from the airport. I think, as we got closer to home, reality started setting in and she realized she'd just thrown a lot away. \n\nSo yeah. I'm jetlagged and physically and emotionally exhausted. I'm just kind of numb at this point. \n\nFinally, I didn't see all the comments (as there are 2.5k at the time of this update) but, to the few that were downvoted into oblivion who said this was fake because I hadn't updated in several hours...fuck you. I was looking for reasonable dissenting opinions that might have helped me make sense of this situation and you're accusing me of making this up for random internet points?? Believe it or not, my priority was not to tell a bunch of strangers on the internet how my world was falling apart around me. I know it's easy to think that these people aren't real and their struggles are meaningless because screens divide us but, ironically, you're the assholes. ",
  "id": 1,
  "comments": [
    {
      "score": 17905,
      "content": "NTA. She can 'find herself' on her own dime. That's reasonable and fair.\n\n>Now, she's upset, calling me unsupportive and selfish, and some of our friends are saying I'm being an a-hole because I left her stranded in a foreign country without financial help.\n\nYou *have* been supportive and unselfish. You didn't complain or become difficult. You respected her decision to stay and 'find herself.' Supportive does not necessarily mean you have to pay for her choices. \n\nAnd no, you didn't strand her in a foreign country without financial help. It was *her* decision to stay behind. All you did was respect her decision. However, it was not your obligation to fund her decision. \n\nShe's a grown woman, which means she's responsible for her choices *and* her financial independence. You invited her on a couple's trip. Well, the couple's trip is over. She decided to stay on her own? That's no longer part of the deal. She has every right to stay behind, she also has the right to pay for that out of her own pocket. \n\nHas she been this manipulative before? Red flag.",
      "id": 2,
      "comments": [
        {
          "score": 6883,
          "content": "Let's be honest, she could \"find herself\" at home, but she chose to stay in Italy. She had a paid for holiday and now she is all surprised pikachu face that he won't fund a journey of self exploration,  with a side of I need to think about our relationship without you?",
          "id": 3,
          "comments": [
            {
              "score": 6310,
              "content": "Yeah that read, \"I want to fuck Italian guys on your dime, expect you to finance it because I never told you you were just my sugar daddy, have you pay for my return and have a fully functional relationship like nothing happened when I return\"",
              "id": 4,
              "comments": [
                {
                  "score": 1107,
                  "content": "Came here to say the same thing.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1015,
                      "content": "I think you are all missing part\n\nSHE CHOSE TO NOT USE THE TICKET OP HAD PURCHASED!\n\nShe chose to stay knowing he wouldn’t pay!!!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 113,
                      "content": "[removed]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "I had the same thought.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 438,
                  "content": "Yeah no shit, I'm not paying for my gf to play moaning Lisa to some damn leonardo.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 101,
                      "content": "Moaner Lisa",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Leonardo probably wouldn’t have wanted her moaning Lisa. History seems to think he was gay.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "She probably just wants to taste the local Italian salami!\n👅",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Reddit never fails to deliver....I just waste time laughing at the creative comments...keep up the good work (guys...probably a safe bet...I reckon).",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 433,
                  "content": "[deleted]",
                  "id": 14,
                  "comments": [
                    {
                      "score": 254,
                      "content": "Don't forget she will probably be pregnant when she comes back and if he really loves her he would raise the kid",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 98,
                      "content": "You are for scuba?",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 90,
                      "content": "This is just like the story where Op's fiancé went on a vacation abroad and she dumped him at the airport and blocked him, unilaterally deciding that their relationship would be on hold until she came back, and was all shocked Pikachu that he cancelled the wedding during the radio silence and didn't immediately take her back. She was ready to deny that she cheated on Op calling him insecure, but couldn't think of a response when Op focused on her dumping him rather accusing her of anything.\n\nThen there's the story of the Op whose wife has a family history of dementia, whose mother had begun to take a turn causing her to freak out and decided that she also needed to go \"find herself\" before it set in, so she emptied her and her husbands retirement account and went on their planned retirement trip alone, not only robbing Op of the experience, but also seeming to expect to have Op sit around for her to come back and take care of her when the dementia set in. But was shocked to come home to a set of divorce \npapers and children that wanted nothing to do with her.\n\nI honestly can't fathom the thought processes of partners who make such selfish and one-sided decisions, and why the don't think they'll face any consequences for them.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "She getting that foreign sausage",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 233,
                  "content": "I don’t know, to me it feels more like “my bf of 2 years planned an amazing romantic 2 week vacation in Italy and I expected him to propose on the trip.” \n\nNow she’s disappointed and probably embarrassed because she definitely discussed this possibility with her friends. She doesn’t want to ask why he didn’t propose but she also isn’t sure she wants to stay in this relationship. And yeah, she’s upset so she’s expecting him to pay. \n\nThat’s my 2 cents anyway 🤷‍♀️.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 150,
                      "content": "Why could she not just think about this back home if this was the case?",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 71,
                      "content": "Could very well be this. I have been a bystander to this scenario playing out in real life. I once went to the break room at work to find a strangely giddy bunch of female co-workers in their 20's.  Asked them what was going on. They were excited for \"Jenny\" because her boyfriend had arranged a surprise trip to New York for Christmas. Which apparently obviously meant he was going to propose. They asked me to confirm 'from a male perspective'. Said I didn't know him or their relationship so it wasn't for me to second guess. But they pushed, so I asked if \"Jenny\" & partner had ever discussed (edit from autocorrect discovered) marriage.  They had not. So I gently suggested not to get hopes up. Remember he's a man and without clear signal/direction you want this he's likely to just plod on thinking all is well. Told me I was an idiot.  Reader, he did not propose on that trip. They Broke up - he had embarrassed and let her down apparently. I always felt sorry for him - planned a romantic getaway and got dumped because something he knew nothing about never happened.  The lesson, as always in all relationships, communicate people! ",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 63,
                      "content": "None of that involves staying in Italy. She tacked that on. ",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 57,
                      "content": "Good two cents, far better than the billion \"she just wants to fuck\". I think she'd still be in the wrong but it's more understandable.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "Am I weird for thinking thats kinda fcked up?\nLike in the beginning she wants to be married and technically together until death does them apart. Then when he didnt propose she has to rethink the relationship?\nI think thats rather bad commitment and she doesnt seem ready for marriage if a ring makes her waiver.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 28,
                      "content": "I think this is a good point.   I could totally see this being the scenario.\n\n\nStill, NTA, but, I can see why she's re-evaluating if she had different expectations.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "That's such a shitty personality to have if that is the conclusion one reaches. Instead of using her words, and talking about the state of the relationship and what timelines both are interested in, she instead tries to mooch extra time in Italy off someone to reconsider even being with them?\n\nEven angry that is an incredibly entitled and selfish conclusion to even reach.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "Possibly. I wonder if they discussed marriage beforehand. If they were gonna get married, but left the proposal to be a surprise, then planning an Italy trip with that in mind and not proposing is really dumb on the guys part. \n\nHowever, if there was no discussion before \nhand and she just assumed a proposal was coming... Who would want an SO that makes assumptions about such important life events? She would be incredibly shortsighted in that case.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Yes but it not happening means it would be a *different* luxury completely paid for overseas trip in the future for a proposal, and it not being a giant event means it's more likely to keep happening too since there wasn't a crescendo attached to it.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Maybe if she’s disappointed and therefore wants to take out her immaturity and discontent by sleeping with someone else. What other purpose is there for her to stay in Italy, a place that apparently fills her with disappointment because she didn’t get proposed to?",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 144,
                  "content": "A redditor once said “Italy is Thailand for girls”",
                  "id": 30,
                  "comments": [
                    {
                      "score": 68,
                      "content": "I lived there for several years.  It’s really not. The men are all very thin and more feminine than American men.  Not my type. Now. The Scottish men. Hairy and bearded. And hot. Yaaasss.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 32,
                      "content": "Thailand, where Western men go to participate in sex trafficking is the same as Italy, where women might consensually have sex with other adult men for free?",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "I don't know if this is offensive for us Italians, for Thailand or for both, but I'd say this is wrong anyway you put it.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Doubt it.\n\nVery much doubt gf would have to pay any man to be with her.",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "How does she have the time off work?",
                  "id": 35,
                  "comments": [
                    {
                      "score": 53,
                      "content": "Read between the lines (sugar baby)",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 44,
                  "content": "Yeah no shit, I'm not paying for my gf to play moaning Lisa to some damn leonardo.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "*Ciao, bella*",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Definitely what she was/ is trying to do. I just left Rome and as a lesbian I had to admit the men there were gorgeous.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "You forgot \"unless I meet someone better\".",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 180,
              "content": "Also that she needed to \"think about their relationship,\" as though he needs to jump through hoops to keep her happy while she stays on alone. It sounds like OP's relationship is transactional and not based on respect or love. She is absolutely taking advantage and trying to manipulate even more freebies from him.",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 70,
              "content": "I would have been ok, peas out! We are done. Here is your ticket home. Use it or lose it. I don’t care. And that would have been that.",
              "id": 42,
              "comments": [
                {
                  "score": 32,
                  "content": "Seriously. Cut my losses right then and there. Real simple.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "*Peas out* lol r/boneappletea",
                  "id": 44,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Bingo. Shit I wouldn't even have given her a return ticket home. \"That's on your own single ass to figure out while you are Discovering yourself!\"",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "> Let's be honest, she could \"find herself\" at home\n\nSure she could find herself but there's not as much Italian sausage there...",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "She wants an Eat, Pray, Love experience, leaving out Bali and India.",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "I’m loving this new term “surprised pikachu face” became it really says it all.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "[surprised pikachu face](https://media.tenor.com/B6c18hoSKlAAAAAM/surprised-pikachu-face.gif)",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Seems to me like she wanted to find herself with an Italian man mounting her from behind.",
              "id": 50,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "No she can’t lmao no Italian men at home",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "But with Luigi.  I just need you to fund this self exploration.  OP needs to take this time to do the same without her with pictures, plenty of pictures.",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 575,
          "content": "You and alot of people seem to miss the \"and think about our relationship without me\" part which is a bigger red flag. Seems to me she was looking to use  the extra time a way to dump OP..... on his own dime.\n\nNah mate she own her own now. NTA.",
          "id": 53,
          "comments": [
            {
              "score": 120,
              "content": "It's so she has a get out of jail free card for when she gets bored fucking dudes overseas and comes back home and wants to go back to how things were.\n\n\"they were on a break!!\"",
              "id": 54,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 53,
              "content": "find herself = find herself on some Italian guy's dick",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 245,
          "content": "Yep! I would be surprised if she didn’t plan to break up with OP but this trip came up so she decided to play nice to get a free trip. Now she ready to 𝑒𝓍𝓅𝓁𝑜𝓇𝑒. 🙄\n\n\nETA: NTA, definitely not! If it were me, I’d move on honestly.",
          "id": 56,
          "comments": [
            {
              "score": 7,
              "content": "Exactly. That's what I thought. She had enough of him before the trip, but the free holiday in Italy was too good a deal to let go, so she postponed and now wants to squeeze every possible last dime out of him for an extension to go wild (oh sorry, to find herself), and then ditch him the moment she returns, because she has thought things over. NTA",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 156,
          "content": "Yeah super shady behavior on her part. OP handled it well.",
          "id": 58,
          "comments": [
            {
              "score": 35,
              "content": "Yes! So glad he's not a pushover and decided to just cut her off right then and there.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 143,
          "content": "If her friends and family are so concerned, they can take up a collection to pay her expenses.\n\nETA: I don't know what your living arrangements are, but if practical, you might want to consider moving out, or if it's your place, giving her an eviction notice so that you can think about your relationship without her.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "Love how she decided to 'find herself' at the very end of the trip, very convenient lol. \n\n✨️I want to be independent, but can you pay for everything?✨️ Aye okay 😂\n\nMy late ex-MIL used to say; \"Don't take my kindness for daftness.\" Basically, just because I'm kind/generous, don't think you can take advantage of me. I think this applies here.",
          "id": 61,
          "comments": [
            {
              "score": 4,
              "content": "I'm going to guess you're Scottish because I hear that phrase all the time.  Yeah, 100% agree.",
              "id": 62,
              "comments": [
                {
                  "score": 3,
                  "content": "Yes I am 😂",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Even without being Scottish, that's standard English and I'm not sure what else it could mean other than what it does mean LOL",
                  "id": 64,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "Exactly WTAF is this woman thinking, ridiculous.",
          "id": 65,
          "comments": [
            {
              "score": 84,
              "content": "She's thinking \"I met a cute person at the coffeeshop and he just started his vacation alone, so I'm going to accompany him and then go home guilt free!\"",
              "id": 66,
              "comments": [
                {
                  "score": 5,
                  "content": "Bingo! It's so obvious.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "She's thinking she had OP wrapped around her little finger, willing to eat shit if she told him to.",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "The friends are confusing being supportive with being a doormat.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "Me thinks she was hoping to find some extra Italian while finding herself.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Also why is he scared that she knows his reditt ? She and her friends Should read the comments.",
          "id": 71,
          "comments": [
            {
              "score": 15,
              "content": "I was thinking the same thing!! \nEven so, if she sees this, it’s not like she’s not going to figure out who wrote it.",
              "id": 72,
              "comments": [
                {
                  "score": 3,
                  "content": "Exactly! \n\nI mean, how many couples, (their ages stated) have been in Italy for 2 weeks, where he paid for it all, and she wants to stay behind to \"find herself\" and he left her there? Oh yeah... and her friends are mad at him now because she's stranded? Noooo... No one will figure out who wrote this, /s 😂😂",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5677,
      "content": "'to think about our relationship without me'\n\nthe relationship without you is her being single.  \n\nto spring it on you last minute, and to imply that it's about whether or not you'll stay together?\n\nand then expect you to pay her way?\n\nshe chose not to get on the plane where her ticket was *already paid for by you*, and wanted a new ticket?\n\n\nNTA.  it was her choice to incur more expenses for you, without your consent.  adding in the 'to think about our relationship without you' just makes it sound extra sketchy while still acting entitled to your money.",
      "id": 74,
      "comments": [
        {
          "score": 1220,
          "content": "She doesn't need to stay in Italy to think about the relationship. She can do that at home. If she wants to stay longer in Italy ( don't entirely blame her, Italy is beautiful) then she needs to pay to be able to stay. Especially with the line about needing to think about the relationship without him. NTA. She had the choice to get on the plane and do her thinking back home. If she wants to extend her vacation, for any reason, it's on her to pay for it.",
          "id": 75,
          "comments": [
            {
              "score": 945,
              "content": "She wants to 'find herself' some Italian men",
              "id": 76,
              "comments": [
                {
                  "score": 112,
                  "content": "Thank you for saying it",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 70,
                  "content": "I mean...I don't blame her. \n\nBut she does it single and entirely on her own dime. Dude has every right to say \"here's your ticket, come back with it or you're on your own\"",
                  "id": 78,
                  "comments": [
                    {
                      "score": 88,
                      "content": "I mean I'd still blame her. Incredibly selfish and heartless to go on a whole paid for vacation to then break up with your partner.",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "She wants to find some of that authentic Italian sausage. ",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "She already found one lol. That's why he's selfish for not letting her stay/s",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "https://www.theonion.com/european-men-are-so-much-more-romantic-than-american-me-1819594261",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "They had already been hitting her up, hence why she wants to stay. As someone who lived there, yeah, their men are aggressive in their pursuit (but not like physically if that makes sense) when they think you're bella, no matter if there's a man there with you or not. The country is full of horndogs on both sides. Milan used to have a billboard up that basically implied it was a 50/50 split for men and women who were in affairs.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yep , I think she wants an easy fling and still wants to emotionally manipulate him. Lmao",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "She was a sugar baby just OP wasn’t aware.",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 299,
          "content": "It’s rich she wants to find herself with your financial support",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "I feel like she wants him to go while she has a fling with someone.",
          "id": 87,
          "comments": [
            {
              "score": 42,
              "content": "Your friends are ignoramusses. If they support that kind of behavior, they are no friends of yours.",
              "id": 88,
              "comments": [
                {
                  "score": 36,
                  "content": "Totally agree and if they're that worried about OP \"stranding her in a foreign country \", then they can fucking pay for her extra time there and ticket home.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "I think he means “to think about the relationship, without me there”.",
          "id": 90,
          "comments": [
            {
              "score": 217,
              "content": "yeah, that's clear, but my point stands.  if *this* is the moment she chooses to go off and 'find herself', *literally at his expense*, then he's probably better off without her.",
              "id": 91,
              "comments": [
                {
                  "score": 116,
                  "content": "Oh there is no way she comes home saying anything but ‘it’s over’. He did the right thing leaving her ass in Italy.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 87,
                      "content": "I have to disagree. If she finds herself another well-off man in Italy--which is probably her plan--she won't come home at all. If she can't catch a rich Italian, she'll come home and expect OP to be waiting for her. If he's not, she'll say he's being selfish.",
                      "id": 93,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 31,
                      "content": "I also disagree.  She thinks of him as her sugar daddy and would most likely come home and act like nothing happened to get back on the gravy train.  She'd tell lies about how she spent the rest of her trip alone.  This is unless she manages to find a new sugar daddy in Italy, then all bets are off.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Exactly!",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I think she already FOUND herself an Italian guy and a fail safe if testing the waters backfires.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Doesn’t matter she still chose to not use the ticket he purchased and still chose to not use it when he said he would not be paying any more",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "What she wanted was to fuck Italian guys guilt free because they won't technically be together or whatever she'll use to justify it, all on his dime. And then when she gets back, right back into the same comfy having everything paid for relationship.",
          "id": 98,
          "comments": [
            {
              "score": 13,
              "content": "\"We were on a break!\"",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "As I said in my reply under no circumstances should he be paying more for any transportation other than the amount he originally paid to get her home. She's on her own after that. And that will last for 2 days.",
          "id": 100,
          "comments": [
            {
              "score": 20,
              "content": "What is she planning on doing for accommodations?  He should make sure to check his credit card receipts.",
              "id": 101,
              "comments": [
                {
                  "score": 4,
                  "content": "agree. She is on her own once he gets on that plane",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "exactly, the only reply would be\n\n\"you're dumping me... in Italy?\"",
          "id": 103,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3597,
      "content": "\"until the last day when she tells me she wants to stay longer to \"find herself\" and think about our relationship without me.\"\n\nNTA\n\nIt sounds like she wants to 'find herself' with some Italian guys. This would be a very clear end of relationship for me.  I strongly suspect you have noticed her drawing away in the last few months.",
      "id": 104,
      "comments": [
        {
          "score": 557,
          "content": "Seriously. Where is it writ large that someone has to be in Italy to consider what they want to do with their life? Jesus Christ, the entitlement of that girl.\n\nNTA, OP, and you’ll be happy to be rid of her after a while.",
          "id": 105,
          "comments": [
            {
              "score": 23,
              "content": "I feel like she wanted an “Eat, Pray, Love” moment, but can’t afford it on her own dime. She deserves to be stranded in a foreign country without financial assistance from OP.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Maybe she read eat pray love too many times. I mean if you can afford to I’d also like to find myself through gelato and pasta.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 322,
          "content": "Also, waiting until the last day makes changing the flight basically impossible, and any return ticket incredibly expensive. I honestly can't understand why she ever thought OP would fund that? If she wanted time to think about their relationship, she can do it at home. Even if she wasn't looking to stay in Italy on OP's dime, having this basically end of relationship conversation while they're on holidays is very much not ok. Unless OP did something egregious, you don't break up with somebody when you're on a 2-week holiday is not the way to do it - you wait till you're at home so you can actually have the space you say you want.",
          "id": 108,
          "comments": [
            {
              "score": 129,
              "content": "She had to wait in order to properly milk OP for the duration of the trip.",
              "id": 109,
              "comments": [
                {
                  "score": 86,
                  "content": "That's absolutely what she was doing, like, it's very clear she wanted to break up with him but also wanted a free trip to Italy, but I just can't understand why she thought he would then pay for her ticket back? There's an alternate reality where she's a little bit smarter, and instead of this post being about him not paying for the extra ticket, it's him asking like \"AITA for being upset that my ex dumped me the day after we got back from a trip to Italy that I paid for?\" or something (and I would still say NTA then as well - don't let somebody pay for an expensive overseas holiday when you know you're going to dump them, that's tacky).",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 144,
          "content": "Yeah, she want some of that Italian D..",
          "id": 111,
          "comments": [
            {
              "score": 99,
              "content": "You mean Italian sausage? NTA",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "She want that gabagool.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 122,
          "content": "Oh, she totally wanted OP to finance her bang vacation after he had already paid for a couples vacation. \n\nOP, you are of course NTA. But heavily consider the character of this gf.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Yeah my very first thought was that she wanted to stay and bang the hot Italian waiter some more.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": ">  think about our relationship without me.\n\nThis red flag is so big you can see it from space, jesus.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "This!!! She wants to find herself and have fun and cheat on him with his money.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "100% this. You should have said great have at it, cancelled her plane ticket and let her find her own way home.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1131,
      "content": "NTA\n\nYou didn't leave anyone stranded and why would you be willing to foot the bill for this extension of the vacation that you're not on? Sounds like something the person taking the extended vacation should pay for, surely.\n\n\"I decided to spend some more of your money\" isn't and shouldn't become acceptable in your relationship. I might be somewhat rough around the edges when it comes to stuff like this, but I've only ever in my life internalized and reacted to messages like \"I need to find myself\" or \"we have to take a break to think about the relationship\" as one thing and that is: You do what you do, I'm moving on ahead.\n\nDon't ever act like you are in a relationship with someone who demands the right to act like they are single.",
      "id": 119,
      "comments": [
        {
          "score": 125,
          "content": "I hope they don't live together..if it was her place. ,I'd move take my stuff and bolt..if it's ypur place ( his ) pack up her stuff and put it in a storage  building. ..change your phone number or block her.  Block her on.any social.media. she can find herself without you",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Wow!!!! Just Wow!!!!",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 708,
      "content": "NTA, with the information provided.\n\nYou didn't leave her stranded. She left herself stranded. She chose not to use the plane ticket you purchased, and wanted you to just buy her a new one for sometime later. Presumably pay for her lodging and food, as well? And all announced the day you were supposed to leave to go back home?\n\nIf the financial burden was too much for her to bear, she could have just got on the airplane, but asked for a seat change to \"be alone and think about the relationship\".",
      "id": 122,
      "comments": [
        {
          "score": 259,
          "content": "NTA. Yeah she’s not finding herself, she’s finding someone for herself. OP is no longer the boyfriend.  He made the right choice. \nFAFO.",
          "id": 123,
          "comments": [
            {
              "score": 43,
              "content": "No she’s finding some Italian dick to ride",
              "id": 124,
              "comments": [
                {
                  "score": 26,
                  "content": "THATS WHAT HE IS SAYING",
                  "id": 125,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "What's FAFO",
              "id": 126,
              "comments": [
                {
                  "score": 18,
                  "content": "*Fuck around & Find out*",
                  "id": 127,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "When OP didn't say she asked him to pay for accommodation and food for her extended stay, I read it as she already has someone else promising her accommodation and other benefits, she just needs to secure the ticket back.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 489,
      "content": "I find the person in the wrong is usually the one running to their friend to share their narrative on the matter.\n\nShe is the selfish one in this situation 10000%. You paid for everything, she accepted that. The last day she tells you that she doesn't want to use the ticket tomorrow that you already paid for, so she can find herself and think about the relationship. What world would you finance her \"thinking about your relationship.\" That is what is tremendously selfish here. Not that this would excuse her inappropriate timing to \"think about your relationship\" but along with dropping this on you 1 day before your departure, she should have been the one saying she'd refund the ticket she is wasting that you already paid for and pay her own way.\n\nTo me this sounds like she wants some Italian dick but that is just an assumption at this point.\n\nI hope along with not paying for her new ticket you also aren't paying for her accommodations or any other expenses.\n\nIf you are stateside and she is still in Italy I hope YOU take this time to think about the relationship.\n\nYou are not selfish, she is the one not only being selfish, but she is taking advantage of your support and in turn is leaving you thinking what? She is going to stay, potentially cheat, and think about dumping you, while expecting you to pay?\n\nLastly, the friends are delusional. YOU didn't leave her \"stranded in a foreign country without financial help,\" she chose to stay past the accepted departure date, why would the assumption be you pay for everything? Is she not an adult? If she can make a personal decision to waste your money and disrespect you, while implying she is going to \"think about the relationship\" she should have had a plan to pay for it like a fucking adult does.\n\nEdit: Went to the bathroom and thought of a great response, granted this in the moment probably wouldn't have thought of this myself but anyway. I'm imagining if a woman said this to me and it was to \"think about the relationship\" and I would have said, alright, I am cancelling your return ticket, you can stay stay or do whatever you need to, there is no relationship to think about though because we are over.\"",
      "id": 129,
      "comments": [
        {
          "score": 131,
          "content": ">Lastly, the friends are delusional. YOU didn't leave her \"stranded in a foreign country without financial help,\" she chose to stay past the accepted departure date\n\nI don't know, are they delusional or were they deluded? Because it sounds to me like she told them a very different story",
          "id": 130,
          "comments": [
            {
              "score": 41,
              "content": "Just going off the info we have, maybe they were misled. OP told us the situation and that friends have said he is in the wrong so basing it off that.",
              "id": 131,
              "comments": [
                {
                  "score": 22,
                  "content": "I’m wondering if the relationship is something akin to a sugar baby situation. He paid for everything on what sounds like a swanky vacay. She seemingly thought there was a good chance he would pay for more, which is pretty delusional for a normal relationship, AND her friends support her? Seems like the relationship may be money based.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Maybe, that is more assumption though. OP said it was because they make more money and wanted it stress free, didn't mention a sugar situation.",
                      "id": 133,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 400,
      "content": "NTA. \n\nI’m sorry friend, it sounds like this is the beginning of a breakup with her comments about finding herself and thinking about the relationship. \n\nShe’s not TA for considering breaking up with you, because not all relationships work out, but she became the flaming AH when she wanted you to bankroll her extended overseas holiday while she ponders whether or not she wants to keep seeing you or not. \n\nThis will likely be difficult, but try to see this as an opportunity to weed out who your real friends are as any sane person who is actually your friend will be OUTRAGED on your behalf. Even if you were Bill Gates levels of rich and the money meant nothing to you would it be insanely rude for someone to ask you to bankroll their breakup with you.",
      "id": 134,
      "comments": [
        {
          "score": 112,
          "content": "And she waited until the end of the all expense trip that OP paid for. And she expected him to pay for the extension. She should absolutely be his ex-girlfriend now. \n\nItaly is not a hard country to get around in. It is not like she is in the middle of nowhere. If they weren't in Rome at the end of the trip they would have been in another city with an international airport like Milan.",
          "id": 135,
          "comments": [
            {
              "score": 22,
              "content": "And all of this after he paid for everything including meals, rides, etc.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "It's way easy to get around.  You can get anywhere by train.  Plus I'd never travel without having the funds to support myself if something happened. \n\n Did 18 days through western Europe via train including Milan, Venice and Rome.  Then again as a woman I don't depend on a man to pay for my travel.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I want to know where she’s gonna stay on this voyage of self exploration.  If he paid for all the things and she can’t even afford a ticket home, how’s she’s staying in a foreign place?",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 315,
      "content": ">  some of our friends are saying I'm being an a-hole because I left her stranded in a foreign country without financial help.\n\n\nAbsolutely NTA.\nSHE left herself stranded in a foreign country. She had the return ticket, it was her choice not to use it.",
      "id": 139,
      "comments": [
        {
          "score": 124,
          "content": "Her Friends are free to fund her extended holiday.\nNTA",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "I struggled with the friends' interpretation of that too. What should OP have done? Drugged her and stuffes her into his suitcase?",
          "id": 141,
          "comments": [
            {
              "score": 9,
              "content": "I doubt the friends are braindead enough to ride the idea of her milking Italians on the bfs dime, she's likely been telling them another story about why was he won't pay for her ticket.",
              "id": 142,
              "comments": [
                {
                  "score": 7,
                  "content": "Yeh, I'd be responding to those friends pretty simply: 'I'm curious, what story did she give you?\"\n\nShort, to the point, implies it's all bullshit, and see what they say.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "The friends coming after you is always a bad sign. If this is unprompted ie you haven’t asked their opinion before, then she’s probably pretty manipulative. Don’t think it’s healthy for people to drive narratives in wider social circles to put pressure on their spouses.\n\nLike if one close mutual friend talks to you then it’s fine but if she’s immediately started pitting people against you when you decide not to fund her solo vacation, she’s probably been using you for quite a while already.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 204,
      "content": "OP, you did not leave her stranded.\n\nYou provided her with a fully paid for plane ticket home which she made the decision not to use. \n\nShe made a decision that has financial ramifications for her. It is not your responsibility to fund an extension vacation she wants to take. That is her choice and for her to fund.\n\nFor your \"friends\" your only response needs to be:\n\n\"No. I did not leave her stranded anywhere. I provided her with a fully paid for return ticket on the original date based upon the agreement we had at the start of our vacation - a vacation I funded. I am not her personal piggy bank. If she wants to extend the vacation that is 100% her choice but it is also for her to fully fund. Again, I am not her personal piggy bank.\"",
      "id": 145,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 187,
      "content": "NTA. She pretty much dumped you, and then she expected you to spend additional money out of pocket so she could extend her vacation.",
      "id": 146,
      "comments": [
        {
          "score": 66,
          "content": "This. She knew all along that she wasn't coming back (and I'd wager that she \"met\" someone in Italy that she wants to spend time with).\n\nNTA.  I almost never go to the 'leave them' with these posts because that is the default for too many folks here, but in this case, leave her and be done with it is the best advice. She is breaking up with you w/o actually telling you right now.",
          "id": 147,
          "comments": [
            {
              "score": 9,
              "content": "It's the default, because the posts that get most traction on AITAH are normally batshit crazy.\n\nReal world, break up is rarely the answer, AITAH, break up is rarely not the answer.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}