{
  "post content": "so me (47M) and my wife (46F) have four kids (9F, 11F, 13M, 17M), and one of them is a trans guy (17M). my wife hasn't been the most supportive, we are working on it and I am fully on my son's side. (ik she is TA for this but this isn't what my question is about)\n\ntoday my son came down wearing boxers and a hoodie, my wife started to complain about how it's inappropriate to walk around like that, saying that it's too revealing. she told him to put some pyjamas on.\n\na few minutes my son came down in a pair of pink pyjama shorts my wife brought for him. she turns to him and tells him that he looks much better now. he laughs and tells her 'that's weird, these shorts are a good five centimetres shorter than my boxers' and had a huge smirk on his face.\n\nmy wife started complaining about his attitude and turned to me to get me to say something, I just told her that he's right. she's now pissed at me for not being a united front for our kids and encouraging that kind of disrespectful behaviour. so AITA?\n\nEDIT: just wanted to add that this is the first time my wife has taken issue with this, it's not uncommon for my daughters to lounge about in underwear and t-shirts. (also for those asking, there is no slit or hole in his boxers)",
  "id": 1,
  "comments": [
    {
      "score": 8569,
      "content": "NTA. And good on you for supporting your son. Plus, his initial clothes are unisex sleepwear. Your wife is just being petty.",
      "id": 2,
      "comments": [
        {
          "score": 4041,
          "content": "The son set the transphobic bait for the mother and she took it - hook, line, and boxer. He knew she'd be more accepting to a \"feminine\" piece of clothing based on her history of being unsupportive.\n\nIt's good OP didn't bite, too. Kids need at least one parent in their corner.",
          "id": 3,
          "comments": [
            {
              "score": 684,
              "content": "It's just toxic culture all around, how people are more or less-accepting of clothing based on gender....why does it matter what gender they are? Just like how much stricter dress codes in school are for girls than boys. Even though that's not the same scenario, it still falls under the umbrella of different treatment for people based on their gender, which is wrong.",
              "id": 4,
              "comments": [
                {
                  "score": 431,
                  "content": "If Amy wears something that shows cleavage, no one says anything.  If I show cleavage, it's all \"BearWeasel, pull up your fucking pants!\"",
                  "id": 5,
                  "comments": [
                    {
                      "score": 153,
                      "content": "This guy plumbs",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 35,
                      "content": "Say no to crack!",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "My usual response is that it would be far more conventient for both of us if they just didnt stare at my cleavage.\n\nI had the issue one in company provide work ware. \n\nTold the other person that fixing the fit of my company workware is out of my power, not staring at my ass is not out of their power.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Lol",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "\\*BeerWeasel",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Who is BeArWeasel?",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Sucks that people misspell your name just because you show some lower cleavage :(",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -4,
                      "content": "Where is your cleavage if you need to pull up your pants to cover it!?",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I had a friend in secondary school get told off because she was wearing shorts. Not the length of the shorts. The shorts themselves, she was made to go and change. When she told me, I pulled out the dress code (it was in our planners, we all had a copy) and showed her where it said that girls could wear shorts. She was so happy that she went to change back and confront the teacher",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Ugh or in the workplace. I've worked in an office that women where not allowed to wear tank tops, guys could wear them no problem, like wtf.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 2,
                      "content": "What kind of worklpace were you in that people were wearing tanks in the office, male or female?",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "Honestly, unless she's making actual progress towards not being a terrible parent, I wouldn't even still be with her. It would be a deal breaker for me. I would not remain married to a bigot, especially one that is actively causing mental harm to one of my children. She would need to either agree to go to counseling to overcome her outdated viewpoints and be a better mother to her son or I would be out the door.  This should absolutely be OP's hill to die on and I'm glad he's defending him.",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Omg yes that was truly so satisfying.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "HAHA! YES! This, very much so. \n\nOp, NTA!",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 215,
          "content": "Well... Did the boxers have a non-buttoning dick slit? Because that's an important difference. Even if boyo didn't have a dick to flop out, nobody is looking for a glance of pubic hair every time you sit funky.",
          "id": 20,
          "comments": [
            {
              "score": 171,
              "content": "[removed]",
              "id": 21,
              "comments": [
                {
                  "score": 230,
                  "content": "Huh? I’ve never known anybody (trans or not) who wears boxers over a pair of underwear. Boxers *are* underwear",
                  "id": 22,
                  "comments": [
                    {
                      "score": 147,
                      "content": "I've worn my fiance's boxers as lounge shorts before (so, with my underwear underneath)",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 120,
                      "content": "You obviously didn’t go to high school in the late 80s. Girls were wearing them as shorts.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 72,
                      "content": "[removed]",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 62,
                      "content": "There was a brief trend in the nineties (at least on my campus) that involved wearing boxers over long underwear. We don't speak about it.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 46,
                      "content": "I definitely did that as a teen.  I'm female if that makes a difference but lots of girls and some boys I knew used boxers as pajama shorts or for lounging, with underwear underneath.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 37,
                      "content": "Can confirm I’m a 21 year old woman who wears underwear under boxers to bed. It’s more comfortable and I don’t have to worry about the hole if I have panties underneath.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 30,
                      "content": "I wear boxer briefs over underwear when I wear dresses. The boxers don't deal with girl moisture but they do protect the thighs from chaffing",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 27,
                      "content": "I'm a woman. If I'm wearing boxer shorts, I am almost certainly wearing underwear underneath. \n\n\nYou have now officially met one person who does that.",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "Yeah you do, they just haven't told you. Many girls don't wear boxers as underwear but as shorts. It's kinda funny cuz they ARE underwear so essentially we're wearing two pairs of underwear.... but they're so damn comfy",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "My sister (21) wears underpants under boxers because she uses them as house shorts. I'm fairly sure our parents would not be interested in seeing straight up the legs while she's sitting down.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "Yeah I feel like that's the main thing here is we need two layers. But op's wife didn't point that out so nta if she had tho she would have been right.",
                  "id": 33,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I wish my old roommate did that. He used to lounge around in his boxers and a stretched Vneck t-shirt. His dick or a ball would periodically pop out and he thought it was funny. He did not care when we would repeatedly ask him to to cover up or wear something else.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 3,
                      "content": "[removed]",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I could still absolutely understand calling that inappropriate though. No one wants to accidentally see pubes, dick, vagina, or your underwear when you sit down. If it buttons or zips then that’s fair, but if it’s the open flap style then the actual shorts that zip up **are** more appropriate despite being shorter.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "mmm no. i would never just wear underwear around the house while there are other people, relations or not.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 2,
                      "content": "[removed]",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 47,
              "content": "I wear boxers all the time as a cis woman and have never had an issue with that",
              "id": 39,
              "comments": [
                {
                  "score": 11,
                  "content": "I wear my bf’s boxers all the time. Can confirm it’s not an issue. At least it never has been for me",
                  "id": 40,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Same here (for literally 25 years). My daughter does too and I've never gotten an \"unintentional flash\" nor has she. Perhaps it's an ill fitting issue with those who have?",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My mother, a 54 year old woman with 2 kids, sleeps in boxers. They're cheap and comfy.",
                  "id": 42,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "Yup that’s what I tell my husband when he insists that boxers are the same as shorts. When you sit funny with a pair of shorts on, I see your boxers. When you sit funny with a pair of boxers on, I get to see your floppy junk. And he def doesn’t button the slit either.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I had a couple pair of boxers at one point. Sewed the dick slit shut and they looked and worked just fine!",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "This is important. Why is no one talking about this?",
              "id": 45,
              "comments": [
                {
                  "score": 16,
                  "content": "Honestly this is the only piece of information I care about and my entire judgement rests on the result.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I know, right? If the person's bits are out or potentially out, then that is not acceptable loungewear, regardless of how long the shorts are.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -4,
              "content": "Yeah  ... wearing boxers with the slots wouldn't lead to pubic hair sucking out through it ....",
              "id": 48,
              "comments": [
                {
                  "score": 0,
                  "content": "You've got some weird ideas my friend. \n\nWhen a girl with big boobs wears a giant loose button up t-shirt and no bra, would you get glances at her cleavage from her boobs sucking out through the holes?",
                  "id": 49,
                  "comments": [
                    {
                      "score": -4,
                      "content": "You do realise boxers without buttons like you specified usually have several inches of overlapping fabric, whereas shirts tend to not overlap massively ....\n\nSo for hair or a dick to stick through it unintentionally would take some immense effort.",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "No, shes being a bigot.",
          "id": 51,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "My parents got me(female) Batman boxers(from the men’s section)for Christmas one year. I’ve had them like 7or so years and I still wear them as sleep shorts. They’re actually my favorite and probably the longest sleep shorts I own.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Fr. I'm a girl yet I sleep and wear boxers all the time, I just don't leave my room in my underwear.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2881,
      "content": "NTA - I know there is a sect of parents out there who think you should always side with the other parent in front of your child and then in private raise any concerns \n\nI don’t agree with that\n\nSometimes you need to stand up for your kid when they can see it\n\nYou need to show them that tou will back them up when someone, including their other parent, is being unfair to them\n\nThat’s what you did here \n\nYou showed your son tou have his back when anyone, including his mom, is being unfair to him",
      "id": 54,
      "comments": [
        {
          "score": 565,
          "content": "Yeah, 100% agree with this. If my wife has flown off the handle at one of the kids, I call her on it. And there are times when I'm being unreasonable and she tells me so, in front of the kids, and I appreciate it.",
          "id": 55,
          "comments": [
            {
              "score": 232,
              "content": "Yeah there are times to back up the other parent and then speak it out in private\n\nAnd there are times to show your child that you have their back",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "My wife and I do this too.\n\nKids can be and frequently are unreasonable and parents need to model good reason and behaviour. It’s impossible to do this all the time, and even more difficult when one is frustrated at dealing with a kid.\n\nIt doesn’t mean that the parent is a bad person for reaching frustration, and it’s so important for a partner to step in and provide an outside perspective.\n\nMy wife and I do this all the time, and it strengthens our family considerably.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 470,
          "content": "It would be one thing if it was \"we need to be unified when the teenager asks to go to a party\" NEVER, EVER \"let's be unified while I emotionally abuse and harass our child.\"",
          "id": 58,
          "comments": [
            {
              "score": 81,
              "content": "And if you are, be prepared to be unified in never seeing them again. *cough dad*",
              "id": 59,
              "comments": [
                {
                  "score": 1,
                  "content": "One internet “Dad Hug” for you, redditor.  Wishing you the best.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Aw, thank you. Most of the time, I’m over it. But I’ll be honest, my oldest kid is getting to the age where I really remember the emotional abuse and I just try to picture myself saying some of the things that were said to me, and I can’t see how anyone could do that. It’s ripping open old wounds.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "Bingo!",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": "Yeah, standing with the other parent is for when one parent says no it’s bedtime, you can’t watch anymore tv, not for when a parent has dual standards for trans and cis children.",
          "id": 63,
          "comments": [
            {
              "score": 66,
              "content": "Yeah United front is when one parent is saying \n\n“ no you can’t have ice-cream for dinner”\n\nIt’s not for when one parent is being utterly and completely unfair to a child \n\nLord of parents forget that it’s their job to protect and defend their kid from everyone, including the other parent if need be",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 85,
          "content": "Typically I agree you should take your partners side in public. But not in all situations, especially this one where wife is being transphobic",
          "id": 65,
          "comments": [
            {
              "score": 49,
              "content": "Yeah, sometimes you have to show a United front\n\nBut if your partner/other parent is being truly unfair to the child your need to stick up for the child",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "[deleted]",
          "id": 67,
          "comments": [
            {
              "score": 62,
              "content": "Different strokes for different folks\n\nI strongly believe that kids need to see their parents stand up for them in public, even against the other parent\n\nStanding up for your kid in private doesn’t really accomplish the same thing since they don’t know you did it\n\nBut what works for you guys works for you guys, every family works differently",
              "id": 68,
              "comments": [
                {
                  "score": 47,
                  "content": "Going along with injustice because \"UNITED IN FRONT OF THE KIDS\" is the last \"value\" I want to model for my kids. Totally NTA.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I think it depends on the underlying situation.  Ideally, both parents are treating the kid well and so defending the kid from the other parent isn't necessary.  Of course, the world is not ideal.\n\nSometimes a kid is feeling like things are unfair when it really is just normal discipline though, like having bedtimes and doing chores.   That's the kind of situation where parents need to hash things out in private and not overrule each other.  There are a looot of situations where two parents can come to equally valid but different parenting decisions, and it's important to respect that.\n\nOther times a parent is actually acting badly, and they should absolutely be called out on it so the kid knows they weren't doing anything wrong, their parent really is in the wrong here.  \n\nOP's wife is trying to treat the situation like the former when it's the latter.  She's not owning up to what she did wrong, or she's trying to downplay it by making it out like everyone behaved badly.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "[deleted]",
                  "id": 71,
                  "comments": [
                    {
                      "score": 22,
                      "content": "I think emasculate isn’t exactly the right word there.",
                      "id": 72,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "even in public you’re a shitty parent if you don’t defend your kid. it doesn’t matter where you are or who you’re around. kids should be taught to question authority, including parents. not feeling safe questioning authority is what results in kids being groomed and abused and taken advantage of. predators go into positions of authority hoping parents like you will be raising more kids who have been taught they’re in trouble if they ever question authority.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "I mean, I think it's important to be a united front when enforcing rules that everyone has agreed upon. Like if the kid knows they will be grounded for breaking curfew, they come home super late and the mom goes \"you're grounded\", it would be super shitty of the dad to say \"nah, let's just let it slide\". But in this case OP said there is no rule against being in underwear, and the mom lets her daughters wear just panties and t-shirts all the time. So OP is definitely NTA, he's just trying to keep things consistent for all his kids.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Not to mention it teaches the kids that whether right or wrong they have to side with anyone they are in a relationship with which is entirely another can of worms.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I side with my wife if I can get behind her point or view. In that care yeah it's obvious she was being ridiculous",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "My mother has always done this with my toxic dad, believing that if the kid sees the parents arguing it will lead to divorce. \n\nI hate it. I never felt like she was on my side and probably affirms my dad’s shit behaviour even if she later tells him his actions were wrong. \n\nUgh. I look forward to therapy.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "That goes out the window when dealing with a 17 year old.",
          "id": 78,
          "comments": [
            {
              "score": 5,
              "content": "How so?",
              "id": 79,
              "comments": [
                {
                  "score": 26,
                  "content": "You need to be a united front for small kids, because you both need to maintain authority. It makes sense and is a smart tactic.\n\nAs them child gets older, they are more intelligent, and know more about what they want. These things are far more complex than \"little kid problems.\" Three intelligent humans are not going to agree 100% of the time. So you can't stick to that rule add they get older. 17 is quite mature so by then I would say you have to give up being obtuse on the united front.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 940,
      "content": "NTA Your wife was rightly called out. The shorts were shorter than the boxers so it wasn't about being revealing - your wife didn't like the boxers but was ok with pink shorts and ok with the girls in underwear around the house. Plus - blech as long as important bits are covered nothing should be considered \"revealing\" to your family unless you're sexualizing them.",
      "id": 81,
      "comments": [
        {
          "score": 200,
          "content": "Agreed and i am a woman but wear boxers to bed because they cover more.",
          "id": 82,
          "comments": [
            {
              "score": 62,
              "content": "I have so many pairs of men’s boxers and boxer briefs. They are so comfy for sleeping or lounging around the house.",
              "id": 83,
              "comments": [
                {
                  "score": 28,
                  "content": "So much yes. My favorite set of pj’s is a red t-shirt with red plaid boxers. For winter it has a long sleeve red shirt.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "PSA for brands like Woxer- boxer briefs for women! They are awesome and all I ever wear since trying them out",
              "id": 85,
              "comments": [
                {
                  "score": 1,
                  "content": "That just sounds like boxer briefs with pink tax added...",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "That really depends on the family, no one in my family would ever wear underwear around the house, and it would be super shocking if someone did. However, if the standard for the house is that it's ok, then it's just pure discrimination to say that some people can and some people can't.",
          "id": 87,
          "comments": [
            {
              "score": 31,
              "content": "As my mom mentioned when I was a kid - what's the difference between underwear and a swimsuit? Assuming the non see through kind not much.",
              "id": 88,
              "comments": [
                {
                  "score": 17,
                  "content": "Some girls don't like to wear bikinis either. Nothing wrong with that, everyone's got their own comfort levels.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I think its intention amd material. Swimsuits tend to be thicker material. Its one of those weird things though",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Intention, expectations and consent from the one wearing it to be seen in it. Also kinda consent from the one seing it because it goes both way.   \n\nAs in, if I invite my friend B to the pool, we should both expect to see and to be seen in a swimsuit.   \n\nIf at à later date friend B barges on me while I'm in my underwear, it doesn't matter that they've seen me in a swimsuit before, I didn't plan or want them to see me right now in my underwear.    \n\nThe same way, if we're having a snack in my kitchen, it's uncouth for me to walk around in my underwear without telling them beforehand, because it's not expected for me to only be in underwear and the fact that they've seen me in a swimsuit before has no bearing on them being confortable with this different situation. \n \nIf I tell them beforehand and they still come, it's informed consent on their part. If they knock and my door knowing I'm in my undies and I say '' come in'' it' s active consent on my part for them to see me like this.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Well this specific family has already decided that walking around in underwear is ok (see the sisters).",
                      "id": 92,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Same, my family never wore underwear around each other, so I never would and would be surprised if I was visiting now and someone did, but yeah, if some kids are allowed to the other should be too if they want. \n\nNot related, but my MIL usually just rolls out of bed and wears just her nightgown while cooking breakfast when we visit, I thought it was kinda weird the first time it happened, but didn't say anything ofc since I was a guest, and got used to it. Maybe because her breakfasts are amazing, so now (in my head) I'm like, wear whatever you want, this is delicious! Lol",
              "id": 93,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 464,
      "content": "NTA\n\nAnd as a trans dude, thank you for supporting your son",
      "id": 94,
      "comments": [
        {
          "score": 219,
          "content": "You guys deal with the weirdest double standards.\n\nMy spouse dealt with ALMOST this same situation when they moved in with my family and I before we got our own place. Pre-transition walking around the house in booty shorts? Acceptable. Post-transition wearing a pair of my old PT shorts? Salacious and unacceptable. SOMEONE MIGHT SEE!\n\nI snuffed that shit like OP did.",
          "id": 95,
          "comments": [
            {
              "score": 47,
              "content": "The weirdest thing with my family is that some of them get weird about my clothes. \n\nI have literally changed nothing except I swear less skirts not none, just less 😂\n\nI've always lived in shorts/jeans and t-shirt. Like since I was five. I'm closing in on 40. But suddenly it's weird to some of them.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -23,
              "content": "Good for you.  My only rule has been to add that everyone needs shorts/bottoms on. Idc how long or short, but it needs to be more than undies or boxers.  My trans son wanted to lay around in boxers and a blanket all day long, I told him, look you live in a house with an adult male you're not related to (my bf), it's just better to have something besides underwear even if they're boxers.",
              "id": 97,
              "comments": [
                {
                  "score": 46,
                  "content": "> you live in a house with an adult male you're not related to (my bf), it's just better to have something besides underwear even if they're boxers.\n\nThis is scary to read. This is victim blaming. The onus should *NEVER* be on the child to make themselves less \"attractive\" to the perpetrator. And if you think your boyfriend is the type of person to sexualize your child, why is he your boyfriend? There are several layers of fucked up shit in this comment. \n\nRevealing clothes don't cause rape. Rapists cause rape. Don't buy into victim-blaming bullshit and don't preach it to your kids.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Yeah that part made me twitch. Just. Don't date people you worry about raping your children.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "[deleted]",
                      "id": 100,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Dude I'm not worried about my boyfriend.  I'm worried about my mentally Ill and potentially dangerous ex husband making unfounded accusations when I havent been able to secure a permanent restraining order because the 'abusive events' were not severe enough and the 20 years of abuse not considered recent enough to warrant the restraint.",
                      "id": 101,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "Why- why are you dating someone who makes you feel the need to put child molestation prevention rules in place for your children????",
                  "id": 102,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Uh. I'm not.  I have a seriously mentally ill high conflict ex husband who would and has twisted anything he doesn't like about my life without him (exh) into something sinister.  Because my exH constantly misgenders our son, brings up subjects that trigger my sons dysphoria, gaslights my son, and tries to manipulate him.  Because I have had to have multiple ROs over 5 years from exH, but nothing was considered \"significant\" enough to stick for more than temp periods.  Because exH would blow things out of proportion like my kid sitting around in underwear in the living room with my partner around.\n\nExh also escalates my autistic sons behavior by causing him to stim in a negative way and exH thinks I should do everything for my 24yo because he is autistic instead of letting him work toward independence.",
                      "id": 103,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -25,
          "content": "[removed]",
          "id": 104,
          "comments": [
            {
              "score": 23,
              "content": "Nope, a trans *man*",
              "id": 105,
              "comments": [
                {
                  "score": 16,
                  "content": "Oh hon, that person is a transphobe as evidenced by their post history. Not worth your time. But I do appreciate it. Report them and forget they exist 💜",
                  "id": 106,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Fun fact, these not only violate our rules but also reddit's sitewide rules.  So thank you for the report and keep it up everywhere you see it!",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 108,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 273,
      "content": "NTA. Sorry but I'll never present a united front with anyone who's hurting my child; if they want a united front they'll have to come unite with the non-asshole side. You did the right thing.",
      "id": 109,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 152,
      "content": "NTA. In general, yes, it's best to not contradict your spouse when she disciplines your child, but that only applies to situations where reasonable people could disagree. Your wife is not being reasonable here, and given the transphobia you've mentioned, it sounds like her actual discomfort was in seeing her trans child in boxers because they're for \"boys\", not because she has any issue with the kids being in underwear. You are right to protect him from that and make it clear to her that you won't stand for it.",
      "id": 110,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 129,
      "content": "INFO: Is Mom's issue length or type of clothing (i.e. pj pants versus underwear)?",
      "id": 111,
      "comments": [
        {
          "score": 155,
          "content": "I think it’s more the fact that what he was wearing was more masculine and him wearing the pink shorts was more “feminine” like she wants.",
          "id": 112,
          "comments": [
            {
              "score": 31,
              "content": "I don’t know man when I think boxers I think a little hole where you’re dick can come out. It’s improper for men to walk around like that.",
              "id": 113,
              "comments": [
                {
                  "score": 10,
                  "content": "Why would that be an issue here?",
                  "id": 114,
                  "comments": [
                    {
                      "score": -62,
                      "content": "Trans men are men I’m assuming they have the proper equipment and wearing boxers out around certain people is not appropriate. Like at a certain point I’d get mad at a dude I lived with if he was always in his boxers around me.",
                      "id": 115,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Whenever I used boxers as house shorts I always just safety pinned or sewn the slit together. Or there's boxers with buttons, there are many ways to fix the hole problem",
                  "id": 116,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": "the problem is definitely that mom is transphobic and wants her son to be her daughter seeing as OP said she had no problems with her daughters wearing t shirts and underwear but as soon as her trans son wears masculine underwear it’s an issue",
          "id": 117,
          "comments": [
            {
              "score": 24,
              "content": "It definitely sounds like the issue is transphobia.  But there’s underwear and underwear.  Traditional boxers just have a slit fly.  Depending on the cut and material, I expect that could be a much bigger issue than the length of the shorts.\n\nThat said, if that was the actual objection I’d guess OP would have mentioned it by now.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "That edit was made after my comment.",
              "id": 119,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": "Or do the boxers have a whole in the front? I wear my husbands boxers to bed but not around people because I can flash some pubic area depending on how I sit.",
          "id": 120,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "That was my thinking. Also, boxers usually have an opening in the front. I've been around a few dudes with wardrobe malfunctions that way. I think it's definitely inappropriate lounge wear.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Everyone keeps jumping to the trans issue. Without more info from op, I 100% see this as a kid walking around in their underwear issue.",
          "id": 122,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 58,
      "content": "NTA, as a trans person knowing your son has a parent like you brings me so much joy. \nWhat your wife said was not on at all, besides if there’s no guests and your bits are covered, nowt wrong with being in your pants around your family, if anyone should be desensitised to some skin it should be the people who wiped your bare arse for years",
      "id": 123,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 50,
      "content": "NTA. So, I’m typically all about presenting a united front, but this is different as it involves your child’s identity. Your wife had a double standard and your son called her out on it. The truth hurts.",
      "id": 124,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 40,
      "content": "I wear boxers as bedtime shorts. I’m a woman. \n\nYour wife’s transphobia is a problem. NTA but please protect all of your kids from her toxic behavior.",
      "id": 125,
      "comments": [],
      "relation": "Support"
    }
  ]
}