{
  "post content": "Still at the cottage and my wife isn't talking to me. It's not even our cottage, it's my parents' and we were supposed to be here to work on our marriage because we've been having issues. Not huge issues, but issues. Nobody's cheated or gambled all our money or anything. But she couldn't stop messaging her fucking \"writing friend.\" All they do is talk about their characters or roleplay them with each other. My wife is looking for a serious career in writing, and she is a great writer, but this is literally just for fun. She's never going to publish this gay dark academia borderline fanfiction she's writing, and she knows it (this isn't my opinion, she's said this). I mean I would still be pissed with her working while we're supposed to be spending time together, but this is worse. I told her I wanted her to focus on me and our relationship, and she said she would, she's just had a new stream of ideas she can't control. Which again, I could excuse if this was publishable stuff, but it's just her and her friend pretending to be two university students in love.\n\nBut I did something really shitty. I tried to initiate with her last night, and she rejected me, which is fine because it happens obviously, nobody's in the mood all the time, but then she just went right on her phone fucking roleplaying these guys. I grabbed her phone and threw it out the window. The phone is fine, she has a good case (which I knew, I wasn't trying to break it), but she called me a piece of shit and a ton of other things and isn't speaking to me today. I know no matter what I'm the asshole in all honesty, I'm just curious over whether this is an everybody sucks situation or not, and I have nothing else to do because she won't talk to me.",
  "id": 1,
  "comments": [
    {
      "score": 12421,
      "content": ">but it's just her and her friend pretending to be two university students in love.\n\nI think them being university students is only part that's pretend.\n\nEdit. ESH her more so though I understand the frustration but. But tossing the phone out of the window was a little over the top.",
      "id": 2,
      "comments": [
        {
          "score": 1680,
          "content": "Well, arguable. I use to do a lot of RP writing with a few friends and wrote a LOT over time. More often than not it was romantic stuff because it was just more fun to write about as for us there were usually a lot more entertaining ideas surrounding that. It was a good outlet for me, I loved writing and the feeling of getting into someone else’s headspace for a a bit. \n\nThat said, in my experience, though it by no means what so ever refers to everyone into RP, toxicity was common place. Especially in large communities. Eventually it got so bad that I ended up only ever writing with two at the time good friends because I trusted them to keep the drama low and to value our friendship over writing. I was wrong. These two had many other issues but it primarily had to do around RP and their expectations.\n\nAfter a bad break up I was in at a real low point in my mental state, and at first I dived right into RP hardcore just looking to escape my own headspace for as long as possible. When I started to get better and move on and started dating the man I’m with now I had less time to write. These two were constantly guilt tripping me for not responding or contributing ideas, when I said I was trying to work on myself and not my characters that was not an acceptable answer. They manipulated me into thinking I was an AH for not using all my free time responding and said I was making their character’s feel neglected. Keep in mind they didn’t feel this way, it didn’t matter how much I talked to them, their character’s felt neglected because I wasn’t writing enough for their needs. \n\nThere were many other problems between us, but this is what started it and what eventually lead to them deciding that I was “too millennial” and they didn’t want to speak with me ever again. In the middle of the night after not talking for a while I got a message from the one I was closest to that was a long winded goodbye that made me feel like absolute sh!t for having my own life and trying to better myself. I cried for and hour because she was the closest friend I had ever had and I felt like my heart had been torn out. It took me a while and talking about it a lot in therapy to accept that they had very unrealistic expectations for me and I wasn’t at fault. \n\nOP I won’t deny that throwing the phone was an AH move but I understand your frustrations. if I were you I would ask if she’s being pressured by the other party to respond and discuss as often as possible. If not maybe express that you understand this may be her outlet during an emotional time, but you’d really appreciate if she could talk to you about it instead of throwing herself into someone else’s headspace. I learned the hard way that though it may feel better in the moment, it doesn’t help you heal in the long term.",
          "id": 3,
          "comments": [
            {
              "score": 557,
              "content": "Also, just want to add... how is OP's wife emotionally? Does she have a mental illness? ADHD? RP is a guaranteed dopamine hit and every response is another drop. If she's feeling depressed, she might be hyper focusing on the RP because it's the only thing making her feel good.\n\nOP, you're NTA. I'd have been frustrated as well. But maybe something else is going on that is driving your wife to obsess about this RP.",
              "id": 4,
              "comments": [
                {
                  "score": 276,
                  "content": "As a former teenager who was neck deep in this sort of thing and definitely using it as an escape/dopamine hit to counteract undiagnosed depression and anxiety - Yep, OP is NTA.\n\nBut if he really wants to save the marriage it sounds like something they need actual couple's counseling/likely individual therapy for as well, not just an attempt at a couples retreat to a cottage.\n\nThat or go somewhere VERY remote with no cell service/no wifi to guarantee no distractions, but if she's actually that addicted to it (like I was/a lot of other have commented here) she may refuse or just be very irritable while they're there.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 143,
                      "content": ">That or go somewhere VERY remote with no cell service/no wifi to guarantee no distractions\n\nIt's like you **want** them to be dismembered by a huge guy with a hockey mask and a machete.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I relate so hard to this post, thank you.   \nI harassed my friends hardcore as a teenager over roleplay (I still feel terrible about this, even now in my 30's), my home situation was rough (my mother is/was severely emotionally abusive), and I had undiagnosed ADHD, anxiety and depression. Roleplay was an escape, a bonding experience, and a dopamine hit all in one. No wonder I was like an addict.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 164,
                  "content": "In my humble opinion— screw that. She’s an adult, and her possibly having ADHD and hyperfixation does not excuse her lack of emotional responsibility. She should know how to regulate herself ENOUGH to talk to her husband, and the diagnosis would warrant no pity on my end.\n\nEdit: Jokes on you, people, I’ve had ADHD too the whole time!",
                  "id": 8,
                  "comments": [
                    {
                      "score": 70,
                      "content": "Not excusing her behavior because ultimately we're responsible for our actions, but this sounds more like an addiction. People typically can't just easily quit addictions, and it doesn't matter if that's smoking, drinking, heroine, World of Warcraft, or apparently RP fan fiction writing. Sounds like she/they need actual therapy.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 195,
              "content": "Okay, wow, that was an interesting insight.\n\nI never did something like that, but I had a friend and she let me read her stuff and I love it, but it got really exhausting bc she would not stop harassing me to talk about it, for feedback, for new ideas, etc. I think she wanted me to join in. I had to stop the contact bc no matter how much time I spent with her, she would not stop guilt tripping me for every second of my free time and I had way too much going on in my life and to work on myself.\n\nNow I think I understand, what might have gone on in her head.",
              "id": 10,
              "comments": [
                {
                  "score": 33,
                  "content": "This all gave me flashbacks to how I was RPing with 3 people. Two of them apparently had crushes on me and the third used me as a sort of outlet from her abusive husband (that at first I was find with but it got weird).\n\nThe two crushes likely developed from our RPs being romantic. I've found other people have had similar situations where they seem to \"fall in love\" with the story and equate it to the writer.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Reading friends' writing always comes with so many risks there should be a safety warning. In my case I agreed to read something and it turned out to be X rated Sonic the hedgehog fanfiction and I had no idea how you're supposed to offer feedback for that.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 135,
              "content": "I agree with so much of this! I'm sorry your friends made you feel terrible. The only part I want to add is that I used to roleplay a lot like it's how I spent 3-12 hours every day. This went on for a few years. But it always heavily tapered off when I wasn't trying to escape something in my life or when I had something exciting going on. Like a romantic relationship. I would just have a really, really honest conversation about how you need more attention and ask why she thinks it's preferable to spend time roleplaying over spending time with you. Because that's very telling / concerning if it's as bad as you seem to be saying.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Fellow rp'r here. \n\nThere is another aspect of roleplaying there needs to be considered here, specially when it's a romantic/guyxguy thing she is writing with this friend. \nThat's the sexual part. Is that a part of her rp too? \nI couldn't really figure out through the post.\n\nERP is something that should, at least in my head be discussed with your partner, as not everyone (specially someone who doesn't write/rp) make the line between \"oh its just text\" and \"your characters are having sex?? What the heck are you cheating on me?\" \nAnd some... gets addicted to being in someone else's heads pace as you say. The emotions that follows and not everyone can make the full distinction \"this is my feelings\" \"this is my characters feelings' and it ends up all mixed up.\nBeing it romantic awww moments or feeling desired.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "NAH. I used to RP a lot at one point too and can confirm so much of what you said applied to me; those are bittersweet memories. RP can get all consuming when you get into that headspace. For me, it was about the writing and I met some great people, two who have become real life friends, but boy, your character is your baby - the attachment to someone you created can get really hard to shake. Community toxicity happens too so my friends and I RP'd away from all of that. Eventually, the need to get back to life happens and your wife sadly isn't in that place right now. Is there a way to have talk for when she's calmed down, perhaps create times where she puts her phone down and shut off and re-shifts her focus on your relationship? Get yourselves out in nature. This kind of compromise might be all you can get right now - I can't stress enough how addictive this stuff can be. Good luck OP.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1260,
          "content": "Not necessarily. I write/RP with friends and while a lot of times our characters are together, I'm not in love with the person writing them. But then again I can take breaks and spend time with my family sooo maybe you're on to something.",
          "id": 16,
          "comments": [
            {
              "score": 626,
              "content": "I'm sure you wouldn't exclude your partner when your marriage is in crisis though.",
              "id": 17,
              "comments": [
                {
                  "score": 1792,
                  "content": "I wouldn't be too sure. Long time roleplayer, and I've known someone who lost her job and put herself at risk because she was obsessing too hard over a roleplay.\n\nIt's my personal belief that there are some people who use escapism into fantasy the same way others might have a work or gambling addiction. It's avoidance of the real world. It soothes you and makes you feel in control again, and gives a solid dopamine hit from the sense of accomplishment arising after hitting send on a well-written post. I've been there. I've avoided pain in the real world through escapism. There's risk that the more the marriage is in crisis, the more she'll turn to roleplaying to avoid sitting with the problem and dealing with it. \n\nDealing with a relationship in crisis is hard and painful. Even when people aren't using an obsession as an emotional crutch, people avoiding confronting and showing up for that kind of problem all the time.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 315,
                      "content": "Exacrly right. Addiction is basically finding something that gives you that good feeling and continuing to do that to deal with life. It is also where some eating disorders originate.\n\nSome people also just have brains with chemistry that support this addictive behavior.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 314,
                      "content": "it's called maladaptive daydreaming, and is a very real thing.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 112,
                      "content": "Exactly this. I've definitely gone through heavy addiction with roleplaying in the past to the point that whenever I left a site/stopped writing for whatever reason, I actually went through withdrawal. Like with the physical pain and everything.  It sounds ridiculous, but really anything can become addicting to a person.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 101,
                      "content": "Can confirm every word of this.  It happened to me, and I almost lost the love of my life forever cause I was so much happier in my world online than in reality.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 90,
                      "content": "Hmmmm. I'm a recovery alcoholic, 7 years up. I yammered on about this epic historical series I was going to write for years prior to getting sober and wrote most of the first installment in the first three months of recovery. For three months, I didn't do much beyond eat, sleep, work, AA meetings and write. My character was as real to me as my family. She was all, don't drink and write your novel, so for lack of anyone wiser to listen to, I didn't drink and I wrote my novel. \n\nI do wonder if that's the same behaviour you're talking about.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 57,
                      "content": "Yep, can confirm all of this. (I've done roleplay in the past, so I got exactly what was going on in OP's story.) I've known lots of people in the hobby who lost out on jobs or who sit at home and do nothing but roleplay all day. It's definitely a problem someone can have, especially if they get addicted to the escapism aspect of it.\n\nThat said, roleplay can be done in a healthy way. It sounds like OP's partner needs a 'come to jesus' talk about this, and some time and therapy to learn the difference between a hobby and an addiction.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "This is what I was thinking. Kind of how some people obsess and disassociate over video games. She's just doing it over writing. Pretending to be in love in way easier then actually working on your real life marriage",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Take my poor person's award, kind stranger 🏅🏅🏅",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Wow.  Nailed it.  I didn't know what I thought about this situation until I read this post.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 140,
                  "content": "But I think the point is just because the material is romantic doesn’t mean the relationship between the writers is. And that assumption distracts from the real problem which is that the wife is clearly checked out of the marriage.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "That's true, I wouldn't. I had a partner who disliked it and insisted I was cheating (he actually was lmao) so I stopped for a while.",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "A textual relationship comes with a lot of pros and few cons.  You get all the good feelings and attention.  None of the socks left on the floor or no one ran the dishwasher, who is picking up the kids from soccer practice, OMG there's no more milk in the fridge.  None of that exists in the roleplaying world unless you want to build it in.   Everything is clean, everything is stocked, your partner travels with you on the phone and is always with you so no worries on who picks up the kids.  You both are going to get them, wheeee!   \n\nWife needs to put away the fantasy world and work on her real world, or the fantasy is all she's gonna have.  \n\nLet her sulk, OP.  I've been your wife but not at the same time with a serious relationship.  Much less a MARRIAGE.  Text relationships are fun and games, but that's all they are.  Kinda leaning towards ESH but i'm not sure how else for you to get her attention unless you both turn your phones off for a few hours",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 246,
              "content": "Also came here to say this, I write and RP with my friends (rather obsessively at times) and it's definitely not romantic even if the plots are. But yeah moderation is the key here.",
              "id": 31,
              "comments": [
                {
                  "score": 92,
                  "content": "Same. I always had a very hard boundary of NEVER RPing with real life men. I'm attracted to girls too, it wasn't about me, but more about... I've had men get attached to me in the past and it's a huge problem. So, to avoid that, I was very picky with my RP partners and made sure to only RP with people I that were 1. decent writers and 2. RPed with other people and not JUST me.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "I did this with friends when I was in high school/college, too—I had no idea that girls pretending to be guys having sex with each other was such a popular thing! I would totally still be doing it now but the friends in question started families and it dropped off.\n\n\nI can totally understand the obsession with it, and how it’s not at all a sexual thing with the author of the characters. But still, sounds like OP is feeling neglected, and that is a valid feeling that the wife should be willing to discuss. If she thinks the relationship is worth salvaging.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "Yup, have totally roleplayed romance with people I am absolutely just friends with (though I do have the most fun roleplaying romance with my actual boyfriend). Some people definitely take it too far, though. I have seen actual affairs form because of roleplaying. There was also a guy who logged into our roleplaying chat ON HIS HONEYMOON to roleplay a romantic scene with another player. It was... weird.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Agreed, I do the same thing with my best friend and it can be like a stress relief type of thing for me but it can also be super stressful.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 739,
          "content": "Yeah. Sounds super sus.",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 219,
          "content": "I disagree.\n\nI do \"play by post\" roleplaying which is what I think the wife does. It's basically just collaborative writing. Some people do it one-on-one, others do it on sites in big groups (I'm talking dozens of people).\n\nI've been doing it 12+ years and it's never been anything more than that. Writing characters in a relationship, or \"shipping\" them, is just a natural part of writing characters. Again, nothing inherently sus about it. I've never had anything more than friendship with the dozens of people I've written with over the years, but I HAVE made some really deep friendships. Like, \"I tell them stuff I don't tell anyone else\" kind of friendships.\n\nSo, from my pov I don't see anything wrong with what the wife is doing. It's collaborative writing, it's not for everyone, and that's fine. What isn't okay is her ignoring her husband in favour of it... Although with his first reaction being to throw & try to destroy her property, it's not hard to imagine why she's so disconnected.\n\nESH",
          "id": 37,
          "comments": [
            {
              "score": 56,
              "content": "maybe there is nothing wrong with it in general, but they are on a getaway to work on problems in their marriage. She should disconnect for a time.\n\nThrowing the phone was not ok, sonI agree ESH.",
              "id": 38,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 55,
              "content": "It doesn’t seem like it was his first reaction, but I agree with everything else.",
              "id": 39,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Came to post this same thing.  I do collaborative writing rpg, have for nearly 20 years, it’s really fun and a creative outlet.  Not all the lines are romance or sex (I have a game based on Jane Austen characters and kissing or even being alone unchaperoned is scandalous.  But sounds like she is using it as an escape from a marriage she has issues with instead of working on them with husband. Just like literally any hobby, it can be productive or destructive.  The problem isn’t RPG, it’s their issues.  And throwing a phone out a window is not good behavior no matter if she had a good case or not.  ESH for sure",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Have you ever prioritized writing the erotic roleplaying with one person, over partner and relationship though?? \nThat's the issue here and, what makes it look very much like there's more than just writing role play for fun going on. It's not the writing roleplay itself that's the issue but circumstances and context around it.",
              "id": 41,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 115,
          "content": "Not really. Role-playing romantic stuff when you're just platonic friends is very common. I did it all the time when i was 12-13, and it turns out i'm aromantic as fuck.\n\nThe best way i can explain it is that most role played characters (with the exception of self-inserts) don't represent who the person roleplaying them is. You tend to view them like an OC or a DND character and not \"me.\" There's a detachment there. So when doing romance roleplay, it's not \"i'm in love with my friend,\" it's \"character A loves character B.\" It's like living vicariously through fictional characters.\n\nThis same sorta thing can extent to erotic roleplay, though it's less common (i think. I've never done it). Like getting off to the fictional character or the scenario rather than the real person. Granted, if somebody's doing erotic roleplay, there's more likely to be some sort of attraction at play? I'm not as familiar with that scene, i'm asexual af",
          "id": 42,
          "comments": [
            {
              "score": 3,
              "content": "Yeah, my friends and I would often plot stories and ideas and ship our characters together because it was fun and cute. I didn't want to get with them (well I did marry my spouse but the others were just friends).",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 103,
          "content": "Yup.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Nah, I rp characters with a friend, and some of our characters are in relationships.  No romance between me and her; it's fiction.  So while OP's wife might be different, it's entirely possible she's not.",
          "id": 45,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "NTA - Creative writing aside... \n\nShe agreed to spend time with you to work on y'all's relationship. She did not do so. She's emotionally cheating on you at the least.\n\nYeah, it was petty to throw the phone but what is worse than that is your gf lying about wanting to salvage the relationship. Actions, dude.\n\nI have a passion for writing, especially creative writing. But, if the side hobby started affecting my relationship I'd put effort into prioritizing my partner, with the assumption I cared about my relationship that is.\n\nYou can read all these comments about everyone's own personal experience with role playing, yeah sure. But, that still doesn't excuse her actions. \n\nIf she respected you and your relationship, she would put actual effort towards it instead of empty words... \n\nThink about it man. Good luck.\n\nEdit: Yo, that's your wife? My bad, im baked and. It's worse than I thought.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5430,
      "content": "ESH. You for the phone incident, and likely misinterpreting intimacy signals, and her for not being honest that she doesn't value the marriage. She's not into you.",
      "id": 47,
      "comments": [
        {
          "score": 1783,
          "content": "This. I’m a full time writer and while it’s easy to get plot bunny brain it doesn’t require texting all of my friends. At worst I tell my husband “hold on, let me jot this down” and then turn back to him. I would never ignore him while on a vacation. That’s rude no matter what. \n\nIt’s understandable why this marriage is on the rocks.",
          "id": 48,
          "comments": [
            {
              "score": 237,
              "content": "Yes exactly. Writer too and plot bunnies happen and I have a note on my phone I keep them all one so I don’t have to constantly interrupt life to write. Just a quick note.\n\n(Although sometimes I go the note later and go “wtf was I talking about?”)",
              "id": 49,
              "comments": [
                {
                  "score": 6,
                  "content": "\"like flaming globes of Sigmund\"\n\n(google it if you feel like it)",
                  "id": 50,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 214,
              "content": "Exactly. I have a Google doc on my phone for ideas that pop up suddenly and then I incorporate them later if I am busy at the time.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I do that kinda thing all the time, except I get an idea then the next thing you know I’ve got 6 more pages than I had before I had the idea about giving the main character a cat who chills outside their apartment that gets all the scratches and snoot boops whenever the main character walks past.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 239,
          "content": "Just here to say that’s not necessarily the case. I write and roleplay it never means I’m not into my spouse. It just means I’m coping with something if I’m immersed in it like this. For some it’s a coping mechanism and a sense of control when we otherwise don’t. It’s also a huge hobby and she shouldn’t be made to feel shitty for her hobby. HOWEVER, it is affecting her marriage even when she’s meant to be working on it. I get his frustration.",
          "id": 53,
          "comments": [
            {
              "score": 378,
              "content": "ESH, and I gotta say, as a fellow creative type and writer, this woman is having an emotional affair. I also roleplay with friends, for writing purposes or just for fun in table top rpg settings. There is a line, and she's crossed it.",
              "id": 54,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 287,
              "content": "That may be the case in your marriage but obviously not in this situation. OP and wife are literally on this trip to the cottage to work on their marriage, but she’s so obsessed with her fanfic and disengaged from her marriage that she’s still working on it instead of her marriage. This relationship is dead and she’s obviously not into OP anymore.",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 47,
              "content": "Eh - it's either an escape for her from her marriage, or it's more important than her marriage (or both).\n\nSeveral people here seem to relate to the sometimes obsessive nature of roleplay writing. But the thing is, obsession is by definition not healthy. I'm not judging - I had fast food this past weekend and that's not healthy either.\n\nThe wife should be allowed her hobbies, of course, but once an obsession gets to a certain point an argument can be made that it's probably better to back off from it entirely. That's her decision, though. I feel bad for the OP even though he did do something shitty by throwing the phone out the window.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "do you completely ignore your spouse? probably not lol",
              "id": 57,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "I mean, hobbys are things that can be put aside when you need to have serious talks and signs. No intimacy, \"friend\" who she is doing sexual roleplaying with, and not working on her marriage. \nEach the asshole.",
              "id": 58,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 169,
          "content": "I wouldn't say misinterpreting intimacy signals alone makes anyone an asshole. That kind of thing happens all the time, it's how you react that is important.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "\"She is not into you.\" \n\nAsk her if she is willing to work on the marriage.",
          "id": 60,
          "comments": [
            {
              "score": 168,
              "content": "That's what the trip was for in the first place and she did not gaf bro",
              "id": 61,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4681,
      "content": "This may be an unpopular opinion, but I'm not even sure if I can call this E.S.H. \n\nWhen my ex and I were having problems, I suggested a getaway, not unlike the one you're on. He agreed to do it, but acted similarly to your wife (i.e. not invested in the *slightest* and spending a ton of time gaming online instead of, you know, spending time on us and the relationship). We didn't last, because I was the only one (1) being honest, (2) communicating, and (3) putting in the effort you fix/save the relationship. \n\nIt sounds to me like you are in a similar situation, and your desperation (to make it work) got the better of you, leading to you throwing her phone out the window. (Which, to be honest, my petty self dreamt of doing that to my ex's computer, LOL.) \n\nI'm sorry, but I'm not optimistic about the odds of your relationship surviving, even prior to you throwing her phone. Best of luck.\n\nEDIT: oh my goodness, I was not expecting this reaction. Thank you so much to everyone who has upvoted and replied... and my first awards!! Wow!! I'm speechless. 💛💛",
      "id": 62,
      "comments": [
        {
          "score": 369,
          "content": "This is a good perspective. I wanted to post something similar—that OP and his wife aren’t compatible anymore and would be better apart, and there’s absolutely nothing wrong with that. They already tried to make it work, and after trying, it doesn’t work. She’s glued to her phone and he’s, well, he threw her phone. \n\nBut I would mark this as ESH. It’s just painful and cringey to read.",
          "id": 63,
          "comments": [
            {
              "score": 28,
              "content": "I think the gay ‘role playing’ with ‘friend’ might be the bigger issue than the phone. If this is real.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 331,
          "content": "Ouch, eerily similar to my last relationship. I was the idiot who didn’t want to put any time into fixing the relationship and would just play games during a lot of the time. Obviously it was more complicated than that, but I’ve spent a lot of time reflecting on that relationship and think I’m in a much better place now. Still, reading your comment took me back to that place and experiencing those feelings again made me very sad and wished I had never hurt my partner that way.",
          "id": 65,
          "comments": [
            {
              "score": 62,
              "content": "I'm kinda going through the same, and I'm the asshole on my phone. Crap.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "May I ask why you didn’t try working on the relationship? Why anything else up at the time?\nOther than that, glad you’re doing better now",
              "id": 67,
              "comments": [
                {
                  "score": 44,
                  "content": "My guess is because they knew they loved their SO and likely wrote off real concerns from their SO as just insecurity.   Love is not in fact \"all you need\" and a relationship where there is love but no effort has an expiration date.  A lot of people only learn that through experience.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Could be that they subconsciously knew there were problems but wanted to escape from feeling like they were \"the bad one\" who ruined everything (whether that was really true or not). Some people just suck at facing conflict.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "You sound like my ex. He did used to be a great boyfriend and person until he met some shitty people, the whole story is a post in itself. And my current boyfriend’s ex friend was this guy in his last relationship and he is going absolutely crazy a year later talking shit about everyone she knows, also could be a whole post. But I’m so glad to know that some of those guys can realize their mistake and turn their life around.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Lol are you my ex",
              "id": 71,
              "comments": [
                {
                  "score": 5,
                  "content": "I'm starting to see how this is like 70% of relationships.\n\nWe're all the exes of relationships that failed bc someone stopped contributing to the work and daily ministrations a healthy LTR requires.\n\nWhat is it that so many LTRs are: not enough time 'in the game', not enough sex, not enough intimacy and too much time at distracted things to avoid honesty?\n\nWhy is being in a sucktastic relationship that's slowly killing us a thing we can't stop doing?\n\nI know fear of being alone (great cure - being alone), fear of loss of lifestyle, fear of never being loved again...",
                  "id": 72,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Lol you sound like my ex, except he also cheated on me with the grotesque conspiracy theory neighbor lady and couldn't even come to the hospital the day I contemplated finally ending my life because I felt so miserable and alone after dedicating half a decade till there was barely anything left for me.\n\nMan, I still have horrible dreams.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 280,
          "content": "Yeah... I definitely think you're right. The last year of my marriage (going through a divorce now) I didn't want to come to terms with how depressed the relationship was making me. So I lived on my laptop, watching YouTube or playing games, anything to keep myself from realizing that for years of it being a one way relationship, and I was putting all the work into it, that I was seriously depressed and alone. For whatever the reason is, when someone disconnects themselves from the real world it's a sign of something major. Now I may just be seeing it cause I'm going through it now, but I have to agree, sounds of divorce clouds coming.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Yeah this sounds like the lead up to my divorce, only with different flavor text.",
          "id": 75,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "For anyone going through a similar situation, here's a song that captures this exact feeling for me.   It's a lo-fi song with a nasally lead singer, so I know it's not for everyone... but this song from the mountain goats helped me through a few ugly cries during my divorce - \n\nhttps://youtu.be/7YRWzxYS_nM\n\nAnd here's a more palatable cover version by Amanda Palmer - https://youtu.be/Nug52TuotYU",
          "id": 76,
          "comments": [
            {
              "score": 6,
              "content": ">a more palatable cover version \n\nIDK, I think I like the original better, I love a good female vocalist but her delivery was a lot more jarring then the Mountain Goats singer. Like she was imitating his delivery but was over emphasizing it. (I had never heard of TMGs before this, thanks for the link)\n\nOP, sorry you're going thru this, your wife is addicted to writing slashfics and you're just not as important as her imagination.",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "I can't click it, but is it No Children? It's the only song of theirs I like. Haha",
              "id": 78,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "aww thanks for the recommendation, always nice to listen to the Mountain Goats",
              "id": 79,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "This is probably the best answer you could have been given OP",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "My wife and I are in a perfectly happy and healthy relationship and I still feel like chucking her phone out the window sometimes lol",
          "id": 81,
          "comments": [
            {
              "score": 2,
              "content": "I just about spit out drink when I read your comment! I was not prepared for that LOL Today has been a day filled with laughs from my fellow Redditors and I am very grateful for each and every one of them 😊",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "The best one of these I know of happened to a colleague. He went to France with his family for a holiday. But he couldn't put his work phone down. His wife took it when his back was turned, and posted it back to the UK. \nAs it was an office phone she felt her first thought (throw it in the sea) probably wasn't the best idea.",
          "id": 83,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "You are right on the money. She clearly has her interests invested somewhere else. Nothing wrong with having a hobby, but this is ridiculous.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2152,
      "content": "I remember some years back there was a huge dustup with a group of folks I know. This guy had a partner who was super into LARPing and she ended up hooking up with another LARPer. Super shitty, but what’s even dumber is she claimed that *she* didn’t have sex with him, her *character* did, so therefore she *didn’t actually* cheat on her partner. It went over as well as you think it would.\n\nSo yeah, I’m calling shenanigans on her not having an emotional affair on you bud. Roleplay or not, she’s still having sexy emotional connections with other people, which is not great, and doing that while y’all are supposed to be figuring out your relationship is super shitty of her. I have to say ESH for the phone toss but I get where you’re coming from.",
      "id": 85,
      "comments": [
        {
          "score": 416,
          "content": "Man I hoped she stretched before doing those mental gymnastics.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 259,
          "content": "It's not cheating if you are wearing elf ears, come on everyone knows that s/",
          "id": 87,
          "comments": [
            {
              "score": 88,
              "content": "What if the ears fall off during the sex",
              "id": 88,
              "comments": [
                {
                  "score": 87,
                  "content": "Three second rule",
                  "id": 89,
                  "comments": [
                    {
                      "score": 25,
                      "content": ">Three thrust rule\n\nFTFY",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 169,
          "content": "It's weird that everyone immediately recognised this as cheating but when it's just written role play all the comments are like OF COURSE WE ARENT INTO EACH OTHER.\n\nI mean sure whatever you say, but at the same time maybe don't do that if your partner isn't comfortable with it. I thought I was pretty un-restrictive as a partner but I've just learnt about the concept of \"RP\" as a creative writing exercise I can hand on heart say with 100% certainty I would leave someone for RP-ing romantic scenarios with friend. ESPECIALLY if they were doing it instead of talking to me, but also just generally it would not make me feel good.",
          "id": 91,
          "comments": [
            {
              "score": 46,
              "content": "I've RP in the past, no it's not automatically emotional cheating anymore than saying actors cheat on their spouses each time they film something where they're in a fictional relationship. The fact that she's prioritizing this friendship over her own marriage is the issue, not the concept of RPing.",
              "id": 92,
              "comments": [
                {
                  "score": 23,
                  "content": "I never said it was emotional cheating, I said I would absolutely not be comfortable with it in any way shape or form. It's waaay more intimate than acting, particularly given large audiences in theatres or busy crews on set. Maybe as a GROUP writing excorsise with multiple people contributing I could get past it, but two people, each with their own \"character\" just writing each other a romance novel? That's a no from me.\n\nWhether or not *you* have any emotion about the RP doesn't really matter if your partner, whom you suppedly love, is *super uncomfortable and hates it*.\n\nWhich I would be. Absolutely. Big fat red line no. Nuh uh. Here's the door.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "I mean… my best friend of over 10 years, roommate of 8, and I RP stuff via text/discord all the time. She’s ace, and I’m not remotely attracted to her in any way, but neither of us has the time or energy to actually write like we want to, whether it be fanfic or original stuff…\n\nSo RPing is a way to get some ideas and creativity out. Sometimes that does include porn just cuz we both like writing it. Idk, to us it’s not any different than sitting around the table for D&D and having romantic subplots with people who aren’t your irl partner. It doesn’t instantly mean someone is cheating or having an emotional affair…\n\nHowever the wife here definitely sucks just for not paying any attention to her husband on a trip about them.",
              "id": 94,
              "comments": [
                {
                  "score": 8,
                  "content": "I totally agree, so long as everyone involved is happy and consenting. The OP and the LARPer’s fella though, not super stoked on the idea.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "It depends on the nature of the RP. I've definitely done RP flirting with someone I had no interest in. Here though? Sounds like there's a lot of \"bleed.\"",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I think you mean “doing it instead of doing me”",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 118,
          "content": "At this point the partner should break up not because of the cheating, but because of her being so ridiculous.",
          "id": 98,
          "comments": [
            {
              "score": 135,
              "content": "\"Cheating I can understand, but I JUST can't date a moron\"",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "I find it easier to forgive cheating than pretending that everything you did as a character doesn't matter. When LARPing, when you kill someone you don't hurt them in real life. Why would it be any different with sex?",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I larped once, I've was told you give someone a backrub to signafy your characters are having sex",
          "id": 101,
          "comments": [
            {
              "score": 40,
              "content": "Nah, everybody negotiates it individually. I’ve seen ooc narration, “fade to black”, playing jenga, making out (pre-negotiated with each other and any ooc partners), you name it. There’s no hard and fast, but having irl sex without talking to ooc partners before is a major 🚩🚩🚩",
              "id": 102,
              "comments": [
                {
                  "score": 6,
                  "content": "I’m a queer polyam weirdo so yeah, I wouldn’t necessarily be mad about a sexy roleplay situation. However, if we’re alone and supposed to be working on our relationship, and instead of engaging with me on even a basic level you’re ignoring me for the sake of having erotic chats with your friends, yeah I’m gonna be pretty cheesed about it, regardless of context.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "It depends on the players and most importantly consent.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Omg the whole concept seems *so* cringe to me.",
              "id": 105,
              "comments": [
                {
                  "score": 6,
                  "content": "I know, generally it isn’t really hurting anyone and people have different interests but this does physically hurt with the cringe",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "Yeah it really seems this relationship has become “real” enough that it has taken priority to her over her relationship.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This can be reasonable in online roleplay or what not . But LARPing... Really lady? Reaaaaaallly?! Definitely some BS. She's got issues if she though that would fly. Yikes.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "People get so weird about role play. I've dealt with so many people acting like huge assholes in D&D campaigns and when complained about, they say \"That's just how my character would act! I'm not trying to be an asshole, it's just the character!\" But THEY CHOOSE who their character is and how they act. I've seen so many people act as if their OC is some autonomous sentient being they can't control and it infuriates me. No, it's YOU, YOU'RE the one writing them, YOU'RE the one deciding for them to be an asshole.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yeah I went with ESH basically because throwing her phone is NOT going to improve anything, but damn, I get it at the same time. I'd be so hurt.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I can’t tell you how much I enjoyed this comment. Excellent writing. Concise, proper emphasis, immediately engaging, love phrases like “huge dustup” and “calling shenanigans.”\n\nNot to mention the actual content. Truly a piece of art. Reminds me of a podcast I listened to about people who are convinced they have “alters” or other personalities in their minds. One woman was cheating on her partner but it was her alter not her. Psychiatrists were basically like “yeah that’s not how any of this works but okay.” Fascinating.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2041,
      "content": "Is this friend someone that she could be romantically/ sexually attracted to?   If it was a casual text during the day, then I would call you the AH.  In this case, having her texting sexual content to someone after showing lack of sexual interest in you is making me see red flags.  Dropping her phone out the window is childish, but I don’t blame you for being upset.  This could be an emotional affair.  ESH and good luck.",
      "id": 112,
      "comments": [
        {
          "score": 1884,
          "content": "Yeah, she could be. It does feel that way sometimes but she gets really upset when I say it. I know they're just characters but it feels really weird to know my wife is roleplaying sex with another person. I've brought up emotional affairs but she says it can't be because it's not them, it's their OCs. I don't know anything about writer culture so it always feels like I'm being unreasonable, but I don't know.",
          "id": 113,
          "comments": [
            {
              "score": 1546,
              "content": "Writer here. I refuse to do sexual role plays with *any* characters (original or fanfic) because to me, it is emotional cheating. There's a lot of myself in my writing, and it makes me deeply uncomfortable to be writing things like that with anyone but my partner.\n\nPlease, don't write off your feelings just because you don't participate in the same hobby. If it's bothering you, it's worth figuring out why and addressing it.\n\nProbably with professional help, at this point. \n\nAlso worth noting: it almost sounds like borderline addicted behaviour. Maybe something to look into/ponder.",
              "id": 114,
              "comments": [
                {
                  "score": 528,
                  "content": "I think it'd be one thing if they're just sharing erotica/fanfic, or bouncing ideas off each other about their characters' relationships. But actively role playing seems a bit much.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 280,
                      "content": "Oh 100% agree. And I think there's something to be said for the fact that it's literally interfering in her marriage at this point - that's gotta be a flag at some point",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 56,
                      "content": "I don't even think it's okay to bounce off ideas so much that it interferes with your marriage\n\nI get it in a way. I have lots of hobbies and lots of friends. And because of that I'm a whirlwind of activity. \n\nOne of things I acutely remember is running into an old friend's bf in town. And while we're catching up over drinks  he says \"oh yah she's great. She's doing x, y and z and thinking of a. Sometimes i wonder when she'll have time for me\"\n\nTime together is important. If she's this distracted during a time where they have agreed to work on their marriage then working on their marriage should be the priority. Not your damn hobbies.\n\nI'm lucky. My husband, like me, can't sit still. But even with our schedules we still have scheduled \"us time\". Where nothing else and no one else interferes with.\n\nHonestly I'd just get out of that marriage if she can't put aside at least a few days to work on it",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "Not a writer, but I draw, and I’m on the same page as you. If I am single, I am more comfortable shipping OCs with friends’ characters and will draw lovey things for fun. If I’m in a relationship, my characters are only for my partner’s OCs to be paired with, even the ones I don’t directly connect myself with.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "The professional help thing is big. There's a lot of stuff to unpack from what it sounds like. More than a weekend at the cabin can fix.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 652,
              "content": "I'm sorry OP, I was once in a kinda similar situation, but I was the friend of your wife. Looking back I feel really bad for the husband because I can say it was definitely an emotional affaire between me and his wife. I can’t say that's it not possible to separate between character and person, it worked great with other people but the way your wife is prioritizing writing these erotica seems too much. Be honest with her about your feelings, they are valid.",
              "id": 120,
              "comments": [
                {
                  "score": 441,
                  "content": "Would you mind if I asked you a few questions about the situation? I know nothing about her writing partner, I know nothing about roleplaying, and I feel completely unequipped to navigate this.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 288,
                      "content": "I don't mind, you can ask anything you want, also via DM! But it's possible that it takes me a bit to answer (living in EU and it's almost bedtime for me)",
                      "id": 122,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 399,
              "content": "\"It's not them it's their OCs.\"\n\nSo a couple isn't having an affair if they're role-playing patient-nurse?\n\nShe has a long running, ongoing sexual role play with somebody, to the point where she's ignoring her husband; so what if both of them are using alter egos?? I'd definitely consider that an emotional affair.\n\nAgree with other posters that ESH for you getting physical and throwing the phone.",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 160,
              "content": "> but she gets really upset when I say it. \n\nHere is your clue.\n\nShe gets upset because she knows you are right... she just doesn't want to admit it(to you and, possibly, even to herself) = scream bloody murder at the mere hint of emotional(or otherwise) cheating.\n\nTrust your feelings on this. \nYou're hitting the nail square on it's head.\n\nNTA by the way",
              "id": 124,
              "comments": [
                {
                  "score": 4,
                  "content": "Seems like it. Is seems she is definitely not into OP anymore.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 131,
              "content": "I used to roleplay with my online friends in the exact same way your wife is, and if you’re in a relationship then it is emotional cheating. People will always use the excuse of “it’s not *us*, it’s our characters”, but my experiences of writing roleplay erotica had an actual effect on me - both good and bad. If the other person’s character was doing something I liked, it aroused me. If they were doing something I didn’t like, it would make me feel gross or uncomfortable because that’s exactly how it would have made me feel if it was happening in real life. People will get up in arms about this and deny it until they’re blue in the face, but there is a kind of intimacy that’s inherent with that kind of writing, and 9/10 times roleplay sex isn’t happening for any kind of plot continuity. It’s because the people writing it are getting hot and bothered about it.\n\nGranted, saying “it’s not us, it’s our characters” does have a grain of truth about it, because any feelings are usually directed towards the character and not the person writing for them, but it doesn’t change the actual dynamic of one person writing smutty content that arouses the other person and vice versa.\n\n**ETA:** ESH, but your only fault was throwing her phone, and I’m sure you don’t need us to tell you that there was a better way to address what was going on.",
              "id": 126,
              "comments": [
                {
                  "score": 7,
                  "content": "I think it probably depends on the person. I don’t do RPing online but I have written with people and I’ve know RPers. It seems like it’s like anything else that involves any form of intimacy. Sometimes platonic and creative intimacy stay separate, and sometimes they bleed. IDK even with the sexual stuff, sometimes people are RPing the character they’re attracted to. \n\nThis is suspicious. But it’s not the only kind of RP relationship.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 91,
              "content": "\"characters\" \"roleplaying sex\" \n\nBruh.",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 85,
              "content": "It is hard for reality to compete with fantasy.  She needs to choose you and the relationship over her writer friend and their fantasy world.  It can still be an emotional affair through role playing, but even without that term she is putting the marriage at a lower priority than her other relationship.  Still, the blame game won’t help.  Lose your attitude towards her hobby and see if you could appreciate it with her.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 84,
              "content": "> I've brought up emotional affairs but she says it can't be because it's not them, it's their OCs\n\nlol, uhhh, what",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "\"It's not them it's their OCs.\"\n\nSo a couple isn't actually having an affair if they're role-playing patient-nurse while having sex?\n\nShe has a long running, ongoing sexual role play with somebody, to the point where she's ignoring her husband; so what if both of them are using alter egos?? I'd definitely consider that an emotional affair.\n\nAgree with other posters that ESH for you getting physical and throwing the phone.",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 66,
              "content": ">she says it can't be because it's not them, it's their OCs.\n\nThat's what she's telling herself.  Probably in an attempt to deny to herself that this \\*is\\* an emotional affair, and she's scared of the implications of that. \n\nOr it's just -- it was the norm in the writing community she got into, and there may indeed be others in that community who do this kind of roleplay with each other but in which it is NOT an emotional affair.  It's not black or white, different people handle it differently, and compartmentalize in their minds differently.  So, coming from this community, it may be that she's telling herself and you that it \"can't\" be, because she sees that it is not with others.\n\nBut the problem is that the rest of her behavior is completely exhibiting the signs of an emotional affair.  It doesn't MATTER if they are OCs or \"them\" -- their OCs are their proxies, and they are investing emotion into this.  The point at which she can't tell her friend, \"sorry, gotta log off for the weekend for this trip; we'll pick this up when I get home!\" is the point at which she is emotionally dependent on this friend and this roleplay.  THAT is where the affair part comes in.\n\nESH is my ruling, for sure.  Y.T.A. for throwing the phone, of course, but you know that.  \n\nPlease do correct me if I'm wrong, though -- you made VERY clear to her that you and she were going to the cottage to work on your relationship?  Like, you didn't just couch it as \"let's go to the cottage, you liked that before, and we can spend some time together!\"  and then just expected she would get that what you meant was, work on the relationship, which is in trouble?  \n\nIf you were clear with her on that, then yeah, she is very much TA in this situation.  If you were not clear with her on it, but expected her to pick it up from you dancing around the subject, then she's a LITTLE less of an asshole, and you need to sit down with her and use YOUR words, and be clear. \n\nI do also want to say, you are kind of TA for being so dismissive of her writing, by saying that you would only understand it and be okay with it, if she was intending to publish.  It's still a valid pursuit, whether she publishes or not.  Her having writing and roleplay as a hobby isn't the issue.  The issue is that she does not seem to be able to put it down, and/or she will not put it down for you.  (Obviously, I don't mean, for sex.  As you said, sometimes one partner isn't in the mood, and that's okay.  But it sounds like she will not put it down for you at ALL, and that's not great.)\n\nUnfortunately, like a lot of other people here, it sounds like her actions are speaking loudly, and they're saying that she has checked out of this relationship.  I'm sorry about that, it sucks.  Again, though, before you give up completely, you should be very clear with her about what this weekend was about, and perhaps suggest couples therapy if she doesn't want to call it quits right then.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Came here to say this. Are you sure they’re just role playing? Either way she is being completely disrespectful and unless she miraculously gets her shit together it doesn’t sound good. I’m not even going to vote because I’m sorry you’re going through this",
          "id": 133,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1826,
      "content": "Listen, as a former Huge Ass Nerd that used to roleplay as characters over text with my exes, I can promise you…she’s absolutely in the mood. In fact, she’s EXTREMELY in the mood. Just not for you. \n\nSexual roleplay is extremely, you know, sexual. The amount of detail you can get into like that- it’s like sexy/dirty talking with someone when you’re away from them. It’s very “hot” because you’re still engaging with someone, physical or not. Yeah, don’t throw someone’s phone, that’s a really bad reaction because it can seem violent. Throwing shit is a great way to get a story turned against you really quick. \n\nBut what your girls doing? Yeah, it’s not writing. It’s fucking. Digitally. Constantly. It’s an emotional affair and what I would constitute the beginning of an actual affair. I’m not even going to give you the E S H ruling because you obviously didn’t even realize what was happening. I’m sorry, man. Good luck.",
      "id": 134,
      "comments": [
        {
          "score": 274,
          "content": "As a current Huge Ass Nerd that roleplays over text with friends, sexual RP is not always and automatically fucking. My partner of 11 years and I both RP smut with other people and neither of us is having an emotional affair. \n\nDo I find what I write with my smut buddies hot as hell? Fuck yeah! Does it mean I want to fuck them or leave my girl for a relationship with them? Fuck no!\n\nNow, OP's wife probably IS engaging in an emotional affair, but not because she's writing porn with someone else. It's because of her behavior with her husband and her obvious emotional disconnect from both him and the relationship.  She could be writing the purest chaste domestic fluff or slice-of-life gen stuff with her RP partner and her behavior here would still indicate a problem in their relationship.",
          "id": 135,
          "comments": [
            {
              "score": 264,
              "content": "It sounds like something that is a boundary that varies between couples. You and your partner are fine with it, but it sounds like it’s an issue for OP. I probably wouldn’t be comfortable with it and would most likely set a boundary in relation to it myself if my partner were into RP.",
              "id": 136,
              "comments": [
                {
                  "score": 66,
                  "content": "This is exactly what I was going to say. It’s clear that OP isn’t cool with the RP relationship that his wife has going on, so it’s crossing the line into emotional affair territory. Some couples are cool with banging other people. Some couples aren’t cool with even looking at other people. Both are acceptable. What has to be respected is the boundaries put in place by both people in the relationship, and if those boundaries aren’t compatible, then the relationship isn’t compatible. Clearly OP and his wife need to seek professional help or just end it.",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 173,
              "content": "Regardless of whether the person she’s writing with is the focus of attraction or it’s just the fantasy that’s being created, this is unhealthy dedication to something sexual to the detriment of her sex life with her spouse. Either it’s emotional cheating or porn addiction.",
              "id": 138,
              "comments": [
                {
                  "score": 137,
                  "content": "Yeah, so many of these people are trying to spin it to be not so bad because it applies to them, and that's it.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Seriously. The more people try to explain their way out of this, the more sus it gets.",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Yeah, but you and your partner are both aware of what you’re doing and consenting to it. Without that consent, it does sound a lot like an emotional affair. I wonder how often they meet up in real life.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "The emotional disconnect... Its always the most telling sign. Most women don't come back from that. Its already over at that point.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I see where you’re coming from, but personally that would totally be a boundary for me, and I think it would be a boundary for a lot of people. There’s a huge difference in talking to your partner about something and seeing if they’re okay with it, versus just doing it, which I know you mentioned. \n\nBut…it’s definitely cheating if you don’t bring it up to your partner. If your partner doesn’t know about it/doesn’t like it, it’s not okay. Hardddd stop. It’s like sexting another person, you know? I appreciate that you’re with someone who’s okay with it, but I have a feeling most people would not be.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1217,
      "content": "Esh - throwing things was never going to be the answer. \n\nText rôle playing erotica (?) is something a lot of people would consider emotional cheating , especially when she’s rejecting sex with you to engage in it. The fact you’re upset with this is understandable and valid, but your response was not. The “she’s never even going to publish it” stuff is very silly, dark academia is very popular now and depending on how they write it’s likely to be publishable and potentially popular. But the way she is choosing to engage is not alright",
      "id": 144,
      "comments": [
        {
          "score": 866,
          "content": "Yeah, I agree. It was definitely wrong for me to throw it. I always felt unreasonable calling it emotional cheating because she keeps stressing it's the OCs, not them, and I just don't get it because I'm not a writer. But now reading all these comments, I feel like we should have a longer talk about this where I hold my ground.\n\nAlso, I didn't mean to say that I don't personally find it publishable, just that she's said it's just for her. It's not publishable because she's not going to publish it. I'm not knocking the genre.",
          "id": 145,
          "comments": [
            {
              "score": 391,
              "content": "Ah. Then yeah if even she admits it’s just for her enjoyment I would definitely say it doesn’t matter that it’s OC’s. Wanting to play with mind dolls and calling it work instead of communicating with your spouse so regularly that it’s causing problems isn’t okay.\n\nThere’s CERTAINLY allowances that need to be made for writers. Half way through a conversation they will absolutely zone back in an realize they’ve been imagining an economic system that allows for magic or something, and they will get into planning rabbit holes with writing partners that it’s hard to break them out of, but no, this is not that",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 186,
              "content": "It's the OC, not me... not so simple. \n\nWriting means I get to pretend to be OC, but once it becomes roleplaying, then two people are playing this game, and once I'm pretending to be my OC and you are pretending to be your OC, then WE pretend that WE're in love. We talk to each other and we exchange words and feelings. And the lines between pretending and reality might get blurry. \n\nWriters rarely cheat with their fictional characters, but actors every now and then do start to date their on-screen love interest. Be careful with this, they are playing with fire.",
              "id": 147,
              "comments": [
                {
                  "score": 86,
                  "content": "Eh writing and roleplaying are two different things. I'm calling roleplay like this where wife is sacrificing time with spouse cheating cause they are clearly getting off on it somehow.",
                  "id": 148,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "[deleted]",
                  "id": 149,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Adding a new wish to spouse wishlist",
                      "id": 150,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "I'm a writer and I don't get it",
              "id": 151,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 77,
              "content": "info: will she let you read what she's doing with this other person/their character?",
              "id": 152,
              "comments": [
                {
                  "score": 34,
                  "content": "Major question! Because I feel like if it really was roleplaying, she wouldn't mind showing him the texts, since it's \"not her but the OC\" and she built some sort a mental barrier. But if she doesn't want him to read any of it ... she's likely just cheating and using RP as cover up.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 59,
              "content": "It might be the OCs not her, but every couple has the right to decide what for them, defines cheating. For some people it's consuming sexually-charged media without their partner, for some it's creating sexually-charged media without their partner, for some it's interacting with another person in a sexually-charged way, either in person or remotely. \n\nI could see how if she is enjoying collaborating on a writing project with someone it might not be sexual for her at all, even if the characters are getting it on (I tried writing a sex scene once for something, and it was the least sexy writing exercise I ever did, lol!). But equally,, RPing can often be a very sexually-charged activity for people, and less related to creating fiction than it is simply getting off on the ideas she's sharing with that other person. I don't think anyone here - without knowing your wife - can say where on this scale your wife lies.\n\nAnd either way, it feels like that's not even the main problem with your marriage right now. It's a symptom of the bigger issue, which is that she's checked out of the real, tangible life you share and is instead pouring all her attention and care into her fantasy life. You need to know if she wants a life with you, what her priorities are, and whether she's willing to put the bare minimum of effort into maintenance work on her real life relationships. If she can't go a single day without checking out of your joint existence and ignoring you to go talk to her writing partner, then the signs aren't good.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "I'm going to say NTA because I know several published authors and they don't role play like this unless they are in a relationship with the other person. If your wife was really interested in fixing things between you two, she wouldn't be talking to the person period.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "> I always felt unreasonable calling it emotional cheating because she keeps stressing it's the OCs, not them, and I just don't get it because I'm not a writer.\n\nBullshit excuse from her. Writers talk about ideas, concepts and story structure. They share and critique excerpts from their works. They absolutely don't text roleplay sex with other writers as each other's characters.\n\nESH though and you completely lost the moral high ground with your outburst. Stop \"working on your marriage\" and start working on your divorce.",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "My friend and I write and she's published (go her!)! We never roleplay our characters but we can sometimes get sucked into a planning frenzy which is really fun.\n\nTo me, your wife is cheating. I think your intimacy isn't hitting her kinks but she's an AH for not talking to you about it. And of course you're an AH for throwing the phone.",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I RP allot in my early 20s. Never really got into sexual RP besides who i was current in a relationship with.\n\nWith that said as a writer/rper you become your OC. the fact she would rather RP with someone else and not work on yalls martial issues is telling. She is cheating on you and hiding it behind RP and OC.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Will she let you read it? If not…there’s a problem!",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 523,
      "content": "Throw in the towel...  Sorry to hear this.",
      "id": 160,
      "comments": [
        {
          "score": 7,
          "content": "Yep.",
          "id": 161,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 394,
      "content": "Honestly after reading your comments on this relationship, NTA. Your frustration got the better of you in one moment, but if I made a move on my SO, they rebuffed me, then started roleplaying sex with someone else I'd get mighty pissed off too. You've done your part to try and mend this relationship, but from what you've written your wife has already given up. She needs to understand that just because it's their \"OC's\" that are having sex , how you feel is real about it and your feelings matter in this relationship. \nGood luck buddy, you're going to need it.",
      "id": 162,
      "comments": [
        {
          "score": 48,
          "content": "100% this.\n\nYour frustration is understandle (still not an awesome reaction) because your wife is cheating on you. She even has a way that she can do it, right in front of you that she's convinced you is normal.  \n\n\nThe only people defending her are people where both parties understand or are involved with this activity (which makes sense as they can have proper boundary setting discussions about it) or people who are actively doing the same things to their partners.\n\nCounselling or end it. This is not going to get better for you without a drastic change in her behaviour, which from your comments seems unlikely. NTA",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yeah I knew it was over with me and my ex when I wanted to initiate, he didn't, and then I woke up later to him jerking off right next to me watching porn. Sexual intimacy is important to a lot of people, so her completely ignoring you to then go do something else that was sexual is essentially her only caring about her own wants. I know it sucks, and it's very easy to turn to throwing the thing your brain thinks is the source of the problems, but the source isn't the phone, it's your wife. If this stuff has been ongoing, one getaway to a cabin is not going to fix your marriage. I'd cut your losses.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 312,
      "content": "ESH- her heart doesn't seem to be into it and she clearly wasn't even trying to engage with you but throwing her phone out of the window is at best, extremely childish and at worse, quite threatening.\n\nYou're also so dismissive of her writing... That can't be nice for her.\n\n&#x200B;\n\nAll in all it sounds like you'd be better off apart.",
      "id": 165,
      "comments": [
        {
          "score": 193,
          "content": "Like…is it writing, though? She’s actively roleplaying with other people. I’ll have to ask around…but I’m pretty sure other writers don’t do that. They just like…write that shit down.",
          "id": 166,
          "comments": [
            {
              "score": 179,
              "content": "As a former literary agent, I can tell you that while that sort of roleplaying is highly popular in online hobbyist writing circles, it plays literally NO PART in the writing process of ANY professional/career writer, fiction or otherwise, that I have ever known or worked with, and I've known a shitload, including some NYT bestsellers. That's strictly fanfic/hobby/online forum stuff. \n\nLike, it's a legitimate aspect of genre writing-as-hobby? But if she's arguing that this is an \"important part of her work process\" or something, I'd be calling bullshit. No one gets published because they spent hours roleplaying with someone. It's a distraction, and if anything I'd see it as a minor sign that she DOESN'T understand how any of this works from the professional side.",
              "id": 167,
              "comments": [
                {
                  "score": 56,
                  "content": "Thank you. I was like…I know writing is a thing…and roleplaying is a thing…but having to absolutely do the second thing to do the first doesn’t sound right to me.",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "From a big publishing perspective that makes sense, but with the rise of indie publishing and small independent publishing houses, there's been an uptick in 'scrubbed fanfiction' getting published. I've been a fanfic writer in fandoms where friends end up publishing fanfiction with character names and other fandom identifiers changed. \n\nI say this as someone with professional work who also roleplays quite heavily with friends. \n\nThat being said, I cannot imagine a roleplay working as a published piece of fiction without *heavy* editing. The ping-ponging of POVs required for a roleplay would not lend itself very well.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My ex and I, YEARS AGO OMG, were long distance and both of us aspiring writers. We used to co-write stories by role playing and also taking turns writing chunks at a time.\n\nLooking back, those stories were terrible, but I think it was more because we were bad writers than the manner in which we wrote, lol.\n\nHeck, even stuff we wrote separately was pretty bad too. I haven't tried to write in years because that realization killed my confidence.\n\nBut yeah, you're completely right.",
                  "id": 170,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Heh.  It literally plays no part in the writing process.  I see what you did there.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "As a former acquiring editor for audiobooks no professional writer does this, I know dozens of writers personally very well and hundreds professionally.  I can’t think of one writer who does this; no one in RWA, no erotica writers, not Mr Gor himself John Norman. \n\nI do know two authors who have been phone sex operators but they did that for pay not fun.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 178,
              "content": "Yep, this is my first thought.\n\nOP does *seem* dismissive at first, but in rereading, it sounds like they're understandably fed up: \n\nwife *claims* she has no interest in publishing-- but apparently has *obsessive* interest in \"role playing\" her \"ideas\" about a romantic relationship.   \n\nOP is repeating her words (while pissed off). It actually sounds to me like OP would be supportive if wife was planning on publishing AND not prioritizing this phone relationship with her \"friend\" over her actual relationship with her partner.\n\nThrowing the phone is definitely bad form. But holy shit, how frustrating and painful to be lead on and overtly dismissed by your spouse. Awful",
              "id": 173,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "It depends on the writer. But some do and I know a couple people who make decent money selling their \"gay fanfiction.\" One enough to support her family, one as a nice supplementary income.  Both have more \"serious\" writing projects, but steamy romance pays bills.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I roleplay and write solo for fun as a hobby. But it’s also a coping mechanism when I’m not myself (depressed,stressed). It’s a way to feel like I have control over *something*",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "When I'm writing with my writing partner, we do sometimes drop into roleplaying the characters out in scenes to get a feel for the scene flow. I think it's more common among writers who started out in the fanfiction world. The idea is sometimes just getting the words on the page, or into a text chat, because you can't edit what's still in your head. And it's pretty easy later to just cut and paste the RP into your file and start editing from there. We wrote about.... 7 novel length works using that, and other methods, to collaborate. \n\nThat said, I try to limit doing that to when I'm not with friends and family.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Hobbyist writer here. I both write my own stories, and roleplay writing with other people. Roleplaying fiction is completely separate from sexting, the mere notion is ridiculous to me. It's an escapism mechanism, as many people that do it have mentioned in this thread. I would never entertain fucking the people I roleplay with, I don't have feelings for them, this isn't a weird by proxy thing. It's just collaborative writing. The problem isn't the wife's writing, it's the fact that she needs to escape in the midst of trying to fix their relationship. They need to communicate more.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Mmm.  I think that some authors do that?   *Mask of Mirrors* by M.A. Carrick (Marie Brennan and Alyc Helms) is a collaboration (though I'm not sure it was written exactly that way) which started out of a (dnd game?  RP?). *This is How You Lose the Time War* was written the same way more strictly (Amal El-Motar & Max Gladstone each taking one POV). \n\nWith that said, that doesn't sound like that's what she's doing here.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}