{
  "post content": "I (15F) am in high school and got dress coded by my teacher during history class. The dress code at my school is usually not so enforced. It was also a pretty hot day so I wore a pair of shorts. The rule at my school is that our fingertips have to go past the length of our pants otherwise it’s out of dress code. Well, today, I got up to turn in an assignment and my teacher noticed that I was wearing shorts. He told me to hold my arms down to my shorts and then basically announced to the whole class that my pants were too short. I don’t think anyone even noticed what I was wearing until he pointed it out. My fingers went past the hem of my pants by 3 centimeters. It’s not like I had anything hanging out. The shorts were jean shorts that had no holes in it and were pretty modest as it went halfway down my thighs. There were at least 3 other guys in class wearing tank tops and sandals which were also against the rules but the teacher didn’t seem to notice. He told me to go to the office and call my mom for a change of clothes. \n\nThis was at the beginning of class and we have a final coming up soon. Today was supposed to be a big review lesson and I didn’t want to miss it. I’ve also never been sent to the office before so I was really upset. I just found it ironic that we were learning about gender biases literally yesterday, yet I was being removed from class for being a “distraction” to the men in the room. So I said no. I understood that I violated the dress code but seeing as it was the first time it happened, it didn’t seem fair to remove me from class during such an important lesson. It was also felt really objectifying to be shamed for my clothing choices. The teacher and I had a bit of an argument that went on for a couple of minutes, and it delayed the class. The teacher and some of my classmates are mad that I didn’t just go to the office. \n\nAita?",
  "id": 1,
  "comments": [
    {
      "score": 11262,
      "content": "NTA. Misogyny is alive and well.\n\nFile an official complaint with the office. Take it to the school board if you have to. Find a teacher or a parent or an adult who will support you, and make it know to the school admins that the way you were treated is NOT okay. Because it was NOT ok!",
      "id": 2,
      "comments": [
        {
          "score": 4459,
          "content": "Like I said, the dress code at my school is very lax. It's almost never enforced. It would make sense if the teachers were consistently this strict but it was literally just this one time.",
          "id": 3,
          "comments": [
            {
              "score": 2859,
              "content": "You were absolutely in the right to stay in class. I applaud you wholeheartedly, and any other opinion on this thread is a load of sh-t.",
              "id": 4,
              "comments": [
                {
                  "score": 1342,
                  "content": "Wholeheartedly agreed. Why should a girl's education be hindered because she was barely out of code? Doing so in front of the entire class could have easily silenced her, but OP held firm and used her voice to speak against the hypocrisy.\n\nOP, I was pretty self-assured at your age. My mom raised me to stand up for myself and to never back down when faced with sexism. Still, I can't say with any certainty that I'd have been able to do what you did. You should be incredibly proud of yourself. I know I'm just a random internet stranger, but I'm certainly proud of you! Don't let anyone dull your shine.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 284,
                      "content": "Also, the code is stupid. My high school had rhe same rule and I had to spend a day in suspension because I wore shorts that were completely fine, not indecent, but were not fingertip length. I also argued with my assistant principal over how dumb the rule was. (He was a creep who liked to leer and took great pride in dress coding girls.) At the time my fingertips touched the top of my knees.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 72,
                      "content": "It’s because dress codes are important so the male students can focus on their education, and not be tempted by the succubi wearing Jean shorts that only go halfway down their thighs. \n\n/s",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Seriously, my mom is a salty raging feminist who often laments that she raised me too tough. 15!!! I can't get over it, I'd love to say that would have been me but I don't know if I would have had the gumption . OP is an inspiration and a credit to all the zoomers I meet who frequently remind me that they are the woman I thought I was.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Is correct.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1021,
              "content": "At my school, the dress code was used as a bludgeon against the girls who \"developed early\" and almost never applied to any girls the teachers didn't find attractive. It's an entire crock of shit, and you were right to object.",
              "id": 10,
              "comments": [
                {
                  "score": 614,
                  "content": "My mum was head of girls at a school and she spent a surprising amount of time explaining to male teachers that there was literally nothing wrong with the girls clothing. This was mostly about sixth form (16-18) where they didn’t have uniform but had to wear basically suits. So students would be in a pencil skirt, button down and heels and the men would complain to my mum. When pushed they could not for the life of them articulate the specific problem. Because in reality the problem seemed to be “they are starting to look like women and it makes me uncomfortable because they are young and I associate women with sex”. My mum was way more bothered by students looking scruffy but no one complained about them.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 308,
                      "content": "When my daughter was in 6th form (she left last summer), I had a phone call from the male head of 6th form saying her attire was unsuitable. They were supposed to wear smart business/office clothing. She had on a smart, tailored navy blue dress with a v neck and short sleeves. Plus she had a suit jacket, which she had taken off because it was very hot. The v neck wasn’t deep, so you couldn’t see any cleavage and the sleeves came down to just above the elbows, and the dress sat just above her knees. I asked what the problem was and he said it wasn’t office wear. The head of the school wears tailored dresses, so I asked him that, if it’s appropriate for the head of the school it should be the same for students. \n\nI know I’m biased, but my daughter is gorgeous, 5’10”, with very long legs - 35 inch inside leg. Finding clothes that fit has always been a struggle, but we found Next tall range works well. I asked him to send me pictures of what he thought would be appropriate for her and he said trouser suits. She had some trousers, which she wore the next day with a blazer. He still wasn’t happy because the trousers were a bit short. I rang the head and she understood what the 6th form head was trying to get at and she wasn’t happy about it. Girls must show no flesh at.all. Or men will not be able to control themselves.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 55,
                      "content": "My sixth form’s rules were actually equally stupid whether male or female but there was certainly a level of sexualisation for the girls that there wasn’t for the boys (it was supposedly all about looking ‘professional’ - although we were allowed to wear entirely casual clothes).\n\nAnyway, one of the funniest things was actually that the boys were not allowed to wear shorts (I honestly can’t remember if the girls were - I think so!) but they WERE allowed to wear ‘3/4 length trousers’. Now bare in mind this was the late 00s so short lengths were…about 3/4 length. This prompted a substantial debate in one of our sixth form assemblies that entirely derailed the intended subject of the day when a student who was pulled up on it asked the head of sixth form to define what exactly the difference was if his shorts were 3/4 length. \n\nAfter much huffing and puffing and blustering away the head concluded that the answer was in the tailoring… whatever exactly that means. Because professionalism… of course. Funnily enough though I’ve never seen a man at work in suit tailored 3/4 length trousers!",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 92,
                  "content": "[deleted]",
                  "id": 14,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Happy Cake Day !!!",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "During the 80s and early 90s when I was in school,  in a pretty conservative area you would get called out for having bare shoulders being a distraction for the boys. \n\nWe weren't even allowed to wear shorts to school until my senior year (this was both boys and girls though).  Mini skirts were a big sticking point, especially with the cheerleader skirts being a good inch or two shorter than they allowed tge rest of the school to wear.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "How it was for my school too. In middle school, when I was about 12, my math teacher pulled me aside to tell me I really needed to watch what I was wearing, since I’m “blessed” and was a distraction. I was in a hoodie and leggings.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 4,
                      "content": "This is so many layers of ick. So gross, especially the use of the term \"blessed.\"",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "This is exactly it. I was the director of a summer camp one year where most of the camp counselors were teenage girls. The dress code said that tank tops were permitted because it was summer and they were working outside.\n\nOne day the owner told me I needed to talk to one of the counselors about her clothing being \"inappropriate.\" She was wearing exactly what everyone else was wearing, shorts and tank tops. The difference is that she was a beautiful curvy girl. I refused to reprimand her and told him exactly why he couldn't have a double standard for girls with a certain body type. \n\nThe next summer he made everyone wear uniforms with polo shirts.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "We don't even have dress codes in my country. As long as it's ok to wear on the street, it's ok to wear in class.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yeah, same. Dress codes in our public schools are basically \"make sure your genitals and nipples are covered\" for both sexes.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Exactly. It's selectively enforced to punish some students while letting others slide because it isn't obvious unless they put their hands down. It's stupid sexist nonsense.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Same here. I dared have boobs early and spent the entirety of middle and high school getting every outfit picked apart by teachers.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I saw a “bad” kid get coded for a tank top (they said the straps were too thin) but a “good” kid wore something similar and crickets.\n\nProbably didn’t help that the girl who was coded had a more developed chest",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "We didn't have a dress code at my school. I did get a comment from a teacher over a Calvin Klein t-shirt. It was my favorite t-shirt. It said Calvin Klein Obsession for the Body. I was a bit of a tomboy so I usually had a plaid button up shirt on. It just happened to be hot that day so my shirt was tied around the waist. Teacher was like that is inappropriate. I was like huh? It's a shirt about a perfume. It more weirded me out that she was making it something it wasn't. Also no one else even noticed. Suffice to say, I continued wearing it until I grew out of it and it was well worn. She never brought it up again (likely from lack of notice since I normally wear a shirt over my t-shirts)",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 340,
              "content": "The issue for me isn't the dress code itself (although that needs review) or if it is enforced, it is the way the teacher applied it. Room full of kids, several not complying with the dress code. Picks on one woman, makes her the subject of everyone staring, then declares her not to meet the standard. Unreasonable, abusive, rude, and misogynistic. Tries to exclude her from education rather than simply saying to her after the lesson that she should not wear this again.\n\nIt is a teachable moment. The entire class should be learning that there are standards of behavior required by people in authority, and failing to live up to them has consequences.",
              "id": 26,
              "comments": [
                {
                  "score": 57,
                  "content": "What did your parents say? I'm curious. I would be heading to the school to have a 1:1 with the principal and the teacher and ask if tank tops and sandals were part of the dress code. When told no, I would then ask him why he singled out my daughter and not the boys who were also in violation. If they say, \"the boys actions are not why we are here\", say \"You are absolutely correct, the reason I'm here to ask why my daughter was singled out and not the boys, the reason we are here is because of misogynistic behavior where your male teacher thinks it's okay to single out a female in front of the class while ignoring males who obviously are in violation. \" And then let them squirm. You can also then ask if the ACLU would likely think it was no big deal.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 16,
                      "content": ">I would be heading to the school to have a 1:1 with the principal and the teacher and ask if tank tops and sandals were part of the dress code.\n\nYeah, if  it was my kid I'd encourage them to write a complaint about the dress code being inconsistently enforced.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": ">If they say, \"the boys actions are not why we are here\", say \"You are absolutely correct...\n\n... the teacher's actions are why we are here\".",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I would have done exactly as OP and my mom would have responded just like you said. Also, at my high school (late 90s) the minute word got out about this, classmates would have organized a protest.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yeah, if the teacher had also made the boys go to the office, it wouldn’t be nearly as bad.\n\nI’d have said no, too, and asked to meet the principal or whoever could help with that. If they didn’t listen to me, I would have told my parents. Definitely NTA.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 310,
              "content": "I'd bring up the gender bias lesson. Loudly and obviously.",
              "id": 32,
              "comments": [
                {
                  "score": 55,
                  "content": "Yup. \"Let's make this a learning moment on the lessons you gave regarding gender bias, Mr. Teach\"",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 102,
              "content": "I’m so proud of you for standing up for yourself, OP. At your age I would have never had the courage. You did the right thing. ",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 98,
              "content": "Even if it was enforced consistently, it’s still an arbitrary rule. I have short arms and when I was in high school (20 years ago!) I could get away with way shorter shorts than other girls because we had that fingertip rule. \n\nIn the 2020s, no school should still have arbitrary dress codes that penalize female students disproportionately to male students. You did the right thing, refusing to comply with an unjust and discriminatory rule.",
              "id": 35,
              "comments": [
                {
                  "score": 52,
                  "content": "Shit in the 2020s we’re going backward on everything else, it’s unsurprising that dress codes are make a strong resurgence. The Reds are working day and night to undermine public education on every possible level, and most of it is aimed at folks who aren’t straight white Christian males.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I genuinely do not understand dress codes (or uniforms) in American public schools.  There was a supreme court case back in the hippie days that ruled them flat-out unconstitutional.  Believe it or not children have the right to free expression.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Yeah, long torso short arms here. My fingertips don’t actually clear the bottom of my butt. I had no interest in wearing short shorts or skirts in school, but technically, booty shorts would have been in compliance with the dress code as written.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Yeah, I have a long torso, so my fingertips hit pretty high on my thighs. I could have gotten away with some obscenely short shorts/skirts if I’d been one to wear such things.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 17,
                      "content": "[deleted]",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "I was the opposite. My fingers now almost reach my knees, and I am pretty sure they actually did at some point in my development. I have never at any point in my schooling wore shorts/skirts that were technically code appropriate I am pretty sure. I guess I never pushed it, because I was never called on it.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Me too! If I'd adhere by the fingertip rule, you would be able to see my underwear.\n\nAnyway, it is all about 'can't expect men to control themselves, so women must wear fully covering tents to help these poor men.' If men can't handle being around beautiful girls, they should find another career than teaching.\n\nIt is the men who need desensitizing, not the women who need covering up. They should make programs for that!",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "We had a lot of rules in high school. Our class pretty much always complied except for 2 times I know. One before the rules changed and one the day of the change\n\nThe first was when someone was wearing a really short short. You could almost see her cheeks. No one else Broken the rules. My male teacher asked her to stand and said loudly: \"If my underwear is longer than your shorts, your are breaking the rules. Otherwise it is acceptabel for me.\" They we're shorter. The rule was different but his wording sounded much fairer.\n\nThe other one was a year later. (The day they announced the clothing rules had changed. We we're already at school when we knew) My art teacher hated someone in my class who had a wish to transition we all called him by his new name. She however kept calling him by his deadname because his parents couldn't accept that he wanted to be a boy. He started his transition from the moment he was 18. One day he was wearing jeans shorts that we're maybe a little too short for the rules (not for the men's underwear rule). Mine we're around the same length and also a little too short. I think someone else as well. She singled him out because she hated him and/or didn't notice us. When she wanted to punish him I stood up and said to punish me too then but she didn't wanted to do that. After a big discussing with the whole class she didn't punish anyone. That was the last class of the day and no other teacher found our clothes not ok. (You get a clothing sticker. If you have three you need to stay late in school to make a task about why some why some clothes shouldn't be worn in some places.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Ew what an old perv, staring at a young student's legs like that. Definitely NTA. Stand up for yourself!",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "[removed]",
              "id": 45,
              "comments": [
                {
                  "score": 17,
                  "content": "Nope. Teacher here. Doesn’t matter that my other coworkers didn’t say anything. I’m still expected to say something. Kids change mid day, come in late, and teachers are human and miss things. \n\nNot saying I agree with the dress code, or if I would have done what the teacher did. Just saying “my other teachers didn’t say anything” won’t work as an argument to not get in trouble.",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "As a teacher, the code is lax bc admin knows that it will crumble against any real legal pushback. WA state, for example, has almost no dress codes now bc the state lost a case over a decade ago regarding dress codes for female students.\n\nYou did the right thing. But it also means you might be in for a bit of a fight.\n\nGood luck.",
              "id": 47,
              "comments": [
                {
                  "score": 5,
                  "content": "That's so interesting! Thanks!",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "That’s definitely pretty crazy, especially for just shorts! I wouldn’t have gone either!",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "Yes, it's heartbreaking to witness an engaged and questioning mind being beaten still for the crime of having 2 X chromosomes.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "Compleatly agree with you. OP should complain about the teacher, it is the teacher who is being distracted by a child's legs, if the teacher is being distracted from teaching by a child's knees, should he be teaching?",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "They should definitely get a male friend to wear similarly short shorts and see if the teacher complains first. Then, nail their ass to the wall.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "If the school does nothing, it might help OP to mention the magic word: lawsuit",
          "id": 53,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3223,
      "content": "When I got dress-coded for the \"fingertip rule\" in middle school, my mother measured how long my shorts inseam would have to be to be \"legal\" (boys' basketball shorts, basically--I have my dad's long arms), went through and measured every pair of shorts in the juniors section at Kohls, and marched into the principal's office with her notes documenting that not a single pair of shorts she found would meet the rule on me, even though other girls in my grade were wearing those same shorts without an issue. She then proceeded to show him where her own fingertips reached--she's petite with stubby arms, so she could have had most of her ass hanging out and still not broken the rule. The rule ended up being changed to \"shorts must not be more than X inches above the knee,\" but I still never wore shorts to that school again because I was afraid of being yelled at by a teacher again.\n\nNTA, but if you want to change the rule, be smart about it. Get a bunch of girls in your school to measure what length of shorts they could wear--I guarantee you it's a huge range, because everyone's arms and hands aren't proportionate--and make a graph of it. Make another graph of how long the shorts being sold in stores in your area actually are. Present your findings to the school board with as many other girls and parents as you can get to come with you and demand that the rule either be stricken entirely (preferred) or changed to a fair, blanket rule about inseam length (compromise). You're 100% right to make a big stink about it, but if you want to be effective, start strategizing!",
      "id": 54,
      "comments": [
        {
          "score": 1528,
          "content": "Or, you know, just let them wear shorts and stop sexualizing young girls (and punishing them for having legs).",
          "id": 55,
          "comments": [
            {
              "score": 863,
              "content": "To be fair, I have seen kids with literal butt-cheeks hanging out of short shorts. You don't need to be sexualizing teenagers to think that buttocks on display is inappropriate for school. I imagine it should be possible to find a reasonable compromise between 'duh girls have legs shut up' and 'don't show your literal ass in school.'\n\nBut I also recognize that such a compromise will be pretty hard to arrive at in a society that really wants to combine it with 'keep the wimmins under control'.",
              "id": 56,
              "comments": [
                {
                  "score": 335,
                  "content": "Lol, when I look at pictures from when I was really young (late 70s/early 80s) we  used to wear shorts that barley covered our underwear, and we includes my father😂 why are we al so prudish today?",
                  "id": 57,
                  "comments": [
                    {
                      "score": 192,
                      "content": "[deleted]",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 94,
                      "content": "When I was in high school, early 2000s, girls having their thongs visible from the back was a thing. ",
                      "id": 59,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "> why are we al so prudish today?\n\nWe used to drive without seat belts and motorcycles without helmets, go back to the good old days? \n\nOPs is NTA, but there needs to be some standard dress code. Without any limits, some will take it to extremes which will lead to distractions in class.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Do an image search for \"aussie rules shorts\". Should be a trip back in time for you!",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Alternative viewpoint:\n\nI was part of the “hot pants” generation. I would say that this is more about practicing professionalism for adulthood. Hanging with friends outside of school? Wear what you want. But school is a precursor to the adult world and is a great place to practice (key word practice) adult norms. How many times have we heard stories of employers being frustrated at kids showing up in inappropriate clothing? Without dress codes they will never learn it.\n\nI could argue that the hot pants dress code was a failed experiment as it didn’t prepare the kids for the real world. It’s OK to change something that doesn’t work.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Society has become prudish because society before it was liberal on things like that. Like with many many many things society it's a pendulum. \n\nI mean the 69er hippies were all about free love and sex.",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Even the BOYS wore crop tops and the most tight, ball-hugging jean short shorts imaginable...",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 98,
                  "content": "Yeah, when dress codes are gender neutral, enforced equally, and about ‘professional standards of dress’ they absolutely don’t sexualise… this was none of the above.\n\nNTA. The only non-creepy reason to have a dress code is for kids to look ‘professional’ to prepare them for future employment - if your boss measures your clothing in an arbitrary way and then announces they think it’s too revealing to a room full of dudes… well, that’ll be the only job you’ll need in a while, given the payout you’d be entitled to!!",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "If that were the problem we would just have a blanket rule that says “You can’t wear any type of bottoms that exposes the butt.” Dress codes should not require people to perform a little test to figure out if someone is in bounds. \n\nEither a butt is sticking out and there is a problem or it isn’t. If you have to have a kid place her hands just so to see if her ass is out, you aren’t checking dress code, you are making her give a show for some messed up power fantasy.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 14,
                      "content": "But then if a teacher says you are violating dress code they get accused of looking at students butts.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "It's also unfortunate that the fairest measurement, inseam length, could be easily torpedoed (or even worse abused!) because it would be very intrusive to measure while wearing...",
                  "id": 68,
                  "comments": [
                    {
                      "score": 19,
                      "content": "In middle school, the only time we could wear shorts, in a building with no air conditioning and most classrooms without windows, was if there was an official heat wave lasting more than 3 days. The vice principal used to come around on those occasions and call out different girls to come towards him, and he'd bend down on one knee and put a dollar bill at our knee level, to check if our shorts reached the other end of the bill. It was absurdly perverse.\n\nEdit, a letter",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "It’s not either/or. You can advocate for a reasonable dress code changes by using the strategy this commenter suggests, while also reinforcing social and cultural aspects such as the guidelines for girls clothing should not include responsibility the responsibility of policing boys behavior.",
              "id": 70,
              "comments": [
                {
                  "score": 108,
                  "content": "Except, the girls have to measure every pair of shorts in town, measure the girls in school, “*make a graph of it!*, “present it to the school board” — spend time enlisting as many other girls and parents you can! — and…*demand a fair measurement*? (That’s the content of the comment you’re calling “reasonable”)\n\nSeriously. SERIOUSLY?!?\n\nThis, *this* is the amount of work we require of a 15 year old girl, in order that she be able to wear shorts that fall mid-thigh, to SCHOOL, or be subject to public humiliation and a ban from class?!\n\nAre you kidding me with this?! \n\nI’m so tired of the demand for female children to “be smart” or “have a strategy” just to cope with f-ing sitting at a desk in a pair of shorts.\n\nShame on anyone who says these are reasonable arguments. It’s a crock and you all know it.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 92,
                      "content": "Oh, ffs.\n\nI was a rabble rouser in school and proud of it. Stood up to teachers during class on multiple occasions, including when I got dress-coded. My shouting at the teacher (just like OP's argument with her teacher) did fuck-all. What my mother did got immediate changes made. \"Just stop imposing dress codes\" is a statement I agree with completely. It's also completely useless to OP, because OP does not have the power to do that! She's not the one imposing them!\n\nPeople really need to stop thinking that \"here's how other people have managed to get change on this issue\" means \"the current system is great and I support it.\" It *is* ridiculous. OP *shouldn't* have to. None of that changes the fact that we live in the world that is, not the world that should be, and that the goal of activism is to be *effective*.\n\nShame properly belongs to the people who make and enforce the system--with a little shame left over for the people who think yelling \"it's not fair!\" online for upvotes is activism. Y'all are useless.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 66,
                      "content": "Uh no. The comment didn't argue that women should have to do all that work to change minds; it merely noted that that was what it took for their mom to make the point to school officials that the system was flawed. I think it's obvious that they disapprove of the misogyny displayed by the school. \n\nWhat they're advocating for is altering the dress codes so they aren't using body proportions that are variable between individuals as a decider for \"modesty\". (I would actually go further than them, and point out that leg to torso proportions are also variable, so the \"x inches above the knee\" rule can also be difficult for some people to achieve if they're slim but with long legs.)",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Someone saying: “this was an effective strategy to advocate against a similar rule for me” is in no way endorsing that girls *should* have to do this. Its simply sharing an effective tactic for fighting an unfair system\n\nThis is kind of the thing about advocacy. Almost by definition, its not “fair” to have to advocate for any worthy cause, but the last people you should be mad at are the people who have actually done that and are now sharing tricks for effective advocacy.",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 250,
          "content": "Another good way to fight it it measuring the length of the cheerleaders squad uniforms or dance squad, etc. Those are school sponsored uniforms that typically break dresscode.",
          "id": 75,
          "comments": [
            {
              "score": 50,
              "content": "You are just *killing it* with these strategies.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "They may be built into the dress code as some form of exception.",
              "id": 77,
              "comments": [
                {
                  "score": 105,
                  "content": "So it's okay when we sexualize teenage girls who are supposed to be sluts like cheerleaders. Got it.\n\n(Not picking on you, btw. If they've made an exception for teenage girls who are literally going to be in front of the whole school jumping up and down and doing flips their policy makes no sense.)",
                  "id": 78,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I was speaking purely in the context of using the dress code to fight the dress code via pointing out that cheerleader uniforms break the dress code.\n\n\n\n\nIf the dress code itself has an exception for cheerleader uniforms, that avenue of attack is precluded since the uniforms don't break the dress code in that situation; they are actually a part of it.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 45,
                  "content": "If the school says that sports uniforms are an exception, ask why the school specifically sanctions the sexualization of its students when they are representing the school in front of large crowds, but demonizes it when an individual student is simply trying to learn, to the detriment of that student's education.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "That’s still not okay.",
                  "id": 81,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "When I was in high school in the early 2000’s, they purposely made our cheerleading skirts super long so they’d be within dress code to wear during the school day.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "I have an abnormally long torso and wide hips. My roast beef cheeks could hang out and I still wouldn’t violate the dress code. It’s a totally arbitrary measurement and is especially weird that it’s being used on people whose bodies are actively and rapidly growing. A kid could have the same pair of shorts and could go in and out of rule compliance over 18 months.",
          "id": 83,
          "comments": [
            {
              "score": 8,
              "content": "I'm currently wearing underwear longer than where my fingertips reach lmao (and yes I checked)",
              "id": 84,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "This! The \"finger tip\" rule has an extra layer of \"stupid\" built in! I'm the opposite of you: I have super *short* arms (the T-Rex jokes make themselves), so short, in fact, that shorts just past my fingertips would have a little less than an inch in-seam and my butt cheeks would peek out if I bent over. It's an absolute ridiculous standard, as is any rule based on \"cleavage\". It's even more ridiculous when you add in athletes who are allowed to/have to wear their team uniform on game days, because a lot of athletic gear for women and girls is very skimpy.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "As a non US person this whole concept seems demeaning to me. Teachers would never comment on anyone's clothes here, I think they might even get into trouble for harassment if they did. I have teens and they wear what they like. ",
          "id": 86,
          "comments": [
            {
              "score": 8,
              "content": "We had such a rule at my school in Canada, but I never saw it enforced.  Not once.  The only dress code rule I saw enforced was about hats.  We had a weird rule about no hats inside and it was enforced consistently and aggressively.  We didn’t even really have to wear the gym uniform if we didn’t want to - I had gym first period and it was usually cold, even in warmer months, at that time of day, so I (and many others) wore track pants instead of buying the uniform shorts (there were no uniform pants) and no one cared.  Most of the other rules in the dress code were reasonable and I don’t remember any issues.  But the fingertip one and the hat one were dumb as shit.",
              "id": 87,
              "comments": [
                {
                  "score": 15,
                  "content": "The hat one is a holdover from the old days. It is considered disrespectful to wear a hat indoors, for any reason. My Uncles Father was very strict on this rule.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": ">NTA, but if you want to change the rule, be smart about it. Get a bunch of girls in your school to measure what length of shorts they could wear\n\nOne thing that could be added as well. \nUniforms of cheerleaders,\nIf they are given those tiny shorts for P.E. from  the school. Etc.\n\nBecouse, why is school saying it's okay to display stomach, etc in uniforms they give them. \nBut shorts above the knee are bad when it's in the school hall.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I am very tall so shorts and skirts on me would pass the fingertip test but not the x inches above knee test. I just wore what I wanted because, as usual, dress codes were rarely enforced. \n\nBut once I was sent to the principal’s office for skirt too short (which it definitely was) and this guy wanted to PADDLE me. Like he wanted to bend a 14 year old girl (edit:not 16) with a short skirt over his knee and spank her. I was new to this school system and was kind of gobsmacked this was even considered. I told him I wanted to call my mom first. I did and she told me to sit down and wait for her. She came flying into that office at record speed. I was sent out into the hall but couldn’t miss my mother chewing this guy out. She berated him extensively for being a perv wanting me to submit. It was glorious even though I didn’t get the full meaning of what she was accusing him of until I was older. She left yelling that no one was allowed to lay a finger on me as a form of discipline and took me home for the day. I’ve never seen my mother so angry. She told me I was wrong and I shouldn’t wear short skirts anymore but the school’s response was asinine.",
          "id": 90,
          "comments": [
            {
              "score": 2,
              "content": "Omg! When did this happen??",
              "id": 91,
              "comments": [
                {
                  "score": 2,
                  "content": "Mid 80s. I had to go back and calculate and I realized I was actually 14 at the time.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Your mother is awesome. 👏🏼 \nI’m not surprised that this was the 80’s but I’m shocked that these kinds of rules still exist in modern times.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "I just had to check - yeah my fingertips don’t come past the bottom of my butt. What a stupid rule!",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "So unfair to the Marfans crew. ",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "The fingertip rule is so arbitrary! I have a long torso so my short could be insanely short. But my kid (he happens to be a boy so of course he doesn't have arbitrary rules applied to him which is crazy) has much longer arms so his shorts, if that was the rule, would need to be significantly longer than mine. The only rule they enforce on him is that you can't see his underwear. He wears boxer briefs because the kid is the poster child for student athlete. They see the bottom of his boxers all the time but he gets away with it because it resembles compression shorts.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1958,
      "content": "School dress codes: society’s way of telling young girls their education is a privilege to be revoked when they aren’t dressed modestly",
      "id": 97,
      "comments": [
        {
          "score": 187,
          "content": "Yep!",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 144,
          "content": "As a bloke I can't think that this provides any good optics.\n\nYou basically have a fully grown man looking at a child's body and deciding that it causes sexual arousal.\n\nIt sounds like the teacher here is basically saying to a kid \"please leave, I'm getting horny looking at your legs\"",
          "id": 99,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 122,
          "content": "This. My high school had a rule that skirts should be 2 and a half centimetres above the knee. Even before I injured my knee I hated anything remotely close to my knee and had my skirt a little over half way up my thighs because it felt so restricting otherwise - everything was covered and no one was even looking at me and the boys in my year didn’t even notice that my skirt was as short as what it was. It could be seen under my school blazer but was considered too short and inappropriate because boys would get distracted even if teachers never said it outright. Also didn’t help that if I had it at the right length since we were forced to wear pencil skirts instead of other skirts it still became to short from riding up my legs from walking up and downstairs if I had a class upstairs or from general walking to and from class.\n\nToo my misogynistic headteacher it didn’t matter that most girls had their skirts short and were wearing knee high socks while I wore thick tights under my skirt even in summer, I was the one who got told to lengthen my skirt because I was in my final two years of high school and had to show the year 7, 8, and 9 girls that you had to listen to him because his word was law and to him women didn’t matter.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Yes, it seems extremely weird to me. I guess it's connected to the prevalent religious extremes in the US and a legacy of the puritans. I don't live in the US, and my kids can wear what they like, unless it's actually against the law of indecent exposure in our country, like private parts hanging out, no teacher has ever commented on anything and I think they might actually not be allowed to do so. It could be seen as harassment. ",
          "id": 101,
          "comments": [
            {
              "score": 20,
              "content": "I live in Hungary, and honestly, same here. The one and only time I remember when a girl in my class was told to go home and change, because her attire was unacceptable, was when she showed up in such a high-cut top, that it could pass as a bikini top, paired with these very form-tight yoga-short, with no underwear, so you could literally see her cameltoe through them.\n\nOther than that, there wasn't a dress code, really. No uniforms (aside of the school's sport's teams), girls mostly wore pants and shorts (depending on the season), I don't think I saw any of them in a dress or a skirt, pretty much ever. One classmate had a tattoo, I know multiple people who had earrings or piercings. Nobody gave a shit really, the general attitude was that it's up to the parent what they consider to be appropriate, and if the parent is okay with the kid getting a piecing, or showing up in hot pants, so be it.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I live in Finland. One day in high school my classmate came in with sheer pantyhose and no pants. No one said anything. It was weird yes, but we don't sexualize kids.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "At my high school I saw a guy wearing a t shirt where the back had a tattoo art style pinup girl with her boobs out. Yet girls weren’t allowed to wear tank tops with straps thinner than the width of three fingers.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 440,
      "content": "Nta only for the fact that showing so much above the knee is considering distracting. Please. \n\nI can’t wait for the day that dress codes are taking to task with how insulting they are. \n\nHonestly, if there is teachers out there please explain to me why this is so distracting to the other students in the room. Does a couple of cm’s actually matter?",
      "id": 105,
      "comments": [
        {
          "score": 265,
          "content": "I’m a teacher and it’s not distracting. Calling anything that “violates” the dress code distracting is insulting to all. First and foremost to the girls because it implies their education isn’t as important as an adult teacher’s comfort level with their amount of modesty in how they dress. And second to the boys for implying that they’re incapable of ignoring the girls so that they can concentrate on their work.",
          "id": 106,
          "comments": [
            {
              "score": 86,
              "content": "Calling shit \"distracting\" is just a catch all when they have no actual reason for something. My son was told he couldn't have his gallon jug of water because it was \"distracting\" while everyone else was walking around with their Stanleys or whatever.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Yes. I very much agree with this. It stupid that it's considered 'distracting'.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "This applies to a lot of things, really. Only in my freshman year of high school (2016) did the district FINALLY come to the conclusion that unnatural hair colors weren't a distraction in class. ",
          "id": 109,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 432,
      "content": "My big question is since nobody else noticed this 3cm discrepancy why did he? Because he was looking at your \\*ss that's why.",
      "id": 110,
      "comments": [
        {
          "score": 128,
          "content": "Eh. Maybe everybody noticed it, but only he cared enough to enforce it.\n\nSource: family member is a teacher and thinks dress codes suck. He notices violations all the time; he just never does anything about it.\n\nSo OP's teacher may not be a perv. Just a stick-in-the-mud who wants to control girls.",
          "id": 111,
          "comments": [
            {
              "score": 56,
              "content": "Why not both?",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Was a former teacher myself, also male. I noticed clothing violations all the time. I never commented on them because I felt it was  a bad look to be pointing out girl's legs were showing or they had a bit too deep of a neckline.\n\nAlso because the boys could wear muscle shirts and jerseys showing off their entire chest and that was somehow considered okay (and trust me, when the really ripped senior walked down the halls with his basketball jersey hanging so loose every movement flashed his abs and chest 90% of the girls stared. And about 10% of the boys too FWI). But sure blame the girls.\n\nBut yeah, we generally noticed. We just didn't say anything or maybe gave a little heads up that they *may* be in violation of dress code and to be careful or the principal will write them up.\n\nIt takes a power freak to actually want to enforce that shit and control people, especially with how in general most people dgaf about how you dress.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "Noticing a thing does not automatically mean it is being sexualized give me a break.",
          "id": 114,
          "comments": [
            {
              "score": 148,
              "content": "The rule only exists because of sexualization. Girls and women are policed on the length of their shorts and skirts only because of male gaze. There is literally no other logical reason for such a rule.",
              "id": 115,
              "comments": [
                {
                  "score": 86,
                  "content": "This is the answer, thank you for saying that. If it wasn’t sexual then why the fuck weren’t the boys sent too? Logic says something else was more important to the teacher than enforcing the dress code if he’s not being consistent.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "It's really creepy that we have all these teachers patrolling and looking at girls asses to make sure their pants fit a broken and arbitrary length that isn't even a good measurement. \n\n\nIf it's not a useful measurement, then all these teachers are doing is gazing ass.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Happy Cake Day",
                  "id": 118,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 45,
              "content": "Then why didn't he notice the boys wearing tank tops and flip flops",
              "id": 119,
              "comments": [
                {
                  "score": 3,
                  "content": "Because he didn’t find those sexual.",
                  "id": 120,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "For the same reason no one noticed she misstated the fingertip rule in the original post; people don't always catch everything.",
          "id": 121,
          "comments": [
            {
              "score": 21,
              "content": "I noticed, I just didn’t care, because it wasn’t a big deal - just like OP’s shorts!",
              "id": 122,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Dress codes are a great way for shitty people to be selectively shitty to people they don't like or are annoyed by. I also have a friend who is on the spectrum, can't accept that she's on the spectrum, and cannot selectively ignore or choose not to engage with any minor rule breaking. She has the highest number of write ups (that she's issued) of her entire building and the person in second place wrote up less than half the number she did. You can talk to her about intentional ignoring, picking battles, asking if this even matters right now for eternity, she's going to go into her classroom the next day and issue a write up for every single rule break she sees. \n\n&#x200B;\n\nShe's so good at math, instead of teaching middle school, she really should be an accountant or work in corporate compliance.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 177,
      "content": "NTA. Sorry that this happened to you.\n\nDress codes are pretty much BS. Selective enforcement, targeting females, is sadly, a normal-condition of our established institutions. \n\nThat said, it was wrong to refuse to attend *The Office*. You missed a perfect opportunity to skin and eat *The Principal* without any witnesses. \n\nSome people call me crazy.",
      "id": 124,
      "comments": [
        {
          "score": 7,
          "content": "It is so targeted too. I remember in my private middle school, we all wore the same style of skater skirt. A lot of the girls were skinny without much curves so there was no issue, but I had a bigger butt and I was the only girl who teachers would pull on the hem of the skirt and give me shit. Why on earth adults felt justified pulling on a 12-14 year olds skirt and making comments, I have no idea",
          "id": 125,
          "comments": [
            {
              "score": 2,
              "content": "I have had to point out that the awesome skirt they are wearing does not look the same from the back. They had no idea how short it was. \n\nThey also don’t realize if yoga pants are tight people can see their underwear through the pants.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 162,
      "content": "NTA, but you'll have better luck if you get your parents involved rather than fighting it yourself. Push the angle to your parents that you are upset that your education was interrupted over this, and you feel it is unfair and damaging. You could also potentially push how uncomfortable/sexualized your teacher made you feel, by making you feel as though your bare skin was somehow 'distracting' to him and the boys. Only push this angle if your parents don't totally suck, though- otherwise stick with the safer 'My education is being damaged' angle.",
      "id": 127,
      "comments": [
        {
          "score": 54,
          "content": "In the late '60s my father was called because my sister's skirt was too short. The Vice Principal walked around the school halls with a thin pillow. If he spotted a girl whom he thought had a skirt that was too short he made her kneel on a pillow. Her skirt had to touch the ground or she violated the the dress code. Dad came in but he didn't bring another skirt with him. He told the V.P. that my sister was going through a growth spurt. It was 2 weeks until the summer break. He said if the VP wanted her to wear a longer skirt he could buy her a couple of them. Dad would wait until just before the Fall term to buy her new skirts or dresses when her growth spurt ended. (Girls had to wear skirts or dresses but no slacks or shorts. No one could wear denim or sandals. Sneakers could only be worn in \"gym\" class. The girl's gym uniform was very short and had built-in \"bloomers\" to hide panties.) That was when miniskirts were popular. Most girls rolled their skirts up really short until the saw the V.P. and they'd quickly unroll them.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 150,
      "content": "Fingertip rule is stupid. My fingers almost reach my knees. My husband on the other hand could almost go Winnie the Pooh style. The length of your arms should have nothing to do with what’s considered decent on your lower body.",
      "id": 129,
      "comments": [
        {
          "score": 26,
          "content": "Yes! I have such long arms I have to buy men’s jackets because women’s jackets are NEVER long enough. I celebrate when I find a shirt that reaches my wrist. The fingertip rule was a nightmare on hot days and in gym classes.",
          "id": 130,
          "comments": [
            {
              "score": 10,
              "content": "I buy athletic jackets and shirts that have “thumb holes” because they are a few inches longer because they are assuming you’re wearing them over your hands. They fit almost perfectly.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I have short arms and a long torso, so my fingertips end up just below my butt. Any shorts, just about, are longer than fingertip length on me.",
          "id": 132,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 76,
      "content": "NTA why is a grown man looking at a child's legs long enough to clock that?",
      "id": 133,
      "comments": [
        {
          "score": 6,
          "content": "why do you think",
          "id": 134,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 59,
      "content": "NTA and I'm seriously proud of you!",
      "id": 135,
      "comments": [],
      "relation": "Support"
    }
  ]
}