{
  "post content": "Also posted in the advice subreddit. I'm 26F, he is 27M and we have been together for 8 years. \n\nI was in a bad car wreck a few months ago after getting T-Boned by a Semi. Because of this I got a check for almost $19k, as well as a brand new vehicle. I practically begged my boyfriend multiple times not to tell anyone we received the money because both of our families suck and like to mooch off of us, even though we are the ones struggling financially and we are the ONLY ones who lost our jobs to Covid. We got laid off within a week of eachother and were both denied for unemployment. So it's been rough. \n\nI received the check from the accident 3 days ago. He instantly went and paid $100 to his sister that we owed her and apparently she asked where he got money and despite me telling him not to, he told her I had gotten my check. He instantly told me about it and said that he felt \"cornered\". His sister has that affect on people so I tried to push it out of my mind even though I was peeved. \n\nSince that point I have gotten phone calls from all 3 of his brothers, his 2 sisters and even his uncle who I have never even met, due to him living out of state. All of them were asking for money. I hold true to my restrictions and didnt allow anyone to borrow anything because I know they will NOT pay me back and I have more important shit to do with my money (pay bills, rent, pay off my car loan and student debt and put away a big chunk so I can save for a home). \n\nThe final straw was this morning. I wake up to a call from an unknown number at around 530am and it's his father. Hes like \"Hey Champ, how you doing? How are you recovering?\" So I gave him the run down. Well, before he hangs up he says \"So Julie (my boyfriends sister) told me you got your money. Peter (his step son) turns 5 today and I didnt get my paycheck and I'm fighting with payroll about it. Can you spot me $500?\" I instantly hung up and confronted my boyfriend about it.\n\nI told him my basic requests were ignored and that I felt disrespected and that I didnt want people knowing for this exact reason. He told me I was blowing it out of proportion and that I could simply tell them no. I explained that that was besides the point and that I wanted to avoid having to turn people away left and right. He still thinks I'm overreacting. \n\nSo now I am at a loss where a part of me wants to cut access to my check from him entirely since he cant even follow basic requests. Hes not spending the money or anything like that, especially without asking first but the fact that he told people after I practically begged him not to sits really heavy on me. A part of me knows he is right and that I could just say no but I dont want to have to do that. WIBTA if I cut off his access to this money?\n\nEDIT: I truly did not expect this to blow up the way that it did! I went to visit my mom shortly after posting and neglected to check it again until this morning so I have over a thousand notifications. I'm slowly going through all of them and if I dont directly respond to you, I apologize!\n\nEDIT: I'm actually going to jump back off this post because now I am becoming slightly irate at people jumping to assumptions without asking for info. First and foremost (I only ready maybe 100 comments), me telling my boyfriend not to discuss my financial matters with his family is not me being controlling, at all. This is my money, not his families, and some shit is on a need to know basis. This is not something they needed to know, period. Secondly, no, him keeping this information isnt something that would have made him uncomfortable. He has no problem withholding this sort of info from my family but when it comes to his own, it's a complete double standard. This has also happened in the past with my tax return money as well, which coincidentally I happened to be conned out of nearly $8k by the same sister in question. She never paid us back. This is also the same family that saw that I needed a place to stay while getting my new home situated and knowingly pushed all their Bill's on me, resulting in me being $1200 in the hole by the time I left their house. My boyfriend doesnt mind these things. But as I said, hes all for helping his family while telling my family to basically go fuck themselves.",
  "id": 1,
  "comments": [
    {
      "score": 23480,
      "content": "Nta. Cut him off. It's your money not his. And if he just ignores what you want, he doesn't deserve a penny.",
      "id": 2,
      "comments": [
        {
          "score": 8357,
          "content": "He also doesn’t deserve a girlfriend if he just ignores her when she asks him not to do something.",
          "id": 3,
          "comments": [
            {
              "score": 3288,
              "content": "My thoughts exactly. Clearly he either has no idea how to handle money, or he has no idea how to care for another person, or both.",
              "id": 4,
              "comments": [
                {
                  "score": 2195,
                  "content": "[deleted]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 731,
                      "content": "Sound's like it's an inherited dominant genetic mutation running rampant through his family.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 143,
                      "content": "The way this comment is perfectly dripping with sarcasm made me smile.\n(NTA)",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Probably the dad who excitedly pretended to care in a phone call at 4:30am then said \"whelp, little Timmy's birthday, I need 500 hundred dollars! You're rich for now, heh-heh! \"",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1190,
                  "content": "Exactly, OP is recovering from a car accident. She doesn't need the stress of random strangers asking her for money. Where were these people when she was struggling?\n\nNTA, OP. And when his family calls, pass him the phone. He can be the one to tell them no, since it's so simple.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 558,
                      "content": "This. Make him turn them down, it’s his family. Why the fuck are they calling you anyways? ESP people you don’t know??",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 435,
                      "content": "Where were they before?  Just as broke as they are now.  When the payment of $100 prompted a question of 'Where did you get all that money?' you know you are dealing with a perpetually broke family.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 249,
                      "content": ">And when his family calls, pass him the phone. He can be the one to tell them no\n\nI was hoping somebody posted this. Let him tell them no, so he can deal with the drama.  And he's an asshole for telling God and country when you begged him not to.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 148,
                      "content": "If she can even trust him to say no.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 68,
                      "content": "This. Exactly!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 59,
                      "content": "Have him practice his responses to the initial question about where the money came from and to the later requests for money. Dealing with aggressive people is an important life skill and he needs to learn it. Then have him deal with any future money requests. It will be good practice.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 56,
                      "content": "Yes to this, pass him the phone...but first and foremost cut him off from your money or he’ll cave to his rellys when they beg him for YOUR money.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I wrote a long comment saying this, I wish I were somehow less wordy but basically it said if it's so easy to say no, he should have done it himself, not passed the stress of it to his healing, stressed out, currently jobless in a pandemic partner, because he knows she will never live this down with them, and he didn't want to have to deal with that. The only way they would find out is if HE told them, she asked him repeatedly not to and he want FIRST THING to do exactly that. jump. ship! After 8 years, that's . . . . honestly a deal breaker for me. My husband's family is particularly terrible, so maybe that's just me. It screams that he doesn't care about her.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "This, this and this all day.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Passing him the phone sounds like a bad idea if he easily caves under the pressure of his family. He'd end up promising money and the OP would then be the bad guy having to tell people \"hey, I know he said yes but its not his money so its gonna be no.\"",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 147,
                  "content": "That's it. If he can't just not tell people about the money, then how to expect him not to be giving it away. He should not have access to this money.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "It's been 8 years, There's a reason why they're not married.\n\nNTA",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 514,
              "content": "And hasn’t apologized and thinks she’s overreacting.",
              "id": 22,
              "comments": [
                {
                  "score": 251,
                  "content": "I mean, I can see where he is coming from, hear me out.\n\nOP already basically forgave him for telling his sister after being cornered. She was peeved, but was trying to push it out of her mind, as she understands she has that effect on people. If she was mad that he gave her the money entirely, thats not mentioned.\n\nThis sounds like the sister spreading the news. It might be more constructive for OP to express her issues about the sister. If the boyfriend has been spreading the news, absolutely! Throw out the whole boyfriend. I'm not getting that vibe, though. I'm getting the vibe that boyfriend made a mistake, was essentially forgiven, and now that same mistake is having lasting repercussions. Is OP taking back forgiveness here?\n\nI'm still going to say NTA, but I just think OP is taking the frustrations out prematurely. She should have a discussion and tell boyfriend he needs to set boundaries with his family and enforce them himself.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 214,
                      "content": "> but I just think OP is taking the frustrations out prematurely.\n\nIt doesn't sound premature, considering she's already getting the consequences.\n\nAnd she laid a very clear boundary about his family. He just ignored it, instead of \"enforcing\" it himself.\n\nBoyfriend is total TA.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 67,
                      "content": "The money info is out because of the boyfriend not respecting her boundaries. She has talked to him.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 66,
                      "content": "Agreed. People make mistakes.. He may have slipped up once by accident and the sister is the one who spread it amongst the family.\n\nBut also, the bf should help in rejecting his own fam and should not be telling OP they are blowing it out of proportion because he made the mistake.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "If it was so easy to say no, why couldn't he say no to the sister? He is so wrong for this, knowing how his family is and passing a huge fiasco onto OP. Instead of apologizing for the trouble he's caused, he is minimizing her feelings. Poor girl has been through enough and within a few days she has people hounding her day and night for money. We all know they will get angry with her for saying no. In their minds she is being greedy/selfish for not wanting to give all her money away. He should have at least told his sister not to tell anyone. If you can't trust someone with a little, you can't trust them with a lot. He should be cut off from all access to her money.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Understand your point, but: the onus is now on boyfriend to tell family they are under no circumstances to contact his girlfriend and ask her for her money. He started it by telling his sister.\n\nHe doesn’t want to confront his family and OP is left dodging calls and shitty people.\n\nPut bf and rest of trash family in garbage and start over. WNBTA",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 314,
              "content": "It's such an easy request, too. Just *don't talk about the money*. It's so easy a freaking parrot could probably handle it.\n\nI don't buy that he \"felt cornered\". He just didn't care about what OP asked of him. Even if he *did* feel cornered by his sister, if he actually respected OP he still would've kept his mouth shut, imo. I've \"felt cornered\" by family asking invasive personal questions about myself and others, but I still hold my tongue...it gets weird and awkward, then I leave. It's that easy.",
              "id": 29,
              "comments": [
                {
                  "score": 266,
                  "content": "He doesn't care, because it's op who has to constantly listen to the calls and say no, he gets off as being the good guy whilst she's enemy number 1",
                  "id": 30,
                  "comments": [
                    {
                      "score": 61,
                      "content": "I was thinking this too... OP saying no is going to make the family hate her... meanwhile he gets off scotch free and is the good guy to them in the scenario...she needs to tell him that he needs to tell his family no. Instead of forcing her to be the bad guy.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 43,
                      "content": "THIS. OP this is it exactly",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "\"Well you know Uncle Buck *I'm* more than happy to help you out, but it's OP's money so you'll have to ask her.\"\n\nThat way he gets to be the good guy while throwing his girlfriend under the bus. \n\nPersonally I think OP should keep the money and ditch the boyfriend.",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 181,
                  "content": "And if he couldn't say no to his sister, why does he think it's such an easy thing for OP to say no to her, his brothers, his dad, and any other rando he tells?",
                  "id": 34,
                  "comments": [
                    {
                      "score": 80,
                      "content": "Clearly because he can sit back and enjoy not being the one to deal with it then. Sigh.",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 46,
                      "content": "And then expected HER to just be able to say no to all the people he blabbed to.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "It sounds like a different situation with the sister. OP says they \"owed\" the sister $100, so BF paying the sister was paying off a debt. \n\nThe rest are pests coming out of the woodwork looking for handouts.",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "Clearly, he's blowing it out of proportion. He could have just told his sister no.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "Not only don't talk about the money, but don't talk about the money *that doesn't belong to you*. They're not married, he has no claim to it. Should OP use it to build their life together if they plan to spend their lives together? Absolutely. But at this moment, it's not his to brag about anyway.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": ">apparently she asked where he got money and despite me telling him not to, **he told her I had gotten my check.** He instantly told me about it and said that he felt \"cornered\". \n\nThe bf should have taken his own advice.\n\n>He told me I was blowing it out of proportion and that I could **simply tell them no.**\n\nHe could have simply said \"it's not your business\" but he caved and threw OP under the bus. It pisses me off that the sister's first reaction to being paid back is \"where'd that come from? Is there more??\" \n\n>WIBTA if I cut off his access to this money?\n\nNTA because one of your conditions was silence. He broke the NDA, he loses the money. But I don't think that's the right move for your relationship.\n\nu/colby1112, have him start fielding the money requests. The answer will always be no, so he won't have to run it by you. (The answer is always no because they weren't supposed to know it was even a question they could ask.)\nThis is his mess, let him clean it up. Tell him you feel cornered every time you have to tell someone no.\n\nAnd feeling cornered is his way of saying feeling guilty. He let himself be guilted into giving into his family (which is hard), and you shouldn't have to be cleaning up the mess. Plus hearing no from you is only going to make them dislike you, they'll possibly tolerate it from him.\n\nMake him screen your calls. He's told everyone your business, he gets to play secretary.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Exactly. If the family is known to be this overbearing and intrusive, he should have had the foresight to be prepared for questions about the money. He knew it was important to OP to keep HER finances private and it's absolutely on him that he immediately blew it. Worse, he threw up his hands and absolved himself from any responsibility when the situation escalated exactly the way OP knew it would. Imagine having at least 7 members of your family hound your significant other for money because you leaked private information, and then turn around and telling your SO that they're overreacting? Boyfriend is a huge AH.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "If he was cornered he could have lied and said a buddy/ pal/ old co-worker paid him back. He didn't have to tell.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "THIS!",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Yeah this is kind of what I was thinking too...",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Exactly. He ignores her when asked to do something, then when confronted about it he turns it around and says she's 'blowing it out of proportion'. This guy has no empathy for OP's feelings or concerns. NTA",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "HOLD UP. CALM YOJR HOURSES THE BREAK UP CARD IS NOT NEED IT.",
              "id": 46,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Statements like this ignore the fact that the boyfriend is also a victim of emotional abuse/ manipulation via his family. Yes he shouldnt have told but being in that situation myself, it can be really hard when you have family that paints themselves as always being in your corner and wants to paint it as you repaying them when to outsiders looking in, that isnt the case. Your perception gets very blurred. Its a form of abuse. Painting the boyfriend as some horrible person isnt going to help at all.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 822,
          "content": ">He told me I was blowing it out of proportion and that I could simply tell them no.\n\nLike the way he told his sister \"no\" when she asked where the money came from? /s",
          "id": 48,
          "comments": [
            {
              "score": 398,
              "content": "🚩🚩🚩🚩🚩🚩🚩🚩\n\nTHIS. \n\nHe can't say no to people, so leaves it for his gf to deal with. Sounds like a great life partner.",
              "id": 49,
              "comments": [
                {
                  "score": 116,
                  "content": "He is is using OP as a meat sheild. Its gross.",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 39,
                  "content": "That, and it seems like he comes from a long line of vultures. What kind of family all bum rushes a person (that they aren’t even related to) with their hands out as soon as they smell some cash? Don’t marry into this brood! Ugh!",
                  "id": 51,
                  "comments": [
                    {
                      "score": 4,
                      "content": "That's a good point. I wouldn't dream of asking my sister in law for money if she'd suddenly came into a bit of cash.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 176,
              "content": "Not sure how many red flags she needs but this guy and his family are bad news",
              "id": 53,
              "comments": [
                {
                  "score": 7,
                  "content": "[deleted]",
                  "id": 54,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 113,
              "content": "It ain't blowing anything out of proportion when people are calling you at 5:30 AM to try and get cash from you. You're not a damn ATM sweetie, and it sounds like his family don't realise it. It's gross when people feel like they're entitled to cash because they're \"family\". Funny though how few of these family members would part with their dough if the roles were reversed...",
              "id": 55,
              "comments": [
                {
                  "score": 7,
                  "content": "Also, who is spending $500 on a birthday gift for a 5 year old during a recession when he is already apparently in a cash crunch?",
                  "id": 56,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I know! What the actual fudge are they doing?!",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 410,
          "content": "I also suggest that OP put the check or whatever else into a separate account he has no access to.",
          "id": 58,
          "comments": [
            {
              "score": 304,
              "content": "Yeah.  OP should go open her own bank account *today*, before she finds out her idiot has given away all her money.\n\nOP, even if you want to have a shared account for convenience, keep the bulk of your money in a private account at the same bank.  You'll be able to easily transfer back and forth and that way you have a veto over the spending.\n\nRight now, you're one really good sob story away from that money vanishing.",
              "id": 59,
              "comments": [
                {
                  "score": 34,
                  "content": "Considering he’s heard all their sob stories and hasn’t given any of the money away or used it irresponsibly at all, I think that your worry is unfounded. The issue isn’t that he’s irresponsible with money; it’s that he broke OP’s trust when it comes to privacy. I’m not as worried about him spending all her money as I am about him telling people about whatever the next thing she doesn’t want to talk about is.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 73,
                      "content": "Maybe!  What gives me pause is that he could also fend off all the sob stories, and is instead dumping them on OP.  If they're like my sister (yes, there's history there), they'll soon figure out the weak link in the relationship.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This... if he can’t even keep his mouth shut and can’t tell people no... how long before he cracks under the pressure and starts handing out money to all his greedy family members??",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Today.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 143,
          "content": "He doesn't deserve a penny anyways, it's not his in the first place because they aren't married and it's literally compensation for an accident that happened to OP which does not involve her boyfriend at all.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "It's your money and you want it now!",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "This and she needs to put that money where he can't access it asap!! NTA all the way.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Agree with your response.  Also, if you are using it for living expenses, who knows how long it'll last.   You need money until you can find another job and then it'd be nice to have a nest egg.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "NTA, this.",
          "id": 68,
          "comments": [
            {
              "score": 74,
              "content": "NTA, also to add: now she has to say no to *multiple* people instead of him saying 'none of your business' to *one* person or telling a white lie. How hard was it to say, \"OP found it in a rainy day fund that she thought already ran dry?\"\n\nNot his money. I would also set his family on do not disturb on your phone and aggressively screen their calls/text until they learn some manners.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I’m leaning more NAH except the families. Some people have difficulty lying to family so I can understand him letting it slip to his sister when asked directly. OP says he didn’t spend any without asking, so the $100 he payed back to his sister was allowed. It’s still well within OP’s rights to be annoyed and cut him off from the money since it doesn’t belong to him, but I don’t think boyfriend has done anything major wrong. If the family members weren’t such assholes this problem wouldn’t even exist in the first place",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Do this. Imagine your regret in a year when all of this money is gone and you have nothing to show for it. Especially since it came from a traumatic incident that you suffered. This is your money. No one else’s.  \n\nLong term I would be concerned about your BF being a mooch just like his entire family. That is a learned behavior and he obviously was around it a lot growing up.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8429,
      "content": "NTA. It's not even his money, I'm surprised you allowed him direct access to it anyway. While you might not be so easily suckered into \"lending\" money here and there, his family will easily guilt him into taking it straight from you.",
      "id": 72,
      "comments": [
        {
          "score": 2465,
          "content": "This, so much this. Why on earth would you let him have access to the money. You should have your own accounts and one shared account for bills food etc and this cheque should be in your account.",
          "id": 73,
          "comments": [
            {
              "score": 693,
              "content": "100% agree.\n\nMy husband and I have separate bank accounts. We just go in together on bills (no joint account). We've been together 6+yrs and married 4 of those years. We're doing just fine by me managing our finances.    \n\nEdit: for those of you who have separate accounts and one joint or a different arrangement. I get you're doing what works for you. I also have a lot of trust issues.",
              "id": 74,
              "comments": [
                {
                  "score": 256,
                  "content": "I never understood when people combined there accounts, you read so many stories where they say there relationship has failed or is failing due to the partner taking all the money out of their combined account and left them with nothing. Then you get the people who comment you should have a joint account as you are partners in a marriage and everything should be shared etc. You should always have your own accounts like you in case of issues.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 276,
                      "content": "I can understand why. My parents have been married for 35 years and have joined accounts. No problems whatsoever. But neither of them are shitty, irresponsible people",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 75,
                      "content": "That is completely part of it. I had a really bad break up with an ex prior to meeting my husband. My husband and I never saw the reason to have joint accounts.   \n\nI never had a joint account with my ex, but getting everything else untangled was a hot mess. The last thing I needed to worry about was his access to my bank account and screwing me over financially.   \n\nAs for an example when I moved out he changed our Netflix password (when he said he wouldn't- fine whatever), he got my key for Microsoft Word revoked so I couldn't use it, and he told me he sent our cats to the local kill shelter to be killed (later changed it to giving one to his parents & the other two to a senior couple- I unfortunately just count the cats as deceased). Because he was such a liar I have no idea if he truly gave them away. He also wanted me to pay off our phone bill, when we had sold my phone and he used that money on himself. So I made him pay the rest of the phone bill for us to split off into our own accounts (I personally paid for the number change).",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 42,
                      "content": "> Then you get the people who comment you should have a joint account as you are partners in a marriage and everything should be shared etc. You should always have your own accounts like you in case of issues.\n\nThere's a world of a difference between having a joint bank account when you're just living together vs when you're married. For one, you get legal protection when you're married and then later want to separate.\n\nSecond, if you value your own money and life so much, and fair enough, then why even bother getting married? Just live by yourself and to be honest, that's a great life too. Marriage implies trust. I mean, a metric ton of trust, not just casual trust based on limited knowledge of the other person.\n\nThere are also tons of people with good married lives with joint accounts. Not saying their lives are perfect but it is not like in most of their cases, one partner is robbing the other blind.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "My wife and I have one account, but we’re mature adults who trust each other and communicate before we make any large purchases.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "We have one separate account each and one joint account. It’s really easy to manage money that way.",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "It’s because you don’t directly put your paychecks into the joint account. You have a joint, and you have your individual bank accounts. You direct deposit your checks into your individual accounts and transfer your part of the bills into the joint account. That way you both have access to the money that’s being used on expenses but they don’t completely dry you for everything you have if your partner decides to fuck you over. And you can easily argue in court that the money that was placed in the joint was your contribution to the bills and the partner stole it. You should only use that joint account for shared expenses and that’s it.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 142,
              "content": "Yes, fully combining finances like this with a boyfriend opens up a bunch of risk. I’m a huge believer in only fully combining your finances once married and your lives are fully merged already.",
              "id": 82,
              "comments": [
                {
                  "score": 44,
                  "content": "As someone who dated an addict and was taken advantage of because he didn't have a job so he only had money through me (and I was dumb and naive and believed him when he made promises of never again), I'm a huge believer in that now too.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Even when married you should have separate personal accounts, then one joint for expenses. This way if you DO end up breaking up/divorcing one partner can't screw the other by taking all the money.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 8,
                      "content": "This might seem silly since people’s concerns here seem to be mainly post-break up, but how do you get a partner gifts when your accounts are entirely combined without them finding out what you got them? A joint account isn’t always a bad idea imo, but having no personal account? That’s insane to me.",
                      "id": 85,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 164,
          "content": "$19K isn't exactly a life changing amount of money either, it could be easily gone in a day if the boyfriend makes a poor decision (which seems plausible).\n\nNTA x1000",
          "id": 86,
          "comments": [
            {
              "score": 85,
              "content": "$19K might not be life changing for you but it would be for a lot of ppl.",
              "id": 87,
              "comments": [
                {
                  "score": 35,
                  "content": "Yes, $19k would pay off about 60% of my loans tbh. Those are going to be over my head for years. I think about them every day & the financial burden causes a ton of stress.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 62,
              "content": "However, it is life sustaining for OP, as it was meant to be.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": "I had to go back and read this wtf.  He can just one day decide to transfer all your money into his account with zero repercussion.  If you insist on having a joint account, do a separate one and put money into it for fun, rent, etc.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "[removed]",
          "id": 91,
          "comments": [
            {
              "score": 29,
              "content": "Sharing your finances with anyone is a foolish move. Keep your account and have a third joint for bills is the way to go.",
              "id": 92,
              "comments": [
                {
                  "score": 38,
                  "content": "Especially if you aren’t legally married... then you have no legal protections if something happens... I would never have a joint account with someone I wasn’t married to... and even married I would still have my own account they can’t access.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "That's a pretty broad brush.  My wife and I have been married for almost 27 years, and we have had a shared account from day 1.  It has never been an issue.\n\nThat being said, there is NO WAY I would let this particular guy have access to the account (or this money), based on what has been shared in this thread.",
                  "id": 94,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Having totally joined finances without being married is risky and pointless yeah. Boyfriend could drain the cash and bail and she'd have no recourse. \n\nOne of the main benefits of not marrying is the financial distance you can maintain (credit history, debts, etc). Combining finances beyond a joint expense account for rent, bills, etc really doesn't make sense, might as well just get married if you're going to open yourself to that level of risk/commitment anyway",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Exactly this.  If he was so easily “cornered” into telling about the money, I have no faith whatsoever he won’t end up caving and giving out money to his relatives. \n\nNTA",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This don't combine finances with someone your not married to.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Exactly. My spouse of over six years just inherited decent money from a deceased relative. It's HIS money. I make less money than my spouse and I have a huge student loan I am still paying off, but that doesn't change the fact that his inheritance is NOT my money. I'm not going to expect a cent or ask to use it to go towards me or any of my own adult problems.\nOP's boyfriend and their families are major assholes, the lot of em.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I was married for ten years and my current relationship is at five years. In both relationships we kept/keep separate finances. My current one we have a joint account for rent. Otherwise, we divide household expenses. If one of us needs money, we give it to each other. \n\nMaybe I'm just weird that I've never wanted anyone direct access to my accounts. Any relationship can seem perfect, and I trust my current partner completely, but you never know what may happen down the line",
          "id": 99,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3322,
      "content": "NTA. His family seems pushy, and it’s better to be safe than sorry especially when it’s YOUR money",
      "id": 100,
      "comments": [
        {
          "score": 1053,
          "content": "Yeah, this. NTA.  If you’re laid off, you need this money.\n\nIf he can’t honor this simple request, how do you know he won’t go behind your back to ‘lend’ them money?\n\nAlso, what 5 year old needs a $500 birthday present?!",
          "id": 101,
          "comments": [
            {
              "score": 739,
              "content": "And who calls at five fucking thirty in the morning to ask someone for money??",
              "id": 102,
              "comments": [
                {
                  "score": 222,
                  "content": "an entitled parent, thats who.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 129,
                      "content": "Nah that’s not entitled, that’s a moocher.",
                      "id": 104,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 205,
                  "content": "It's like he was trying to catch her sleepy so she'd be more likely to make a bad decision or something...\n\nIt was basically an ambush.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 82,
                      "content": "And he called her from an anonymous phone number... to make sure she wouldn’t dodge the call.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 49,
                      "content": "There's so many ways that could backfire, and he's lucky she only hung up on him after she said no. I for one get super cranky when woken up, to the point where I cursed out a telemarketer for calling me in the middle of the day when I worked overnights.\n\nYou're right in that it was an ambush, it absolutely was. I'm just saying he's very lucky he wasn't cursed out or worse.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I don't wake up to anything but alarms, so if someone called me I literally wouldn't answer. but honestly, if I did, I'd be very annoyed and wouldn't have a filter straight away. stupid move on his part, he's lucky she only hung up",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I wonder if the 5:30 was due to lack of awareness of time zones.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Someone who knows you'll answer at that hour.\n\nYou can ignore an unknown number during the day, but if they call when you're probably sleeping you'll answer.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "A person who’s that desperate. Like how inconsiderate and shitty do you have to be to call that early, have a conversation to suck up to her, and then ask for a huge amount?! For a kids birthday? Sounds like it’s for alcohol or drugs. His whole family sounds like trailer trash. Including him. He says she’s over reacting, yet he’s letting his family attack her. Every single one of them has asked. What’s wrong with all of them!? That’s sooo pathetic tbh. How embarrassing. His sister is a b for opening her mouth too.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Someone who got a water/electricity shutoff note in the mail yesterday.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 120,
              "content": "probably a 5 year old with a parent who has a habit",
              "id": 113,
              "comments": [
                {
                  "score": 125,
                  "content": "This was my first thought too. $500 for a five-year-old's birthday present? Fucking *please.*\n\nOh and NTA. You should definitely cut off his access to *your* money, OP.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 53,
                      "content": "> $500 for a five-year-old's birthday present? Fucking *please.* \n\nRight?  And newsflash, if you can't float $500 until you get your payroll issue sorted then you definitely can't spare $500.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "That's more than I spent on my 5 year olds birthday party at freaking build a bear",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Right. They're not even married, she owes him nothing.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "That's just his cover story.  It's just manipulative B.S. the guy is using to guilt OP into giving him the money, which he will then turn around and spend on himself.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": ">His family seems pushy\n\nThat's a bit of an understatement",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I'm actually pretty curious what the cultural context is here. I can't even IMAGINE this happening if my family / friends and I were in a similar situation, it would just be so inappropriate and taboo. So I guess I'm just interested where or to whom this is considered acceptable behavior to the extent that the entire extended family seems to be harassing her for money...",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2398,
      "content": "Hey Champ, you are NTA.\n\nYou need this money more than anyone right now.",
      "id": 121,
      "comments": [
        {
          "score": 275,
          "content": "upvote for \"Hey Champ\"\n\n\n:)",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Seriously, what’s up with all the mooching?! Like how is this even real? I would not want to be part of that family. We all fall on hard times but I could never have there audacity to pull this shit.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1841,
      "content": "Do you really want to be part of a family like this?  Stay with this guy and you'll never escape the (possibly metaphorical, possibly not) trailer park.  \n\nNTA.  This is your wake up call... listen to it.",
      "id": 124,
      "comments": [
        {
          "score": 399,
          "content": "It’s worth nothing that $19k is not a lot of money in the grand scheme of things. I agree with you it seems that OP is probably from a lower middle class/lower class background (absolutely nothing wrong with that) and so is her boyfriend. $19k would not even pay a years worth of rent in the city I live in. $19k will absolutely help you in the short team pay off bills, debts, whatever miscellaneous payments you may have, etc. But by no means did you just win the lottery. Be frugal with that money, pay off whatever debt you have lingering, put some aside for your rainy day fund, and DEFINITELY do not give his family members money. \n\nAnd yeah, NTA.",
          "id": 125,
          "comments": [
            {
              "score": 103,
              "content": "Right. She could just tell them she spent all $19k on her car payments, loans, etc and there’s no more money left. I can’t imagine there would be that much left after all those payments anyways.",
              "id": 126,
              "comments": [
                {
                  "score": 5,
                  "content": "I'd be holding off on those bills until I had a job, honestly. Pay what has to be paid, but hold off on paying ahead",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I'm just speculating, but it's also totally possible that she'll need that money for medical bills/PT. Getting hit by a semi is not a minor accident, even if she sustained no major injuries she could have pain or other issues the crop up in the next few years.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Buddy, people are in trailer parks for many reasons. I am in one currently since my wife is going to nursing school and I’m the sole provider. I just think the “he sounds like a guy from a trailer park” is a cruddy thing to say",
          "id": 129,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Very true. Do you want to marry into this? Phone calls and texts every freaking DAY? Oh hell no.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "AGREED so hard",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Well, her family sucks too, not saying it justifies it.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1019,
      "content": "NTA. \n\nYou absolutely need to PROTECT YOURSELF. It's your money, your trauma and suffering (seriously that sounds like a terrifying accident), and I don't believe for a minute that he panicked and let it slip. I think he told them because either he knew they'd pester you and either it would keep them from pestering him for a while, or he's in on the scam. \n\nNormal, reasonable people do NOT behave this way! Like seriously, how fucking gross and tacky can you be. While there's no shame in reaching out to family when someone really really needs it, that does not include calling your nephew's girlfriend whom you've never even met and asking her for money, wtf?",
      "id": 133,
      "comments": [
        {
          "score": 502,
          "content": "$19K is actually not a lot of money compared to the pain & suffering caused by a major car accident. Beware of people who act as if it is!",
          "id": 134,
          "comments": [
            {
              "score": 244,
              "content": "Yup, 19k is not a lot. I know it sounds like a fair amount when you are broke, but with rent, paying off a car, bills, and they were denied unemployment!  \nShe won't have much if she's unemployed for longer than a few months.\n\nI'd lose the bf, because keeping him and his family is a certain path to supplementing 3 brothers, 2 sisters, 1 step brother, and the dad aka staying broke.  \nYou'll never save enough if he keeps telling them you have money.",
              "id": 135,
              "comments": [
                {
                  "score": 108,
                  "content": "Exactly this! $19K would be a nice, hefty sum to receive if it were a supplement to an income that covers your needs already, but when you have no income and no savings, that money just becomes a few months of float to find a new job, and that's about it. You can stretch it quite a bit if you're super frugal, but ultimately, it just represents a new deadline to find an active income. Given the state things are in right now with the pandemic, and the way some industries are drying up completely, OP is going to need to make this money last as long as possible. It's not like this is \"extra.\" This is her survival money.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 77,
              "content": "Not only that, it's just not that much money period. Sure to just be handed an unexpected check for $19k feels like a lot. I'm happy if someone hands me an unexpected $100. Unexpected \"free\" money will always feel like a lot (I say \"free\" because OP paid a solid personal price obviously since she was in an accident). But the reality is that $19k just doesn't go that far. They're not living large, OP is just now able to hopefully have a bit of breathing room for bills and have a solid emergency fund. My opinion on NTA wouldn't change if it were $190k, but $19k just is not that much money in the grand scheme of life.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "I sat here scrolling after being in complete disbelief over people acting like 19k is rolling in it. 19k is less than a brand new vehicle, OP will still have to buy used and a few years old and if she's good at pinching pennies *maybe* she can cover bills for like the next 3 months?",
              "id": 138,
              "comments": [
                {
                  "score": 8,
                  "content": "I interpreted it as she was getting $19k on top of a vehicle",
                  "id": 139,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Going back to read, you're correct. I first read it to mean the vehicle was coming out of the 19k. It doesnt change that it really isnt a large sum of money, but it's still a lot to help OP and not her boyfriends *mooching family.*",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "For that kind of accident, I'm shocked it was that little.",
                  "id": 141,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Sounds like this was on top of the car being replaced, but . . . yeah. That $19K is probably for things like yoga, physical therapy and expected lost time (before the COVID struck). Not for WHOO HOO LOTTERY!",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "That's a really good point. Like I can't even imagine getting t-boned by a semi, like that's absolute nightmare fuel of an accident right there. And they're acting like it's just a payday for themselves somehow...",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I was in a shit wreck a while back. Permanent damage, partial amputation, have been in daily, chronic pain now for about 11 years. I “got” $10k at the end of the lawsuit for my recovery, after paying all doctors and medical providers. It went very quickly —physical therapy, sports massage, time off work because you might need it...",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "this is true. i recently settled a car accident with a figure maybe doubled this, but after a lawyers fee, close to this. POINT IS, the back pain i deal with every day makes the amount of money laughable and no amount of money is worth being miserable over pain every day, especially when doctors say theres nothing else they can do for you. OP drop your bf.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "I don't know if he's in on it, but the way his family appears in constant \"need\" of borrowing money, I bet he boasted about how much cash OP got in a lump sum. I agree with everything else. Who the hell needs 500$ for a 5 year old kid's birthday?",
          "id": 146,
          "comments": [
            {
              "score": 7,
              "content": "> I bet he boasted about how much cash OP got in a lump sum \n\nThat's a good point. If he truly felt he had to provide an answer (he didn't), he could have said he came into a couple hundred and that's it. Or, he could have even said he borrowed it to make good on his debt with her (which, in a sense, he did - from his g/f).",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 563,
      "content": "NTA.\n\n$19k inst going to last you long if your boyfriend's long lost relatives all start piling up asking for money. You had a simple request, don't tell anyone about the money, and even that he couldn't follow up with. So he can act like you don't have that money at all.",
      "id": 148,
      "comments": [
        {
          "score": 68,
          "content": "Agreed NTA. It also isn’t going to last you long when you don’t have a job and you do have bills. Does your bf typically contribute to bills (when you both had jobs)? Was it even then or split in some way?",
          "id": 149,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 406,
      "content": "NTA\n\nIn what universe are you the ah here?\nI highly recommend you remove his ability to access your money immediately.",
      "id": 150,
      "comments": [
        {
          "score": 94,
          "content": "NTA - Also, maybe OP should remove his ability to access any part of her life. What a jerk.",
          "id": 151,
          "comments": [
            {
              "score": 22,
              "content": "NTA- Agreed. Not answering his sister once about where money came from was too hard for him, but he cannot comprehend why OP is uncomfortable shutting down every member of his family. Sounds like a pretty selfish an unempathetic boyfriend to me.",
              "id": 152,
              "comments": [
                {
                  "score": 6,
                  "content": "Exactly. One thing my mother told me about relationships is that each side has to handle their own crazy. BF is pushing his crazy family on OP while he does zero emotional labor.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I feel like everyone on this subreddit must have the most fragile relationships. Someone makes a mistake or does something mildly shitty and it’s time to jump ship. What happened to trying to work through problems?\n\n8 year relationships ending over the drop of a hat is just nonsense.",
              "id": 154,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 315,
      "content": "NTA in this situation no matter what you want to do. You had good reasons for asking him not to blab and he did. He acknowledged he was wrong to do so but is now minimizing the repercussions. That's the bigger problem than him letting it slip after feeling cornered.\n\nThat being said he is a bf of 8 years theres what I assume to be a lot of love and trust.  To me, it was that he couldn't keep a secret that is the problem, not his access to the money itself.  I think by \"cutting him off\" you are establishing withholding your money as a punishment for his behavior. Not a great precedent. Theres also a bit of INFO needed: Do you ever see yourself combining finances with this person in the future (i.e. getting married)?",
      "id": 155,
      "comments": [
        {
          "score": 233,
          "content": "Very good point! I just dont know what to say or do to make him understand where I am coming from. We have tried combining finances in the past but his bank account is over $600 overdrawn (because of his sister, go figure) so we cant combine until he pays it off.",
          "id": 156,
          "comments": [
            {
              "score": 208,
              "content": "So trust him to a point, just not with money because he is a push over for his family. He needs to grow up and prioritise himself and his relationship over his family’s toxicity. If he can’t understand this point then unfortunately I’d say you’ve got bigger problems on the horizon. \nKeep your money safe.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 174,
              "content": "Because of his sister - or because of him?\n\nUnless she drained his account personally, then the responsibility (however difficult) lies with him.",
              "id": 158,
              "comments": [
                {
                  "score": 176,
                  "content": "She wrote fake checks in his name years ago. I believe he was 17 at the time so it has been outstanding for some years now. He didnt press charges because it's his sister.",
                  "id": 159,
                  "comments": [
                    {
                      "score": 456,
                      "content": "Then how did he owe his sister $100? Why wasn’t that $100 considered a partial payment of her debt to him? He shouldn’t be giving his sister a penny until she has fully paid him back for the fake checks.",
                      "id": 160,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 220,
                      "content": "Do not combine finances with this guy. He should have pressed charges when his sister committed fraud. By not pressing charges he messed up. \n\nHe is a victim of abuse and he is in the fog about his family. He needs some therapy or outside help to see this probably.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 69,
                      "content": "How has his account been $600 negative for over ten years?",
                      "id": 162,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 47,
                      "content": "You seriously seriously need to keep your money separate from this guy. He will financially ruin you if he is able. Make sure he can not access your money at all!",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Ok, that makes sense.\n\nBut that financial reality is probably having an impact on his finances, and therefore yours.\n\nSo I still wonder...",
                      "id": 164,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "And they still exchange money?? Yikes.. will he ever put you and your needs and requests before his family?",
                      "id": 165,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "Has his sister ever even attempted to pay him back? 10 years and she hasn’t been able to pay him back $600? You realize if she had given him only $10 a month, she would have finished in 5 years.",
                      "id": 166,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "Yo get this kid unattached from he's sisters ass, or this is gonna drag you down hard",
                      "id": 167,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "She wrote fake checks in his name 10 years ago and his account is still overdrawn?",
                      "id": 168,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "You seriously seriously need to keep your money separate from this guy. He will financially ruin you if he is able. Make sure he can not access your money at all!",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 130,
              "content": "NTA. And if your bf can’t say “no” to his sis [or any other family members] you might want to reconsider *ever* totally combining finances. I’d say the great majority of my married friends have ‘his’, ‘hers’ and ‘theirs’ checking accounts. It might not be so bad with ‘what mine is his and his is mine’ financial management. The problem comes when when it’s “what his is theirs.”",
              "id": 170,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 106,
              "content": "I'm very biased but you should cut and run\n\nI got involved with a family like this via my ex, your post brought back instant memories of being called into the kitchen where x family member would say \"can you lend us xxx\"  \n\nAfter i couple of these (probably more like 10) I snapped, not at the mooching inlaws, at my SO for constantly throwing me under the bus and not telling them to FO and instead guilt tripping me into being the bad guy all the time.\n\nOther times my ex would say \"we need x money as i lent.......\" Mainly small amounts but we were on our knees and they wanted money so they could go out.\n\nI never joined fiances as my ex burned through money due to her upbringing. The moment i opened up free access to my bank (over a decade later) after the ring went on as she'd shown maturity around money finally (or so i thought),  2 months later we had bailiffs on us for the bills she wasn't paying and her spending addiction was rampant.\n\nIf i had a dollar for every discussion i had where she looked blankly at me as i explained why lending her family money that was paying our bills was forcing me to work OT to make it up but also showing her family were using her, only for it to be dismissed or minimised, i'd be able to guild every comment in this sub\n\nDon't make the same mistakes I did, people like this are brought up being taught to use others when they need something, irrelevant of the other persons needs. Your SO is one of these people, the way he stands back and lets them come direct to you is the proof here.\n\nHonestly, RUN",
              "id": 171,
              "comments": [
                {
                  "score": 41,
                  "content": "I’ve known folks like this, too, and for so many of them, they would never see it as “using” someone.  Because that’s just what you do - it’s family.\n\nIt’s grifting dressed up in family guilt.  And it is very much a lifestyle.  It’s not sone annoying little habit he could change - it’s how he is in the world.",
                  "id": 172,
                  "comments": [
                    {
                      "score": 9,
                      "content": "My husband is (or was?) Like this. It drove me insane, he always wanted to \"help\" his family. The only thing that worked is that I sat with him and told him that \"you can't help people if you aren't in a position to help, if you give them our money now you'll just be perpetuating that we remain slightly less fucked as a family, instead we can save all that money, invest it in a business and when your mom is older we can take care of her, but if we give that money away now you're sentencing us to this way of living permanently.\"\n I don't care bout him wanting to take care of his mom, I just want to do it right so we can do it without scraping by and be all comfortable. You can't do that if you're constantly \"lending\" money to family. My family is such the opposite, no one asks for money unless it is a real emergency, and in all my life I've only seen them two times pool in money for an emergency as a family.",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "Do not ever combine finances with a person and a family like this. Don’t do it. Do not!",
              "id": 174,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "Do not combine your finances. If he overdrafts again after they are combined, some banks (not all) can and will do something called an offset. What that means is:\n\nAccount #1 - person A and person B = -$200 overdrafted  \nAccount #2 - Person A = $500.00\n\nso Bank says, \"That's alright, Person A *also* has account #2, with $500.00 in it. So we will just take the $200 from there to fix the overdraft in Account #1.\"\n\n(The IRS can also do this for back taxes with any bank account with a person's name on it, regardless of whether or not the particular bank also offsets checking accounts.)",
              "id": 175,
              "comments": [
                {
                  "score": 7,
                  "content": "This happened to my mom with my step dad. He would always overdraw their joint account and it would make her checks for bills from her personal account bounce. \n\nThen when her $2,000 tax return was deposited to her account the county took it for his back child support payments. Then the IRS caught on and started garnishing her account for his back taxes. \n\nIf you hook up with perpetually broke people you will be perpetually broke because they will find a way to spend your money too.",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Use a different bank.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "If he couldn't keep a secret because he was 'backed into a corner' what will happen when they ask him for money?\nNTA",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Never combine finances with a boyfriend. Even if you’re married, have a joint account for stuff but keep your own money separate and accessible only by you. It’s not fun to think about, but a “fuck this, I’m outta here” fund is really important to have.  \nHe sounds financially immature. What’s his employment situation? Edit— errrr, his employment situation before you were both laid off. Sorry :)",
              "id": 179,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Dude, this is a slippery slope. DO NOT share any money with him, are you kidding?",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Don’t combine. Ever. If he ever matures and is able to manage his own money like an adult, and you two make lifetime commitments to one another, maybe.\n\nOtherwise, your money becomes his money which then goes to his family, fun money, whatever and you’ll be overdrawn all the time, too.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 256,
      "content": "NAH. I was expecting to see that he went against your wishes multiple times, but it looks like he made a single mistake that you yourself kind of understand.\n\nIt's certainly your right to do what you want with this money but I'd worry about doing it just to PUNISH your partner rather than to prevent something bad happening. He needs to apologize properly but it sounds like you're looking to escalate instead of dealing with the actual issue.",
      "id": 182,
      "comments": [
        {
          "score": 160,
          "content": "Thank you for being one of the first rational responses here. The number of people suggesting to end an 8 year relationship because of one mistake is truly concerning. Unless there's a lot about the boyfriend OP isn't telling us. NAH",
          "id": 183,
          "comments": [
            {
              "score": 42,
              "content": "I think most are comparing OP with her BF's family and not her BF per re.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "I think people were assuming this as a pattern instead of a one off mistake. As well as being concerned about his reaction to his mistake. She asked him not to say anything to his family because they would ask for money. He told them, they reacted the exact way she warned him, and now she has to continually tell people ‘no’ at all hours of the day because of it. Then his response is it isn’t a big deal. His family is calling her not him.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "The fact that the entire family, including people she has NEVER met, are hitting up OP for money means that unless boyfriend is willing to cut them off, which it doesn't seem he is capable of, they are all bad news.",
              "id": 186,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I'm pretty sure most people are assuming boyfriend told the dad and possibly other family members ie. that he's been *repeatedly* disregarding her request, not just the once. But to me it reads like the sister is the one telling everyone.",
              "id": 187,
              "comments": [
                {
                  "score": 3,
                  "content": "Nah, most people are seeing \"Strong independent woman\" argument and running with that.",
                  "id": 188,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "He only made one mistake but instead of owning up to it, he's trying to minimize the consequences and putting the responsibility on her to deal with his consequences by saying no to everyone, when he couldnt even say no himself. And then further failing to protect his girlfriend from his family's harassment. Makes him at least a bit of an AH in my book.\n\nI agree on your punishment/escalation point though. But I don't think that makes her an AH. Mostly because I think she shouldn't give him access to the money to begin with.",
          "id": 189,
          "comments": [
            {
              "score": 12,
              "content": "He owned up to it immediately, he said it in the post. He told her what happened, and OP admits that his sister can be really hard to handle.\n\nI think it's worth mentioning that he is clearly on OP's side here. He isn't pressuring her to give his family money at all. There's no manipulation here, just a mistake.",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Finally someone said it, it definitely sounds like the boyfriend only told his sister (which OP unhappily understood) so why is she punishing him?",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Absolutely this. It was a sucky thing he did, for sure, but OP themselves admitted that the sister has that effect on people. It's not like he posted on Facebook or went around showing off money. He told one person who pushed him into speaking and everything else branched out from there.\n\nI'd say OP should start handing the phone to their boyfriend whenever someone from his family calls, the moment they identify themselves. That sounds like good punishment and might even help him build some apparently needed character. But cutting him off financially when they're both struggling and are supposedly supporting eachother might be a little too much.\n\nNAH",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Finally someone who has a correct realistic answer. Some people can just be really good at manipulating you into telling them everything, and his sister real sounds like one of them. \nYou need to have a talk with him OP, he's your partner and partners need to communicate their issues. \n\nAnd I do also believe you are overreacting. You are within your rights to say no and that's basically what he said you can do. You are an adult, so saying no to people shouldn't be that big of a deal. Yes it can definitely be frustrating, but if you really want to tell everyone no you can just say to one of them to pass on that you want them all to stop asking you for money. If they don't just ignore their calls/messages.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Oh look someone with sense. I do think he needs to tell his family to back off real quick but hes not the AH because his family sucks.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I shouldn't have gone through 10 top level answers to find this. I read the story carefully and while the boyfriend is being defensive rather than apologetic, it doesn't seem like he's doing anything that warrants ending a fucking 8 year relationship.\n\n>Hes not spending the money or anything like that, especially without asking first\n\nI think this is a really telling sentence a lot of people are leaving out.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}