{
  "post content": "So I know from experience that Reddit isn't the most understanding towards parents of young kids but I really just want a third party opinion because this situation is driving me crazy and my family are saying I need to get over it\n\nI (F30's) live with my partner and our two kids, ages 7 and 3.\n\nMy older sister \"Ava\" (also F30's) and her husband recently purchased a house in the local area. It's a super nice place with a big yard and as you can probably guess from the title, a swimming pool.\n\nAva recently hosted a barbecue at her place. It wasn't a huge event, she invited me, our parents and our other siblings.\n\nShe mentioned letting the kids play in the pool so I only assumed my kids would get to be included\n\nWe are potty training although my youngest is still in diapers at the moment.\n\nAt the barbecue, I was getting my youngest ready for the pool by changing him into a swim diaper. Ava pulled me aside and told me she doesn't think it's \"hygienic\" for my youngest to play in the pool, since swim diapers don't hold pee and she asked that he doesn't swim in the pool with the other kids playing in it\n\nI didn't think this was fair and told Ava that lots of people, adults and kids, pee in the pool and it would be no different at a public pool so what's the problem?\n\nShe was being really condescending and wouldn't listen to me at all and said that he can play in the pool when he's \"toilet trained\", and said it's not fair on the other kids.\n\nAt this point my son was crying because he wanted to swim in the pool and I told Ava she was being cold but it's her house and her pool so do what you want. Ava accused me of trying to guilt trip her and told me to just drop it.\n\nI was getting upset myself at this point and i told our parents and other siblings about what Ava did. They told me it's not a big deal and that it's not worth arguing with her over and try not to let it bother me. I wasn't happy with this because this essentially means they're siding with her and downplaying how she treated me and my son. \n\nI left the barbecue early with my family because we didn't feel welcome after that.\n\nThe next day Ava messaged me a whole paragraphs and said that she's \"sorry\" that I'm upset and that she wasn't trying to exclude my son for the sake of it. It was a super non-apology and I told her I don't want to hear it and that she's damaged her relationship with her nephew and shes not the one who had to deal with him being upset. \n\nAva snapped at me out of nowhere and said I'm being dramatic. I told her to grow up and said that I have a very valid reason to be mad, and she needs to stop acting like a teenager. \n\nAva showed these messages to everyone and everythings just a bit up in the air. I feel like I'm right here but the rest of my family doesn't seem to agree.",
  "id": 1,
  "comments": [
    {
      "score": 32265,
      "content": "How the fuck are people voting N-T-A here?? \n\nYTA 100%!!! \n\nFirst and foremost it's not your pool. It's Ava's. And It's totally reasonable for her to not want your kid's piss in it.",
      "id": 2,
      "comments": [
        {
          "score": 15943,
          "content": "Thanks, I thought I was going crazy. OP is absolutely TA\n\n> lots of people, adults and kids, pee in the pool \n\nThat's why OP's sis has a private pool with a no pee policy.",
          "id": 3,
          "comments": [
            {
              "score": 8013,
              "content": "Lmao like any of the older potty trained kids are even going to admit they peed in the pool. Which they will do. Even the adults. People pee in pools, unchanging and gross fact of life. This is why you treat pools with chemicals.\n\nAnd for the record, i think that peeing in the pool is disgusting. But thats not going to stop me from going in.",
              "id": 4,
              "comments": [
                {
                  "score": 3514,
                  "content": "It's a totally different thing to knowingly put someone in the pool who is defs gonna pee",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1084,
                      "content": "There's a reason why chlorine is added to pools.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Honestly my 3 year old is WAY more likely to announce that he has to pee and be taken out to pee than my 7 or 11 year old will want to stop playing and go inside where its cold to pee which involves messing with clingy wet clothes.\n\nIn my experience, toddlers being potty trained often adamantly refuse to pee anywhere other than the potty since they are learning thats wrong. All of my kids, while toddlers, were hesitant to pee outside while camping for example.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Or poop. Yeah, it's contained, but until you have a kid spend a week with cryptosporidiosis after ingesting baby-poop contaminated water...",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1138,
                  "content": "Not all kids are potty trained by 3, especially boys who take longer. I have 3 boys. 1 wasn’t potty-trained until 5 due to medical issues, 1 was fully potty trained at 2 1/2 and my 3rd was potty trained around 3 1/2 or 4. We started training all boys at around 2 1/2 when they showed signs of being ready for it.\n\nESH OP. It’s Ava’s pool so, she makes the rule. She should have let you know ahead of time that your little would not be allowed to swim but, you acted entitled and rude. You need to apologize.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 1186,
                      "content": "I voted NTA because she waited until they got to the house to inform him of this rule when all the other kids were swimming.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "My son was fully potty trained by 24 months but my daughter who was daytime potty trained at 19 months couldn’t go all night until 2.5. It’s really dependent on the kid. However, we have found that potty training early before they have “willpower” seems to work best. Other people think that you should wait until later. I just hated changing diapers tbh but I don’t care what people so, it’s their choice. I definitely do not like un-potty trained kids in a pool though!",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Funnily enough, according to my parents it was actually easier to potty train the kid with the penis.  \n\n\nReason being they lived in a house with 100% linoleum flooring, so they just let him wander around pantsless during that period so that if he peed he'd get immediate visual stimuli that something was happening instead of just going in a pullup without having to think about it just like he'd always done.  \n\n\nBut when they had the kid with the vagina, they lived in a home with carpets so that wasn't an option. So that one never got that visual reinforcement of what happens when they pee and took longer to get the hang of things.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I agree 100%. I’d also add that it’s entirely possibly she was being diplomatic by only saying “pee in the pool” when the real issue is a potty untrained child of that age could easily defecate in the pool and that would ruin the event of swimming for everyone. Regardless, for OP to make such a bid deal of this reeks of insecurity, jealousy, entitlement, and mother lion syndrome. “Damaged the relationship”, is laughable. He’s 3. She’s reaching to justify her and his hurt feelings. What she should have done is say, “Ok, sure, I understand”, and then drive down the street and buy a cheap baby pool from Walmart. Problem solved, adult and child tantrum avoided, fun had by all, and no one confirming on here yta.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 207,
                  "content": "My kid, at 3, was not potty trained despite multiple attempts. It's actually not uncommon for kids, esp boys, to go as late as 4 or 5 before being potty trained. \n\nOP is the AH. Her pool her rules. Bottom line.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 37,
                      "content": "As an EYE I would say it is uncommon for a child to not be using the toilet independently at 4 or 5. Almost all children I've worked with become interested in toilets and are capable of building toileting skills around 3",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 28,
                      "content": "Early childhood teacher here, with 2 decades of experience and a master’s degree in early ed. It is definitely NOT common for children not to be able to use the toilet with full independence at ages 4/5. Does it happen? Yes, but usually the child has a developmental delay or the family has lived in circumstances (eg. homelessness) where they could not potty train, or the family chose not to teach their child to use the toilet at a younger age and actively encouraged them to “go” in their diapers. Even then, they are usually able to be successful by age 3. 4/5 is a major delay.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "Thank god my boys trained earlier than 4 or 5. My older boy was just after his 2nd birthday, and my youngest was almost 2.5.\n\nMy preschool won’t accept kids that aren’t potty trained. Accidents happen, but they have to be trained.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Yep! My 3 year old is just now finally getting it. Week two of no accidents at nursery! She is in underwear there but mostly Nappies still at home until next week as I think she's cracked it there enough to encourage full undie wearing now. She wasn't ready until recently and now has been suddenly totally on it. She's been so proud bless her",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I totally not trying to sound like a jerk at all, but I have read on Reddit many times that people don’t potty train until the children are toddlers or even about to start school.  Is this a new dynamic or has it been going on for a while?  I ask because my mom potty trained us as soon as we could walk and I potty trained my oldest niece the same way.  Is this because of the change in many changes in society and work culture for working parents?  I realize there are many challenges for parents that weren’t there when my mom had small children and when I was forced to take care of my niece 50 years ago.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 101,
                  "content": "It’s pretty common for boys to potty train late! 3 is pretty reasonable to be working on it :)",
                  "id": 20,
                  "comments": [
                    {
                      "score": 127,
                      "content": "Use it to motivate the kid!  My kid was seriously motivated by M&Ms. Anything works.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 38,
                  "content": "I've always detested this.  From the moment i have memories I didn't pee in the pool.  I went up the deck stairs, dried off, and used the fucking toilet.  Peeing in a lake or large body of water?  Whatever.  Peeing in a pool?  What the fuck is wrong with you people.  I didn't go to the pool to lather up in your pee, and you didn't to lather up in mine or we'd be paying each other.  Grow the fuck up and use the bathroom.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Im with this guy. Like, why? What's keeping anyone from not pool peeing?",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": ">People pee in pools\n\nPoorly parented people pee in pools. I've been swimming since before I can remember (my dad would put floats on my arms and take me with him when I was a toddler). At no stage of childhood or adulthood did it ever occur to me to pee in the pool.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Hold off on lumping the “even the adults” part lol. I haven’t peed in a pool since I was a young kid. I’m 41 now. For the majority of these years I’ve gotten out and used a bathroom. \n\nSome adults have manners and maybe her family does too. In this case as someone else said, it’s different putting in a child that you know will definitely be pissing.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Idk what kind of adults you hang out with, but we definitely get out of the pool to piss.",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "I don't pee in people's pools. If I found out people who hung out in my pool follow your thoughts \"people just pee in pools,\" i wouldn't let them in my pool.",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "I agree peeing in the pool is disgusting, but also think of how disgusting it is if someone pooped in the pool.  OP’s kid isn’t potty trained, so they very well could poop or pee in the pool.  I personally don’t want to swim in sh*t water",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 670,
              "content": "You can say it’s a “no pee pool” all you damn well please but kids will piss regardless, hell lots of adults too.",
              "id": 29,
              "comments": [
                {
                  "score": 1590,
                  "content": "Any adult pissing in a pool is a loser and a person with no respect for others.  They need to grow up and stop being immature idiots.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 1206,
                      "content": "I had no idea pissing in pools was such a common thing. I can honestly say I have never pissed in a pool, as a child or an adult, because it sounds like such a repulsive thing to do. I don’t get it",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 297,
                      "content": "Seriously, I thought it was gross to pee in the pool when I was a kid and still do as an adult. Kids can absolutely be taught not to pee in the pool and some figure it out by themselves.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Thank you. I thought I was in crazy town with some of the comments!",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "This is where I'm at with it. What grown as adult pees in a pool? That is so vile and just outright repulsive.\n\nIf I found out that an adult was peeing in pools I would absolutely shame them. Absolutely disgusting and an adult should know better.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Or drunk.\n\nI was at an all-expense resort with my company and was in one of the large pools with a poolside bar. I dutifully got out of the pool and went to relieve myself in an appropriate facility each time I needed to go, but I noticed that several other of my colleagues who were drinking steadily had not exited the pool in over two hours. One of them was loudly insinuating that the parents with smaller children in the pool had better watch them to make sure they didn't pee, and I retorted with \"I'm less worried about them than I am with everyone drinking and not getting out for more than 2 hours to relieve themselves.\" That shut that convo down quickly and I noticed quite a few sheepishly going off to the bathroom afterward.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I was on a swim team from 8-18. Summer and winter. \n\nNever pissed in the pool. Now the ocean? Yea I passed in the ocean cause the bathroom was too far away",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "What kind of adults are you dealing with?! That's disgusting. Lots of my friends have pools, and people just get out and say \"back in 5\" to go to the toilets, or pee in the bushes if any are far enough. Sometime there are even some towels on the floor paving the path to the bathroom for guests. Wtf.",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 116,
              "content": "It's also absolutely insane to me to not only knowingly and consciously pee in a public pool, but in someone's private pool, as a whole adult. Who does that??",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I can safely say I have never peed in a pool",
              "id": 39,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": ">That's why OP's sis has a private pool with a no pee policy.\n\nShe has no clue if she has a no pee policy.\n\nHer kids are probably doing it all the time.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I don't care how much you house break your kids. They are all going to be peeing in that pool.",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "If I have ever peed in a pool I was way too young to remember, probably in swim diapers! I would like to believe most people are like me and have never ever done so unless they were very young, like OPs child. I seems completely reasonable not to want anyone to pee in your pool. OPs YTA, I don't understand why not wanting a piss pool means you are acting like a teenager?!",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It's also insane that everyone's just addressing the pee part and ignoring that swim diapers are only supposed to be a temporary stopgap at best. The cdc says that swim diapers and pants MIGHT hold in SOME solid feces but they aren't leakproof. At best they MAY stop diarrhea causing germs from leaking into the water for a couple of minutes but they don't actually stop  germs from contaminating the water.\n\nWhen you have a child in swim diapers you're supposed to continually check them and take them out for frequent bathroom breaks. If an accident happens, you're supposed to change them as far away as possible to avoid additional contamination, reduce the amount of urine in the pppl that uses up chlorine that would otherwise be killing other germs, or binds with chlorine to create airborne irritants \n\nSwim diapers still allow 50% of disease causing particles to leak out within one minute (25% in a minute if you add a vinyl cover but that's still a whole lot of ick) - so they're absolutely still a gross health risk and just yuck to rely on.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "OPs kids are now fine to swim in my pool once potty trained, however OP is banned for life. \n\nThey clearly pee in pools.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Right lol “adults and kids? Cool, now you AND your kids aren’t allowed in my pool since you are ok with peeing in it”",
              "id": 45,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3207,
          "content": "She could have told her this BEFORE the kid was already getting changed and avoided two adults and a child having a meltdown over it.",
          "id": 46,
          "comments": [
            {
              "score": 496,
              "content": "Most 3 year olds are potty trained completely. Sister may not have known the youngest wasn’t potty trained.",
              "id": 47,
              "comments": [
                {
                  "score": 645,
                  "content": "You'd think that... but working with kids, it's more appropriate to say 6 and over... not most 3 years old..  You can be toilet trained, but when they hit that warm pool water...",
                  "id": 48,
                  "comments": [
                    {
                      "score": 41,
                      "content": "I wouldn’t worry about pee as much as 💩.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 462,
                  "content": "Most 3yos still have accidents... \n\nSource: I am a 3yo. Kidding I work with a whole bunch of them and have for years. Even the ones that potty trained themselves still have oopsies once in a while. Typically when they're having so much fun and don't realize.. you know like.... in a pool.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 29,
                      "content": ">Source: I am a 3yo\n\nYour typing is very advanced! XD",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Most 3 year olds are working on potty training.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Even when potty trained its common courtesy to put a swim diaper on a baby or young child. Please do if you go to a public pool. Thanks from every single lifeguard out there…",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Not true, quick search shows it's 50/50 at 36 months.  Regardless, couldn't hurt to ask.  Couldn't hurt to have the kid try before he goes in the pool.  Have the kid go in for a few minutes and then have everyone out for some reason.  Plenty of things they both could have done to make everyone happy, but imo they're both the AH for different reasons.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "LOL no they aren't.",
                  "id": 55,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "Boys? Not necessarily. Mine was pee trained by then during the day, but poop and overnight? Another six months.",
                  "id": 56,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "Even if they are, you can still stick on a swim diaper just-in-case.  That's the whole point of it.\n\nAnd to think that the older kids won't be peeing in it is SUPER naive",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Just to be fair, I would still use a swim diaper for a while after my kids were good with the potty. The downside of a disaster occurring was not chancing it.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "This is the most ignorant comment on this post. I work in a room with 18 almost 3 year olds. Two of them are close to being potty trained. Every child is at their own pace.",
                  "id": 59,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Yeah, she should have mentioned it when she invited them all over. You can't let a young kid like that get all excited about a swim and then take it away. I mean, you can, but it's an AH move. I remember how excited I used to get as a kid when, on the rare occasion, we found ourselves at a pool. We were poor, there was no pool in our neighborhood, so it was a big deal. Especially this kid, whose sibling and cousins all get to play but he can't? Poor kid.\n\nBesides, OP would likely keep an eye on the boy, pulling him out to go potty every so often. That's what I would have done. \n\nNTA.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I think this is the real issue here. It's not really about peeing in the pool, it's about inviting your family over for a BBQ and that the kids can go swimming, without sharing the conditions that might apply to one or more of your guests. The reason for the issue is that OP was not informed ahead of time, and her three-year-old was pretty certain that he was going to go into the pool/ was excited about going to the pool/ clearly has experience going into pools wearing a swim diaper. \n\nAssuming OP is not an entitled parent who thinks their kids should get whatever they want, I have to say ESH. \n\nIt's completely fair for a person to make rules about their own pool. But when you have small children coming over to your new house with a pool, and in your invite to your BBQ, you mention letting the kids play in the pool, you need to make it clear that the invitation only applies to \\*some\\* of the kids attending or what conditions you are placing on who can use your pool. That way, mom can make a decision about whether or not she wants to attend and deal with the meltdown, or if she wants to avoid sister's house until the kid is potty-trained. \n\nAlso, I bet this completely changes if the sister has her own kids. Being a parent changes your worldview on many things.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "She could have told her this when she invited her and given her the chance to decide if she wanted to take a toddler to a pool he wasn’t allowed in or skip the event.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Right, this is why I vote that OP is NTA. Ava’s rule is perfectly reasonable. It’s also awful that she couldn’t be bothered to have this conversation until her 3-year-old nibling was just about to hop in the pool. A quick conversation could have avoided a toddler meltdown, and she didn’t care enough to do it.  I’m an auntie to some toddlers and am about to have a pool installed, so I’m really grateful to OP for sharing this experience. I’m making a mental note to have some necessary conversations and research shock chemicals. Sending big hugs to the tiny human! I hope they can have a lot of happy swim time somewhere else this summer.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1981,
          "content": "Then why invite OP and her family.This is like giving every child an ice cream except one.Its cruel to exclude one child and force him to watch the other kids having fun.",
          "id": 64,
          "comments": [
            {
              "score": 2492,
              "content": "Everyone is invited to an ice cream party! Except when you get here you specifically can't have ice cream because you might drip it on my carpet. Ok everyone else! Dig in!",
              "id": 65,
              "comments": [
                {
                  "score": 634,
                  "content": "I’m having a pool party for the kids to swim,potty trained only.  See how short that was. Pool party potty trained kids only! Even shorter. Not that hard. Also I have 6 sisters trust me I know which kids are potty trained or not. Sisters talk about their kids especially when it involves stressful things like potty training.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 179,
                      "content": "Exactly! Then a parent can plan accordingly.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "Lol. You, and many others here are acting like potty trained is a binary state. Depending on the kid they can be potty trained but still having the occasional accident.\n\nThat pool is 100% getting pissed in regardless of the rule.",
                      "id": 68,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 25,
                      "content": "Another solution (which idk why the sister didnt think about) Have a smaller inflatable pool, just for the baby. They are super cheap, and that way the kiddo wouldnt feel left out.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Am I weird to think it’s weird to try and police people peeing in your pool?  \n\nI understand not wanting it to happen, but to make it a topic of conversation is really odd. \n\nOnce the preference is stated, you’ve got to drop it, but I also wouldn’t bring that up at a family cook out.",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Shades of Eddie Murphy … you ain’t got no ice cream, you ain’t got no ice cream!!! Want a lick? Psych!",
                  "id": 71,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Exactly this. I would've gotten a little 'baby' pool with a sprinkler for the younger kids, or at least told the parents in advance. OP should've left and gone to a public pool that day instead.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 818,
              "content": "Exactly. Giving OP that info ahead of time could have allowed OP to either choose not to go or arrange for something else to keep her son occupied (like a little wading pool to play in so he didn’t feel left out).",
              "id": 73,
              "comments": [
                {
                  "score": 19,
                  "content": "Love this, a little kiddie pool for junior to play in, some bubbles, no meltdown, everyone’s satisfied.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Correct. Kids need front loading aka expectations set beforehand. Like all things, communication goes a long way.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 462,
              "content": "They have an older child (7) who IS allowed in the pool. There are so many activities that are safe and appropriate for a 7 year old, but NOT safe or appropriate for a 3 year old. Should the 7 year old never get to do anything age appropriate, or should the 3 year old never hear the word \"no\" from their parents?",
              "id": 76,
              "comments": [
                {
                  "score": 766,
                  "content": "There are a lot of activities that would be safe and appropriate for a 7 year old and not a 3 year old, but I wouldn’t assume that “swimming in the pool with mom” is one of those activities. It would literally never occur to me if a family member said “hey come to my house for a BBQ, the kids can swim in the pool!” that my 3 year old would be excluded from that invitation. She should have specified ahead of time that only potty trained kids were allowed (since that’s not a typical pool rule) and then at the very least sincerely apologized to OP for the misunderstanding that excluded the toddler.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 189,
                  "content": "And I can guarantee that the 7 year old is peeing in the pool",
                  "id": 78,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Have literally never pissed in a pool, that is what the sea is for",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 661,
          "content": "Nobody is mentioning the big thing, which it the shit. A kid shitting in a swimming pool warrants the pool closure. And a non potty trained kid is a walking risk of poo-in-the-pool. \n\nYTA for presuming your sister rules don't apply to you, and also for glossing over the elephant-shaped ptobable log in the pool\n\nAs an afterthought, wtf about the ppl assuming peeing in a pool is normal behavior. In my country, it isn't. It's drilled not to do it. The number of runs me & other ppl do to the toilet to suffer removing a wet bathsuit to take a piss is incalculable (also with a child, btw). I'm not saying it never happens. I'm saying it isn't as usual an occurrence as you're all implying, specially in a private-owned pool, with family. How does ppl educate their kids, frankly?",
          "id": 80,
          "comments": [
            {
              "score": 395,
              "content": "That’s the reason for a swim diaper. They don’t hold in liquid, but they do hold in poop.",
              "id": 81,
              "comments": [
                {
                  "score": 540,
                  "content": "they hold in the big dry chunks and that's it - even the dry poop gets wet, breaks down into smaller bits and gets in the pool - gross",
                  "id": 82,
                  "comments": [
                    {
                      "score": 167,
                      "content": "The whole concept of a swim diaper is disgusting.",
                      "id": 83,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 33,
                      "content": "As someone else in this thread said they’re “poo teabags”.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 210,
                  "content": "They might hold a little bit of the poop but there’s always a chance the kids gonna have a wet poop and then your screwed. Also poop softens in water…",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 205,
                  "content": "The poop is still there though and particles still transfer to the water. Basically it’s like a poop tea bag.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I hate the poop tea bag visual but I also can't stop laughing, so thanks for that",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "This thread is making me wanna vomit and never go to the pool again",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "It would’ve cost you nothing not to say that 😢",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "They don't do much for messy poop, which happens occasionally if you have kids in diapers. They also aren'tgreat at...securely...restraining... the solids, FYI. After potty training 3 kids there's no way I'd let a kid in diapers in a pool I had to clean.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Not really. My son had poop on his swim diaper when we were in a reservoir and that was leaking. Even if you don’t see it is still leaking because those diapers absorb all the liquid and whatever is in it gets wet and runny. He even had a swim diaper cover and still leaked .",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Swim diapers don't do jack shit, pardon the pun. They're not watertight. They just hide the proof, until the shit starts to escape via the leg holes as the kid energetically churns the water with their chubby extremities. \n\nIt only serves a cosmetic purpose and the societal norms of no nudity in a pool. \n\nSource: I'm a parent in a seaside environnement, I've seen some shit (in and out of water). \n\nPS: the only (not totally, ie: diarrhea) safe way for your baby or toddler to be in the pool, excretion-wise, is for the parents to wait until they have a poo (usually humans pee at the same time), clean their butts and off they go in the water.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "[deleted]",
                  "id": 93,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "They don't hold in the bacteria.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 495,
          "content": "I agree that OP is TA, but I don't think Ava is completely guilt-free. She's inviting people to her pool and of course kids are going to want to play in it, she should have warned OP beforehand that her kid wasn't allowed in the pool. This is a totally reasonable request since the kid isn't potty trained, but it's a bit mean to invite kids over for a pool party and wait to tell them they're not allowed in the pool. \n\nThen maybe OP could have brought a little mini plastic pool from the dollar store and played with her kid separately from Ava's pool. \n\nEveryone could have been a little nicer.",
          "id": 95,
          "comments": [
            {
              "score": 120,
              "content": ">  but it's a bit mean to invite kids over for a pool party and wait to tell them they're not allowed in the pool.\n\nYea, thats not fun to explain to one kid why they can't swim at a pool party and have fun with siblings and cousins.  \n\nOP should have dropped it the next day though",
              "id": 96,
              "comments": [
                {
                  "score": 10,
                  "content": "Agreed, OP should have just voiced her opinion and let it go.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Yea Ava set OP up for a temper tantrum from the little one by not giving her a heads up. And a pool isn't something they're going to be easily redirected from anyway. The kids is constantly going to be reminded that they can't do it by hearing everyone else, seeing people come in and out or just having to be in the vicinity because parents have to watch the older kid. Really not cool",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Most likely she wasn’t really thinking of it. This was not a get together to just swim in the pool. The pool was just one small part of the hang out and get together. It wasn’t even like this was a pool party. \n\nAva said the kids would be swimming and knew that OP had a 7 year old that could swim too. She probably wasn’t even thinking that OP would try to have the 3 year old swim also. There is nothing to suggest that Ava was sitting and watching OP get the 3 year old changed before springing on the rule. Ava most likely was handling all the other guests and other aspects of the get together and approached OP when she realized what was going on.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 347,
          "content": "It IS overly dramatic to say that it's going to affect her relationship with her nephew. He's 3. He won't remember and it will only be a thing between Aunt/Nephew  if the Mom continues to make drama about it.\n\nIt would have been nice to know in advance that he wasn't welcome, but that should be the extent of the beef.\n\nTake your kid to a public pool. Make sure he knows how to swim, reinforce that he needs to ask to get out to potty, big or little, then go back to your sister next season BEFORE A POOL PARTY and give her the update to be sure to clear the air.",
          "id": 100,
          "comments": [
            {
              "score": 16,
              "content": "This. If OP hadn’t mentioned they had a 7 year old, I would have assumed they were a first time parent.\n\nThe kid is going to remember what OP says happened, and OP will probably keep bringing it up.\n\nSometimes younger kids can’t do things the older kids are doing, it sucks but 3 isn’t too early to get children to acknowledge their emotions and then redirect to another activity. OP telling the sister that she “doesn’t have to deal with him being upset”? That’s a red flag parent, and I feel bad for any teacher or service worker who has to deal with her screaming child in the future.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "OP also IS being really dramatic about all of this. “Damaged relationship” with a 3-year-old over swimming? Trying to get all of her family to side with her over the homeowner? And sorry, OP, but setting a reasonable boundary about body waste isn’t treating you and your son poorly. Tbf, you probably should have asked if it was okay to put your un-toilet-trained toddler in her pool before getting him ready. YTA.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Also “damaging the relationship” with the nephew?? He’s 3 - I’m sure he was upset but…isn’t that what 3 year olds do? OP, maybe use this as extra potty-training motivation? Like let’s work really hard on this so you can go in the pool! \n\nAlso, YTA. You are blowing this out of proportion. It’s a small disappointment for your kid, he’ll live.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Sister can make the rules, but the rules need to be posted before you get to the party, hyping the kid up for a day of fun and swimming, and let them know that they will be sitting on the sidelines watching all of the other kids having fun. She was invited to a pool party, plain and simple.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Welcome to our ool. Notice there is no P in it. Please help us keep it that way.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12705,
      "content": "YTA. Not sure why peeing in the pool is considered OK by a lot of people but it’s fucking disgusting and your sister has a right to say no.",
      "id": 106,
      "comments": [
        {
          "score": 8796,
          "content": "Also, I don't know the details of swim diapers, but if pee from them isn't held in, I don't think they are really isolating poop from the pool either. Maybe you wouldn't see a full on turd floating in the water, but you'd basically have a shit teabag.",
          "id": 107,
          "comments": [
            {
              "score": 2930,
              "content": "[deleted]",
              "id": 108,
              "comments": [
                {
                  "score": 533,
                  "content": "Believing a diaper can manage to hold every little single shit particle contained within that tiny space, whilst being soaked under water with a baby splashing around and about. That is tickling me pink",
                  "id": 109,
                  "comments": [
                    {
                      "score": 59,
                      "content": "Swim diapers don’t absorb liquid. That’s why they can be in the water. So pee and loose stool is going right into the pool, 100%. It’ll contain solid feces long enough for parents to change the diaper.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 732,
              "content": "The thing about swim diapers is when they poop, the older kids are capable enough to loosen an edge and let the poop float out bc they don’t want it stuck to their butt.  My son swimming lessons have been stopped mid session multiple times for this reason.\nETA:  not from him (thank god).",
              "id": 111,
              "comments": [
                {
                  "score": 405,
                  "content": "Gross.  Gross.",
                  "id": 112,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 215,
                  "content": "Former swim instructor here :| this is very accurate and common -_-",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "Wait till they are potty trained but don't want to leave the pool. Turds in a bathing suit was no fun.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 50,
                      "content": "When I was a lifeguard someone pooped in the deep end. We couldn’t get the turd out with our skimmer and I was the youngest guard on duty. They handed me a pair of goggles and a pair of gloves….\n\nI went turd diving that day. Honestly, it wasn’t even the worst poop story from working there.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Thankfully my kid would never.. he is very particular about where he poops.. lol.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "This imagery is cracking me up. Like god get this shit out of here so I can focus on my lesson lol.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Reminds me of what the swim teacher said in primary school; “If anyone has to go to the toilet go now, we don’t want any chocolate logs floating by!”. I never forgot that sentence (clearly lol).",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 469,
              "content": "shit teabag 😆",
              "id": 119,
              "comments": [
                {
                  "score": 8,
                  "content": "It’s a disgustingly accurate description. Ugh",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 368,
              "content": "Depends on the type. We have great 2 part swim nappies that hold everything in just fine because our baby swim lessons require them, but many do leak and I suspect OP just had standard swim nappies that would leak anything out.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 260,
              "content": "I think that's more of the point here. Pee is one thing, but if nephew isn't fully potty trained and still wears diapers,  there's a chance he could defecate in the pool. That's quite a bit different from pee and requires more cleanup.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": "Disposal swim diapers aren’t great but they make reusable swim diapers that are designed to hold in poop and do a good job of it. Iplay is a really good brand and is available at Walmart and target",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "They’re designed to hold Poo but let pee pass through. Unless a child has diarrhoea (which could happen to anyone I suppose), they’re usually pretty good. However, most swim classes in my area ask for a disposable nappy & a reusable on top of that just for safety (there are brands like ‘Happy Nappy etc.)",
              "id": 124,
              "comments": [
                {
                  "score": 16,
                  "content": "Even if is solid poop eventually will become soft due to the water and it will leak",
                  "id": 125,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Yeah I’d recommend scarpering as soon as a poo is suspected lol.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Reusable swim diapers especially hold poop. That’s the whole point of them. Public pools have very clear guidelines that not potty trained kids need to be a swim diaper for this reason. It’s often kids that aren’t in a diaper anymore that are the ones who end getting a pool closed as a swimsuit alone isn’t going to contain a poop.\n\nI both have kids this age and was a daycare/preschool teachers for years and dealt with this.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I know I saw other comments saying \"it holds in the poop!\" NO IT DOESNT. the poop is literally steeping in the pool. So gross.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "From someone working in a gym/indoor waterpark/pool-combo. Water safe diapers do not(!) hold in poop, unless it is solid as a rock. \n\nYes, you Can get some that Can hold poop and mostly pee in - but they are of swimwear-fabric and has to be put outside a water-safe diaper, but you have to change them every, at least 1,5 hours 🤷🏼‍♀️ (called Happy Nappys at our place) \n\nBut generally, no, waterproof diapers works as Well as a pantyliner compared to a pad on a heavyflow. I dont want diaper babies in my inflateable pool either, Since.. I know 🫠\n\nOp, Yta",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 243,
          "content": "Right? This makes me think the OP pees in public pools all the time just because other people do it too.",
          "id": 130,
          "comments": [
            {
              "score": 30,
              "content": "Why is everyone in this thread peeing in pools, though? Guys, just walk to the bathroom.",
              "id": 131,
              "comments": [
                {
                  "score": 15,
                  "content": "I never liked going in pools and this thread is a perfect reminder of why. Seriously people, the bathroom is right there! Just use that!",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "it’s like the “mostly everyone has Herpes” argument. that may be true but that doesn’t mean I want Herpes too",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Right? OP outed themselves as pool peers. Originally the sister banned only the toddler but after OP said \"everyone pees in pools\" I would have banned all household members of OP cause they obviously don't teach manners in that family.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Its very obvious when people post that havent lived or grew up near a pool. \n\nI used to be a lifeguard and CPO and did tons of youth groups during the summer for many years. Complaining about people peeing in a pool is a very 'clutch the pearls' moment. \n\nAll of those kids are peeing in the pool. All of them. The difference here is they arent in swim diapers which actually do bind and hold urine, albeit, not 100% but better than nothing. \n\nThe kid in diapers did less to contaminate the pool than all the rest did. \n\nId love to hear her thoughts on the cleanliness of beaches and oceans... lol\n\nAbsolutely NTA. Honestly I give the sister like a year before she stops caring entirely and realizes how excluding the youngest from the fun activities of their cousins and siblings was a bad idea.",
          "id": 135,
          "comments": [
            {
              "score": 7,
              "content": "Yeah I'm a little baffled. I grew up going to a big private community pool and the only time a kid left the pool for the bathroom was to sit down in a stall.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Haha you think there’s a non-peed in pool or a pressing section of the pool? \n\nThe reality is food contains bug bits and pools contain pee.",
          "id": 137,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "I'm not going to say it's not disgusting. But anyone who thinks they are swimming in a pool with other people and thinks there is zero urine content is an idiot. People pee in the pool. Disgusting or not it does happen. That's what chlorine is for.",
          "id": 138,
          "comments": [
            {
              "score": 9,
              "content": "Even if they don't stuff still gets in the pool that's just how water works. The amount of water, plus the chemicals makes it perfectly safe especially for the tiny amount a three year old can pee that would escape the swim diaper. \n\nI can't imagine everyone on here remarking has never gone in a natural body of water. Hope y'all remember this next time you go to the beach because it's full of piss and shit not to mention the extra pollutants.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Right?! These N T A responses from pool pissers are fucking wild. This is exactly why I avoid public pools, people are nasty.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "She is right that reddit seems to hate little kids",
          "id": 141,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9624,
      "content": "YTA.\n\n>told Ava that lots of people, adults and kids, pee in the pool and it would be no different at a public pool so what's the problem?\n\nBut this isn't a *public* pool. It's her *private pool at her house*, and if she doesn't want to risk having someone piss in it, she should be able to make that call without being argued at. \n\nPeeing in public pools is gross and wrong too, FYI.\n\nEDIT: Just because other people do it doesn't make it fine, lmao. Instead of rushing to defend this behavior, have you considered just... Being better?",
      "id": 142,
      "comments": [
        {
          "score": 1168,
          "content": "Exactly, and it’s like OP is saying yes I absolutely know he’s going to go to the bathroom in your new pool at some point today so what’s the problem because it happens elsewhere in the world",
          "id": 143,
          "comments": [
            {
              "score": 259,
              "content": "And she just bought the house and opened the pool.  A kid shitting themselves in the pool and closing it for the rest of kids would be a bummer.",
              "id": 144,
              "comments": [
                {
                  "score": 104,
                  "content": "I wanted my own pee-free pool so bad, I paid hundreds of thousands of dollars for it. They threw in a house as part of the deal.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I got the same deal! I got the pool for all my nieces and nephews to come pee in tho I don’t use it myself. I’m OP’s sister btw.",
                      "id": 146,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 941,
          "content": "If I go to the trouble to purchase a home with a pool it’s because I don’t want to swim in piss like in public pools. All the grown ass adults in this thread basically admitting to pissing in pools is also fucking wild.",
          "id": 147,
          "comments": [
            {
              "score": 121,
              "content": "There is a reason I don't swim in public pools",
              "id": 148,
              "comments": [
                {
                  "score": 50,
                  "content": "I had a conversation with a buddy once who worked as a lifeguard and he confirmed that public pools when tested have a LOT of urine in them. I managed to make it to my 20s thinking only a little kid would pee in the pool and not people in their 20s, 30s, 40s, etc…. Needless to say I’m reluctant to ever get in a public pool again.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 45,
                      "content": "I think this is a cliché at this point, can't remember if I first heard it in a movie/tv show or if someone said it to me on a resort trip-\n\nYou know those swim up bars at every resort? You can watch people drink dozens of drinks over hours and not have to use the bathroom a single time!",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "My daughter is six and will not pee in any water unless it’s a toilet. My dad took her to the water park and any time she had to use the bathroom they had to take her or else she would get upset.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "Reddit has made me feel like a weirdo for never having peed in a swimming pool or under the shower.",
              "id": 152,
              "comments": [
                {
                  "score": 9,
                  "content": "People will insist everyone pees in the shower but I’ve never peed in the shower, two types of people I guess 🤷",
                  "id": 153,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I have never peed in the pool (maybe I did as a very young kid though) but I have in the shower",
                      "id": 154,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "I Don’t pee in pools but i love peeing in the shower lmao. That’s like how I start my day. As long as the water is running, of course. I don’t just like piss in my tub lmao",
                  "id": 155,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "Beyond nasty AF too. If you are nasty and you know it, you pee in pools and see nothing wrong with others doing it too, so you obviously are nasty in many other ways. The sort to go to the bathroom and not wash your hands while cooking, and the sort to use their unwashed fingers/hands to pick up the food at a buffet or picnic instead of using the tongs/forks/spoons.",
              "id": 156,
              "comments": [
                {
                  "score": 19,
                  "content": "I’ve noticed a considerable overlap in people who piss in pools, people who don’t wash their hands after going to the bathroom, and people who just generally don’t care about others in their radius.",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "I mean, the science is sound. As long as you smell chlorine there is no measurable risk to sanitation or infection from a pool. \n\nSwimming in the Ocean is wayyyyyyy grosser than swimming in a private pool that a toddler may have peed in.",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 261,
          "content": "Why not pee on her bathrooms floors if people do it in public anyway?",
          "id": 159,
          "comments": [
            {
              "score": 31,
              "content": "Is that not a standard host gift you give to people? Pissing on someone’s floor is like the first thing I do when I enter someone’s house.",
              "id": 160,
              "comments": [
                {
                  "score": 20,
                  "content": "Hell I walk in the front door already unzipped.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 13,
                      "content": "A gentleman, I see",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "\"I went into a public restroom and someone had smeared shit all over the walls. Later I smeared my shit all over my sister's bathroom wall. And she was upset about it!! AITA?\"",
              "id": 163,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 169,
          "content": "I wonder if OP pees in pools if she thinks this is so ubiquitous. I don’t know any adult that thinks peeing in the pool is okay.",
          "id": 164,
          "comments": [
            {
              "score": 10,
              "content": "I peed in a river once and that embarrassed me lol. \n\nI do pee in the shower sometimes",
              "id": 165,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "I do still agree that with it being her pool, she gets to choose who is and isn’t allowed, but the notion that she’s keeping the pee out is silly. The other kids are peeing in the pool lol. \n\nThe smell most people associate with chlorine is actually the smell of chlorine + urea. When I had a private pool as an adult is when I finally realized chlorine and chlorine + water don’t smell like pools always smelled growing up.",
          "id": 166,
          "comments": [
            {
              "score": 10,
              "content": "I spent a lot of time in pools as a kid and I always got out to pee because that's what I was taught. If the other kids pee in the pool, they shouldn't be allowed in, either.",
              "id": 167,
              "comments": [
                {
                  "score": 4,
                  "content": "There's no way to prove which one of them pees in the pool.",
                  "id": 168,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "I hate this argument. Yes, many people pee in pools. It's gross. But it doesn't mean you're allowed to do it and it doesn't mean you're absolved of the responsibility of maintaining basic fucking hygiene either. \n\n\"Many people drive drunk\" doesn't mean you should do it too.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": ">told Ava that lots of people, adults and kids, pee in the pool and it would be no different at a public pool so what's the problem?\n\nIf Ava is smart, this is the point where she informs OP that he’s not allowed in the pool either if he doesn’t see the problem here.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I have a pool, the chemical levels in public pools are much higher than private pools because there are more people, and people probably pee in it. And pools get off balance and cloudy so easily!",
          "id": 171,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7034,
      "content": "ESH\n\nShe really should have let you know beforehand that only potty trained kids were allowed in the pool.  Of course your kids were going to want to swim and of course you didn't think it would be an issue.  She should have given you a heads up so you could have prepared.\n\nEven not knowing this in advance, it's still her pool and you shouldn't have escalated it the way you did.",
      "id": 172,
      "comments": [
        {
          "score": 1396,
          "content": "Completely agree. \n\nSister was cruel to wait until the point that the poor child was already fitted out in his swim clothes to hear then that he then wasn’t allowed to swim.\n\nBut I presume it’s a small private pool and the pee concentrations in that will probably be a lot higher and nastier than a normal large pool. I get why she wouldn’t want to risk it.",
          "id": 173,
          "comments": [
            {
              "score": 927,
              "content": "Unless Ava wasn’t aware he was still in diapers until she saw them getting ready? It depends how close OP is to her sister and how much information they share about their kids. I don’t think Ava waited until the last second just to be cruel.",
              "id": 174,
              "comments": [
                {
                  "score": 721,
                  "content": "I think this is a good point - Ava might have been completely unaware the 3YO wasn’t potty trained yet. Lots of people in the comments are assuming a 3YO should be potty trained when that’s not necessarily true, lots of kids take longer. She probably realized when she saw the swim diaper being put on.",
                  "id": 175,
                  "comments": [
                    {
                      "score": 382,
                      "content": "I have a 4.5 year old. I would 100% expect a 3 year old to be potty trained sufficiently to not pee or poop in the pool. Even if they’re still working on timing/no accidents I would expect that if a 3 year old was taken to the bathroom right before getting in and every 45 minutes thereafter (which is also save swim practice to have kids rest after 45 minutes) there would be no concern for accidents.",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "I teach martial arts. Our youngest students are 2 years old. They are required to be potty trained and the parents must be present for the entire class in case there is an accident, the parent is responsible for the cleanup (we provide the necessary cleaning equipment). It’s something that is stated up front when parents want to sign up their child for classes.",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I find that hard to believe. I have friends with kids and could tell you whose kids are potty trained and whose aren’t. It’s a pretty common topic of conversation among parents of toddlers. I’d be shocked if these sisters hadn’t discussed the issue recently.",
                  "id": 178,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "I would’ve had a kiddie pool for any younger kids at the party. Mostly because I’d be more concerned about a drowning accident…but bodily fluids would’ve been a giant headache as well.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": ">But I presume it’s a small private pool and the pee concentrations in that will probably be a lot higher and nastier than a normal large pool. \n\nYou could dump a day's worth of toddler piss into it and it would be negligible. \n\nYou're talking on the order of .005 gallons of urine in a pool that is probably a good 10,000+ gallons.\n\nThere is substantially more chlorine in even a poorly-maintained pool than there is urine after a toddler pees in it. It is a non-issue and the sister is an asshole for making it one.\n\nOP is also an asshole for handling it the way she did.\n\nESH.",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 202,
          "content": "Totally agree. If Ava knew she didn’t want the non-potty trained kid in the pool, she should have let family know ahead of time instead if letting them know as the kid was getting ready to swim.",
          "id": 181,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "If I could award I defo would! This is the right take IMO. She defo should have been forewarned. Putting them in a position of dealing with the disappointed upset kiddo was unnecessary. I'd have been upset at that so maybe anger is misplaced here? The rules are not unreasonable. It's their private pool.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": ">This exactly -  \n>  \n>When the invitation was made - the host should have said at the time - \"non potty trained kids cannot go in the pool\". Then Mom would have known then what kind of event she was attending. But to invite people over for a pool party and then tell them that the young one cannot get in the pool - ***after they have arrived*** \\- woah - not a good host IMO. If it were my house I would have had some kind of kiddy pool for the diaper-aged.  \n>  \n>Would you use this logic for anything else?  Invite people over to your house for an ice cream party - and then ***after they have arrived*** tell the younger ones they cannot have ice cream because they make a mess on your carpet?  \n>  \n>Both women are wrong on this - they could have both done better.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I agree.  ESH. It was her pool. I would never tell a 3-yr old they couldn’t swim in my pool, I think it’s ridiculous. And she should have told you the rules before you came. But I think you were a bit unkind to her. And escalated a bit too much",
          "id": 184,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6127,
      "content": "YTA. Have you ever seen a kid have an accident in a swim diaper? I have. Nasty brown shit water is surrounding the child. The pool then needs to be drained and sanitized.  And then saying she's damaged her relationship w her nephew,  please he won't remember.  You need to get your entitlement in check.",
      "id": 185,
      "comments": [
        {
          "score": 2154,
          "content": "Yea that’s not true at all.  I’ve been a professional swim instructor for over 20 years and have taught kids as young as 6 months.  They were definitely not potty trained.  I’ve had countless “code browns”. The protocol is to move the class from the area, take the child out of the pool for the parent to clean, scoop out any solids you can, and let the chemicals do their work.  You do not need to drain the pool.  I’ve never had a child develop a poop related illness because of a code brown. Even public pools don’t drain.  At most the pool will close for an hour to be shocked with stronger chemicals.  Drain and sanitize is a very antiquated method",
          "id": 186,
          "comments": [
            {
              "score": 1299,
              "content": "to be fair though, there is a huge difference between a code brown in a much larger public pool and a small private one. Also, when you go to a public pool there is kind of a mental expectation of a bit of grossness- whether as part of the bonus of having a private pool is that you don't have to share grossness with strangers AND you get to stop people going in who you know will make it unsanitary- e.g. toddlers who aren't toilet t rained.",
              "id": 187,
              "comments": [
                {
                  "score": 91,
                  "content": "[deleted]",
                  "id": 188,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Yeah, I was gonna say when we went to a public pool with the splash pad and stuff when i was young a kid pooped and they had everyone leave for the rest of the day!",
                      "id": 189,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "True- but Ava should have stated pre party that 3yo would not be welcomed in the pool so op can decide before hand how to deal with it.\n\nWe are going to Aunt Avas house for a party! She has a pool so we need to bring your swim suits! (What probably happened)\n\nVs \n\nAunt Ava is having a party how fun! (Then prep older child separately for pool fun safety and younger child on the food aspect or something and prepare another activity. )\n\nMy verdict is ESH",
                  "id": 190,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 762,
              "content": "Public pools are generally held to higher standards for filtration and treatment. And this is why. \n\nA private pool maintained by a homeowner may not be as well managed. \n\nAnd if you’ve never heard of pool related illness outbreaks, you’re not paying attention. Infectious disease specialists could illustrate the need to control excretions fairly easily.",
              "id": 191,
              "comments": [
                {
                  "score": 31,
                  "content": "My pool is cleaner than any public pool I’ve ever seen.",
                  "id": 192,
                  "comments": [
                    {
                      "score": 47,
                      "content": "I said “may”.  My pool is pretty clean, also. Partly because we don’t pee in it. But also because we clean it and manage it daily.",
                      "id": 193,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 30,
                  "content": "Laughs in “do not enter pool if you’ve had diarrhea in the last 2 weeks”",
                  "id": 194,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "When I was a middle schooler, myself and several friends became SEVERELY ill from E Coli poisoning. We had all attended a pool party at a hotel a couple days prior.\n\nIt was determined that one of the guests at the hotel had a toddler that defecated in the hot tub prior to our party. They apparently \"fished it out\" but did not alert management.\n\nThe heat of the hot tub definitely incubated bacterial growth, but the issue remains that fecal bacteria in swimming pools can be a serious health hazard.",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "You still don't have to drain it. There are multiple options and \"shock\" treatments that will do the trick. It is an inconvenience for sure and everybody has to get out of the pool, but the person saying you have to drain it doesn't know what they are talking about.",
                  "id": 196,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": ">A private pool maintained by a homeowner may not be as well managed. \n\nYou would think, but I tend to notice the opposite. Public pools are often really poorly managed. Over chlorinated. Other chems out of range. Etc...",
                  "id": 197,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "After Covid when everything was shut down, you know what everyone did in the summer? They went swimming. In the OR we saw an exponential increase in Fungal infections in the sinus and brain as a result.",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 509,
              "content": "As a former lifeguard and certified Pool Operator (I'm in charge of the chemicals and keeping the water clean) (Canadian standards)\n\nThe pool doesn't need to be drained if it's a solid poop. If it's watery enough that you can see brown water flow into the pool from the diaper, the pool is supposed to be shut-down and \"super-chlorinated\" (regular chlorine levels can be 1-5 PPM. I would bring it to about 20 PPM)",
              "id": 199,
              "comments": [
                {
                  "score": 38,
                  "content": "Yup, when I used to lifeguard: If it was solid we would scoop it out with a net and shock the pool with chlorine for a few hours. If it was diarrhea we would usually need to shut down for the remainder of the day (assuming this happened during evening/night classes). You’d run the vacuum and get as much up of it as you can and again shock the pool with chlorine. Never had to drain a pool over shit.",
                  "id": 200,
                  "comments": [
                    {
                      "score": 29,
                      "content": "In our pool, super-chlorination takes an absolute minimum of 12 hours, and I distrust any place that claims less than 8 hours is acceptable. Depending on size, it can take less than 1 hour to get it to 20 PPM, but then you NEED to wait.",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "That's in the top 5 things I want to avoid to do in  a private pool party",
                  "id": 202,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "When I was a lifeguard we would just shut down the pool for a day if a kid shat in it.",
              "id": 203,
              "comments": [
                {
                  "score": 13,
                  "content": "I know this probably isn’t how you do it but I imagine you just coming back the next day with the visible shit log still in the pool like “okay everybody, it’s been a day, looks good!”",
                  "id": 204,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Oh man takes me back. I was a swim instructor for many years and yeah… code browns… there was a time where my swim school would close for an hour and some kid figured this out and didn’t like doing swimming lessons so started pooping in the pool before their class. They never figured out who the mystery pooper was…",
              "id": 205,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 421,
          "content": ">Nasty brown shit water is surrounding the child. The pool then needs to be drained and sanitized.\n\nWhen this inevitably happened I highly doubt OP would have offered to pay for the associated costs for the water replacement or the sanitization required.",
          "id": 206,
          "comments": [
            {
              "score": 141,
              "content": "The proper protocol to properly shock/sanitize a pool doesn’t involve draining. It involves getting people out for at most an hour and physically removing large contaminants, letting the filters do their jobs, and using roughly $3.50 worth of chemicals.\n\nIf you want to drain the pool that’s on you, but that’s like committing arson to remove mold in the dishwasher.",
              "id": 207,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 247,
          "content": "You don’t drain a pool when some shit gets in it what are you talking about",
          "id": 208,
          "comments": [
            {
              "score": 93,
              "content": "Agreed...and if the pool had a liner (not fiberglass, tile or concrete) then draining the pool is a HUGE no-no. Sanitizers are used for a reason, either chlorine or salt.  Everyone clears the pool, you shock it, then wait the recommended time and resume swimming.",
              "id": 209,
              "comments": [
                {
                  "score": 12,
                  "content": "FYI, Salt isn't a sanitizer, salt water pools have a chlorine generator that converts the salt water into chlorine.",
                  "id": 210,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 149,
          "content": "Uhhh nooooo. That's not how pools work. You remove any floating poo, then the pools have a pump, filters and chemicals and a shock treatment will clean up the rest.",
          "id": 211,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "my husband owns a pool company if someone pooped in the pool, you never drain and sanitize it you scoop up the poop and treat with chemicals. If not drained by professional, you will ruin your pool. I have seen it time and time again.",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "This isn’t caddyshack. Pools don’t get drained for poop",
          "id": 213,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "Definitely not true. I have my own kids and have taken care of children this age with swim diapers. All have pooped at some point and the whole point of the diaper is to contain poop. That’s why public pools have guidelines around this. The few times I was in a pool that was shut down it was due to a kid that was clearly school aged who had nothing on and their poop was floating around the pool water.",
          "id": 214,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "He could've just stuck his feet in the water if it was such an issue. He didn't have to even get in. OP needs to learn compromise.",
          "id": 215,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2516,
      "content": "YTA-I get your point about the pool and about kids peeing in the pool without a diaper.\n\nHowever, your sister has every right to draw that line. And even if the swim diaper holds the poop, the kid still might poop in the pool.\n\nUltimately, you’re continuing to escalate this situation. You can explain to your son that the pool is for potty trained kids. You need to accept that your sister doesn’t want kids who aren’t potty trained in her pool, which is absolutely okay. And YOU need to get over it instead of holding onto it.",
      "id": 216,
      "comments": [
        {
          "score": 480,
          "content": "I do think the sister was a bit of an AH for not making that clear ahead of time so the kid wouldn’t have thought he was going to get to go swimming just to have the rug pulled out from under him last minute.",
          "id": 217,
          "comments": [
            {
              "score": 427,
              "content": "Why is OP not the AH for checking ahead of time if her non-potty trained child would be allowed in the pool in a diaper that leaks pee and poo germs? Why isn't sister the AH for assuming and getting her child's hopes up?",
              "id": 218,
              "comments": [
                {
                  "score": 338,
                  "content": "Because it’s typical for pools to allow young kids in if they’re wearing a swim diaper. To put the burden on OP to ask this question would be like saying OP needs to ask whether her kids will be fed. Ava should have told OP beforehand.",
                  "id": 219,
                  "comments": [
                    {
                      "score": 164,
                      "content": "Maybe for public pools, but this isn’t a public pool and as many have said swim diapers don’t actually keep anything in it will still get in the pool",
                      "id": 220,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 131,
                  "content": "Ava is hosting, why did she even suggest the pool knowing one kid would be left out. ESH",
                  "id": 221,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Yeah, I second this because I'm a little lost. If I had kids and my sibling invited me over for a pool party, since the kids are MY kids it's MY responsibility to ask questions and be prepared, also my responsibility for a kid melt-down if I didn't ask ahead of time. Just a simple, \"I'm sorry, buddy. I didn't ask Aunty before we got here, but we can play in some water when we get home.\" Or something like that. As a parent it's important for kids to see you take responsibility for mess-ups like that, helps them learn to be a human. OP should keep in mind that they are setting an example for their kids every step of the way.",
                  "id": 222,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 89,
              "content": "Came here to say this.  If Ava mentioned before OP arrived that she doesn't feel comfortable with the youngest going in the pool, then OP would have been able to assuage the kid ahead of time.  \n\nAva's timing sucked bad.",
              "id": 223,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Did the sister know he's not potty trained though? Sounds like she doesn't have kids of her own so she might not have even thought about that until she saw the swim diaper.",
              "id": 224,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "This exactly - \n\nWhen the invitation was made - the host should have said at the time - \"non potty trained kids cannot go in the pool\". Then Mom would have known then what kind of event she was attending. But to invite people over for a pool party and then tell them that the young one cannot get in the pool - ***after they have arrived*** \\- woah - not a good host IMO. If it were my house I would have had some kind of kiddy pool for the diaper-aged.\n\nWould you use this logic for anything else?  Invite people over to your house for an ice cream party - and then ***after they have arrived*** tell the younger ones they cannot have ice cream because they make a mess on your carpet?  \n\nBoth women are wrong on this - they could have both done better.",
              "id": 225,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "\n>Ultimately, you’re continuing to escalate this situation. You can explain to your son that the pool is for potty trained kids. \n\nAlso, what a great incentive to a child to learn how to potty. This is almost how my friend got her kid to go. She threw fits before but having a big reward that other kids are enjoying can be such good motivation.",
          "id": 226,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1850,
      "content": "YTA You act like it’s normal to pee in pools. Your sister put a very very sensible boundary. You’re acting entitled.",
      "id": 227,
      "comments": [
        {
          "score": 660,
          "content": "This! Am I that naive? *Adults* pee in pools? Regularly? Wtf?? \n\nIf I were Ava I'd be rethinking letting OP in the pool after they attempted that reasoning, never mind the kids. OP, YTA, along with any adult who chooses to piss in a pool. That's beyond lazy and disgusting.",
          "id": 228,
          "comments": [
            {
              "score": 160,
              "content": "Exactly. Just because it's common doesn't mean it's acceptable.",
              "id": 229,
              "comments": [
                {
                  "score": 55,
                  "content": ">Exactly. Just because it's common doesn't mean it's acceptable.\n\nSomeone made a good analogy a while back. If you piss while swimming nobody knows. If you pull up to the pool then pee from the deck into it, you would get that disgusting look and people yelling at you.  \n\nOne is common, the other is not, both are disgusting.",
                  "id": 230,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": ">Adults pee in pools? Regularly?\n\nYes.  All the time.",
              "id": 231,
              "comments": [
                {
                  "score": 9,
                  "content": "Studies have show up to 40% of adults *admit* to peeing in pools.  I really hope Ava made sure that *everyone* was told not to pee in the pool.\n\nThat being said it’s her pool, and swim diapers run the risk of letting poop in. ESH since Ava spoke about the kids swimming and knew damn well the baby wasn’t potty trained. She could’ve made it known.  OP is just upset because she feels responsible for letting her son down.",
                  "id": 232,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "In high school one of my groups of friends was composed almost entirely of about 12 lifeguards (I might have been the only non swimmer). Adults regularly have sex in and masturbate in public pool (my friends reported at least once per shift, more often for the evening 16+ swims). I guarantee you that for every person willing to seek gratification in a public pool there are at least five who don’t feel like removing and putting back on their wet bathing suit. Not to mention the ones who sneeze and let it out by accident. \n\nIf i don’t get to be naive then you don’t either 🤪",
              "id": 233,
              "comments": [
                {
                  "score": 5,
                  "content": "Lol noooooo WHY!? 💀",
                  "id": 234,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Go to a hotel with a swim-up bar.  Those people are there way longer than they'd reasonably be if they were getting up to go to the restroom every time they need to pee.",
              "id": 235,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "If it smells like chlorine in public baths that's the urine reacting with the chlorine.",
              "id": 236,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "It’s one of those mixed things. I’ve never peed in the pool since I was old enough to have memories (unless you count the ocean or a river?) but yeah if you’re in a public pool have to be comfortable with the reality people absolutely pee in them.",
              "id": 237,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Just the adult pigs.\nIt is not normal behavior.",
              "id": 238,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah I would’nt let OP in the pool either, clearly she’s nasty",
              "id": 239,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "You’ve clearly never been to an all inclusive resort where people spend the whole day in the pool by the swim up bar, drinking non stop and never getting out. Super gross but extremely common.",
          "id": 240,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "I wouldn’t say it’s normal, but SO many people do it. You are kidding yourself if you think you haven’t been in a pee-pee pool the majority of times you’ve ever been in one.",
          "id": 241,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1574,
      "content": "YTA\n\nPissing in a pool is gross. It's gross when it's in a public pool, it's gross when it's in a private pool. All the people that say \"but there are chemicals to clean it,\" piss in a cup, then ask how much chemicals need to be added to the cup before they would dump that glass of piss on their head. It's just fucking gross.\n\nShe wanted to keep her pool clean of your little piss machine. Frankly, after you made your thoughts on it known, I wouldn't have let your other kid in the pool either. My pool isn't for pissers.",
      "id": 242,
      "comments": [
        {
          "score": 337,
          "content": "Frankly, after his 'everyone pisses in the pool', I wouldn't let him in either. Gross",
          "id": 243,
          "comments": [
            {
              "score": 42,
              "content": "after reading this thread i frankly don't want to go swimming again ever",
              "id": 244,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Her* but yeah I agree",
              "id": 245,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Honestly after this thread someone could dump a fresh cup of piss on my head and I’d probably still feel cleaner than after being in a pool.",
          "id": 246,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Little piss machine LMAOOO, new fav phrase of the day",
          "id": 247,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Chlorine is added to pools to kill bacteria and viruses, but it also combines with urea to create chloramines. Chloramines are skin, eye, and lung irritants that corrode metal.\n\nDon't piss in the pool.\n\nhttps://www.cdc.gov/healthywater/swimming/aquatics-professionals/chloramines.html",
          "id": 248,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1268,
      "content": "I’m going to get downvoted but YTA. It doesn’t matter what disgusting things people may do in a public pool. She has every right to not want urine in her pool. You should have dropped it once you knew her response was no. You shouldn’t have gone tattling to family. You don’t ever have to accept an apology but you were being dramatic in this situation and she wasn’t the one choosing to act like a teenager.",
      "id": 249,
      "comments": [
        {
          "score": 140,
          "content": "Why do you think you’re going to get downvoted? You’ve gone with the majority view.",
          "id": 250,
          "comments": [
            {
              "score": 83,
              "content": "Typical redditor bullshit lol",
              "id": 251,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Look at all those downvotes.",
          "id": 252,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Why would you get downvoted? This is Reddit and it’s about a child.",
          "id": 253,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1196,
      "content": "I am flabbergasted by these comments. Imagine inviting a 3 year old to a pool party and telling him he can’t swim, he can watch the other kids. Wtf? If I knew one of my children wouldn’t be allowed to swim, I never would have brought them to a pool party. She should have told you that in advance and let you choose to go or not, not bring it up after the kid has his swimsuit on and is ready to swim. Very much NTA and anyone who votes different clearly does not have children.",
      "id": 254,
      "comments": [
        {
          "score": 342,
          "content": "Finally! I actually own a pool and I think it’s nuts not to let a toddler in the pool because they may pee in it. All these people commenting about private pools and chemicals and have no idea what they’re talking about. Unless your pool is regularly a swampy mess that no one should be swimming in anyway, then balanced and chlorinated water will take care of a small child’s ounce or two of pee IF the child pees in the pool. The idea that it wouldn’t is ridiculous. And I would never single out a child from all the other kids because I was worried about an ounce of child pee that will get immediately attacked by the chlorinated pool anyway. \n\nOP is NTA, but her sister certainly is. I probably wouldn’t have my kids visit to swim again until the youngest is fully potty trained since her sister is so unreasonable.  Of course, it may be best to just not swim at all in her sister’s pool since she’s so precious about it.",
          "id": 255,
          "comments": [
            {
              "score": 45,
              "content": "[deleted]",
              "id": 256,
              "comments": [
                {
                  "score": 27,
                  "content": "I used to be a pool tech about 10 years ago, and I said pretty much the same thing. There's a lot of ignorant people crucifying this lady for standing up for her child when the whole point of the argument is in the sister's head.",
                  "id": 257,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I'm also in the pool industry. The fact that thousands of users are in here repeating the exact same incorrect information is driving me insane.",
                  "id": 258,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 35,
              "content": "Thank you! This is crazy! \n\nI've never seen a pool owner ban a toddler. My aunt used to let her boys swim naked as toddlers. All my siblings and I learned to swim as we were learning to walk. Kids like to swim and it's something that op probably hyped up to both her children. I bet the 3 year old was super excited. \n\nMy daughter is very sensitive and in this situation, being excluded at the very last minute, she would have been upset for *days*. And I would have been furious. If my child is going to be excluded, tell me before hand so I can skip the event and save her the disappointment.",
              "id": 259,
              "comments": [
                {
                  "score": 14,
                  "content": "I totally agree. OP seemed semi accepting of her sisters AH rule. I’m sure given the warning ahead of time, she would have just skipped the event",
                  "id": 260,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Yes but this is Reddit, your industry expertise is no match for a crowd of 20-somethings who hate children. This is ridiculous. Some people have no freaking compassion.",
              "id": 261,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Finally someone that make sense! My Newborn and toddler had the best summer times at my sister’s pool! Do people think a 3yo really piss every 5 min? Lol these host must be fun at parties - wait no they’re not.",
              "id": 262,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 330,
          "content": "It’s cruel. It’s quite fucked up actually, to invite children to swim and then completely single one out… makes me sad for the little one.",
          "id": 263,
          "comments": [
            {
              "score": 34,
              "content": "I bet the people mocking OP for being \"dramatic\" either have perfect families or none at all. It sucks to feel left out as a child, it's not something you forget if it keeps happening. And by OP's family's reaction I have a feeling this is not the first time something like this happened.",
              "id": 264,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 284,
          "content": "I cannot believe I had to scroll all the way down here to find a NTA response.",
          "id": 265,
          "comments": [
            {
              "score": 14,
              "content": "Seriously. There's a lot of sociopaths here that can't put themselves in the place of a child being singled out, but can imagine being a selfish pool owner who doesn't know how chlorine works.",
              "id": 266,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Especially when the top comment specifically mentions so many people saying NTA. In this particular situation op is NTA, maybe he didn’t give the best reasoning for why their kid should be allowed in. But at the end of the day she waited for his kid to be put in a damn swim diaper and get ready to go in the pool to mention he couldn’t swim. That’s fucking cruel, wait until he’s ready to get in then say you’re not allowed to swim. But hey you can sit in a chair and watch every other kid enjoy themselves.\n\nThis should’ve been brought up beforehand, especially since their sister specifically said kids could swim in the pool.",
              "id": 267,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Neither! The sister totally sucks! Who invites a child to a pool party then doesn't let them in?! She could have made an exception this one time and let the kid in, then tell OP that the kid will have to wait until he is potty trained, which doesn't sound like it would even take that long. \n\nThe OP has every right to be upset!",
              "id": 268,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "the chances of a kid shitting while swimming are minimal and even if it happens the kid is wearing a swim diaper. \n\nmy guess is the responses here are from teenagers who don’t have kids and have never seen a kid with a swim diaper",
              "id": 269,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Reddit is full of Incels, isolated freaks, and germ phobes.  So of course they’re grossed out about a toddler swimming in a pool.  All pools would be disgusting without the chemicals, and adults are way grosser, in certain ways, than babies.",
              "id": 270,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 233,
          "content": "Reddit is full of teenagers, childfree-ers and absolutists with no ability to see nuance.\n\nBy their logic if they owned a pool they shouldn't let anyone swim in it because from a quick cursory google something as high as 30% of adults admit to peeing in a pool. It's just a risk you run and if you don't think you've swam in chlorinated piss everytime you used a public (and probably private) pool you're naive. To exclude a kid from swimming for something uncle Tony is gonna turn around and do is dumb.",
          "id": 271,
          "comments": [
            {
              "score": 42,
              "content": "[deleted]",
              "id": 272,
              "comments": [
                {
                  "score": 36,
                  "content": "I will never forget seeing this very opinionated comment on this sub, the guy was on a high horse as he blasted OP over his question. Out of curiosity I checked his profile and he made similar charged comments on every single AITA post... alternated between photos of himself wearing diapers in a diaper fetish subreddit. \n\nIf I ever find myself dealing with a family dilemma this is the last place I'd come looking for guidance.",
                  "id": 273,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I'm having war flashbacks from a few years ago when I clicked on someone's reddit profile from this sub and they had a bunch of pictures of them stuffing various objects inside their umm sensitive male area.\n\nWish I could erase that from my brain.",
                      "id": 274,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Bro, I'm child free, and this comment section is blowing my mind. How heartless you do have to be to tell a 3 year old they can't swim with their family because they may have an accident and the protection they have for that isn't considered good enough?",
              "id": 275,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "100%! Pools are pretty gross no matter who is in them, which is why regular cleanings is part of pool ownership.",
              "id": 276,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I am child free and don't even like kids, but this is fucking cruel. That poor kid :( I cannot imagine that OPs family was totally cool with excluding him and watching him cry while the rest of the kids got to play. Assholes",
              "id": 277,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 183,
          "content": "Also, everyone is like \"the baby will shit in the pool.\" He's 3 years old. That's a child you can hold a conversation with, not a baby that dumps his pants at the drop of a hat. I swear, any time a child is involved the absolutely dumbest fucking redditors all come out of the woodwork.",
          "id": 278,
          "comments": [
            {
              "score": 45,
              "content": "I can't believe this is the first comment I see saying this. At 3 they probably still have minor pee accidents but they can absolutely communicate if they need to actually poop.",
              "id": 279,
              "comments": [
                {
                  "score": 25,
                  "content": "And even 3 year olds who aren’t totally toilet-trained (which is a LOT of them) are usually pooping on a pretty normal schedule. Like, neither of my kids were just randomly having emergency poops in the middle of the afternoon. I’m sure it happened, but not normally. But that’s why you might use a swim diaper—you’re not expecting your 3 year old to have a random afternoon urge to poop AND also fail to communicate it, but you want to try and contain it if something weird happens. Because you’re NOT a total asshole. \n\nAnd LOL at these people who think the other kids DIDN’T pee in that pool. I’m an adult who, to clarify, does NOT pee in pools, but as a young but toilet-trained kid, I absolutely could not be bothered to dry off and go all the way to the bathroom—regardless of knowing it was gross.",
                  "id": 280,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Exactly. Clearly many of these commenters have never interacted with children.",
                      "id": 281,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Honestly I've come to realize they're all just children themselves. You can tell by the total black and white thinking that's so common in this sub. \"Oh it's her rules so OP is the AH.\" They don't for one second even think of the child's feelings and it's probably not even their fault, their brains just aren't fully developed yet.",
              "id": 282,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I have had 3 kids that have used swim diapers. They live in the water in the summer, not once has any of them shit in the pool. I couldn't tell you if they've peed but there's definitely more disgusting shit particles floating off every unclean ass in that pool, at least the kids ass is wrapped up.",
              "id": 283,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "[deleted]",
          "id": 284,
          "comments": [
            {
              "score": 11,
              "content": "I take a slightly different view. In my opinion, the breakdown of Redditors, vis-a-vis attitudes about children, more or less mirrors that of any average population. But... normal, well-adjusted people with a good amount of life experience, knowledge and maturity are put off by threads like this because of the overwhelming loudness and aggression of the gnashing and wailing childfree contingent, so they don't even bother commenting. Which falsely makes it seem like the childfree perspective is the prevailing one.\n\nIn short, normal people don't want to drive themselves crazy by trying in vain to push back against the wall of regressive bullshit that is let loose on the internet.",
              "id": 285,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 27,
          "content": "LOL a top comment says to EXPLAIN IT TO HIM. WTF, the kid is 3 years old. They aren't exactly into listening to reason about why they can't swim in a pool with other kids. Sounds like advice from someone who never had a three year old.",
          "id": 286,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "> Very much NTA and anyone who votes different clearly does not have children.\n\nMost of Reddit in a nutshell.\n\nThese Y T As are insanely oblivious; comments like \"ThE WhOLe PoOl WoUlD NeEd tO Be dRaInEd\" are hysterical nonsense.\n\nOP is NTA; her sister was for inviting her to her pool party and then--the moment before the kid was gonna get in--telling her no. Who TF does that but an oblivious AH?",
          "id": 287,
          "comments": [
            {
              "score": 14,
              "content": "There are comments like \"well, were you ready to pay for her to get a new pool?\"  Such an insane comment section.  I'm a dumber person for having entered this thread.",
              "id": 288,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Crazy I had to scroll down this far to find a NTA...I have a young child, I also own a pool so this hits close to home. \n\nIs sister within her rights to say no to a not-potty trained kid?...yes...it's eye roll worthy, a tiny bit of pee from a baby/toddler is the least contaminant you get in a pool...sweaty teens covered in sunscreen is way worse (and they'll probably pee in it as well)...but that's literally why you have a good healthy pool and chemical balance to kill all the gross stuff....\n\nBut that aside, the sister invited OP and her child to swim in the pool with no caveats up front. Then reneged on the invitation, after the kid is ready to get in, and didn't provide an alternative. Disgusting behavior. \n\nSister major AH here. \n\nChances are everyone saying otherwise hasn't had kids and has never owned a pool.",
          "id": 289,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "They do not have kids. Simple as that. Comments are saying to explain that to a three year old. Good luck with that! It's insanely cruel to exclude a kid like that, and for the aunt to not mention that and expect everyone to understand is insane.",
          "id": 290,
          "comments": [
            {
              "score": 6,
              "content": "They do not have basic empathy. You don't need to have your own kids to know that it is wrong to invite a kid to an activity and then single them out so they have to watch the other kids have fun but can't join.",
              "id": 291,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}