{
  "post content": "I love my roomate, I really do but some of her friends suck.\n\n\nI’m a white bisexual and my whole life dealt with internalised homophobia and have seen my black friends deal with racism. My friend often has people over that use the word gay as an insult, they use the R word, and use all kinds of other slurs. She also has people over who are white and use the n word.\n\nIn the past one of her friends used gay in a negative way and I poured water on her, it was harmless \n\nYesterday one of her friends who was white said the N word, I asked him not to say it and he said he had a black friend he could call who gave him the pass. I asked him not to do it again, and said if he did I would pour water on him. \n\nMy roommate talked to me today and told me I wasn’t allowed to pour water on her friends because it makes them uncomfortable, the thing is when they use those words it makes me uncomfortable and sometimes even hurts. I’m afraid to have some of my friends who are black over because I don’t want them to overhear people using those words and think badly of me. They have told me in the past they dislike hearing white people say the N word. \n\nMy roomate says since she plays rent she should be allowed to have people over and they can say what they want, but I told her I pay rent too and want to have a comfortable place I feel safe.\n\nI told her I am still going to pour water on people if they continue to use the words after I ask them not to. \n\nMy roomate says it is unrealistic and that they might let it slip, but I guess I don’t understand, just don’t say the words.\n\nAm I the Asshole\n\nEDIT: You guys are right, I need to grow up. I’m going to look more into the history of some of these slurs so next time someone uses one I can explain to them why I think it is wrong with facts. I truly thank you for helping me see this.",
  "id": 1,
  "comments": [
    {
      "score": 12,
      "content": "ESH except your roommate, though it’s hilarious to imagine you lurking behind the sofa with a spray bottle, waiting for someone to slip up.\n\nWould it be nice if people didn’t use hurtful language? Absolutely, but part of being an adult is putting up with other assholes. The living room is a shared space and your roommate has the right to have friends over without fearing that you will harass them.\n\nLeave them alone and go somewhere else where you won’t have to hear them.",
      "id": 2,
      "comments": [
        {
          "score": 6,
          "content": "It’s not just “hurtful language.” It’s slurs. \n\nHurtful language is calling someone a dumbass — not using the n-word because “your friend gives you a pass.” That is racist behavior, whether they are aware of it or not.",
          "id": 3,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Shouldn’t I have the right to be in my home and not hear offensive words, and have the right to have my friends over without fearing they will hear something that will offend them?",
          "id": 4,
          "comments": [
            {
              "score": 13,
              "content": "Sure, but it’s not just *your* home. Your roommate also has the right to be in her home, and have her friends over without fearing that they will have water thrown on them by you.\n\nPart of living with someone is compromise, and if you can’t be around these people without becoming offended and soaking them, then you need to put space between you and them.",
              "id": 5,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Yes, but pouring water on people you disagree with/don't like isn't ok. You wouldn't be ok if your friend started spraying your guests with liquids because \"I don't like what they said\" would you?",
              "id": 6,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Your rights end where someone else's begin, though. You don't have the right to \"punish\" people for doing things you don't like short of telling them to leave your property, assuming it's your property and not shared. \n\nBut, broadly, no, anyways. There is no right to not be offended. As long as it's your property, that doesn't matter - you can tell them to leave if they offend you through racist language, or because they like the wrong sports team, or whatever other reason you can imagine. But you can't attack them for any of it, you can just tell them to leave.",
              "id": 7,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Then live alone because it's not just *your* home.",
              "id": 8,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11,
      "content": "ESH. How old are you? Surely there is a better resolution here.",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "ESH. The friends for being jerks, the roommate for defending them, and OP for thinking that pouring water on someone for saying something you don't like is in any way OK.",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "ESH. The friends should not being saying bigoted things and you should not be assaulting your roommate’s guests.  Use your words.",
      "id": 11,
      "comments": [
        {
          "score": -11,
          "content": "The thing is I do. I asked her one friend multiple times to not call things gay because she doesn’t like them and I told her next time she did it I would pour water on her and she said I was bluffing. Next time she did it I poured water. They don’t listen to me and it makes me so uncomfortable.",
          "id": 12,
          "comments": [
            {
              "score": 17,
              "content": "They go to your room, wear headphones,  but seriously, stop pouring water on people.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "ESH.  Just be aware, and I could be wrong, you should look into it, someone who got really offended could try to pursue assault charges. Also..wtf is the r word?",
      "id": 14,
      "comments": [
        {
          "score": 5,
          "content": "Retard I think",
          "id": 15,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Retard",
          "id": 16,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "R*tard, I assume.",
          "id": 17,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "[removed]",
          "id": 18,
          "comments": [
            {
              "score": 0,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 19,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "R*tard - not a word anyone should be using. Not a word I say.",
          "id": 20,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "YTA. \n\nI'm gay, and I'd rather share my space with a homophobe than a person who acts like you, sorry. \n\nI'm not even going to elevate this to E-S-H, although they do. But seriously, grow the heck up. Behave.",
      "id": 21,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "ESH. You need to grow up and find better ways of dealing with people who say offensive things or you’re gonna have a hard time in life.",
      "id": 22,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "ESH.\n\nThey suck for saying those things, but you suck big time for acting like you have some sort of authority over what they can say. You seem to not respond to people who flat out tell you to STOP POURINF WATER ON PEOPLE, but you do respond to those who suggest spraying lmao. Childhish, irresponsible, and I suggest you buckle up because one of these days you just might bump into someone who won't hesitate to retaliate.",
      "id": 23,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "ESH. Pouring water on people is insanely inappropriate. Find a different way to communicate or get over it.",
      "id": 24,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "ESH\n\nHer friends shouldn’t be using those words, but that’s her prerogative to take care of. Your issue is with her, not her friends, who are acting the way they always act. If you can’t reconcile your differences, one of you should leave.\n\nYou shouldn’t be pouring water on people. I get it - you feel hurt and you want to punish them but it’s incredibly juvenile and demeaning, and probably doesn’t help their perception of the very people you’re trying to defend. It’s the living room, so the rules need to be agreed on by roommates, which again means sorting out whether you’re compatible living partners and reevaluating. You can’t be the thought police towards people you don’t know, solely by virtue of them being in a space that you happen to share with others. \n\nIn a perfect world, you wouldn’t go out and pour water on them. You’d go try to talk it out, they’d understand and adjust accordingly...but it’s not a perfect world so if talking doesn’t work and your roommate won’t fix it, one of you should leave, because you’re not going to put up with the words forever, and she’s not gonna put up with you watering her friends forever",
      "id": 25,
      "comments": [
        {
          "score": 1,
          "content": "Not all the words she mentioned, just the n-word. Lets get over this “dont say retard” bullshit.",
          "id": 26,
          "comments": [
            {
              "score": 2,
              "content": "Nahh can’t nitpick like that. I mean I’m actually really bad about this and say all the words she mentioned all the time, but if someone told me not to swear in their house, I’d include “retard” because it is offensive. I don’t expect OP to go in and tell them which words they can say. Just not practical",
              "id": 27,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}