{
  "post content": "My son is a freshman and his dad is telling me he wants to go to homecoming but it is 6-10 pm on my saturday (I get him fri night to sunday night).  I only see him 4 days a month right now and he only sees his brother on the weekends because my ex took my older son away from me to go live with him when he wasn’t doing good in school with me…\n\nSo I told his dad no and said it isn’t fair to me or his brother to allow him to go and I can’t drive him there because it’s an hour each way so would be 4 hours of driving for me.  His dad said he would give up the monday but I’d still only get him from sunday morning to monday evening which is less than my usual\ntime.  Well my son is throwing a fit now and his dad is telling me I don’t put my kids first, but it’s literally just a dance?\n\nI barely see my son and I already up a lot of time for his football practice.",
  "id": 1,
  "comments": [
    {
      "score": 22827,
      "content": "YTA\nIts a school dance.\nHe needs to be social. He needs to participate in things with people his own age. He needs to do things he wants to do.",
      "id": 2,
      "comments": [
        {
          "score": 11293,
          "content": "Not to mention he's a FOOTBALL player and it's HOMECOMING. Also, as a freshman, it's probably the only school dance he will be able to go to that year. Op would be very selfish to rob him of that experience.",
          "id": 3,
          "comments": [
            {
              "score": 2577,
              "content": "I know right. Was trying to think of there was a way to emphasize. Like YAVMTA (you are very much the asshole)",
              "id": 4,
              "comments": [
                {
                  "score": 1735,
                  "content": "and a shit parent obviouslt",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2391,
                      "content": "Yea it pretty clear why she only gets 4 days a month and why the older son had to leave her place.\n\n\nShe better enjoy those 4 days because if this is how she treats her kids, not understanding their lives/activities, not bothering to listen and putting her own wants above theirs, the minute this kid is at an age he can he's going no contact with her. YTA\n\nEdited to add: Woooowww, read her previous posts and comments and this woman is the worst. She is a bare minimum parent who doesn't want to pay or do anything extra for her kids. Contacts nope, extracurricular activities, absolutely not. She thought her son should play football... while wearing glasses wtf????\n\nShe has custody of the younger son now but he's 7... it ain't going to last because eventually he's going going to want to join clubs and have a social life and mom is going to shut that down bc he should spend time with her and it's not a big deal to miss childhood milestone moments/events you can't ever redo because she's too busy with her boyfriend and their kid to drive a whole hour to practices or games, and this kid is going to be begging to also live with dad.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 59,
                      "content": "Explains the divorce",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I very very rarely call people a shit parent but in special circumstances it is necessary, and OP you are a shit parent. \n\nRule number 1, you put your kids first. That doesn't mean forcing them to see you at the cost of missing out, it means listening to what they want and letting them be their own person. Grow up and stop being so selfish",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Yea I highly highly doubt the courts took away her other son just because \" he wasn't doing well in school\" courts don't just take the kid away from the mother in this country....not for bad grades.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 60,
                  "content": "You could go to some of his games and then take him out dinner! Then you would see him more!!!",
                  "id": 10,
                  "comments": [
                    {
                      "score": 72,
                      "content": "Judging by this post, spending time with the kid is a massive inconvenience for her unless it’s on her terms.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "My daughter was in marching band in high school and we would try to attend the games. I also went to many of the field tournaments she performed at, even when they were a distance away (I did miss a few). But even for those, would be at the high school early waiting for the band bus to return (except for the time I was prepping for a colonoscopy, and another band mom dropped her off at home for me). I also attending her various plays when she was in drama, and would help out at weekend rehearsals and the bake sales.  \nThat's what you do as a parent. (My mother would attend our concerts when we were kids)  \n\n\nI knew plenty of parents who were just as involved as me, but I also could tell there were a lot of parents who couldn't be bothered. Guess which parents the kids preferred?  \n\n\nBeing in athletics, plays, music groups, any school activities are beneficial to children and teens. They tend to get into less trouble, they learn responsibility, and it helps when applying to college.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": ">Was trying to think of there was a way to emphasize. Like YAVMTA (you are very much the asshole)\n\ncrosspost to /r/amithedevil",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "YATBAHE (you are the biggest asshole ever).  Seeing kids that don't get to be kids because they have crappy \"it's my weekend and you have to spend it with me\" parents is so sad.  The kids are traumatized enough by the separation/divorce.  Seeing parents (or a parent) put their needs above what is best for the child makes me want to scream.  The kids know they are pawns.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 525,
              "content": "YTA, all OP's comments are like \"I don't get enough time\" with a strong emphasis on \"I\". The sons' time is his time and he gets to spend it the way he wants for important events of his life irrespective of whether OP gets enough time with him or not",
              "id": 15,
              "comments": [
                {
                  "score": 414,
                  "content": "Her other post is not much better. Moaning and asking why should she have to help pay for her kids contact lenses so he can play football. She 100% just doesn't get that she is a parent and her kids should come first. But nope its all about her wants and her needs and her kids can just suck it up, because they obviously don't matter.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 169,
                      "content": "Some people have absolutely no business parenting.  Birds, reptiles and other mammals take better care of their offspring.  A child is a unique, fully separate human being with needs, wants and dreams. They are not mama or papa's little thems.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 93,
                      "content": "Gee I wonder why she is divorced.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 65,
                      "content": "Baffles me that she can't afford to financially afford (or does not want to) the two children she had but went ahead and had a third kid.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 25,
                      "content": "How did they not learn their lesson from their last post.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Which I mean if a kid has an RX as high as what she’s talking about there is no way her insurance covers what he needs in full. Yes a basic frame and lenses. But no way what he needs. Which I will say would likely be expensive also, so either way she would bitch about what her kid needs for his ONE AND ONLY set of eyes. I mean god forbid the kid can see. But sounds like a basic mom so of course bare basic would be what her kid gets from her.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "How did you see her other comments",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "I can see why she's divorced.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "She probably wants her older son at home to watch the younger one so she can have alone time.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "She could go to his games like other parents do. That's part of her time with him, watching from the stands.",
                  "id": 25,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Yea this mom looks at her son like he's an accessory to her life. Absolutely pathetic parenting here.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 185,
              "content": "Plus couldn’t they like negotiate her having a different weekend for that month or something? \n\nMaybe if she put her child first, instead of herself ,the father would be more flexible with the rules.",
              "id": 27,
              "comments": [
                {
                  "score": 179,
                  "content": "Apparently the father did try to negotiate, but she’d rather go on a self centered power trip than do what’s best for her son.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 56,
                      "content": "I fucking hate my ex but I love my kids more so I was always willing to come to a compromise.  I guess it helped that we both agreed that we wouldn't deny the kids an opportunity because of who had placement that week. It didn't always feel 100% equitable but over the long run it mostly balanced out.  My kids are adults now and even with my ex being an irrational paranoid POS we somehow managed to coparent them into college grads with good careers, good character, and able to form healthy romantic relationships (both currently engaged to really great partners).  Divorce doesn't have to fuck up your kids but you have to put aside your own ego and desires to make sure your kids come first.  I'm a total bitch, he's a total moron but even we managed to do well.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Of course 🤦‍♀️",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Sometimes I think these posts are made up just to see what people would say or get reactions out of people.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 94,
                  "content": "The reality is she doesn’t want to be obligated to drive an hr each way to take him to and from the dance. It’s just lazy parenting and I don’t think it’s hard to see why she isn’t the primary parent.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 25,
                      "content": "The amount of kids I take to dances and games because their parents can’t or won’t drive them. There’s public transportation here but it can be pretty rough and it’s also never convenient to the schools. I sometimes wonder if I’m the wrong one for getting my kid to these things and all his friends, but he’s an introvert so when asked I jump to attention. Also, his father, a very good man, is hours away and gets that he can’t make my son come all the time. My son and I moved. He didn’t move away. I moved for a job. You can parent tennis without being like OP.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 64,
                  "content": "He seems already flexible- he offered to give her Monday (extend the visit) to make up for the lost time.  This is all about control and focus on her.  Classic Narcissist. \nThese children will go no contact by adulthood.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 5,
                      "content": "If not by the time he’s old enough to drive and do his own thing anyway. Wonder if he’s old enough to make decisions where he wants to be in court",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "This is the exact kind of thing that made me stop talking to my dad as a teenager. I went a solid five years without speaking with him, broke the silence one year at Christmas time for a short trip to visit him and his parents, and then had to cut him off for another five years because I took three hours to respond to a text a few weeks later and he CALLED MY SCHOOL. To be clear, I was 19 and IN COLLEGE. Some administrator literally came to pull me out of the first class of the day to tell me my daddy was worried about me.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 137,
              "content": "[deleted]",
              "id": 37,
              "comments": [
                {
                  "score": 8,
                  "content": "It is just a dance. But it’s also fond memories with friends growing up. Rights of passage in high school and mainly as a football player too. \n\nI’m very much out of high school and just told my son who is almost in high school that I can’t wait until he gets to experience that with his friends (homecoming was this weekend here for our community). Because it was the best times I had with my friends as a student athlete and a social person!",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "YES, homecoming is the biggest deal of the year. High school kids flood their IG feed for days with the photos of themselves & their friends. If you aren’t there its considered scandalous!! OP is fully jeopardizing her relationship with her kid forever. She could ask for a different weekend & bond with her son by taking him to buy his shoes and tie, or help him pick out his date’s flowers. Parenting can be so simple when you have empathy for your children.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "It's also going to backfire if what she wants is time with her son, because if she keeps him home, he's just going to be grumpy the whole time that he isn't at the dance and might not want to talk to her all weekend.",
              "id": 40,
              "comments": [
                {
                  "score": 38,
                  "content": "Yep, this will absolutely backfire and when it does, classics narcissist behavior will be to blame the kid (\"he doesn't love me after all I've done for him\"). Run Forrest, run.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Not only would it be selfish but she will be alienating him while attempting to continue her connection with him. She has to let him be a normal, high school student. She needs to allow him to have his activities. If she puts his time with his brother ahead of his time at school activities the only thing she will achieve is that he hates his brother. I imagine that if she won't allow him to go he will be angry the entire weekend.\n\nSometimes you drive an hour each way and find a coffee shop to sit in while you wait. If the coffee shop closes you finish the evening in the car.",
              "id": 42,
              "comments": [
                {
                  "score": 4,
                  "content": "Right? That was my first thought. \"He's angry with me, won't speak or come out of his room, but at least he's with mommy🤗\"",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Most Applebees are open until midnight or later. It really isn’t hard to find something to do while your kids are busy, if you don’t suck (directed at you, OP).",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "She says in a comment from her other post he’s a quarterback",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "B-b-b-but it's her night!!",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "In another post she said she stopped going because it took too much of HER time. Bruh like ur a mom. Moms r supposed to be their for the kids. Kids are a responsibility! I swear OP should lose the rest of her custody if her kids r such a burden",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "They're not gooding to have a very good weekend, if she forces him not to go. He'll understandablely spend the whole weekend angry and resentful towards her.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 244,
          "content": "Agreed. We have had a similar situation with my stepson (8) sometimes. Because of school he primarily lived with his mother and we mostly “got” him friday and saturday. His mother never lets him do social things outside school (it is a struggle) so whenever he is invited to a birthday party or a playdate on a friday or saturday we always bring him. Even when that takes a bit of our time. The way I see it is that he needs to live his best youth and depriving him of social events like birthday parties or school events because of our time is taking time away from his youth. He shouldn’t be the victim of the divorce by not allowing him to go. We will see him another time and have fun doing stuff on other days. Also, if you tell a child not to do these fun activities because “I don’t get enough time with you and it is my right to see you so you will come to my house and sit on the couch with me” will only make them resent you.",
          "id": 49,
          "comments": [
            {
              "score": 80,
              "content": "Thank you for being a decent human being and an even better parent. Kids want to be kids, and they're people with their own lives, not just possessions you sit on your mantle.",
              "id": 50,
              "comments": [
                {
                  "score": 47,
                  "content": "Exactly! When I was young I was rarely home. I had so much things to do and children to play with. And my parents weren’t divorced so I didn’t even have to divide my time. My parents had a picture of me (and siblings) on the wall and I think they did that to identify the creatures eating their fridge empty. \n\nWe bring our (step)son to his weekly activity we arranged for him. So that takes hours of “our time” every week but it is fun for him and we want him to have a good childhood. His mother didn’t want this activity at first but when we told her we were paying for it and she didn’t have to then it was all okay. He doesn’t have activities at their place (not a money thing otherwise we would have already paid for it, but they don’t want to bring him to activities). So now we have him extra days so he can have an extra activity. He is young now so he should do fun stuff now without having to worry about bills and other stuff as long as he can. My parents did this for me so I am doing this for our children, my stepson and my biological son.\n\nETA: I rather have my children having fun and making memories for the rest of their lives than having them in my home all the time not doing anything special and resenting us later for the missed opportunities they had as children.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Put a picture of the kids on the wall \"to identify the creatures eating their fridge empty\"! Lol!",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I think that might be happening with a friend of mine.  Divorced, with week about custody.  I think the older child is aging out of custody requirements now, but I know that whilst the children are with their dad, they are not allowed to do anything with anyone else.  He takes them to dinner etc, but they are not allowed to see their friends, do any school related socialising, nothing.  They do have extra curricular activities that their mum enrolled them in, but they are not allowed to do those whilst with dad.\n\nJust recently the older child went briefly overseas to compete in something.  We were surprised they were allowed to go, given dad's attitude, but as we learned, it wasn't that he allowed them to go - more that he couldn't stop them.  I think that that child is going to go NC or very limited contact in the future....",
              "id": 53,
              "comments": [
                {
                  "score": 4,
                  "content": "I am afraid so as well. So sad that a parent can deprive their children of very important activities. When I was a teenager I had a lot of activities after school so I also was away from home a lot. I think it is so important for children to have a lot of things to do to develop their skills and find out what they like and dislike. I hope your friend will come to his senses because he might lose his children this way.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "My ex and I aren't that far apart, geographically, and I would agree the centering the kids and the childhood we want them to have is massively important. It makes hash of the schedules, but what's more important: perfect adherence to a piece of paper we wrote when they were in elementary school, or extracurriculars, friendships, and reasonable spontaneity?\n\nIf this lady is who I think she is, she has been all over Reddit at every stage. A smart parent in her situation would consider a local AirBnB or hotel room for homecoming weekend, seeing as her son is a football player and it's a big deal. Like, go to some games. Football isn't my thing, but my kids are my thing, so I'd figure out how to handle football. \n\nWe raise our children to leave us and go out in the world and do things, not to sit in our houses being bored.",
              "id": 55,
              "comments": [
                {
                  "score": 5,
                  "content": "You sound like an awesome parent! And I agree with you. I always think ‘what would be fun/ best for my (step)son?’ Sitting at home is rarely the best thing for him.\n\nIf the mother and stepfather of my stepson have family day with their extended family planned on “our” day we will never say no because it is important for my stepson. If we have something planned we expect them to take our question in consideration. Luckily they also never say no if asked. My stepson is at an age where he knows what he want so we ask him what he likes to do. He never has to ask himself if he will hurt one parent by choosing the activity of the other parent. I always tell him we as adults will always be alright and he is not responsible for our feelings so he doesn’t have to let activities go to spare feelings of parents. That is a burden children don’t need to have. \n\nI agree with you that I would make it possible for my children like figuring out an AirBnB or even talk about him staying at his other parent (who lives closer by school) for the night to spare him a long commute after the party. Anything to make it possible.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">Also, if you tell a child not to do these fun activities because “I don’t get enough time with you and it is my right to see you so you will come to my house and sit on the couch with me” will only make them resent you.\n\nRight?\n\nSo you're not going to let your son go to homecoming because you don't want lose the time so you're going to force a surly teen to spend time with his mom. That's going to be a real \"fun\" weekend.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Absolutely!  Children don’t ask for marriage, to be born, or for their parents marriage to fail. We just have to continue to support and encourage them and OP is dramatically failing in all aspects it seems",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 192,
          "content": "I can’t believe this person is even real. This seems to be such an obvious YTA that it feels like a trigger post",
          "id": 59,
          "comments": [
            {
              "score": 88,
              "content": "Nope. She posted a month ago about the same son and if she was TA about not financially supporting him. She said in this post that her ex took her son away, but the kid asked to move because she wouldn’t drive him to football practice. Now we’re back here again because she still doesn’t want to inconvenience herself for her oldest. Seems like her new baby with her bf is more important.",
              "id": 60,
              "comments": [
                {
                  "score": 33,
                  "content": "Ah, I figured. He's old enough to choose where he wants to be, if op isn't careful she won't be seeing him at all soon enough.",
                  "id": 61,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Unless OP enjoyed the rise they got out of that post and decided they want seconds?\n\nEither that or OP is annoyed he chose dad and sees this as punishment, but why post on AITA?",
                  "id": 62,
                  "comments": [
                    {
                      "score": 9,
                      "content": "My guess is she’s so convinced she’s a victim that one of these days the sub will validate her.",
                      "id": 63,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 80,
              "content": "Yeah...especially if you read her other post where she doesn't even pay child support she's legally meant to because the older son lives with the dad more, refuses to contribute to his medical and stuff.....but somehow she's the victim in everything.",
              "id": 64,
              "comments": [
                {
                  "score": 7,
                  "content": "Op has some undiagnosed mental disorders, Imma guess narcissism",
                  "id": 65,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "I just read that. Jeesh. She’s gonna have no kids left soon.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Plenty of people are like this out there, sadly. Divorces and child custody become bitter battles where some parents treat children like pawns. \n\nSounds like the kids maybe don't want to live with her, or at the very least are happy to have other reasons to go out on weekend nights. And regardless, in a few years they'll be free to choose who they want to hang out with. OP needs to keep that in mind...",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "I believe it. My kiddo and I have been dealing with the male version of her for years. Some parents can’t see beyond what they want and don’t give a crap about the kids. It is all me, me, me for parents like them.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 175,
          "content": "Not to worry OP… your son is reaching the age where finally he gets a say on who he lives with. Soon you won’t have to worry about those four days a month, because he will make his own choices about how he spends them…   \n\n\nAnd this weekend? Expect him to be in a LOVELY and bright and joyful mood, full of testosterone brimming peace and harmony with you. It’s going to be awesome and quiet because he’s going to cuss you out, and then ignore you… allllll weekend. \n\n&#x200B;\n\nYTA",
          "id": 69,
          "comments": [
            {
              "score": 13,
              "content": "I represent kids in foster care and when there is an offending parent my kids are uncomfortable for I ask the judge to put on the record that my client can refuse visits.  It gives them empowerment to not feel forced and afraid to hear the judge say it. I truly also believe all of my verbal clients are able to help with choices but 9 and up really can tell you how it makes them feel. OPs son is certainly old enough and would already likely get some choices.  OP is really unhinged thinking this won’t bite her in the ass.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 101,
          "content": "Look at their post history. Not even a month ago they posted another parental issue and exposed that she gave up custody because her sons football practice “took up too much of her time”. She either has an issue with her son or football cause this is nuts",
          "id": 71,
          "comments": [
            {
              "score": 79,
              "content": "It's neither, she has an issue with the \"being a parent\" part of being a parent.  OPs words are very self serving",
              "id": 72,
              "comments": [
                {
                  "score": 26,
                  "content": "> my ex took my older son away from me to go live with him when he wasn’t doing good in school with me…\n\nThis is also a very telling sentence. Not just the situation, but especially the lack of self awareness.",
                  "id": 73,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Dang. What selfishness. Glad you pointed this out. \n\nI already had so many questions..\n-why is OP an hour away, did they move or did Dad and kids move?\n-why does OP need to drive 4hrs, can they volunteer at the event or find something to do in the local area while kid is at dance? \n\nBut now it all makes sense\nOP is just selfish.",
              "id": 74,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 54,
          "content": "Yea YTA op. This isnt about you. You need to let the kid be a kid.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "I'm not social and hated high school, but I'd regret not going to homecoming and prom.\n\nYTA OP. It's just not a school dance. It's a memory he will have with his friends for the rest if his life. Let him go to the dance. If you weren't so focused on yourself, you'd try and use this as a bonding experience.\n\nI did with my dad. He took me dress shopping and did my make up. He also got me my corsage and these are memories I will carry forever. \n\nDo you try to spend more time with him other times, like over the summer?. He is a teenager and unfortunately for parents is a major age of independence and making choicest him be a teenager.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "I agree. YTA. \n\nBut isn’t there other options?\n\nLike swapping weekends or something? I mean if you live an hour away from your child? Perhaps it’s time to move? Being closer will help with connection. Also, it could be that you just have shitty ex that comes from a position of power into this. There could also be other factors and history that decides this. \n\nBut in just regards to your son, YTA, but you could change the situation so you can be closer in the future.",
          "id": 77,
          "comments": [
            {
              "score": 158,
              "content": "[removed]",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "Football is every weekend.  She should be making that hour drive every Friday",
              "id": 79,
              "comments": [
                {
                  "score": 62,
                  "content": "That was my thought, too- does she not bother to go to any of his games?",
                  "id": 80,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Or take his younger brother to support him?",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "Excellent point. She's not involved in HIS life but wants him involved in HERS \n\nYTA X 1000",
                  "id": 82,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "Or she could be the shitty one...",
              "id": 83,
              "comments": [
                {
                  "score": 8,
                  "content": "Tbh, that's what it sounds like",
                  "id": 84,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yes, why can't she just swap weekends or having him an extra holiday to make up for it?  OP YTA here.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": ">Also, it could be that you just have shitty ex that comes from a position of power into this.\n\n&#x200B;\n\nYou are absolutely insane aren't you? OP is a woman/mother, who had her kid leave her to live with his dad and she gets ONLY 4 days a MONTH with him, refuses to pay any kind of child support and thinks homecoming as a freshman football player is \"no big deal\". Are you an alt for OP or something? Can you IMAGINE how awful this mother must be outside of just this one already bad scenario to see so many things go against her with custody of her kids etc. in 2023? I cannot even begin to make a storyline in my head where OP isn't a massive asshole constantly.",
              "id": 86,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "The ex literally offered her an extra day (monday) to make up for her Saturday. She declined because it would still be slightly less hours than if she had both days.  The ex tries to offer compromise so their son can go to a lifetime event, and you think the ex is the shitty one?\n\nIt's one day for a dance.  The kid won't get many more of these, but he'll see OP again before long.  OP can deal with losing a day if they need to, it's not the end of the world.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "I never went to a school dance. I wasn’t even unpopular and could of gotten people to go with me but I had a lot of other shit going on because my parents didn’t care about that one bit and would hit me for getting C’s in school \n\nThey wouldn’t have probably forbid me from it in the later years but they never encourage it once. \n\nI wish I went and I will encourage my kids too as much as possible",
          "id": 88,
          "comments": [
            {
              "score": 4,
              "content": "I was also never seen at school dances and I wish I had gone. I was extremely anti-social due to neglect and abuse at home. I never had anybody to go with or friends to go as a group with. I seriously wish my adolescence had been different. I would be over the moon to see my step kids (and hopefully future kids of my own) going to school dances. I definitely think they are one of the few good things schools can offer students for a way to let loose a bit.",
              "id": 89,
              "comments": [
                {
                  "score": 4,
                  "content": "Gotta humble brag a little here. When my very shy son finally asked a cute young lady to go to Homecoming, she said \"yes\" but didn't have a dress to wear. My older daughter & I went through her closet and found a cute little dress for her. It was quite a bit large, so I did the best job I could taking it in to fit her. I did her hair & makeup & my son spent his allowance on a faux diamond jewelry set & corsage. Since they were both too young to drive, we took them to a nice restaurant. They sat on one side far away from our prying eyes while we all ate dinner. Then we chauffeured them to & from. This is one of MY happiest memories of his high-school years. This mom is definitely TA here.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "This is probably a bit of a show of why OP only sees her son one weekend a month. The court system is heavily biased towards moms. So if a mom gets the short end, I’m inclined to believe something more is going on then “he wasn’t doing well in school”.",
          "id": 91,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7448,
      "content": "YTA.\n\nYou son’s father is correct - you don’t put your kids first. He’s a teenager & the dance is important to him. Do you really believe you’re going to build a good relationship with him by forcing him to miss homecoming because “it’s not fair” in your mind? It isn’t about what *you* want - it’s about being loving & supportive to your children.",
      "id": 92,
      "comments": [
        {
          "score": 959,
          "content": "Is there some way that you could swap weekends with your husband?  In some ways your post sounds like this is about you ex, but it's about your son, and if he really wants to go to this, it's you that he is going to resent.",
          "id": 93,
          "comments": [
            {
              "score": 595,
              "content": "Even if she cant, its not like she'll never see her kid again if she allows him to go. Other weekends will come, and he will be more willing to spend then with her if she lets him go",
              "id": 94,
              "comments": [
                {
                  "score": 376,
                  "content": "It’s more likely that by trying to hold onto every minute of seeing her son, at the detriment of what he wants to do, and experiences he wants to enjoy, that it’ll push him away as he grows older",
                  "id": 95,
                  "comments": [
                    {
                      "score": 219,
                      "content": "Or worse, she's like my mom and her child's feelings are less important than hers.\n\nThe line about already giving up time because of football practice (what's stopping OP from bonding over the ride there and back?) just threw off a *vibe* that feels selfish.\n\nLike, her missing him is more important than he feels missing all of his friends and possibly a crush/date as well as the first big high school dance milestone.",
                      "id": 96,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "You're right, ask me how I know.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yea this post is really weird to me. She can't drive him down, have dinner and hang out in the area, and then pick him up and get to hear all the details of his first high school dance? It's so lucky that she got that time so she could be the one who hears about it. Not that teens love to share, but still, as a mom--I'd take what I can get!!",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Very true.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "That was my thought. I understand her concern over the distance, but homecoming dance is a big deal to kids. I would just swap weekends.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "The post sounds like it's entirely about OP who is a self obsessed narcissist judging by her other posts.",
              "id": 101,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "For that matter, take the younger child along, drop off the older one and go see a movie. (Or grab some dinner. Or mini golf. Trampoline park. So many other options.) Then pick up the older kid and drive home.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 256,
          "content": "It baffles me that people can (I'm being *very* generous and going to assume that this is even real) type out all of this information, reread it to make sure it's good, and not **immediately** look at it and think to themselves \"wow, yeah what an absolute asshole i am\" and then immediately delete what they typed. YTA OP",
          "id": 103,
          "comments": [
            {
              "score": 30,
              "content": "As much as I hate the word, narcissistic ppl do exist and they 100% would not see an issue with a post like this, because something being unfair to them is an unjustice that needs rectified.",
              "id": 104,
              "comments": [
                {
                  "score": 3,
                  "content": "OP is a broken person that deserves nothing.",
                  "id": 105,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Exactly. I’ve had the same moment a few times today reading and wondering if it’s a real situation",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "\"I'm trying to hurt my son because I'm selfish and don't think of anyone but myself. AITA?\"\n\nAbsolute insanity.",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 104,
          "content": "She has a 1.5 year old from another man she doesn’t mention here. How much you want to be she uses him as a babysitter on her weekends?",
          "id": 108,
          "comments": [
            {
              "score": 28,
              "content": "Ooh damn. Bet you're right",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "ooooh, yeah - I would not be surprised AT ALL if that is the case",
              "id": 110,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "That was absolutely my first thought. I know someone exactly like that. She makes plans when it's her weekend so that the older kid can watch her baby half-brother, while she goes out.",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "\"HE thinks he should go to the dance and refuses to babysit for ME - his own mother?! Wait till he sees the replies to my reddit posts and realizes what a shitty son he is.\" - this lady, probably",
              "id": 112,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "What's the chances her son was looking afyer his brother when she had more custody and it affected his school. I know its conjecture but she's given me that type of vibe",
          "id": 113,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": ">It isn’t about what you want - it’s about being loving & supportive to your children.\n\nconsidering OP doesn't even want to pay her child support either for the eldest... yeah, i think she missed that memo.",
          "id": 114,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "This is probably why OP only sees her son 4 days a month, the kid genuinely doesn't want to be with her and since he is getting to be close to that 16 mark, depending on what country OP is in he can decide if he wants to see OP at all very soon.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yep, when you are a divorced parent, you have to make a lot of compromises to make your kids life be as normal and as least “disrupted” as possible in regards to mimicking what their life would be like if the parents had not gotten divorced. Seems like the dad is willing to compromise so you still get to see the kid, but the kid gets to participate in a relatively wholesome social activity that he deems important.",
          "id": 116,
          "comments": [
            {
              "score": 3,
              "content": "His dad seems to be trying incredibly hard to make things work for the sake of their son. He also seems to be the one who always reaches out to try to facilitate kid maintaining a relationship with OP. OP is all about herself. Look at her other AITA post… this isn’t even close to an isolated incident.",
              "id": 117,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "My favorite part was \"it’s literally just a dance?\".  What world did she grow up in where she didn't care about homecoming or school dances?  Even if she didn't care, she had to know they were a big deal to the other students.  \n\nOP you are in for one hell of a rude awakening when you realize that the age where a child can legally choose which parent to live with is around his age.  Not sure your state, but the oldest I've seen has been 16.  You said he was a Freshman so that means you have about a year to get your head out of your own ass or he will choose to not come over to your house at all and there will be nothing you can do about it.  \n\nEdit:  Since I didnt say it before, OP, YTA.  Big time.  Start being a parent or at least pretend to be a parent.",
          "id": 118,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5208,
      "content": "YTA. **Your son isn't a possession, he's a person.** He has a life. Your job as a parent is to help him successfully live that life at every stage, *even when it is inconvenient for you.*",
      "id": 119,
      "comments": [
        {
          "score": 919,
          "content": "That last line. Yesterday was a local festival in town. I did **NOT** want to go. But guess what? I dragged my ass there anyways because I didn’t want my kids to miss out. \n\nYTA",
          "id": 120,
          "comments": [
            {
              "score": 309,
              "content": "As an aside, I can't imagine the mood a 14 year old will be in, when he's at her house that weekend.",
              "id": 121,
              "comments": [
                {
                  "score": 167,
                  "content": "Right? It’s **NOT** going to be a fun family weekend. 🤦🏻‍♀️",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 71,
                  "content": "Exactly. It won’t be enjoyable for either of them. She should just let him go and then they’ll actually be able to enjoy each others company on Sunday and Monday rather than there being this bad tension between them",
                  "id": 123,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I feel like this kid only visits OP because he has to.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Seriously. How strange that she can’t stand the idea of not seeing her son for a few hours on a single night.   That is straight up not healthy.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "The kid will resent her and he will be correct.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "This is when Mr Freshman petitions the court to stop going to Mom's. Or if Dad can't afford court, kid stops going and makes Mom take Dad to court. Odds are Mom can't afford it either. Plus, Mom's other post says she doesn't pay her share of Freshman's bills, so judge won't like that much.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Seriously… I would just camp out in my room all weekend and never come out.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Yeah, I've got a nasty head cold, but my 11 y/o was signed up for a 3-hour beginner's archery class yesterday that he was really excited about (oh, and it's my weekend day in my custody agreement.)\n\nYou'd better believe we were out there.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 138,
          "content": "I bet you she uses him as a babysitter for his brother and half sibling on the weekends.",
          "id": 130,
          "comments": [
            {
              "score": 34,
              "content": "That’s a sure bet. Just like if she keeps pulling this crap, the kid’ll be telling the judge he wants to stay with dad full time.",
              "id": 131,
              "comments": [
                {
                  "score": 5,
                  "content": "She gets 2 weekends a month. Which is bare minimum.  She sounds terrible. When the kid is old enough and can make the choice to not go at all the judge might allow it.  Hopefully soon enough if the father feels like taking her back to court.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 79,
          "content": "This exactly! Knew a guy who wouldn't attend any sports things for his kids because \" I'm not interested in sports\". Duh AH, but are you interested in your kids???!!",
          "id": 133,
          "comments": [
            {
              "score": 29,
              "content": "How rude! I personally don’t like sports either but both my kids love hockey so I sit there and cheer and pretend I know what I’m watching LOL",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 77,
          "content": "So much of parenting culture is geared toward making life more convenient for parents, but seriously, we brought them here - they didn’t ask for any of this - it’s our responsibility to take care of and nurture them. It looks different at every age obviously, and I’m not saying it’s easy.",
          "id": 135,
          "comments": [
            {
              "score": 9,
              "content": "Definitely.  One of the main reasons I never became a parent: I'm really damned selfish!  I want my life to be about me, but I recognize that and refuse to make that other people's problem.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "My parents made me miss out on so many things because they got sick of driving me around. But then they wouldn't let me carpool, or do sleep overs, or catch rides home with parents they didn't know that well (which was pretty much everyone, because they refused to socialize). They wouldn't even let me walk home until I started doing it on my own. (25-35 minute walk home > hour and a half bus ride).\n\nThey made all of our lives miserable because they just refused to compromise on any little thing. Even made me drop out of scouts because they got tired of going to the events. One year we'd moved to an area with an even worse bus route, and THAT was the year they decided they weren't driving me to school AT ALL anymore. I was late to class every single day we lived in that rental. Multiple days where they made me stand out there and the woman straight up skipped my street.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": ">my ex took my older son away from me to go live with him when he wasn’t doing good in school with me…\n\nOP would rather treat him like a possession rather than a person. She's more focused on what she WANTS, rather than what the child NEEDS.",
          "id": 138,
          "comments": [
            {
              "score": 5,
              "content": "He probably wasn't doing good in school because she wouldn't let him do any outside school work, like group projects or class events. If she won't even let him go to homecoming she probably wouldn't let him go to study hour or club meetings either :/ my parents used to do that shit too. The tried doing it late into highschool and even into college, but by that point we lived somewhere where I could just walk and not have to ask.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": ">Your job as a parent is to help him successfully live that life at every stage, even when it is inconvenient for you.\n\nWish my fucking parents had understood this. But my mom's explanation for the shit she pulled is \"she had to consider her own life\". Well then shouldn't have gotten three sons, should she?",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Makes you wonder why the mom can only see him 4 times a month. The court system really favors mothers in divorce situations. Must have screwed up pretty big.",
          "id": 141,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "With her line of thinking, she's only getting weekends a few more years. Once it's his choice he's gonna run for the hills. My parents aren't divorced but I sympathize with this kid. My mother kept me in a stranglehold for years. I know now she thought she was protecting me, and in a lot of ways she did, but I was miles.behind everyone socially and it took a long time to lose that resentment. \n\nOP, if you read this, I know you love your son, but part of showing that love is letting them go, not holding them close forever.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "To add to this: it’s *your son’s visitation with you, not your visitation with them*",
          "id": 143,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3623,
      "content": "YTA. You do realize that your son is old enough to tell a judge he doesn't want to stay with you anymore, don't you?",
      "id": 144,
      "comments": [
        {
          "score": 726,
          "content": "Ohhhh good point! If he has to miss homecoming now, she's going to make sure he misses other important events for the rest of high school so if he were smart he'd stopping seeing her all together.",
          "id": 145,
          "comments": [
            {
              "score": 537,
              "content": "I can see it now...\n\n\"My son's high school graduation is on my weekend and I don't think it's fair for me to miss any of my time. He gets the diploma no matter what, so why does he need a ceremony?\"\n\nEdit to add: YTA",
              "id": 146,
              "comments": [
                {
                  "score": 102,
                  "content": "No, she'd probably let him do that, cause she can brag about the graduation pictures and insist that she's a great mom",
                  "id": 147,
                  "comments": [
                    {
                      "score": 82,
                      "content": ">insist that she's a great mom\n\nWhich she clearly isn't as she's lost custody of two children to two different men by the sound of it.",
                      "id": 148,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Plot twist: He can go to the dance but only if he brings her as his date 🤣",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 134,
          "content": "It seems to me she doesn't have custody of either son.\nOlder one was taken by her ex, because he didn't do well in school under her care. It seems like she has him on weekends. \nYounger one is also under dad's custody with her having overnight visitations 4 days a month. The one who has the dance. \n\nI have no idea how bad situation had to be to lose custody of both children that have a different father.\n\nBut she does do her darnest to lose the measly 4 days she has with the younger son.",
          "id": 150,
          "comments": [
            {
              "score": 35,
              "content": "Given that that both the fathers got custody, she must be a real piece of work as family courts often tend to be unreasonably biased towards the mother.",
              "id": 151,
              "comments": [
                {
                  "score": 104,
                  "content": "People need to stop parroting this myth. It does active harm to good fathers by discouraging them from seeking custody.\n\nIt’s not true. In cases where custody is contested, [fathers are actually *more* likely to get custody than mothers.](https://www.weinmanfamilylaw.com/blog/2020/06/are-the-courts-gender-biased-in-custody-cases/)",
                  "id": 152,
                  "comments": [
                    {
                      "score": 50,
                      "content": "From the article - \"In fact, statistics are frequently cited that suggest around 90% of women are awarded custody, but **they also fail to show that 60% of men get custody in a contested cases. Similarly, in just over half of all divorce cases, the parents mutually decide that the mother will take the custodial role.\"**",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Right, the post-divorce custody distribution is on the mom side largely because of deadbeat dads. In the vast majority of US states, when both parents want custody, it's pretty much always 50/50 unless there is a real issue with one of the spouses.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "This is false. If both parents are fighting for full custody then the “default” parent will typically win. The parent handling doctors appointments, going to conferences and handling all the actual parenting. Moms are typically the default parent. You cannot be a Disney dad throughout your relationship and then expect to have full custody after your divorce.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 7,
                      "content": "This is true in a small minority of states and it's true when there is a reason they can't split custody 50/50, sch as geography. \n\nIn most places, the court gives 50/50 custody if it's logistically workable (e.g, both live close enough to the schools) and both parents are competent.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "From her previous AITA post from less than a month ago (and she was voted the AH), the freshman is her oldest and the other child is in 2nd grade. Same father but the youngest still lives with her she says. She also has a third child, a baby, with a current boyfriend.",
              "id": 157,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 110,
          "content": "If this has been her(?) attitude to parenting this whole time it’s too late for her by now. She’s going to start seeing a lot less of her son very soon.",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 40,
          "content": "Honestly it sounds like that’s what happened with the older son. OP claims her ex “took him away” because he “wasn’t doing well in school.” I’m willing to bet the son just didn’t want to be around OP anymore. And in the very rare case that it *was* court-ordered, OP just told on herself and admitted he wasn’t doing well in school because of her as a parent. I mean, *hello?*",
          "id": 159,
          "comments": [
            {
              "score": 3,
              "content": "I’m wondering if he was even going to school. My friend’s granddaughter’s mom lost custody because she was partying so hard, she wasn’t waking up and getting her daughter to school. Poor girl lost almost an entire year before my friend’s son was able to get proof for the court that she wasn’t struggling with illness, and her mom just sucked. He and his wife have full custody now, and the difference in that child is just astounding.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "OP in a few years: “My son went no contact with me when he turned 18 and I don’t know why!”",
          "id": 161,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "OP really is speedrunning the \"why does my son never visit/call/text?\" path of this Choose Your Own Adventure",
          "id": 162,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "That’s probably the real reason why they aren’t with her. She’s selfish and mean.",
          "id": 163,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1791,
      "content": "YTA - wow, way to make your kid resent the hell out of you.",
      "id": 164,
      "comments": [
        {
          "score": 113,
          "content": "You should see OP’s other post. No wonder she only gets 4 days a month.",
          "id": 165,
          "comments": [
            {
              "score": 56,
              "content": "Thank you I love messy redditors",
              "id": 166,
              "comments": [
                {
                  "score": 15,
                  "content": "Yeah she’s a super selfish parent. It’s gross frankly. Kid is better off without her",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 53,
              "content": "She's also a liar. She said that her ex took her older son away from her, but in the other post she said she was the one who told him to stay with his dad because she didn't like all the driving.",
              "id": 168,
              "comments": [
                {
                  "score": 8,
                  "content": "This is disgusting to me. I cannot fathom telling my own flesh and blood to go live with their father because I cannot stand the driving. As a parent, my heart goes out to this kid. I cannot imagine what having OP is like as a parent.",
                  "id": 169,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "holy shit, you were not joking. Usually I despise people who stalk redditors but I mean she just keeps coming back to this subreddit LOL",
              "id": 170,
              "comments": [
                {
                  "score": 3,
                  "content": "Yeah I also saw someone else comment about her old post and was curious. It was a very wtf moment.",
                  "id": 171,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "\"Coming back.\"  It's just two posts and they're both insane.  It's rare to see such a resounding \"asshole\" score.",
                  "id": 172,
                  "comments": [
                    {
                      "score": 4,
                      "content": "It's also a matter of her responding to a bunch of comments, essentially she posts AITA and then doesn't listen to any reason but yes, if you have posted AITA two times within months apart off different situations then yes it is \"keeps coming back.\"",
                      "id": 173,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Yep.  Saw this on front page, clicked the OP's profile and holy shit, tell me you hate your kid and/or are a full on narcissist without saying it.\n\nYTA.",
              "id": 174,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1109,
      "content": "It’s not just a dance it’s homecoming and you will always be the asshole if you don’t let him go. YWBTA",
      "id": 175,
      "comments": [
        {
          "score": 39,
          "content": "YTA. Jesus you’re a shitty parent. If it was up to you the kid wouldn’t be playing football at all and walking around in old glasses with crooked teeth in hand me downs so you don’t have to pay for your own damn kids. Let the kid go to the damn dance. Keep going at this rate and when he hits 18 you won’t have an oldest son anymore. The kid already told a judge he doesn’t wanna be with you. Take a clue bf you lose your kid.",
          "id": 176,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "My first thought was, twenty years from now, OP’s son is unlikely to remember much about “this dance” he attends…\n\n…but he absolutely WILL remember that his mother stopped him from attending Homecoming “just because”. \n\nPoint being, her particularly jaded perspective may just dismiss it as “some dance”. But for her teenage son, right now, it is very much a big deal and there’s absolutely no reason not to let him go— except that, apparently, she is unable to imagine other people have hopes and desires different from hers.\n\nYTA",
          "id": 177,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 718,
      "content": "YTA, selfish af",
      "id": 178,
      "comments": [
        {
          "score": 43,
          "content": "Makes you wonder....",
          "id": 179,
          "comments": [
            {
              "score": 200,
              "content": "It doesn't, she has almost zero visitation with either of her kids. Shit is written clear as day.",
              "id": 180,
              "comments": [
                {
                  "score": 83,
                  "content": "Right lol. When she said the father had custody and she, the mother,  had weekends I knew she would be the asshole.  \n\nFor the father to get custody over the mom she would’ve either had  to willingly give him custody or have some pretty glaring issues",
                  "id": 181,
                  "comments": [
                    {
                      "score": 63,
                      "content": "I laughed when I read ‘because he wasn’t doing *good* in school with me’.\nMinor thing, but the irony there was great",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "My dad got custody of me and my two older sisters (3 girls - the oldest is hers, not biologically his).  Let that sink in.  OP is definitely not a good parent.",
                      "id": 183,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "This post is worded weird but the son she’s talking about IS the older son. She has custody of the youngest and dad has custody of oldest, with them having both on their respective weekends. \n\nHaving divorced parents makes you good at custody math.",
                  "id": 184,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "There's a reason one kid was taken away and the other she only sees 4 days a month ... It's pretty clear",
              "id": 185,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 606,
      "content": "Yeah YTA it may seem like “just a dance” but a lot can happen in one night. Kids make some of the best memories at school functions. If you don’t let him go he’s gonna resent you for it and it’s only gonna make him not wanna spend any time with you. He’s probably gonna spend all the time you have together pissed off and going out of his way to make sure you know he’s not happy. Can his dad switch a different day with you so you have the same amount of time? If you talk with him and he sees that you want to make it work, but you just don’t want to lose out on time with your son he might be more on board with giving a different day up. Especially if it means so much to your son. Don’t take away your kids childhood just because you wanna be a little selfish or because you think he’ll “get over it”. Usually it’s that viewpoint that gets you cut off when the kid turns 18.",
      "id": 186,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 550,
      "content": "YTA.  Homecoming is not “literally just a dance” to a high schooler, especially a football player.  You need to put your son before what’s convenient for you.",
      "id": 187,
      "comments": [
        {
          "score": 75,
          "content": "Exactly. It absolutely is not “just a dance”. Homecoming is a very big deal. He will remember this forever.",
          "id": 188,
          "comments": [
            {
              "score": 43,
              "content": "His friends will also ask him why he wasn't there which will be a very awkward experience when he has to explain why.",
              "id": 189,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "and not even just homecoming but his FRESHMAN YEAR homecoming!!! geez what a psycho! i’m a mother and wouldn’t let him miss it for nothing",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "Agreed, and even if it was \"just a dance\" so what? He's not going to be a teen for much longer, let the kid have fun.\n\nYTA. Also, why is it unfair to his brother that he would go to homecoming? You're just piling on reasons to make it seem better. His brother is irrelevant here.",
          "id": 191,
          "comments": [
            {
              "score": 3,
              "content": "It’s crazy!\n\nWhy would you want a pissy upset teen that you just F’d over?  It would be awkward as hell.  That’ll turn the kids she has against her.",
              "id": 192,
              "comments": [
                {
                  "score": 3,
                  "content": "Exactly!  And what, is she going to force the younger one to stay home and miss homecoming when it's his turn? I just don't get why people get so hung up on little things, let the kid enjoy his childhood. Sh-- gets real, real fast.",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Exactly. You don't get a second go-around on being a kid, and there aren't a lot of school dances in a lifetime. I mean, I'm not gonna act like school is the most important time in a person's life, but I know I definitely hold shit like this against my parents still at, like, 26. \n\nI mean maybe it wouldn't actually be that important to him in the long run. But not being able to go is going to make it a bigger deal to him than it actually is. And I mean, why even do this? Does she just really love having a pissed kid around? What could she possibly be getting out of this?",
              "id": 194,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Excuse the ignorance by why is it important “especially to a football player”? I’ve seen a few comments saying this and am assuming it’s an American thing but can someone please explain why homecoming is more important just because he plays football?",
          "id": 195,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 290,
      "content": "YTA how is it fare for you to take away a memorable event like that away from him? This is a good way to just make him resent you and will only ruin the entire weekend for him",
      "id": 196,
      "comments": [
        {
          "score": 41,
          "content": "I have no doubt that OP won't have a good weekend either as this won't be without consequences.",
          "id": 197,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}