{
  "post content": "Would we be the a-hole for naming our baby the same name as their cousins? So my husband and I are expecting our first child and we found out it’s a boy. Ever since we were dating we had talked about having kids and naming our first son after my husband (William and calling him Liam since it was different than my husband’s nickname and the only one we really liked) who was named after his father and his grandfather (all three are William but my husband has a different middle name because his parents didn’t want him to be the III).\n\n In the last year and a half two of my husbands sisters had boys and the first was given William as a middle name. It kind of rubbed us wrong but we brushed it off because no one really remembers a baby’s middle name after the first few months anyway. Then a few months later his other sister had her son and his first name was in fact also William with the nickname Liam. Also note that neither sister asked my husband how he felt first. We were pretty upset for a long while but at the time all my husband said to his sister was a joking “hey that’s my name lol” because we both didn’t know how to react. \n\nNow both nephews have just past their first birthday. And we were hoping our baby would be a girl so we didn’t have to cross this bridge quite yet, but here we are. We’re having a hard time still letting go the idea of having our son named after my husband and his family line and no other names we’ve looked at are really something we want to settle with. \n\nSo we’re thinking of still going with our original plan since it is in fact my husbands name. It feels like the name is cheapened a bit but we still really like it for our son and our nephew Liam and his family live across the country so we’re thinking it really shouldn’t matter except for holidays when we’re all gathered and we don’t mind using Big Liam and Little Liam to distinguish the two. But we’re still afraid the family will cause us drama for the decision. \n\nWe don’t feel like it’s petty at all to use the name anyway especially with our every day circles being entirely different and the other nephew that’s local it being his middle name. Just wanted to get opinions if that would generally be considered an a-hole move or us or if it would be completely normal for us to do?",
  "id": 1,
  "comments": [
    {
      "score": 31,
      "content": "I don't get all this name hoarding.  In my Italian culture, the first born male is named after the paternal grandfather (the father's father).  So if you have a son, and grandpa's name is John, all the first born of that generation are named John, even if the fathers of these boys are brothers and thus their kids have the same first and last names. (The daughers at lease offer a different last name.)\n\nOn another note, my daughter wanted to name her daughter Grace but, nope, her husband's brother's daughter (thus her cousin) was named Grace.  So she named her something else.  My daughter's child has met the first Grace once in 15 YEARS.",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "I was gonna say the same thing! My family is FILLED with PHILS ! lol most of which are first cousins! I agree NTA",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Same here. I have numerous cousins who share the same name. They are simply referred to as John A or John B or Little John or Big John or whatever. Who cares if they have the same name? And why do people get so sensitive that someone else uses a family name?",
          "id": 4,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I don't either. My husband, brother, father, grandfather, and great grandfather all share the same first name.",
          "id": 5,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 19,
      "content": "NAH.\n\nIt's not weird for your siblings to name kids after their father/grandfather, nor is it weird for cousins to share names.\n\nYour son was never going to be the only William.",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 18,
      "content": "Go with your original plan. No one owns a name.",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 14,
      "content": "NTA.  You are naming your son after his father.  That’s your right.  Just as it was within their right to use the name as well.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "If William is your husbands father and grandfathers name…..is it also his sissters father and grandfathers name?\n\nI only ask because of your husbands comment of “that’s my name” but couldn’t she also want to honor the family line? And no one really owns a name.\nSo I’m the same way the rest of the family has full right to use this name, so do you guys",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "NTA.  I've got three cousins named Robert. Use the name that you love.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NAH - But just know, even if you plan on calling him Liam, Sheryl Crow is SURE he’ll be a Bill or Billy or Mac or Buddy….",
      "id": 11,
      "comments": [
        {
          "score": 2,
          "content": "But he won't be plain ugly to her and will have days of fun in his whole life!!!!!!!  (iykyk)",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "I think the real issue according to OP is the nickname “Liam”. Which is also the nickname of the nephew? \n\nAm i right.\n\nNTA.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH. Maybe just name him William and use a different nickname. William is a common name and if you are making him a Jr after your husband no one can really argue with that.",
      "id": 14,
      "comments": [
        {
          "score": 1,
          "content": "It's the only nickname they liked. Liam beats them all out. It's a family name, so it should be expected that this would happen",
          "id": 15,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "So do the SILs own the name just because their kids were born first? No one can “dibs” a name lol. SIL’s son could grow up and hate being called Liam and divert back to William too. You never know.",
      "id": 16,
      "comments": [],
      "relation": "No"
    }
  ]
}