{
  "post content": "My ex wife and I have a healthy relationship for the kids and for each other as adults. We have always both been great parents, 50/50 custody, avoided the \"nastiness\" we've always heard about in other people's split-ups since divorcing and have always been very helpful and civil to each other and the kids.\n\n10 years have gone by and it's been incredibly nice, peaceful, and healthy for the kids and ourselves. We all go to my son's football games together, save eachother seats at my daughter's recitals, etc; and in a word..things have been \"perfect\" for a decade until this past year.\n\nMy Ex's spouse (call him Robert) has been having some anger issues and degrading my children, calling them stupid/worthless, screaming in their faces, breaking their things, punching holes in doors/walls, etc; losing control without provocation and the children are afraid to be there, asking if they can stay with me permanently. He is not laying his hands on them, but the kids fear he will one day and I share their concern. \n\nMy daughter is 14 and my son 12 and my daughter has Googled her options and is threatening to petition the court to make the choice for them both and has asked me to support her decision.\n\nSpeaking with their mother and Robert about this, I have tried to hold my daughter's choice off more than once (while feeling awful) to give her the opportunity to sort her household perils. Each time, she has decided to make it work since he is their only provider, doesn't make much, she has no family in the state, they share 1 vehicle due to an unforeseen repair, in mid 40's starting over with a toddler and working to improve their situation, etc; I am more than sympathetic to her desperation to make it work.\n\nHe is on meds, sees a counselor (all things their mother required after an incident screaming at the kids until they were crying and shaking and couldn't even tell me legibly what had happened) but chance after chance it has not stopped and each time they they call begging me to pick them up before quickly getting off the phone for fear of being discovered.\n\nI have decided that I am telling my ex wife this weekend that I will support my daughter in her petition regardless if it ruins our co-parent progress from the last decade because I cannot let my kids think I condone what's happening or will fail them when they ask for my help **...and I feel like a HUMONGOUS asshole** for doing this to my ex wife who's in a very tough situation with seemingly no exit which no doubt makes me feel like I'm kicking her while she's down. Jesus, it feels awful to even type what's about to happen, but I fear what could possibly happen to my children if I allow it to go any longer.\n\nI've lurked here for a while and enjoyed reading everyone's posts but knew that one day I would probably be the asshole, so here it is.\n\nAm I the asshole?",
  "id": 1,
  "comments": [
    {
      "score": 3507,
      "content": "Oh gosh. You're NTA, you're a dad who cares about his kids. Your ex wife is in a terrible situation, and I feel for her. You clearly do too. It sucks, but you're looking out for your kids, and that's the most important thing right now. I think you're doing great as a Dad.",
      "id": 2,
      "comments": [
        {
          "score": 662,
          "content": "Hey op, definetly dont forbid your ex from seeing your kids, and dont give her ultimatums, just tell her to seperate her partner from the kids",
          "id": 3,
          "comments": [
            {
              "score": 316,
              "content": "I was going to suggest mom comes over to see the kids once a week or so but since they only have one car, not sure how that will work.  I'd definitely not send them back to that house ever.  Stepdad is a loaded gun and the safety's barely on.",
              "id": 4,
              "comments": [
                {
                  "score": 114,
                  "content": "I'm looking at this as her problem. If she wants to see the kids, she can visit them at the dad's house until either her partner has gotten a crap ton of help - even then only supervised visitation for awhile - or until she leaves the guy.",
                  "id": 5,
                  "comments": [
                    {
                      "score": -9,
                      "content": "That's what a responsible, loving mother would do. This woman is not that.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "A good mother would walking in the pouring rain to see them. Or at least just take the bus. Most people who only have 1 car are on a bus line.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Some cities don't have public transportation.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "How about she gets a job?",
                  "id": 9,
                  "comments": [
                    {
                      "score": 8,
                      "content": "If they have a toddler it may be better financially for her to not work so they dont have to pay for day care",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "This is what has me scratching my head.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 175,
          "content": "This says it all. NTA",
          "id": 12,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 121,
          "content": "OP would be TA if he continued to let his children be subjected to this abuse.  He needs to be more proactive in getting them out of there.",
          "id": 13,
          "comments": [
            {
              "score": -8,
              "content": "He is TA for even considering how his ex feels about it.",
              "id": 14,
              "comments": [
                {
                  "score": 3,
                  "content": "Its not her fault she literally cant afford to separate but she is trying extremely hard to fix robert if she could leave she would have already\n\nBut yes he needs to take away the kids",
                  "id": 15,
                  "comments": [
                    {
                      "score": 0,
                      "content": "The first part is irrelevant. She has failed as a mother and her two oldest kids live in fear during her visitation time. There is no \"fixing\" Robert. He is damaged goods.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "The ex is in a terrible situation, but you can't let her feelings get in the way of the kid's wellbeing. NTA.",
          "id": 17,
          "comments": [
            {
              "score": 29,
              "content": "Honestly, having the kids away somewhere safe might give her an easier time getting away herself. She can't be happy with this abusive man.",
              "id": 18,
              "comments": [
                {
                  "score": 5,
                  "content": "Yes, get the kids out of there and offer her whatever help she needs in getting out of there as well!",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -1,
              "content": "OP is TA for considering her feelings over his kid's safety.",
              "id": 20,
              "comments": [
                {
                  "score": 2,
                  "content": "Well, that's not what he's doing RN, and personally I think it's pretty harsh to call someone TA for feeling remorse at hurting someone emotionally like this, even if it is necessary.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 1,
                      "content": "If I were OP, I'd be fucking livid at my ex, someone I cared about and respected, allowing our children to be exposed to obvious abuse, downplaying it, then saying, \"oh yeah, Robert's pretty fucked up but I'm trying to heeeeelp him\". Nah, fuck her, too.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "You are advocating for your kids and they need you. They are your first priority. You realize your ex-wife needs to leave, too. Are your kids the only reason she lives so far from family? I realize she’s not your problem, but as your kids’ mother, maybe how you talk to her could help her. Your news could also work as a catalyst to get her out, too. Try to make the conversation with two parts, removing your kids from Robert’s abuse, and discussing steps for her own safe exit, which is also a way toward her time with the kids. Although Robert is going through counseling, it doesn’t mean she needs to be physically present while he works out his anger and control. \n\nDoes she have anyone but you to stay with? Maybe she needs to take an extended trip with her toddler back to her family.  Good luck, I hope she sees the sense in letting you have full custody, at least while Robert is in the mix. If she declines to take care of herself/toddler, at least you will have planted a seed",
          "id": 23,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "I mean to be fair, OP getting full custody might actually make it easier for his ex wife to get back on her feet and leave this dude. If she doesn't have 2 extra minors to look after it gives her more options. I think OP getting full custody is the best move for everyone.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "He is TA for caring about his ex-wife's feelings more than the terror his kids are feeling though.",
          "id": 25,
          "comments": [
            {
              "score": 55,
              "content": "Can't really be an asshole for that. He gave her chances because of the level of trust already established there. Not giving time for due process would absolutely make OP more of an asshole here. Could well have put the kids in even more distress too.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Ten years of no issues after divorce. Of course he is going to consider her feelings. Just because you're divorced doesn't mean you write off the other person, especially in this situation.\n\nI don't see how he's TA for considering her. Unless I missed something, I don't see him putting her well above the kids. He's taking his daughter's side. He wants his kids to feel safe.\n\nHe's NTA 100%.",
              "id": 27,
              "comments": [
                {
                  "score": 11,
                  "content": "> I don't see how he's TA for considering her.  \n\nAllow Me, or rather, OP, to explain. \n\n>My Ex's spouse (call him Robert) has been having some anger issues and ***degrading*** **my children**, **calling them stupid/worthless**, **screaming in their faces**, ***breaking their things***, **punching holes in doors/walls**, etc; **losing control** ***without provocation*** and ***THE CHILDREN ARE AFRAID TO BE THERE***, asking if they can stay with me permanently. He is not laying his hands on them, but the kids fear he will one day and I share their concern.  \n>  \n>My daughter is 14 and my son 12 and **my daughter has Googled her options and is threatening to petition the court** to make the choice for them both and **has asked me to support her decision**.  \n>  \n>Speaking with their mother and Robert about this, **I have tried to hold** ***my daughter's choice*** **off** ***MORE THAN ONCE*** (while feeling awful) to give her the opportunity to sort her household perils. Each time, she has decided to make it work since he is their only provider, doesn't make much, she has no family in the state, they share 1 vehicle due to an unforeseen repair, in mid 40's starting over with a toddler and working to improve their situation, etc; I am more than sympathetic to her desperation to make it work.  \n>  \n>He is on meds, sees a counselor (all things their mother required after an incident **screaming at the kids until they were crying and shaking and couldn't even tell me legibly what had happened**) but **chance after chance it has not stopped** and **each time they they call begging me to pick them up** before **quickly getting off the phone** ***for fear*** **of being discovered**.\n\nBecause his children are so terrified that they themselves want out, but he has given their mother \"chance after chance,\" leaving the kids in an abusive situation where they're so terrified they were \"crying and shaking and couldn't even tell me legibly what had happened\". \n\nThere's giving them a chance, then there's being complicit in the abuse.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Exactly. Robert doesn't even have that great of job. It won't be that hard for mom to get a decent $12/ hr job and struggle without him.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I disagree. It's reasonable to try to work with your ex to resolve issues and work things out rather than immediately going for the nuclear option of taking a custody case to the courts. Kids from divorcee families generally get the best outcomes when their parents share custody and don't have major conflicts.",
              "id": 30,
              "comments": [
                {
                  "score": 7,
                  "content": "[deleted]",
                  "id": 31,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I read over the OP again and I definitely see where you're coming from.\n\nWe don't get the actual timeframe, but judging from the events described it sounds like repeat incidents over a period of several months. Serious incidents too- the type that demand an immediate response of the \"this ends now, or I'm petitioning for full custody\"- type.\n\nI don't think OP is TA, but I DO agree that in cases like this, your responsibility is to safeguard your kids' best interests rather than your ex's.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "I'm giving him the benefit of the doubt since abuse like this is really hard to face and conceive of, as it's always something that happens \"to other people\". (IE, NIMBY) At least he's becoming active now. He obviously should have taken them away the first time, but at the very least him doing this will help out A LOT when it comes to gaining custody, as he can show that there were attempts made to rectify things and it still didn't work.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Robert sounds abusive and dangerous if you ask me. Please OP help her find a way out!",
          "id": 34,
          "comments": [
            {
              "score": 0,
              "content": "His ex wife is not his to save. She is choosing to stay.",
              "id": 35,
              "comments": [
                {
                  "score": 4,
                  "content": "You don't know how abuse works. \nA lot of shit happens before it reaches the situation OP describes. She is the mother of his children, whether she is strong enough to stand up for them and herself or not. \n\nThat alone would be enough reason for OP search his options to help her out, because no kid deserves to lose a parent and that's how a lot of abusive relationships end. \n\nBut their divorce was not hostile and it seems OP still care about her, in a different manner obviously. \nShe needs help out of that situation, if not for her sake, then for the sake of the children.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 0,
                      "content": "I can appreciate that and he can offer but I stand by my judgement that he is TA and ex is not his to save.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yea. You have tried to give her time to get things sorted, but you cant control her life, her decisions, or the other guys way of acting. What you can do, is make your kids feel safe, even if it may hurt the relationship with your ex. The kids come first, and if you do things as calmly as it seems you might, she will hopefully understand. It may even push her to get shit sorted for the kids as well, with a real \"threat\" of not having any custody.",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I feel for the mom, too. But I feel even more for her kids. Mom needs a wake-up call, and the ex doesn't need to hesitate to provide it.",
          "id": 39,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1846,
      "content": "Not....and I CANNOT stress this enough: NTA.\n\nJust because he isn't putting hands on them, doesn't mean he isn't abusing them. \n\n>Robert) has been having some anger issues and degrading my children, calling them stupid/worthless, screaming in their faces, breaking their things, punching holes in doors/walls, etc; losing control without provocation and the children are afraid to be there,\n\nThat is TEXTBOOK abuse. He is hitting THINGS to show that if he COULD he would hit THEM. Your children AND your ex need to not be in that situation.",
      "id": 40,
      "comments": [
        {
          "score": 349,
          "content": "[deleted]",
          "id": 41,
          "comments": [
            {
              "score": 135,
              "content": "If my partner accidentally lets the door slam, I tense up. I have to talk my self down and remind myself that no ones angry at me. If someone raises their voice even slightly at me, I’m liable to burst into tears. I’ve gotten better, but it takes a lot of hard work to stay better. Please OP get them out. If you can try and support your ex to get out.",
              "id": 42,
              "comments": [
                {
                  "score": 39,
                  "content": "Yep, dealt with a stepdad who was like that for a lot of my life. The difference was he actually saw how much his anger was hurting me, felt bad about it, and spent YEARS in therapy to get a handle on it. I still tense up and start to shut down when someone is yelling or slamming things around me, but at least my dad and I have a relationship now. NTA OP. Until this dude starts actively improving, he is harming your children for life.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Same here.  Stepdad is an alcoholic.  Alcohol turned a mild mannered,  sweet,  caring,  loving father into a fucking monster.  He never laid hands on us,  but his constant berating made life at home horrible. \nI wish I could say he's sober now,  but that's not the case,  nowadays he just doesn't drink to the point of losing it,  which is better,  I suppose... idk, I have mixed feelings about it, but as long as he's not verbally abusing anyone,  I guess he can keep his booze for now. \n\nAnyway,  he got better,  & the outbursts have stopped.  I haven't lived at home for going on 15 years,  now have 3 kiddos,  one of which is a tween. Eldest kid & husband got snippy with each other,  & it escalated to husband yelling at kid to stop yelling. I, being the only reasonable adult,  burst into fucking tears, with gasping for air, blubbering,  & hiccuping included. I could not stop,  & took hours to finally collect myself enough to interject, after having ran into my room to hide & cry for over an hour,  although at that point they had stopped,  & were shocked at my reaction.  That was the first time in over a decade that anyone had lost their shit & yelled in front of me, so I wasn't aware it was a trigger. \n\nAfterwards,  we had a sit down, & I explained where my reaction was coming from,  & why how they handled the argument was not okay,  & what to do in the future,  so as to avoid things escalating to that point. \n\nI can't believe that after this long,  my reaction to a man screaming in anger was the same as when I was a teenager. It fucks you up,  even when you think you're okay with it,  & have gotten past it.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I'm the same way. I constantly have to tell my partner that I can't help my reactions when she accidentally slams a door, or puts a pot down too loud, or makes sudden movements... I know it makes her feel awful when I freak out, and sometimes I dissociate if it's really bad, but I literally can't help it.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 5,
                      "content": "It’s bloody horrible isn’t it? I’m lucky that my partner is so supportive, and does his best to not set off any triggers. I hope I don’t sound preachy or anything, but have you tried counselling at all? It’s really helped me with coping techniques and working through things. As well as teaching me not to be as down on myself about freaking when it happens.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -14,
                  "content": "[removed]",
                  "id": 47,
                  "comments": [
                    {
                      "score": 40,
                      "content": ">There was some physical stuff in my home too, but it was only as a result of my behaviour, and because my dad can’t control his temper very well.\n\nOh honey, no. What someone else does to you is 100% their own choice. Nothing you did could possibly justify hurting a child. Intentional or not doesn’t matter, it’s abuse either way. “Emotional abuse” is a thing. A person set out to get what they wanted at the expense of another person through fear and intimidation tactics. Not everyone reacts the same to it, some are more affected than others just like with physical abuse.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "May I suggest looking at some resources that describe child abuse? TLDR: yes, emotional abuse is abuse. Hitting things to threaten a child is abuse. The behaviour doesn't necessarily have to be intentional for it to still be damaging.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "> But surely it doesn’t count as abuse if you don’t touch them?\n\nIt does. Emotional abuse is often worse than physical.  I know people who dealt with both from the same source and they all say the yelling and slamming were worse than physical violence.   The fear, the terror, the degradation, humiliation, threats, screaming, all far worse than a wallop. And can go one for hours at a time. \n\nAlso things like denying food and sleep are also abuse (actually sleep deprivation is a war crime), without being directly violent. \n\nOP’s kids are being abused by their stepdad and need to get out of there.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "There are many different types of abuse, and emotional abuse is absolutely real. Physical, sexual, emotional, forced substance, neglect, there's all sorts of types that each have awful effects on people, and there's often multiple types of abuse at once (although this doesn't mean a single type of abuse is \"better\"). Emotional abuse is effectively everything bad someone can do to another person without physically touching them. Threats, making someone live in fear or walk on eggshells, blaming them for bad things that weren't actually their fault, name calling in the extreme, insults, all of it. Humans are emotional beings, and they thrive on feeling safe and happy, as well as having a physically safe environment (this is where physical abuse and neglect would come into play), mazslows hierarchy of needs is a good way of looking at this. \n\nIn this case, the stepdad is using physically dangerous/abusive behaviour towards other objects, as a threat to the children, along with other forms of bullying and emotional abuse. The emotional abuse is awful in itself because humans depend so much on their social and emotional aspects of life, and these are children who are still developing these, so they'll possibly find it harder to get over. Along with emotional abuse which includes the threats, he's showing that he has the power to follow through with the threats, making them physically unsafe and reinforcing the emotional abuse. \n\nI don't want to bring personal stories into this, but I'm interested in you saying the physical stuff in your home was a result of your behaviour. Phrases like \"you caused this\", \"this is your fault\", \"you made me do this\", or generally using someone's mediocre actions as an excuse for very awful, very serious reactions (physical abuse, in your case) is absolutely emotional abuse. You were blamed for the things that someone else did to you, and this was wrong. If you were a child, a child's behaviour will NEVER EVER excuse an adult's abusive actions, purely because of the difference in development. Your dad not being able to control his temper DOES NOT excuse anything physical he did to you.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "My dad hit me, and my dad called me names.  Decades later what still resonates is the name calling.  Honestly, if he had hit me but otherwise been kind and supportive, we might have a relationship.  The mental and emotional abuse did far more harm to me overall than the physical abuse, and he hit me so hard once I'm deaf in one ear.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I wish emotional abuse was made up. When you’re a young person having the person who is supposed to love you and support you tell you “you’re a useless bitch and you won’t amount to anything” (word for word something my dad told me) it’s going to get to you. I mean sure if it’s something that kids at school say, you might be able to brush it off, but when your parent says it, it seeps into you, and you believe it. Despite all evidence to the contrary I still have to fight not to believe it. Especially when it’s repeated time and time again. He may not have hit me. But it was still abuse. It took a long time to admit to myself that it was abuse, that it wasn’t just Dad being in a bad mood and taking it out on me. He was trying to hurt me, but in way that wasn’t so obvious to anyone looking in.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Same here. I was diagnosed with PTSD from this from an abusive marriage. He acted just like OP's ex's spouse. Breaking things, slamming doors, punching things, and eventually he hit our son. That was the day I left. Now whenever a man raises his voice around me I immediately freeze up. These children need out of there ASAP.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Same. I still freeze anytime I feel any sort of fear. Complete catatonic shutdown. It’s the worst.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 51,
          "content": "I am so worried for the toddler OP mentions in the post.",
          "id": 56,
          "comments": [
            {
              "score": 1,
              "content": "True, I should have mentioned that child as well. 🤦🏽",
              "id": 57,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Yes! My bio father did this, the trauma treatment for the abuse was not fun to go through. It's abuse and these kids are going to need a therapist most likely.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Also, he's not putting his hands on them *yet*.",
          "id": 59,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "Right. Hitting and breaking things is an intimidation tactic. He may not be hitting the kids, but he's intimidation them as if he was. Having been in this situation, it is terrible. The person in my life stopped doing these things as soon as our therapist told them what it was, and what it was doing to the people around them. They stopped immediately. (They didn't realize it wasn't a normal way to deal with anger because their whole family does it.) If Robert hasn't stopped doing it after seeing a therapist (and it seems he's been going for a while) then the kids need to be out of that situation ASAP. I can't speak for his attitude or anything, but my guess is that he knows what he's doing, and he doesn't want to stop. Imo, the real victim here is the toddler who has no way out of this situation. At least OPs kids have him to turn to, poor toddler only has their mom. This whole story is heartbreaking.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "> Just because he isn't putting hands on them, doesn't mean he isn't abusing them.\n\nThis, a thousand times.  I grew up in a house where my father NEVER laid his hands on me, but would constantly give my mother the silent treatment for days and months on end with no explanation, punch walls, yell at us with no provocation, so on and so forth.\n\nIt took me YEARS to realize that while his abuse was never physical, it was still mentally and verbally abusive.  And that's not much better, if at all.  I've come to terms with the whole thing despite a lack of counseling or otherwise, and am extremely lucky that I'm so well adjusted despite my upbringing.\n\nBut that's not necessarily typical.  For the sake of your kids mental and possibly physical well being, (legally) get them out of this situation.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This! Whether or not the abuse is physical this is still a majorly unhealthy environment for kids to be in. Absolutely NTA for doing this if that’s what it takes to get your kids safe. Agree your ex-wife needs out of that situation too whatever the consequences but she’s an adult and that’s not going to happen till she’s ready - your kids need out now! Maybe when you talk to your ex-wife you could offer her another option though - avoiding court by her agreeing to let the kids stay with you full time until she gets her situation sorted out. She could still come visit them at yours or take them out for the day but they would be safe from her partner. That’s obviously not going to be an easy thing for any mother to agree to but I’m sure she wants them safe too and if she’d agree to that it might prevent the breakdown of your relationship and of your kids relationship with their mother.",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "99% sure \"them\" includes OP ex-wife",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "My sister just went through almost this EXACT situation and I agree. If this were my ex-BIL I would be so grateful that he'd do this for the kids. I was terrified for my sister, but I knew I could help her navigate the situation as long as he was being a safeguard for the kids. I was confident in his ability to protect the kiddos from harm and I handled my sister.\n\nNTA someone has to be there for the kids, no matter what. They have less resources to help themselves and need to rely on guardians to protect them. Anyone who rises to that occasion is doing their duty. Mom can reach out to the people around her and seek help, and it'll be easier for her if she knows her kids are safe.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Emotional abuse is so real I can’t handle people yelling, loud unexpected noises, people exploding in anger\n\nIt immediately takes me back to being a kid and having someone angrily put (slam) the dishes away at me. \n\nSeriously NTA and I can almost guarantee this guy has already psychologically fucked up your kids",
          "id": 65,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 819,
      "content": "[Text of original comment deleted for privacy purposes.]",
      "id": 66,
      "comments": [
        {
          "score": 135,
          "content": "Hell yes, so much this. OP is definitely the asshole if he doesn’t save his kids.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "She is definitely being abused too. He can't make her leave but he can be honest with her about it and offer her his support when she decides to.",
          "id": 68,
          "comments": [
            {
              "score": 0,
              "content": "He better not give those poor kids back to her.",
              "id": 69,
              "comments": [
                {
                  "score": 2,
                  "content": "If she gets out of the abusive relationship and into a stable living situation again then, yes, he absolutely should if everyone involved thinks it's good for the kids.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 0,
                      "content": "I'm talking about for the time being. What he should have been doing yesterday is going to the courthouse to get an emergency order.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I only disagree with OP cannot save her. He can research and try.",
          "id": 72,
          "comments": [
            {
              "score": 53,
              "content": "She is being abused as well. He could offer her and the baby refuge to get on her feet if he wanted to go above and beyond but his first priority needs to be getting his kids out of there.",
              "id": 73,
              "comments": [
                {
                  "score": 15,
                  "content": "Them being on good terms made me think of that too, depending on what broke them up. Helping her until she's on her feet seperate from them would do a world of help for her. Because the longer she stays with him the worse he's going to get and OPs kids are going to see the effects of watching their mom get abused every day. Might bring up some survivor's guilt down the road.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 693,
      "content": "NTA. YWBTA if you DIDN’T support her in this and let your child be abused.",
      "id": 75,
      "comments": [
        {
          "score": 105,
          "content": "Can't agree more. \n\nOP, your first duty is to your children. Not your ex-wife.",
          "id": 76,
          "comments": [
            {
              "score": 47,
              "content": "Not forgetting that his wife has the power to get herself out of this situation - the kids don't. He has to advocate for them as they can't advocate for themselves. NTA",
              "id": 77,
              "comments": [
                {
                  "score": 27,
                  "content": "I think in a slightly different situation, I would agree that she has the power to leave with the right support behind her, but if you look again at why she's staying she just doesn't have the means to leave. He is the provider, she doesn't have any family here (other than presumably the OP, her ex, and he hasn't made any mention of wanting to help her) which means she most likely feels she has nowhere to go, she'll probably get in trouble for taking the car to get away if it's in his name, and she's also probably legally tied to him by their toddler. It's so much harder than just \"she can get herself out of this\"",
                  "id": 78,
                  "comments": [
                    {
                      "score": 5,
                      "content": "That's true, it's not simple by any means. I suppose emotional and financial ties can be just as hard to break as legal ones. I feel desperately sorry for her, but the OP still has to do right by his kids.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "OP said he's the provider but not a good one so why stay? Mom would be just fine getting a decent paying job and struggling on her own but she chooses not to.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "[deleted]",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Thank you",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Amen",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "He already has been letting it go on, he admits as much. They've wanted away sooner. So I'm leaning towards ESH.",
          "id": 84,
          "comments": [
            {
              "score": 30,
              "content": "I agree. They have the new husband in counseling, but they're letting the kids stay in a home where they're being abused? What about counseling for them? They're going to need it, because it looks like people care about the mental health of their abuser more than theirs.\n\nOP, your teenage daughter isn't looking up legal options for fun. She's desperate to get out of an abusive situation. Jesus.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "And the poor children",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 360,
      "content": "NTA in the least. \n\nI say this as someone who spent their teenage years and early 20’s being screamed at, degraded, and eventually hit by my mom’s ex-husband. Your children are being abused, plain and simple. \n\nIf he’s treating the children you share with your ex like that, he’s probably treating her and their young child the same. I understand the position your ex-wife is in, and I can tell you that she will not leave him until enough is enough. Maybe your daughter following through with her threat to petition the court will be that catalyst, but it might not be. \n\nI think that you supporting your daughter is the best thing that can happen, while also being up-front and honest with your ex that the children can certainly stay with her again once it’s safe for them to do so. It’s not your responsibility, but if you’re able to offer her support in the event she does leave him, please do so. \n\nFinally, consider sending your children to a psychologist to work out their feelings regarding the abuse they’ve been subjected to by their mom’s new husband. It’ll save them a world of pent-up resentment later on.",
      "id": 87,
      "comments": [
        {
          "score": 118,
          "content": ">she will not leave him until enough is enough\n\nOp taking full custody of the kids might also help her prepare for leaving her husband. \n\n>Each time, she has decided to make it work since he is their only provider, doesn't make much, she has no family in the state, they share 1 vehicle due to an unforeseen repair, in mid 40's starting over with a toddler and working to improve their situation, etc; I am more than sympathetic to her desperation to make it work.\n\nPeople often stay with their abusers because they don't have any other means of financial support. They need to take care of their children somehow, and their abuser is (seemingly) the only one who can provided that.\n\nNow, she has 3 children she needs to feed, buy things for, take back and forth to school, etc. Even with the shared custody with op, she still has to provide half their needs.\n\nAlleviating her of that responsibility would make it so she just needs to worry about supporting herself and her baby. There's obviously other factors, but if she sees that she doesn't need quite as much financial support from him, she can gather up what she does have and leave.",
          "id": 88,
          "comments": [
            {
              "score": 2,
              "content": "I hope she does and I hope she understands that she's not a fit parent right now.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 314,
      "content": "Are you the asshole for supporting your daughter’s attempts to remove herself and her little brother from an abusive environment? No. That’s what this sounds like. Emotional/psychological abuse. The scars that leaves may not be visible, but they are real.\n\nNTA. So much so that I think you might be a little bit TA for not supporting it sooner, although I understand your reasoning. Some things are more important than remaining amicable, and your children’s safety and mental wellbeing should come first. **They’re afraid to be caught on the phone calling their dad for help.** \n\nAlso, your daughter rocks to have the strength and clarity of mind in that environment at such a young age to figure out her options and want to follow through. I hope you are ceaselessly proud of her.",
      "id": 90,
      "comments": [
        {
          "score": 262,
          "content": "I wish I had known about it sooner..\n\nThe only instance of concern I remember was the one time the kids called very upset telling me he was yelling, etc; but their mother was there and played it down very well. I honestly didn't suspect it was any worse than she told me because he was always a really good guy, as far as all of us knew.. It was odd but we have always had good communication and I trusted her the way she wouldve trusted me if the kids had ever called her about being punished, which I dont remember ever happening. Shes a good person and a great mom and always has been, but looking back I don't think she wanted me to know how bad it was (what she and the kids were going through there) because she was thinking it was fixable and was probably also overcome with shame/fear.\n\nIt was recently when Sarah mentioned petitioning the court that I knew it was more than just \"a stepdad yelling\" sometimes. We talked and she told me a lot, but still not everything. She assumed I knew the whole time because her mother knew and of course we talk..but I didn't. Even after that talk, I remember thinking \"Wow, Robert is an asshole.\" But not enough was shared that I knew just how bad he was to them. Captured enough that I knew he was an asshole sometimes but not abusive.\n\nI told their mother and gave her the opportunity to get his \"being an asshole\" under control while I hold off our daughter from doing something awfully drastic(even though I was proud of her for doing the research, but not surprised since I've always pushed her to question everything and change anything about the world that shes willing to put in the work for..and she tries, oh does she try), and told the kids that they need to tell me when something like that happens regardless of what anyone else wants.\n\nThey have been calling me to tell me and now I know its serious, spoke with their mother who broke down and told me how bad he was..the therapy, the hole punching, the time where they were crying because of how bad he was to them, how she's tried and tried and is doing her best to protect them/change him, everything. I felt for her...very seriously but also know now that he needs to go or they need to go.\n\nI'm starting with them, literally right now.\n\nP.S. I was over the moon impressed at what my daughter had researched and told her so. I'm very proud of her and her brother and they know it. Theyre both very independent and I push them to be. They also now know that I'm with them and we will get through it together, and that I'll shield them from any consequences or nonsense and help them through the entire thing. This choice originated with them and their freedom from this will be their accomplishment, (with the help they need) since even if they turned back now, I will still pursue either him/them being gone. I just hope their mother is as great of a mother as I believe she is, because if so, this will be easier and the kids will certainly be happier even if its tougher for her to pursue.\n\nThank you all so much for the outpouring of support.",
          "id": 91,
          "comments": [
            {
              "score": 74,
              "content": "Oh, I’m SO happy that you’re getting them out!\n\nThis kind of abuse can be really, really difficult to spot from the outside (and even from the inside given that mind games can make people think it’s their fault). Abusers can seem so normal and even kind, and then be something else entirely behind closed doors. It’s also hard to distinguish between a kid talking about normal “yelling” and abusive “yelling,” especially if they think you already know what they’re referring to. It makes sense that it took some time to see it, and the important thing is that you’re addressing it now and getting them out. \n\nHealing will take some time, but it seems like they’ve got a really great dad in their corner and that can make a huge difference (hopefully their mom is also able to get out with time). You’ve clearly taught them well, and just based on what you’ve shared here I have no doubt that they’ll leave their mark on the world!",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "If your co-parenting has been near perfect till now, you don't have to go to the courts necessarily because you might be able to talk to your ex about just letting the kids stay with you indefinitely until everything is sorted out (either by her leaving him or him actually managing to fix his anger issues)? (because courts and family lawyers can get expensive) \n\nBut of course if she isn't willing to let them go for their sakes then take her to court and fight her for full custody.",
              "id": 93,
              "comments": [
                {
                  "score": 20,
                  "content": "I was thinking this as well. Perhaps OP can speak to his wife and agree the best course of action for the kids, ie. to live with dad for the time being. Emphasise that mum can still see the kids, just not with Robert. And perhaps it will also take some stress out of Mum & Robert’s relationship and allow Robert the time to get some proper help and change his behaviour (if that’s possible)?\n\nBut agree with everyone that if mum can’t see that this is best for probably everyone, OP is definitely right to support his daughter seeking an alteration to custody arrangements.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Talking to your ex first is a great plan. She may in fact see the benefit of having the kids live with you full time.  But even if you can come to an informal agreement, consider petitioning the court together and having the change recorded.  It will help keep things from going haywire if your relationship with your ex breaks down badly in the future.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Might want to remove those names in that post, just a thought.",
              "id": 96,
              "comments": [
                {
                  "score": 1,
                  "content": "There are literally thousands of people named Robert Lee. “Robert” was among the top 10 most popular boys’ names in the 1970s and the 1980s, while “Lee” ranked No. 24 among top surnames, according to the 1990 U.S. census.\n\n-  https://www.fastcompany.com/40457655/there-are-literally-thousands-of-people-named-robert-lee",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "You sound like an amazing father. Even though you are not required to, it seems like a good idea to support your ex a bit too, while she is going through this. Let her know she can always visit, etc. I cannot image what you and her are going through.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Your kid seems like a clever and fearless young woman--good on her!",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "The \"I just hope their mother is as great of a mother as I believe she is\" bit got me a little. You need to understand that abuse clouds and changes people. It can make it extremely difficult to see things for how they are and make the logical and correct choice. She's still a great mother but she is a victim and is in a situation where it's very difficult for her to see clearly what the right choices are. Read up more on the psychological effects of abuse, especially for the spouses. I'm not saying it's okay for the children to stay in that, but rather that her letting them be in that situation isn't a reflection on who she is as a mother, but rather a reflection on how bad the abuse has gotten and the hold he has on her. I am 8 years out from an emotionally abusive relationship and it blows my mind how clouded I was...I could not think clearly or rationally, he completely changed my process of logical thinking. It was YEARS before I completely made it out of that fog, and I was only with him for a few months. Learning about what happens to the victims and why they stay will greatly help you navigate all this, and help your children as well. Even if your ex doesn't choose to contact a domestic violence shelter herself, at the very least you should for yourself and your children. They will have resources for classes and counseling to both help them work through their own trauma and for all of you to understand it better AND how to best support your ex wife.\n\nEdited to add: I don't want to make that sound purely critical. Everything else in the comment I replied to shows that you are an amazing person and I know you can and want to do what's best for everyone involved. They are all so lucky to have you there for them through this.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I’m glad you’re doing all this but please don’t forget about the toddler in all this. That kid needs protection, too.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Do you even need to do it legally? Can you just keep the kids with you? Sounds like kids need help now and kids need out immediately. Your ex-wife should listen to her children and think about their best interests. Why does it need to go to court anyway?",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 73,
      "content": "NTA your children are being abused by their mother’s husband. I almost want to say YTA for letting this go on for so long without doing anything, honestly, but that’s not the question. It seems as if this man is violent and as their father, you should be doing everything in your power to get the kids out of that situation. If you don’t get your children out of that situation by any means necessary ASAP, YWBTA and you would be an awful father. \n\nComing from someone who came from an emotionally abusive household, you have no idea the amount of psychological trauma he could be inflicting on your children from his abuse. Get them out of that household and into therapy.",
      "id": 103,
      "comments": [
        {
          "score": 1,
          "content": "THIS SO MUCH.  Even if the mother’s husband never lays a single finger on the children, it sounds like he is inflicting massive emotional and mental abuse that will do immense psychological damage if not addressed and treated with utmost urgency.  Please, please, please get them out of there, whatever it takes.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 50,
      "content": "Your kids come first, their safety comes first. I feel for your ex but honestly she's not your priority. If she can't understand you putting your children's emotional and physical welfare above your relationship with her, she doesn't need to be around them anyway. He's abusive, and your children need to be removed asap. Support your daughter, she may never forgive you if you don't and she is so much more important than your ex. NTA",
      "id": 105,
      "comments": [
        {
          "score": 8,
          "content": "This may even be the wake up call to make her realize SHE needs to get out, even if she will struggle for a few years.  There are always resources.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 48,
      "content": "YTA- you have known that he is dangerous for a year. Are you waiting for your kids to get beat on?\nYou put your kids first . Your responsibility is to them not her.\n\nP.S. my little sister had an abusive husband. Her story sounds very similar to the one you described.\nIt is just a matter of time before he stops hitting walls and starts in on people.",
      "id": 107,
      "comments": [
        {
          "score": -7,
          "content": "Due to Spez attempting to censor the internet I am leaving this site.",
          "id": 108,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -38,
          "content": "OP is the biggest asshole I've seen on this sub.",
          "id": 109,
          "comments": [
            {
              "score": 12,
              "content": "Have you been on this sub long? There are definitely bigger arseholes on this sub.",
              "id": 110,
              "comments": [
                {
                  "score": -10,
                  "content": "Allowing your children to be abused will always be #1 for me but to each his own.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Sure, and as far as that goes, OP hasn't done the greatest job, but he's supporting his children and doing something about it. There are posts here where parents are enabling abusers or actually being outright abusive. I would wager that they are bigger arseholes than OP.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 46,
      "content": "YTA for for holding off your kid’s choices. It is your responsibility to keep your kids safe and you pushed off your responsibility multiple times. What if a kid got seriously injured to the point of disability because you didn’t want to “rock the boat”? You should have done this a long time ago.",
      "id": 113,
      "comments": [
        {
          "score": 18,
          "content": "I am shocked at reading this and it made me very angry.",
          "id": 114,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Im shocked this dude has let it go on this long.  The first time any person yelled at my kids not named me or my wife (hypothetical, i have no kids or wife), I would take a baseball bat to his face and nuts immediately.  OP please grow a pair and get the kids out of this situation like yesterday",
          "id": 115,
          "comments": [
            {
              "score": 0,
              "content": "Thankfully in this day and age, no physical beatings are necessary. OP should not let the kids go back to their mom if it's his week and needs to file an emergency order. A police escort will help him remove his kids from that home if it is mom's time and if mom fights to get them back, he calls the police, explains the situation, the kids tell officer that they fear for their safety and kids will not return to mom's home.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    }
  ]
}