{
  "post content": "My future SIL is marrying my brother next summer and they are planning to have a child free wedding. I have about 3 other sisters and we all have kids as do most of my cousins at this point. Our family is kinda spread out over the country and my brother/SIL’s wedding is out of state for most of us. Once I found out they wanted to make it childfree I began to lose interest in going to the wedding. I don’t want to be away from my kids for a couple of days and it is just a hassle to find them living arrangements for when my husband and I are gone - especially since most of our adult family members will be at the wedding. We’d have to leave the kids with some friends. However, I get that it is her wedding and her decision so I just declined to go stating that I don’t want to leave my kids alone without any family to watch them.\n\nAfter I dropped out, my other sisters got the courage to drop out as well as they also have toddlers they didn’t wan’t to leave behind for a couple of days. Then my cousins began declining to come as well. Now it has become a huge deal in the family and caused a lot of drama. My brother has called me and yelled at me saying that I was the one who caused all the problems. I was firm when I told him I wasn’t going to his wedding unless I could bring my kids and that all our sisters/cousins pretty much felt the same way. My parents who are paying for half of their wedding are also pissed that so many family members on our side aren’t coming, they were already somewhat against the idea of a childfree wedding in the first place and have now started pressuring SIL to not make it childfree. My SIL refuses to meet in the middle and says the wedding will remain childfree, but she’s also mad at all of us for not coming. She also still expects my parents to help pay for it, which I doubt they’ll do at this point lol. I’m fine with her having a childfree wedding, I just don’t want to be a part of it if it means being away from my kids for days. AITA\n\nEdit: People keep asking why I'm mostly talking about my SIL and not my brother in the post. I know for a fact my brother was okay with having kids at the wedding, its the norm in our family and he loves his nieces/nephews. It's my SIL who wants this to be a childfree thing against the wishes of like 95% of our family and still have my parents foot the bill. My brother is just supporting her to make her happy.\n\nEdit: She has an entire 4 day itinerary planned with like 6 events that she expects to all be childfree. Are all of us with toddlers and kids supposed to swing back and forth from hiding our kids in hotels with random sitters to all the wedding activities just to keep my psycho SIL happy? And then PAY for it because she sure AF won't since our kids are our problems as she's stated to my face. ",
  "id": 1,
  "comments": [
    {
      "score": 19886,
      "content": "YTA because you don't seem to know what \"meet in the middle\" means. She wants HER wedding to be child free. You want HER wedding to not be child free. You think she won't \"meet in the middle\" because she's not changing to what you want. \n\n\nIt's super common to have group babysitting at the hotel. All your siblings/cousins can pool resources and get a few people to stay a few hours at the hotel and watch the kids. Maybe even have your parents pay for it as part of the wedding fees. \n\nIf you don't want to go, don't go...but it doesn't seem like you are trying to actually work something out.",
      "id": 2,
      "comments": [
        {
          "score": 8457,
          "content": "Yeah, I don't get how \"childfree *wedding*\" translates into, \"I'd have to leave the kids at home.\" And if OP is going to complain about spending money to bring kids to the location, they'd have to spend that money if the kids were invited. There's really barely any difference.\n\nEveryone brings their kids. A couple of cousins or family friends take turns with child care while the rest go to the wedding.\n\nTrust me, as a kid, I hated having to go to weddings. Hanging out at a hotel pool would be so much more appealing to me.",
          "id": 3,
          "comments": [
            {
              "score": 6530,
              "content": "A lot of times there’s multiple events that close family would be expected to go to, like the rehearsal, rehearsal dinner, getting ready before the wedding, the wedding, brunch the morning after, and sometimes the bachelorette/bachelor dos are right before. And it’s one thing if your kids are old enough to enjoy the pool, but it sounds like a lot of them all have toddlers. I can see why OP and others would resort to just not going.",
              "id": 4,
              "comments": [
                {
                  "score": 4407,
                  "content": "In the edits, OP points out that this is the case.  I love how people are saying that OP should compromise but FSIL doesn't seem to be compromising.  6 events over 4 days that are childfree???  There is plenty of room to compromise but FSIL isn't budging.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2632,
                      "content": "Why wouldn't the \"compromise\" be that guests with children can choose to attend only the wedding proper with appropriate arrangements made to care/entertainment the children for that?\"",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 828,
                      "content": "Yeah that’s a lot of events to arrange childcare for- and it sounds like there’s not a lot of people who can take care of so many kids. Infants are a lot of work and not really a job for a 16 year old older cousin.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 638,
                      "content": "Yeah my wedding had several events over about 4 days - the rehearsal dinner, my parents had a welcoming party the night most out of state guests arrived, the actual wedding, and then a brunch before out of state guests were heading to the airport.  If we’d decided on a child free wedding I wouldn’t have even considered pushing for the other events to be child free - it’s just too much to expect parents to find (and pay for!) a sitter out of state that often. And yeah she has a right to have them all child free if she wants but at some point you have to realize that it limits who can attend.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 373,
                      "content": "I wouldn’t leave my cat for that long, let alone my kids",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "I'm all for childfree weddings, especially if they are evening weddings because kids get tired and cranky, and it's full of grown ups. And who wants to be at a wedding where you can't relax and have fun because you have to watch your kid?\n\nThat said, I can understand not wanting to do 4 days of childfree stuff. So, just don't do them. \n\nMy friend didn't have a childfree wedding because it was her 2nd and we all had children, so what she did was SHE hired a sitter, made sure there was a room for said sitter full of toys and DVDs so the kids could enjoy themselves while the grownups also had fun. It was a great wedding.\n\nThere are compromises if people are willing to do them. If not, then there's more issues here than simply a childfree event!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "It’s funnier to me because the usual answer to these things is ‘people should just politely decline if they don’t want to go without their kids’. OP has done this and is being called an AH for it.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "If you have a wedding some people will find it hard to attend you have to accept some people won't attend.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1997,
              "content": ">Yeah, I don't get how \"childfree wedding\" translates into, \"I'd have to leave the kids at home.\"\n\n1. \"it is just a hassle to find them living arrangements for when my husband and I are gone - especially since most of our adult family members will be at the wedding\"\n2. \"She has an entire 4 day itinerary planned with like 6 events that she expects to all be childfree.\"\n\nReading is Fundamental!",
              "id": 13,
              "comments": [
                {
                  "score": 48,
                  "content": "Seriously lmao. This isn't \"find a sitter for one night\", this is a full week of activities. I'm down with a childfree wedding and tbh wouldn't want screaming children when I'm at the alter, but at a certain point you have to understand you're asking a lot of other people.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "People see what they want to see and filter out the rest.",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1474,
              "content": "> A couple of cousins or family friends take turns with child care while the rest go to the wedding\n\nAITA for not wanting to take care of 15+ children during a wedding?",
              "id": 16,
              "comments": [
                {
                  "score": 285,
                  "content": "My thoughts exactly. There are several classic AITA tropes in this story that could lead to mutually incompatible judgments if each was posted on its own from the relevant POV.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Well said",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "Sounds like a nightmare to me!",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "All under 5 yrs old. What could go wrong?  Hahahaha",
                  "id": 20,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I would rather adopt a pack of gremlins",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "My sister does that with every event... She brings the kids, pawns them off on everyone else (usually me), & seems to forget they exist.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1047,
              "content": "What on earth would make a parent go through the expense and stress of flying with children they will then have to pay to board, and then have to pay a stranger to watch, only to attend several days of events planned by someone whose attitude towards their children falls somewhere between dismissive and hostile? \n\nI'm glad you had fun at hotel pools and all, but do you understand that not everyone has the ability to mint our own money? Good lord!",
              "id": 23,
              "comments": [
                {
                  "score": 29,
                  "content": "Especially with toddlers...that's nonsense. OP is totally NTA.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 636,
              "content": "I totally agree with this if you gave older kids, but babies and toddlers? It’s just easier to stay home",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 479,
              "content": "Ok so I did an internship in a daycare and oh boy it‘s hard to take care of several toddlers. I wouldn’t spend money on a trip to a wedding where I‘d have to take care of so many kids and toddlers. Even if they take turns with child care it‘s just not worth it.",
              "id": 26,
              "comments": [
                {
                  "score": 15,
                  "content": "I'm a former preschool teacher and worked in the nursery and toddler room for many years. Toddlers can absolutely be difficult to take care of. You would realistically need set activities or a schedule to keep them entertained. So snack time, then a little coloring activity, then dinner time, then a movie, then another activity, bedtime, etc. Unless you hire a professional I think they'd be pretty stressed out.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 8,
                      "content": "And can you imagine having to arrange all of these activities in HOTEL rooms?\n\nI remember watching 25 kids between 2 of us. But we had a yard, multiple play rooms, multiple TVs, and they were all friends already so it was just make a constant loop to make sure everyone was ok. \n\nI remember watching just 2 kids in a hotel (it had an indoor water park and the parent didn't want to follow their kids on vacation) and when we couldn't be in the park keeping those two occupied was sort of miserable.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Her kids are a bunch of toddlers. When my son was a toddler, it was 10 kinds of hell just taking him to the mall. \n\nThe amount of stuff you need to carry for emergencies. And kids don't just behave nicely when it suits you. \n\nAsking a family to drop their kids for days is ridiculous. And finding babysitters in another state is not something you can snap your fingers and do. \n\nWhat if the kid cried the whole time away from their parents? I feel like none of ya'll actually raise kids.",
              "id": 29,
              "comments": [
                {
                  "score": 6,
                  "content": "Apparently some people just have easy kids. My two are like your toddler. We barely bring them anywhere.",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1503,
          "content": "I don't agree with your decision here. The question is specifically about whether OP should have told her sister she wasn't coming because it was childfree. The answer to that is \"No\" because that is her prerogative, just as it is the bride's right to say that it's a childfree wedding. The fact that so many people then dropped out for the same reason is not really on the OP.\n\nNow, the seeming belief that \"meet in the middle\" means that the bride should kowtow to the OP's needs is problematic (and that is an asshole move) but there is no indication that this belief has been shared with the bride (like how having racist thoughts isn't the problem so much as vocalising and acting on them).\n\nHowever, this also seems to be a case of not reading the room. So many people have dropped out that perhaps the bride who look at what arrangements are made available for babysitting. At the end of the day, we are in a pandemic and restrictions are in place one way or another.",
          "id": 31,
          "comments": [
            {
              "score": 926,
              "content": "If we’re talking about reading the room, we should discuss OP’s attitude to her SIL.  It’s normal to want a kid-free wedding because some receptions are totally inappropriate for kids and because weddings are boring for small children.  If OP doesn’t want to go, whatever, but she’s adding things about her parents withholding money for her brother and SIL based on her decisions and then laughing about it. It’s not funny; OP is an asshole.",
              "id": 32,
              "comments": [
                {
                  "score": 842,
                  "content": "I also noticed- with all the people dropping out that OP cited- it sounds like 10+ small children that would be added. 1 or 2 kids might leave wiggle room, but 10+ kids makes it a kid centric wedding. Multiple kiddie tables, different menus, decidedly pg partying.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 487,
                      "content": "And when you think about the fact that a lot of vendors don’t differentiate between adults and kids it’s a lot more money. Also, they may have already hit their venue max guest list. So to be able to afford and accommodate all those kids they would need to uninvite people. \n\nThis is also not taking into consideration what’s SIL family and both their friends family situations are like. If they also have lots of kids which would push the guest list even more. It’s not like they can open the brothers family for kids and not the rest of the guests.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Multiple toddlers too, and we have no idea how these kids behave.  Could be the wedding is child- free because the sil's experience with the kids is a bunch of little hell- raisers who'd only ruin the event.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 787,
                  "content": "In her update she calls her my \"psycho SIL.\" Why exactly is she a psycho? Cause she doesn't want the entire tone of her wedding changed by having children there? \n\nOP, YTA 100%",
                  "id": 36,
                  "comments": [
                    {
                      "score": 603,
                      "content": "Take a peek at OP’s comments.  She calls her SIL a “gold digging ho” and hopes that because of this she won’t want to join the family.\n\nOP is a mean girl and an asshole.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 236,
                  "content": "I got the same tone from the post. There's some other reason OP doesn't like SIL. She tries to make it sound neutral, but she slips a bit, especially in the last edit where she calls SIL a psycho...",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "yep, op is triyng to force her will on anothers wedding to get her way. this isnt about children, this is about power",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "I agree. I noticed how she said \"lol\" about the money and I thought that was an AH thing to say as well. Sounds like she doesn't like her SIL and doesn't want to go. How sad for the brother.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "This. she is so cavalier about indirectly ruining SIL wedding. Like oops because of me no one wants to go and now their going to lose part of the funding for her dream wedding HAHAHAHA she should've catered to me and my crotch goblins!  Serves her right! \n\nOp wouldn't be the asshole if she was truely remorseful that her inability to attend caused this chain reaction and tried to help encourage others to go if they could make it work. But op seems to think she's justified in her self righteous indignation.",
                  "id": 41,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "OP is gathering allies for her argument who aren't here to defend their side. That's a bit of a red flag.",
                  "id": 42,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 105,
              "content": "\n>(like how having racist thoughts isn't the problem so much as vocalising and acting on them).\n\nWell...",
              "id": 43,
              "comments": [
                {
                  "score": 15,
                  "content": "Yeah uhhh what was that??",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "(like how having racist thoughts isn't the problem so much as vocalising and acting on them)\n\nWhat does this mean and how is it relevant?",
              "id": 45,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "OP needs to understand that Sister is allowed to have a child-free wedding; Sister shouldn't be surprised that people with kids might choose not to attend.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 871,
          "content": "Really? Declining to go to the wedding IS the compromise. I feel like people suggesting taking the kids and arranging child care (even if they are able to get this magical, somehow cheaper group rate) have no clue how much child care really costs. Also, factor in the cost of having to get a larger or second hotel room to bring your kids.\n\nWeddings aren’t as important as bridezillas like to think, especially now during a pandemic. OP made it seem like the bride isn’t so much upset that her future husband’s family won’t be there to share their “special” wedding week of events, but that the parents may not pay for some of the wedding expenses.\n\nDid OP go around and arrange a group shut out? Not likely. OP made it sound like other family members heard about her dropping out, realized, “hey, I’m allowed to do that, too”, and made the choice on their own.\n\nUnless I’m assuming that OP is lying about all of that, they are NTA.",
          "id": 47,
          "comments": [
            {
              "score": 459,
              "content": "I am 100% on board with child free weddings. Your day, your deal. Some people might have to decline due to logistics. Thems the breaks.",
              "id": 48,
              "comments": [
                {
                  "score": 318,
                  "content": "This is where I'm at.  Traditional wedding:  Everybody comes.  Childfree wedding:  Fewer people come.  You have to be OK with that simple truth if you want a Childfree wedding.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 229,
                      "content": "Absolutely. Your friends with kids pressuring you or sneaking them in? ASSHOLES. Your friends with kids simply declining and saying 'sorry we can't make it work'? Very understandable. That comes with the decision.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 42,
                      "content": "Maybe I'm old and cranky, but a multi-day affair where I have to either leave my kids at home with a non-family sitter, or arrange for a sitter in a place I don't live sounds like enough hassle that I would decline as well.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "> Some people might have to decline due to logistics. Thems the breaks.\n\nThis is the key. She can set her parameters, fine, but don't be an asshole if people decline then.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "It really comes down to expectations and who you expect to attend. If I had a family full of people with little kids I sure wouldn't expect them to attend my out-of-state child-free wedding.\n\nIf I were 20 and none of my friends had kids and I didn't particularly want my weird older cousins to attend anyways, then a child free wedding would totally make sense.\n\nYou don't get it both ways. You can either have the big family wedding that EVERYONE attends, or you can have a wedding that specifically dis-invites a portion of your family.\n\nOr you can do what regular gown ups have been doing for centuries: Have a family wedding and reception and then a party for your actual friends a day or two after or before the wedding.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Really surprised at the amount of Y-T-A in this given it seems an obvious NTA . Sure OP ‘could’ work it out, but yeah to me it sounds both expensive and complicated, essentially during a pandemic.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I just don't understand how weddings became such a pain in the ass for everyone involved, like it's supposed to be a celebration of families coming together, not huge debts and fights about guests. Like when I hear someone close to me is having a huge wedding I'm happy for them but it also gives me massive anxiety at this point because SOMETHING always goes wrong lol. I've been a bridesmaid in like 5 weddings so far (which doesn't even include all the times I was a flower girl), and none of them were perfectly executed ordeals.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 536,
          "content": "Who would bring their children to a wedding or a hotel to be watched with a group of other kids during a freakin' pandemic?  This is assuming they can afford to travel with their children and the children are all young enough that they aren't missing school.",
          "id": 56,
          "comments": [
            {
              "score": 143,
              "content": "I've been to two weddings where people did just that -- the kids were greeted as \"special guests\" and ushered to a separate room where they ate kid food and were entertained almost like a fancy birthday party.   They had a blast and got to spend quality kid time with their relatives and new friends.   \n\n> This is assuming they can afford to travel with their children and the children are all young enough that they aren't missing school.\n\nI can't remember the rhetorical term for this but...you are invalidating your own answer by saying that taking children is too problematic in the first place.  So why the object to a kid free wedding?",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 502,
          "content": "Just wondering, if the wedding is out of state and all\nFamily would be at the wedding, who exactly is supposed to watch the kids? Lord knows we don’t want strangers watching our children! It’s just not safe.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 486,
          "content": "except, OP didn’t throw a fit. she politely declined to go and now people are mad at her, including SIL, for everyone else with kids following suit. so SIL doesn’t get to be upset that the family she’s marrying into, which seems to have quite a few young children, isn’t going to the wedding due to her choice. if you choose to have a child free wedding, you take the risk that those with children won’t be able to accommodate. according to OPs edit, this isn’t a one night event where the kids will be with a stranger at home or in a hotel. this is FOUR DAYS worth of wedding activities that OP and others would have to find childcare for. depending on the age of the children, that is a ridiculous ask to then EXPECT everyone to cater to. OP is NTA.",
          "id": 59,
          "comments": [
            {
              "score": 43,
              "content": "I simply would not travel out of state for 4 days when my daughter is a toddler, in a pandemic. First of all, I’d have to quarantine afterwards so I don’t take the risk of getting her sick and thats almost 3 weeks without my baby. Absolutely not. My best friend’s wedding is childfree so my partner and I are finding alternate arrangements for her...but her wedding is a one day event 45 minutes away.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 419,
          "content": "There is no 'meet in the middle', either the wedding is childfree or it's not. You can't have it kinda be childfree. OP doesn't want to traipse across the country with her kids if she's going to have to dump them off on babysitters, and she doesn't want to have to leave them behind, either. She's NTA. This is one of the risks if you decide to have a childfree wedding. \n\nAlso, I'm kind of side eyeing the suggestion to just do group babysitting at the hotel, some of these children are toddlers and aren't going to do well with that.",
          "id": 61,
          "comments": [
            {
              "score": 52,
              "content": "Spot on. OP is NTA for declining a party invitation.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "After a few hours, my toddlers werent that great with my father, who they LOVED, and would cry because they missed us, and I'm an asshole because I dont want to leave them with strangers for multiple days.  OK SURE.",
              "id": 63,
              "comments": [
                {
                  "score": 24,
                  "content": "I feel like a lot of people commenting here have zero experience with toddlers, haha. They are like tiny tyrants.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 14,
                      "content": "OP's husbands entire family is invited, so who is going to watch the kids if all the family members are attending the wedding?  Oh ok we are supposed to get multiple strangers to watch our kids.  Sounds good!\n\nI cant believe the top comment is still Y T A.",
                      "id": 65,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 307,
          "content": "So let’s say there are 8 kids, who takes care of 8 kids during the ceremony? The reception? Someone is missing the wedding itself, dinner, speeches, dancing, etc. who is volunteering for each of these shifts? I can’t imagine anyone who goes to the wedding wants to miss the wedding to watch what sounds like a hoard of children.\n\nI’m childfree and would definitely have a child free wedding. I also realize that means my friends with kids might not come. It’s like having a destination wedding and being mad people can’t afford to go or get time off- that’s life.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 294,
          "content": "Where meet me in the middle comes in is that SIL is pissed that no one is coming and she still wants it child free. Its her call to have it child free, but it isn't her call to have all the relatives attend, and to have OPs parents pay.",
          "id": 67,
          "comments": [
            {
              "score": 5,
              "content": "Well, we only have OP's word on how the bride is reacting. And OP has been calling her a variety of insults in sub comments. It doesn't sound like she's giving a particularly unbiased account.",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 252,
          "content": "In her edit, this SIL expects multiple days of events that would be child free. As a mom of toddlers, I wouldn't want to have to go to a different state, and leave my child with random strangers to babysit. Yes it's her wedding but OP, her sisters and cousins all have rights to decline. At the end of the day leaving your child with a stranger, plus the extra costs involved, plus having your toddler in a new environment (hotel and what not) is pretty disruptive to there routines. \n\nI'm sure if it was a one night thing, a group babysitter would be fine but as it's not, why should she pack up her  kids to go. Why anyone should go if they have kids.",
          "id": 69,
          "comments": [
            {
              "score": 7,
              "content": "Agreed,  with young children,  you couldn't pay me to do this.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15747,
      "content": "NTA: People are entitled to a child free wedding, but they also have to understand that it's not going to be realistic for most people to leave their kids for days (especially young ones). This should have been an anticipated consequence of a child free wedding. Your SIL shouldn't have to change her childfree wedding but she also doesn't get to be mad at out of state parents for not coming.\n\n\\*edit\\* Wow. Thanks for the awards. Who knew common sense was so popular?",
      "id": 71,
      "comments": [
        {
          "score": 6454,
          "content": "I can’t believe I had to scroll so far to find this comment. An invitation isn’t a summons. If not taking your young children isn’t a viable option then you’re fully allowed to decline. NTA.",
          "id": 72,
          "comments": [
            {
              "score": 2057,
              "content": "Right, I was like jesus, how far to get to this",
              "id": 73,
              "comments": [
                {
                  "score": 2268,
                  "content": "I'd be willing to bet that the majority of the \"YTA\" comments are from people who are childfree and have no idea what actually leaving your children behind entails.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 1748,
                      "content": "The more I read this sub the more I think most of this sub hates children. \n\nI'd personally go for NTA or NAH. I can't believe the most voted comment is a YTA.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 313,
                      "content": "Yep. We have 3 kids and all of our relatives are 6-9 hours away. There’s nobody who could watch them for that period of time where we live, and I absolutely would not drive all that way to have a stranger watch my kids. And what happens if you drive all that way with your kids then the stranger backs out for whatever reason? If it was a child-free wedding I would have to pass.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 65,
                      "content": "I’m betting the same, Rhody.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "No. The majority of the YTA comments are more likely from other bridezillas who pull this exact, entitled multi day destination wedding event crap and then are stunned when ppl with children can't or don't want to attend *their special day!*\n\nHave a childfree wedding, but expect parents to decline and don't be a twunt about it.\n\nLet's please stop acting like childfree people were never once children themselves and grew up in a vacuum devoid of any children, and aren't siblings or aunts/uncles. . .you don't have to have your own kids to understand the logistics of having them and how a situation like this is not practical.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "As a child free person, not necessarily. Children are expensive and a burden that isn’t worth the joy for me, so I completely understand how much effort goes into a child and dragging them to events, arranging babysitting, etc. OP is NTA at all for this and that top comment needs to not be the top comment. \n\nSIL is a solid bridezilla. She wants her CF wedding and everyone there as well, no compromise. That’s not how this works. I am doing a CF reception, and if someone can’t make it due to children, I completely get it because that’s what comes with a CF party. SIL could have easily allowed children at most events and made just the wedding and/or reception CF and no one would complain. Or she could offer childcare. I’ve seen people hire professionals for the day so that the adult family can enjoy the party. She just sounds difficult",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I'm childfree and still think NTA. The bride should have expected that a lot of people will drop out with her plans. It's not just a one afternoon/evening local wedding where parents would be close to home and would need a babysitter only for a few hours, it's a 4 days+travel events with 6 childfree activities. This obviously wouldn't fly with a lot of parents especially parents with young kids. The couple can decide the ground rules of the wedding and the invited people can decide if they want to attend or not a wedding with those rules. The bride shouldn't throw a hissy fit. It’s the same if someone can't attend because the date is wrong for them or their health would make it difficult to attend. It's not the end of the world if someone can't attend (nowdays a big % of people have more than one wedding anyway.). \n\nIn my country babysitters aren't really a common thing. People generally don't feel comfortable leaving their kids with strangers, only with family or close friends and with friends generally they leave kids for like 2 days. Here people don't exclude kids from family events, because the kids are family too.\n\nFor ex. if it would be my wedding it wouldn't even come to my mide for a second to have a childfree wedding. Here when you invite someone to a family event, you invite the spouse and kids too. \n\nAnd though I don't want kids if I would be in OP's situation I wouldn't attend the wedding either. I wouldn't leave my kid home several hours away from me with a stranger/sitter (Family is at the wedding. And wich friend would take my kid in for 5 days just so I can attend a wedding?) especially not for days,  and I wouldn't bring the kid along either because it would be a lot of money thrown out of the window (travel expenses etc.) if they can't attend and still wouldn't want to leave my kid with a complete stranger/local sitter so I can attend the bride's activities. And if I skip everything to watch my kid why should I go? I can do that at home too. Even if I'm ok with leaving the kids with a sitter and have a trusted, long-term babysitter who is willing to come along to watch them during the wedding that would be a fortune. And going alone to a several days long family event while my partner is home with the kid don't feel right, and it's not even an option for single parents. Way too much hassle for a wedding even if it's my brother's.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "And definitely have never worked in childcare. “Hire a sitter” for 3 overnights? I do you how much I would charge for that (hint: not cheap). I would have to have such a good bond with the kids and like the family a lot to even think about it with kids the age of OP’s.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "It’s like they weren’t kids themselves. I remember being dragged to a hundred different events until I was old enough to stay at home alone. Weddings, graduations, religious ceremonies, parties. Constantly. \n\nOnce I was old enough to watch myself it flipped into me wanting to go to events while parents didn’t. So I’d go as the family representative. \n\nI can only imagine what baby sitting would have cost for all of those events I’m positive my parents didn’t want me at and I also didn’t want to be at.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "As a CF person I literally don’t get expecting people to leave their young children for 4 days (on and off or not) especially in another state. I personally wouldn’t like either of the options in the top comment. That said, I think the verdict will depend on if OP instigated the others leaving or just inspired it.",
                      "id": 83,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 451,
                  "content": "I’ve seen so many people say she could just bring her kids with her and sit out the events— did they all miss the part where is is a wedding far from their house? Who has the money these days to tote their kids on a trip and then spent several days just watching your kids in a different place while your family gets to partake in all the events. Honestly I’d have to say ESH— the SIL *and* brother for being completely not understanding of their family’s situations, and OP for placing the entire blame on the SIL and essentially propagating a boycott if her brother’s wedding. If any of these adults could sit down and just talk about where they’re coming from they could probably work out something better than this mess.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 259,
                      "content": "Someone else brightly suggested that OP could just go alone, nevermind that she mentioned not wanting to leave her kids, plus a lot of people don't want to attend weddings without their SO!",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I don't get the feeling that op is \"propagating a boycott\" - she was just the first person to be like \"Yeah no this isn't going to work for me\" which gave other family members the courage to speak up for themselves too. \n\nAt the end of the day, you're asking a lot from people (financially, emotionally, logistically) to leave behind their kids for a few days and travel out of state. It's similar in my view to people who have a destination wedding. Like, that's your right but you can't be mad when people cant attend because they can't afford to take time off, buy plane tickets, get a hotel room, etc.\n\nEdit to add: NTA",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 290,
                  "content": "Reddit hates kids and ~breeders. Usually it's \"your invitation, your choice,\" but not if you have icky crotchdroppings.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 41,
                      "content": "Lol! This comment exactly! Too many people on this site who hate children. She has every right to say she isn't going and the bro and SIL are just mad and looking for a scapegoat for their decision.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Im child free and still agree it's nta.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Ugh, I don't know what it is about those terms, but I really do not like them. I've visited r/childfree before and the disdain they have for people who have kids is mind blowing. People with kids suck sometimes and if you don't want kids, people should respect that decision and not be passive aggressive or judgemental about it. But it needs to be a two way street.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "The top comment made me lose a little faith in humanity. Regardless of the personalities or expectations of sil and op, there are no rules to attending weddings and a multi day wedding extravaganza (let's leave the state of the world to the side for now) which would involve travel, days off work, finding random babysitters at an extra cost, is just ridiculous.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 494,
              "content": "Exactly! OP can choose not to go to the wedding because they don't want to leave their kids for so long. How does that make them the AH? A multiple day child free event far from home is not easy for parents with young kids. That said, SIL and brother have every right to stick to their plan of having a child free wedding. They just can't expect everyone to show up",
              "id": 92,
              "comments": [
                {
                  "score": 243,
                  "content": "In another comment a person told me they didn’t understand why people with kids were all about their kids and families and that I needed to get a life because I stated I would not leave my kids for several days to go to another state.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 188,
                      "content": "And in the same vein, they bitch about how parents need to step it up and raise their kids right so they don't turn out to be assholes. You can't do that if you aren't prioritizing your kids.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "Quite frankly I sometimes go to our work summer party because I think I shouldn't be so bah humbug.  After an hour I think this is so dull. Even though I have gone home to the wife and  kids every night after work for the last six months, I regret not doing it that night as well.",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 28,
                      "content": "“Why do people with kids spend so much time with their kids?”\n\nI’m no expert, but I think it’s because small children are incapable of doing pretty much anything on their own...",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 349,
              "content": "Yeah, I don't know what's wrong with people on here today.  The only way this person could be the asshole is if they'd actively convinced the whole family to boycott the wedding in an attempt to let their kids come.\n\nNTA.",
              "id": 97,
              "comments": [
                {
                  "score": 21,
                  "content": "Reddit, which still skews slightly towards the demographic of sad lonely young men in their mothers basement, isn't big on kids in general.",
                  "id": 98,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Apparently there were some comments and edits from OP calling SIL rude remarks indicating she simply does not like her, and laughing the wedding is ruined (maybe instigating? Idk)... they have been removed because people picked on her poor attitude and thus lead to the YTAs",
                  "id": 99,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 283,
              "content": "There is a large population of teenagers, militant child free people, and utter primadonnas on this site, so while I’m disappointed, I’m not really surprised",
              "id": 100,
              "comments": [
                {
                  "score": 42,
                  "content": "Not all child free people are this militant, I'm child free and totally on the NTA side for OP, who have every right not to attend the wedding IMO. It's also not OP responsibility if other family members decided to decline the invite. SIL is just using OP as a scapegoat because her plans to get her way aren't going how she wants them.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Definitely, there are plenty of normal child free folks, it’s just that there happens to be a loud group of angry child free people on this site",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "I'm \"militantly\" child-free, who had a child-free *ceremony* but any children that were brought were attended to by a babysitter with a Switch and toys farther inside the venue, and were let out the moment the ceremony was over. \n\nI totally understood that some parents couldn't leave their kids and work for a day or two to attend a wedding, and held nothing against anyone who couldn't or didn't want to attend because of it 🤷‍♀️",
                  "id": 103,
                  "comments": [
                    {
                      "score": 14,
                      "content": "You dont sound militantly child free. That would be a person who hates the idea of children in general and thinks they shouldn’t be brought anywhere. Think like how people describe a militant vegan- “You’re all murderers if you eat meat!” If you were militantly childfree, you wouldnt have been so understanding to people at your wedding because you would find children and accommodations for them worthless.",
                      "id": 104,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "I wouldn't consider you \"militant\" at all, just confident in not wanting children and able to set fine boundaries. There is nothing wrong with being child free, or even having a more child free wedding situation than you did, and I say this as someone with kids. I'd grant you a giant \"Reasonable Human\" stamp of approval, lol",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "It’s very frustrating at times. I tried to see something from a different perspective the other day and said something like, I understand OPs frustration but can you imagine the parents POV in this situation? And I got ripped a part. Gotta remind myself I’m talking to children half the time.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 36,
              "content": "It's now the second comment, but the top is still Y T A. \n\nWTF. People are 100% allowed to have childfree weddings, but they need to be prepared for people with kids to not be able to come. \n\nAll these comments are like, you don't have to leave them at home. You can bring them with you and pay for a babysitter in the hotel room! Not my idea of a family-friendly trip. How anyone could be expected to take off work, pay to travel to this wedding with young kids, then pay a babysitter to sit in the hotel with the little kids. Absurd.",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "Because there are way too many child free people lurking here... OP is so NTA for this, honestly. If SIL wants a child free wedding, she can’t complain about people with kids who live several states away not showing up. A wedding is either a celebration of an important milestone with the entire family or a party for “your most special day”. You can’t have it both.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Right? I can't believe these responses either. It's an invitation. You don't have to go and I've declined invitations for lamer reasons. OP is NTA for declining to go.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "My wife and I had a child-free wedding and knew from the get go that it would eliminate some people from attending.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "If it was local and you had the resources to use a sitter you know and trust for one night I would call you TA for not trying to go. However, going out of town for a few days and leaving your kids with someone who isn’t a family member is stressful and expensive, and you should be EXPECTED to do it, it’s a choice, and you chose to say no. If other people are also following suit, that’s 100% their choice that they are entitled to make.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Miss Manners says that any couple who has a child free wedding should pay for on-site babysitting for all child-free events. She also says that it is never bad etiquette to decline an invitation. OP is NTA. I’m also amazed at the audacity of the bride’s demand that family fly in from out of state for a four-day celebration that they presumably pay for out of pocket. I would decline this invitation because of the expense.  \n\nUltimately, this is a question of boundaries. OP doesn’t want to attend a child-free wedding. SIL wants to have a child-free wedding. Both parties have agency. Neither has the right to make demands of the other. SIL has no right to blame OP for others’ choices or to insist that she change her plans. OP needs to exit the discussion and let everyone else figure out what they want to do. She declined the invitation. Now decline the invitation to argue about it.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 817,
          "content": "I agree with you and say NTA. I was quite surprised there are some many YTA comments. I mean, with a type of wedding that inconveniences people, you gotta be prepared for when people say no. Such as a child-free wedding or destination, not everyone can drop everything for your wedding.",
          "id": 113,
          "comments": [
            {
              "score": 497,
              "content": "Most of the YTA judgements I've seen have been more about her attitude than about actually not going.",
              "id": 114,
              "comments": [
                {
                  "score": 61,
                  "content": "Which irks me because that's not why they were asking if they were the AH. OP also says that they were blamed for so many people dropping out, their brother even called them up and yelled at them. Honestly I'd be pretty peeved about that too, although I will admit that some of OP's comments towards SIL are uncalled for. But it's not like they were calling up SIL and saying that to their face. They don't have to like their SIL and they're certainly NTA for declining the invite. Brother and SIL have to accept that when you put restrictions in your wedding like childfree, that's going to prevent some people from being able to attend.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 38,
                      "content": "I'm planning a childfree wedding, and trust me, I completely understand that people might not come because of that, especially if it's out of state for them. I also agree that it's not the question that was posed and that they are very much NTA for simply not going to the wedding due to childcare, especially with it being a multi-day event. The brother and SIL do not have the right to be mad about OP not being able to go.\n\nHowever, I do have to wonder how many of the people dropping out are honestly because of OP. She made it clear that she just didn't want to attend without her kids there and I wonder how much she may have influenced some of the other family members who also dropped out of attending. Not saying she 100% did, ofc, just that the way she talks about the wedding and SIL, the way she says \"my other sisters got the courage to drop out as well\", and that she told her brother \"that all our sisters/cousins pretty much felt the same way\" makes me think there may be some behind the scenes stuff she conveniently left out.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I really, really wish that the mods would make a rule that people give their judgements on the question asked, but they won't :( A person can write an essay about their situation, but a one-off line can have people screeching YTA at them and that'll be the judgement.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I think a lot of the YTA judgments were also factoring in OP’s comments about the SIL being a “gold digging ho,” making fun of her for being a receptionist, and saying she didn’t want her in the family.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 114,
              "content": "This sub is pretty skewed towards being pro child free. Not surprising at all.",
              "id": 119,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 93,
              "content": "I think(actually hope) the Y-T-A's are before OP made the edit explaining this was a multi-day event. NTA.",
              "id": 120,
              "comments": [
                {
                  "score": 35,
                  "content": "Even if it wasn't a multi day event, it is out of town in another state. That is still overnight.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 585,
          "content": "Yeah I can’t believe the amount of people saying hire a service. \n\nIn April I’ll have two under two and no way in hell I’d leave them with a stranger. Idgaf how qualified they were- small children like that don’t have a voice to tell me if something went wrong or if they weren’t cared for properly. \n\nI sure as hell wouldn’t leave my kids for days out of state and with a stranger no less.\n\nNTA op. Kids come first period. It’s totally cool to have a child free wedding! It’s also totally cool for those with children to put those children first.",
          "id": 122,
          "comments": [
            {
              "score": 203,
              "content": "I don't have kids, but, if for some reason I said my wedding would be child free(sibling and friends all have kids who I love so not happening), that's on me. Quite frankly, even if kids are invited but they can't come because they just can't transport the kids, also not an issue.\n\nI know couples who use a local wedding as an excuse to find someone to watch a group of kids so they can have a night out(I think it has been a long term babysitter for a couple of the families), but I can't imagine them leaving their young kids behind for an extended period of time for a family wedding. You can't even leave the kids with grandma and grandpa at that point.",
              "id": 123,
              "comments": [
                {
                  "score": 92,
                  "content": "Yeah I can understand a local wedding for a night, totally. \n\nI wonder if those voting y t a have kids. I don’t want to be out of state away from my baby childs for days lol. \n\nAnytime my husband and I get a date night or my 1 yo spends the night with his aunt, I end up saying, “I wonder what big boys doin” like 13 times and I always hope he’s awake when we get back cause I miss him lol. Maybe as he gets older I’ll be more comfortable/eager to have a break.",
                  "id": 124,
                  "comments": [
                    {
                      "score": 18,
                      "content": "The only time my husband left our daughter (just turned 3) overnight, we were eating at a nice restaurant and checking in on her baby monitor on our phones to make sure she was sleeping okay. She was with my mom, lol.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I don't have kids either, but I've never understood why some people make such a big deal about having weddings be kid-free. Frankly every wedding I've been to with kids has been WAAAAAY more fun than the adults-only ones.",
                  "id": 126,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I've got 3-going-on-4 kids, there's no way in hell I'd travel for a child-free wedding.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Exactly.  I'm convinced 80% of Reddit are under 25 and think you can order childcare like you can GrubHub or Uber.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "The last service I used (pre-covid, with post-toddler children) cost me $24 an hour. Who can afford to pay that for 4 straight days?? Even if I had a live-in nanny I would not feel comfortable leaving young children at home for multiple days.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "And, to all those people thinking leaving our children with strangers is such a viable option: we did not have our children just to leave them with strangers.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 428,
          "content": "[deleted]",
          "id": 131,
          "comments": [
            {
              "score": 349,
              "content": "I swear some people on here will become contortionists just to be able to justify a YTA. I was fully expecting a different story as in it's a 3 hour wedding across town and they hired babysitters at the hotel.  Then I would have felt differently. But out of state and 4 days of childfree activities.  WTF wedding is this?! I don't even have kids and I would borrow someone else's just for an excuse not to go to this bs.",
              "id": 132,
              "comments": [
                {
                  "score": 147,
                  "content": "Right!?!!!  They are getting married not being coronated.  Who needs four days?",
                  "id": 133,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Plus, who the hell have the money for a 4 day celebration but can't afford to make sure the children in the family are in a safe distance from their parents so they can still see them when going back to the hotel and in good hands?",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I have been seeing couples give a full itinerary of events for a wedding weekend in the last couple of years.  I don’t get it, but meh.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Some people commented before the edit, but you also apparently have people who think that edits shouldn't count, which annoys me.",
                  "id": 136,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Exactly! I could see going over night for a wedding, but more than that is asking an awful lot! 4 days! I am not leaving my kids for four days for a wedding in the middle of the pandemic.",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "[deleted]",
                  "id": 138,
                  "comments": [
                    {
                      "score": 7,
                      "content": "A four freaking day itinerary planned out with events each day.  FFS There are probably outfit requirements too.",
                      "id": 139,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 205,
          "content": "I feel like this is similar to destination weddings. If a couple wants that, more power to them, but don't expect anyone to be able to come. I know a couple who were planning to get married at a rather expensive resort(planning on hold because of the pandemic), and I flat out said I wouldn't be able to come when they directly asked me. Apparently, a lot of people said similar things and they were not happy.\n\nEveryone gets to make a choice as to what parameters they place on their wedding, but that does not mean that anyone has to come.",
          "id": 140,
          "comments": [
            {
              "score": 27,
              "content": "[deleted]",
              "id": 141,
              "comments": [
                {
                  "score": 19,
                  "content": "My assumption is that when someone has a destination wedding, they just don't want a lot of people. If someone gets upset, that's on them.",
                  "id": 142,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I've seen similar sentiment toward dry weddings.\n\nAnyway this can apply to whatever reason you make your wedding less appealing or less convenient.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Isn't the point of a destination wedding to have a small wedding without hurt feelings involved?? That's how I always saw it.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "Thank you! I'm shocked this is so low. I had a mostly child free wedding. I didn't bitch at people who didn't come because they couldn't bring their kids. I 100% understood where they were coming from and simply let them know that they would be missed. NTA.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Also,can we talk about the fact that the groom *wanted* his nephews and nieces at their wedding, but SIL wants a childfree wedding,so instead of compromising (siblings can attend with their children, cousins can't, for example), they are doing what she wants? It's THEIR wedding, not just hers.",
          "id": 146,
          "comments": [
            {
              "score": 10,
              "content": "I’m shocked I had to scroll so far down to see this, but I guess it isn’t really part of the AH/NAH judgment. I love my nieces and nephews more than anything in the universe, and of my SO didn’t want them at our wedding I’d be heartbroken and probably reevaluating our relationship. Couples can have child free weddings if that’s what they want, but it should be a decision made as a couple.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "This. I can't believe people saying \"take the kids to a hotel with a babysitter\". Traveling to a wedding is expensive, just because it's the most important day of the bride's life, doesn't mean everyone else has to spend enough money to buy a car",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "100% agree.  She would have been TA if she had taken her kids to the wedding and events despite the expressed wishes of the couple to be childfree.  Saying basically \"I respect your desire for a childfree wedding, but I am not going to be able to go\" is NTA.\n\nMy BFF from college wanted a childfree wedding.  I was flying in from out of state and had a 10 month old.  She also wanted me to be her MOH.  She talked to me ahead of time, and she offered to provide a care provider in the church nursery.   I was happy not to have to worry about a baby that age during the beautiful ceramony.   Child free does not mean you have to treat other people's children as an annoyance, especially if you are planning on having your own someday, and are joining a family with a ton of them.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Yes, this is exactly what I was looking for! Had to scroll so far. Not every parent is comfortable with leaving their kids with strangers or babysitters for days at a time. And the SIL isn't even going to pay for babysitting if they all have group babysitting. I think the SIL is just being a bridezilla.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7700,
      "content": "YTA for saying “She also still expects my parents to help pay for it which I doubt they’ll do at this point lol.” \n\nLOL? If someone was offered financial help for a wedding and then has it yanked from under them and you...LOL? Obviously you feel morally superior. Don’t go to the wedding that doesn’t make you TA but hopefully you can have a little more compassion for the situation as a future SIL.\n\nEdit:Thank you guys for the awards and upvotes!",
      "id": 151,
      "comments": [
        {
          "score": 2475,
          "content": "EXACTLY. She’s a total AH and this is a personal issue she has with SIL.",
          "id": 152,
          "comments": [
            {
              "score": 727,
              "content": "That made me uncomfortable as well.  I'm going to change my rating.",
              "id": 153,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1193,
          "content": "[deleted]",
          "id": 154,
          "comments": [
            {
              "score": 790,
              "content": "She sounds like the person who'd sit there and find it totally fine that her child screeches like a banshee throughout the vows.",
              "id": 155,
              "comments": [
                {
                  "score": 239,
                  "content": "I know someone who let their kids run around the altar during a wedding (Eastern Orthodox).  Neither parent made an effort to contain the kids.  It’s astounding what some parents won’t do because of laziness or spite.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 28,
                      "content": "How about that one AITA where a kid drowned at a wedding because they snuck off to a lake when the parents weren’t paying attention? Woof.",
                      "id": 157,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "This is so wild to me. My brother and I were in my godfather's black tie, hour-long, Catholic wedding at ages 5 and 7. The biggest \"problem\" we caused was that my brother struggled to untie the ring ribbon (he was ring bearer) and needed someone else to do it for him.",
                      "id": 158,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yup.  Had that happen...with my brand new SIL's infant.  Whose poopy diapers she changed in the bridal suite while I was getting ready.",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Imagine a baby stroller blocking the aisle with a screaming child inside.",
                  "id": 160,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "It's always up to the couple, although people like OP carry this expectation (read: unreasonable) that events such as weddings are *always* going to be child inclusive. It's someone else's day their way, not yours.\n\nIf it were me and I had someone bullying me into changing my plans, I would tell them if they want their kids invited so badly, they will be paying for all of their family's dinners and can be the babysitter for everyone else's kids. Or, she can just stay home because that seems to be the option that works best for her anyway. Someone giving me that much hassle and then some I would be glad not to have there.\n\nAbout two years ago my friend was getting married and wanted a child free wedding. She put on her invitations that \"childcare would not be provided at the adults only reception\". It ended up being ignored because parents who wanted to drink just let their kids run amok. I can't tell you how many times I saw servers tripping over kids. It was also pissing off other guests who had kids hiding under their table or practically knocking over elderly relatives.\n\nRecently my cousin's wife was having a mini baby shower. On her invitations it was clearly stated that the focus of the day was going to be on mom-to-be and that children be left at home. \n\nNone of that is unreasonable when it's other people footing the bill.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 773,
          "content": "This was the line that made me believe she just has a personal problem with her SIL, especially since she’s making this her fault and barely mentioning her brother",
          "id": 162,
          "comments": [
            {
              "score": 38,
              "content": "And in her edit calls her SIL a psycho and claims that her brother is blameless. There's more going on here.",
              "id": 163,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "If they have beef, it seems like it’s a good idea for OP to not attend the wedding right?",
              "id": 164,
              "comments": [
                {
                  "score": 46,
                  "content": "Have you seen OP's comments? There's some serious animosity there.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 22,
                      "content": "She deleted them all :(",
                      "id": 166,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 617,
          "content": "She also calls her a gold digging hoe in a comment",
          "id": 167,
          "comments": [
            {
              "score": 450,
              "content": "Yup it's not about the wedding, she just hates future SIL",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 306,
          "content": "Yeah OP really seems to hate the SIL and is relishing in the idea that her wedding will be ruined. So nasty.",
          "id": 169,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 53,
          "content": "That LOL stood out to me.\n\nWhat an awful perspective to have. She's hurting her brother here too, intentionally.",
          "id": 170,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 46,
          "content": "She's clearly got another agenda. By reference of he SIL being a 'psycho' in the edits.",
          "id": 171,
          "comments": [
            {
              "score": 20,
              "content": "The intention and lack of care is what I think makes her the asshole. \n\nIf she wanted to say “Am I the asshole for not wanting to go to a child free wedding?” And stop there, then of course she wouldn’t be. But she went on further stating other grievances and opinions that paint her as the asshole. If you want to be judged emotionless then make an emotionless post.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "This is it here. Not wanting to leave your children is completely understandable. However, finding it funny, saying that SHE is being unreasonable AND welcoming the SIL into the family by having the whole family not attend and secretly hoping that their financial help is taken away is just cruel on OPs part. \n\nYTA for your superior attitude, lack of compassion, and starting your brothers new married life off with such a horrid response to their day. \n\nAlso, a practical meet in the middle would be to not attend the four days of festivities and get a group babysitting situation for the actual wedding. Makes you less of an asshole.",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Look people. Op has kids. SIL has the NERVE to want her to do something without her kids one time. God fucking forbid. OP is the physical incarnation of how people with young children can be the worst. She doesn’t want her brother and SIL to have a child free wedding so she torpedoed it and is super pleased with herself “lol”?, all under the policy of “hoW CaN aNYonE nOt wAnT mY pReCioUs cHIldReN sOMewHErE?!?!?”.",
          "id": 174,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "The “lol” made my blood boil.",
          "id": 175,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7620,
      "content": "[removed]",
      "id": 176,
      "comments": [
        {
          "score": 755,
          "content": "I’d argue against “Reddit skews child free”\n\nI was actually on here a year and a half ago asking if I WBTA if I made my own wedding child free despite the large amount of young cousins I have on my side of the family, and got a ton of NAH because even though I was in the right to request it, I shouldn’t be upset if people decide not to attend because of it because it would’ve put out a lot of my family, and it’s what ultimately made me decide to not go child free",
          "id": 177,
          "comments": [
            {
              "score": 60,
              "content": "I have 2 toddlers and am quite happy to have them stay with a sitter while I attend a wedding. If there's a bunch of events and a bunch of people with kids, it'd be pretty easy to tag team watching them over the course of the weekend. And even if none of that was possible, I would just leave my kids home with my wife for a night or two instead of skipping my own brother's wedding.",
              "id": 178,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 46,
              "content": "And that would be the case here if OP didn’t seem to be relishing it so much",
              "id": 179,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 382,
          "content": "LOL. Why people are saying N T A is beyond me. This woman hates her SIL and should just own it. Say it, OP! You don't want to go because you don't like her. Saying that is at least honest.",
          "id": 180,
          "comments": [
            {
              "score": 45,
              "content": "A 4 day destination wedding with planned events is *not child friendly whatsoever.* You can’t just make it a child friendly wedding given that the events were planned for *adults only.* OP is using her kids as a cop out for not attending the wedding for sure.",
              "id": 181,
              "comments": [
                {
                  "score": 34,
                  "content": "That's all good, I get that. Like the poster above said, my vote has nothing to do with the kids situation. \n\nWhat I don't get is why she's so weirdly pissed about it to the fact that she called her future SIL a \"gold digging hoe\" (deleted comment) in the comments? What does that have to do with the issue? Why is she laughing at the fact that her parents make take away wedding funding? Like LOL it's so funny that you might lose money towards your wedding because you're having it in a way that I don't like! Haaaahahahah. That money shouldn't come with strings. If the parents are going to use it to force the SIL to have a type of wedding she doesn't want, they never should have offered that money.\n\nThe comments and tone of the text just make it seem like there is a lot more going on than OP is letting on here.",
                  "id": 182,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yeah, and I don’t see why people gave n t a judgements. The reasoning for not attending the wedding is what determines the judgement in my opinion. And for that, she is the asshole.",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 112,
          "content": "The edit calling her a psycho is what pushed it very clearly into YTA territory. Sister sounds jealous.",
          "id": 184,
          "comments": [
            {
              "score": 32,
              "content": "For me it was the \"lol\" at her parents not helping them pay for the wedding anymore. Seems like this was the outcome she was looking for",
              "id": 185,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 74,
          "content": "She deleted her whole account. Must not be getting the responses she wanted.",
          "id": 186,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 40,
          "content": "Edited because I accidentally hit \"post\" too soon - I think it's a broken-clock thing. OP sounds like she's an AH to her SIL *in general,* but bro and SIL are TA this time for not accepting \"unfortunately, we won't be able to make it due to reasons\" as a response.",
          "id": 187,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 35,
          "content": "If it weren't for the \"multiple days of events\" and just what op wrote at the top, I would say she's still TA because there's a way to compromise. In my opinion, this shows SIL is not part of the family. I myself want a child free wedding, and if you have kids and don't want to come, then dont come or hire a sitter. But that's for me, and I understand that doesn't make me innocent in the eyes of parents- but news flash your infant/toddler is hardcore not going to be silent and is definitely going to ruin my evening and keep me in alert mode, as I find drinking and partying in from of kids NOT okay. (I find the sound of children crying to be incredibly upsetting, as well)\n\nIn my opinion, why can't OP say \"hey, I can come but only for the actual day of the wedding\" or \"hey I can come but only if there's a sitter for all of our kids throughout all your events\" or hell, even a polite \"I'm sorry I'll be missing it- are you live streaming it?\" And still show sil emotional support and support her by talking good about her to the rest of the family?",
          "id": 188,
          "comments": [
            {
              "score": 30,
              "content": "[deleted]",
              "id": 189,
              "comments": [
                {
                  "score": 6,
                  "content": "I babysat for an event that tried to do this, and the kids didn't stay where they were supposed to, but done with the right kind of budget- I could see that going well!",
                  "id": 190,
                  "comments": [
                    {
                      "score": 8,
                      "content": "[deleted]",
                      "id": 191,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Plus kids get super bored by weddings\n Was a kid, forced to attend weddings, hated it, wanted to make noise and play and get out of uncomfortable clothing",
              "id": 192,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I don't really understand why so many parents are so very desperate to have their kids at childfree weddings. I love my kids, but if I'm handed a perfect excuse to leave my kids for a night and have an actual adult conversation, I'm happy. I'd probably have to decline if the wedding was too far away, but anything local...",
              "id": 193,
              "comments": [
                {
                  "score": 5,
                  "content": "Valid point, and a good cf couple should be understanding if people can't come",
                  "id": 194,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "After reading the comments, I did see a lot saying YTA because of OPs dislike towards her SIL. However, the very top comment does have to do about her kids and how all of the relatives with children should pitch in money to have someone take care of the children. It's only the top YTA and NTA comments that talk about children. Anything after that talks about OPs other comments towards her SIL",
          "id": 195,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Nobody *should* be voting YTA because of her attitude and clear dislike of her SIL. It defeats the point of the sub if you’re going to ignore the question and judge based on something else.\n\nOP is NTA for telling her SIL she’s not coming to the wedding.",
          "id": 196,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "We’re talking about the wedding not the op as a person, she has a very legitimate reason to not want to go, therefore quite simply NAH. If the op isn’t telling the full story oh well, but your assuming there’s some sort of eternal conflict between these 2 and it’s just not necessary. Op may not like her SIL, still doesn’t matter, NTA in this situation. Please learn how this sub works.\n\nEdit: before you argue your right go check the subs rules. It literally says the debate is whether or not the OP is the asshole in this situation, not in general, your reasoning doesn’t at all apply to this situation therefore your voting incorrectly.\n\nEdit 2: to make this even clearer op asked if she was the asshole for not wanting to go to a child free wedding. Not if she was an asshole for thinking it’s funny her SIL wedding got completely fucked by her decision to not go for a good reason.\n\nEdit 3: if you don’t believe me check the faq, under be civil it states “on the asshole in this situation”, your just calling op an asshole.",
          "id": 197,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "It's their wedding anyway, not OPs. OP trying to impose their will on something that's not for her (and, more bluntly, is not paying for) is dumb.",
          "id": 198,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3578,
      "content": "YTA for thinking other people should plan their wedding to suit you. I'm quite sure you made a point of sharing your decision and encouraging every other selfish set of parents in the family to copy you.",
      "id": 199,
      "comments": [
        {
          "score": 1179,
          "content": "Exactly. And she’s laughing about it, which is mean. There’s more to this...",
          "id": 200,
          "comments": [
            {
              "score": 289,
              "content": "in their latest edit they called SIL a psycho, yeah...there's definitely more to this",
              "id": 201,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 42,
              "content": "She deleted a comment calling her a gold digging hoe.",
              "id": 202,
              "comments": [
                {
                  "score": 15,
                  "content": "she also edit the edit because it doesn't mention psycho anymore.\n\nbut I feel like OP won't accept her judgement",
                  "id": 203,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2727,
      "content": "[deleted]",
      "id": 204,
      "comments": [
        {
          "score": 306,
          "content": "She didn't insist on bringing her kids. She said since she couldn't she wouldn't be attending. Those aren't the same.",
          "id": 205,
          "comments": [
            {
              "score": 323,
              "content": "[deleted]",
              "id": 206,
              "comments": [
                {
                  "score": 16,
                  "content": "Right that’s the reason she isn’t coming. \nNot asking him to change it. She decline. She then got pressured to go. That’s the condition under which she’ll go.",
                  "id": 207,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 165,
          "content": "They have the right to not have children at their wedding but OP doesn’t have to go. OP didn’t insist on bringing children, they insisted on not coming because they can’t bring their children. NTA",
          "id": 208,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 155,
          "content": "It would be much simpler for the people who want a childfree wedding to accommodate their guest who have children by providing childcare at the venue or some other location. Some venues even have a staffed kids area for that purpose. \n\n>I’m sure the kids would love a few days at friends houses - or bring them and hire babysitters\n\nThe kids may love a few days at friends houses, but do those friends have parents who are willing and able to do that? That's a big ask. And a lot of people aren't comfortable having strangers watch their children, which is what getting a babysitter in a different state would be.",
          "id": 209,
          "comments": [
            {
              "score": 25,
              "content": "Child care is very expensive! If I’m already paying for a free party & dinner I am NOT paying for your child’s babysitter.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": ">It would be much simpler for the people who want a childfree wedding to accommodate their guest who have children by providing childcare at the venue or some other location.\n\nIs a totally reason reasonable expectation, because...\n\nExpecting parents to arrange childcare for their own child?\n>That's a big ask. \n\n>much simpler for the people who want a childfree wedding to accommodate their guest who have children by providing childcare at the venue.\n\nGood idea! I wonder if Bride and groom can hire someone who every guest knows because we all know...\n\n>And a lot of people aren't comfortable having strangers watch their children, which is what getting a babysitter in a different state would be.\n\nAfter all, it isn't like bride/groom & family aren't already arranging for a huge meal and party...",
              "id": 211,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "They have a right to make the wedding child-free and OP has the right to not attend and OP isn't insisting for him to change. He just said he wasn't going to attend.",
          "id": 212,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "> “I know for a fact it wasn’t my brothers decision as it isn’t the norm in our family “\n> \n> So, you asked him?\n\nTHIS!!!\n\nI was reading this thinking that people would say the exact same thing about me, but if I was gonna have a wedding, I would want it to be child free as well.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "OP has unhealthy ideas about relationships. OP's brother and his future wife made a joint decision together: no kids at the wedding. It is 100% irrelevant if it was his or her idea - it was a choice they made together and are supporting each other on.\n\nIf OP understood relationships, OP wouldn't try to drive a wedge between the brother and his future wife. Poor brother & poor future SIL: OP will be a toxic wedge on their relationship until OP grows up.",
          "id": 214,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1389,
      "content": "YTA    \nBe honest, you just dislike her. You could have had the decency to just RSVP No without fuss   \n\nEdit: Calling your SIL a gold digging hoe? Real classy OP. YTA so hard.",
      "id": 215,
      "comments": [
        {
          "score": 401,
          "content": "Yes, this is clearly personal.",
          "id": 216,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 101,
          "content": "You can't just RSVP no to your siblings wedding without a reason.",
          "id": 217,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "What \"fuss?\" Explaining why she couldn't go?\n \nLike, do you think they *wouldn't* have asked why she couldn't make it? Be serious.",
          "id": 218,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "I would just **LOVE** to know how this OP would have reacted had all of her siblings boycotted **her** wedding back in the day.  I would also like to know how much it cost each sibling and family member to attend, what they may have given as gifts, the amount of effort they put into her special day, etc.....your sibling's wedding is usually a lot more expensive for you than it is when you're just a regular guest.  \n\nBut this OP doesn't give a shit, she already got hers.  I'd be devastated if my sibling showed such disdain and malice towards me, I really feel for OP's brother here.",
          "id": 219,
          "comments": [
            {
              "score": 23,
              "content": "I love my siblings and cannot imagine this level of disdain \n and disrespect .        \n\nShe hates SIL and using her kids as a shield to try and get a N-TA from the crowd imo. Her deleted post calling her own SIL a gold digger hoe and then laughing about her parents stopping to pay money to her own brothers wedding says it all.    \n\nThose saying N-TA are deluded. She is such an AH.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "If your expecting ur other half’s parents to pay half of the wedding, then you need to take their opinions at hand as well. SIL is not budging. She’s not offering alternatives either. She said it’s their problem. Just like she has a right to say no child free wedding, the OP has a right to say no to attend.",
          "id": 221,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1135,
      "content": "I personally think YTA\n\nsomeone's wedding day is the biggest, most important day of their life, its a one off. I completely understand someone wanting a child free wedding and if you cared for your brother at all, you would make effort to sort something out for this one off, big day.\n\nTake the children with you and find a trusted babysitting service in that area, then it will be for a few hours rather than a couple of days.\n\nEDIT to say thank you for all the upvotes and just to highlight a point everyone is making. Just because a wedding isn't a big deal to YOU personally, does not mean it isnt for other people. Its what makes this world such a beautiful place, that everyone is different. I just know id do anything i physically could to make sure i made it to my brothers wedding day, because to me, its a big deal.",
      "id": 222,
      "comments": [
        {
          "score": 182,
          "content": "Or have husband watch the kids at home or in the state the wedding is and go to the wedding solo.",
          "id": 223,
          "comments": [
            {
              "score": 19,
              "content": "I legit just asked the same thing. Its her brother, what's the harm of her going solo and dad staying home to watch the kids?",
              "id": 224,
              "comments": [
                {
                  "score": 10,
                  "content": "I can understand why her brother would be hurt because she’s not compromising here. Maybe they aren’t close so who cares, but the OP shouldn’t be surprised when their relationship takes a hit.",
                  "id": 225,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Been waiting for someone to say this. We had a childfree wedding and that’s what my husband’s cousins all did. Their husbands stayed home with the kids, the cousins came and had a great time at the wedding.",
              "id": 226,
              "comments": [
                {
                  "score": 4,
                  "content": "Right? Why are these people unable to go by themselves? The partners who aren't related to either of the people getting married aren't going to be missed very much in the grand scheme of things.\n\nYou'd think OP might enjoy a weekend away from parenting and sometimes to themselves - unless this is really just an excuse to mess with SIL and their wedding plans. OP's subsequent comments make it clear they've got beef with the future sister-in-law.",
                  "id": 227,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 118,
          "content": "Why does OP have to attend a childfree wedding? NTA",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "Read her edit, it's a multiple day affair that is all child free. So it won't be for a few hours",
          "id": 229,
          "comments": [
            {
              "score": 47,
              "content": "[deleted]",
              "id": 230,
              "comments": [
                {
                  "score": 20,
                  "content": "Say OP doesn't go to the other events, the other moms will probably do they same. Most likely they would all hang out and I can see the SIL throwing a fit about how rude it is for them to hang out and not do her event. I have a neighbour like this, she basically came up to me and told me that I was going to her wedding (it's on new year's) and that I couldn't bring my kids. I said no, my kids are toddlers. They have never been away from me before and I don't plan on having some stranger I haven't met take care of them. After talking to a few of the other neighbours, turns out this person has basically got to them and told them \"you are doing my make up, you are doing my hair, and get a babysitter, I know Waffles(me) is looking for a babysitter so have the babysitter watch your kids too\". She threw a huge fit when I told her we weren't going which also set other neighbours to tell her they weren't going. She is now ignoring all of us. 🙄",
                  "id": 231,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "Well, no. Your wedding day should not be the most important day of their life. It's an administrative change. \n\nNo wonder the divorce rate is so high. Every other day of the marriage is more important than the day it begins. Period.",
          "id": 232,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Well, it's not the biggest day for everyone else.\n \nYou do know that, right?",
          "id": 233,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "Plus look at how many people have backed out because they can’t bring toddlers to a wedding.... That’s a **lot** of toddlers that would be attending unless child free 😳",
          "id": 234,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I mean, sometimes. And sometimes it's just a first wedding.",
          "id": 235,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "People who consider their wedding the biggest and most important day in their life are setting themselves up for massive disappointment. \n\nI have several small kids, one of whom is exclusively breastfed. I could not attend a child free wedding for days, as it couldn’t happen. I have babies. \n\nA baby sitting service should be set up by the parents of the kids, and those with small kids should be exempt from 6 activities over 4 days, maybe going only to 2 of them. I can handle 2-3 hours away from the baby if I time it right. If the sil is barring kids from the hotel, that’s a different bag of worms.\n\nAll the edits, though, make the OP sound classist, condescending, and extremely spiteful. \n\nIt could be that ESH.",
          "id": 236,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "I'm with you on this. \n\nHowever I would like to add that SIL really should have considered this before she planned a child free wedding where close relatives not only have children, but live really far away. I considered a child free wedding back when I got married and my plan was to hire a babysitter or two for a room down the hall where people could check on their children. It just seems crazy to me that you wouldn't think about these things. \n\nBut OP does have other options like going to *just* the wedding and organizing babysitting with her other relatives, but she'd rather not go than even consider them.",
          "id": 237,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 854,
      "content": "About 3 other sisters.... ABOUT?!",
      "id": 238,
      "comments": [
        {
          "score": 424,
          "content": "I had to scroll way too far down to find this comment. How do you not have an accurate count of your siblings?",
          "id": 239,
          "comments": [
            {
              "score": 199,
              "content": "I control-F'd for this while reading the first 2 sentences. My mind is instantly doubting the validity of this post. How do you not know how many sisters you have?",
              "id": 240,
              "comments": [
                {
                  "score": 10,
                  "content": "Boris Johnson's relatives?",
                  "id": 241,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 85,
              "content": "A lot of details are like this. OP is clearly lying to make herself look better. If it really was mandatory 4 days then she'd have led with that, not put it in an edit only after a bunch of YTA comments.",
              "id": 242,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "You know, around 3.3 sisters. I usually just round it to about 3.",
              "id": 243,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 57,
          "content": "I almost couldn’t make it past the “about.” Like what? I need more info.",
          "id": 244,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 40,
          "content": "Pretty sure OP said that to not be easily identified should her SIL find this post. No idea for sure but there’s a nonzero chance OP is referring to my sister 😬",
          "id": 245,
          "comments": [
            {
              "score": 16,
              "content": "Wait, care to elaborate?? So many of yta crowd have given up on trying to knot themselves into why OP should travel with young children and are now saying she's a bitch and this is spite motivated (which I'll go on record as saying is immaterial to me, I have young kids, no why in Hell would I want to do this, let alone be willing to shell out for it.)",
              "id": 246,
              "comments": [
                {
                  "score": 23,
                  "content": "Well if OP is referring to my sister when she says “SIL” then there’s a lot of context missing from this. Again, it’s unlikely that this is the same person but if it is, OP failed to mention that my sister wants the kids at the ceremony and offered to pay for childcare for the kids. She also suggested that the kids stay with OP’s in laws during the reception. Moreover, OP and all of OP’s sisters are in the wedding as bridesmaids, making kids at the reception more difficult and bailing on the wedding extra shitty.",
                  "id": 247,
                  "comments": [
                    {
                      "score": 22,
                      "content": "That's not missing context, that's an almost entirely different story, lol. Huh. Not saying OP lying isn't the case and we won't know one way or another, but interesting, thanks for indulging my curiosity",
                      "id": 248,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "I dunno, yo. This explanation really feels like it fills in a lot of gaps that didn’t make sense to me for OP to omit.",
                      "id": 249,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Interesting...",
              "id": 250,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 24,
          "content": "That confused me too? Maybe they have another brother and they weren’t sure what to call him/his wife? I’m not sure",
          "id": 251,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "I stopped reading after this",
          "id": 252,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 635,
      "content": "YTA. You don't have to attend all of the events, you can only attend the wedding. It's a single day. \n\nHonestly, if I was her, I'd rethink becoming part of a family who can't compromise for a SINGLE DAY, a single special day and are willing to gang up on me to get their way. Their wedding isn't about you. Further, you're very quick to single your brother out, her future husband, to pit him against her too. It's a very good indicator of what to expect in the future and I'm not here for it.",
      "id": 253,
      "comments": [
        {
          "score": 28,
          "content": "Well at least her future husband isnt spineless to his family's whims.",
          "id": 254,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}