{
  "post content": "I was in a horrible relationship with a woman I'll call Christi. She was a very toxic person and at best a borderline alcoholic. I hate to armchair diagnose, but she is spot on for BPD. Constant paranoia about everyone and everything, wild mood swings. I realized I had a problem and needed to cut ties with her to move on and fix myself and that's when she announced that she was pregnant. She stopped drinking while pregnant, but her behavior didn't really change, if anything, it got worse. \n\nI blocked her for a few months after there was a particularly bad incident that made me relapse, but I had every intention of being there for my child and made sure she knew that. When she would have been 8 months pregnant, a mutual friend called me and said she had had a stillbirth. I had no reason to not believe that friend but I just couldn't risk seeing her again and getting sucked back in, so I texted her condolences and have kept her blocked in every way that I could since. \n\n8 years have passed. I married my wife 2 year ago, we have a child, and I just passed 7 years sober. I went back to visit my parents last July (same town), and saw some old friends, some of whom would have known Christi. One mentioned that Christi's daughter just had her postponed birthday party. Her 8th birthday party, ie this kid would have had the exact due date as Christi's \"stillbirth\". AKA, she had my child. \n\nChristi married some guy, had two more children and had him illegally adopt my daughter. I now want to sue her to overturn the adoption because she clearly had someone lie to me so I wouldn't try fighting for my parental rights. I'm devastated that she stole so much time from me and I want my child to know her family and likely be in a safer, more stable home. My mother is telling me not to because people can change and it would be confusing for her at this point, but I think I should.",
  "id": 1,
  "comments": [
    {
      "score": 10275,
      "content": "Y T A / ESH you blocked your pregnant ex, didn’t question or even inquire about a funeral, death certificate, check up on her (really you should have done a quick visit regardless of if you dislike her or not) or anything like that which is completely your fault tbh. Who only texts condolences about the death of their child to the mother?? Your daughter (which you don’t even know if she’s actually yours) is 8 years old and you’ve never been in her life. You really don’t know anything about their current family life and just assume that uprooting your estranged daughter who has never met you and doesn’t know you at all and forcing her to live with you, your wife, and your kid is somehow more stable than where she is currently. Have you even talked to your wife abt this as well??",
      "id": 2,
      "comments": [
        {
          "score": 4498,
          "content": ">Who only texts condolences about the death of their child to the mother??\n\nAnd then quickly blocks her afterwards...",
          "id": 3,
          "comments": [
            {
              "score": 1821,
              "content": "And didn’t set up any kind of (formal) intermediary to converse with her. What exactly was his plan to “be involved” with this child? How did he even think he was going to find out this kid was born?",
              "id": 4,
              "comments": [
                {
                  "score": 1243,
                  "content": "Didn't even offer to help pay for the funeral or ask where his kid was buried...wow.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 389,
                      "content": "...are there typically funerals/burials for stillbirths? That's not really a thing where I come from",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Or even just chip in for hospital fees or something.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 468,
              "content": "I'd assume someone who was in a lot worse shape than now. \n\nI'm going ESH. I can't blame him for blocking someone as toxic as her but he's still an asshole",
              "id": 8,
              "comments": [
                {
                  "score": 396,
                  "content": "I think the tipping point is that he never set any way to contact through a third party. I totally get not wanting to interact with the ex, but the fact that he basically ignored the pregnancy... it makes it slightly more YTA than ESH for me. \n\nNot saying I agree at all with her lying, but what if there had been a complication with pregnancy and she had reached out to let him know, just to find out there was no way to reach him. He can't just skip out whenever he wants, he had an obligation to set up a third party contact. \n\nI think she should have went legal route though and went for full custody citing him doing this, instead of just lying about something as traumatic as a stillbirth. Even though he didn't seem that devastated by it in the post, that could have royally messed with his head.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 591,
                      "content": "If she lied about the stillbirth, perhaps it was to keep her kid away from a guy who claims not to like armchair diagnoses but nevertheless is willing to make one, and who's perfectly willing to uproot an 8 year old from the only family she's ever known without even finding out if she's happy first.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 62,
                      "content": "There was a way to contact via third party!  Remember a mutual friend told him about the still birth!",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Wait, if the ex had no means of contacting OP then how did she pass along the lie of her stillbirth?",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 225,
                  "content": "He talks about only being sober for 7 years, his daughter with ex is 8 so I think it’s safe to assume they were _both_ pretty toxic at that point in their lives.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 249,
                      "content": "Exactly. Also he blames a relapse on her, which is pretty shocking for a guy who’s so deep in recovery. She didn’t make you relapse, dude, your addiction made you relapse.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 104,
                      "content": "If his Ex stopped drinking while pregnant and was assumingly getting her act together the friend may have been willing to lie about the stillbirth in hopes it would prevent undoing her progress. \n\nI feel like it's definitely an ESH but more-so OP is. I can't fault him for whating to get to know his child, but OP needs to be more careful about it for the child's sake as the child is the one who is going to suffer the most.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 50,
                  "content": ">I can't blame him for blocking someone as toxic as her but he's still an asshole\n\n\nWell, all we know is HE thought she was toxic - but he hasn't said why, or what she did, he just gave us his armchair diagnosis. Meanwhile, HE was a drug addict/alcoholic that was constantly drifting in and out, blocking her and then unblocking her then blocking her again, all while relapsing with his drug of choice and, by his own admission, \"Having a hard time.\" Was her paranoia/toxicity her asking if he was using? Was she wondering where he was when he was out getting blasted? Was the \"toxicity\" her getting upset while she was pregnant and he was off blowing all his money while relapsing?\n\n\nFrankly, I don't blame her. If I'd gotten pregnant by a dude that was an addict, who was constantly in and out and fighting with me, who said, \"I promise I'll be there,\" but then blocked you on everything...I'd do what I needed to do to get rid of him too. It's quite possible she was scared of him. \n\n\nShe's happily married with three kids, and yet he's assuming that HE is the more stable household? Why? He \"doesn't believe she could have changed\" but wants everyone to believe HE has; yet HE was an addict who abandoned his pregnant girlfriend while on a bender and then didn't give a shit when their child \"died.\" Now he wants to rip a child from her stable home life because he feels disrespected...he views the kid as his rightful property, not a living person that he is going to try and damage with this shit. He's 100% TA here.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Yeah, but if you block your pregnant ex during pregancy, you dont get to pretend that you wanted to be involved dad all along.",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 169,
              "content": "An addict. He’s criticizing her but he has the same addictions from what he’s said.",
              "id": 18,
              "comments": [
                {
                  "score": 97,
                  "content": "Yeah. And he seems to blame her for his own issues (the relapse he mentioned). Makes me wonder that his ex had good reasons for lying to him, it’s leaning more YTA than ESH if you read between the lines.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 104,
              "content": "He blocked her almost as soon as she said she was pregnant, but says he was planning to be involved. How was he planning on doing that when he blocked her? There is FAR more to this story than he's telling people.",
              "id": 20,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "No you see he cares so much about this child that he wants to remove her from her family, that’s why he never asked any questions and moved on with his day like someone told him they wouldn’t make it for dinner",
              "id": 21,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Sound to me like she dodged a big bullet with the OP",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 734,
          "content": "I agree. A point a lot of people are missing is it states that op blocked her BEFORE learning of the still birth. Then unblocked her when he found out to say condolences then blocked her again. How do you make sure someone knows that you want to be there for the child if you had them blocked for a good portion of the pregnancy? The fact that “if” she would have had a stillbirth and had no way of contacting op speaks volumes.",
          "id": 23,
          "comments": [
            {
              "score": 258,
              "content": "When she was in the third trimester. Babies are born prematurely all the time. If she had been stillborn, or was rushed to the NICU and barely hanging on, OP would have had no idea unless a mutual friend mentioned it.",
              "id": 24,
              "comments": [
                {
                  "score": 211,
                  "content": "That’s what I was saying. If op cared at all about the child the mother should have been able to contact him if anything happened.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 249,
                      "content": "Yeah, I'm 100% with you. \n\nI know that sometimes I give other people on these threads too much benefit of the doubt, but I've been reading some of OP's responses, and there doesn't seem to be proof that Christi ever actually confirmed the stillbirth story and just asked OP 'why do you care' which... Doesn't seem unreasonable to me, since it seems like he abandoned her for most of the pregnancy, and I'm kind of wondering how much of 'Christi's super crazy' is actually 'Christi's probably got something going on, but OP was struggling with addiction and clearly wasn't processing things well, and maybe Christi's not so much crazy as she is done with the bullshit'.\n\nI don't know, I also think that since OP hasn't actually confirmed that this girl's his daughter (could be that she's actually Christi's husband's daughter and the friends forgot, could be adopted/fostered/whatever), or that there was an official adoption that went through, I sort of am feeling judgy... Like, there's a benefit to verifying rumors that your friends tell you. How have you not picked up on that lesson by now?",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I believe if you are trying to get sober, you break off from your drinking buddies. They may not have had any mutual friends left at that point.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 118,
              "content": "This. “I had every intention of being there for me kid”......when he felt like checking in.",
              "id": 28,
              "comments": [
                {
                  "score": 32,
                  "content": "I mean... I have every intention of being worth 1 billion dollars someday. I'm not doing anything to make it happen but don't you DARE tell me that my intention is worthless.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 187,
          "content": "Also, the kid is 8 and OP is 7 years sober. So, I mean, I'm not buying this \"She totally knew I had every intention of being a great dad so this is all her fault\" narrative",
          "id": 30,
          "comments": [
            {
              "score": 58,
              "content": "Exactly and he just brushes over that like it doesn't indicate that he was hardly a fit parent at the time",
              "id": 31,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 92,
          "content": "Jumping onto top comment to say that OP seems to have grand visions of himself sweeping in, saving this kid from the awful environment she must be living in, etc... OP, people really do change. This kid might be having a great life, or even just an acceptable life, but OPs past experience with his ex would make it incredibly difficult for him to see that. It is incredibly hard to accurately, fairly judge a situation when you have had such a relationship with one of the parties involved. It is also very hard to accept that someone who has hurt you actually can be a good person to someone else, especially someone vulnerable / someone you have an interest in protecting. \n\nOP. Think long and carefully about getting involved. If you appear in this child’s life claiming her mother is a bad person and the kid needs “rescuing” from a problem that may very well not exist, it’s going to cause a lot of trauma for the kid. You might also very well spend weeks bitter and angry, your brain desperately searching for some kind of sign that the horrible crazy ex is abusing her child. When in fact those signs do not exist, because your ex is a good mother, and the child is happy.",
          "id": 32,
          "comments": [
            {
              "score": 3,
              "content": "Imagine having to remind a recovering addict that addicts can change. He really wants to uproot this child’s life when he’s never met her with his only justification being that his ex was toxic, as if he wasn’t a toxic ex who was an addict who blocked his pregnant gf. Is that not toxic behavior? Should someone try to take his kids away because 7 years ago he was toxic?",
              "id": 33,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "I can understanding wanting some sort of relationship with the daughter, but it is a terrible idea to try to get custody after not being in this girl's life for 8 years. As far as she's even known, this man IS her father. He raised her as a father. It would completely fuck her up to be removed from that and there's no way he would get custody anyway.",
          "id": 34,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 56,
          "content": "I hate to be \"that person\" (but I'm going to be LOL), but since you're the top comment you may want to put a space in one of your judgments so only one counts :) I'm personally going with ESH, the mother for having someone lie about her having a still birth, the friend for passing on the lie and OP for texting condolences and then blocking her straight after. And NOW he wants to be in the child's life? When he never did any sort of investigation into whether or not she was actually born? And thinks that after EIGHT YEARS he can just waltz in and sue for custody?",
          "id": 35,
          "comments": [
            {
              "score": 47,
              "content": "Do we know that the mother had someone call him and lie?",
              "id": 36,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "Spot on.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "I mean, I feel that it does need to be taken into consideration that he has only just left an abusive relationship, was a recovering alcoholic who had just had a relapse, and was probably in a very dark place at the time. I have no doubt he had the best intentions for his child, but I can’t imagine how horrible the idea of spending time with your abusive ex, when there is seemingly no reason to.\n\nAnd if she IS as bad a woman as OP claims, I do feel like it might be worthwhile him at least trying to have some involvement, as he might be able to be a positive influence on her. Perhaps she HAS changed, but if she is STILL an abusive borderline alcoholic... then that kid likely needs help. And to be fair, I do feel the kid has the right to know who her birth father is, even if she doesn’t want to get to know him or spend time with him. \n\nI’m not going to call a judgement, because it’s *probably* E S H, but I don’t feel we have enough stuff here to know. And there is a lot that OP will only find out by challenging the adoption and spending some time with his daughter. I don’t feel OP would be TA for challenging the adoption, so long as he follows his daughters wishes and doesn’t try to force 50/50 custody or the like immediately. Supervised visitation or perhaps the occasional weekend stay, until the daughter can have her own input on the situation though, I would fully support, because as I and OP have said, if that woman is as bad to her kid as she was to OP (or even, as bad to her current partner as she was to OP *in front of* OP’s daughter) then somebody needs to be there to try and help the poor girl, and imo that would be OP’s job.",
          "id": 38,
          "comments": [
            {
              "score": 89,
              "content": "I feel that it does need to be taken into consideration that we are probably not getting the full story and there's more that probably paints OP in a bad light-- not that the one we are presented with here already doesn't. I hate to say this, but I'm willing to doubt that the toxicity was all one sided as OP makes it out to be. He was literally an alcoholic who was very unstable, as he had just relapsed. If Christi's pregnancy had continued as normally, OP had no way of being contacted anyway and I doubt he was going to be as involved as he claims, because someone who wanted to be involved would probably look further into the death of their child (idk that's just my opinion). He doesn't seem like he would be that much of a positive influence, as he hardly talks about what the child may want, just about his ex, how he's changed, and all these big assumptions that her home life must be terrible, because of who his ex used to be when he knew her.",
              "id": 39,
              "comments": [
                {
                  "score": 67,
                  "content": ">I'm willing to doubt that the toxicity was all one sided as OP makes it out to be. \n\nI'm a recovering alcoholic, 6 years sober. My HG is a women's group, and I hear a LOT of stories which amount to 'my ex/kid's father is super toxic and did xyz and I did nothing but be a great girlfriend/wife/mother'. And I want to say... sweetie, you're in an AA meeting. You SURE you did nothing?",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Yeah but even his Mom is telling him to back off  if this ex is so crazy abusive  grandma would be for him taking kid away",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "> doesn’t try to force 50/50 custody or the like immediately. Supervised visitation or perhaps the occasional weekend stay\n\nYeah, but this is what OP said in the comments:\n\n> I would want the child to live with my wife and I instead of Christi and some random unrelated man\n\nHe lives several states away and wants full custody of this child that is either not his or that he abandoned.",
              "id": 42,
              "comments": [
                {
                  "score": 12,
                  "content": "Yeah that’s just fucked, and also he’s deluded if he thinks he’ll get that.",
                  "id": 43,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "It really sounds like there is more to this story.",
          "id": 44,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Hijacking the top comment to say YTA, for the reasons stated above but also for something I haven’t seen anyone mention. You “hate to armchair diagnose” but you’re going to anyways? You cannot, cannot, canNOT diagnose someone unless you are the mental health professional treating them! First rule of mental health work! People like you are the reason that I have a few friends, perfectly wonderful people who struggle with bpd, who are terrified to tell anyone about their diagnosis because they’re automatically going to be labeled a horrible person. Being a toxic person does not mean someone is borderline, and having borderline doesn’t mean someone is a horrible person. Full stop, end of story. Armchair diagnosing people just causes more stigma by people who don’t really understand the disorder.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5961,
      "content": "My man, this is so far above reddit’s paygrade, it’s not even funny. You need a therapist and a lawyer, not a bunch of (almost certainly) teenagers and 20-somethings who are bored at home during the school break.",
      "id": 46,
      "comments": [
        {
          "score": 3407,
          "content": "I’m 35. This is one of the most entertaining subs on Reddit.",
          "id": 47,
          "comments": [
            {
              "score": 791,
              "content": "Yeah, thus why I said “almost certainly” haha. I’m pushing 30, and I love this sub, but most of the time the opinions and advice given here makes me think anyone over the age of 25 is in the minority lol",
              "id": 48,
              "comments": [
                {
                  "score": 573,
                  "content": "50+, we are definitely in the minority here.  Pure entertainment sometimes though.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 436,
                      "content": "Another oldie here (50+) and very entertaining although I do occasionally weep for the future.",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 96,
                      "content": "I am late 40s and love dropping some GenX crap on the Millennials, GenY, and the Boomers.",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "56 here, but I can't even with this one.",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I'm over 50 and a lawyer",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "41 year old here, and I’m here for the comments.",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Also in the 50+ club.... Love this sub!",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Just turned 50 myself. Love it here",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 89,
                  "content": "Oh no you’re so right. Anytime there is a post about a parent or something all of the teenagers come out from the hills and tell them how bad of a parent they are because they think parents should be perfect. It’s ridiculous and drives me psycho.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 96,
                      "content": "I saw a comment the other stating that a parent having a rule about their teenage child not being allowed to have sex in their house was a violation of human rights. I replied that that's called a house rule (maybe not the smartest parenting choice in the world, but still), not something to call The Hague about. First comment was upvoted, mine went into the negatives. Teenagers.",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "or parents aren't allowed to have sex drives/outside interests/a bad day/personalities of their own etc",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Me too!!  My daughter tells me to take a break.  Lol",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Ok, but there's some REALLY shitty parents here (provided it's all truth, of course) and I say that as an adult.",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I’m almost 30 as well but I honestly am here for the entertainment value and I wouldn’t trust my advice.",
                  "id": 62,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "I don't like to say I'm pushing 30. I'm turning 29 in January, and then I don't plan to age after that.\n\nEdit: Some people have messaged me concerned. No I'm not saying I want to die. It's a joke that people lie about their age instead of accepting major milestones.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 3,
                      "content": "You’re so young, trust me.",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Yep. 43 and part of me worries about the future. Oy.",
                  "id": 65,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "30 here.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Same!",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "33 here, love this sub at times. Equally infuriated with it at others.",
              "id": 68,
              "comments": [
                {
                  "score": 19,
                  "content": "Yeah I've had to take a step back from participating much in this sub anymore because the average maturity of responses were making me feel crazy.",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I’m 32, read this sub all the time but mostly lurk. A lot of mature well-thought responses get downvoted in favor of the typical teens/early 20s logic.",
                  "id": 70,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "46F here. This sub is one of, if not the most, entertaining subs on Reddit. It’s better than guilty pleasure bad TV in my opinion.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "40-something female and this is one of only 2-3 subs I make sure I scan through every day.",
              "id": 72,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Early thirties and I LOVE this sub. So much quality entertainment.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I was going to say the same thing.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I'm 34 next week and agreed...",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "SAME. I like to read about the dumpster fires.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "38 stay at home mom of two and hoping to become a therapist. Love this sub.",
              "id": 77,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "44 here. I'm often entertained by the replies. Oh, to be in my 20's again.",
              "id": 78,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 166,
          "content": "That is such an inaccurate description. This sub is absolutely NOT filled with students on school break... It's filled with students procrastinating during finals :(",
          "id": 79,
          "comments": [
            {
              "score": 40,
              "content": "How could they get it so wrong, this sub is a 10/10 source of procrastination material.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It's filled with students at all times. I'm here when I'm supposed to be in class or when I'm supposed to be studying for a final.\n\nNow that I think about it, I realize why the final was so hard.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 56,
          "content": "I am 40 and here for this shit.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Hey. I am 38 and working from home because of the Virus That Shall Not Be Named and I am reading this while fucking off the last 20 minutes of my shift, thank you very much!",
          "id": 83,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 26,
          "content": "Early 30's. I tell my partner this is my version of day time soaps. lawl.",
          "id": 84,
          "comments": [
            {
              "score": 6,
              "content": "oh my god this just answered so many questions i had about myself haha",
              "id": 85,
              "comments": [
                {
                  "score": 3,
                  "content": "you're welcome, hah.",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "So what I’m getting from this entire thread is us older grown ups need to stop lurking and start posting! (Based on the zillion older millennials, Gen Xers and occasional Boomer responses below.)",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "As soon as I read the thread I said out loud \"oh, honey, not here\"\n\nfaaaaar about our paygrade. no need for the braces crew to help you ruin your life.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": ">20-somethings who are bored at home during the school break\n\nYeah, fuck them 20-somethings, they are stupid and know nothing about life!\n\n...\n\n...\n\n...\n\nShit, I'm 25...",
          "id": 89,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Now that you mention it in surprised this sub doesn't have more high school drama.. or maybe it does and I just don't see it",
          "id": 90,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "I am in fact a teenager and can confirm that I am not equipped to tackle this kind of problem, even if I love reading about the stuff lol",
          "id": 91,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3794,
      "content": "ESH\n\n>I want my child to know her family and likely be in a safer, more stable home\n\nThat \"likely\" is carrying a *lot* of weight here.  You want to fight to have your parental rights acknowledged (assuming you are in fact the father) and at least establish some level of visitation, that's entirely justified.  But demanding that an 8 year old be torn from the only family she's ever known without *firm* evidence that you're actually rescuing her from something terrible is hardly going to make things more \"stable\" for her.",
      "id": 92,
      "comments": [
        {
          "score": 450,
          "content": "This!\n\nDaughter is going to have all sorts of issues if you tear her out of a happy family unit. But I would definitely take some legal steps to gain access to your daughter. Your ex telling you she had died and arranging for someone else to adopt her without your consent, I have to wonder if that's legal?",
          "id": 93,
          "comments": [
            {
              "score": 189,
              "content": "He wasn't at the hospital for the birth or in contact with the mother in anyway shape or form. So she just put no father on the birth certificate. Which is pretty accurate.",
              "id": 94,
              "comments": [
                {
                  "score": 80,
                  "content": "[deleted]",
                  "id": 95,
                  "comments": [
                    {
                      "score": 7,
                      "content": ".....couldn't the mother just say she doesn't know who the baby's father is?",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "I highly doubt that there's any father listed on the birth certificate.  That should probably be OPs first step, go to court to establish paternity.",
              "id": 97,
              "comments": [
                {
                  "score": 2,
                  "content": "Yes, I doubt it too, but it would still involve some deception - lying to say the father was unknown and that daughter could be legally adopted because the father was unknown would still cross a legal line...",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "The ex didn’t tell him, one of his friends did",
              "id": 99,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "It’s ok, no family court would take this case seriously and I know this for a fact. 8 year old children just aren’t taken away from their mothers like this because of the grievances of a bio father who has never met the child, especially since it sounds like this kid is already being raised by a father who has legally adopted her (could even be on the birth certificate). It’s probably upsetting for OP but *shrug* it’s what’s best for the child and any judge would see that. I highly doubt he could even get a DNA test done in this instance.\n\nThe legal system doesn’t exist so that we can all get our way all the time, ESPECIALLY not family law which, though imperfect, holds the individual needs of children over the feelings of adults.",
          "id": 100,
          "comments": [
            {
              "score": 11,
              "content": "Yeah as long as the kid is in an okay environment and legally has the step dad as her other parent, a judge would not bother to further review this case.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I also find it hard to believe that OP hadn't heard about Christi's kid any time in the last 7 years (I saw 7 because that's how long OP has been sober). Have you not visited your parents in all this time? You chose to socialize with your hometown acquaintances during COVID? None of them did the math about the kids age and your relationship? \n\nOP needs to really consider the weight of his decision, and should probably TALK to his ex first before potentially ruining this child's life.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1691,
      "content": "YWBTA if you tried to sue her.  Yes, she is an AH for her part in this but you made the choice to block her everywhere and not verify the stillbirth.  You took the easy way out by not contacting. \n\n By suing now you would screw up your child.  You don't know she has a bad home life.  Your baby mam could have turned her life around as well after getting a bit of responsibility.\n\nYou have 2 possible positive moves, 1) Move on and forget  or 2) Keep an eye from the distance through friends and things.  You never know if later on she will want a relationship and come looking, be ready for that.",
      "id": 103,
      "comments": [
        {
          "score": 272,
          "content": "Not that OP doesn’t have some blame, both had problems and were toxic. He recognized that and even though he wanted distance from HER, he said he’d be there for the child.  Who could ever THINK that someone would fake the death of a child, be it miscarriage or still birth and the idea of expecting a funeral or death certificate probably never even occurred.",
          "id": 104,
          "comments": [
            {
              "score": 287,
              "content": "It's his child and he didn't even give a shit enough to find out if there was a funeral/memorial service. He didn't even hear from the mother directly! Some mutual friend told him. It's ridiculous.",
              "id": 105,
              "comments": [
                {
                  "score": 130,
                  "content": "THANK YOU! How do you not speak to the mother of your dead child on the day of her birth/death?! A text? If the baby was born alive he wouldn’t even have been there. Doesn’t sound like he was interested in being apart of the kids life in the first place. Sounds hella sketchy",
                  "id": 106,
                  "comments": [
                    {
                      "score": 69,
                      "content": "A text and then another block shortly after. \n\nFor all any of us know his ex could have replied \"WTF, no? Kid is still healthy. I've been trying to get into contact with you for ages. Call me back,\" half an hour later, realised that he never was and moved on with her life.",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 246,
              "content": "It wasn't even the mother who faked the death, right? OP heard from a mutual friend - who may have been acting on their own agenda entirely.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "How would he be there for his child if he blocked the mother?",
              "id": 109,
              "comments": [
                {
                  "score": 12,
                  "content": "Can we talk about how shitty the coparenting would be as he already blocked her during pregnancy.",
                  "id": 110,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "He didn't know that the mother of his child gave birth. Someone else told him.and lied to him. He didn't even care enough to verify. He didn't care enough to have a service. He didn't even care enough to check on his ex, just a text and then blocked. He made it clear he wasn't going to be a father. It doesn't seem like he gave a damn. This isn't about the child. This is about him getting what is rightfully his. If it was about her he would have taken any step find out about th child. Did he even know he had a daughter. Doubtful. He left her in the dust and never looked back. He says the adoption is illegal. I highly, highly, highly doubt it. If it were a lawyer could have this fixed with a DNA test. \n\nIn order to adopt, they would have to place a notice in local papers for a certain amount of time to give the father a chance to step up. As he wasn't on the birth certificate, he would have needed to have come forward and request the DNA test. He can get a lawyer. He may be able to eek some visitation out of it, unless the ex is able to prove what a dangerous, toxic person OP is. He is saying it is illegal because he was lied to. Cry me a river. I don't trust him because he didn't do a damn thing to check up. I feel bad for this kid because he is going to destroy her life if he is given the chance.",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I mean, usually with a stillbirth, there’s a body. You could also make the argument that what good parent would miss their own child’s funeral or cremation?",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 112,
          "content": ">By suing now you would screw up your child\n\nIt looks like nobody else is interested in the girl's opinion. She is not an asset, she's a person.",
          "id": 113,
          "comments": [
            {
              "score": 48,
              "content": "\"Hey, small child, would you like to go live with this total stranger, instead of stay with your mom, dad, and siblings? He swears he's cleaned up his act and is sober now.\" Yeah, how do you think she's gonna answer?",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "[deleted]",
          "id": 115,
          "comments": [
            {
              "score": 2,
              "content": "I agree, I thought of that after typing my response.  That is definitely a viable option.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1450,
      "content": "I mean, if someone is 8 months pregnant with your child and you get a call from their friend saying the baby passed...why would you not try to confirm/get in contact? Would you not at least attend the funeral or something?\n\nESH.\n\nEdit: you also say you had no reason to believe that person and kept your ex blocked and never even tried to find anything out about your baby even though you knew there was a solid chance this person wasn’t being truthful. How is this situation not at least partly your fault? \n\nAlso, you need to think about what’s best for your child- this whole post is about you, you, you.",
      "id": 117,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1253,
      "content": "YTA, because this post is all about you, you, you. What’s best for the CHILD? How do you know their home is not stable?",
      "id": 118,
      "comments": [
        {
          "score": 193,
          "content": "Exactly it's like he barely talked about the kid. Selfish af, I mean he offered condolences, IT WAS HIS KID TOO GOSH DANG IT! He is a moron.",
          "id": 119,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "THIS IS IT! What makes him think uprooting a child’s life is ok? He doesn’t know what her home life is like. He’s already noted that the mom stopped drinking. It’s been 8 years, he does not know this child. \n\nIf he wants to get to know her, that may be reasonable. He should discuss that with his ex. However, potentially ruining a kids life like this is so selfish. It’s a dramatic and drastic change and he’s taken no one else’s feelings into account besides his own! YTA",
          "id": 120,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1108,
      "content": "YTA\n\n> When she would have been 8 months pregnant, a mutual friend called me and said she had had a stillbirth. I had no reason to believe that friend but I just couldn't risk seeing her again and getting sucked back in, so I texted her condolences and have kept her blocked in every way that I could since. \n\nYou were an alcoholic wreck during her pregnancy and cut all contact. You don't even know whether the pregnancy was carried to term, according to your own story. You never even bothered to put in some token effort to find out.\n\nAnd now that the kid seemingly has a stable family, you want to rip the whole thing up.\n\nSorry, but from a moral POV this train left the station long ago. You're not a parent, you're just a seed daddy. If you have the kid's best interests in mind you'll let this one go. Maybe reach out when they're older and able to make a decision of whether to have a relationship with you on their own.",
      "id": 121,
      "comments": [
        {
          "score": 475,
          "content": "If I imagine his ex’s side of things from two different angles:\n\n“My ex and I had an extremely toxic relationship.  I got pregnant accidentally.  He was an addict who used to blame me for his drinking, and he blocked me while I was pregnant.  That made me take a step back and realize how toxic our relationship was and decide it would be better to do this alone.  When our mutual friend told him I’d had a stillbirth, he texted me sorry and blocked me again.  So I had my child and later met and married a man who I am still with who adopted my daughter.”\n\nOr alternatively, \n\n“I don’t know where that alcoholic asshole went.  He blocked me while I was pregnant, and I never heard from him again except some random ‘sorry’ text he probably sent while drunk. He clearly didn’t want to be involved, or he wouldn’t have blocked me, so I didn’t involve him.”\n\nThose are both more reasonable than his story",
          "id": 122,
          "comments": [
            {
              "score": 143,
              "content": "Thank you, I don't think people are trying to break it down from this poor ladies perspective. While theyre relationship was probably toxic, this guy's one side of report is giving me all kinds of red flags. She sounds like she has a happy family now and for some reason this guy wants to get in the middle of it? He didn't even check in with her or investigate the situation before wanting to sue?? I can't imagine having the audacity to assume you're giving someone else's kid a better life like that.",
              "id": 123,
              "comments": [
                {
                  "score": 120,
                  "content": "Also, biggest red flag of all; he's allowed to grow and get his act together but has just *decided* without proof that this woman who is now in a stable long term relationship with a man who adopted her daughter and had two more children with her is still that unstable toxic \"BPD\" chick he can only remember through an alcohol filled haze? He abandoned her and it sounds like she's done just fine without him.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I agree.  \nI’m really disappointed in all the ESH votes blaming mom for not trying harder to contact OP, you know after he left her during her pregnancy.",
              "id": 125,
              "comments": [
                {
                  "score": 10,
                  "content": "Not just left her, but *blocked her*\n\nIf there is any clearer indication of “I’m out!  Do not contact me!” I have no idea what it is",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 191,
          "content": "YES THIS! he left her alone during the pregnancy, relapsed, found out she had a stillbirth from a friend and texted then blocked her. She probably did it out of concern for the baby (not saying it was the right thing but when your hormonal alone and scared u do what u think is right). \nI see everyone mentioning the fact that he blocked her but not enough talk about the fact he also disappeared during the pregnancy.",
          "id": 127,
          "comments": [
            {
              "score": 59,
              "content": "Not to mention hes assuming that there was a lie about the stillbirth. There is zero proof this was ever a lie. Could very well be a case of Irish Twins and hes just assuming that because she has a kid around the same age she *must* have been lying and it *must* be his.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "Don't you love that he blames her for relapsing on top of everything else?",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 673,
      "content": "The mother's actions have no baring on you being the asshole now, which you are. You aren't a father and this isn't in the best interests of the child. \n\nYou're going to put a wrecking ball through the life of someone that is truly innocent? AFTER you blocked mom while pregnant???  Why would she think you would have any involvement when she couldn't even contact you? That's not co-parenting. \n\nBTW, any guy that insists a woman is crazy when he can no longer put his dick in her is an asshole.",
      "id": 130,
      "comments": [
        {
          "score": 439,
          "content": "BPD is like a catch-all diagnosis for asshole dudes. He thinks that it completely undermines her, and the symptoms are easy enough to manipulate non-disordered emotions, like being hurt because someone hurt you, into disordered ones.",
          "id": 131,
          "comments": [
            {
              "score": 165,
              "content": "THANK YOU.   I noticed BPD has been getting the assumed blame for a lot of relationship type posts (always only posted by men). I couldn’t figure out why and was thinking, BPD is a personality disorder, you can’t just take a medication and have it go away, and OP didn’t hesitate to call her “crazy”.  Right, bc if she did have BPD that would “justify” it.  He probably tells women with clinical depression to smile more.",
              "id": 132,
              "comments": [
                {
                  "score": 53,
                  "content": "As someone with BPD, we can have stable relationships if the other person is willing to put in as much work as the person diagnosed. It’s a team effort, and when it’s approached as such, it’s usually very successful. This coming from someone in a long term, healthy relationship with a person with no mental health issues. (None diagnosed at least) If she does indeed have BPD, this guy probably used the symptoms and mood swings to make her feel guilty for having feelings because they were a bit more intense than what he’s used to.\n\nEdit: Just adding in that people with BPD are very emotional, and therefore, we’re very affectionate. We are great partners, but we have to have someone willing to put in work with us just as we’re putting in work to control our symptoms and episodes.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I really appreciate you saying this. I have BPD and it is a daily struggle. I am into crafting and gardening, I love animals, and I care deeply about people I am close to. I like to think I'm a normal person who struggles with emotional swings and self control, and I am working desperately to improve. When I see people like OP decide that someone has BPD purely because they find that person toxic or \"too emotional\", it is extremely discouraging to me and makes me feel like I can't ever tell anyone in my life about my issues since they will assume I'm abusive or crazy.\n\nI think in general there's occasionally guys who assume that women are \"too emotional\" and it makes them \"crazy\" so I think they equate BPD with OTT emotions or behavior, even if the behavior is normal for the situation (like if the person did something awful or is provoking them!)",
                  "id": 134,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Honestly shit like this makes me feel the same way about not wanting to tell people.   I’ve been in therapy and working on it for years and I’ve never, even at my worst,  been anywhere close to as awful as what the OP claims.  Like, part of the whole thing with BPD is a distorted sense of self, I.e. a negative self image.   Any destructive behavior I’ve had was... to myself.  People with mental illness and personality disorders are far more likely to be VICTIMS of abuse than the perpetrators.  Like.  Of course I would end up in an abusive relationship, my negative self talk tells me I deserve it.   The worst I’ve done to others is not even in my actions, but my words.  Like I’ve literally told a dude “you’re the reason your father left your mother.” Immediately followed by “oh my god I’m so sorry”.   It manifests in everyone differently, and so many of the symptoms people describe when demonizing the person they want to trash talk describe a disorder that doesn’t even remotely sound like BPD.   Even at that, if she did have it, 1. There is nothing wrong with having it and 2. There is a high likelihood of comorbid disorders.   Like, fuck.  Guarantee you OP is the type that would not hesitate to take advantage of someone with BPD that got drunk, slutty, and self destructive.  God this dude is such a douche",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "THANK YOU. I have BPD, which is a fucking disability that I manage through 3x/week therapy and 5 medications (since I can only manage symptoms, not the disorder). It’s not an excuse for abusive behavior, just like ASD isn’t an excuse for neglectful behavior. Most reasonable people with means (which is a big qualifier but still) seek treatment for their conditions, and even those without means for intensive treatment are generally decent people, who you know...try to have a decent life and not cause harm. My life is just like anyone else except I have a disability. I do not wake up every morning thinking of new ways to torture unsuspecting men and wreak havoc. “It’s probably BPD :)” is the new “she’s just crazy,” which invalidates the reasons someone might be having a strong reaction — in this case, a neglectful alcoholic! And it’s deeply hurtful to the thousands and thousands of us who have done nothing more than have a chronic condition. Abusive behavior is abuse, not a symptom, and reacting to toxic treatment is a reaction. This shit drives me fucking nuts.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 558,
      "content": "YTA. Firstly anyone that says \"sHe hAs BPD\" when you can't diagnose her because you're not a medical professional just smacks of MGTOW. \n\nSecondly, blaming other people for the lack of involvement in your child's life is a YOU problem as in YTA big time. You abandoned your daughter end of.\n\nEdit: you were fine with ejaculating into a woman with your diagnosis of BPD yet you shirk the consequences of doing just that. Take responsibility and own your mistakes instead of offloading them onto everyone around you. You have choices and you always had them, yet you chose to abandon both your daughter and your ex. If you want to make amends then fine but go into it being an adult by owning up to your abandonment and the REAL reasons... You were just selfish and immature.",
      "id": 137,
      "comments": [
        {
          "score": 148,
          "content": "My mom always taught me that if you say “but” in a sentence, whatever you said just beforehand no longer applies.\n\n*”I hate to armchair diagnose, but she is spot on for BPD.”*\n\nThat is one of the many reasons I give OP a solid YTA.",
          "id": 138,
          "comments": [
            {
              "score": 28,
              "content": "Yup! Dr Phil says all the time that “but” means I just told you what you want to hear and now I’m going to tell you what I really think.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I love when people say they hate doing a thing, then proceed to do it unprompted and for no reason. No one asked for his armchair diagnosis. He gave it because he liked giving it.",
              "id": 140,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 418,
      "content": "YTA. You chose to block her. The child has 2 parents, don’t interfere in her life.",
      "id": 141,
      "comments": [],
      "relation": "Attack"
    }
  ]
}