{
  "post content": "Hey I'm 29 my husband is 34. We have an 5 month old daughter. I have decided I want to become a veggie mainly for enviromental reasons. I've been considering doing this for some time as I think meat production has a hugely negative effect. Having our daughter has made me a bit more eco conscious as I am afraid of the world she'll live in in the future. I've been trying to reduce the meat in my diet for some time. My husband doesn't want to do this and complains every time I cook a meatless meal. I am a SAHM at and cook almost all of our meals. I've told him I don't want to cook meat anymore and that if he wants to eat meat then he can cook it himself and that he is lucky I am cooking for him everyday whatever I cook. However he says that I should also at least cook meat and add this to the meal for him. He says I can't force him to change his diet and eat less meat but I say that I'm not as he can still cook him meat. He says it is unfair on him to force this major lifestyle change on him. And he thinks I am being hypocritical and petty not cooking meat anymore when I've eaten it all my life. He thinks it is silly me not cooking meat for him if he is going to do it later, as I am just saving him from cooking meat and the amount of meat cooked will be the same so he thinks the only result in this is me not doing something nice for him. But I think doing that would be a massive inconvenience for me and also it defeats the purpose of me becoming veggie in the first place. I do kinda understand his point of view. He also is unhappy that I plan to cook veggie meals for our daughter and thinks it is unfair to force her into being a vegetarian but again i don't think I am as I don't plan on stopping her eating meat in school etc. Just wondering what y'all think about this?",
  "id": 1,
  "comments": [
    {
      "score": 19090,
      "content": "YTA\n\nYou’re the SAHP and you cook most of the meals.  That is the set up that you and your husband have agreed to.\n\nSuddenly telling him he needs to cook his own meals or go vegetarian is not reasonable.  You’re either passing off a duty that you used to do (cooking his meals) onto him, without any discussion, or making him become vegetarian with you.\n\nAnd your daughter has two parents - *both* of you should have a say in the diet and mentality she is raised on.",
      "id": 2,
      "comments": [
        {
          "score": 8610,
          "content": "This vegetarian reluctantly agrees with you",
          "id": 3,
          "comments": [
            {
              "score": 2198,
              "content": "I’m not veggie but trying to cut down on my meat consumption and I agree too",
              "id": 4,
              "comments": [
                {
                  "score": 1030,
                  "content": "I'm not purposely trying to reduce meat consumption, I have just realized veggies are quicker. Now that my kid is in college, I have air fryer roasted veggies over rice cooker rice at least 3 times a week with a variety of jarred sauces. After a 10 hour day, it's just easier to throw it in the machines and 20 minutes later have a good meal with minimal effort.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 368,
                      "content": "I’ve reduced red meat to maybe one time a week for tummy reasons and I “forced” it on to my husband slowly showing him proof when he commented how good his tummy has been feeling. But I would never be this (oooop level) authoritarian with my grown husband.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 51,
                      "content": "Doesn't this mean you have to wash three pans/ the airfryer?",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 44,
                      "content": "Okay, I've been holding out on getting an air fryer.  But tell me more about throwing veggies in there, because if there's an quick and easy way to get more veggies into my kid it might be time to shell out for one.  What kinds of veggies can you cook in it?  How do they come out?",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Quick q do you pick a day and just cut up veggies or is it a day of thing? And could you recommend some sauces",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 147,
                  "content": "This 90%-veggie-only-occasional-meat-eater agrees as well.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 925,
              "content": "Another veggie here who reluctantly agrees with you. I’m not even a SAHP and I still cook meat for my husband and daughters because not eating meat is too big of a change too force into other people. If you have a division of labor that means you cook the meals and you only cook vegetarian meals, you’re forcing this on your family.\n\nI don’t eat meat because I don’t believe in killing animals for food. I want my husband and daughters to feel the same way, but they don’t. I want to respect their decisions and have them respect mine more than I want to force them to change.",
              "id": 11,
              "comments": [
                {
                  "score": 311,
                  "content": "Goodness! I could have written this.\nI stopped eating meat age 7 for ethical reasons. I am now 68. I cook meat for my husband and cooked for my now 3 adult children. Two rarely eat meat. One is a big carnivore!",
                  "id": 12,
                  "comments": [
                    {
                      "score": 81,
                      "content": "Wow I finally found someone who give up meat earlier than I did! I became a vegetarian at age 8 back in 1978… And yes I also will cook meat for others when needed. :-)",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "My vegan aunt would make me the most amazing beef briskets when I stayed with her. Bc she took it as she was responsible for keeping me nourished and respected my carnivorous diet.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "My daughter who is now 32 stopped eating meat at age 5. As soon as she figured out where chicken McNuggets came from that was it for her. Her dad, my now ex was and still is a huge meat eater. Always bought from 4H clubs( small town) each year, stocking our deep freeze each year with meat. I eat meat but only occasionally and because of the info my vegetarian daughter gives me,I eat less and less. She has tried to  “impress” friends or future partners by cooking meat and is absolutely clueless about selecting much less cooking meat. It’s weird to me because I have at least some knowledge between a chicken breast and a leg etc.. she has absolutely no idea about ANY meat. There are tons of great vegetarian recipes out there that I’ve tried because of her. \nShe no longer tries to impress and have seen her turn many acquaintances into vegetarians.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "While I don’t have to cook any meat because my husband and 10 year old are also vegetarian, I agree with everything you said. My family doesn’t eat meat for the same reason as you, but I can also see her husbands side considering this is a big change that he doesn’t want for himself. \n\nOP, can you compromise and agree to cook something on the side for him for a percentage of the meals each week?",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Not sure where you live but if you live in the US I just read an article where the USDA had given private companies the ok to sell lab grown meat, so pretty soon people will have a choice between animal meat and meat grown in a lab.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I’m in a nutrition/animal ag course right now and it’s unfortunately a bit more of a ways off than that. We have to figure out how to grow the different tissue types together, stimulate muscle tissue so it actually becomes muscle, ideally grow the meat without antibiotics, grow it in non-animal based media, and figure out how to mass produce it (again, without antibiotics and animal based media). \n\nIt’s really exciting but frustrating that not many people are making a big enough deal about it!",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 436,
              "content": "I'm a pescatarian but when my wife asks me to pick up a rotisserie chicken or pound of hamburger at the store for her, I gladly agree. I'm hard set in my personal values, but they're just that: My values. I certainly wouldn't bully her into changing her diet because my mindset pertaining to food has changed.",
              "id": 19,
              "comments": [
                {
                  "score": 65,
                  "content": "I'm with a pescatarian, although I am very much a carnivore and cannot stand fish. That said, I learned to cook fish and hunted up recipes just for him. Same with other things, I have a few allergies/Intolerances for foods I could not consume and yet learned to cook and would add to foods I was making that were not for myself. I love garlic, he did not. It was not that difficult to accommodate us both. He made the best stuffed burgers, even though he doesn't eat that.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I’m a pescapescatarian. I only eat fish that eat other fish!",
                  "id": 21,
                  "comments": [
                    {
                      "score": 7,
                      "content": "That sounds wildly expensive. You're over here eating shark head soup and barracuda patties lol.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 184,
              "content": "Veggan (i'm plant based but do eat eggs from pasture raised hens) here. Unfortunately you can't force your choices on others. Also, i hate to say it, but it's probably healthier for your child to get a varied diet while she's growing. I do the shopping and most of the cooking for myself, wife, and kid. I fix them one meal and myself another. YTA here.",
              "id": 23,
              "comments": [
                {
                  "score": 146,
                  "content": "Unfortunate you can’t force your choices on others? Really?!? It’s fortunate you can’t force your choices on others",
                  "id": 24,
                  "comments": [
                    {
                      "score": 59,
                      "content": "Yeah, that wording didn't sit well with me either.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 24,
                      "content": "Unfortunately is often used sarcastically or condescendingly... the intention is more \"it is unfortunate you don't understand...\"",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "I think they mean specifically spreading ethical choices. I think it’s unfortunate I can’t force people to be anti-racist,as I genuinely believe the world would be a better place.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 36,
                  "content": "I wish everyone was like you, no matter what diet any of us follow. Meat eaters shouldn’t force meat on vegetarians, pescatarians shouldn’t force fish on vegans, vegans shouldn’t force vegan diets on carnivores.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I wouldn't force a vegan diet in a small child (though it's perfectly possibly to raise a healthy vegan kid) however tens of millions of kids are raised vegetarians (especially counting all the lacto/ovo ones) with zero issues",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yeah pediatricians actually recommend starting kids with pureed meat when starting baby food. When you stop nursing/bottle feeding as much and they have food from other sources throughout the day, they lose protein intake. My daughter started on plain cooked puree chicken.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "But husband is forcing his choice on OP?",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "So does this lifelong vegetarian who never forced my eating habits on my husband or my kids. But I admit I wasn’t very good at cooking meat so if he wanted it done right he usually did it himself.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I’m also an agreeing vegetarian, me and my boyfriend are both veg his daughter is not and we cook her any meat she wants, same with guests.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My mom is a vegetarian and she cooks meat for my dad and I (and she's damn good at it). Both of us are non vegetarian. My mom respects the diet choices we've all made. My mom used to eat meat in her childhood but became vegetarian in her adulthood. But i do eat less meat at home because i don't want my mom to be around it too much.\n\nYTA OP!",
              "id": 34,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 569,
          "content": "My mum was a vegetarian, she'd cook vegetarian food. My dad was in charge of cooking meat when he got back. It worked out fine, they meal planned together.\n\nI feel like people get into relationships and hate eachother now. If one of you becomes vegetarian, why would you force them to cook meat when they don't eat it. You just cook it yourself. \n\nPlenty of people work and come back home to cook. I've dated a vegetarian, it wasn't a big deal and if I couldn't be bothered cooking meat but wanted it I'd bring something I could add to our meal. \n\nShe said she isn't cooking meat, she isn't making the house meat free.",
          "id": 35,
          "comments": [
            {
              "score": 102,
              "content": "So, if their agreement on her not working is contingent upon at least in part her providing meals, which is a fair compromise for both, you would agree then that it would be fair for him to then request that she started working again since she is no longer fulfilling her part of their agreement, correct?",
              "id": 36,
              "comments": [
                {
                  "score": 306,
                  "content": "I mean, if I didn't care about them as a person, yes I would do that. I wouldn't care if they felt uncomfortable making meat, I'd expect them to do it anyway. Because I don't care or value them. \n\nUnfortunately, I get into relationships with people I care about. So if my partner decided to become vegetarian and didn't want to cook meat. That's ok, as long as they don't stop me from cooking it. \n\nIf you're only in a contractual relationship, where you don't like each other and only got together to procreate then yes. You should rewrite the agreement you had.\n\nIt sounded like she was in a relationship, not in some weird contract. But maybe I read it wrong.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 195,
                      "content": "THANK YOU. I’ve seen this person all over this thread making it sound as though they’re involved in a transaction rather than a husband and wife sharing life with one another. \n\nI will never understand folks who function this way in relationship. I’ve never been concerned about how much or how little my partner does, only that everything we need to have done is done and that we’re splitting things in a way that makes sure we’re both taken care of. There are things that have become our ‘assigned’ tasks because we naturally tend to do those things (honestly our labor is divided incidentally based on who the task is easier for) but even those are subject to change on a whim for an indefinite period of time if one of us suddenly doesn’t want to for can’t do it anymore.\n\nLiving our life as a transaction would be exhausting and absolutely sour our relationship. Idk how people do this, other than based on some archaic idea of marriage as an even trade.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 106,
                  "content": "Sure, as long as he is ok with paying for his fair share of the childcare costs and doing his fair share of parenting, cleaning, and cooking.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "You seem to think she is a short order cook, not a SAHP. You realize she does more than cook, yes? I agree this should take more discussion and compromise, but asserting that doing what she is told is her job, and if she doesn’t comply to the letter, she needs to go work outside the home, is deeply misogynistic. She’s not the maid, and she is saving the home childcare and cleaning costs. She’s still making food.",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": ">since she is no longer fulfilling her part of their agreement\n\nIs their agreement that she cooks meals on his demand? Was part of their deal that dinner *needs* to have meat?\n\nHow many hours do you suggest she work for not cooking meat? If you assume that the stay-at-home parent takes on a similar amount of work for everything to be fair, how much time does she need to work for not serving meat?\n\nIf OP goes and gets a part-time job because OP's husband takes over cooking, does OP's husband then need to cook two different meals every time?",
                  "id": 41,
                  "comments": [
                    {
                      "score": 4,
                      "content": "> Is their agreement that she cooks meals on his demand? Was part of their deal that dinner needs to have meat?\n\nI don't think it's crazy moon logic to suggest that any such agreement was with the assumption that the meals she would fix would, generally speaking, be ones he would want to eat. \n\nI'm reminded of a post we had here a couple weeks ago, to the effect of \"Am I an asshole because I put mushrooms in almost everything I cook, despite my husband not liking mushrooms?\". The general consensus was, yes, she was. I don't see how this is conceptually different.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "So because she’s no longer cooking him what he wants to eat, she’s not fulfilling her part of the agreeement?? She’s still cooking full meals. He just doesn’t want to eat it. She isn’t breaking any agreement.",
                  "id": 43,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Exactly! My husband went vegan a few years ago, and even though he used to grill most of our meats, when I want some BBQ chicken I do it myself. Not a big deal. And he's retired while I work full time. Takes maybe 15 minutes to cook a piece of meat.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 543,
          "content": "She's not saying he has to cook his own meals, just the meat. It is very possible to supplement an already balanced vegetarian meal with additional meat, and cooking said meat on the side is also very easy.",
          "id": 45,
          "comments": [
            {
              "score": 1023,
              "content": "Plenty of meals have the meat cooked in.\n\nIf she’s making lasagna for dinner, does she really expect him to come home, cook up some meat, and layer it in himself?\n\nAnd their division of work is pretty clear - if she wants to stop doing some of her end, such as cooking his meals or part of his meals, that needs to be discussed.  Not just a unilateral decision by her.",
              "id": 46,
              "comments": [
                {
                  "score": 665,
                  "content": "Does he really NEED every meal to have meat? Like if the lasagna is vegetarian and still yummy is it not good enough? \n\nDoes every thing have to be exactly 50/50 100% of the time? I’d argue that her cooking all the meals, doing all the childcare, doing all the grocery shopping and meal planning, is still a lot of work on her end, no? She didn’t say she was going to stop any of that. She is simply going to cook different things. She only added to his workload if he insists on coming home and cooking additional things for himself, which is unnecessary (unless he has a medical reason for eating meat everyday…)",
                  "id": 47,
                  "comments": [
                    {
                      "score": 712,
                      "content": "Doesn't really matter if he Needs it. He wants it, is used to it, and has a right to having a real discussion when the status quo changes.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 334,
                      "content": "So if he does all the groceries and makes the money can he unilaterally go on an all meat diet and not purchase any vegetables?",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 147,
                      "content": "Does she really NEED any meal to NOT contain meat? No, she does not. She is forcing her personal preference onto him and their child.\n\nShe is effectively telling him that she is no longer going to cook for him, or their child, unless they conform to her personal choice of meal. It's incredibly self centered and AHish.",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 110,
                      "content": "Every meal doesn’t need meat. \n\nI make plenty of vegetarian dishes myself as an omnivore.  Falafel with chopped cucumber and tomatoes in a pita is one of my favorite lunches. \n\nShe is saying *none* of the meals will have meat. \n\nIf she wants to reduce meat consumption and offered a compromise of, idek, Meatless Mondays and Traditional Vegetarian Tuesday and Thursdays, it would be a compromise. \n\nInstead she is the asshole because she has decided she gets to make decisions for the household, including parenting decisions, without his input.",
                      "id": 51,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 88,
                      "content": "What's the difference between him wanting meat for every meal and her wanting vegetables for every meal",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 67,
                      "content": "If she isn't cooking meat at all, it isn't every meal.  It's zero meals.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 54,
                      "content": "She's forcing a dietary change on him in how she takes on her share of the labor in their family. It's not that \"every meal needs to have meet\" - its that she is using her power in the relationship to unilaterally impose a major change on him that he's unwilling to accept.",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "I mean, where does this compromise begin/end? If she gets to refuse to cook meat because she only wants to eat vegetarian, does he get to refuse to pay for ingredients for the vegetarian meals since that's not what he wants to eat? Or any food/snack she gets that's just for her to enjoy?",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "As someone who is anemic and they thought I literally had cancer until they figured out my bloodwork, some of us do need to eat a lot of meat, especially red meat. People with Crohn's disease cannot do a vegetarian diet because they literally cannot process it, they need animal proteins or they will starve. Etc. \n\nUnilaterally deciding to stop one thing without discussion is a dick move, no matter the altruistic ends. And could actually have health consequences. Especially on a child. He is also in charge of parenting and parenting decisions and gets a say on how his child is raised as well.",
                      "id": 56,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Every human being is unilaterally allowed to make decisions that best align with their ethics and morality at any time and choose to act accordingly. At any time.  Marriage doesn’t supersede choice and personal accountability. OP is allowed to unilaterally decide that she doesn’t want to cook something.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 173,
              "content": "I really really hate this argument. \n\nMost meat dishes have the meat cooked into the dish, not as a separate component. I am a fairly competent cook and sure, if you’re grilling tofu to toss on a salad, he can grill his chicken breast alongside (although if she agreed to cook as their negotiated division of labor, she should also be doing that). \n\nBut most dishes I cook - from chicken fricassee to lamb rogan josh to beef stew to chicken soup to lasagna - the meat is an integrated part of the dish. Saying “If you want to eat meat, you cook it separately,” means he has to be cooking his own meals and that isn’t a decision she gets to make unilaterally.",
              "id": 58,
              "comments": [
                {
                  "score": 60,
                  "content": "But if he expects dishes where meat is an integrated part of the dish, her workload is now doubled as she has to cook two completely different meals. I’m not a vegetarian but I don’t understand why my fellow omnivores seem to think you absolutely *have* to eat meat with every single meal.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 80,
                      "content": "When did I say every meal has to have meat? Please quote me. \n\nI eat and cook plenty of vegetarian and even vegan dishes all the time. Hell, I go vegetarian for Lent every year. I cook for my friends at least once a week and it’s always vegetarian because I have vegetarian friends. \n\nThe issue here is not that every meal has to include meat. It’s that she has unilaterally declared that *none* of them will and the only way he can consume meat is if he makes all of his own meals or does something like just have grilled chicken on the side. \n\nI know some people eat meals where it’s “here is a meat, cooked by itself; here is a starch, cooked by itself; here is a veg, cooked by itself.” I, personally, dislike meals like that and prefer integrated dishes. Most traditional cooking involves integrated dishes - including vegetarian meals. The components are not kept separate and not touching. Her “rules” mean no integrated meals for him and that isn’t fair. \n\nIt’s also Very Bad for her to think she can decide the baby is now going to be vegetarian with zero input from Dad.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 118,
              "content": ">cooking said meat on the side is also very easy.\n\nThat kind of depends on the cut and how you want it done.  Unless you're tossing lukewarm burger patties into a frying pan, cooking meat can require a number of steps and be quite time consuming. When I'm grilling pork belly, I need to prep the meat, season it, and watch it while it cooks to make sure it doesn't burn. I then need to clean the cooking equipment and store the leftover meat. It can be quite time-consuming. The idea that cooking meat on the side is very easy is dependent on a lot of factors.",
              "id": 61,
              "comments": [
                {
                  "score": 7,
                  "content": "Mince, steaks, burgers, pre cut chicken, pre-made enchiladas, Kievs, schnitzels- there's a bunch of things he can cook that takes less than half an hour and doesn't leave a massive mess. Save the pork belly for the weekend.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I think if I were in her shoes he'd be getting simple pan fried types to add in.  Ih ave never in my life grilled a pork belly and my husband is a simple eater. Or I would make something big (smoked, pork belly, stew, etc) once in a while and freeze into portions and bring it out when needed.  I have a vegetarian kid and have found that a lot of dishes you can make meatless and add the meat later (such as, for ex.. burrito bowls.. sure it's better if you cook the chicken or beef as part of the meal but it's not necessary, and certainly not how they do it at burrito places)  I think after a while it would be easier but there are some nights I just want to give up because I hate serving a meat heavy meal if the veggie kid is home for dinner, I feel like it's bordering on rude, even though he's told me he doesn't care lol\n\nBut this sudden refusal is just rude and inconsiderate IMO.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Meat is part of many meals, can take some time to prepare + cook and the meal tastes worse when you don't cook the meat as part of it but seperate. It's just not fair.",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "There are fantastic cookbooks out there that are made completely of recipes where you add meat to half of it halfway through.  I have one.  The author also wrote *1000 Vegetarian Recipes.*  \n\nThe author is Carol Gelles.\n\nOP, find her book on split recipes.  You will love it.\n\nAnd I am torn on judgment. Husband could easily roast a chicken or a pot roast or any type of meat he wants on Sunday during football hours and use it during the week.  I do intermittent fasting and bake a bunch of chicken breasts once week for easy protein.  It is super easy to bake a large pan of them.  It is super easy to marinade them beforehand. Cleanup is one big pan.  No one is holding the meat hostage.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 409,
          "content": "I respectfully partially disagree. I agree that OP and hubby had an agreement vis a vis division of duties, and this is, technically, a violation of that agreement. OTOH, obviously this wasn't a cut into stone, legally binding level agreement. And OP is still cooking meals that hubby can eat just fine.\n\nNow, I'm admittedly biased as I grew up in a household in which mom and I didn't eat certain foods, including certain meats/seafood, while dad did, so it doesn't feel like a huge deal to me that he may need to fry/bake/broil, etc. a piece of meat for himself to go with the rest of the meal she's made. I also have a friend in this situation (veg STAHM mom with meat eating hubby), but they just didn't/don't fight about it: She sometimes cooks meat if he wants it, he often eats veg only meals.\n\nSo idk, I think I'm a NAH/ESH--this doesn't have to be the fight they're making it and both parties should just compromise more.",
          "id": 66,
          "comments": [
            {
              "score": 252,
              "content": "I would genuinely agree if it wasn't for the last apart about her making that unilateral decision about their daughter. It tipped the scales from this could be resolved with them both giving in a bit (she cooks meat \\*sometimes, sometimes he cooks it, sometimes he goes without etc) to \"this isn't about the Iranian yogurt\" feeling. \n\nOP has started making changes and unilateral decisions and refusing to allow for anything else. It's a slippery slope and AH behavior.",
              "id": 67,
              "comments": [
                {
                  "score": 136,
                  "content": "The OP said in the post that the daughter isn't going to be forced to be vegetarian, so how is that a unilateral decision? The kid eats what OP is making, regardless of vegetarian or meat based diets. Sounds like if the dad prepped meat and the child wanted some, OP would let her have it.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 152,
                      "content": "It's a 5 month old. How does a 5 month old decide not to be a vegetarian, when mom (who makes the meals) refuses to make anything with meat?",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "She's not cooking meat for her daughter but she's not forcing her to be veg. Her daughter can still eat meat it's okay",
                  "id": 70,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "I agree with you.  Also, it depends on the emails (meals, not emails) she’s making. If she is making something that by it’s nature is vegetarian, then that is very different than making him eat a meat substitute or just leaving our ingredients.  That being said, she is still doing the cooking and making full meals, he just doesn’t want what she’s making. It isn’t even that he dislikes it, he just wants something else.  Taking out the vegetarian ideologies and just putting it in those terms makes it feel different.  If she had said it that way, would the judgements be different? If she had said “Im a sahm and I work hard to do the housework, care for our child, do the meal prep, shopping and cooking, and my husband complains that he wants something else for dinner every night even though he doesn’t dislike what I cooked.”?\n\nI also wonder if he would feel differently if her reasons for being vegetarian were related to animal cruelty or even if she just didn’t like meat. (Just wondering out loud)\n\nThey just need to find a compromise that works for them.  NAH\n\nEdit to fix words because my phone thinks it’s French",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 275,
          "content": "I pretty much entirely disagree. There's a huge difference between 'being forced to go vegetarian ' and just not eating meat in every SINGLE meal. Agreement or not, having a spouse cook for you daily is a *privilege* and if she's decided on a personal and moral level that she's not cooking meat anymore, he as her partner should respect that. He can still get meat - he's a grown man. \n\nAs for the daughter, they should have joint say, I agree. But again, school, daycare, and friends/family out of home can feed her meat all they want. This woman is under no *obligation* to keep cooking meat she won't eat.",
          "id": 72,
          "comments": [
            {
              "score": 97,
              "content": "Its also a privilege to be able to be a SAHM while your spouse brings in the money that you require in order to eat and have a roof over your head.\n\nIf he doesn't get to unilaterally say what the money is spent on, she shouldn't be unilaterally making food the other person doesn't like.\n\nWe had an AITA that was similar: the one with the chore of cooking only made food the other person didn't like. Reddit sided with the one who didn't like the food, saying that if your chore is to cook for 2 people, you are obligated to make food both people like. \n\nWhy is this one so different?",
              "id": 73,
              "comments": [
                {
                  "score": 182,
                  "content": "It is a privilege to have a person stay at home and take care of your child and your home so that you can advance at work.   You act like she is just laying around eating bon bons or something.  She gets to make choices about what she wants to do within that space.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "It's an absolute privilege to have someone cook and clean and raise your infant for you, along with organizing and running a household and family and all the commitments and work that entails.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I didn't see that thread, but from your description of \"only cooked food the other person didn't like\" that makes it sound blatantly like someone trying to be petty and get out of a chore.",
                  "id": 76,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 216,
          "content": "Nonsense. She's not refusing to cook him meals. She's declining to cook meat. He can eat the perfectly fine perfectly healthy meals she makes, or he can cook his own meat and add it to those meals, or he can cook his own meals from scratch. She's not a short-order cook, she's not his mother, and he's a grown man who is perfectly able to feed himself if the meals his wife cooks aren't to his liking.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 130,
          "content": "Honestly, at the point where she said her husband is “lucky I am cooking for him everyday” I lost all sympathy. Because if he clapped back with “you are lucky my paycheck is enough to support our family on a single income” you can guarantee OP would be offended. \n\nHer husband is not “lucky” that they have an agreed upon division of labor, and if she wants to add to his labor at home, I’d like to now where she is compromising. Since she decided to make a unilateral decision that will effect more than just herself. \n\nIf she wants to be vegetarian, fine, but if her role in the family includes cooking for the family, she needs to cook for the family, not just what she wants. OP is being really selfish here. And trying to claim she’s not.",
          "id": 78,
          "comments": [
            {
              "score": 13,
              "content": "I agree with this with the caveat that that’s assuming they started with an equal division of labor.  I’ve seen enough threads here with stay at home parents swamped with childcare and chores and the working side having much more time off and less stress.\n\nIf that kind of thing isn’t going on, then yeah this is well put.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "The division of labour is when he is at work, is it not? He has a 9-5. She has a 9-5 (in the home). Or are you trying to argue that she needs to work 100% of the time doing ALL domestic labour because he makes money? Not to mention, the husband can eat vegetarian! He can eat meat outside of the home, or make his own on the side. He is not entitled to her forced labour in this regard.",
              "id": 80,
              "comments": [
                {
                  "score": 5,
                  "content": "Forced labor, lol. It's a family, partnership. Want to cause problems, do this stuff. It goes both ways.",
                  "id": 81,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 104,
          "content": "Would that same thing apply if she had an allergy to fish? Or decided she wanted to cut back on carbs? What if she decided she was done baking and eating sweets?  Her job is to provide healthy, balanced meals. Not a catering menu.",
          "id": 82,
          "comments": [
            {
              "score": 3,
              "content": "[deleted]",
              "id": 83,
              "comments": [
                {
                  "score": 6,
                  "content": "I don’t. But I also don’t know they’re not. I didn’t say “she’s providing meals, so back off”. I said her job is to provide healthy, balanced meals.",
                  "id": 84,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "I agree with this and I want to add: \n\nIf OP’s husband suddenly had to consume a low-sodium or low-sugar diet, would OP set aside a portion of food without salt, or with less carbs? If the answer is yes (which it should be,) then she’s doubly the AH, bc she’s opting not to be considerate bc she thinks her values supersede his, and that in and of itself is AH behavior. YTA, OP.",
          "id": 85,
          "comments": [
            {
              "score": 164,
              "content": "I mean, I think if her husband had a health issue requiring her to make him something different for dinner that would be vastly different than him just wanting to eat meat at every meal, but maybe that's just me.",
              "id": 86,
              "comments": [
                {
                  "score": 21,
                  "content": "yeah I agree. meat eaters getting way too defensive here",
                  "id": 87,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I’m a meat eater but I also have… basic communication skills and like to value my partner’s choices",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Nope it's not just you.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "Or she could have them all eat less sugar and salt and just make the one meal. Which is far more reasonable",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "That’s an incomparable argument as that’s a diet for medical need. Husband has no moral, medical or environmental objection to eating vegetables. It’s not even stated that he doesn’t like them.",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "As the stay at home parent, you eat what I cook. You don’t like it? Make your own. I don’t dictate what you do at work, don’t dictate what I do at mine. Husband supports that entirely.",
          "id": 92,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5666,
      "content": "Relationships have a division of labor.  It sounds like one of your responsbilities is cooking.\n\nI'm going to say YTA, on two accounts.\n\n1.  This is part of your division of labor, and you've just decided out of nowhere, to stop cooking meat - which he clearly likes/expects, and I'm assuming is what he's normally eaten.\n\n2.  Your child is both of yours;  not just yours.  It doesn't seem correct that you get to make a decision that the child will be vegetarian.  That should be a joint decision.",
      "id": 93,
      "comments": [
        {
          "score": 1034,
          "content": "It’s also important for the child to have a choice. Im vegetarian but I would want my kid to make that decision by just giving them information when they’re older. Otherwise, they can build resentment. My fiancé also doesn’t eat meat and I technically wouldn’t mind making him some (except that it’s been five years and I went vegetarian right after adulthood so I don’t super know how). If we’d been eating meat together and I suddenly changed my mind, I’d throw meat in there a couple times a week or have some sort of discussion.",
          "id": 94,
          "comments": [
            {
              "score": 593,
              "content": "Isn't the daughter 5 months old?  She's not in a position to make any kind of choices yet.",
              "id": 95,
              "comments": [
                {
                  "score": 499,
                  "content": "She can't even have water yet let alone make these kind of choices",
                  "id": 96,
                  "comments": [
                    {
                      "score": 107,
                      "content": "Someone parents. The kid should not be made to eat full on meals yet.",
                      "id": 97,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I just meant giving it as an option as she grows up. Obviously not right now.",
                  "id": 98,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I’m a longtime vegetarian with a 7 year old who is not. She eats less meat than most but I don’t keep it from her because I agree with you- that is a personal choice. Plus it would be awfully difficult to send a kid to school or friends’ houses with such a restriction. OP may want to think this through.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My wife and I are in a similar situation. We both ate meat when we met. She's slowly become vegan over the years. She is not a sahm and we generally split cooking responsibilities. We just had adult conversations about it. She expressed her desire not to handle or eat meat while I opted to continue eating it and prepare it for myself. We don't eat many of the same meals any longer. Our kids have a choice of either and/or both of meals we prepare (they both love meat like me).",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I don't think it's important for the child to have a choice here.  Most children aren't given \"the choice\" to be omnivorous, they just eat what their parents prepare.  They can obviously make a choice when they're older, but feeding children a vegetarian diet is no more or less moral than feeding them an omnivorous one.",
              "id": 101,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 359,
          "content": "You’re missing the part where she says she isn’t going to force her daughter to be vegetarian - she’s going to cook vegetarian meals for her at home but says if she eats meat at school or elsewhere she has no problem with it.",
          "id": 102,
          "comments": [
            {
              "score": 497,
              "content": "Here's the thing. If children don't grow up having meat in their diets, they may not develop the enzymes needed to digest meat. So she may be forcing her daughter to be vegetarian or risk severe digestive issues.",
              "id": 103,
              "comments": [
                {
                  "score": 200,
                  "content": "Exactly! At the very least OP should consult with a nutritionist and inform herself on how growing up vegetarian might impact her daughter. I Know it is not as restrictive a lifestyle as veganism, but still she might need to suplement her diet in special ways. \nI admire her commitment to the plannet but there're plenty of ways to help out/compromise, like investigating where the animal products you consume come from/how they were produced. NAH but maybe inform yourself further.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I don't know why everyone gets so upset over a child not being fed dead animals. My kids have never eaten meat. I was very concerned over whether this would be a problem. I have spoken to three pediatricians about it, as well as my own doctor, and they have all reassured me that it's absolutely fine. There are many other sources of protein and iron. Every doctor I have asked has actually seemed surprised that I would think it's a problem. It is just so ingrained in American society that you need meat to be healthy, and it simply isn't true.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 158,
                  "content": "Do you have any research to back that up?\n\n“Svihus points out that meat is actually relatively easy to digest.\n“Proteins are generally hard to digest but compared to other sources of protein, meat is rather easy,” he says.”\n\nhttps://sciencenorway.no/diet-food-forskningno/does-meat-make-vegetarians-ill/1390294\n\nAs an anecdote, my 3 children are raised similarly to how OPs suggesting. I served them vegetarian, but their father and others were free to serve them meat and none of them have digestive issues with meat consumption.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I had a sub in school once who talked about how she raised her son vegetarian and he started eating meat. Nothing bad happened to him. Sometimes if you go a long time without eating red meat it can make you sick but not permanently, just the first couple times",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 148,
                  "content": "This isn't true, it's one of these myths that's thrown around. I'm doing the same thing with my daughter & have spoken to a dietitian about it, who is monitoring my daughter for unrelated health conditions. The reason some people report discomfort after eating meat for the first time in a long time is because they eat loads of it at once or as part of a big food binge. Evolutionarily it doesn't make sense either - meat is nutritionally really dense so being not able to digest it would be a big disadvantage.\n\nShe's only one, but her father has been an ethical veggie since he was 11. I eat meat (but am mostly veggie since it's easier to cook one meal and I think it's needed for eco reasons). We think she should be able to choose to not eat meat when she understands, that it protects her future by being  more eco, and challenges us to make her diet healthier.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 78,
                  "content": "My eyes just rolled ALL the way back. Please provide ANY reliable source for this.",
                  "id": 109,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 49,
                  "content": "Is there any actual science to back this up? I always here this but it makes no sense. Your body uses the same enzymes to break down protein, as all they're doing is cleaving peptide bonds. Pepsin breaks down whole proteins into smaller pieces, and enzymes like trypsin, chymotrypsin, elastase, carboxypeptidases, aminopeptidases, dipeptidases, and tripeptidases do the rest of the cleaving. I see no reason why there would be any enzymatic difference between meat and plant proteins. Some proteins may be easier or harder to digest in general, but the biological machinery used remains the same.",
                  "id": 110,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 43,
                  "content": "Source?",
                  "id": 111,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Pseudoscience. Great.",
                  "id": 112,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "There's no such thing as meat enzymes.",
                  "id": 113,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "On the flip side, I became a vegetarian when I was a preteen and continued that for about 20 years. I found it appalling that my parents had been feeding me meat as a kid long before I understood the ethical side of it, and it made me resent them. On top of that, when I became a vegetarian I spent the next 5-6 years being made fun of by all the meat eaters in the house and got forced to make my own meals at 13-14 years old, which is difficult to do pre-internet, can't drive, no access to recipes. I basically ate junk food and whatever produce they'd buy (which wasn't much.) I'm almost 40 and still resent my parents for making that decision for me and then ruining our relationship when I did decide to become vegetarian. I would've much preferred having the opposite - being raised vegetarian and able to make the choice to consume meat once I understood what it was. \n\nJust because it's the \"norm\" for most parents to give their kids meat doesn't mean it's right or doesn't mean it can't backfire later on. Plenty of kids are raised vegetarian or even vegan and are healthy kids.  A parent choosing that route for their child, if they take the time to understand nutrition and what a developing child needs, shouldn't be shamed just because it's not something their peers are doing.  It's a legitimate lifestyle choice.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Daughter is 5 months old - she can't have meat yet anyway - husband can easily give her a little when she's older, either out at a restaurant or at home if he cooks",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 62,
          "content": "If it’s her division of labour, and she’s still doing it, why does he get to dictate the things she has to cook?\n\nNTA",
          "id": 116,
          "comments": [
            {
              "score": 92,
              "content": "Because both people still have to agree to some extent on how the labor is done. \n\nIf the hubs does laundry and crams in all the colors and whites together and starts \"ruining\" clothes does he get to say \"I'm doing this job my way and no one else gets a say!\". \n\nIf the Hubs does the dishes but puts the dishes away in the cabinets with no rhyme or reason does he get to say the same? \n\nOf course not. \n\nDivision of labor doesn't mean each task is completely siloed and above reproach or input from affected parties.",
              "id": 117,
              "comments": [
                {
                  "score": 3,
                  "content": "Both of those are examples of jobs not being done properly, resulting in negative consequences. So long as OP is making every meal tasty and nutritious she's still doing the job properly, with no negative consequences aside from \"boo hoo no meat\".",
                  "id": 118,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Imagine the other way around. Husband is vegetarian, wife insists on cooking nothing but meat based meals. Still fair?",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3286,
      "content": "YTA, and raising your daughter vegetarian a) isn’t your decision alone to make and b) is entirely unfair to your daughter.\n\nWhat if your husband says “I make all the money, don’t buy any food I don’t approve of” do you think he would be an asshole in that situation?",
      "id": 120,
      "comments": [
        {
          "score": 597,
          "content": "[deleted]",
          "id": 121,
          "comments": [
            {
              "score": 201,
              "content": "It’s taking a potential lifestyle away from her on top of the health concerns. Even operating under the assumption OP knows what it takes to raise a healthy child without meat—a staple of human diet, which is in itself a huge assumption, what if the kid likes meat? Should she be forced to consume only veggies because of her mother’s morals?",
              "id": 122,
              "comments": [
                {
                  "score": 659,
                  "content": "Kids eat whatever there parents eat. Moral considerations aside and don’t “choose a life style” regarding food until they are much much older. A little kid in the rural Midwest probably doesn’t eat a ton of Ethiopian food. A little kid in Addis Ababa probably doesn’t eat a ton of hamburgers. Neither kid in either situation is making a life style choice here and both are eating what they would consider “normal” food.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 134,
                      "content": "Well my little cousin stopped eating meat at 3-4 once she understood where it came from. Although she ate hot dogs because she didn’t believe they’re meat. She’s 17 now and still vegetarian (even stopped the hot dogs now)",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 181,
                  "content": "Wouldn’t making her eat meat be the same thing, forcing a lifestyle upon her?",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 132,
                  "content": "She's not being forced. She's allowed to consume meat (at friend's places, at school), the parent just isn't cooking it at home. So yes, less meat definitely, but she is not being forced to not eat meat.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "> It’s taking a potential lifestyle away from her\n\nomg the people in this sub are so fucking dramatic about not eating meat lmfao 🤣🤦🏻‍♀️ with that logic, wouldn't raising an omnivorous daughter be taking a vegan lifestyle away?",
                  "id": 127,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Hate to break it to you but the climate crisis that OP is trying in a small way to address is a way bigger issue for this kid than maybe being vegetarian-ish in her early years of life. \n\nThe kid is going to be fine without a ton of meat - most people eat way more meat than is healthy. OP isn't forcing her child to be vegetarian per her edit, and as long as she's making an effort to serve somewhat healthy food there seriously isn't an issue... the whole \"but they'll never be able to digest meat\" thing is a myth. Husband or maybe OP can just cook a batch on the weekend for him to use as a side throughout the week. \n\nAlthough I will be downvoted to hell, NTA",
                  "id": 128,
                  "comments": [
                    {
                      "score": 5,
                      "content": "The climate crisis that is in large part being driven by corporations and industrial factories. That no matter how little or how much meat we consume won’t change an ounce because of individual choice. The most successful gaslighting corporations have done of the century is taking their fault and pinning it on individual consumers.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Bullshit. \nA balanced vegetarian diet is much mire healthy then a meat based diet.",
                  "id": 130,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "I’ve always been a vegetarian because my mom was one when I was a kid and she’s who I lived with. My dad wasn’t, but I still didn’t eat meat at his house. That was my choice. If the kid wants meat, it can get it from the grandparents or anywhere else. It really isn’t as big a deal as you think it is. There are many other sources of protein available, now more than ever before.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "But OP said she wasn't going to force the daughter to only eat vegetarian? So that wouldn't be a problem",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "she literally can eat meat at school or restaurants. or if the dad cooks it for her",
                  "id": 133,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "It's really not hard to raise a kid without meat. Like maybe being vegan would difficult, but like vegetarian is simple.",
                  "id": 134,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 154,
              "content": "[deleted]",
              "id": 135,
              "comments": [
                {
                  "score": 143,
                  "content": "Not if done correctly under doctor supervision.   Poeple forget that there are billions of vegetarians in other countries that practice Hinduism and Buddhism and they're all quite healthy.  Way more than an Standard American processed-ass meaty diet.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 207,
                      "content": "Not to be pedantic here but I'm from India where a large part of the diet for most people is vegetarian and as a population we are chronically protein deficient. There are also deficiencies of vitamins B12 and D3 in most of the population. Our diet is a lot healthier in all the ways you're describing but definitely not perfect. Plus the lack of animal protein in certain classes and demographics is largely believed to be the cause of decreasing stature in both children and adults. Everyone gets too hung up on vegetarianism vs meat eating when the real problem everywhere is not thinking holistically about nutrition, health, and variety of food sources.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 50,
                      "content": "[deleted]",
                      "id": 138,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "That’s not how that works, we don’t just lose the ability to digest amino acids and fats because we didn’t eat meat as a child. Trust me, I was raised vegetarian from birth and my first experience of meat was a ribeye when I turned 18, I was fine. You’re not crippling their ability to eat meat by not raising them with it",
                  "id": 139,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "She said clearly she isn't raising the daughter veg.",
          "id": 140,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "I was raised vegetarian (in that we ate vegetarian at home, but could eat whatever we wanted elsewhere) and I very strongly disagree that this is in anyway unfair to or potentially damaging to children UNLESS their diet isn’t appropriately varied and nutritious.\n\nMy parents were eco vegetarians and didn’t moralize about it, and didn’t scold us for eating meat when we were out and about.\n\nI’m not vegetarian now, and don’t resent my parents for not serving us meat. It’s not like they denied me something critical or raised me in a cult. I ate better than most of my friends, and was more open to trying “weird” food than most people I know as much of what we ate at home was already considered “weird.”\n\nPeople are acting like not eating meat at home will fuck a kids life up 🙄 it’s not that deep.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1797,
      "content": "This is a division of labor problem/problem of compromise. It can’t really be decided unless we know 100% of the ways both you and your husband contribute to the relationship.\n\nHOWEVER you should 100% be able to not cook meat (I would still buy it for him) maybe this means you do some chore of his as a trade but IS HE EVEN DOING ANYTHING beside working??? This is very IMPORTANT INFO for a judgement \nSo far your husband is an asshole for insisting on meat meals and acting like a baby when he sees some veggies instead of appreciating that there’s a warm meal on the table for him.\nNTA",
      "id": 142,
      "comments": [
        {
          "score": 775,
          "content": "Exactly, op is a SAHM, and in almost any other post people would be saying why doesn’t he cook if he has such strong preferences, what’s wrong with his hands. I have really no idea why people think that because she’s a SAHM shes obligated to cook him whatever he wants, and that if she doesn’t it’s ok that he belittles her beliefs. \n\nOP if your husband otherwise divides labour when he’s not working in an equitable way then it seems that cooking is something that needs to be negotiated. Without more info I’m leaning towards ESH.",
          "id": 143,
          "comments": [
            {
              "score": 291,
              "content": "Usually in posts like this we see here the person who wants to change diets isn’t the primary cook, IOW they’re creating extra work for the person who does cook. In this case it’s the person who does all the cooking who’s making the change, which makes it a less clear cut issue IMO. People are also usually called TA for trying to enforce their dietary choices on others, which OP technically isn’t but also kinda is?\n\nThere’s something about this OP that rubs me the wrong way, but I can’t figure out what.",
              "id": 144,
              "comments": [
                {
                  "score": 166,
                  "content": "Except meat eaters do eat veggies, while vegans do not. That's a difference. And if you're vegetarian for some time you might get uncomfortable around raw meat. I'm not vegetarian yet, but i can't handle meat at all. I haven't prepared chicken since 2019 i think.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Yeah but to unilaterally change the division of labors around the house is a big asshole move. Cooking is one of her chores, and we cannot just assume that there is an uneven distribution of labor. Saying \"if you want meat just cook it yourself\" when she is the one in charge of cooking and she is the one completely changing her lifestyle and forcing her change onto her husband by stopping cooking meat entirely is an asshole move. Becoming vegetarian is her choice, but she still has to cook her husband non vegetarian meals. Saying that her husband can just cook meat for himself means that either her husband changes his alimentary habits or changes the distribution of labor. Neither is acceptable. OP is TA.\n\nAlso, she is forcing a dietary change onto her daughter as well, and children need meat nutrients to grow, even if we assume that she knows how to prepare a vegetarian diet for her child, she is still making a major AH for enacting that change without letting the husband have a say in it. Just because she pushed it out, doesn't mean that the child isn't his as well",
                      "id": 146,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "Many people are vegetarian because they hate how animals are treated and it disgusts them. But some people become vegetarian to help the environment.  And sounds like she only started caring since she became a Parent.",
                      "id": 147,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 244,
              "content": "It's because Reddit is very anti vego/vegan is why they're trashing her so hard compared to all the other posts of husbands stomping over their wives boundaries.",
              "id": 148,
              "comments": [
                {
                  "score": 107,
                  "content": "It's bizarre. I came in here fully expecting NTA and got this vehement backlash instead. She's not stopping him eating meat - presumably with him being at work he can eat canteen food or whatever? - and quite frankly treating it like a ~lifestyle when it's just removing an ingredient from cooking is hysterical nonsense. I don't eat or cook mushrooms because I hate them, is that a lifestyle choice I'm forcing on anyone I might cook for? \n\nI'd maybe get it if she was going vegan as that's more of a change and a lot of people just can't do vegan diets without needing supplements, but expecting meat for every single meal and dying on that hill is immature bullshit.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "yep. reddit hates anything to do with veggie people.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "This whole thread has me feeling so demoralized. As if agreeing to be a sahm and opening yourself up to all sorts of fucked up power dynamics isn't scary enough, apparently it also makes you unworthy of having your own low-stakes, personal moral boundaries.\n\nPosts like this remind me that there is no way in fucking hell I would ever give up my career to do uncompensated domestic labor, at my own opportunity expense, even if it were necessary for my household to stay afloat.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I disagree that to stay at home mom is required to cook dinner at all! It totally depends on what they agreed to",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yeah I was surprised by those remarks too. My brother is a working parent and contributes to cooking many times, as did my father when he was able.\n\nSeems like they need to readdress division of labor but from the sounds of it he is not willing to compromise.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "They don't think that because she's a SAHM she's obligated to cook whatever he wants. If it was reversed (husband wants to go veggie, SAHM wants to continue eating meat), people would be taking OP's side, saying that if husband wants to go veggie, he can cook his own special food. People are triggered by the mention of vegetarianism and are feeling defensive.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 271,
          "content": "This is what boggles my mind when people talk about sahm parents. He goes to work, works at work, and then comes home to put his feet up. She does all household work and takes care of child, all day, all night, every weekend, no breaks. Dividing labor like that doesn't make sense to me. The least he could do is cook his own meat. He could literally cook a big batch of something on Sunday and add it to whatever she makes all week. Or he could suffer through 1 meatless meal a day (the HORROR)",
          "id": 155,
          "comments": [
            {
              "score": 207,
              "content": ">He goes to work, works at work, and then comes home to put his feet up. She does all household work and takes care of child, all day, all night, every weekend, no breaks.\n\nWhere did you get this information from? Because she doesn't say anything even resembling that in the post itself.",
              "id": 156,
              "comments": [
                {
                  "score": 57,
                  "content": "You're right, it's not in OP's post. I was basing that comment off of all the comments arguing division of labor and stating that husband works and op is responsible for the household duties. I was simply stating that if OP is in charge of everything besides her husband's literal job, then that's not an equitable distribution of labor, so division of labor argument fails everytime.",
                  "id": 157,
                  "comments": [
                    {
                      "score": 106,
                      "content": "Well yeah if you make up a completely one sided agreement and then pretend that's their actual agreement I'd imagine it wouldn't be very equitable.",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "So you're just making shit up... Gotcha.",
                      "id": 159,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 40,
              "content": "Saying that he comes home and puts his feet up is pure conjecture. I am a working father and my wife is stay at home mother. Guess what happens when I come home? I take over care for my child. I know there are a lot of fathers out there that don't do this, but that doesn't mean you can make that assumption.",
              "id": 160,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": ">Where in the Original post is any division of labor addressed other than the cooking?  I seem to have missed her claim that she did all the housework/chores/baby care.",
              "id": 161,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "So you're sahm, right?\n\nBecause otherwise you wouldn't be this defensive about the truth. No. The least SHE could do is to cook a meal for the guy who feeds the household with his work.",
              "id": 162,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Is he even doing anything besides working? There was nowhere in her story where she said he was lazy and not helping around the house. Don’t be so fucking judgemental",
          "id": 163,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Yes, I agree based off of some assumptions NTA… another commenter said or unfair to the husband because it was the duties she AGREED to, but we don’t actually know that.\n\nIt very well could be that she cooks all the meals because no one else will and now she’s expected to. \n\nIf she expected to do manage and complete 95% of the household tasks, then what’s the big deal if he “HAS” to cook his own meat.\n\nShe’s still providing warm, nutritious meals. When I was a kid and I didn’t want what was served, I could make myself oatmeal. Maybe that’s what the husband should do!",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Is he incapable of getting a piece of chicken and slapping it onto a pan? I have absolutely no idea why this woman is expected to be his maid",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1532,
      "content": "NTA but you're not going to get any fair answers from the cult of meat of the internet.\n\nIn LITERALLY any other post, Redditors will support their Sistas when they draw boundaries and negotiate with their partners, e.g. how they cook and clean and split money, etc. I don't see how you situation is any difference except for your trying not to kill innocent animals.\n\nEven worse is I've seen at least 3 posts today where the same Redditors complaint and judge people fort mistreating animals and keeping them in cages when they're pets. The cognitive dissonance is frightening.\n\nLet the downvoting commence.\n\nEdit: thanks so much for all the awards!\n\nI never expected 17 awards for this comment. I thought I would just be downvoted and nobody would even see it.\n\nThanks so much for those of you who stay open-minded on how we can be better to each other, the animals, and the planet🌱.",
      "id": 166,
      "comments": [
        {
          "score": 1373,
          "content": "I can't imagine demanding anyone cook meat for me because I'm a \"homemaker\" and \"that's my job\" lol. It's fucking weird that everyone is declaring her a huge asshole when she is still cooking everything, a wide variety of food, except won't cook meat anymore. She isn't even banning meat from the household OR her daughter and husband's diet. Just saying for ethical reason she herself won't cook it anymore. Just really strange responses to this post. Like, she signed some kind of blood oath years ago to cook meat for him and isn't allowed to change as a person at all or choose what she cooks because she is just the housewife lol.",
          "id": 167,
          "comments": [
            {
              "score": 585,
              "content": "The comments I’m seeing are not calling her an AH because of her new-found vegetarianism.\n\nA discussion between partners about shifting responsibilities is in order here and her unilateral decision making plus no-compromising approach to meat is what’s making her the AH. \n\nWhat if she decides to stop buying meat at the store for the same reasons she doesn’t want to cook it? What if the husband suddenly became a health nut and decided to be uncompromising on allowing any desserts/snacks to be bought, it’s his money after all?\n\nObviously would not cool",
              "id": 168,
              "comments": [
                {
                  "score": 377,
                  "content": "My partner and I are not vegetarians but if he decided he wanted to cook only vegetarian I would just be grateful for what he prepared and I would probably be healthier for it. If I wanted meat, I would just incorporate it into my breakfast or lunch. Or buy a rotisserie chicken I could throw into my dinner (and daughter’s meal). When we eat out/order in I could include a meat dish for myself and daughter. I don’t understand the big deal about eating one vegetarian meal per day a few nights per week?",
                  "id": 169,
                  "comments": [
                    {
                      "score": 244,
                      "content": "My husband and I aren't vegetarian either, but he often cooks vegetarian meals and I just eat what he cooks. People act like skipping meat for a meal is the end of the world.",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I'm not vegetarian, but I've been doing meatless mondays for a few years now.  My GF does the cooking (because I suck at it) and will cook veggie meals for me on Mondays when she's able.  sometimes she has the same meal and sometimes she has some meat.  \nIt's all about working together and communicating.  \nBut, him DEMANDING that she cook meat is also an issue.",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 136,
                  "content": "Not sure if you’re being sarcastic and sorry if you were - but it’s not *his* money. \n\nThey’re married and she works at home with their child just as much as he works wherever he does.",
                  "id": 172,
                  "comments": [
                    {
                      "score": 19,
                      "content": "You're right. It's their money, childcare isn't free.",
                      "id": 173,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 113,
                  "content": ">What if she decides to stop buying meat at the store for the same reasons she doesn’t want to cook it? What if the husband suddenly became a health nut and decided to be uncompromising on allowing any desserts/snacks to be bought\n\nI love how you present two entirely different situations as the same.\n\nOP isn't banning her husband from buying, cooking or eating meat, yet you just couldn't resist that comparison. If OP didn't want to buy meat anymore, that would be okay. Her husband could still go out, get himself meat and eat that. If OP's husband suddenly decided that OP could not buy or eat a certain thing, *that's an entirely different thing*. Why would you draw that kinda comparison in the first place? That's not at all what's happening.",
                  "id": 174,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 101,
                  "content": "Anyone is able to say at any point in time “this is against my ethics and I’m no longer going to participate in this”.  I can’t believe all the people expecting OP to continue cooking and buying meat when she’s said it goes against her sense of ethics.  People  are still allowed to have their own - changing and evolving - beliefs and choose the behaviours they put out in the world - regardless if they are married.  \n\nOP - youre not the asshole for not cooking meat now that you’ve decided the meat industry is not in alignment with your ethics and morality. You are not a static unchanging facsimile of your former self and you are able to make you own choices.  \n\nIf your husband doesn’t want to eat the food you make, he’s welcome to make his own.",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "So much false equivalence here. She allows meat, she just won't cook it. I'm pretty sure she'd rather not have any in her house, yet she's not imposing.  It's the definition of compromise.\n\nBut also, is this man missing arms and hands? He can't take 15 minutes of his life to grill a steak? How \"heteronormative\" of him, to reference another post here. Absolutely ridiculous that Reddit is calling out OP\n\nNTA",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 202,
              "content": "I’m sure that she promised to love, honour, obey, provide agreed-upon services, and never re-examine her ethics or worldview. It’s only reasonable that he hold her to that! \n\nAnd if she doesn’t like it, she should pack their infant into its storage crate, get a job, and pay for her own beans.  \n\n/s",
              "id": 177,
              "comments": [
                {
                  "score": 147,
                  "content": "Laughing at this. So true.  Also love how “Stay at home parent” is being treated as this great life luxury and position of privilege she’s squandering….like hello, OP has 5 month old (likely breastfeeding ) infant. Staying any where else isn’t really an option at this point. \n\nBut please OP, cook an entire second meal with your surplus of free time and excess energy because as a new parent, you clearly spend the day lounging and eating bonbons, and certainly not sleep deprived, covered in child vomit, and touched out.  Bet the house is spotless too! 🙄\n\nSMH. Hang in there moms.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 169,
              "content": "I do all of the cooking in my house and really dislike cooking/handling raw meat because of OCD issues. When my husband wants to eat meat, he cooks up a steak or something. Or we buy pre-cooked meat. It’s really not a big deal. \n\nI can’t imagine him demanding I cook something I’m uncomfortable with.",
              "id": 179,
              "comments": [
                {
                  "score": 3,
                  "content": "Right? I can’t stand raw tomatoes and I get grossed out by raw meat so my partner handles those. We’re both meat eaters but he loves cooking vegetarian meals and if he’s cooking I’m just happy to get a homemade meal. This is so much less dramatic than it needs to be.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 158,
              "content": "Right!? It’s actually quite shocking and even misogynistic.. OP is caring for a baby, she’s not sitting on her ass at home. Everyone calling for a “division of labour” is unbelievable - there clearly is no division of labour with cooking at the mo and OP has been doing it all. She’s not her husbands personal chef and should not be treated as such. Her husband is lucky to get cooked meals all the time at all.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 114,
              "content": "I hate turnips.  I’m happy to cook for anyone, but nothing I make is ever going to include turnips.  If you’d like turnips, instead of something I’ve made, or in addition to, you’re welcome to make them, I won’t stop you - I’m just not going to cook them because I think they’re gross. \n\nI don’t see how this is different.  OP is fulfilling every part of her agreement, shes putting food on the table every night. She’s  just not cooking a particular ingredient because she hates it.  \n\nIf my husband made me cook turnips every night even though he knows I hate them, I’d think he’s a jerkface.  Im not stopping him from eating them, I just don’t make them the feature of dinners I prepare.  \n\nImagine requesting your wife to make a completely separate meal because she didn’t include turnips in the meal she made for the rest of the family.",
              "id": 182,
              "comments": [
                {
                  "score": 16,
                  "content": "I do almost all the cooking in our house (because I WFH and because I like to cook). I'm allergic to dairy and to shellfish. I don't cook anything with dairy. I am not putting in the time if I can't eat it too. But my husband and kids are welcome to cook anything they want with dairy. I just am not putting in the time myself.\n\nOTOH I am anaphylactic to shellfish. They can eat it outside the house but not ever coming into our house. Full stop.\n\nOP is NTA. husband can cook the meat, eat it at lunch or when he is out or stfu and just eat the nutritious and tasty meal prepared. NTA\n\n&#x200B;\n\nETA:my kids are teens they can cook. When they were little (and I mean younger than 7)I would cook one off things with dairy if they wanted it or I needed an easy meal to feed them (quesadilla, grilled cheese, etc) but after 7 or so they even knew how to cook that for themselves. But interestingly because my husband and kids aren't AH if they are cooking something they only cook things with dairy if I am not home or after confirming I have something else I can and want to eat.",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Username definitely checks out. I agree though, turnips suck.",
                  "id": 184,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Let’s be real, turnips are pretty shit.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yeah it’s gross to handle meat if you have gone vegetarian.",
              "id": 186,
              "comments": [
                {
                  "score": 5,
                  "content": "Ome of the reasons I became vegetarian is because I thought raw meat looks gross as hell to me. I personally don't prepare meat at all because I never learned how to prepare it (I had just turned 12 when I stopped eating meat, 11 for fish) and you can get really sick if it is not prepared right. \n\nLots of meals have a vegetarian base anyways and you can add stuff later on. I do the same with things like certain cheeses and mushrooms when I cook with one of my friends. It not really any different. Meals here in my country often have meat of meat substitutes at the side anyways as well.\n\nI don't blame her for not wanting to look at obviously dead animal insides, skin, whatever you wanna call it and he is still free to eat it. Maybe he can prepare something beforehand as well and she can pop it into the over the day after or somethinf before he gets home of its a longer dish. And some hamburger costs maybe like 10 minutes?\n\n3dit: and she is not forcing them to stop eating it at all. That would make her an AH but it is not",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "The smell might even make her feel sick after a while. I'm sure that some people here would be fine with her discomfort, though.",
                  "id": 188,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 408,
          "content": "Okay I was very confused by the top replies because she’s not stopping him from cooking meat and says she won’t stop her daughter from eating meat if it’s presented to her? It sounds like he and the daughter can eat meat just fine, but she’s not going to prepare it for them. \n\nIs she a stay at home mom (who I presume provides childcare and cleaning services in addition to a plethora of other home management skills), or a personal chef? Are there additional comments elsewhere that make her a horrible vegetarian monster? What am I missing??????",
          "id": 189,
          "comments": [
            {
              "score": 199,
              "content": "[deleted]",
              "id": 190,
              "comments": [
                {
                  "score": 136,
                  "content": "They're also missing the fragile ego of omnivores",
                  "id": 191,
                  "comments": [
                    {
                      "score": 62,
                      "content": "Yeah I am not surprised by the comment section but I am bemused. \n\nWe both work but I cook dinner probably 98% of the time. I do not like seafood. Ergo, we never eat seafood. Even though the Omega-whatevers are so so important, I don’t make fish for dinner. Blech. \n\nHe likes fish. He loves shrimp. He is welcome to eat all the fish he wants. The idea of him *expecting* me to cook it for him is ludicrous though, I mean come on. I am his partner, not his lackey. She is providing a (presumably) nutritious meal. She has cooked. If that’s not good enough, he’s a big boy and can provide his own extras. \n\nNTA.",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Had it been any other thing, reddit would have supported this post, it's literally only because op doest want meat.",
              "id": 193,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 272,
          "content": "Yeah I don’t see how she’s the asshole when so many meals are vegetarian anyway. Plus she’s doing the majority of work SAHP or not he has a role in keeping up the household and that’s allowed to change to include more things. Eating vegetarian is really easy without even trying, but there’s nothing stopping him from preparing chicken or steak ahead of time to add onto a meal a side or topping.",
          "id": 194,
          "comments": [
            {
              "score": 80,
              "content": "100000% agree. Everyone saying she should cook meat that she is clearly uncomfortable making. I am vegetarian, my partner isn't, and he would NEVER make me cook meat or insist I should cook meat if he wants it. There has been times where he will cook his own meat an add it to a group veggie meal though.\n\nI think the husband is being entitled. OP tried to talk with him about making meals with less meat, and he insisted NO he needs it. Well if he needs it so much, he can make it.",
              "id": 195,
              "comments": [
                {
                  "score": 5,
                  "content": "Same! I've never cooked meat for my partner in 18 years. Since we both switched to wfh he nearly always cooks a meat component for his dinner, but for the first 15 he mostly ate vegetarian food that I cooked or he cooked vegetarian for both of us",
                  "id": 196,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 235,
          "content": "It took me way too long to find a right response! Reddit hates vegetarians! He can cook his own meat I would never cook my man meat and he would ever ever ask me to even buy it for him or touch it or anything and he has his own pan he uses! Meat is gross to me and he respects that it’s not hard",
          "id": 197,
          "comments": [
            {
              "score": 77,
              "content": "I definitely went through a \"manly man, vegetarians are bad\" phase and I deeply regret it. Why did I care what other people ate or how they lived their lives? Sadly many have not grown out of that phase.",
              "id": 198,
              "comments": [
                {
                  "score": 7,
                  "content": "For all that people complain about preachy vegans, I've never met a person with a meat free diet who is nearly as annoying as the \"manly man eat meat, vegetarians are bad\" people who make bacon a significant part of their personality.",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 199,
          "content": "NTA. I knew I shouldn’t have waded into the comments. The husband isn’t going to die if he doesn’t have meat in his dinner every night ffs. She isn’t forcing anything on him. A grown ass man can cook meat for himself if he has to have it.",
          "id": 200,
          "comments": [
            {
              "score": 33,
              "content": "I agree with you. If someone would cook for me, I wouldn't care if it's vegetarian or vegan......it's ready to eat food!!!",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "I thought I was going mad reading this! All the people doing variations of \"uhhh IT IS YOUR DUTY\" \n\nFirstly, there are tonnes of veggie meat alternatives, they've improved massively over the years, my own family can barely tell the difference.\n\nSecondly, it's an ethical position for her. So basically a bunch of teenagers on here are telling her to make herself uncomfortable for the sake of her husband who brings home that dough eating meat? \n\nThis is a woman with a 5 month old daughter - what she's put her body and hormones through to bring a child into this world, she's suffered a-bloody nuff. She doesn't have to cook meat for her husband, she's doing a job that also benefits them both. \n\nWe're not in the 1950s, fix up you bunch of idiots.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "i completely agree. she does everything at home and cooks him dinner everyday, why can’t he eat vegetarian for one meal a day or cook meat to add to it ? why are meat eaters so afraid to have veg meals i don’t get it.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "I was looking for this comment. I cannot believe they're truing to rationalize her being TA. The answers also reek of thinly veiled misogyny. Ick",
          "id": 204,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "I am so baffled by people shrieking about this division of labor. He could literally cook some meat 2x a week and just reheat it. It doesn’t even need to be some every meal endeavor for him. 100% comes down to being fragile about someone not eating meat.",
          "id": 205,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 63,
          "content": "I'm not a vegetarian, but preparing meat makes me really queasy. When i first got married, i almost never prepared meat and my husband says he needs it. Because I dont like handleing meat, my husband put himself in charge of all the meat preparation while I prepare other parts of our meal. \n\nOP's husband is an adult and can figure it out. Or he can get huge steaks for lunch during work at the very least. \n\nNTA",
          "id": 206,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1181,
      "content": "Wow this sub is rough these days! NTA. So many people are saying \"You agreed to this division of labor so therefore you must stick to it for the rest of your life exactly as is!\" or some version of that. Honestly those people suck. You are allowed to want to make a change in your life. And if you need to change the division of labor to make this more fair, just switch roles. Does he sweep? Maybe takeover sweeping so he can have time to cook his meat. Something like that.\n\nMy mom did this exact same thing to my dad and they had no problem with it. Why, because they are two grown-ass adults. My dad just grills his meat outside now and it's better for him because he gets it exactly like he likes it.",
      "id": 207,
      "comments": [
        {
          "score": 270,
          "content": "No kidding, right? And all the people saying \"what if he decided he wasn't going to use his money to pay for x/y/z\"... um, in a marriage where one partner works out of the home and one works in the home, it's usually THEIR money. That's not a fair argument at all.",
          "id": 208,
          "comments": [
            {
              "score": 45,
              "content": "This. And the comparison of removing meat from meals to financial control is just kinda strange in general? You’re right it’s not a fair argument, but a very concerning one that a lot of people are making.",
              "id": 209,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I think that’s part of the problem. It doesn’t sound like the had a conversation about it or a negotiation to swap something like sweeping… so they should be communicating instead of any unilateral decisions being made.",
          "id": 210,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 681,
      "content": "NTA He's not going to become sick because of not eating less meat, quite the opposite. He's not allergic to vegetarian food. He can still buy meat himself and eat anything he wants. \n\nYou're also not his maid.",
      "id": 211,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 566,
      "content": "NTA he can cook his own meat if that is so important to him. My parents had the same setup, mom is vegetarian and dad made his own side of meat if he wanted it. Also I was raised vegan, it’s not a big deal.",
      "id": 212,
      "comments": [
        {
          "score": 5,
          "content": "NTA because of this! I went vegan overnight and usually cooked the meals of my household. I wasn't gonna cook any meat, so if my partner wanted some he would have to buy it and eat it. I'm lucky enough to have him as my partner, because when i explained my reasoning to him, not only did he understand, he went vegan too. \nHad a couple of arguments with my family when I refused to cook meat for them, tho!",
          "id": 213,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 431,
      "content": "So many people saying “DeVIsIon oF LaBoR” like OP described anything about their dynamic. Does OPs husband do anything around the house besides work and provide income? IMO when you have a screaming 5 month old that’s not 50/50. She stays home with a baby all day and can’t even decide what she and the baby should eat? NTA",
      "id": 214,
      "comments": [
        {
          "score": 59,
          "content": "Currently have a 5 month old and a partner at home. I am the lucky one going to work all day. No question about it. A 5 month old doesn’t stop needing your attention for more than an hour or two throughout the day. It is constant work. At work I can go to the gym during my lunch break, make myself a coffee, shoot the shit with people for a few minutes, etc. I am absolutely not coming home every night expecting my meals cooked but if I did I sure as fuck wouldn’t complain about them. This comment section makes me feel like I am taking crazy pills.",
          "id": 215,
          "comments": [
            {
              "score": 10,
              "content": "This! I've gotten messages saying OP is \"so ungrateful\" as if her life is a walk in the park? She's still making him dinner, just different foods, and supporting his lifestyle. They both have much to grateful for and I think it's really petty that OPs husband can't cook himself the occassional steak.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "And people are acting like he can’t eat any of the food she cooks. Like?? He can cook meat and add it to what she made? I highly doubt their division of labor agreement everyone is referencing had “must include meat in dinner” added. She’s making dinner, it’s his choice whether he eats it or not.",
          "id": 217,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I don't get the responses here! \"Division of labor\" my ass. she's literally still cooking meals every day so he can suck it up and grill a steak when he gets back sheesh",
          "id": 218,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 386,
      "content": "This is the wrong group to ask such a question. Meat eaters will tell you you're wrong.",
      "id": 219,
      "comments": [
        {
          "score": 8,
          "content": "I'm sorta shocked at how all these people are treating a marriage like a contract instead of ya know a relationship where people grow and change. The gall to expect your wife who's been looking after a kid/cleaning/cooking to cook two meals for dinner cause you don't want to eat healthier meals",
          "id": 220,
          "comments": [
            {
              "score": 3,
              "content": "Redditors are weird. Some of them have a really rigid view of how relationships should work and things like this, and then they wonder why they're lonely and sad all the time and don't have any friends / a partner.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}