{
  "post content": "Ok so let’s start off by saying it’s been a hell of a week! \n\nSorry more to this story but character count... \n\nSo I get a call from my brother that my moms in the ICU and might die! Something along the lines of “moms in the hospital, something to do with an OD but her boyfriend also didn’t call 911 from 2am -11am.”\n\nI live in Oregon my mom lives in Arizona.\n\nI call both her phone and her boyfriends hoping my brother had it wrong but nope. the crazy boyfriend ends up calling me back. He starts out the call saying he didn’t call me because my mom made him take my phone number out of his phone because she didn’t trust him with it. odd! But okay. he then says that he heard her fall at 2am and he found her unresponsive. He couldn’t pick her up he is like late 60s she is 56 so he pulled her to bed room by the arm and left her next to the bed. He said it sounded like she was snoring! he was yelling and shaking her and not getting a response.\n\nso he treated her for shock!\n\nHe gives a list of drugs they have at the house almost a brag. Like I think that shits cool what a fucking absolute idiot!!!! He says he stashed them instead of handing them off the medics!!\n\nThen he proceeds to rambling about Montana and all sorts of crazy garble about his good ol days. I quickly get off phone with him. \n\nWhen I get to Hopistal I thought she was gonna die but luckily she pulled through but not before almost losing her kidneys having rabdo which is when your muscles start breaking down do to lack of oxygen and send toxins into body. Flash pulmonary edema where her lungs filled with fluid and so on.\n He lives 30 minutes or so from hospital and didn’t come visit once!!!!!\n\nSo to try to make a long story short when I showed up there were three case workers who informed me that adult protective services where stepping in. And a protective order was going to be placed against him. \n\nOnce mom finally comes to she says she wants to go home to Oregon with me......I extend my stay in AZ I’m now a couple grand deep on this trip!  \n\nSoo here is the, am I an ass hole part!!?? \nWe made it back to my place but she is in a fog and it’s like she has Alzheimers or dementia now.... mentioned memory lapse before we left hospital but they said it was sedation could last a week or so... I have had to relive her losing her mother about 10 times now and my father who passed away 4 months ago another 10 times or more. She is finally starting to remember those events happens but still a lot missing!\n\nbut now she wants to speck with the ex.. to find out what happened she is super confused and pretty much told me she had to ask him what she felt about the situation! 🤦‍♀️ my life right now!\n\nSo I refuse to let her talk to him she is now thinking I’m conspiring against her but yet happy to be here depending soon which wave we are in. \n\nSo am I the asshole for not letting her talk to him.",
  "id": 1,
  "comments": [
    {
      "score": 44,
      "content": "NAH but the ex, but your mom needs to meet a proper medical professional immediately (after the one week period), and tell them what drugs she’s been taking. The doctors may or may not have been able to give  a proper assessment due to the drugs in the system. She probably wants to talk to the ex to understand what happened, because of her blanks. You’re NTA to keep her away, she was in a bad place. Keep her away",
      "id": 2,
      "comments": [
        {
          "score": 17,
          "content": "Thanks for the response! We plan to go into start getting ball rolling on that today. I will be request a  mental health check and have all documentation from AZ Hospital on hand and since she can not tell me who her primary was I will have to do some round about digging. My dumb ass unfortunately left her ID, and other important documents at the boyfriends as I was trying to get her home safe and didn’t want to deal with that whole conflict",
          "id": 3,
          "comments": [
            {
              "score": 8,
              "content": "My mom broke her hip in her mid-60s and was heavily sedated for a few weeks. It took a couple of months for her to get back to herself. You are doing the right thing by have her evaluated and trying to track down information.\n\nI know it’s very hard, but stay as calm as you can. Your mom will pick up on any agitation and that can complicate her situation.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "NTA. This man is toxic to her and is probably the reason you almost lost her. \n\nINFO: Does she need an order of protection for Oregon if she has one in AZ? I don't know whether those things work in different states or not, but if they don't, get the ball rolling!",
      "id": 5,
      "comments": [
        {
          "score": 8,
          "content": "Thanks for the response! I am working with AZ agency at the moment and plan to move forward with Oregon if her mental status does not change. I’m hoping she will be able to make clearer decisions soon.",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "Usually, I'm in the camp that says an adult is an adult and they get to make their own choices, but from what you're saying is that she is essentially incapable of making choices at this point and is severely mentally limited, right?\n\nIf that's the case, NTA. If, when she's feeling clearer in the head and can make choices again, she chooses to see him, there's just not a lot you can do, but right now I'd deny her request, and perhaps see if you or your sibling can get legal guardianship over her in some way, so that you are also legally allowed to make decisions like those for her.",
      "id": 7,
      "comments": [
        {
          "score": 3,
          "content": "Exactly adult is an adult! Very much the reason I’m torn and it is so hard to say no.. although the alternative is like letting her go into danger blindly at the moment. She experienced a stroke 2 years back and also has aphasia he wouldn’t drive her 30 minutes out of the way for therapy unless it’s on days he goes to the VA. During the stroke it was a similar situation where he failed to respond appropriately assuming she was high on something! He did eventually pack her into his truck and take her to hospital but not before stopping for cigarettes! Which he probably smoked on the way to hospital with her in car. 🤦‍♀️ to say the least she was pissed about it and we discussed calling no matter what even explain that there are laws in place to protect him from drug charges if he reports potential OD. I am hoping she makes a recovery to a point she can understand what happened. But yeah if mental status doesn’t clear up I will have to take the route of guardianship which kills me I feel like I’m some how taking her freedom you know",
          "id": 8,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA - he clearly doesn't care a bit about her and has shown it multiple ways. I understand her wanting some clarification about what happened, but not sure she will even get it from this guy. Honestly I wouldn't trust him. Maybe she can email or do something over writing without talking on the phone. I just see a point conversation going completely wrong and her wanting to go back to Arizona.",
      "id": 9,
      "comments": [
        {
          "score": 3,
          "content": "Exactly the fear her running straight back! I want her to at least fully understand what happened before making that decision hoping of course we get her back to a normal ish mental capacity.",
          "id": 10,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Normally I would be telling you as an adult she has the right to converse with whomever she wants but as this guy is so toxic and detrimental to her health and safety I have to say NTA. Anyone who has an order of protection against them is not someone she should be speaking to.",
      "id": 11,
      "comments": [
        {
          "score": 2,
          "content": "I hope to get to a point she can make her own decisions because you are right about the adult making own decisions that’s why I’m so torn totally feel like the asshole but I trust Reddit 😂 thanks guys",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "You are definitely NTA but your mom's ex is far worse than an Ass hole. Who knows what this man was thinking.. perhaps he was trying to have her die \"accidentally\" for an insurance claim or who knows what. This guy deserves jail time.",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "Very much so he does! He is absolutely nutters he was once a medic in the army but that was years and years ago and many many drugs ago for him. He literally thought he was “treating her” despite the fact that her body was just slowly shutting down in front of him 🤦‍♀️ I just can’t even",
          "id": 14,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "No no no nta. Protect her cos she is so vulnerable atm.\n\nIm confused though. Is he still not investigated?",
      "id": 15,
      "comments": [
        {
          "score": 1,
          "content": "I have a case number and am waiting for follow up call from main office spoke with social worker yesterday. Not sure how this whole thing works really yet 😬",
          "id": 16,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. It’s difficult with aging parents in non medical scenarios, and your situation is very distressing. The bf is problematic because he compounded the original problem with his back pocket doctoring. \n\nHe is a dangerous fool. \n\nIs it possible to retrieve the rest of your mother’s belongings through an intermediary? If there is a stay away order, perhaps the local police can assist in the process? It doesn’t sound as if there are any trusted friends to turn to for that.",
      "id": 17,
      "comments": [
        {
          "score": 2,
          "content": "Yeah tried that route unfortunately sheriff said we had to be present which is strange considering. But either way all that is replaceable. Have left message with social worker about potential standing in for us. Did you know if he refuses to hand over the stuff I can’t change with theft because it was left can you believe that absolutely nuts to me",
          "id": 18,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Sorry for typos anger typing never comes out clear 😂",
      "id": 19,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n ---\n\n I won’t let my mother talk to her toxic boyfriend after she overdosed on a long list of drugs and now is experiencing memory loss\n\n---\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 20,
      "comments": [],
      "relation": "No"
    }
  ]
}