{
  "post content": "Found Long Lost Biological Brother\n\nHere goes nothing.. I dont know where to start so I'll start abt my parents. they got together after school had finished and had me and my baby brother when they were 18 and 20. My brother and I are 2 years apart. 4 years later, filed a divorce because my bio-dad is an abusive a-hole. took my brother along with him but i have been living with my mom's side ever since i was a baby so that didn't make much of a difference. (Dad lives in another state) I grew up with my grandma up until now, shes also registered as my Foster parent. Not living in the same roof with my mom. My mom married my stepdad back in 2009 and i have 4 stepsiblings. Theyre ok. Often visit me during school holidays.\n\nits been 18 years since the separation. Im 22 now and hes 20. I do think of him every now and then but its just multiple occasion of something important in life like, \"Hope he passed the school yearly test\" etc.. My mom mentioned his name to me a few times like \"Oh he must be 19 this year..\" \"I wonder how he is right now\" and ngl she has been searching for his name on Facebook every now and then. and she told me few years back that a child will always runs back to their mom. \n\nLong story short a few days ago she found him on Facebook. It was obvious because his background picture was my mom when she was young. And she took the initiative to approach him. I dont know how their conversation went but it was enough to know that hes living alone now and has no stable job. My mom asked me if it was okay that shes approaching him, i'd say go for it. thats what she always wanted anyway. \n\nSo last night she asked me if its okay for me to contact him? \"hes really happy he found us\" \"he keep on asking about you. he remembers you\" \"if you dont know what to talk about ask about what hes up to. tell him to go find a stable job\"\n\nAm I the asshole for not getting giddy? I dont even know the guy and i feel like im intruding his life to go and say \"u should look for a stable job\" In all honesty i feel like this is all too sudden, and i have a busy life to keep with. With the pandemic, online classes, my degree, finance and stuff. Throughout my whole life I was ok for not knowing him, I knew he exists somewhere but I dont have the urgency to look for him. And because of my living situation i'm not even a family person. Thanks to my mom I have his contact with me but I really have no ideaa what to say to him. Nor do I want to to keep in contact with him. But i will feel bad if i dont. But i dont want to.\n\nTl;dr found my long lost brother separated for 18 years, mom found him few days ago and I am asked to contact him but i dont feel excited when this all happened. In defense, hes a stranger to me.",
  "id": 1,
  "comments": [
    {
      "score": 7,
      "content": "I am going to go with NAH. It's a difficult situation and maybe your mother is asking too much for you just to embrace your brother, you know? \nSometimes things take time and it's not like you can flip a switch and become this stranger brother. \nYou say you will feel bad if you don't contact him.... I would too. Maybe just explain him the situation like you are explaining it to us? Very logical and sort of baby steps? Getting to know one another slowly?",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "I have a feeling it'll be hard for him to understand but thanks for the advice. will definitely take baby steps from here on out",
          "id": 3,
          "comments": [
            {
              "score": 2,
              "content": "You are welcome! And whatever you choose, you will not be TA. I haven't had that experience, but I think of it and can only imagine how difficult it can be and you both (you and your brother) did nothing wrong in it. \nSo, yes, my advice.. baby steps and obviously nothing of the sort of \"find a stable job\".",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "Nta. Your right to feel the way you do. But you should take the opportunity to get to know him I would imagine he feels close to the same way you do.. your right about the telling him to get a job that's not your place to say that after 5 mins of talking.. but it would be nice for you to say you remembered him and thought about him on holidays and like his birthdays.. things like that. I'm sure since he went with your dad (abusive like you said) maybe hisn childhood wasn't so great and you should just be there if he ever wants to talk kinda relationship..",
      "id": 5,
      "comments": [
        {
          "score": 2,
          "content": "I didnt thought of it tbh that he might be in the same shoes as me because he was the one to ask my mom abt me. pics etc. i didnt ask for his bcs i have his facebook profile. but yea i doubt things would go far and deep to have a \"rough childhood\" talk between us. I dont know the dad and he doesnt know my grandma :/ \n\nimho i wanna avoid that kind of talk tbh. its kinda traumatic for me but if he ever wants to talk abt it then im ok i guess.",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NAH. Give the guy a chance, though. He is your brother. Maybe you'll hit it off and get along really well. Maybe you won't, and that's ok too.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA. But you should get to know him.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH but I think you should reach out, not for a big brother lecture but just to get to know him. He’s probably going to feel weird too. And since your dad’s an abusive a-hole it might be good for him to have a male influence in his life that’s not shitty. And he might want to get to know your grandma also. You’d probably be the best person to facilitate that when you’re ready. \n\nWhen YOU’RE ready is key. \n\nMaybe just start by texting? Find out some common interests and go from there?",
      "id": 9,
      "comments": [
        {
          "score": 1,
          "content": "my childhood was pretty rough too, i dont have my mom  with me, and my grandma was abusive af. she stop hitting me when i reached 20. my days when i was a teenager was more of being isolated, studying and being taken care of by other family relatives thats not my mom/grandma.\n\nbut yeah i feel like the key is when i'm ready. i'll give him some sister to brother talk when i am. (fyi im a female. sorry forgot to mention that)",
          "id": 10,
          "comments": [
            {
              "score": 2,
              "content": "I didn't mean to downplay any abuse you might have suffered.  I'm sorry for that and for assuming you are a guy.  You should be really proud of yourself for getting your sh!t together and not letting the abuse you've suffered hold you back.  I'm really proud of you.  \n\nBut reach out when you're ready and don't cave to the pressure your mom will inevitably start putting on you to reach out and become \"a big happy family.\"",
              "id": 11,
              "comments": [
                {
                  "score": 1,
                  "content": "that was what i feared the most tbh! her wanting to preach things and becoming \"a big happy family\" now that she found my brother. i feel like from now on i am enforced to be involve with family things which i dislike. in all means i really dont want to be involve with that. im not even REALLY really close to her either, just close to my stepsiblings (theyre 10&7 yrs old now) im very happy with how i am at the moment and minimal contact with family is perfect for me. \n\nand btw thanks for the advice! things are really shitty to me for the past 2 years especially now during pandemic. your kind words means a lot.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 1,
                      "content": "hugs, thnfsa.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFound Long Lost Biological Brother\n\nHere goes nothing.. I dont know where to start so I'll start abt my parents. they got together after school had finished and had me and my baby brother when they were 18 and 20. My brother and I are 2 years apart. 4 years later, filed a divorce because my bio-dad is an abusive a-hole. took my brother along with him but i have been living with my mom's side ever since i was a baby so that didn't make much of a difference. (Dad lives in another state) I grew up with my grandma up until now, shes also registered as my Foster parent. Not living in the same roof with my mom. My mom married my stepdad back in 2009 and i have 4 stepsiblings. Theyre ok. Often visit me during school holidays.\n\nits been 18 years since the separation. Im 22 now and hes 20. I do think of him every now and then but its just multiple occasion of something important in life like, \"Hope he passed the school yearly test\" etc.. My mom mentioned his name to me a few times like \"Oh he must be 19 this year..\" \"I wonder how he is right now\" and ngl she has been searching for his name on Facebook every now and then. and she told me few years back that a child will always runs back to their mom. \n\nLong story short a few days ago she found him on Facebook. It was obvious because his background picture was my mom when she was young. And she took the initiative to approach him. I dont know how their conversation went but it was enough to know that hes living alone now and has no stable job. My mom asked me if it was okay that shes approaching him, i'd say go for it. thats what she always wanted anyway. \n\nSo last night she asked me if its okay for me to contact him? \"hes really happy he found us\" \"he keep on asking about you. he remembers you\" \"if you dont know what to talk about ask about what hes up to. tell him to go find a stable job\"\n\nAm I the asshole for not getting giddy? I dont even know the guy and i feel like im intruding his life to go and say \"u should look for a stable job\" In all honesty i feel like this is all too sudden, and i have a busy life to keep with. With the pandemic, online classes, my degree, finance and stuff. Throughout my whole life I was ok for not knowing him, I knew he exists somewhere but I dont have the urgency to look for him. And because of my living situation i'm not even a family person. Thanks to my mom I have his contact with me but I really have no ideaa what to say to him. Nor do I want to to keep in contact with him. But i will feel bad if i dont. But i dont want to.\n\nTl;dr found my long lost brother separated for 18 years, mom found him few days ago and I am asked to contact him but i dont feel excited when this all happened. In defense, hes a stranger to me.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA\n\nYou could message him to just get to know him, but I wouldnt be giving him sage life advice.\n\nYour mom is already stomping on boundaries, with a son she has no contact with for most of his life.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 0,
      "content": "I think you're being insensitive given that you know the parent he got stuck with was abusive. You dont  need to be excited about meeting him but have no right to judge him for how his life has turned out. YTA",
      "id": 17,
      "comments": [
        {
          "score": 1,
          "content": "thanks for pointing out on that. i didnt thought of being insensitive tbh bcs my childhood was rough from the start too and i feel like he has a better life than mine all my life. and to point out, im not judging him, sorry english is not my first language. what i meant was it wasnt my place from the start to actually advice him \"to get a stable job\" since i dont even know him if i ever did talk to him the way my mom wants to.",
          "id": 18,
          "comments": [
            {
              "score": 0,
              "content": "I kinda agree with the previous comment. He got stuck with the abusive father while you lived a sweet life not having to fend yourself. If my brother was on the streets unemployment, I wouldn’t tell him to get a job. I’d ask if he was okay, does he need help and so on. The fact to had to say fiancé made me cringe even more. Where’s the sympathy for somebody who’s your brother? He’s your family, treat him equal to yourself. He’s had a rougher life being raised by your father & left alone with nobody to comfort him. Could you having a conversation with him really be the end of the world? Please put yourself in his shoes.",
              "id": 19,
              "comments": [
                {
                  "score": 0,
                  "content": "i think youre making stories there buddy. i didnt say fiance, i said finance. im having trouble financially. and my apologies, i didnt mention a tough childhood for me too (but i did in the replies) bcs my grandma was an abuser. in my end nobody did comfort me either. :/  and i didnt actually say go get a job, i meant it as it would be bad of me to actually say that for someone i dont even know since my mom told me if i dont know a topic to talk to, go tell him that as an advice. i also have my ends badly, and if was to offering help my best is emotional support for now.",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Not really judging he just doesn't want to see him",
          "id": 21,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 0,
      "content": "He is your brother , try knowing him . YWBTA if you don't do so.",
      "id": 22,
      "comments": [],
      "relation": "Support"
    }
  ]
}