{
  "post content": "My wife and I have been married for 7 years and we’ve always talked about wanting kids. We’re  both 29 years old and started trying to conceive about a year ago but have been unsuccessful. We recently decided to get checked out by a fertility specialist and opted to have extensive genetic testing done. The genetic counselor said there isn’t a reason they can point to as for why we haven’t conceived yet, but the bad news is that we are both carriers of a genetic disease that could cause our children to go blind. The risk of having a blind child is about 25% with each pregnancy. \n\nAfter talking about the risks with our genetic counselor my wife and I both came to different conclusions. She still wants to experience pregnancy and childbirth and is okay with taking the 25% chance. I’m not.\n\nI put adoption on the table and she said she’d only be willing to adopt after having a biological child. She says donor sperm isn’t an option because she wants to have *my* kids and that I’m taking that option away from her over a “small” risk. \n\nTwo night ago we had really bad fight over it. Hurtful things were said by both of us. During the fight I said that pregnancy is hard and most people suffer through it so It’s not like she’s experiencing a great loss. She can keep her flat stomach and not have to suffer through 9 months of sickness. I told her that her mindset is negative. She disagreed with that and said she see’s nothing to be positive about. She called me a coward for wanting to let my kids be fathered by a donor. I responded that of course she’s never going to see the positive in the situation because she’s 100% negative, just like all of her pregnancy tests were the last year and how they always will be. \n\nThat’s the line that caused her to start sobbing and leave the house. She packed a bag and told me she was going to stay with her sister and that she’d call me when she was ready to talk. She’s been gone for two nights now. It will be three if she doesn’t come back tonight.  I don’t want to extend the olive branch and call her first because I’m still pissed. \n\nI don’t know if this post is even a question or a cry for help at this point. \nI have no father figure or male friends I’d feel comfortable talking about this with. Instead I’m asking strangers on reddit  because I’m drunk and at rock bottom. Tonight will be the third night alone in my house drinking by myself and going to bed alone and that terrifies me. Things were completely different a week ago. This sucks. After typing all this out, even I think I’m an asshole.",
  "id": 1,
  "comments": [
    {
      "score": 2824,
      "content": "ESH.\n\nYeah, man. Gotta level with you. Your closing shot was... Really too far. I get the whole heat-of-the-moment thing but... Jesus Christ man...\n\nThat being said, it sounds like she's minimizing your fears and not hearing them fully. The comprises she's offered ignore your concerns and favor her side. So, I mean, I guess you have that going for you.\n\nIn the end though, you seem to have done a lot more unnecessary damage with your words. It's time to man up and extend that olive branch, dude. You said some horrendous things to her.\n\nEdit: thx for silver?",
      "id": 2,
      "comments": [
        {
          "score": 618,
          "content": "Couldn’t have said it better. You really went over the top with that last comment. \n\nMake peace. Extend the olive branch.",
          "id": 3,
          "comments": [
            {
              "score": 111,
              "content": "Yeah he is kind of the asshole for that line but that doesn't mean that he should back down from his position just to clarify. I think it would be a even bigger asshole move to conceive a child that has pretty big chance to be disabled especially now that it's this easy to avoid, just use a sperm donor if it's this important.",
              "id": 4,
              "comments": [
                {
                  "score": 48,
                  "content": "Being born blind is not a disability that cannot be handled. It does not carry health risks or prevent a person from living a mostly normal life.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 101,
                      "content": "I agree but even still, why risk it when there are other ways?",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "That's a selfish POV. \"I want what I want and idc if my hypothetical child suffers bc at least it's not 'THAT' bad\".",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "No health risks? Normal life?\n\nDo you know any blind people? They can lead perfectly happy and fulfilling lives, but they wont be normal. They will also likely being involved in more accidents and are more likely to acquire a number of other disorders.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Outside of not being able to enjoy most forms of entertainment",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "Cant he get in vitro and pre screen?",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "It's also completely avoidable using IVF and embryo selection if OP and his wife want biological kids.\n\nIt's not cheap - but probably cheaper than raising a blind kid.",
                  "id": 11,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 384,
          "content": "They both need therapy. The wife is understandably going a bit crazy about this but society does put alot of pressure and praise on who are pregnant. Too many women say that pregnancy makes you a real women and mom and it is a huge blow for many women not to be able to experiance this. Women arw raised to believe that pregnancy is one of the most sacred experiances in life. I think right now she is in denial about the concequences of the condition and how they would techinally be responsible for making their kid go blind. Op is being very rational about this situation but went way to far with the comment. They should both be refusing to talk about this subject until they reach a point in therapy where they are ready. Frankly though he is willing to make big sacrifices and even let his wife carry her own pregnancy at the cost of not having his own biological kid.",
          "id": 12,
          "comments": [
            {
              "score": 162,
              "content": "I agree. Arguments in a relationship should never turn MEAN. Argue about the issue, don’t put the other person down. You need therapy.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 119,
              "content": "I do think it's unfair to take away agency from OP's wife and but the blame on society.\n\n Subjecting a child to a 1/4 chance of being blind on birth just because she wants to \"experience childbirth\" just makes her either irrational, selfish or hormonal.\n\nSometimes people just are like that.",
              "id": 14,
              "comments": [
                {
                  "score": 159,
                  "content": "Oh i definantly agree. I think society is part of the reason why she's acting like this. You see news stories and fundraisers alot of \"brave\" parents who continued to have kids despite knowing they where at risk of having a horrific genetic condition. Many people will tell you to go against the odds and do it anyways and if you have a disabled child people will praise you for being brave. No one ever calls people selfish for knowingly taking a risk of passing on a horrible genetic condition. His wife is refusing to see the reality and possible concequnces of the situations because she is too blinded by what she wants.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 91,
                      "content": "[deleted]",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "My daughter has Cystic Fibrosis and the fighting within the community about this, is so crazy. But at least there are people willing to call other selfish for knowingly passing along the disease.....",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "totally agree with you",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "Blindness is not a horrible genetic condition. It is unfortunate, but it is far from being a life ending medical emergency. I agree, a lot of people get patted on the back for \"bravely\" having children who will only suffer all of their lives, but this is not one of those cases.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "I’m not sure if any of you are female, but I think there is something you don’t understand. Not all women feel what I am describing but many do, and it seems like OP’s wife is so hear me out. \n\nWomen have hormones that make us want to be be pregnant and have children. That is how the species continued to survive. I am in no place to have children at the moment and I know that. However if I see a cute kid, it’s like omg get me pregnant already. If me and my boyfriend are babysitting for my brother and he is playing with my niece, it goes through the roof. \n\nAlthough I am in no place to have children, this still happens. Realistically, if I got pregnant, I would be giving the child up and I take all precautions to make sure that doesn’t happen. That doesn’t mean I don’t want it though. You guys just minimizing what she is going through is incredibly inconsiderate of how she is needing to through away a dream that she may have had forever and that her body is programmed to give her. If I was in this situation, would I still try, I don’t know, but I would damn well be upset about it. \n\nAlso on an unrelated note, you guys are acting as though the child being blind is the end of the world but there is a vibrant blind community who experience life to the fullest. It is honestly very offensive to this community for people to act as though bringing them into the world is the worst possible option.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Further to all of this, it seems like its been a week since they have been talking about this. Let the woman cope with that fact that she might not have biologically kids for a little bit. She might be doubling down at the moment but they should absolutely NOT be fighting about this if they heard the news only a week ago. She needs to process her feelings before they can talk about a logical solution",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "She'd also experience all that if she used a donor. We are human beings capable of rational thought beyond rabid hormonal urges. She's being incredibly selfish.\n\nFWIW not all women have some urge to be pregnant. I am female and the concept makes me feel sick to my stomach with body horror. Obviously this doesn't apply to OP because she does have an urge. But using donor sperm does not take that away from her.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "Not to mention there are multiple kinds of blindness, they aren't all just everything is black like people imagine. Some types can be treated even.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Not to mention if it's a genetic issuethey could always do IVF with genetic testing pre-implantation",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I am women. And I understand, I was more trying to explain the likly factors of why she is acting that way. Some women are more able to stand up to the pressure then others. There is definantly a biological pressure to have kids, some women feel it more then others. In my post I did acknowledge what she is going through. However you saying being blind isnt horrible is minimizing the struggles blind people face in their lives. As someone who has seen their friend go blind over the course of a year become depressed and lose many opportunities because of it being blind is something that will limit your life. If you can prevent your kid from having a disability do it. It's selfish to take that risk, especially when you arnt the one who suffers the most in the end. Parents should want the best for their future kids, that includes trying your best to give them every oppertunity in life. Op's wife just wants to carry her husband's kid, and not do selective ivf. She isn't considering the future of her kids or Op's wishes.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I, a woman, have never felt this way. Ever.\n\nNo judgement, just commenting. It was interesting hearing your perspective, because babies and small children have never interested me.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "You don't know what this disorder is. There could be neurological issues beyond blindness. And there probably are.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Being blind is not the end of the world, but it is a serious disadvantage and limits your options in life. No one would choose to be blind. Why put your child through that from a selfish desire to have your partners baby.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "I’m glad I’m not the only one who was like if blind is the worst thing you are, you can still lead a happy full life. But to be fair for OP, if he couldn’t handle a blind child, he almost certainly couldn’t handle a developmentally challenged child.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 367,
          "content": "Also the little gem where he says she can keep her flat stomach. He is afraid of her gaining weight too, which is messed up.",
          "id": 30,
          "comments": [
            {
              "score": 165,
              "content": "Also she’s supposed to be moved by that when she was excited to experience literally creating life in her body? I don’t look at pregnancy that positively but it floors me that he can’t see why she isn’t happy about that trade off",
              "id": 31,
              "comments": [
                {
                  "score": 1,
                  "content": "She still has that option via donor.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yes she does, this was in response to the husband's tone deaf argument that she should look on the positive side, not being pregnant would mean she wouldn't lose her \"flat stomach.\"",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 107,
              "content": "Yeah that's a horrifying omen of their relationship. It's probably not been exactly blessed from the start.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I actually think that's unfair to infer without additional context. My similarly aged wife and I have had numerous conversations about pregnancy, and her biggest fears, all expressed by her without prompting are to do with its affects on her body, including her stomach. She's a smallish person and has commented on her fears regarding the scarring left by a c-section. \n\nMaybe they've discussed it as one of her fears before. My wife and I have discussed adoption and biological birth and if we were in a similar situation to OP, I bet you that I'd say something like, \"at least you don't have to get pregnant anymore\" and it wouldn't be because I'm worried about her fucking stomach.",
              "id": 35,
              "comments": [
                {
                  "score": 7,
                  "content": "You sound like a good husband. If you said the flat stomach line, I'm sure your wife and anyone who knew the two of you wouldn't think twice.\n\nI think in my case, the flat stomach line is galling because it was followed by that horrifying negative pregnancy test line. I don't think there is much defense for that and saying such a cruel thing seems to cast a more cruel tint over the rest of the conversation.\n\nI sincerely hope that you wouldn't say something like that to your wife. (Also, this is complete anecdata, but my dad's family have tiny women, rarely over 5'1 and we have had maybe 2 c sections in a sample size of 30+. Not saying this as a \"oh you/your wife are WRONG\", more as a \"This is an example of small women who did it, the c section isn't inevitable.\" I personally am scared to death of c sections, mostly because I have a fear of hospitals. I hold my aunts, cousins and such as a \"Its okay, if they did it I have a chance too.\")",
                  "id": 36,
                  "comments": [
                    {
                      "score": 1,
                      "content": "No, I agree with you, what he said there was completely and totally over the line. I mean, my wife and I have had a few arguments that spiraled into one or both of us saying something we definitely didn't mean but never that bad. I think everybody has said something they don't mean at one point or another but you have to simply understand that there are some bells that never be unrung. \n\nI appreciate your stories about your family! To be honest, I'm sensitive to even having the discussion too much at this point. We're both \\~30. We're both aligned that we want 1-2 children, hopefully in quick succession at \\~35 (I know, later than most people!). We're also both 100% happy to adopt. I've made it clear that although I'm happy either way, I'd love to have a biological child if she's on board. So really it's about her being comfortable, and given she knows how I feel, bringing it up again feels problematic because I don't want to either pressure her or mansplain pregnancy to her. As long as we're on the same page about kids, biological or otherwise, I'm chillin.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Ok yeah possibly. I am a woman though and I would be fully willing to accept that my body will never be the same if I ever did have kids (but I’m not planning to). Although I also do not have a flat stomach, I do appreciate how much work it takes and if it is an important thing to her that the context happened to slip, then maybe he has a point. I have doubt though.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -7,
              "content": "It's possible she loves to exercise and is proud of her flat stomach and living on Earth she's probably noticed that women are constantly judged on their figures. Maybe she has even expressed concern over losing her figure and he was looking for a silver lining to bolster his side of the argument.\nSigned, a childless 35 year old with past weight issues currently rocking a flat stomach and hesitant to give that up!",
              "id": 39,
              "comments": [
                {
                  "score": 39,
                  "content": "If that's what you or any other woman wants, that's fine. But to tell a woman who desperately wants a child that she should be okay with not conceiving bc she'll still have a flat stomach is just *wildly* tone deaf and insensitive.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Exactly. It felt like 100% his concern than hers. I don't know any woman who expects a pretty, flat stomach after pregnancy.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 190,
          "content": "Agreed-I mean Jfc, it's possible to get your points across without completely fucking spearing a person. It was such an unbelievably cruel comment.",
          "id": 42,
          "comments": [
            {
              "score": 94,
              "content": "It seemed like one of those one liners you'd love to gawk at in a movie... But in real life...",
              "id": 43,
              "comments": [
                {
                  "score": 63,
                  "content": "Definitely one of those deep dark moments you might have internally going through this stress. Saying it out loud as opposed to thinking it might seem minor in terms of action but man...yeah some of what she said was wrong but this just seemed like throwing a nuke in response to a javelin or something.\n\n&#x200B;\n\nthe stuff about her stomach being flat ...that rubs me up the wrong way. I'm not sure this relationship would survive kids-that comment just doesn't tally with me mentally.\n\nAlso yeah in a movie those zingers look cool but you never have to go home with a movie character. I came into this thinking I'd be on OP's side in the first half, but the cruelty (shown by both) to each other seems like it should be the first thing they address rather than kids.",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "my jaw literally dropped reading it.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Yeah, I was on the ESH train at first. Then he started taking about flat stomachs, and I was thinking he was approaching asshole territory. Then the pregnancy test comment came and he went full speed ahead over asshole cliff to incredibly cruel.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "People do this - they get into the zone in a fight and they just release the fucking hounds.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 86,
          "content": "Yeah it was bad. We’ve only had one other fight like this and it was before we were married. This isn’t normal for us. The last year has been a huge stress on the relationship. An argument spiraled out of control because we’re both stressed and grieving right now and we took it out on each other. Especially me. I’m going to call her tomorrow. thanks",
          "id": 48,
          "comments": [
            {
              "score": 96,
              "content": "It might be useful to hash this out with a therapist. Maybe you guys need a neutral third party to help diffuse any issues. I hope you guys can work this out.",
              "id": 49,
              "comments": [
                {
                  "score": 18,
                  "content": "Yeah, trying to have a baby is very stressful and can really damage a marriage. Especially when it is a struggle. Get therapy.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Good news! This is the last fight you will ever had. The relationship is over. I would never be able to move past a hit like that. Enjoy your empty house. It will be empty for a long time.",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Do you know you can still have biological kids with 0% chance of blindness using IVF and embryo selection?\n\nIt's not cheap, but probably cheaper than raising a blind kid.",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 47,
          "content": "ESH\n\nI’d like to add that it feels like grief when you aren’t able to conceive. I spent a year and a half watching my friends all have their babies and honestly it was getting very hard to be happy for them. Thankfully Metformin and going thru the process of realizing it might not happen allowed for our daughter to be conceived. I also would like to add that not all pregnancy is months of sickness. I had none. In fact it was super easy being pregnant. I acknowledge that I was very lucky and this isn’t always true. Good luck OP.",
          "id": 53,
          "comments": [
            {
              "score": 7,
              "content": "[deleted]",
              "id": 54,
              "comments": [
                {
                  "score": 1,
                  "content": "Accidental OP post on primary...?",
                  "id": 55,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Oof yeah. Damn mobile. My apologies.",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "The double genetic disorder with 25% chance of blindness is literally a sub story from the television show Bones....\n\nEdit : In the episode \"The Blackout in the Blizzard\" Angela and Hodgins find out they are both carriers of Leber's Congenital Amaurosis, giving their baby a 25 percent chance of blindness.",
          "id": 57,
          "comments": [
            {
              "score": 34,
              "content": "The episode was based on a real issue. It pretty much tells you that it actually happens in real life. Not sure why you think that something can’t happen because it was portrayed on tv.",
              "id": 58,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "Many autosomal recessive conditions have a 25% chance of being passed on if both parents are carriers of it. \n\nIf a disease is recessive, you need to get a copy of it from both parents to have the disease.\n\nEach parent carries two copies of each gene, and  if mum and dad are both carriers, it means that they each have one diseased copy of the gene, and one normal copy (so, we can say they each have D and N genes, for disease or normal).\n\nWhen they make sperm or eggs, 50% of each will be Diseased, and 50% will be Normal.\n\nSo, depending on which sperm meets which egg, the options for the baby are:\n\n\nN N (a normal gene from each parent, baby doesn’t have disease)\n\nD N (one bad copy, one good- means you are a carrier, but don’t have the disease)\n\nN D (same as above, carrier, no disease)\n\nD D (2 disease copies = you have the disease)\n\nBecause there are 4 roughly equal outcomes, the chances of the disease is 25%.",
              "id": 59,
              "comments": [
                {
                  "score": 1,
                  "content": "If it is a recessive disease and the baby is a male then he would have a 50% chance of being blind.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 1,
                      "content": "If it was a sex-linked disease carried on the X chromosome and passed on by a carrier mother, definitely.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "This! It immediately made me think of this.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "If the blindness was seriously the issue, he would have stuck to that but he didn't. He brought up a whole bunch of different bullshit that had nothing to do with the blindness, I call bullshit.",
          "id": 63,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Yeah, that last insult was pretty awful. ESH for sure. You owe it to her to extend the olive branch for that. She's not innocent here either but that was just low. I'd suggest some couples counseling to help you both work through this rather touchy subject. Wish you & your wife all the best.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Perfectly well put, the coward comment hurt, but dood that negative test result was going too far",
          "id": 65,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1723,
      "content": ">I responded that of course she’s never going to see the positive in the situation because she’s 100% negative, just like all of her pregnancy tests were the last year and how they always will be. \n\nWow. I was on the fence until I read that line. That is an incredibly heartless thing to say. I agree that you all don't need to have kids. But not for the reason you're claiming. You all are no where near ready for kids if this is how you  communicate with each other. You all need therapy, not a child. ESH but you suck the most. Apologize to your wife.\n\nEdit: Thanks for the silver!",
      "id": 66,
      "comments": [
        {
          "score": 561,
          "content": "> You all are no where near ready for kids if this is how you  communicate with each other. You all need therapy, not a child.\n\nThis needs to be higher.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 271,
          "content": "I audibly gasped. So cruel.",
          "id": 68,
          "comments": [
            {
              "score": 288,
              "content": "He may have solved the problem of her wanting to have kids with him, though.",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 119,
              "content": "My husband and I have had some really mean words and they were never anything close to this. I’m speechless; I can’t imagine hearing or saying something so cruel to your spouse.",
              "id": 70,
              "comments": [
                {
                  "score": 61,
                  "content": "I think the worst thing I’ve ever said in anger to my husband was “just shut the fuck up”. And I apologised profusely; we don’t talk to each other like that. I can’t imagine even thinking of something so cruel like this, to attack him where he’s most vulnerable.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Some people just seem to think theyre incredibly smart for having figured out something personally vulnerable about the other person. Yeah.. Youre \"smarter\" than like 5% that dont get it, the others specifically avoid trying to make something so personal. Some people dont seem to have empathy or compassion. Everything is just done to get you to your perceived goal, no questions asked.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I called my husband a baby 8 years ago, meanest thing I ever said to him and I still feel incredible guilt over it.  He says he doesn't even remember it but I do.",
                      "id": 73,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I’m sitting at the hospital in radiology to get an HSG to see if we can figure out why we’re not getting pregnant and I fucking CRIED just now reading that. \nI’m not even married to him. \nThat was horrifying.",
              "id": 74,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 136,
          "content": "You ain't kidding. As someone who's been going through IVF for five years and seen far too many negative test results... I don't think I could forgive a line like that.\n\nBut, in the spirit of giving some constructive advice... OP, if (and that's a massive IF) your wife is still interested in continuing your marriage and having children with you after this, have you looked into the possibility of IVF with PGS (Pre-Implanation Genetic Screening). My husband and I went through this after repeated failures with IVF to make sure there were no genetic abnormalities preventing implantation. If the disease you both carry is genetic, it may be something the screening will pick up and you can then transfer healthy embryos. It's an expensive option, true... and it will be another emotional burden on your marriage as well as taking a massive physical toll on your wife (IVF is no picnic - major understatement), but it is a middle ground that's worth looking into.\n\nBut not before you apologise to her and, if she accepts, get yourselves some counselling.",
          "id": 75,
          "comments": [
            {
              "score": 21,
              "content": "You might want to reply with this to the main post, or OP might not see it",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Yep. If they've been able to pick it up with your genetic screens it should be no problem to screen embryos. IVF is expensive and a hard slog for the woman to just go through egg collection etc. But genetic screening is totally worth investigating.",
              "id": 77,
              "comments": [
                {
                  "score": 1,
                  "content": "> IVF is expensive\n\nRaising a blind kid is also expensive. In the long term, IVF is probably cheaper.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 1,
                      "content": "True.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I thought this was a pretty common practice for people who knew they are carriers for something when using IVF.",
              "id": 80,
              "comments": [
                {
                  "score": 2,
                  "content": "I imagine so, but I don't know how many people actually know this sort of thing before starting IVF. I knew we didn't, but then my husband and I knew that IVF was our only chance to conceive from the start. It was an option given to us after multiple implantation failures, but it was more a general screening to ensure we were capable of producing viable embryos rather than looking for anything specific (although obviously they do that too).\n\nIt looks like OP is aware of PGS, but is put off by the expense (understandable - but worth noting that the expense is comparable to the cost of adopting a child, IIRC) and the worry about it not being successful even after spending all that money (more understandable). \n\nOP, I'm also going to assume that this is not something that can be tested for during early pregnancy, in the same way they screen for Downs Syndrome? Might be worth asking your doctor if you haven't already.",
                  "id": 81,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "What gets me is the blasé way he typed it out. If I had ever said anything so utterly cruel to a loved one I would be too ashamed to admit it, even to internet strangers.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "Is anyone else bothered by the fact that he says *her* pregnancy tests? As if it's somehow her failing.",
          "id": 83,
          "comments": [
            {
              "score": 2,
              "content": "Should he have said his pregnancy tests? Theres the right and the wrong details to get hung up about.",
              "id": 84,
              "comments": [
                {
                  "score": 2,
                  "content": "I'm not hung up, it just stood out to me. He could have said *the* or *our* tests.",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "My husband and I have been trying for almost a year with no success. If he said anything like that to me, I don’t think I could be around him anymore. The pain and frustration of not being able to conceive is so visceral and deep.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "This. As someone that struggled to got pregnant I really want to just destroy the OP because that is 1000000% NOT ACCEPTABLE to say to someone you should love and support. I was actually with OP until this statement. 25% is a higher chance than OPs wife is realizing and him not wanting to risk it is fair, although if it is only causing blindness and no other problems I could see why OPs wife is ok with it. As long as she is prepared to have a blind child and love it the same. But that line was beyond cruel and I wouldn’t be surprised if OPs wife struggles to move past it. Nor would I blame her. So ESH but IMO OP sucks more.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "She also said hurtful things though",
          "id": 88,
          "comments": [
            {
              "score": 8,
              "content": "Yes, but he crossed a line. They both need to work on communication but what he said was cruel to the point that he might not be able to come back from it.",
              "id": 89,
              "comments": [
                {
                  "score": 2,
                  "content": "That's fair but we don't know if she said something of a similar level. I guess OP would have mentioned if she did though.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 3,
                      "content": "He mentioned that she called him a coward, which definitely stings, but I wouldn't put it up there with what he said",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Thus the\n\n> ESH but you suck the most",
              "id": 92,
              "comments": [
                {
                  "score": 1,
                  "content": "I was saying that she too may have said things on a similar  level.",
                  "id": 93,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Not even CLOSE. \nNot even approaching the pain and harm that last line inflicts.",
              "id": 94,
              "comments": [
                {
                  "score": 2,
                  "content": "I was saying she may have said things on a similar level but OP didn't mention it. However, OP probably would have so you're right, it's unlikely",
                  "id": 95,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yeah, this dude would TOTALLY have no problem posting her hurtful comment on here to help justify his comment. Seems like the type.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1051,
      "content": "YTA... but not for not wanting to take the risk - I actually agree with you there. But that closing shot was horrific. You need to apologize for that, it was completely uncalled for.",
      "id": 97,
      "comments": [
        {
          "score": 548,
          "content": "YTA My jaw literally dropped when I read that. I had trouble conceiving and if my husband had said that to me it would have completely destroyed me.",
          "id": 98,
          "comments": [
            {
              "score": 347,
              "content": "It’s the sort of thing you can’t ever unhear and don’t ever forget. That level of pointed, vicious cruelty from the person you love most in the world and who is supposed to have your back always is potentially relationship ending. I couldn’t blame her if it was. \n\nYTA, OP, my god.",
              "id": 99,
              "comments": [
                {
                  "score": 41,
                  "content": "Yeah that’d be a divorce from me dawg.\n\nI wouldn’t want someone so cruel being the father of my child. Your true character comes out in times of stress and anger.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "[deleted]",
              "id": 101,
              "comments": [
                {
                  "score": 71,
                  "content": "I wouldn't be surprised if they can't go back to normal after that comment. That's the type of remark that you never forget, and it eats away at you and has the potential to destroy a relationship - maybe not immediately, but it can fester over time.\n\nI think OP and his wife desperately need to go to marriage counseling to help them through this - not just the fight, but this whole time period and the stress and disagreement over bio children. They need a neutral professional to help them, and too many couples wait to go until it's no longer salvageable. If they don't, based on their fight, their marriage could crumble as a result of all this.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "Same",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This!",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 83,
          "content": "Agree. I don’t blame you for wanting to use donor sperm and I think it’s an excellent option , unless there’s also the option of IVF creating an embryo that doesn’t carry the genetic issue? However 100% YTA for that parting shot. It took my husband and I 18 months to conceive. We both knew from pretty much the beginning that he wasn’t the issue but that I was. Even so, he never once said anything callous to me like that. That comment would have destroyed me.",
          "id": 105,
          "comments": [
            {
              "score": 15,
              "content": "This is ABSOLUTELY possible. It’s called PGD testing. A small amount of cells are taken from each embryo and tested for genetic disorders. It’s not cheap, but entirely worth it if you want to make sure you have a biological child without genetic abnormalities.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "YTA for exactly this. You’re nta for not wanting to have biological kids knowing the risks involved. You’re the asshole for what you said to her and how you’ve handled the situation, and for thinking there’s any reason she should be apologizing to you first.\n\nI know it’s super expensive and in this case kind of ‘playing god’ but have you guys thought about doing in vitro? I don’t even know if they’d do it if you’re supposedly both able to conceive naturally, but I believe they do genetic testing to the embryos and implant the most viable/healthiest ones. It would still be genetically both of yours if you went that route.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Agree, for the \"main issue\" of whether or not to have biological kids, then NAH, but for the argument, ESH (both assholes, but his lines were definitely worse)",
          "id": 108,
          "comments": [
            {
              "score": 1,
              "content": "His lines were orders of magnitudes worse. On the order of she slapped him vs. he disemboweled her.",
              "id": 109,
              "comments": [
                {
                  "score": 2,
                  "content": "Definitely agree with that, but that doesn't make her \"not an asshole\".  They both cleared that hurdle easily.  He just went much further down the \"asshole\" path.\n\nReally no point in arguing who's worse though, both went clearly beyond the threshold.  It's not really a victory to be a \"total asshole\" because the other person is a \"total *raging* asshole\"",
                  "id": 110,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Meh. I wouldn't call a fight where people do normal things in a fight assholes.",
                      "id": 111,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "can’t imagine how bad she already feels not being able to conceive easily. that was like a bullet to the heart",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 741,
      "content": "[deleted]",
      "id": 113,
      "comments": [
        {
          "score": 258,
          "content": "THIS \n\nInstead of just taking the word of 1 doctor, why don’t you start exploring your fertility options in full. There’s a ton of genetic testing that can be done. \n\nAlso, blind people can and do still live rich and full lives, it’s obviously not without its challenges but maybe you should get some advice from members of the blind community as well",
          "id": 114,
          "comments": [
            {
              "score": 135,
              "content": "[deleted]",
              "id": 115,
              "comments": [
                {
                  "score": 73,
                  "content": "25% is massive. I have misgivings on having an autistic child and that's 0.62% I think.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 28,
                      "content": "[deleted]",
                      "id": 117,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "Being blind isn’t a death sentence, plenty of people are blind and live fulfilling lives.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Yeah, as a very visually impaired person I always have a hard time not taking these threads personally, though I know I shouldn’t. I know that dealing with me was difficult for my parents. But I’m married and have a degree and a full-time job/career and cats. I love to cook and read and do yoga and hang out with friends. I like to think that I’m more than just a blind person. But I get it.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "25% chance. Flip two coins. That's all you have to do. It seems unthinkable to risk that",
                  "id": 120,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Off-topic but is that legal? Is it only for genetic disorders/diseases or can you also screen for *other* things? I don't know how to feel about that.",
          "id": 121,
          "comments": [
            {
              "score": 7,
              "content": "[deleted]",
              "id": 122,
              "comments": [
                {
                  "score": 1,
                  "content": "Thanks. I definitely hope there's some kind of legislation in place to limit the screening to just diseases and disorders though.",
                  "id": 123,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Was just thinking the same.",
          "id": 124,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Yeah, I don't understand the freak out. /u/mm1thrway, You can sequence cells from the embryo to see if it is homozygous for the disease and not implant those. In some states, insurance even covers this. I don't know why this wasn't suggested by the doctor.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Yeah cause everyone has an extra 100,000 lying around",
          "id": 126,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 330,
      "content": "That last shot was too far. So in that YTA. \n\nThe disagreement however, I’d have to say neither of you are the asshole. Your wife wants YOUR kid. I’ve got 3 with my husband, so I get that. But I also have a nephew with Down’s syndrome, so I get your concern as well. A child with a disability is not something to take lightly and being worried about that is valid.\n\nYou were an ass and need to reach out, but I don’t think something like your concern over having a blind child is something you just get over. Your genetic counselor should have recommended marriage counseling or further therapy before you make that decision TOGETHER.",
      "id": 127,
      "comments": [
        {
          "score": 53,
          "content": "In general, ESH, because his wife definitely shouldn’t be pressuring him into fathering a child he’s not sure he wants to father, but also JESUS CHRIST that last comment!!!\n\nHowever: a 25% chance of their child going blind? They can do what they want to do, but that’s hardly an end of the world diagnosis. Blindness isn’t going to damn their child to a miserable, unproductive, or painful life. There are plenty of adaptive technologies for them to achieve whatever they want. In the grand scheme of genetic disabilities to be scared of, this seems... minor?",
          "id": 128,
          "comments": [
            {
              "score": 128,
              "content": "Being blind is still a major disability that will severely limit opportunities in life. If a parent can prevent or lower the odds of their child being born with a disability they should. That includes expensive selective ivf treatment or sperm donation. Rolling the dice in this situation when you can actually prevent it all together is selfish. Parents who knowingly roll the dice on this are very selfish and knowingly hurt theyre child because they're too selfish or cheap to consider other options.",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 100,
              "content": "[deleted]",
              "id": 130,
              "comments": [
                {
                  "score": 44,
                  "content": "Thank you, I'm fucking astounded people justify being that selfish just so they can make their own precious mini-mes.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Cause some people think of kids as possessions, and not future adults that have to be self sufficient",
                      "id": 132,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "I’ve managed to do okay...",
                  "id": 133,
                  "comments": [
                    {
                      "score": 6,
                      "content": "[deleted]",
                      "id": 134,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Lol. Maybe he thought it was colorblind?",
                  "id": 135,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "It’s not about how bad of a disability it is. Some people would not chose to risk it, nor do they want to have the added pressure of raising a child that will experience a more difficult life. Some people feel differently. Neither are assholes. But these two people feel very differently and are married. Neither can just get over their opinion on something as major as bringing a child into the world.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "But I could only imagine if I were a blind person and found out my parents knew the risks...it would completely eff with my mind. To have a kid and potentially give them a disability for selfish reasons when it could be avoided is pure crap.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah exactly as far as genetic diseases go blindness and deafness are both able to live fully functional normal lives.",
              "id": 138,
              "comments": [
                {
                  "score": 45,
                  "content": "I think I disagree with you on that. Sure you can have a happy life while blind. Though by definition it is not fully functional or normal. Raising a blind child is going to take a lot of effort.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Wow this thread is making me feel like total shit as a (fully functional I thought) blind person.",
                      "id": 140,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "[deleted]",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This. YTA.",
          "id": 142,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 292,
      "content": "YTA! My husband and I have been doing through fertility treatments for 3 years, if he EVER said anything similar to me during a fight I would leave him then and there. To a woman struggling to get pregnant what you said hurt more than if you shot her in the foot.",
      "id": 143,
      "comments": [
        {
          "score": 79,
          "content": "I think ESH but the OP is the bigger asshole for that comment alone. My husband and I failed to conceive after 5 IVFs. I’m hurt even READING the comment. If that was my husband, I’d be considering separation. What an extremely hurtful, condescending comment...",
          "id": 144,
          "comments": [
            {
              "score": 3,
              "content": "Happy cake day",
              "id": 145,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 34,
          "content": "[deleted]",
          "id": 146,
          "comments": [
            {
              "score": 9,
              "content": "Based off this comment:\n\n> Things were completely different a week ago. \n\nThis is all way to fresh. She needs some time to let go of the no biological kids thing before they can discuss this rationally. They should 100% not be fighting about plans at the moment but simply supporting each other through the grief of this news they have heard that could have major implications on their life.\n\nI guess still ESH as they are both fighting about it. But I have a lot of empathy for his wife and the fact that she is not handling it the best way. She needs some time to process first.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 221,
      "content": "YTA - If you love someone, you don't take cheap shots like that last line to said to your wife. You need to apologise for what you said. If she takes you back, I suggest you treat your wife with respect during all conversations instead of taking cheap shots just to hurt her. If you two can't have mature conversations, then you both need therapy so you can learn to communicate like adults.",
      "id": 148,
      "comments": [
        {
          "score": 73,
          "content": "“If she takes you back...” Yup, exactly what I was thinking.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 213,
      "content": "YTA, Jesus. I couldn’t imagine anything more hurtful to say than that I shouldn’t care about not being able to become pregnant because I could stay THIN until I got to your last line. I would leave you over this.",
      "id": 150,
      "comments": [
        {
          "score": 105,
          "content": "[deleted]",
          "id": 151,
          "comments": [
            {
              "score": 34,
              "content": "Bingo.\n\nWhen judging these AITAs that boil down to \"AITA for saying X?\", my litmus test is usually \"If my most toxic ex--the one I was terrified to try to leave--said this to me when I was at my most scared and miserable and trapped, would this have so shocked me that I would have been able to get up and go?\".  The level of cruelty in that statement was so harsh that I can see my past self throwing everything in a bag and walking out the door.\n\nOP, you have hit a new standard for hurtful words.",
              "id": 152,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 112,
      "content": "ESH - Fuck dude. You both said some pretty shitty to each other so it's an ESH but I'm so sorry you're going through this. Once you sober up, give your wife a call. No sense stewing about it anymore.\n\nINFO: Have you considered IVF with your sperm and just only select embryos without that gene?",
      "id": 153,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 98,
      "content": "NTA for not wanting a bio kid in this circumstance\n\nYTA for saying that line and being too petty to apologize. That was incredibly harsh and hurtful. A lot of women *do* want to be pregnant, by the man they love. Saying something like that rightfully made her question if she can love you. Not apologizing doesn't help\n\nSober up and call her and talk it out, get more info about the potential blindness - would it be complete, what's the disease, get a second opinion, etc. Don't just sit at home and lose your marriage without fighting for it, at least \n\nSincerely - fellow drunk stranger",
      "id": 154,
      "comments": [],
      "relation": "Support"
    }
  ]
}