{
  "post content": "So, my daughter was born over 3 months early. She's doing ok but she still have periods where she Bradly desats (braddies) where she stops breathing, oxygen saturation drops in her body and goes bright blue. She does this at least once a day and because of this, she is still in the NICU with no current projection for when she's coming home. The only thing I can do to help her is to give her cuddles and provide her milk, which means expressing for 20 minutes minimum on each boob every 2 to 3 hours, including over night. \n\nI have also had problems with flees in my home (they've been awful for everyone in my area this year), so I've torn up all carpets and thrown away my sofa and mattress, so I'm currently sleeping on the floor on a blow up mattress with my fiancé. This means that any noise that I make, no matter how much I try to minimise it, carries downstairs to my neighbour.\n\nI express milk over night, once at 11:30pm, 1am and then at 6:30am. My neighbour downstairs knocked on my door this morning and complained about my 1am alarm waking him up. I apologised and told him that I can't turn that specific alarm off because it's the expression that impacts my milk flow and doing that expression will prompt me to produce more milk over the day. I'm already under enough stress that my milk flow has already been impacted ( I was producing around 100ml and I'm down to 50 to 70 ml). I need the alarms because I cannot miss my expressions, I already feel guilty enough that I'm not producing as much as I was.\n\n I explained all this to him and he still said that it wakes him up and that he can't sleep after it wakes him up. I again apologised and said to him that I can set my alarm between 1am and 3:30am, and he can choose from between those times. He said I should just turn the alarm off and I responded that I can't, because I can't afford to sleep through my expressions times. He then said that I should express after 5am, which isn't possible because the hormones that help produce more milk are at their peak at between 1am and 4am. \n\nHe complained about it waking him up again and I angrily responded that \"My daughter is premature, she needs my milk and I will do everything to make sure she's got as much as she needs, including waking you up at 1am because I need to express!  She is my priority, not your sleep.\" I closed the door in his face. \n\nI just spoke to one of my friends and she's telling me that I'm the asshole because my daughter is eating every 3 hours and I'm making just enough milk every time for at least one meal for her, so \"it won't hurt to not express the 1am expression\" but it honestly IS the most important expression for milk production.\n\nSo Reddit, AITA for not stopping expressing at 1am even though I know it wakes up my neighbour?\n\nETA: many people have suggested I put the phone on vibrate, which would be a fantastic solution if it wasn't for the fact that I have slept straight through having injections or having a cannula put in (I was awoken long enough to give permission to have it put in). I'm open to solutions, but putting my phone on vibrate isn't going to work.\n\nEta2: I gave him noise cancelling earplugs and explained the situation when I first came home from the hospital. We also pulled up the carpets 4 days before I went into labour, so it's not something that we could control, we have to leave the flea solution to work for 2 weeks and the firm has already been booked to have new flooring put in after that 2 weeks.\n\nEta3: I've been asked to add this because it gives context to my neighbour's view regarding noise.\n\"He apparently needs absolute silence, noise or vibration doesn't seem to matter. He made a noise complaint when I moved in because I flushed my toilet at night and then again when my cat jumped down from her cat tree to get food or water at night. I've learned every squeaky floorboard in my home because if I stand on one and the squeak wakes him up, he'll scream and bang on the ceiling.\"\n\nThis will be my last edit, I am no longer going to be reading comments here or via pm as there has been some pretty heinous messages sent to me. I get it Reddit I'm the asshole but to have people tell me my daughter should stop breathing and die is unacceptable and I have reported that specific message and blocked the user. This is quite enough internet for a while.",
  "id": 1,
  "comments": [
    {
      "score": 11106,
      "content": "I’m really sorry for the situation you’re in, I appreciate how hard it must be for you, but I’m afraid I think YTA. Legally, he is entitled to reasonable enjoyment of his home which you are preventing. If you stop someone else sleeping every single night for weeks on end you ruin their life. That’s a huge thing. You need to work out how to do what you need without destroying him like that. Maybe you and your partner could take it in turns to wear headphones at night with an alarm that goes directly to those? Find a solution. Don’t just say you dgaf about imposing severe and persistent sleep deprivation on those around you.",
      "id": 2,
      "comments": [
        {
          "score": 4186,
          "content": "[removed]",
          "id": 3,
          "comments": [
            {
              "score": 3080,
              "content": "The thing is that she isn’t making consistent noise over a period of time. It is one noise. That her neighbor can’t get back to sleep again once he is woken up isn’t her fault. What if she was on a late shift and that was when she got home or had to leave? Or was up playing games late. He only has a right to a reasonable level of quiet.",
              "id": 4,
              "comments": [
                {
                  "score": 2240,
                  "content": "And her ripping out the flooring has destroyed any sound damping the apartment had. But regardless of whether him not being able to fall asleep is his problem, her manner of speaking to the neighbor was rude, uncalled for, makes her TAH, and will probably come back to bite her",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4610,
                      "content": "She's bringing a baby home.\nBaby's cry. Is the baby to adhere to his schedule?\n\nThis is going to get much worse",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 57,
                      "content": "Yes. Get new carpets and bed. I’m sure you are sleep Deprived but not having a bed will make it worse.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I think this might be a key point - you have removed everything from the apartment, I'm assuming it is echoey and loud in there when your alarm goes off. Any chance you could buy an area rug to cover the floor and help dampen the noise? Curtains? \n\nIdk I've lived in apartments for a long time, including a time when I was working as a baker and waking up at 2:45AM for my morning h and I have never had the issue of hearing another person's alarm through the walls/floors etc. but I have also not ripped out flooring.\n\nSubfloor is subfloor for a reason, it's not meant to be the only thing between you and the other units. Do you have a plan to replace the flooring? I understand that's probably not priority #1 right now, but this could be contributing to the annoyance your neighbor is feeling.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Granted, this is based on OPs post, which is influenced by their views, but OP apparently tried to explain things nicely, even apologizing for the noise. It's only when the neighbor gets frustrated/angry that OP gets snarky. I admit to not really understanding everything about what she does, but the way I do understand is like this: OP has a newborn that was born prematurely. Said newborn is having issues and is currently in the NICU. OP is struggling to produce enough milk for the baby and so needs every chance they get to pump said milk. The neighbor is, presumably, a bachelor without kids, and he can't really understand OP's situation. However, the neighbor has several solutions he can utilize, such as earplugs.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "He told her she needed to express her milk at a time of his choosing, as if he has any right to tell a mother when she should express her milk. I'd be pissed AF if some guy said that to me. Her reaction was justified.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "If she tried to explain and naighbour was still being an ass then i feel she handled it just right. Neighbour seems a little entitled. Op realizes things are not ideal and is trying to accomodate and be respectfull but you just cant please some people and those people need to be told harshly that no one really cares about their tiny problems.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 379,
                  "content": "Actually, it might be her fault, most leases in buildings nowadays say you must have a vast majority of the floor covered by carpet or rugs to prevent sound travel. She may be in violation of her lease.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 287,
                      "content": "What? Is this an American thing? I'm in Germany, and not living in an apartment with carpet ever again (did once plus my childhood room had carpet until I was 15) is one of two hard boundaries for any future home I have. Rugs are okay, but I have a great total of 3 of those including the bathroom mat. I have never heard of it being a must. The flooring (wood flooring in one room, linoleum with wood design or tiles in the others) has a sound dampening material underneath and that's how it's common here. Carpet fortunately isn't very common.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 286,
                      "content": "If she didn't get written permission to tear out the carpeting she's in violation of the lease. Most landlords don't like it when people make unapproved modifications to their property.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 214,
                  "content": "It sounds like OP is a heavy sleeper so a crazy loud alarm every 3 hours for 6 mo or whatever is pretty heinous. It’s her baby not the apartment buildings. She can wear headphones and have an alarm then and it won’t effect other peoples quality of life.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I’ll bet she finds another solution real fast when the baby is home. Waking it will not be an option.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "How about a wrist vibration alarm.   Your phone can vibrate instead of ringing, why not something like that.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 213,
                  "content": "She ripped up her floor and got rid of her furniture so every sound now travels. That's her fault.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Guy complained about the toilet flashing so it sounds like the soundproofing between units was crap even before pulling up the carpets.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 153,
                  "content": "He has a right to peace and quiet in his appartement. Waking him up multiple times per night, every night is not reasonable.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 113,
                      "content": "Oof he’s going to hate when the baby comes home",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 38,
                      "content": "Lol someone never has lived in a apartment obviously",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 37,
                      "content": "This is an apartment, not a house You guys need to stop acting like apartments are the same as a house. They never will be. You just won't get the same amount of silence and privacy as you would with a home. It's sucks, but that's apartment living.\n\nIf you don't want to deal with life's daily noises, then get a house.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "You are so very wrong. You cannot control all the sound around you. Apartments are about balancing, doing things that make you happy/you need to do with the need for comfort and reasonable noise pollution in your own living space. \n\nPeople set alarms. People work overnight shifts. People get up early and move around in their house. If an alarm is ruining his living situation, he's not cut out for apartments.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 105,
                  "content": ">What if she was on a late shift and that was when she got home or had to leave? Or was up playing games late.\n\nBut that's not what's happening? Both of us can make up whatever shit we want to absolve either of these two people, but that's all meaningless. The situation is what's been described, making up fake what ifs is no help here.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 21,
                      "content": "God it drives me nuts when people add information to the original post that doesn’t have anything to do with what the person is actually talking about!!",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": "I had an upstairs neighbour wake me every night for about a year (seems he only knew how to bang doors and not how to close them, so he woke me every night when he went to pee). I could almost never get back to sleep afterwards because it was around 3:30 and i guess at a certain point in my sleep cycle. It was an absolute nightmare, I nearly lost my mind.",
              "id": 27,
              "comments": [
                {
                  "score": 24,
                  "content": "I’m so sorry that happened to you! I had a neighbor before that was downstairs from me and would play his music so loud my floor would vibrate. Even during the day, it violated noise ordinances, but at night it would not only wake me, it would give me panic attacks and I couldn’t fall asleep again. A good night’s sleep makes a HUGE difference in your life, mood, and health",
                  "id": 28,
                  "comments": [
                    {
                      "score": 15,
                      "content": "My neighbour above me (I live on the ground floor) used to blast music really loudly on a Friday night every now and then  \n\n\nI would have to get up for work at 4:30 on the saturday and I don't know the amount of the times he would wake me up at 1 or 2 in the morning and I'd have to go pound on his door to tell him to turn it down, had to get the police involved a couple of times, one of which he threatened to beat me up over.\n\nthe really annoying thing about it was that I would wear headphones to bed anyway, but could hear his shite over what I was listening. Still never had an apology from him about it",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I had a neighbor who was a cab driver, and every night at 3:30am he would come home and slam his door and wake me up for about a year too! On top of that he would have his daughter over on weekends and she would run back and forth all day against my wall until about 11 pm every night (after 11pm he would have enough and tell her bed time so the screaming and crying would last until 12 am). Sometimes I would go back to sleep, sometimes with the help of a joint in the middle of the night, or sometimes I would not sleep at all. \n\nI did not sleep without interruptions for a year, and the month after he moved out I started to realize my skin was more rosy, my eyes less sunken in, I had more energy at work, I didn't have the need to smoke as much weed, I was eating better.\n\nInterrupted sleep is a silent killer, which nobody seems to know. It destroys your body slowly without you realizing it.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Seriously, the only way to make some people understand is to do it back to them.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "I agree with you. It has been over a  year since I've actually slept a full night without being woken up at least once at night.. The last month my husband has been sleeping on the sofa because he is a herniated disc in his back and it's more comfortable. That means that anytime a dog wants to go out in the night, I'm the one who has to get up and let them out because they sleep in the bedroom. I swear I feel like I'm losing my mind. My mood is up and down all the time. I go from feeling practically euphoric to just being crabby and irritated. I can barely stay awake in the afternoon. I'm just grateful that I don't work anymore because there's no way I could function at a job. My focus is just terrible. It's been so bad that my husband is sending me down to Mexico for a week by myself to do some diving and get quality sleep.",
              "id": 32,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "I went through a period of about a year where I slept poorly due to some physical issues - I wasn't generally in pain, I just couldn't sleep. I tried EVERYTHING, short of actual sedatives (I would have, if my doctor would have prescribed them). I literally was contemplating suicide. It is indeed, no joke.  \nNo judgment either way on OP. I lean to Y T A since it is a very clear case of \"offloading my problems\" to someone else, but OTOH hopefully it will be short-lived.",
              "id": 33,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1243,
          "content": "But what’s going to happen when the baby actually comes home? If he wakes up from an alarm he is going to be awake all the time with a crying baby. This is a landlord/building owner issue. They should replace the carpet and if things are bad enough let the other guy out of his lease. A crying baby will ruin his sleep and life but legally there is nothing he can do about that despite wanting reasonable enjoyment of his home. It’s her home too. Should she move out just because she will have a baby up at all hours of the night? How is this any different when she is actually making less noise than what will be there after baby comes home?",
          "id": 34,
          "comments": [
            {
              "score": 305,
              "content": "Depending where he is, the landlord can evict OP also it sounds like she didn’t get permission to rip up the carpet. The landlord might evict her for that and keep her deposit. I am curious if the fleas are a her problem or a building problem",
              "id": 35,
              "comments": [
                {
                  "score": 364,
                  "content": "Typically if there is a problem, unit or building-wide the landlord would spray for it. But the fact that only OP ripped out the carpets and threw out everything leads me to believe there is more at play here. Why are they on an air mattress on the floor? This makes no sense.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 233,
                      "content": "[deleted]",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 23,
                      "content": "Expecting landlords to actually pay for repairs or extermination without being legally forced to do so is your mistake.",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "Right, it doesn't sound like a stable environment for a newborn with health issues.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Some people in the comments speculated that the problem was bedbugs as opposed to fleas, the latter is pretty easy to treat with intense fumigation.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "There's honestly something fishy about the story.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "She said she's from the UK but I'm pretty sure parents get special protection, in most places you can't kick someone out because they have a baby (even if all of their neighbours are annoyed)",
                  "id": 42,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "Evicting a family for a crying baby would be illegal in any civilized country.",
                  "id": 43,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "It would be incredibly fucked up if a landlord is allowed to legally evict someone because of a crying baby, or because they have an alarm set for 1AM.",
                  "id": 44,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "She may own her home. She didn’t say wether she owns or rents",
                  "id": 45,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "She's in the UK. It's rare to have a carpeted flat in the UK in the first place. The landlord might keep her deposit, but landlords in the UK kinda try to do that a lot anyway even when the place is in bettwr shape than it was when you moved in and if she restores the carpet before she moves out (which seems to be the plan) then they probably won't keep it all (if they moved in recently, the infestation might also predate the tenancy so it's all the landlord's responsibility too). \n\nIn my experience renting in the UK, nobody is going to do shit about someone making a short duration noise in a flat. I used to live above people who had a dog that would bark at all hours, but they owned the flat so nobody could do anything. The people above us were constantly dragging furniture around, screaming in the stairwell, leaving trash in the stairwell and also had three people living in the flat instead of the one who was supposed to be there and they still didn't get evicted even though we complained to their property management company.",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 131,
              "content": "Speaking from personal experience, an alarm is something I've learned to wake up to when I hear it. While a natural sound like a baby crying is something I ignore and sleep through",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "OP will need to do something to alleviate noise. Her landlord needs to send someone to deal with the fleas (seems like a vulnerable baby shouldn’t be exposed to those anyway???) and then she needs to put down rugs.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I’d hope by the time baby is home they have carpets and a proper bed so the noisy phone isn’t resting straight in the floorboards. I’m also assuming they won’t rest crying baby straight onto the floorboards either.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yeah this neighbor seems a little over the top. If he wakes up from a toilet flushing or a cat jumping from its cat tree that’s a bit extreme. What happens when the kid becomes a toddler and is running across the floor? I think OP tried to reason with him and explain this is a temporary situation and he was having none of it.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 432,
          "content": "I can't imagine someone could be in trouble for setting an alarm to wake up no matter what the reason is. She isn't playing music or running a vacuum.",
          "id": 51,
          "comments": [
            {
              "score": 198,
              "content": "She's in the UK, nothing the guy can do accept wear ear plugs, the nosie would be over before anti social team got there and the cops would most likely roll their eyes cause ya know real crimes",
              "id": 52,
              "comments": [
                {
                  "score": 34,
                  "content": "She’s in the UK! Oh man the comments here are so out of whack it’s unreal. She should have put that on her post. I’ve had TV noise at 3am from neighbours and there is sweet FA that can be done about it.",
                  "id": 53,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": ">ya know real crimes\n\nAlso the uk https://www.independent.co.uk/news/uk/crime/autistic-teenage-girl-police-tiktok-b2391163.html",
                  "id": 54,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yeah well there are idiots everywhere, I and these idiot coppers took what she said in the wrong context completely.",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "Yea this is ridiculous",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I mean what if she had to get up super early for work between 1 and 4. I gotta say nta, baby needs to eat. Sounds like a property problem.",
              "id": 57,
              "comments": [
                {
                  "score": 12,
                  "content": "Guy is really going to lose his shit when they bring home the baby and he hears the baby crying all night long 😂",
                  "id": 58,
                  "comments": [
                    {
                      "score": 4,
                      "content": "He should move to the woods. This is so not OP's issue.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "What if OP worked at a bakery and needed to wake up at such an hour to go to work? I understand the neighbor being upset but OP has the right to set an alarm in her own home. It’s not like she’s throwing a party every night! NTA",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 353,
          "content": "What will happen when she brings the baby home & the baby cries for their night feed? Babies are renown to be a lot louder than a phone alarm. He won't sleep then either & he cannot ask her to stop the baby from crying.",
          "id": 61,
          "comments": [
            {
              "score": 89,
              "content": "All the more reason for OP to attempt to work things out now with her neighbor as best she can. Between that and her new flooring being installed soon, hopefully she can avoid further battles of TAs with her neighbor.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Yeah I agree. It’s stupid to ask a neighbor to not have a freaking alarm clock. OP get the landlord involved but make sure you have carpets first",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 91,
          "content": "There’s also “shake awake” alarms for hard of hearing folks - a buzzer that goes under your mattress/pillow that OP’s neighbour wouldn’t hear\n\nEdit: I stand corrected",
          "id": 64,
          "comments": [
            {
              "score": 34,
              "content": "Those are 100 times louder than a regular alarm. My son had one at the other end of a long hallway. It would wake me up before it woke him up because the vibrations shake the whole house",
              "id": 65,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "I have a very loud alarm and I think the vibration is way louder, I have to turn it off or I will wake up violently.\n\nDoes the shake awake not have that issue?",
              "id": 66,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Hundreds of thousands of people wear silent alarms on their wrists every day — it’s very weird to me that not one person has suggested just setting the alarm to go off on their smart watch. Completely silent and affects only the wearer.",
              "id": 67,
              "comments": [
                {
                  "score": 9,
                  "content": "I have a smart watch and I can totally sleep through those vibrations.",
                  "id": 68,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 81,
          "content": "OP needs to do something. She could buy soundproofing materials and put them under her mattress. Make a little egg carton nest for the phone",
          "id": 69,
          "comments": [
            {
              "score": 16,
              "content": "Landlord needs to do something. I've literally never heard any of my neighbors except when I'm in the hall",
              "id": 70,
              "comments": [
                {
                  "score": 11,
                  "content": "Yeah I'm not gonna lie my first ever apartment must have had terrible sound proofing or whatever because the guy below me was complaining about sound before I even moved in. (Bitched about the former resident's kid's school alarm.) Things got unreasonable when my friend dropped a pencil and the neighbor slammed against the roof (my floor) so hard shit fell off my shelf and hit the ground, which made him more irate. \n\nBefore long he was cornering me in the parking lot trying to reason with me over the noise but honestly at most I was dropping pillows or a plush off my bed at night. I genuinely didn't have an answer.\n\nIt was pretty funny when our 6ft 6\" friend came over and anywhere my friend walked, the dude followed with a broom slamming away at the ceiling. \n\nMe and my roommate ended up moving elsewhere and just paid the remaining 3 months of rent to gtfo. And he was *still* complaining when we'd show up to grab stuff for like 2 out of 24 hours.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "AH downstairs could either get used to living in an apartment or move to a house out in the country.",
              "id": 72,
              "comments": [
                {
                  "score": 12,
                  "content": "This is kinda my deal. Like ok, look. I've been complained on. I've been the complainer. But I do expect to hear my neighbors. But that's just my lot in life being part of wall-to-wall dwellings. These things happen and in OPs case it sounds like the situation is temporary. Kinda like roadwork outside your house.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "Agreed. There are plenty of vibration alarms that are work like watches or go under the pillow.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "This is the very best idea. I sleep with earbuds in every night so that my alarm from my cell phone does not wake my husband in the morning.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "You're not entitled to complete silence when you share walls with other people.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Sleep with earbuds in and connected to your phone. The alarm will come through the earbuds.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5457,
      "content": "YTA but only because you refuse to even think of a way to not disturb your neighbor. Can you put your phone on vibrate and put it in the bed with you? Do you have or can you get a cheap smart watch that will vibrate your arm. You just unilaterally decided it's with wake him up or don't express but there are other options.",
      "id": 78,
      "comments": [
        {
          "score": 2436,
          "content": "Or the alarm clocks that go under your pillow, designed explicitly for the deaf and hard of hearing community.",
          "id": 79,
          "comments": [
            {
              "score": 870,
              "content": "This. I think there’s a type of alarm with bright flashing light for hearing-impaired people? I understand that OP is in a difficult situation, but she didn’t even tried to find an alternative/solution. And the way she assumed everyone around her should prioritise her expression of milk over everything seems a little entitled IMO. YTA.",
              "id": 80,
              "comments": [
                {
                  "score": 146,
                  "content": "There is indeed deaf person flashing alarms. There’s also cheaper ways of doing this, like an Alexa and smart bulb set up to flash at certain times.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 246,
                      "content": "Yes, but I took a quick look at OP’s comments. Judging from how she shot down almost every possible solution suggested here and called her neighbor petty, I don’t think she is actually keen on solving this problem. I think she holds a grudge against her neighbor for filing noise complaints and was weaponising her expression of milk to make even more noises as a petty revenge. For the sake of your poor neighbor, OP, prove me wrong!",
                      "id": 82,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I genuinely dislike when someone says something along the lines of « well I have stuff going on so I’m not gonna care about how my actions impact your life » as if they’re the only one dealing with shit. You don’t know what the person talking to you has on their plate, and you don’t know when the tables could be flipped. Reacting with empathy and politeness will always win",
                  "id": 83,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I wish I could give you an award for saying this. Another redditor in this thread kept repeating how hard pregnancy and motherhood is when that’s not even relevant. We all have stuff going on and this is not a *how shitty is your life* competition. The thing is whether you have shown empathy by exhausting every method to try minimise the nuisance you caused to others. OP clearly hasn’t.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Or could she simply not use the vibration alarm setting on the phone. Way quieter than an audible alarm!",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "There's also lamps that gives the same effects the sun does when it wakes us up too.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 4,
                      "content": "That’s the only thing that gets me up in the morning. Alexa turns on all of my smart lights (plus music) and it’s either go through multiple instructions to turn everything off, by which time I’m now wide awake, or just get my ass up. And this is coming from someone who literally slept through the security alarm in my parents’ house going off & the police coming to the house when I was a teenager! If the lights can wake me up, they can wake anyone (not visually impaired) up! 🤷🏻‍♀️😆😆😆😆",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I'm over here trying to understand why she needs to express 3x a night... A newborn is a different story, but the baby is in the hospital still. I'm really racking my brain trying to understand why she absolutely has to express at 1am. Yes, it's the best production time or something like that (as stated in the post), but she can't expect others to suffer just because its the best time.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 6,
                      "content": "A lactating mother’s prolactin levels are highest in the middle of the night. (Prolactin is the major milk-making hormone.) Milk supply is tied to how often milk is expressed, whether nursed or pumped. A newborn feeds every 2-3 hours, so milk needs to be removed that often to produce enough milk to sustain the baby. Failing to remove milk decreases the supply. \n\nTrust, getting up in the middle of the night to pump is a special kind of torture. But there’s a legitimate reason to do it.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I had to express after my son was born, it was hammered in by the staff that expressing in the early hours was absolutely essential for maintaining supply. The implication to a tired and distressed new mother being that doing anything less is failing your child.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "You can even just get a piece of noise absorbent material that the alarm clock can be set on, so that \\*some\\* of the sound gets absorbed (and only sound that bounces off the walls/ceilings goes downstairs).  And/or an alarm clock that has better volume control on it, so you can set it just loud enough to wake you up.\n\nPlus, \"my hormones for expressing are best at that time\" is a little ridiculous.  If you're lactating, and you collect milk frequently, your body will keep producing it.  You don't HAVE to do it at exactly that 2 hour window.  His request for 5am is reasonable.\n\nIf you firmly believe that 1-3 am is a requirement, then it is up to you (OP) to manage that schedule without disrupting your neighbor(s).\n\nYTA",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Get a goddamn Apple Watch! OP sucks.",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 846,
          "content": "What’s she supposed to do when the baby comes home and cries at night if the neighbour is already complaining about one alarm going off? Sounds like he’s going to need some earplugs either way.",
          "id": 93,
          "comments": [
            {
              "score": 1092,
              "content": "The baby can't help crying, she can do something about the alarm. It would be wrong to get mad at a baby for crying you can definitely talk to your neighbor who is setting an alarm at 1am.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "Address the carpeting issue or get evicted? Not hard.  YTA",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Get a thick carpet 🤷‍♂️",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Literally putting your phone between your pillow and mattress is the answer. The sound is muffled enough, not transferring right through the plywood floor, and you definitely still hear it enough to wake up with the additional vibration through your pillow. Never failed to wake me up but is probably less than half the overall sound pollution.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Or put it in a box with an open face towards the bed. Direct the sound a bit.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3767,
      "content": "YTA \n\n\nSounds like you are going through a tough time, but your alarm should not be waking up your neighbours. \n\n\nHow would you feel if your neighbour made unreasonable noise at 1am waking you and your baby?",
      "id": 99,
      "comments": [
        {
          "score": 1608,
          "content": "I mean, define unreasonable though. It's not like op is blaring music at all hours of the night, or fighting with her fiance loud enough for the neighbors to hear all the gossip, she's not stomping around throwing drunken parties. It's an alarm. She wakes up and turns it off then goes about her time. \n\nFrankly I'm convinced most of these commenters have never lived in a apartment with thin walls. Even WITH carpet hearing our upstairs, downstairs, and next door neighbors cooking, cleaning, fighting, laughing etc was normal. It's an *alarm* that at most is going off for a few seconds if OP is to be believed that she doesn't snooze or skip it.",
          "id": 100,
          "comments": [
            {
              "score": 637,
              "content": "Except usually at night it's calm because people sleep. So the comparison doesn't hold. People cook and laugh and clean during the day, not at 2 am (and those who are insomniac like me know better than to do that crap).",
              "id": 101,
              "comments": [
                {
                  "score": 729,
                  "content": "Sometimes people work nights or early morning shifts. One alarm isn't unreasonable, and it's a lot quieter than the baby will be when they come home",
                  "id": 102,
                  "comments": [
                    {
                      "score": 251,
                      "content": "She said she’s a deep sleeper, so who’s to say that she immediately shuts the alarm off as soon as it goes off? It could possibly be blaring for a few minutes before she even wakes up to get it.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Depends how loud the alarm is. Since OP insists she and fiancé are both heavy sleepers, and there is no soundproofing at all because she removed it, I’m going to guess it’s unreasonably loud in his apartment.",
                      "id": 104,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "It’s an alarm every few hours, though. He has every right to expect to be able to sleep in his own apartment.",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 260,
                  "content": "Honestly it depends. I had a downstairs neighbor that complained I walked too loudly at 10 p.m. Like the walking one does from bedroom to kitchen for water, or from bedroom to bathroom and back again, not an excessive amount. He even barged into my unit twice at night to “inspect” it because he was sure that amount of noise couldn’t be coming from just me. I have flat feet, so yeah, maybe I walk slightly more loudly than an average person. The neighbor was unreasonable. I already had wall-to-wall carpeting, but even when I paid for new medium-quality (best I could afford) plush carpeting wall-to-wall, he still complained about the noise from my unit to management. Here’s the kicker: the night he complained directly to management was a night when I wasn’t even home, so he had reported noise coming from an empty unit.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 122,
                      "content": ">He even barged into my unit twice at night\n\nI would have called the police and gotten a restraining order (PIN in the UK). You don't barge into my home. That's trespassing.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yeah, he was definitely just looking for things to complain about tbh 🙄",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I think I had your downstairs neighbor for a few years. We called her the Reever.",
                      "id": 109,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "You might not realize how heavy your steps are. I don’t have flat feet, but apparently I sound like an elephant to my husband and downstairs neighbor when I walk. My husband, who’s sensitive to sounds, started hearing phantom steps because he was so sensitized by how loud I walk. I got a pair of cloud slippers and now everyone is happy.",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "What if she had a night job? I feel like people are shutting on her because she is doing unpaid labor that most people don’t understand.\n\nHer friend is a dumbass trying to explain how lactation works to the actual lactating person.",
                  "id": 111,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "No, it’s not. There are people who work night shifts, are night owls, etc. it’s unreasonable to expect a neighbor not to have an alarm because the walls are thin. If the neighbor has a problem, they need to go live in their own house instead of in an apartment.",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Right!? These people are so entitled. Apartment living comes with all kinds of unwanted noise. \n\nOne commenter suggested it’s sleep deprivation is a war crime haha. So the young adults loudly having sex in the apartment above me are war criminals!",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "You know what else makes noise at night though?\n\n\nBabies.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": ">(and those who are insomniac like me know better than to do that crap).\n\nWhat? What about night shift workers and such? Why are people supposed to stop living because it's an \"unreasonable\" time for other people?\n\nWhat if she was just somebody who worked at 3AM and needed to wake up at 1AM to get ready? What if she had a medication she needed to take at specific times? What if she's a woman who wants to change her pad/tampon/whatever every 4 hours? What if that's just the time she's awake still and she sets a timer/alarm for cooking?\n\nFrom what OP says, the alarm would be waking the neighbour up even with the flooring not ripped up.",
                  "id": 115,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 424,
              "content": "She removed all of the soft furnishings that help manage sound. She absolutely made the noise problem significantly worse and refuses to do anything to mitigate it. Any claims she makes about how ‘reasonable’ her alarm is are highly suspect at this point. Given what she’s said about how she will sleep through anything, her alarm is probably like an air horn.",
              "id": 116,
              "comments": [
                {
                  "score": 176,
                  "content": "Yup. Willing to bet she's also not responding to it immediately, because she's recovering from pregnancy and childbirth and sleep-deprived herself. It's still incredibly inconsiderate to the downstairs neighbor, because the least she could do is add an area rug to cushion some sound, get a cheap bedshaker alarm or a watch, keep the phone right next to her ear for when the alarm goes off, etc. \n\nI've managed to sleep in hostels and catch super early morning flights without waking up everyone in the room, because I put care into making sure I inconvenience the others as little as possible. There's *so* much room between sleeping directly on the floor with no sound barriers and a blaring alarm, and \"well I don't always wake up if I put it on vibrate,\" and she's choosing to die on this hill. \n\nCan't imagine how nasty this is going to get once she has the crying baby at home up at all hours, too. I doubt the neighbor's going to extend her much grace knowing she didn't even care when she could control it.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 29,
                      "content": "I've tried nothing and I'm all out of ideas!",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "And it’s probably directly sitting on the floor next to her air mattress.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 78,
              "content": "Not reasonable is multiple alarms every night that are loud enough to wake up neighbors. The function of an alarm is to be loud, startling, jarring--completely different from the standard walking/talking/cooking activities that folks do and that can acclimatized to (to some degree). A blaring alarm does not fit that criteria",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "She has no carpeting or furniture because she threw everything out. And she has the alarm clock on the floor. She may as well put it in her downstairs neighbor’s apartment and ask him to call her when the alarm goes off.",
              "id": 121,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Remember that on reddit you are always in great danger of receiving advice from a literal 14 year old",
              "id": 122,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "[deleted]",
              "id": 123,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "If your alarm is loud enough to wake up a downstairs or upstairs neighbor, it's way too fucking loud and totally unreasonable. No alarm needs to be that loud unless you have measurable hearing loss. And if that's the case, guess what, it's on you to find a way to use an alarm that doesn't have the volume of an air horn. I've lived in very thin walled apartments. A neighbor on the same floor could be clearly heard talking on the phone at a normal volume. But guess what? This isn't coming through the walls, it's through the floor. And it's not just 'able to hear it clearly'. It's 'loud enough to wake him up'. It doesn't matter if it only goes off for a few seconds. Last I checked being woken up isn't dependent on how long the alarm is. \n\nAt the end of the day, OP definitely gets YTA for not even considering her neighbors ability to sleep. Zero effort to accommodate neighbors in a thin walled apartment is an automatic YTA, in pretty much every scenario. Sometimes nothing can be done, but not even trying or thinking about it is not the same.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Blaring alarm at 1am\n\nHe’s essentially getting just as much or less sleep as her",
              "id": 125,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I feel like there are a lot of people in the comments who haven’t ever lived in an apartment building. I can literally hear my neighbor’s phone vibrate when it’s on a desk or table. I can also hear him go pee. Expecting your neighbor to stop using their phone alarm is wild. All the YTA comments that say OP should adjust their phone alarm to accommodate her neighbor is just wild.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "> Even WITH carpet hearing our upstairs, downstairs, and next door neighbors cooking, cleaning, fighting, laughing etc was normal. \n\nExcept in almost all of these normal situations these things are not happening every night at 1:00 - 3:00AM. In any of these situations if your neighbor was cooking, cleaning, fighting laughing etc every night at 1:00am and waking people up it would be a huge problem.   \n\nIf you know you have a schedule that is not normal and you are keeping your neighbors from sleeping why not wear headphones?? Why purposely be an asshole?",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Lol an alarm is not unreasonable. Call the cops and watch them laugh in ur face bc your trying to noise complaint someones alarm. That’s apartment life",
          "id": 128,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Have you ever been a downstairs neighbor? Sounds carry in an apartment ridiculously easily. You think you are whispering but somehow the downstairs neighbor hears yelling. You think you're tiptoeing, but to the downstairs neighbor, it sounds like a bowling alley.\n\nIf you're a downstairs neighbor you have to accept that sounds will amplify no matter how careful the upstairs neighbors are. That's part of apartment living.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "This isn't a party, this is providing food for a baby.",
          "id": 130,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "LOL if she worked nights she would use an alarm. \n\nA basic alarm is not unreasonable noise. \n\nThe comments here hahahahahahaha",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Would you say the same thing to a shift worker getting up at 1am for work? What about running the shower? What about those people sleeping during the day can they demand everyone else shut up too? Point is, earplugs work just fine.",
          "id": 132,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2371,
      "content": "I had a premmie baby who was in the hospital for a few weeks post birth so I totally understand you stress. However… YTA. You mention that a vibrating alarm isn’t a possibility because you sleep so hard that you ‘slept through having a cannula put in’ so how do you expect to wake up to a crying baby when they come home? People who are literally deaf have alarms that wake them - how much research have you actually done into your options to best work for you and not rob your neighbour of sleep?\n\nAlso, would you have this same energy if you bring baby home and he starts doing stuff at 1am that woke said baby up, or would you expect him to try everything to stop that from happening?",
      "id": 133,
      "comments": [
        {
          "score": 782,
          "content": "I’m Hard of Hearing and cannot currently afford one of the nice alarms, but I sleep with my phone under my pillow and manage to both wake up to my alarm AND not wake up neighbors OR others in my home!",
          "id": 134,
          "comments": [
            {
              "score": 32,
              "content": "That’s impressive. I had to stop using my phone and get an electric alarm clock because I just slept straight through otherwise, and I don’t think I have any hearing problems",
              "id": 135,
              "comments": [
                {
                  "score": 16,
                  "content": "I also have a song for my alarm that has a sort of sireny sound at the beginning that is in the sweet spot of sounds I can hear loud and clear lol. So it goes under the pillow that my head is directly on top of and the SECOND it starts it startles me awake tbh since it’s right beside my ear",
                  "id": 136,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Ooh that’s a good idea. I tried a few different sounds but just gave up, I’m a sod for snoozing though too so now I have to get up out of bed to go turn it off it’s more effective",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "I'm sure there are way fancier ones out there but Amazon has cheap vibrating alarms for like $20. When I bought one for a friend years ago they were definitely more expensive, so I just wanted to ensure you knew there were cheap(er) ones available.\n\nhttps://www.amazon.com/Sleeper-Vibrating-Charger-Hearing-impaired-Display/dp/B08BCKHVG5/",
              "id": 138,
              "comments": [
                {
                  "score": 14,
                  "content": "I did not! I honestly last looked three years ago when I started using a hearing aid, but my landlord was refusing to replace my fire alarm and I was trying to work that one out because the good ones for HoH/Deaf people are pricey and I HAVE almost had fire issues. An extension cord caught fire, I didn’t hear the smoke detector, and only woke up because my cat continued to scream and head butt me until I did",
                  "id": 139,
                  "comments": [
                    {
                      "score": 9,
                      "content": "My kid who sleeps reallllllly deeply got one of the vibrating ones from Amazon bc she’s a diabetic and going off to college so she didn’t want any diabetes alarms disturbing her dorm roommate. It works well and wasn’t expensive.",
                      "id": 140,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 353,
          "content": ">You mention that a vibrating alarm isn’t a possibility because you sleep so hard that you ‘slept through having a cannula put in’ so how do you expect to wake up to a crying baby when they come home?\n\nTHIS!!! This is the thing I was thinking about!\nThere are plenty of ways to put an alarm that doesnt inconvinience the neighbor. OP simple doesnt want to do it.",
          "id": 141,
          "comments": [
            {
              "score": 21,
              "content": "The vibration is comparable to the cannula. A crying baby is not 🤣 the crying baby is comparable to the alarm. So if she wakes up for the alarm she’ll wake up for a crying baby 🤣",
              "id": 142,
              "comments": [
                {
                  "score": 10,
                  "content": "Not to mention that many parents develop a way to hear their kids crying or moving around, but can still sleep through a thunderstorm, for example. My mom could sleep like a rock most of the time, but if my sister was up just rolling around in her crib, that would wake her up. For clarity, my sister was born when I was 10, and our rooms shared a wall. My mom was further down the hall with the stairwell separating her from my sister's room. I have clear memories of being woken when my mom went in to see my sister, who wasn't crying or making a bunch of noise because that would have woken me (shared wall) but my mom heard her anyway. I think of it as \"parent ears\"",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 134,
          "content": "I also sleep through alarms and crying babies. But my husband doesn’t, so he would wake me up. Where is OP’s partner in all this?",
          "id": 144,
          "comments": [
            {
              "score": 23,
              "content": "I mean to be fair she may not have one. But I don’t buy the whole ‘I sleep so deeply that a nuclear bomb could go off and nary a sound would I hear’ rhetoric. My aforementioned baby went on to develop narcolepsy and he managed to find a way with vibrating watches and alternating alarms with lights and different kind of vibrations that get him up for work when I’m asleep, and that dude can sleep for 17 straight hours when unmedicated",
              "id": 145,
              "comments": [
                {
                  "score": 13,
                  "content": "I mean, I have slept through fire alarms. Luckily it wasn’t a real fire. But I was just thinking OP’s fiancé might not be like that.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "[deleted]",
              "id": 147,
              "comments": [
                {
                  "score": 12,
                  "content": "I was a super heavy sleep....until my baby was born. I slept through fire alarms, radio clock alarms, people you name it, I slept through it. \nNow days my kid, 4 rooms down touches their feet on the ground and I wake up....the baby honestly does change you. But I would be like OP, probably not many alarm options would wake me. Not to mention when I am stressed is am exhausted, so sleep deeper. I would assume right now OP is very stressed and it's likely she really doesn't wake up well yet.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I feel like I'm hallucinating. I'm also a hard sleeper. I also recently had a baby. Your hormones make you SUPER ATTUNED to every single noise your newborn makes, regardless of how hard a sleeper you are. I could absolutely see myself sleeping through a vibration only alarm but still manage to wake up for my baby.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Compare a vibrating alarm to a CRYING baby? You make no sense.",
          "id": 150,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "The vibration is comparable to the cannula. A crying baby is not 🤣 the crying baby is comparable to the alarm. So if she wakes up for the alarm she’ll wake up for a crying baby 🤣",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yeah my friend is deaf and as a kid he had a flashing light alarm, then flashing smart phone alarm and now he just has his watch vibrate. Over 20 years of being deaf and he used those alarms just fine.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2250,
      "content": "Baffled by these comments. Sorry downstairs neighbor, living in an apartment sometimes comes with noise. You have to feed your baby. If it wasn't the alarm it would be a crying infant waking him up, do all these commenter think he would reasonable to demand that that would stop as well? It's an alarm. It's annoying, but he can go back to sleep. Take care of your baby! NTA!!!",
      "id": 153,
      "comments": [
        {
          "score": 1260,
          "content": "I swear most of these people have never lived in an apartment, never had kids, and never moved out of mom’s basement lol",
          "id": 154,
          "comments": [
            {
              "score": 730,
              "content": "Most people's neighbors dont rip out the carpets, floorboards and furniture. ALL soundproofing\n\nIts like you folks don't read",
              "id": 155,
              "comments": [
                {
                  "score": 852,
                  "content": "The neighbor complained about the toilet flushing at night when there was furniture. You haven’t read all her comments.",
                  "id": 156,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 276,
                  "content": "Carpet, floorboards, and furniture isn’t really soundproofing lol. Go stand in your basement and I guarantee you can hear what’s going on upstairs with no problem. \n\nSoundproofing comes from insulating walls/floors, and sound attenuation blankets/panels behind the drywall. Sound dampening drywall also helps slightly. \n\nBut ultimately the soundproofing needs to happen within the assembly itself. Your carpet and laminate flooring don’t do a whole lot for sound",
                  "id": 157,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Then rip it all up and stand in your basement, I bet you'll hear it all a lot more clearly.\n\nNobody is saying it nullifies all noise. They're saying it acts as soundproofing and definitely does help mitigate and disperse sound.\n\nThe difference in sound in a bathroom between when towels are on a rack and when they aren't should make that obvious enough.",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Tell me you have no idea about how sound develops in a naked room without telling me.\n\nPutting carpets in a room  and anything that \"swallows\" sound like heavy curtains will reduce the noise level  a LOT. A naked room produces a ridiculous  amount of echo which amplifies everything.   \nEven ripping a fart in a naked room gets to the noise level of firecrackers",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Exactly! I can hear my yorkie jumping from the couch to the floor and I can hear her walking on the floor with her tiny paws. There’s plenty of flooring companies who could install something like Sherwin Williams’ whisper walk and even that doesn’t add a lot of “sound proofing”. We have it at the office and I can easily hear the person on the floor above my office. And the landlord/owner would be in charge of deciding if there would be soundproofing or not.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "If your soundproofing relied on those things, your building's fucked or the neighbor has really sensitive ears.\n\nIt's the landlord's fault for being so cheap. I don't hear my neighbors at all, ever. And the floors aren't carpet",
                  "id": 161,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Look, dude, I've dealt with an actual noise complaint. I live next to a guy who blasts his speakers and throws ragers sometimes every single night of the week. He shakes our house. We've called the cops, we've negotiated face to face, we've even moved his setup around trying to at least mitigate it since he won't grow the fuck up. Now the only solution left is for me to sound proof my fucking house. If this guy can't keep it together over toilets flushing and people walking around (did you see the comment where he'll bang on the ceiling and scream bloody murder when they walk around at night? Like THAT'S not a public disturbance to his other neighbors) then he's just not built to live around other people. He can't cope with living in an apartment. He's unreasonable.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I've lived in many different apartments, none of which had carpet. Sometimes it just sucks to live in apartments but that's life.",
                  "id": 163,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I lived in a flat for decades. Never once did i expect anyone to alter their sleep pattern because of a lifestyle choice i made. People have kids and forget the rest of the world doesnt care or deserve to suffer along with you. The self entitlement is insane.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Right? My neighbors snoring would wake up my babies/toddlers, who would then keep me awake for the next few hours, but I never once demanded that they purchase a sleep machine or wear medical devices to cease their nighttime bear imitations.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 573,
          "content": "I feel this sub is getting more and more woman hating lately. I remember a time when everyone would be preaching from the roof that “you choose to live in an apartment, deal with the noise!!” \n\nNow they’re all hating on a new mom who has a 2 minute alarm at night to feed her child who is so small and frail.\n\nFuck this site",
          "id": 166,
          "comments": [
            {
              "score": 17,
              "content": "There are times when you realize that reddit is 80% male and most of those are under 30. This is definitely one of those times",
              "id": 167,
              "comments": [
                {
                  "score": 11,
                  "content": "Seriously, makes me wish we could see the demographics of the comment section.",
                  "id": 168,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "People don’t understand how hard breast pumping is also. Which isn’t helping. Idiots think your tits are like water balloons filled with endless supply of milk ready to empty on your schedule.\n\nI read a story once in one of the mom subreddits where someone’s as was upset she took 3 15 minute pump breaks and asked why she couldn’t just pump all her milk 45 minutes straight on her lunch break.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Reddit can also get pretty anti-parent/anti-children at times, some of the comments here have that flavor.",
              "id": 170,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Its peak reddit. People are very on the childfree vibe on this site and many havent actually rented their own place yet",
              "id": 171,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I kind of feel like all the reasonable people left in the great exodus after the api bullshit.\n\nI've seen a lot of threads lately where the responses are utterly baffling. Thank you for making me feel a little less insane here.",
              "id": 172,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 427,
          "content": "No I scrolled way too far down for this. seriously, its like everyone has gone crazy, she is trying to take care of her premature baby the best she can and this is what works. Her neighbor is in for a hell of a surprise when a whole newborn is upstairs and sometimes won't settle. Earplugs, maybe a sleep aid?",
          "id": 173,
          "comments": [
            {
              "score": 228,
              "content": "NTA, I am going to start with what OP added in a comment, her neighbor filed a noise complaint just for her using the bathroom in the middle of the night, the neighbor also told her it doesn't matter if she has her alarm on vibrate he still would wake up. Fuck that, sounds like he needs to see a doctor if he is that easily aroused, because when she has a whole baby at home he isn't going to sleep either, people also say he has rights but I mean he also chose to live in a apartment which I lived in a few and they all sucked as far as noise. I am also guessing OP is working on the flea thing because who wants to leave their floors ripped up and a mess with a baby coming home?. OP there are not a ton of us but you are NTA, I hope your baby is doing okay!",
              "id": 174,
              "comments": [
                {
                  "score": 12,
                  "content": "yeah, neighbor needs to see a sleep specialist, or try some sleep aids or meditation or something.  his inability to sleep is not her problem.",
                  "id": 175,
                  "comments": [
                    {
                      "score": 12,
                      "content": "It isn't! maybe its because I am also pregnant that this pissed me off but if he is having that much of a fit, maybe find another place to live or rent a house so you don't have neighbors",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 331,
          "content": "Me too! And I’m almost always on team “the world doesn’t revolve around you just because you had a kid.” If she’s hitting snooze for an hour then yeah that’s an asshole move, but just using an alarm in your own home is not. And what happens when the baby comes home? Do they need to not bring her home until she’s sleeping through the night out of courtesy to the neighbor? No, sorry downstairs neighbor but these are the woes of apartment living. Get some earplugs if you’re a light sleeper.",
          "id": 177,
          "comments": [
            {
              "score": 103,
              "content": "Right? My upstairs neighbors are SO LOUD. I have earplugs *and* a white noise machine. I feel so lucky that when the tables turned and I had my newborn (and, yes, alarms to remind me to get up becaue newborns must be fed every two hours, even overnight) they didn't say a thing. It's almost like living in your own home making normal living noises is reasonable.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "What kills me is she GAVE him earplugs. That alone seems hella courteous imo. And no one is seeming to get that she will likely STILL have this alarm going when she brings home her baby, as every hospital tells you that you may have to wake your baby every 2-3 hours if they don't wake on their own. Yes, she could find a solution like dampening noise with a towel or trying a quieter alarm, but people saying she can drop that 1am alarm no problem have no idea how breastfeeding and maintaining supply works.\n\nPeople also seem to be glossing over the fact that her \"rude\" response was because he wouldn't budge on the alarm. Imo, it's absolutely ridiculous that her neighbor, after learning what her alarm is for, wouldn't just drop it and find a solution that works for him. I'd be pretty pissed, too, if I was trying to feed my baby and my neighbor was basically like 'sucks, knock it off, it's impacting my sleep'. Sorry folks, that's what it's like when you live in an apartment, you often hear loud noises that you can't do much about. Bet people wouldn't be frothing at the mouth if OP was waking up for her night shift smh.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 274,
          "content": "FINALLY! Reddit acts like the existence of children is a personal attack on their comfort. The individualism constantly exhibited here is callous and jarring. I just tell myself it must be a middle class white american thing.",
          "id": 180,
          "comments": [
            {
              "score": 49,
              "content": "Yep. There's an awful lot of 'you don't owe anyone anything ever' on here. But the question isn't 'do I have the right to do this?' , it's 'am I the asshole'. You can be 1000% in your rights to do whatever you want,  but you can still be a huge asshole. In this case, the neighbour has the right to complain about something being done for the sake of a premature baby - but he's still an asshole for doing it.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "I'm a middle class white American who doesn't even particularly like kids, and I am so shocked and disgusted by the YTA replies. Holy shit, this woman is going through hell, her preemie baby is in the NICU. She's just trying to feed and take care of her seriously compromised child. Have some fucking empathy and sense of community, people. Her neighbor is a dick.",
              "id": 182,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "100%. Hyper-individualism is the most western American bullshit ever. Zero sense of community or empathy. And these sorts of people are often outwardly hateful towards children, as though they weren’t also kids at one point?? Weird weird behavior.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 195,
          "content": "I’m shocked by all the votes calling OP TA! Her neighbor needed to invest in ear plugs or find a detached home to live in if they are so bothered by the normal noise of living in an apartment. I’m am disgusted by the lack of empathy for a new mother. Not at all surprised but definitely disgusted. NTA",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 195,
          "content": "Exactly! This is an apartment building it’s not realistic to expect your neighbors to care about your sleep habits. These comments are delusional",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 167,
          "content": "Yeah I had to scroll too far for this reasonable response. If the downstairs neighbor can hear something as common place as an alarm go off, he needs to complain about the soundproofing to his landlord. This isn’t OPs fault. Lots of people have empty apartments with hardwood floors (minimalist decorating or maybe folks who can’t afford furniture). She has a right to furnish her apartment however she wants. She has a right to wake up with an alarm whenever she wants. OP isn’t blasting music or practicing her tap dancing at 1 pm. She isn’t doing anything wrong. Neighbor can buy earplugs. \n\nNTA.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 149,
          "content": "[deleted]",
          "id": 187,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 137,
          "content": "I´m also baffled. I lived in an apartment where the downstairs neighbors had two babies in the course of the lease (2 years). Not even once I mentioned to them the numerous times I was awoken with their babies crying.\n\nOP is definitely NTA, she can be nicer with the neighbor by changing alarm/placing under the pillow. But the neighbor is completely TA by requesting zero alarms in the middle of the night for someone who's nursing.\n\nOP - get a recording of your baby crying, and use that as your alarm at double the volume :D",
          "id": 188,
          "comments": [
            {
              "score": 6,
              "content": "best solution 😂",
              "id": 189,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2122,
      "content": "YTA. It is very sad what is happening with your baby, but it does not have to be anyone's problem. The guy was more than decent to come talk to you in a civil way but you, as an entitled parent, feel like the world revolves around you and your kid's needs. Guess what? It does not. What you do/don't do with your boobs and milk should not disturb other people's sleep. \n\nThe next step would be for him to report you, good luck explaining the milky story to the bulding's administrator.",
      "id": 190,
      "comments": [
        {
          "score": 1382,
          "content": "Nope\n\nIf the alarm can be heard so loudly through the ceiling, then there is a problem with the building structure the buildings administrator can look at \n\nop is entitled to set an alarm clock at any time of the day or night. Whether she then works shifts, wants to watch the sunrise on the beach or bats foraging for food is irrelevant. \n\nAs long as op doesn't practice tap dancing after the alarm clock but only produces normal living noises at room volume, that's part of life in apartment buildings. (I would recommend putting the alarm clock on a pillow so that the sound is not transported so strongly over the floor)",
          "id": 191,
          "comments": [
            {
              "score": 1169,
              "content": "Have you ever entered an empty room? When you have no rugs, no furniture, well, an empty room, there is an echo and any noise is amplyfied. This may be the reason why the person downstairs can hear it so clearly. Of course anyone can set alarms in their own appartment but OP is still an ahole for her response. She basically said \"fuck your sleep, I and my kid are more important\"",
              "id": 192,
              "comments": [
                {
                  "score": 36,
                  "content": "OP said she ripped up carpets too",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 465,
              "content": "Neighbour probably couldn't hear it until she started sleeping on the phone and presumably putting her phone on the floor too. She's got an alarm on his ceiling going off.",
              "id": 194,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 368,
              "content": "OP haliterallys  ripped out all of the installed sound dampening. That's on OP, not building management.",
              "id": 195,
              "comments": [
                {
                  "score": 8,
                  "content": "She lives in an apartment. Probably the building replacing carpet.",
                  "id": 196,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 141,
              "content": "Exactly, my god. These apartment buildings suck. I’ve been in some where you can hear every footstep, where people walking up the stairs damn near shook my room. It’s the nature of the beast, you’re living with other people like that because it’s what you can afford so you truly have to deal. People trying to bring noise ordinance into it are going to be pretty sore when they try that crap and realize how off base they are.",
              "id": 197,
              "comments": [
                {
                  "score": 209,
                  "content": "Now imagine those appartments but ten times worse because all the installed sound dampening was torn out. That's what OPs neighbor is dealing with",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "He shouldn’t be in a lower unit if he’s so damn sensitive that  he files noise complaint over a toilet flushing.",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 86,
              "content": "The alarm can be heard because OP ripped out her carpet because she made the apartment a biohazard by not cleaning after her cat.",
              "id": 200,
              "comments": [
                {
                  "score": 24,
                  "content": "Where did you see the part about a cat?",
                  "id": 201,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I'm also wondering that, I didn't see anything about a cat.",
                      "id": 202,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "I would fuck your shit up with constant inconveniences just as you have done to me.\n\nLooking for a daytime nap after waking up to random alarms all night long? Too bad, time for band practice.",
              "id": 203,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 260,
          "content": "So nobody in a rental is allowed to wake up before 5am? An Alarm is a normal use of an appartement.",
          "id": 204,
          "comments": [
            {
              "score": 17,
              "content": "I can’t hear any of my neighbours alarms and I assume they can’t hear mine. \nIt’s not normal.\nWe have alarms going off from 4.20am so they’d have complained at some point if they could hear it.",
              "id": 205,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Her alarm is going off three times each night in an apartment with no sound dampening, *in addition* to whatever alarms OP and her partner have set to wake up in the morning.  That's not \"normal use.\"",
              "id": 206,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "One alarm normal, not multiple times (3) during the night.\n\nThat is not normal use of an apartment.",
              "id": 207,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1147,
      "content": "Your prolactin levels are highest at night and the morning throughout the duration of breastfeeding/pumping. Not overnight and limited to baby’s needs for the first six weeks. \n\nYTA - put your phone alarm on vibrate and keep it close to your body. Get a rug - conjoined living is miserable with a noisy neighbor. Just wait until your neighbors, landscapers, UPS etc., wakes your baby. You’ll love it.",
      "id": 208,
      "comments": [
        {
          "score": 288,
          "content": "This. Like if it’s so important have a quiet alarm and get up as soon as it goes off. People have a right to not be woken up by neighbors. That’s why there are laws about noise and you can call the cops with a noise complaint.",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 251,
          "content": "You're wrong about prolactin levels and she is right. Especially in the weeks right after birth it's super important to express in the middle of the night. I couldn't drop the night pump until 2 months pp. She has to build the supply until it regulates.",
          "id": 210,
          "comments": [
            {
              "score": 106,
              "content": "*especially* when her preemie baby is in the hospital and not there suckling to stimulate production. These comments are infuriating.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 75,
              "content": "...also OP should go with what her DOCTORS HAVE TOLD HER rather than a random redditor telling her she's wrong",
              "id": 212,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Your prolactin levels are actually highest around 2-3 AM…..\n\nI work in the NICU and we specifically tell moms NOT to skip the middle of the night pump because it can affect their milk supply. So there’s that. She should be pumping overnight.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Have you even breastfed??! You need to empty your breasts every couple of hours because that can lead to issues developing like mastitis and a loss of milk production over time if you’re going over longer periods of time without doing so. The more you pump/breastfeed, the better it generally is. When my kid was born, they were feeding every 45 minutes to 2 hours and it’s crucial to keep a steady routine going for continuing milk production.",
          "id": 214,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I mean that's cute in theory. I am sure all the other people here with no baby experience might find that statement compelling but that has zero to do with the established medical advice to feed/pump every 2-3 hours and not to skip overnight until baby reaches a certain weight.",
          "id": 215,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 677,
      "content": "I'm afraid of what will happen when baby will be back home and crying...",
      "id": 216,
      "comments": [
        {
          "score": 316,
          "content": "Yeah, that’s what I was thinking.\n\nIt’s an alarm going off once and being shut off. NTA. This neighbor is going to have a rough time when baby comes home and is crying in the middle of the night - he’ll be begging to have the alarm back.\n\nHe can get ear plugs, a white noise machine, a fan, or sound isolating headphones if he’s so sensitive. But hearing noise around you is part of apartment living, and yeah that might include noise at off hours. It’s not like she’s having a party.",
          "id": 217,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "This is why I'm kinda amazed at the amount of YTA responses. I think this guy is overly sensitive to sound, especially with the bathroom flushing noise complaint part. Sooooo to me it's the guy who fucked up by thinking getting a place with an upstairs neighbor was a good idea while having sensitive ears/sleep. \n\nI have lived in many many complexes, and I dont' think I've ever lived in one where I didn't hear my upstairs neighbor at least ONCE while living there. Where I live now my upstairs neighbor has a dog, I can hear the nails on the floor clacking sometimes of her dog. Can also hear them laugh happily through the vents sometimes, and that's just the life of living stacked on top of each other. \n\nIt's one thing to purposely be an ass to a neighbor with noise, but this isn't it.",
          "id": 218,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 663,
      "content": "Fleas don't live in mattresses, if you treated your cats like you claim then you threw stuff out for no reason. Fleas can't live without a host, get your cats treated.",
      "id": 219,
      "comments": [
        {
          "score": 376,
          "content": "Partly right, partly wrong. The adults need a host but the eggs and larva live in any crevice and whatever treatment they're using cant be used on fabric apparently",
          "id": 220,
          "comments": [
            {
              "score": 99,
              "content": "Yeah you don't treat the house you treat the hosts. People speculate eggs can go dormant in harsh cold, but its never actually been observed scientifically and mentioned anecdotally. Also being in a heated home will make that next to impossible. The eggs will hatch, the larvae will grow and require a host, without one they die and its over.",
              "id": 221,
              "comments": [
                {
                  "score": 125,
                  "content": "If the infestation is bad enough you can also treat the house",
                  "id": 222,
                  "comments": [
                    {
                      "score": 15,
                      "content": "You are correct. And I know someone whose living space got fleas *without having pets*. They can in fact infest your carpets.",
                      "id": 223,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "It doesnt even need to be bad. My dog got flees and they got into my cpuch and carpet. I gave my dog a flee bath a d used some spray on vouch andcarpet and literally was 100% better the next day.",
                      "id": 224,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 96,
                  "content": "[deleted]",
                  "id": 225,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Diatomaceous earth is not safe in confined environments.",
                      "id": 226,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "They live in and reproduce in dust...removing soft surfaces doesn't get rid of them. Vacuuming several times a day and treating animals is the best way to get rid of them.",
              "id": 227,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Which is a bunch of BS. You do not need to remove all soft furnishings to treat for fleas.",
              "id": 228,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 643,
      "content": "NTA\n\nIf this is what doctors suggested you do, keep doing it. Your baby is much more important.\n\nAlso i can't even fathom how your neighbor will react when you bring home your very screaming newborn.\n\nYou can do it!",
      "id": 229,
      "comments": [
        {
          "score": 315,
          "content": "Yeah this. I can't believe all the YTA votes. Let the neighbour get earplugs. It's an alarm. She's not playing Gabba at full blast. And I say this as a light sleeper who has slept with earplugs for years",
          "id": 230,
          "comments": [
            {
              "score": 6,
              "content": "The YTA votes are the same people that would react. likeOP's neighbour would.\n\nCompassion and understanding is non-existent for some people.  \n\n\nI've tried to empathise to both parties... and I'll tell you. - the child in NICU is more important than restless days for a month or tow.",
              "id": 231,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "All these people acting like an alarm going of is an airhorn in the neighbors ear. 'He has the right to a peaceful home'. Okay? OP can also use her home how she wants as well? She tried the vibrating alarm (which I use), but it doesn't work for her. He's living in a place with shared walls, so he can't control when other people need to come and go, when they need to wake up for work, or use the bathroom. If he can't handle living where he has to hear other people at night, then that's something that he will have to figure out. \n\nHer baby is her priority and she's doing what she was probably told to. His sleep is his priority and his problem to figure out. The carpet will be back soon, so the supposed magic noise cancelation that is going to help him sleep like a fairytale princess through the night will be back in place. Everyone is rightfully worried about his sleep deprivation, but his inability to go back to sleep is really not something she needs to dance around either. OP is also losing sleep, and she tried to give him a heads up and headphones to cancel the noise. That's 1000% more consideration than I would have given my neighbors if I was going through the same thing as OP. They wouldn't even be on my radar. I've lived with noisy neighbors in the past; I wouldn't even consider her nighttime routine a minor distrubance comparatively. \n\nI also can't get over the fact that he is trying to dictate her lactation. That conversation would have ended before it began if it were me.",
          "id": 232,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "NTA, what if she had to get up for work at 1am like many people do. The neighbor can get his own house or wear ear plugs.",
          "id": 233,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}