{
  "post content": "The title sounds so ridiculous I cannot believe I'm writing this.\n\nMy baby turned one last week, so we planned a little party for him last weekend. We were supposed to have only one party with both sides of the family, but my sister-in-law and her husband live far away (they have not meet our baby yet, the last time we saw them was before the plague), and they postponed their visit for a week, so we had a party with my side of the family (my mom, my two siblings and their partners) last week, and another party yesterday, with my husband's side (his mom, my SiL and her husband).\n\nAs you can see, it was 2 very small gatherings. Basically, both times, we did the same thing : a meal, a cake, they gave gifts to the baby, fawned over him, took 1 billion pictures and videos, and we chatted while the baby napped for half of the party. \n\nI'm breastfeeding so I don't drink any alcohol, and my husband doesn't like alcohol much, so he stopped along with me. We didn't even think about buying alcohol for the parties (because the last time we've bought alcohol was like... 2 years ago, lol)\n\nI thought the party with my family-in-law went well and everyone was happy, until I received a text from my MiL this morning, asking me why I didn't serve alcohol, and that it was poor taste to neglect my guests. It seems my SiL is very upset because of me, because she thinks I was cheap when they came all the way to see us and bring gifts for our baby.\nTo be clear, my husband was the one who planned the second party, and he bought sodas and juices because that's what he wanted to buy, I don't know why I'm being blamed.\n\nThe thing is, not serving alcohol for a party IS rare and kinda weird here, but my family didn't say anything about it, so we just went with the same plan for the second party..\n\nAnd before anyone says anything about my husband, he called his mom and asked what the hell was going on, and said if they're not happy with our way of hosting, they don't have to come next time.\n\nI guess I'm asking if we are the a**hole because it seems extreme to not have them over again for such a small issue, we can just buy alcohol next time.\n\nEDIT : There are a lot more comments than what I thought, thank you all for your judgement for such a small issue.\n\nTo answer the most frequent questions : we're French, they were expecting wine with the meal and champagne with the cake, and it was lunch and the afternoon after that, they left around 6PM.\n\nHusband is still super mad at them, but as far as I'm concerned, the issue is solved. Next time, we'll say in advance we don't have alcohol and if they want to drink, they can bring their own bottle(s). Thank you to all of you who suggested that.",
  "id": 1,
  "comments": [
    {
      "score": 8738,
      "content": "You have a problem with alcohol if you are mad it wasn't served at a 1 year olds birthday party.  NTA.  If the guest of honor can't drink, then alcohol isn't appropriate.",
      "id": 2,
      "comments": [
        {
          "score": 2575,
          "content": "I knew they like wines, but we just didn't think it'd be a problem. Actually, we just didn't think about wine at all.",
          "id": 3,
          "comments": [
            {
              "score": 1522,
              "content": "It shouldn't be a problem. You are NTA. They should care about the little one, and not whether there is Wine or not.",
              "id": 4,
              "comments": [
                {
                  "score": 583,
                  "content": "You know? it’s a bday for their grandchild and all they care about was their buzz. Tell me you’re an alcoholic without tell me you’re an alcoholic. NTA",
                  "id": 5,
                  "comments": [
                    {
                      "score": 250,
                      "content": "A true alcy would have brought their own shit. Either way, these people are booze gremlins looking for a free glug. From a life long alcoholic and drug abuser, NTA×1000",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I’m sober, and back when I was drinking I wouldn’t even have the Gaul to bring up the absence of alcohol someplace",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Yup. Drinking problem ahoy, I’m afraid.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 154,
                  "content": "Oh there was whine all right.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 12,
                      "content": "OMG!  This is priceless, and I must admit that I am going to steal the first chance I get!!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "Especially if they are traveling far. It would be more inappropriate for them to he drinking and traveling.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "[removed]",
                  "id": 12,
                  "comments": [
                    {
                      "score": 8,
                      "content": "[removed]",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "u/Electrzxfgsdd is a bot. It's a perfect example of why we should all downvote \"i agree\" ppsts that add nothing: because now they're making bots that post literally that on 6 different threads and get upvotes.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 633,
              "content": "Who shows up to a party empty handed for the host? Sweet Jesus. I love wine. I love wine so much I am not chancing my palate on crappy 2 buck chuck. If I want to drink wine at a party, I bring wine to a party. If I want to drink beer at a party I bring beer to a party, unless the host specifically says....we got the alcohol and drinks.",
              "id": 15,
              "comments": [
                {
                  "score": 420,
                  "content": "Came here to say this! If it’s so important to have alcohol, bring a couple bottles of wine, a case of beer or hard seltzer, or make a quick run to the store. Or suck it up. Yeesh.\n\nBut under zero circumstances is it appropriate to get upset with the hosts…of a 1 year old’s birthday party. And I love the added misogyny of the in-laws upset with the wife. Talk to the husband, your family member, if you have an issue.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 63,
                      "content": "Exactly! The hosts throw the party they want. Whenever I'm going to a party or gathering, I always call beforehand to ask if the host needs me to grab anything on the way. That usually gives me a good idea of what they have.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 50,
                      "content": "That's where my head was at. They are freaking family. If alcohol was so important they could shoot to the store to buy some or have their sibling jump in the car with them.\n\nI don't drink. I have one brother that does, and one that does on occasion. If they were coming over, they would bring their own, ask for directions to the liquor store, or ask in advance.\n\nAnd having MIL reach out because they were too precious just makes me steam at the injustice of bringing in other family into your spat.\n\nNTA",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "[removed]",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 23,
                      "content": "I feel like this is some bible belt shit",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "Dude I honestly think it's bad form to be pissed about the host not having anything.  You're going to *their* house.  They are inviting you in to partake of what they have.  If you wish to partake of something they aren't offering, bring your own.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "You don’t get to do that without the permission of the host though.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Bonus misogyny is my favorite. /s",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "> And I love the added misogyny of the in-laws upset with the wife.\n\noh my god, excellent point. i missed that.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "Exactly. As someone Childfree I won’t lie, a glass of wine or a beer would make a baby’s birthday party way more fun for me lol. But it’s not a dealbreaker and I certainly wouldn’t bash the host over the choice. \n\nAnd before anyone comes for me, I like older kids fine. I’ve been a teacher for almost twenty years. I’m just not a fan of babies.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 16,
                      "content": "We just had our child’s second birthday and served mimosas and Bloody Mary because it was at like 11am and we had a mix of parents, kids, and childless family/friends. But I wouldn’t ever expect it at someone else’s or get upset if they didn’t serve alcohol.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Sweet Jesus, rather canonically, solved the lack of alcohol at a party on his own.\n\nShame that OP’s SIL couldn’t take a page out of His playbook.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 10,
                      "content": "He was probably remembering the crappy gifts he got at his own birthday party.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "[removed]",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -1,
                  "content": "You bring alcohol to parties without checking if it's okay with your hosts?",
                  "id": 30,
                  "comments": [
                    {
                      "score": 8,
                      "content": "It’s very normal here to bring a bottle of wine as a gift when you go to someone’s house for dinner or what have you.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Yes why would you need to ask?",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 234,
              "content": "As someone who does like drinking at events if it’s there …. I’ll never understand why people get so upset when it’s not there? \n\nWould I have a drink if it was there, sure\nDo I care if it’s not an option? No \n\nWho needs to get drunk at a 1 year olds birthday anyway?\n\nYou’re definitely NTA. People are weird and too reliant on alcohol.",
              "id": 33,
              "comments": [
                {
                  "score": 118,
                  "content": "Seriously. Kids can be a pain/stressful but if you can't get through a one-year-old's birthday party without a drink...you have issues",
                  "id": 34,
                  "comments": [
                    {
                      "score": 47,
                      "content": "Truly. Alcoholism does not necessarily present like a perpetually wasted person missing work and falling all over the place making an ass of themselves. \n\nIt presents in subtle ways. Like being fixated enough on alcohol to not only be frustrated there is none at a one year old’s birthday party… but to *reach out to the host* and complain about it. \n\nI would bet good money that MIL / SIL or one of their spouses has an alcohol problem. \n\nIf it really was that big a deal in a traditional sense, your husband would have thought of it. And even if he should have… your MIL should be texting *him* to ask what’s going on, not texting *you* to insult you over it.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "Also…it’s not a wedding where it’s like - boring ceremony and then 4+ hours of speeches and dancing and waiting in line for dinner with a bunch of people you don’t know. \n\nIt’s a 1st birthday. 1-2 hours tops. And you already know everyone.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yes! If they can’t stay dry for a couple of hours for a one year old’s birthday party, there are bigger problems at hand than their skewed perception of OP’s hospitality. Very glad to know that DH has a shiny spine!",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Absolutely!",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 109,
              "content": "In my country I never heard of anyone having alcohol in a childs party. And in my family there are some heavy drinkers, but never in a kids party. NTA",
              "id": 39,
              "comments": [
                {
                  "score": 32,
                  "content": "A 1st birthday party is more for the adults than the kid. But, still no obligation to have alcohol. NTA",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "I’ve been to 1st birthday parties with alcohol and drank. I won’t be at all bothered if one had no alcohol though.",
                  "id": 41,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "We had some basic beers and like wine coolers at my son's birthdays including his first. But his birthdays during the summer and its very family barbecueish because of that. Nobody is getting sloshed but rather have a drink or two while grilling or splashing around with the kids are going through a sprinkler.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "We’re Latinos and there was always alcohol growing up. Now, not so much. The drinking has gone way down.  It yeah I got my first sips of beer from tios at kids parties.",
                  "id": 43,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "In my country, we have the kid birthday party. And when it’s over, and everything has calmed down, the adults have a drink.",
                  "id": 44,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "I made margarita cupcakes for my kid's 5th birthday party, which was in 2020. He didn't like cupcakes (he had oreos), and it was just my immediate family and my husband's parents attending. \n\nI admit I kinda forgot my baby brother was still in high school but honestly I'm sure he had more alcohol on a regular basis than the tiny amount of tequila in the cupcakes. Even if he had 4 of them. \n\nWe didn't have any alcohol to drink, though.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I'm pretty sure cooking alcohol means the flavor stays but the actual alcohol content goes way down.",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": "[deleted]",
              "id": 47,
              "comments": [
                {
                  "score": 3,
                  "content": "This is what I was coming to say. It's like going to a party at a vegetarian's house and being upset that there's no steak. If they served nothing (no food, no drinks) that would be inappropriate. But there was food, there was drink. There was nothing to complain about. Even if the hosts did drink alcohol, they don't need to serve it at every function ever. (I know they're not against alcohol, but it's obviously not a part of their lives right now.) I don't really like chocolate cake, but if I go to a party I don't throw a fit because the cake isn't my favourite kind. NTA",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 43,
              "content": "Did you talk to your SIL? Because there's a huge difference between, \"I thought wine was going to be served\" and actually being upset about it.",
              "id": 49,
              "comments": [
                {
                  "score": 17,
                  "content": "Right? And the MIL should have defaulted to asking why the lack of alcohol was such a big deal to SIL rather than make an issue of it.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Another option is MIL is trying to hide her own alcoholism/avoid OPs ire by blaming SIL (SIL didnt say anything in the first place)",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "NTA. It's a child party. No need of alcohol on a baby party. If people complain about it , then they have a serious problem.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "It’s absolutely bizarre to want booze at a babies birthday party",
              "id": 53,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "When we had a big 1st birthday party for our daughter, I didn't even think about serving alcohol because it was party for a child not an adult.",
              "id": 54,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Nta they could have thought to bring their own. It just seems like if that was something they cared about, they would have asked if they should bring some. They sound pretty self centered. Why on earth would they assume that the woman that is breast feeding and their brother that doesn't even like alcohol much, would host a party with alcohol. They're adults with children, they should know better. I am more mad that mil had the disrespect and malicious mindset to call you and complain and not your husband. And your sil didn't even say anything. Just whined to mommy. I'd have to talk to my husband about his family's bad behavior because that can't happen again. It's manipulative, unnecessary and disrespectful",
              "id": 55,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 71,
          "content": "Really. I don't see anything wrong with that. It's strange that the lack of alcohol has become such a problem.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "Adding that this “party” was a grand total of 6 people (OP, OP’s husband, baby, MIL, SIL, SIL’s spouse) makes it even more absurd…",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "I'm trying to recover from alcohol and before I made this decision, I was invited to one of my best friends baby shower. I didn't go because I figured there wouldn't be alcohol, and I didn't want to drive that far if I wasn't going to drink. \n\nI'm an asshole for that.\n\n But I realize it's my addiction, and had I gone it would have been fine. It's a tough addiction, and most people don't realize they have it. I feel sorry for the SIL getting this upset over a 1 year birthday party that wasn't booze filled. She has some work to do on herself, just as we all do.",
          "id": 58,
          "comments": [
            {
              "score": 22,
              "content": "Congratulations and well done on your sobriety. It's not an easy thing to conquer. I wish u well for a sober future.",
              "id": 59,
              "comments": [
                {
                  "score": 17,
                  "content": "Thank you. Wish I could say I'm AF, but it's so hard. Going from 12 beers/day and 3 handles of whiskey/week didn't mean I can't stop, but oh, how hard it is. I've curbed my bingeing, and I've gotten to 2-3 beers a day, no liquor.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 13,
                      "content": "That's an amazing achievement. Don't doubt yourself and just take one day at a time. If u have a bad day start again fresh the next day. Above all else don't put pressure on yourself. It takes approx  6 weeks to break a habbit not to mention the physical withdrawal you will be going through. I can't imagine how hard that must be but it will be so worth it when you come out the other side. Don't give up u got this  !!!",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "You can do this. I was drinking a fifth and a half of vodka daily when I finally quit 16 years ago. Keep on trying!",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Hey! Harm reduction counts.\n\nBaby steps ARE STEPS.\n\nAnd if you dont celebrate the wins youre having you wont have as much motivation to keep going. So be proud of the change you have, and work towards your goal.\n\nYoure doing it. It counts. 💗",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "That's really good! You often can't go cold turkey with alcohol anyway because of the physical addiction and how dangerous withdrawal can be so cutting down so much is still massive even if you're technically still drinking. You'll get there!",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Are you doing [SMART](https://www.smartrecovery.org/about-us/?gclid=CjwKCAjwo7iiBhAEEiwAsIxQESPwFRAtN7A8soXzWM5d_XGwocBFXPEfhJ8nyioY2PY8V4p2K3aoyxoCp04QAvD_BwE) recovery? It's an alternative to AA that supports reduction and developing healthier coping skills, as opposed to the \"abstinence or you're a failure\" model.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "“If the guest of honor can’t drink, then alcohol isn’t appropriate.”\n\nI love this line and it’s perfect!\n\nOP you’re NTA. My husband and I both liked beer and wine every once in a while and drank socially. We haven’t served alcohol at any of my sons 4 birthday parties and don’t plan to start, because it shouldn’t be a necessity to enjoy a CHILD’S party.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Right!! Was the one year old supposed to give a toast?? Totally NTA, MIL is though, for expecting alcohol at a children’s birthday party!!",
          "id": 67,
          "comments": [
            {
              "score": 1,
              "content": "I was gonna say… I mean as long as you made sure the birthday boy had a birthday shot, you’re NTA! /s \n\nLike wtf???",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I don't think it should ever be expected at a children's birthday party.\n\nHowever we have tons of wedding posts where the couple don't/can't drink & everyone says they're AHs for having a dry wedding so that's not always true.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "It’s an adults’ party, not a children’s party. The kid didn’t throw it and invite his friends. It’s totally appropriate to serve alcohol.",
          "id": 70,
          "comments": [
            {
              "score": 8,
              "content": "I agree - it's a family gathering at someone's house , alcohol is pretty standard. The age of the birthday person is irrelevant.\n\nI went to 7 year olds birthday just today and yep, there were beers and wine.\n\nAnd nope, no one got absolutely trashed.\n\nKids played, adults chatted with drinks.\n\nIt's not inappropriate at all!",
              "id": 71,
              "comments": [
                {
                  "score": 5,
                  "content": "Neither OP or husband drink, so it'd actually be abnormal for them to have alcohol on hand at their house. Expecting family to provide you free booze is inappropriate.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yup. There’s two points being made/debated in this thread and it seems they’re very often being confused with each other:\n1. Is it appropriate to have drinks at a kids party/this specific situation?\n2. Was OP obligated to provide them?\n\nThe answer to 2 is obviously no. I personally think the answer to 1 is yes but in the end it’s up to the hosts (who seem to not really care one way or the other).",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Right? Plus like the kid is one, they don’t know what is going on. This party is for adults and in a lot of cultures it is the job of the host to provide for their guests especially at an event where they are receiving gifts. To not do so just seems cheap af imo",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "This is exactly the comment I was hoping to see. Also why would you want to serve alcohol to people who are going to want to hold your baby? What if they consumed too much and there was an accident? Makes absolutely no sense to me why someone was upset over this.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I'm coming close to 10 years of hosting family birthday parties for my kids and never once have I thought to serve alcohol! I always figured coffee, juice/pop and cake were sufficient!",
          "id": 76,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2260,
      "content": "NTA.\n\nBooze at a 1 year old party ? Really ? Those people need counselling.",
      "id": 77,
      "comments": [
        {
          "score": 849,
          "content": "They wanted wines with the meal and champagne with the cake.. Which, I get it, it's the norm here, but like you say, it's a baby's party...",
          "id": 78,
          "comments": [
            {
              "score": 483,
              "content": "Your usernmane is French. Are you French also ? Because champagne for a birthday is not a norm is France. It's only a norm for rich entitled people.",
              "id": 79,
              "comments": [
                {
                  "score": 630,
                  "content": "We're French, and my SiL married in a very rich family (think a de something-de something family name). We're middle-class ourselves.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 458,
                      "content": "Rich or not., even if it’s in the culture, This is a baby 1st birthday. If they can’t even go a day without needing to drink, they have problems. They’re so entitled that they can’t even hold it for 1 year old birthday.",
                      "id": 81,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 154,
                      "content": " French or not it's pretty weird that they jumped to conclusions right away and blamed YOU because there's no alcohol in a baby's birthday party, they could have brought them themselves or gone to counseling. \n\nI understand expecting a drink or two if it's \"normal\" there but to get mad and act like a toddler because \"You didn't have what I wanted so I will not go anymore\" it's ridiculous :/\n\nYou are NTA but they sure are. And immature too",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 71,
                      "content": "Based on this, it seems to me like the issue is less about alcohol and more about your SIL complaining to your in-laws because she either 1.) has become accustomed to a certain lifestyle where luxury and excess are the primary ways people show care, or 2.) wants to make you and your husband sound like cheap, bad hosts in order to feel superior in some way. Your SIL is perhaps used to living in a world where petty gossip and judgement are the norm and she has (purposefully or subconsciously) begun to use that attitude against her own family.\n\nFrankly, you could so easily turn the complaint around: why didn't ***she*** bring a bottle of champagne as a hostess gift to show gratitude since you hosted an additional party for her sake? I would call that poor taste on her part, since she is so interested in being picky about manners and politeness.\n\n(Also, congratulations and a very happy first birthday to your baby!)",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "[deleted]",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 25,
                      "content": "I’m also French, and I can think of several family celebrations recently where we didn’t drink or even think of having alcohol because we’re just not big drinkers. NTA, but your husband’s family have a problem.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -25,
                      "content": "Don't ask americans if your french. Yes it is expected to serve wine for this kind of familly gathering and yes it is considered rude not to serve champagne/ sparkling wine with cake for a birthday, whoeverer it might be for. It is cultural there's no point discussing if it's right or wrong, it's just tje way it is.\n\nAprès ce n'est pas tres grave en soi, mais les gens n'auront pas très envie de venir diner chez vous si ca arrive fréquemment.",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "I don’t think it is unreasonable to expect wine with a meal but the guests should bring it, especially if they really want it",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I would like to attend a gathering where they serve champagne with the cake. Yummo!! Also, NTA",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "But also, why is your MIL complaining to you?\n\nIt's your husband's family, hand this issue to him. He is equally capable of buying wine, or not, as the case may be.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -3,
              "content": "WTF champagne for a 1-year-olds party.",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "You’ve clearly never been to an event in Wisconsin…",
          "id": 91,
          "comments": [
            {
              "score": 54,
              "content": "and from your neighbor to the west, many people in wisconsin also need counseling because of the drinking culture there",
              "id": 92,
              "comments": [
                {
                  "score": 7,
                  "content": "I can agree with this. As a born and raised Wisconsinite, drinking is everywhere in my dad's side of my family. However, I never offered any drinks at either of my kids first birthday parties. In fact, most get togethers were bring your own if you wanted alcohol.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "I grew up in a small German heavy town, we had beer at literally every family event on my mom's side, it would've been odd not to have it for them. My dad's side was the opposite, never saw any alcohol at any event, ever. \n\nI do think it's rude to make a big deal about it not being there though.\n\nEdit: German background",
              "id": 94,
              "comments": [
                {
                  "score": 17,
                  "content": "I agree. Being Latina, it’s VERY normal to have alcohol at every event (even a child’s bday party). I have to admit that I’ve provided alcohol at any party I’ve thrown for my daughter, and have never had any issues. With that said, if I went to another kid’s party that did not have alcohol I wouldn’t bat an eye. It’s a norm for ME, but it may not be a norm for another family. OP is nta, her husband’s fam needs to get over it.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I'm in MN and I don't think I've ever been to a first birthday party where there wasn't beer.",
              "id": 96,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "I don’t think op is an AH for not serving booze, but when both of our kids turned 1 and we threw a little get-together, you better believe we served beers. Cmon, it’s a party for a one year old… it’s for the adults more than anything. The baby doesn’t know what’s going on.",
          "id": 97,
          "comments": [
            {
              "score": -9,
              "content": "Did you miss where she said she was breastfeeding and her partner doesn't really drink?\n\nLike regardless if you think it's a fine activity for the party, it's not what the hosts wanted to do ffs",
              "id": 98,
              "comments": [
                {
                  "score": 9,
                  "content": "Uh…Woah. Like I said, I don’t think op is an asshole. It’s perfectly fine that they didn’t serve alcohol. I also don’t think it’s baffling for someone else to serve booze at a toddler birthday party. Again, it’s up to the adults to decide, since the baby will not have a preference or even know the difference.\n\nEdit - in case you were confused, I was replying directly to the person who said “really ????????? Alcohol at a baby birthday party ???!” As if it were strippers or something",
                  "id": 99,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Counseling? We had beer and seltzer for adults who wanted it at both our kid’s 1st parties. An adult shouldn’t feel guilty about wanting a beer or two around kids. No one was careless. Relax.\n\nBut NTA OP. People can also do without the booze if it isn’t present. Complaining is where it gets weird.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "You must have never been to a latino party",
          "id": 101,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "I've been to loads of kids parties where alcohol was offered and loads where it wasn't. I have hosted both versions as well. Never have I or anyone else complained at the parties that did not serve it. That ish is bananas, b-a-n-a-n-a-s. NTA.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "[removed]",
          "id": 103,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 813,
      "content": "NTA\n\nThis must be a cultural thing because never, ever in my lifetime of having children and friends with kids have I seen alcohol served at a small child's birthday party. \n\nAnd its super crappy that your SIL complained to your MIL who then complained to you. \n\nIt's so manipulative.\n\nGood for your husband.",
      "id": 104,
      "comments": [
        {
          "score": 366,
          "content": "SiL complaining to MiL complaining to me is business as usual, unfortunately. My husband is used to it, that's why he handled it like a champ.",
          "id": 105,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 212,
          "content": "I’ve served alcohol at my kids birthday parties and I’ve been to plenty of children’s parties where it was served as well. We had some beers out for my sons party which was a bbq in the backyard and we had mimosas for adults when we did a birthday brunch for my daughters birthday party. \n\n I’ve also been to plenty of children’s parties where alcohol wasn’t served. I would never expect alcohol to be served at a child’s party, but it’s not strange when it is available.",
          "id": 106,
          "comments": [
            {
              "score": 84,
              "content": "I’m childfree and few of my friends have kids, but every kid party I have been to has a cooler with beers. I think it’s more common than some people think.",
              "id": 107,
              "comments": [
                {
                  "score": 29,
                  "content": "We put beers in a cooler at all of our events /backyard bbqs and birthday parties for our kids, and pretty much all our friends do the same. I think it’s totally commonplace and normal. Idk if maybe people in the comments are picturing some kind of booze-driven shit show bender that the kids have to witness or something?? No one at any of the events I’ve been to have even appeared buzzed, let alone drunk..",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Thats sounds like the parties with alcohol were outside or with somewhere the guys would go hangout instead of the main room where the kids are.",
                  "id": 109,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 43,
              "content": "Yeah, it's not really \"weird\" or a bad thing to have alcohol available for adults that want to partake. My son was the only child at his first birthday party, and there was beer available. The next few birthdays we held somewhere other than our house, and there was no alcohol. Not a single person complained or even brought it up.",
              "id": 110,
              "comments": [
                {
                  "score": 13,
                  "content": "Same, my kid was the only non-adult at his first birthday party. We had mimosas for everyone, and some may have smoked a joint in the backyard at one point while the baby was inside. \n\nBaby had a blast and so did the adults.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Same. We have alcohol available at our parties in a separate fridge but nobody drinks it. Same at other kids' parties where there is alcohol - hardly anyone will drink. Most people have to go to another family oriented or kids sport event later in the day, anyway, and aren't inclined to drink. I can't imagine anyone I know, who doesn't have a drinking problem, even having a second thought about whether or not there alcohol at a one year old's birthday party. On the other hand, the people who I know that are alcohol dependent....",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 65,
          "content": "It's typical with a lot of Mexican families (like mine) here in SoCal. But I wouldn't get upset if it was a dry party.",
          "id": 113,
          "comments": [
            {
              "score": 37,
              "content": "My Mexican family in Texas always had beer at family gatherings. But they wouldn’t throw a fit if there wasn’t.",
              "id": 114,
              "comments": [
                {
                  "score": 41,
                  "content": "I feel like my Mexican family in Texas wouldn’t have thrown a fit, but they’d have gone out and gotten their own and brought it back.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Right!!! I can't count the amount of times that drinks have dried up or been missing altogether at a carne asada. Nobody causes a stink, one or two uncles just randomly disappear and come back ten minutes later with enough beer and soda to flood the state. Doesn't matter if they're the hosts or not. You see a need and you take care of it, easy.\n\nNothing gets on my nerves more than people (like OP's SIL in this case) who go on and on about manners but can't be half-assed to give their hosts any amount of generosity to begin with",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Lol, this is what I was thinking, but usually the guests will show up with alcohol of some kind as well. Tienes que llegar preparado.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yeah, it's common at Mexican parties. When my kid turned one, we invited his daycare friends, who were mostly white. When we offered them drinks, they thought it was the coolest thing ever. They even stayed until 11 pm. Our parties last all night. When we went to their son's party, the mom walked me outside and showed me the ice chest with beer and Spitzers and said she wouldn't have thought of it before our party.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Was coming here to say this. I’m Mexican-American from CA. Recently my parents attended a baby’s first birthday party, there was boxed wine and beer. It’s super common for some kind of booze to be available at a kid’s birthday party, and for there to be a lot of booze if it’s a major milestone party (baptism, important birthday, first communion celebration, etc).",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "honestly it makes being around some family a lot more tolerable. alcohol is for the parents to keep them from being bored out of their minds.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Also from SoCal and if it isn’t there someone’s uncle will bring some (as long as he knows the parents aren’t teetotal). No biggie, even if the parents are. Is there food? Is there music? Family? Excellent; party’s on.",
              "id": 121,
              "comments": [
                {
                  "score": 2,
                  "content": "10000%  Someone's tio or cousin will be making a store run. 🤣",
                  "id": 122,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Like. You won’t even know they’re gone till they come back with literally all the beverages. That’s how quick and quiet it will be. 🤣",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 35,
          "content": "Where do you live? Cause I have been to kids parties in 3 different countries and alcohol is standard. Of course not for kids but for bored parents 😅 \nI have 3 kids of different ages and have been to loads of kids parties of all ages.",
          "id": 124,
          "comments": [
            {
              "score": 8,
              "content": "Like kids parties are the parties I would like to have alcohol at just for sheer boredom relieving.",
              "id": 125,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 31,
          "content": "Where do you live? I used to live in upper-middle class suburban US and alcohol was served at every small child birthday party, shower, and most play dates and I HATED it",
          "id": 126,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "I saw some recently at a 2 year old's bday. They had some beers, but also had shots and stuff. which I thought was a bit weird, but this group of ppl is very alc heavy. I would honestly call the uncle of that kid is a crazy drunk and has no manners. but I definitely did not come expecting the alcohol there.",
          "id": 127,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "I'm Australian, Ive only been to 1st birthdays with wine and beer served - I dont see it as unusual. People don't get rip roaring drunk though, its just served as any other beverage.",
          "id": 128,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 247,
      "content": "NTA - I guess it's different where you're from but I would never expect alcohol to be served at a one-year old's birthday party. And I'm the type to drink alcohol at appropriate social gatherings. If you don't mind it being there, why can't they bring their own alcohol? Or tell them to do so next time.",
      "id": 129,
      "comments": [
        {
          "score": 134,
          "content": "Oh, they totally can, but it'd be view as rude to say to them to bring their own alcohol. I will suggest to my husband to tell them that, though, I think we're past the point of being perceived as rude...",
          "id": 130,
          "comments": [
            {
              "score": 59,
              "content": "Look, my husband and I both drink and his extended family drinks HEAVILY. It still never even crossed my mind to serve alcohol at any of our little kid's birthday parties. Because it's a kid's party! NTA. What a weird thing to be upset about.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "I think it’s definitely needed now to let them know “hey, we really don’t drink, so in general we’re not going to provide alcohol at our parties, but you’re perfectly welcome to bring your own if you so desire in the future”",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yeah my family, everybody has a room with a bar so I think it'd be kind of weird to have any kind of family gathering without alcohol somewhere, but I wouldn't complain about it",
          "id": 133,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 157,
      "content": "NTA\n\nI mean, if it was New Year's Eve, or someone's 21st birthday, or some other sort of \"adult\" party, I could understand some people's  expectation of alcohol being served, and being disappointed if it wasn't. (I would suggest if no alcohol was to be served in these situations, your guests should be alerted.)\n\nBut a baby's first birthday party? Absolutely not.\n\n(Especially if it was a party during the day. You don't specify, but since you said he \"napped\" for half the party, instead of saying you put him to bed, I would guess it was a daytime party. But even if it *was* a dinner party, it's still a baby's birthday party, so I would not expect alcohol to be served.)\n\nAnd your MIL is a *double* asshole for putting the blame on *you* instead of her son.",
      "id": 134,
      "comments": [
        {
          "score": 70,
          "content": "Oh yeah, for NYE we went to a big family gathering and EVERYONE was drunk except us. For adult parties, we usually don't host because we live in a small flat, but we would have served alcohol for sure.\nWe didn't think about it because it was the baby birthday party.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 137,
      "content": "1 year olds are way too young to drink. NTA.",
      "id": 136,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 128,
      "content": "NTA- you accommodated these people with a whole second party. They can survive one party without alcohol.",
      "id": 137,
      "comments": [
        {
          "score": 80,
          "content": "But you don't understand, it's an entire party meal without wine.",
          "id": 138,
          "comments": [
            {
              "score": 79,
              "content": "Idk man, seems like your family had plenty of whines there. (NTA btw).",
              "id": 139,
              "comments": [
                {
                  "score": 7,
                  "content": "OP provided the dining, they provided the whining",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "this comment.. wins! \"wines\".. whatever lmao",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah, I think it was the meal part that makes me understand why they expected wine. I can't remember the last time I was invited for a meal where wine was not available. \n\nThat said, it's not necessary, and you are NTA. No one needs alcohol, and you don't need to worry about why you didn't want to have it at your party.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 75,
      "content": "So both your parties, no one brought any wine or any kind of party warming gift?   That sounds pretty rude.  \n\nI never go to a party at someone's house without a case or beer or bottle of wine.",
      "id": 143,
      "comments": [
        {
          "score": 50,
          "content": "No, we weren't expecting it at all, because they were bringing gifts to the baby. My family did ask what we wanted them to bring, but we said nothing, so we didn't ask my family-in-law either, it wouldn't be fair otherwise.",
          "id": 144,
          "comments": [
            {
              "score": 29,
              "content": "It's not the fact of being asked to bring anything or not.  \n\nI was just taught that it's rude to go to a party without bringing a gift for the host. Doesn't have to be extravagant. Just a small token of appreciation. \n\nBut I guess your inlaws were taught that the host has to cater to their every need.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "You are totally invited to the next party I host. And don't even try to pull that BS about plane travel; all borders are open (although I hear it's a bit dicey in Sudan and Ukraine, so you may want to avoid those usually salubrious holiday hotspots).\n\nP.S. I was a bit unsure, are you bringing a case of beer **and** a bottle of wine, or a case of beer **and** a case of wine? I feel like this is information that I should know...",
          "id": 146,
          "comments": [
            {
              "score": 18,
              "content": "Depends who's party it is. I have brought both beer and wine at the same time.  I've even brought bottles of whiskey and rum a few times.  \n\nAnd if I know that they don't drink.  It's flowers or chips.  \n\nI never go to dinner or a party empty-handed.  Even if you tell me not to bring anything.  I have never once heard anyone complain that I have brought a gift.   \n\nThat's just me. \nTo each their own.",
              "id": 147,
              "comments": [
                {
                  "score": 9,
                  "content": "Don’t bring anything is generally code for don’t bring something perishable because this isn’t a potluck and we’ve sorted the meal already, not literally don’t bring anything at all",
                  "id": 148,
                  "comments": [
                    {
                      "score": 2,
                      "content": "<<*don’t bring something perishable*\\>>\n\nOh dear, I've made it to my advanced AGE not knowing this... I feel so stupid.",
                      "id": 149,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Yeah dude. If you want to drink at a party bring your own.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "“How do you knock on someone’s door?”\n\nKick it. Because your hands should be full of gifts\n\nLike a bottle of wine or a case of beer, if those are the type of things you like…",
          "id": 151,
          "comments": [
            {
              "score": 2,
              "content": "Please show me where you can buy a wine bottle that you need two hands to carry. I'd love one.",
              "id": 152,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 57,
      "content": "NTA. If your in-laws require alcohol at every gathering, they can bring their own. It’s up to you, the hosts, whether you want to provide alcohol. Not having liquor at a baby’s birthday party doesn’t make you the AH. Perhaps at their next birthday you can gift them their very own personal flask to never miss their opportunity to spike their drink. PS love how your husband handled it.",
      "id": 153,
      "comments": [
        {
          "score": 34,
          "content": "Ahaha, I'm so gonna gift them a flask ! I'm not sure they'll be happy about it, though 😂",
          "id": 154,
          "comments": [
            {
              "score": 4,
              "content": "Awesome! You should put a funny saying on the flasks. https://www.etsy.com/listing/1269089954/",
              "id": 155,
              "comments": [
                {
                  "score": 2,
                  "content": "too funny",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 37,
      "content": "NTA.\nI don't drink alcohol, and don't provide it during a party. If anyone has a problem with that, they don't have to come to the party. Some of us know how to enjoy ourselves sober.",
      "id": 157,
      "comments": [
        {
          "score": 4,
          "content": "Preach",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I'm 100% with you.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "100% YES! \n\nThis is point I feel should be screamed from the roofs. 🎉🎉",
          "id": 160,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}