{
  "post content": "I know how the title sounds, hear me out. My \\[26M\\] gf \\[24F\\] takes forever in the bathroom. Upwards of 1 hour, sometimes closer to 2. When I playfully ribbed her about this, she'd get irritated but nothing major. 3 months ago I was playfully teasing her and she flipped out. She said she won't do anything anymore, and true to her word she hasn't shaved, waxed, or put on makeup since then, and wears her hair looking like bedhead. I told her that I got her point and would appreciate it if she resumed doing things that I also do to stay presentable. Her head hair improved a bit (although not even close to how it was before) but she still has hair on her legs and underarms, semi-unibrow etc. Now she's saying I have to pay her to resume taking care of herself, which I find crazy as I'm not her sugar daddy. Why should I pay for her to upkeep herself like she's my sugar baby?\n\nI understand that it's her body, her choice etc., but if there are any guys out there who think they would be ok if their gf had long underarm hair then you're a better man than me. I haven't pushed her to do anything, nor am I enforcing any ultimatums. If, as she says, I've been conditioned to want her to look a certain way... well, that sucks, but it's not my fault. If we broke up, she'd pay for all of this beauty stuff herself, so why should I pay? Anyone who says I'm TA, are you going to then start paying for all your girlfriends' beauty regimens, or else be fine with 100% body hair and no makeup or hair care ever? Be honest with yourselves.\n\n**Gf's side:** He keeps being a dick about how long I would take in the bathroom, so as he said, I quit things he didn't even realize I was doing. No makeup, no shaving/waxing, no brows, no waxing those moustache hairs, I have curly frizzy hair so I stopped using product or straightening/curling with an iron, no mani/pedi, no touching up or redoing my highlights. Do I look like a beast? Sure. Am I a comfy, smug beast? Hell yes.\n\nHe rightfully pointed out that he takes care of himself for me (by shaving his beard and cutting his hair), so I obligingly waxed my upper lip and got a haircut. I'm continuing to do this whole thing because 1) it's so much less effort for me, 2) it's way cheaper, and 3) now that I stopped, I feel like... why do I ever have to do all this shit. It's unfair. And if I have to do it because both of us have been conditioned to see me doing these things as the basic standards for a woman, then he should pay half the costs. I conservatively spend at least $1k a year on brows, shaving supplies, hair products, highlights, haircuts, and makeup. Conservatively. He should have to pay me at least half if he wants me to do it, and extra for painful things like bikini waxes if he wants me to do them again. Otherwise it's not fair.\n\n**Both:** We love each other a lot and aren't actually fighting. We recognized that we're having a difference in opinion, and since neither has been able to sway the other we came to the court of public opinion.\n\n**EDIT (from bf):** alright, I'm the asshole. You know, it wasn't even the people saying I *was* the asshole that convinced me so much as the people saying I wasn't. No way in hell do I want to hold the same opinion as some of you, so if you think I'm not TA then I definitely am. My girlfriend not wanting to *remove body hair* is not the same as me walking around without showering, \"in stained shirts and greasy hair\". Jesus. The amount of sexist pigs that personally reached out to assure me that I'm not TA and the Reddit commenters are comprised of libtards, cucks, feminazis, etc... man.\n\nI think it's reasonable to say that I'm allowed to no longer be attracted to her physically after this, and in that case I would either pay up or we break up. However, luckily, I am still very much into her. I would *highly prefer* the lack of body hair, but it's far from a dealbreaker and I think those who pointed out that I should be trying to unlearn these standards are correct. As I said before, this was never a fight. And for all of you calling my gf a fugly whatever and telling me I can do much better, she's always hot as fuck, have fun in your mom's basement tonight.\n\n**EDIT 2 (from gf):** Thank you, Reddit, for knocking some sense into this mans. He let me shave his legs. He said he feels like a dolphin. I've decided his genuine contrition and heartfelt apologizing is enough for me and will resume shaving my pits for him, and doing my brows and hair (I didn't spend years subscribed to r/curly only to let my hair turn into a shitshow now)",
  "id": 1,
  "comments": [
    {
      "score": 27101,
      "content": "YTA. Pay the beast.",
      "id": 2,
      "comments": [
        {
          "score": 11532,
          "content": "Pay tribute to the great one.",
          "id": 3,
          "comments": [
            {
              "score": 5542,
              "content": "You made your bed, now pay for it.",
              "id": 4,
              "comments": [
                {
                  "score": 2523,
                  "content": "Removed due to API protest. -- mass edited with https://redact.dev/",
                  "id": 5,
                  "comments": [
                    {
                      "score": 49,
                      "content": "Sir, this is Wendy's.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 26,
                      "content": "What about the toe nails?",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Just wanted to say your comment made me laugh harder than anyone else's",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 293,
              "content": "Or he's going to smack down his candy ass.",
              "id": 9,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I laughed way to hard at this. Ya man pay tribute. Ya done fucked up A-A-Ron",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6252,
          "content": "For real. OP brought the wrath of the beast upon himself and now he must pay the price for it.\n\nThough he says if she was single she'd be paying for it, the girlfriend's side seems to indicate she vastly prefers not doing this and may not continue if not pressured to do so.",
          "id": 11,
          "comments": [
            {
              "score": 5426,
              "content": "And as someone with a lot of girl friends who don’t shave or wear makeup, let me tell you she SURE CAN find a better man than you (in your own words) who will be fine with it.",
              "id": 12,
              "comments": [
                {
                  "score": 1914,
                  "content": "Oh definitely. I do now shave and wear (minimal) make up, but I went through a phase where I refused to do so (I wasn't doing shit for men that they don't do). I never lacked male attention. I also wore almost exclusively dresses, so it's not like you couldn't see my leg hair.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 2883,
                      "content": "My husband knows that the longer I have my hair, the longer I take to brush and to disentangle the knots. So he helps with the brushing part. Shaving also took too much time, so we bought a laser machine  (great investment, is slow but works).\n\nOP said he was being “playful” when in reality he was criticizing how much time she spent getting groomed for him, instead of appreciating the effort. He screwed up.\n\nYTA",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "My husband and I have been together 15 years, married 6. Doesn't give a flying F if I'm groomed or not. \n\nHe knows that, if it's winter and I don't have to see clients, it's not going to happen. For as long as I don't have to. Hell, some days (today) I haven't even put a brush through my hair (although I do have spf on my face - health, not grooming) \n\nBut equally if we have an event, or I have to go on site, then plucking, shaving, and make up will be done. \n\nHe thinks I am the most beautiful amazing sexy woman on this planet (joyfully biased) either way.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 576,
                  "content": "[deleted]",
                  "id": 16,
                  "comments": [
                    {
                      "score": 644,
                      "content": "[deleted]",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 299,
                      "content": "I stopped wearing make up months ago to take a break after all these years of putting it on. I will resume at some point whenever I want to wear it, but my boyfriend has never complained. He doesn’t say a word about any of it unless I ask and then he simply compliments my eyeliner skills but says it takes work so don’t do it if I don’t want. He only even says that because I mention missing make up, and he does not give a crap either way; he simply wants to support me in whatever I do.\n\nThe fact that this guy felt the need to post seems icky. He seems high maintenance and tried to paint his girlfriend like she was the high maintenance one when she really wasn’t. I hope this lady enjoys her new routine and doesn’t change it unless she wants to.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 239,
                      "content": "I’m getting married in November and my betrothed was aghast at the price of getting hair and makeup done. He legit was like “I think you look better natural anyway so I don’t think you should bother.”",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 122,
                      "content": "19 years in a few weeks, he doesn’t care about makeup or hair.  I ended up having to cut my hair off anyway (being sick can make having healthy hair difficult) so every other month or so we break out the clippers and buzz each other’s head.  It’s nice.  He also doesn’t care about body hair either and neither do I.\n\neta: added last sentence",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "[deleted]",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Married for 11 years and my husband has said that he actually like me better without makeup. He thinks I look great with makeup but in the long run he like me better without. And my nails grows really fast so it is not uncommon for him to call my toenails claws in a loving tone (and they actually look like claws cuz I am to lazy to cut them every week and they don't bother me until they become loong). And I never shave my arms, pits yes, but not the armhair. And after 15 years together he has seen it all. He is the love of my life.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 287,
                  "content": "[deleted]",
                  "id": 23,
                  "comments": [
                    {
                      "score": 128,
                      "content": "So high maintenance! He made her sound like a swamp beast, but in reality she’s just a normal human who stopped waxing off all her body hair, took a break from makeup, and doesn’t straighten her curly hair anymore. Good god.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Ha! I’m a housewife so I spend 24/7 in my PJs. I’m home by myself so who do I need to impress. May as well be comfy :).",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "Ditto on the working from home and not brushing my hair every day. I don't wear makeup, shave anything, wear heels, or do any of the other stuff OP expects. Haven't bothered with that stuff since I was a teenager (when I realized my time is better spent on video games!). I've been happily married for more than fifteen years. Reading this thread, I've been thinking that perhaps the low-maintenance look attracts better men or starts the relationship off on the right foot.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 238,
                  "content": "I stopped doing all the basic shit all the time and i had more time and self esteem. I actually like the way i look.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 203,
                  "content": "Yeah, no kidding. My best friend doesn't do any of that stuff, and she has a great man who looks at her like she's the world. It's not uncommon.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 155,
                  "content": "Yup. I do shave my pits and legs, and I have run into men who were actually \\*disappointed\\*. \n\nHowever: this is a change in the relationship 'normal' so this is complicated. It's fine to have preferences. However, it's not OK to force other people to cater to your preferences. Ultimately, IMO either OP's preferences should have to take a backseat or the relationship should end. Girlfriend will have to do a realistic pro/con list on this relationship & see if it's worth getting her taint waxed until the end of time for this dude. NAH.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 302,
                      "content": "She's willing to do it, she just wants him to appreciate the sacrifice it takes for her to do it. He can't take part in the time and pain involved, but he can take part in the cash. IMO what she wants is inventive and unusual but entirely reasonable.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": ">It's fine to have preferences. However, it's not OK to force other people to cater to your preferences.\n\nTHIS IS THE IMPORTANT PART!!  Like or dislike whatever you (OP) want, but allow the gf to do the same. She can dislike doing all those things just as much as OP can dislike it when she doesn't do them. OP is the asshole here (YTA) for first, razxing her too much for doing them, them complaining when she stops. \n\nAs an aside, I've (F) been with my partner (M) for close to 20 years. When we got together I did the whole routine nearly every day. Then blammo, my periodic illness turned chronic and j just couldn't. It's been a lot of years now, and I am some better, but I haven't worn daily makeup in many years, and I don't shave my legs that often. My partner still compliments me, and I still get hit on A LOT at bars, by both sexes. So don't think no one is attracted to naturalness just because you (OP) aren't.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "That would be be me. Never wear makeup, don’t shave. I don’t even blow dry my hair. I’ve  only had 2 professional haircuts in the last 17 years. I just have my husband trim off a couple of inches every year or two. I do get rid of mustache hairs and pluck the few unibrow hairs. And I have the absolute BEST husband EVER!!",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yeah I was baffled by his implication that men who don't mind the underarm hair are rare, most men i know seem fine with it",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I don't ask a single thing of my wife that I do not do myself.  She has stopped shaving her legs, doesn't ware any make up, cuts her hair short very much like my own.  We can both wake up, shower together and be on the road in 30 minutes.  Love her so much, would never ask anything of her that I wouldn't want to have to do for someone else.  Acceptance is the rule of our house, and I love her and my healthy home so fucking much!",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yeah, personally I don't care at all if women don't spend time on their hair and makeup or don't shave their bodies. Besides, I'm not gonna insist that a girlfriend does things that I wouldn't do, especially considering the effort and expenses. It's an unfair double standard. I tried shaving myself thoroughly once, never did it again cause it was such a huge fucking pain. I can't imagine feeling pressured to do it as often as some women do.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 849,
              "content": "I learned about a year ago that my bf has no clue how much grooming cost. Like, brows, lip,bikini wax is a cool $75 every 3 weeks. And that’s because I’ve been going to my girl for years so she has never raised my prices.\n\nHaircut? $50 plus tip.\n\nMani/pedi? I gave up because it was costing me $75 plus tip every few weeks.\n\nLash extensions? $40 every two weeks. I finally gave them up because even though my girl was cheap and amazing, my month to month expenses were absurd.\n\nGuys. Your woman spends good money on shit y’all don’t even realize is happening.\n\nEdit: since y’all have some STRONG opinions on personal grooming when it comes to finances:\n\n1. I do it cause I like to. You don’t? Good for you! \n\n2. Some of these are considered treat yo’self things. I don’t NEED to have them done. But while I treat myself to having my brows done professionally, others treat themselves to vacations, new video games, fancy meals, or new hiking boots. To each their own!",
              "id": 36,
              "comments": [
                {
                  "score": 325,
                  "content": "[deleted]",
                  "id": 37,
                  "comments": [
                    {
                      "score": 180,
                      "content": "I’ve been going to my gals for a long time (and refer even when I’m not) so I think my prices are a smidge cheaper than normal for the area, but when I was committed to all the glam I was in for a cool $250+ a month. I know it’s pricier in other areas, and if I was in one I’d straight up hobo it!!",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "Damn; the prices seemed on the low end to me!",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "I'll be sitting here in Romania with a 15 dollar haircut being thought of as expensive and fancy",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 184,
                  "content": "I dropped $250 for a cut and colour this week. I only go every few months and ignore the terrible roots in between, but if you are getting a cut for $50 I am jealous!",
                  "id": 41,
                  "comments": [
                    {
                      "score": 11,
                      "content": "OMG, I'm so lucky to be the daughter of a beautician. Even though she's retired, I know how to do my own hair at home from watching her, so I've never had to bother with salons. It amazes me the cost of maintaining a haircut.",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Yup. I used to live in NYC and spent $140 plus tips just for a cut, no color. Now I spend about that much for a cut and color. A $50 cut is unheard of around here except in the chain walk-in places.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Not OP but $50 for a cut alone is standard here. It’s the hair color / bleach that really kills you!!! I internally debate on if I want to drop $250+tip on my hair all the time because I’m simply bored of my natural hair *again*. Ugh. I hate being a girl sometimes!",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Right!? and they also don't seem to notice where the day-to-day grooming stuff comes from. Oh , that nice shampoo that makes your hair look good that gets magically replaced every couple of weeks?.... wonder who bought that. The body wash that doesn't dry your skin out like Old Spice and smells like coconut... where did that come from? \n\noh yeah... MY wallet.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "haircuts usually cost even more than that for some women :( Mine is usually between 80 and 100 because my hair is very long and very curly.",
                  "id": 46,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "That’s the biggest thing for me. She stopped to make a point, but then realised she actually doesn’t WANT to do all that stuff, she just felt like she had to. And she’s right—it’s time consuming and expensive! She doesn’t like doing it! She’s perfectly happy in the way she is without spending 2 hours a day and thousands of dollars a year on makeup/waxing/etc.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 727,
          "content": "You gotta pay the troll toll!",
          "id": 48,
          "comments": [
            {
              "score": 12,
              "content": "Here’s your lousy toll TROLL",
              "id": 49,
              "comments": [
                {
                  "score": 10,
                  "content": "Confound our lousy toll, troll. Sssssssssss",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 313,
          "content": "He should chip in for clothes too. I bet the stuff he likes her to wear costs waaaaay more than his ratty old Navy t shirts and tattered cargo shorts.",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 158,
          "content": "Gotta pay the troll toll to get into this boy's soul.",
          "id": 52,
          "comments": [
            {
              "score": 5,
              "content": "[deleted]",
              "id": 53,
              "comments": [
                {
                  "score": 9,
                  "content": "No you sicko, that's disturbing. We all see where your mind is.",
                  "id": 54,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "The beast is being fed currently in non-monetary ways (I have accepted my ITA judgement and she is now gleefully shaving my legs as revenge)",
          "id": 55,
          "comments": [
            {
              "score": 9,
              "content": "WHY AREN'T YOU THE ONE SHAVING THEM",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "LOL. This is a much more entertaining compromise. OP, I just want to personally thank you for my most upvoted comment ever as well as the most guilded. Thank you my fellow redditor!! Enjoy the shave!",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13633,
      "content": "[deleted]",
      "id": 58,
      "comments": [
        {
          "score": 5473,
          "content": "Honestly, I think more people would be more comfortable with girls wearing less makeup/ having more body hair if it was more common. It's natural. I believe anyone has the right to do whatever they want with their body, and if you are going to pressure someone to do something else, then you should be paying half (if not all) of the cost.",
          "id": 59,
          "comments": [
            {
              "score": 5029,
              "content": "[deleted]",
              "id": 60,
              "comments": [
                {
                  "score": 1882,
                  "content": "He also expects her to do things that are painful for her, such as a bikini wax. I am a guy, and I know some people have strong preferences, but I find when you love someone their little imperfections don't seem as unappealing. Of course, if you only obsess over small things, then that can interfere with sex.\n\nOf course I don't know how the girlfriend looks, but the women I've been who chose not to shave didn't look bad. Women also tend to grow less hair than men. I think if he was willing to do everything he expected from her, then maybe I'll be more okay with his position.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 2009,
                      "content": "Body hair is not an imperfection",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yeah I have a *slight* preference for what I do with my body hair, I usually ask my SO what their preference is as I don't have a strong opinion either way so I don't mind if they prefer things one way or another.\n\nMy current SO was like \"I get to have sex with you on the regular, please just do what you like\"\n\nI enjoy spending time doing my hair and make-up etc, but the difference is I do it for me. I do it for date night with my man, I do it for girls night out, if the mood strikes I'll even do it just to run errands because I had nothing else to do that morning and practice is how you improve on anything. The difference here is, as I said, I do it for *me.*\n\nI'm currently sitting in my office wearing a skirt with legs that haven't been shaved in over 2 weeks, I'd be surprised if anyone around me has even noticed, made-up beauty standards are indeed, bullcrap (however, if you choose to abide by those beauty standards more power to you, so long as you are consciously making that choice and not being forced into it because a partner or magazine told you to!).",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yup, she literally cannot win. \n\nIMO he gets to pay for it if he is gonna be particular. And no more complaining about how long it takes, either.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 853,
              "content": "I totally agree. This line really jumped out at me:\n\n>If there are any guys out there who think they would be ok if their gf had long underarm hair then you're a better man than me\n\nI've always found a bit of underarm hair hot, in a strange primal way. The absolute disdain that OP feels for his girlfriend's armpit hair seemed quite sad.",
              "id": 65,
              "comments": [
                {
                  "score": 603,
                  "content": "This. \n\nAlso I don't understand why it doesn't go both ways. Why is a woman's hairy armpit gross but a man is not expected to shave or wax his (and it would probably be seen as strange for a man to wax or shave his pits). It's just hair, do what you want with it.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 200,
                      "content": "It actually does go both ways for me, haha. I don't shave my legs because it's a hassle and I hate it, and I don't do anything in the bikini area because that's even more of a hassle and it's not like there's anyone around to look at it.\n\nBut I shave my pits because it grosses *me* out. It'd be *nice* if whoever I dated, regardless of gender, would shave their pits, too.\n\nBut as long as they don't get on my case for not shaving areas I hate, I'm not gonna bother them about not shaving their own pits.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Man who shaves his armpits here. Entirely I get shit for it all the time, but I like the way it feels, so fuck 'em. I go more than a few days without shaving and it feels all gross after years of getting rid of that shit. Fuck all ya'll \"hair nazis\", wanting everyone else to conform to you hair beliefs. As soon as I get one of my women friend to show me how to do my legs that shits next. You hear me? Smooth as shit they're gonna be. Smooth as fucking shit...",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 180,
                  "content": "yeah lol i sometimes go a while without remembering to shave my armpit hair and i get a little embarrassed but my fiance has never cared, its weird to me that hes acting like NO guy would be ok with armpit hair lmao",
                  "id": 69,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yeah, my husband cares much less about how much hair is on my body than I do. Pits, legs, vulva, he likes it clean shaven and he likes it when the hair is practically long enough to braid. I’ll kvell about how long it is and how much I’m dreading shaving but I just need to do it because it’s making me crazy, and he’ll just rub my prickly leg and talk about how much he loves touching me. Guess he’s a better man than OP.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I'm a bi woman and I find underarm hair can def be sexy in a \"no fucks given, take me as I am\" kinda way.\n\nLack of pubic hair also gives me the creeps because IMO it looks childlike. I really don't understand the visual appeal of a Brazilian wax.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 567,
              "content": ">Honestly, I think more people would be more comfortable with girls wearing less makeup/ having more body hair if it was more common. \n\nPfft, tell me about it. I put on natural looking makeup and that isn’t too expensive and takes less than 7 min to apply. One day I wore it around and a guy made a comment about how I wasn’t wearing any makeup. I looked at him and said ‘you really think I’m not wearing makeup? I have a full face on right now.’ and he was flabbergasted. He really thought I had an even skin tone and no pimples/discoloration as well as thick, long eyelashes.",
              "id": 72,
              "comments": [
                {
                  "score": 79,
                  "content": "This happened to me with a girl at work. Sorry I wasn't wearing \\*enough\\* makeup for you.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "That is what gobsmacks me about this. Have these men never looked in the mirror? Or at other men? How do you not notice what normal skin and lips ans eyes look like?",
                  "id": 74,
                  "comments": [
                    {
                      "score": 38,
                      "content": "WEMEN R SPESHULLLL They have flawless skin and no body odor and never FART!1!",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "Men are honestly oblivious to how much work it takes to be a woman. When they say they want “natural beauty” they mean the woman who spent an hour putting on no make-up make-up\n\nI normally put on a full face of makeup when I go out, because I love make up and I enjoy wearing it; the husband could not care less. One day I just didn’t feel like it and the husband commented that I got ready faster than usual.\n\nMe: That’s because I’m not wearing any makeup.\n\nHusband: Oh you’re not? *Peers at me intently* *shrugs*",
                  "id": 76,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Got you a keeper!",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I use CC cream and a brown eyeliner pencil (the smudging kind so no skill required).  The whole process takes less than two minutes and I look better than if I did either no makeup or full makeup.  I use a brick coloured lipstick if im3 getting really dolled up.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 14,
                      "content": "what is this eyeliner that requires no skill? I currently bike to work and have a toddler so put on zero make up but wouldn't mind this magical eyeliner.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 323,
              "content": "[deleted]",
              "id": 80,
              "comments": [
                {
                  "score": 339,
                  "content": "Advertising/shaving companies decided they wanted to sell more razors?",
                  "id": 81,
                  "comments": [
                    {
                      "score": 12,
                      "content": "[deleted]",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "I was low key seeing a guy and he told me he found body hair on women disgusting, he felt it was dirty. I couldn't get a good reason out of him, just \"idk I just think it is\". I asked if he thought his body hair was dirty. \"No because that's different, women aren't SUPPOSED to have body hair\".\n\nThat was a short date",
                  "id": 83,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 270,
              "content": "I've dated a few girls who didn't shave or wear makeup and couldn't have cared less. It's really no big deal. \n\nI wouldn't want to go through the hassles of shaving off all my body hair so I can't really expect someone else to.",
              "id": 84,
              "comments": [
                {
                  "score": 16,
                  "content": "Of course I don't know any of your exes, however most of the women I know who don't shave have almost invisible hair anyway. If I didn't shave, I'd look like a sasquatch.",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 144,
              "content": "Oh, for sure. I actually keep my social media pretty free of any content relating to makeup/fashion/celebrities because it's not too interesting for me, so it had been a WHILE since I saw a woman with full makeup on. And when my friend sent me a video of this make up artist, I was just blown away at how WEIRD people look with makeup. It just felt thick and clunky and uncomfortable, like wearing halloween makeup to bed. And it wasn't even on me! \n\nI think makeup is just one of those things that you don't realize how prevalent and unnecessary it is when you don't regularly consume it, like sugar. If you cut back on sugar, things start tasting just as sweet with their natural sweetness. \n\nMakeup is a fun and challenging hobby for many wonderful people, but I really, really feel it should be more of a niche thing rather than a full blown status quo thing.",
              "id": 86,
              "comments": [
                {
                  "score": 61,
                  "content": "I mostly agree, but I honestly doubt it’s been a while since you saw a woman with full makeup on. Men very often overestimate the visual effect of makeup. Like those men who say “I prefer a natural face” but what they mean by natural is concealer, foundation, contouring, mascara, etc etc but done in a tasteful way. That’s still a full face of makeup. (And if I’m mistaken and you’re actually a woman who already knows this sorry!)",
                  "id": 87,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I actually am a woman, hehe! 🌻 No problem, I know what you mean and you raise very good points. But I mostly follow men and women who don’t wear makeup at all.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "If you watch television or ever see any celebrities, you are seeing full faces of makeup. Lots of women you see every day are wearing full faces of makeup, and a LOT of makeup. Makeup isn't just red lips and blue eyeshadow and false lashes.",
                  "id": 89,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "The current style in women's makeup borrows a lot from drag queens (serious.) What's in fashion these days is pretty over the top and theatrical. I expect we'll see a swing away from this in a couple of years.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 9,
                      "content": "There’s already starting to be a shift toward more natural makeup styles. The drag influenced style is still there but even that is evolving. Look at the eyebrows now versus even 2-3 years ago. It’s moving toward a more natural full type of brow as opposed the thickly carved out style.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "It's already starting to, no makeup makeup looks and the \"cool girl\" aesthetic pushed by brands like milk and glossier is huge right now",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 98,
              "content": "I shave often, but honestly my Italian blood kills me. I can have a five o clock shadow on my legs when I’ve shaved them that morning. I shave enough to make me not look like Chewbacca because I don’t need to freak my boyfriend out, but he accepts that I’m not going to go out of my way for hours on end unless we are going to go on a date. \n\nLuckily I have a great guy and even he understands that women have hair. It’s natural.",
              "id": 93,
              "comments": [
                {
                  "score": 8,
                  "content": "I feel this so much. I'm English, with Celtic and German roots which you'd imagine would make me fair like the rest of my family? But no. I have thick dark ginger hair, freckles and stupidly pale skin BUT my body hair is BLACK. There's no missing it. I curse everything about my genes. I can shave and have stubble two hours later. And the stubble is so dark that I might as well have luscious locks on my legs.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Same. Somehow missed the boat on light brunette, fine, body hair with the ability to tan that my mom and sister have. \n\nInstead I am pale as hell covered in coarse black/dark brown body hair. When I shave, I just look like I trimmed the hair. \n\nIt’s life’s cruel joke. I have nice eyebrows as a consolation prize. \n\nMy boyfriend is a v hairy man so our kiddos are going to look like Cousin It.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Heck, I don't wear makeup and never have - maybe twice a year for big events, or I'll put on some lip gloss if I feel like it. Yes, I take good care of my skin, because I enjoy skin care...but I don't enjoy wearing makeup, so I don't wear it. And I shave my legs/pits/crotch when I feel like it. Granted, I'm not super hairy, but it's still done on my schedule. I don't highlight my hair or do a ton of styling to it; it's usually a wash-and-wear kind of thing.\n\nAnd I've \\*never\\* dated a guy who complained about it! I'm not a knockout, it's just that they met me in that state, and it's never changed for them. So if they were attracted to me at first, with no makeup and maybe a little bit of leg stubble, then guess what, I still look like that most of the time. No big surprises if I'm sick or it's the weekend, I still look pretty much the same, with more comfortable clothes on.\n\nIt's all about setting those expectations; I do not want to look like an Instagram model in my daily life, even if I am looking to attract men. So I don't, and then I attract men who don't expect me to look like an Instagram model. It works out really well; my husband finds me very sexy, same as he did when we first met, and I wasn't wearing makeup or hairspray then either.\n\nPersonally, I wouldn't be with a guy who wanted me to look all glam, but that's my preference because I know I couldn't keep that up and we'd both end up disappointed. But if, say, my husband started wanting me to get highlights and a wax job once a month? Yeah, pay up, babe, that shit's expensive and I want to spend my money elsewhere. At that point those are products and services being purchased for him, not for me, so in this hypothetical situation, he'd be the one to pay for them.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 150,
          "content": "Also, Consumerism is The Asshole for programming our culture to be so insecure all the time that we can’t even be comfortable with our natural selves.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": ">if there are any guys out there who think they would be ok if their gf had long underarm hair then you're a better man than me\n\n&#x200B;\n\ni think its weird to \"not be ok\" with girlfriend having body hair. who gives a shit, you're not the one shaving your entire body every day",
          "id": 98,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11088,
      "content": "YTA boyfriend, obviously.\n\n\"Oh but she's not my sugar baby!\" So you want to be able to dictate how she looks, but you also think she should incur the cost as well as the time (and discomfort) of living up to that? Honestly, 50% of the cost is a bargain.\n\n\"Oh but she'd do it if she were single\". Would she though.\n\nTell you what. Why don't you two add up all your grooming expenses. Your hair and shaving products, her hair and shaving products and leg waxes and straighteners and makeup and hair products and mani/pedis. Call them joint expenses, split them 50:50.",
      "id": 99,
      "comments": [
        {
          "score": 6152,
          "content": "There’s another solution.  She’s willing to do every bit of grooming that he does.  Time for boyfriend to shave his legs and see what a pain it is.  He can start wearing neutral makeup, adding product to his hair, exfoliating, buffing/filing his nails, and getting his crotch waxed.  Either he enjoys doing it and they both look fabulous for each other, or he gets a better understanding of exactly what he’s asking for.",
          "id": 100,
          "comments": [
            {
              "score": 5879,
              "content": "Don’t forget he has to do it all in a quick and timely manner so as not to take too long getting ready",
              "id": 101,
              "comments": [
                {
                  "score": 1997,
                  "content": "[deleted]",
                  "id": 102,
                  "comments": [
                    {
                      "score": 733,
                      "content": "Removed due to API protest. -- mass edited with https://redact.dev/",
                      "id": 103,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 45,
                      "content": "OP: but why can’t you just wake up looking like a Barbie doll?!",
                      "id": 104,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "This is the graphic designer venn diagram! Fast, Cheap, Great. Pick two.\n\nYou can have Cheap and Great, but not fast.\nYou can have Fast and Great, but not cheap.\nYou can have Cheap and Fast, but not great.\n\nOP picked door number 3.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "YES. Maybe then he can know how it feel to be yelled out while holding a mascara wand to your eye. Or a hot iron to your head. This is not the time to be startled or stressed, honestly.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 623,
              "content": "I want boyfriend to get a full bikini wax, personally.",
              "id": 107,
              "comments": [
                {
                  "score": 249,
                  "content": "Just bikini? I had an ex who liked the full Brazilian. I’ve done it once and never again.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 123,
                      "content": "Shit! \n\nIdk why it (Brazilian waxing) has that name, but I swear that in Brazil most people only do it for the summer, and even then, only when they're planning on wearing swimsuits. \n\nThat shit. Hurts.",
                      "id": 109,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "I trained in this type of waxing, we had to use each other as models. The pain of having an inexperienced person learning how to do this for the first time is horrific.",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 506,
              "content": "Plot twist: op starts this routine and realizes he loves it, he loves the way he feels/looks and finds a quiet, relaxing enjoyment in the process. Thus op and gf successfully swap their grooming habits.",
              "id": 111,
              "comments": [
                {
                  "score": 213,
                  "content": "I want them to come back in like 2 months and say this. Bonding over spa visits, yes please.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 5,
                      "content": "This is heaven for me. I'm planning on doing this with the gf soon.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 207,
              "content": "I shaved my legs for years when I was hard core into cycling. I loved how my legs looked especially since they had some definition from all the cycling, but it really was a PITA and they were basically prickly again the very next day.",
              "id": 114,
              "comments": [
                {
                  "score": 203,
                  "content": "I’m a tall girl (5’10) and one of the things I dislike about that is just it takes sooooo long to shave them. My friend who’s like 5’0 takes so much less time that me and I’m jealous. I like how my legs look and feel when shaved, but god at what cost?",
                  "id": 115,
                  "comments": [
                    {
                      "score": 77,
                      "content": "The upkeep was so annoying. I'm right around your height and it's a lot of square inches to cover, and doing it multiple times a week year-round got old after a few years. I can't imagine a lifetime of it. My wife also wasn't a big fan because of the near-immediate prickliness but she put up with it.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Seriously. I'm also 5'10\" with big thighs. I don't think I've shaved above the knee since junior high. My fiancé reallllly wishes I would shave all the way up to the hip, but that's the one part of my body I point-blank refuse to do. It takes SO long, and it's so pointless to me since my thigh hair is already soft and blonde. I'll do my calves without prompting because that hair is black and prickly, I'll do Brazilian waxes, but I don't compromise on the thighs. Takes way too much time, not to mention water, and shaving foam...",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I'm as tall as you. I don't know about you, but I have like no torso and I'm all leg. Most of my height is leg. It's not fun shaving that. Noooooooooo.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 128,
                  "content": "The feeling of freshly shaven legs on freshly bleached sheets is unlike any other. Also shaved legs in tight pants. I pretty much only shave my legs in the winter because that's when I get to experience those two things the most. Shaving your legs in the summer, for other people; shaving your legs in the winter, that's for you.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 97,
                      "content": "Oof I hate the thing you love - shaving makes my skin feel numb, because I lose the ability to feel that extra half inch of proximity all around my shins. Like cutting a cat’s whiskers off.",
                      "id": 120,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 155,
              "content": "This is the answer.  Guys who do all this extra grooming look just as good as women who do, there's no logical reason she should go the extra mile and he shouldn't.  It can even be a couples thing! Getting mani-pedis and Brazilian waxes together.  Well, maybe not the waxes.  Maybe.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": "I am HERE. FOR. THIS. \n\nmen you give it a try. But don’t take too long",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 89,
              "content": "Ok now I really want OP to start doing all of this and realizing how much he loves it and just leaning right the fuck into the beauty world. Brows, cut creases, fantastic delicate highlights, the whole damn nine yards.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Yep! Get to it OP. It’s obviously not too expensive or too much work and if your SO wants it and thinks you’re gross if you don’t oh well do it anyway.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I really dislike body hair on men so I always have this deal with any guys I see, that I'll only shave if they do. I live in Portland so I get a real mix of guys who are willing to shave if I do, and guys who refuse to shave and don't really care if I don't shave either.\n\nThe dream is to eventually find a guy who just likes shaving his own body hair but doesn't want me to shave mine, I'll probably get married if I ever find that.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 604,
          "content": ">\tTell you what. Why don’t you two add up all your grooming expenses. Your hair and shaving products, her hair and shaving products and leg waxes and straighteners and makeup and hair products and mani/pedis. Call them joint expenses, split them 50:50.\n\n👏👏👏",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 545,
          "content": "The money isn't even the worst part. I crossdress occasionally and the fucking *time* involved to shave/wax legs/pits, do makeup, nails, moisturize, do hair, eyelashes, dress, perfume, accessorize etc... is just ridiculous. A whole *day* lost. If I didn't have my wife to help, I'd never bother doing it. \n\nThank fuck I can just shave my beard, tossle my hair, and wear a suit to work. Takes 10 minutes for me to get ready and nobody asks me if I'm tired or sick.",
          "id": 127,
          "comments": [
            {
              "score": 170,
              "content": "Yeah, by his own admission he’s asking her to spend 1-2 hours a day on this!",
              "id": 128,
              "comments": [
                {
                  "score": 27,
                  "content": "It takes me a whole hour just to shave my legs fully (tall girl problems, amirite?), nevermind the pits, washing my hair, getting my hair part to be at least a little even (bitch tries to be uneven zig-zag every time) and plucking the stray eyebrow hairs. There´s a reason I only do all it once a week while having a relaxing bath.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "And he will bitch about her taking the time, too. She can’t win here.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": ">Takes 10 minutes for me to get ready and nobody asks me if I'm tired or sick.\n\nYou get it. You truly get it and I appreciate that!",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 200,
          "content": ">\"Oh but she'd do it if she were single\". Would she though.\n\nExactly. Now that she's discovered she prefers not doing all that crap, she probably wouldn't do it if she were single either.",
          "id": 132,
          "comments": [
            {
              "score": 26,
              "content": "And then find a man who loves her exactly the way she is.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "This is a fantastic idea. OP, this is the one",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "21F here. Honestly I haven’t shaved my legs since my last relationship and haven’t even worn foundation. If I have no one to impress I ain’t shaving till I’m uncomfortable",
          "id": 135,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "God I'm so glad everyone is kind of on the same page here. YTA for all points made and sad. Listen OP, my SO *has* paid for shit, he doesn't care necessarily because I buy majority of it anyway. But he's still helped out if I'm low or just because he wants to. You can't just go \"guys, would you do this?\" And expect all men to just be on your side. \n\nYou're 26? Boy, men have been dealing with this for *decades*. Does your mom/aunt/grandmother wear makeup and do their hair? Yes? Ask their partner. My dad bitched that my mom took forever too, but more in a joking matter like \"man, your mom takes so *long*!\" In a funny voice. \n\nWhy does it matter that she takes so long anyway? Gotta piss? Ask. Poop? Ask. Shower? *Just ask*. Like, what's the big issue about asking to use the bathroom in she's in there? I don't understand this apparent territorial thing",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I like that! Paying for her just feels like a weird solution. Making grooming joint expenses is an excellent solution that financially is probably a similar split. Although I think the girlfriend is finding low maintenance appearance is more for her. He’s an idiot.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I 100% agree with this. \nGF has to spend at least an hour a day to look \"presentable\" in front of BF. After the dispute, if he has to pay her 500$ a year for grooming costs, which means less than 2$ a day, ain't that a bargain?!\n\nBF played a petty game, ends up being served.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "The moment he actively requested she do these things is the moment it became **his expense.** Honestly, I'd like to see him pay 100%, but I'll settle for 50%.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4868,
      "content": "YTA. A very petty dispute in which both sides were assholes led to GF realizing how much time and money she spent on grooming and decided to not do it anymore. You point out that you spend time and money on grooming and she agrees to spend the same amount.\nYou realize you want her to spend even more of her time and money on grooming, and she agrees to do it if you subsidize it. Sounds fair.\n\nI do find myself extremely unsympathetic to all the stuff from both of you about social conditioning and the ideas about grooming for each other rather than for yourselves as individuals.",
      "id": 140,
      "comments": [
        {
          "score": 2006,
          "content": "How was she an asshole at the beginning? What was she supposed to do? Try and talk to him about how she's getting dolled up for him and wants him to share the expense? We're seeing how well this goes, after she already proved a point.\n\nPeople who are not reasonable need to be shown the consequences of their actions. She didn't punish him, she just stopped giving him gifts. That is not asshole behavior.",
          "id": 141,
          "comments": [
            {
              "score": 1128,
              "content": "This. She was not an asshole. She showed him the consequences of his behavior, and he didn't like it.",
              "id": 142,
              "comments": [
                {
                  "score": 50,
                  "content": "Plus he is really really focused on that armpit hair while no mention is made of his own. Acting like no boyfriend would ever be okay with a woman's armpit hair.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 427,
              "content": "He's full of shit, only boyfriend was YTA.",
              "id": 144,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 834,
          "content": "Not sure how the GF is the asshole at all here. Assuming you agree that nobody ‘owes’ each other a level of physical upkeep beyond basic hygiene, the worst that can be said of GF is that she was doing something for both herself and him, he teased her for it, so she stopped doing it. Unless your point is that it’s petty to stop doing something for yourself just to spite someone else - which I would kind of agree with (but wouldn’t necessarily say it was an AHish thing to do.)\n\nThe social conditioning thing is a real thing women have to deal with. I’m generalising a little here, but society usually holds women to a higher standard of hygiene/grooming compared to men. The bf’s comment about her underarm hair is an example of how in some people’s eyes, something that’s perfectly acceptable on a man is somehow unacceptable on a woman, even though it does not affect that person’s hygiene level.",
          "id": 145,
          "comments": [
            {
              "score": 41,
              "content": "The underarm hair got me too. I shave my legs, armpits, bikini zone and beyond and sometimes even my \"lucky trail\" but underarms? Come on, you gotta draw the line somewhere. My bf also sometimes asks me to shave my back fuzz but nahah not happening.\n\nBut yeah, the title made it sound like she didn't shower anymore and smelled but nope all she did was to stop making herself look like a whole other person every day. (YTA, btw)",
              "id": 146,
              "comments": [
                {
                  "score": 58,
                  "content": "Underarm = armpit",
                  "id": 147,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 24,
                  "content": "What kind of maniac wants you to shave your *back fuzz?*",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "He's not referring to her actual arms but her armpits. Some girls do shave their arms though",
                  "id": 149,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Where does the entire idea come from that women should be hairless and made up, whereas men need not, if not from social conditioning?\n\nOr is it just some weird coincidence that this has arisen independently in every person almost exactly along gender lines?",
          "id": 150,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "As others have said, I’m pretty confused about how the GF was an asshole at all.",
          "id": 151,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4347,
      "content": "YTA, boyfriend. She doesnt want to any more but says she will do it for you if you pay for half of the supplies, which is not the same as \"paying her to look pretty\". Your argument that \"she would buy these things if she were single\" also seems false as she says she is enjoying how she looks and feels without the make up, waxing, etc.",
      "id": 152,
      "comments": [
        {
          "score": 1361,
          "content": "See, though, are labor costs included? It takes time to do that stuff, as demonstrated by his complaint about bathroom time.\n\nNow that the GF has recovered all of this time in her life she'll have to go back to resuming her old routine, thus giving up staying in bed or staring at a wall post shower or whatever she found time for.\n\nCan't pay people in time, but you can certainly pay for their time.",
          "id": 153,
          "comments": [
            {
              "score": 716,
              "content": "Not to mention skill. Applying makeup, doing your hair all nice, not ripping off your skin when waxing.... a full face of makeup can go up to $200, just saying. 🤷🏻‍♀️",
              "id": 154,
              "comments": [
                {
                  "score": 137,
                  "content": "Yes! If you do it super often you get mad skilled! Who knows, she might be good enough to do lessons.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Yup. Personally I like makeup - shopping for it, putting it on, wearing it, touching it up, it makes me feel sexy and powerful and sometimes even just more energized, and I'd be annoyed if some dude came up to me in CVS while I was trying to pick out an eyeshadow palette and said \"you don't need all that stuff on your face\" like fuck off and let me live my glamorous life! BUT, if I put in all the work to cut a perfect crease and get my eyeshadow perfectly blended, and I came out looking amazing and all my boyfriend did was whine about how I took too long (even if we weren't actually running late), and made me feel like the effort I put into my face wasn't worth it after all, I'd probably rethink wearing the stuff.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "The time thing is exactly why I can't be bothered to even start all of this.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1039,
          "content": "I don't understand why OP's gf would want to date a guy that doesn't like/appreciate how she looks naturally. Even when I think I look a complete mess because I haven't done my hair in days, sitting around in my pajamas all day doing nothing, my boyfriend still finds me desirable and beautiful.\n\nOh, I've also only shaved my legs about four times in our relationship? I never wear makeup. I don't shave or wax, and I have curly hair like OP's gf. My boyfriend has told me he prefers me with my curls and my non-shaved and waxed body. Also, the few times he bugged me about shaving my legs even though my legs don't get hairy at all, I made him do it too which made him stop bothering me about it. Moral of the story: YTA boyfriend.",
          "id": 158,
          "comments": [
            {
              "score": 488,
              "content": "Truth, especially when he insinuates that guys wouldn't be okay with their gfs being natural. My wife doesnt shave, and I dont care because I dont shave either!",
              "id": 159,
              "comments": [
                {
                  "score": 37,
                  "content": "Yeah my husband is 100% fine if my pits and legs are unshaved too, I'm really confused as to why he's so convinced that no man would be ok with natural body hair.",
                  "id": 160,
                  "comments": [
                    {
                      "score": 12,
                      "content": "This. To find it completely unfathomable that some people might not mind if their girlfriend has armpit hair? He needs to really think about why he feels that way. Is he repulsed by his own armpit hair too?\n\nI shave every now and then because it feels nice to be smooth, but my fiancé doesn’t make me feel any less attractive when I let it grow. I’d be pissed if he did.\n\nGood on you, gf, for freeing yourself and enjoying it! I hope bf comes round and appreciates your natural beauty, and if you do spend hours getting ready again one day, he comments about how great you look!",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 217,
              "content": "Why do so many women find curls unattractive? I may br biased because I have curly hair myself but I find it way more attractive than straight hair",
              "id": 162,
              "comments": [
                {
                  "score": 220,
                  "content": "It comes from years of being told our hair is more manageable and prettier straight. Also, shrinkage sucks! I definitely love the two times a year I get to see my actual length when I straighten my hair.",
                  "id": 163,
                  "comments": [
                    {
                      "score": 10,
                      "content": "This! And honestly I blame my Mom a bit. She complained about doing my hair every day as a kid (justifiably).  So it was ingrained from the start. My husband loves my curly hair though and it’s more work on the daily but it’s vastly cheaper to salon visits.",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I got my first blow out a few months ago after letting my hair go natural. It pours down my back. My shrinkage keeps it over my shoulders. Crazy stuff.",
                      "id": 165,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "And no one knows how to cut it! Most stylists get the hair wet, brush it out straight and cut it just like it's straight hair. Then when it goes back to being curly it's way too short and looks stupid because the style wasn't intended for curly hair.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 105,
                  "content": "Curly hair can be incredibly difficult to maintain with the popular/conventional products on the market.  Check out r/curlyhair and look at some of their routines to get an idea of how much of a pain in the ass it is.\n\nMy hair is curly+waist length, but most days I have it in a bun because I can't be bothered to style it.  When it looks good it looks GOOD, and my husband is all over it.  When it doesn't look good I resemble a neglected mini poodle at a shelter.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 25,
                      "content": ">When it doesn't look good I resemble a neglected mini poodle at a shelter.\n\nOr like we stuck our finger in a light socket.",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "[Lol](https://www.thesun.co.uk/wp-content/uploads/2018/06/NINTCHDBPICT000414552939-e1529446057725.jpg)\n\nStill cute.",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "From a NYT article on the subject:\n‘“You’re so brave to wear your hair curly,” my would-be boss said [while interviewing me for a job], running a hand through her own lanky waterfall. “I have to straighten mine every morning.”\n\nI didn’t get the job. It had never occurred to me that my hairstyle was a bold choice, but in that particular corporate setting, it seemed, it betrayed something unsavory. The problem with curly hair is one of the outside gaze. People with straight hair (either by birth or blow-dryer) mistake it as a kind of statement — a mark of blustery confidence and bold individuality — or, worse, as careless and sloppy, a sign that you’re lazy or stubborn.’\n\nThis is true in the media too. Granting a few exceptions, leading ladies have straight hair and women with curls might be at best a side kick or a sexualized walk on the wild side, at worst a villain, or at least “crazy,” unpredictable. Also, the images of curly hair we often see in the media—on white women, anyway—is hair that is first straightened and then re-curled in a more “manageable” way.\n\nAs a women with curly hair, I have spent a lot of time thinking about this.",
                  "id": 170,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Job interviews are one of the very short list of occasions for which I'll straighten my hair and wear makeup. And that's why. :-/",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Personally? Because: “Oh my God! You have a witch costume wig for hair!” - My mother \n\nMy husband & long-time friends are the only people who know I’m naturally curly.",
                  "id": 172,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Curly hair is generally frizzy when product isn't used so lots of little girls who don't use it get made fun of when their hair is frizzy, and that tends to get internalized as we get older. Curly hair is gorgeous when you have the time and money to make it look nice, but it takes a lot of effort and many women resent that.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "As a straight dude, I wish I could shave my legs without other dudes finding it weird. I used to do it occasionally, because it honestly feels amazing in bed. But I got a few weird comments on it playing sports, and as someone who already struggles with social anxiety, I didn't need any more reason to feel out of place.\n\nSome girls would totally find that sort of thing weird, and some would find it hot. Plenty of folks out there with plenty of different preferences. I don't blame OP for having his, but it seems like if it makes him happy, he should be happy to financially contribute to that as well. Seems like a joint expense to me.",
              "id": 174,
              "comments": [
                {
                  "score": 13,
                  "content": "Who cares what anyone thinks. I get a full Brazilian a few times a year with waxing touchups in-between. Once you stop caring, the word becomes so much better....also, waxed everything feels divine naked between highthread count sheets when dozing off.",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Take up cycling.",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I mean if you are planning of sharing expenses in the future you literally will be paying for half - so what do you want to pay for? And are you willing to pay for time?",
          "id": 177,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3262,
      "content": "YTA - boyfriend sucks. The comment about underarm hair on women is plain gross misogyny. Female bodies are actual human bodies that grow hair too and not just sexual objects to shove your dick into.\n\n\nGirlfriend - keep being awesome and natural!!! I don't know where you live but your yearly estimate is extreeeeeemmley conservative. It costs me close to $300 each time I get my hair done just because I'm a chick and thats the going rate where I live for a salon cut and colour. \n\n\nBut this winter (southern hemisphere) I've become the beast myself and have let my underarm hair grow the longest it's ever been and it's still so inoffensive. I actually like it! I don't get BO with it at all. It also seemed to stop growing after it reached 1-2cm and is incredibly fine and thin.\n\nIt's no where near as obnoxious as male pit hair, so your boyfriend's comment is just hypocrisy.",
      "id": 178,
      "comments": [
        {
          "score": 2273,
          "content": "I mean, TONS of women out there would prefer their guys to have less body hair as well, but if we even suggested it, we'd be called crazy. And guys out there acting like it's their goddamn given right to have a hairless woman.",
          "id": 179,
          "comments": [
            {
              "score": 1117,
              "content": "Oh my gosh, right???? Male body hair is just accepted but not neccesarily attractive. Shave your balls man!!! 🤣",
              "id": 180,
              "comments": [
                {
                  "score": 657,
                  "content": "Better yet, wax those bitches.  Then let's talk.",
                  "id": 181,
                  "comments": [
                    {
                      "score": 365,
                      "content": "Full Brazilian to even resume the conversation with bf, I reckon.",
                      "id": 182,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Only if you pay for it 🤣",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Can you imagine??? They would cry for days and never do it again. 🤣",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Facts. My husband and I got Brazilian waxes earlier this year (special occasion, typically we're hairy beasts and dgaf lol). He agreed that it wasn't even that bad, just uncomfortable and a little expensive... ovary up, dudes!!!",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Haha. Im a pretty tidy dude. i have a full beard(neatly kept, always) its expensive as hell to go to a good barber. I pay fucking premium for good ecological beard oils made in norway and so on. Im also a hairy guy but i trim my armpit hair( it can get craazy long) and shave my privates because i prefer it.. \n\nAnd I probably spend an hour getting ready, OP is and actual twat\n\nOnly added this to flavour my actual statement\n\nRecently got a new girlfriend, and she is baffled each and everytime i tell her that i prefer her with less or no make up, but obviously never force her to do anything, she decides when she wants makeup on or not. But atleast now she is confident enough to not feel like she has to put make up on when we stay in for a weekend, i just make us some good food and we binge Netflix all day. \n\nAlso i couldn't give two shits about leg hair, i do however prefer if she shaves her armpits every now and then, but never bothered to talk about this as its not my decision to make and she does it anyways. \n\nAnd to be honest when i find her the most beautiful is when shes right out of the shower, no make up, puffy cheeks from the steam and semi wet hair. She always asks why i stare when she comes out of the shower, and i always tell her its because she is so absolutely beautiful.",
                  "id": 186,
                  "comments": [
                    {
                      "score": 4,
                      "content": "For real on the beard.  I've been growing mine out for the first time in my life now since February and it's a lot more upkeep than I imagined.  I regularly buy beard oil/balm and have to get it trimmed/shaped by my hair stylist every 1-2 months so it doesn't look crazy.  Applying these products and styling my beard has added at least 10 minutes to my morning routine.",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 148,
              "content": "Eh, I've had a few gfs make comments about my body hair. I'm not super hairy, but they want the presentable look, shaved and manscaped. I'm not saying it's anywhere near comparable to what they go through, but I do the specific things that the current gf wants. She cleans herself up for me, I'll clean up whatever she wants me to clean up in return.",
              "id": 188,
              "comments": [
                {
                  "score": 5,
                  "content": "It chafes less during sex if you shave. Less so if you wax because there's no stubble.",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "As a man who shaves armpits, beard area, downstairs, eyebrows to prevent unibrow, as well as regular haircuts; it’s actually quite freeing to just shave it off with a ton of shaving cream (at most $15 every 2-3 months) and a good razor kit ($15 every month or so). \nAnd it makes women in my life happy I’m not a hairy beast, &  that I understand what goes into it. \n\n*(I used to shave my arms/legs for sports but don’t anymore)",
              "id": 190,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 389,
          "content": "I also noticed this when I stopped removing hair from my armpits. Less sweat and I'm usually a very sweaty person. Less stink. Less chafe. I've got them sugared twice in 6 months for some events and it's been amazing just letting my body hair be part of my body. Also, my husband can't give a fuck about any body hair, so OPs Bf YTA",
          "id": 191,
          "comments": [
            {
              "score": 151,
              "content": "Hm.... Im not sure I believe this. Shaving my pits goes a long way towards keeping my BO under control. I start to stink if I let it go too long.",
              "id": 192,
              "comments": [
                {
                  "score": 124,
                  "content": "I wonder if that varies person to person. I have way more BO when I shave my armpits but I have friends who shave specifically to avoid BO!",
                  "id": 193,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I think it depends on how you \"wash\" yourself. Body odor, or atleast deodorant sprays usually work better when you have no body hair since it goes on the skin directly and the Body odor doesnt get stuck in the hairs. I personally shaved my armpits once and hated the feeling when I sweated. Disgusting glitchy feeling.",
                      "id": 194,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "[deleted]",
              "id": 195,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": ">  It costs me close to $300 each time I get my hair done just because I'm a chick and thats the going rate where I live for a salon cut and colour. \n\nI live in a super cheap-ass area and it's still at least 250$ here. Aaaand this is why my hair is only trimmed and never colored. :/ I'm not even sure how much waxing costs. I don't wanna look lmao.\n\nGirlfriend could lose some weight if she dropped that extra 200lbs or so she's carrying around in shitty boyfriend.",
          "id": 196,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2327,
      "content": "BF- Sorry to say, but I gotta go with YTA here. You were an ass about her taking too long. Now she’s perfectly content with her appearance, so if you want her to change, why should she be financially responsible for it?  I will say, it sounds like you have one hell of a woman there, be good to her.",
      "id": 197,
      "comments": [
        {
          "score": 41,
          "content": "This, she sounds pretty cool. The only things you can ask for in a relationship are things you would do yourself, if you want her to keep her body hair to a standard, keep yours to her standard.. etc. \n\nFor the two of you, don’t let spite ruin your health and fitness, keep working out and eating right.",
          "id": 198,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1746,
      "content": "Honestly, I do not shave in the winter, and I am a hairy girl. It’s time consuming, boring, and costs money, fuck that! I have internalized the beauty myth too much to skip shaving in the summer, but to anyone who hasn’t, I say good for you. I’ve also stopped bleaching the hair above my lip permanently because, again, it takes time, it costs money, and *why*? To satisfy other people’s idea of how I should look? Eff it. This is how I was born and I am ok.\n\nAll that stuff OPs girlfriend mentioned, do you both realize that it was all very intentionally devised so as to keep women distracted and spending money? You’re right, it’s not fair. Welcome to the patriarchy.\n\nYTA.",
      "id": 199,
      "comments": [
        {
          "score": 444,
          "content": ">It’s time consuming, boring, and costs money, fuck that! I have internalized the beauty myth too much to skip shaving in the summer, but to anyone who hasn’t, I say good for you.\n\nI used to feel like that, but I just decided to go for it and not shave and go out in summer. I felt really anxious the first few times, but then I pretty much got over it, and a lot faster than I thought I would. I highly recommend trying it at least once.",
          "id": 200,
          "comments": [
            {
              "score": 335,
              "content": "I did the complete 180 and now only shave in the winter because I like how shaved legs feel on fresh sheets. I shave for my pleasure alone.",
              "id": 201,
              "comments": [
                {
                  "score": 42,
                  "content": "That's great! Do what makes you feel good.",
                  "id": 202,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Hell yeah! Everyone should do what feels good in regards to such small things that have no harm to others!",
                      "id": 203,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Lol I shave my legs pretty regularly for that exact reason. I love that feeling!",
                  "id": 204,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "> I shave for my pleasure alone.\n\nI love this, lol.",
                  "id": 205,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I don't shave my legs unless I decide \"it would feel nice to have shaved legs today\" or I'm going to a truly special event like a wedding. So I shave less than 10 times per year. (I shave my pits every other day, because it seems that deodorant doesn't work as well if I let that grow out). Still go out in shorts because I DGAF. Nobody cares, or if they do, they keep it to themselves.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I stopped shaving everywhere few years ago. I have to say I never realised how nice it feels to have wind blow on your leg or arm pit hair. I mentioned it to my guy friends and they were like...... Okay?\n\nI sometimes get weird looks but I look weird in other ways so I'm used to that. My only concern is I'm looking for a job atm and hoping it won't affect that.",
              "id": 207,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Damn this thread is really making me realize how many unrealistic beauty standards I hold myself to. I think social media just makes it worse.",
          "id": 208,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "[deleted]",
          "id": 209,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1398,
      "content": "YTA if you cant handle her naturally you don’t deserve her when she does her self up special for you",
      "id": 210,
      "comments": [
        {
          "score": 827,
          "content": "Especially when he endlessly pushed her for taking too long. She realized it’s easier to *not* do all of that if it’s not appreciated. Surprise surprise, boyfriend.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1355,
      "content": "YTA. But also you're great. Because by being a fool, your girlfriend learned that she has been completing a lot of make-up not for herself but for others. And now she doesn't want to do it, which is cool. More power to her. And she apparently spends a bit of money on these products, especially if she is paying for bikini waxes.   \n\n\nAnyway, enjoy the new look and maybe she'll make concessions if you are nice to her.",
      "id": 212,
      "comments": [
        {
          "score": 85,
          "content": "This is my favourite part. Her realizing that this shit ain't necessary.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "This is the perfect example of \"Congratulations, you played yourself.\"",
          "id": 214,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "It's not even that much. She said it was around $1k, which is ~$40 a month if they went 50/50.",
          "id": 215,
          "comments": [
            {
              "score": 8,
              "content": "Did she not say that's just for her eyebrows? So it's a lot more than that for the whole routine.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}