{
  "post content": "I have three kids, two boys aged 20 and 19, and a daughter aged 24. My ex husband is still very close with us and we remain basically best friends. \n\nWe all planned a vacation together to cape cod, but we sort of came to the conclusion that we shouldn't invite my daughter Laura. Laura... she can be a mean person. She is quick to anger and can be extremely demanding to others (especially aimed at her two brothers) and sometimes even just a night out to dinner with her can be hard to get through because of the way she acts. I just wanna give a quick example, we went to my cousins wedding and had to sleep over my sisters house the night before. My son had a blanket on the couch, and left it there while he went to go make breakfast. Laura, when she woke up, looked at the blanket, then asked him furiously \"are you going to fucking pick this up? You're just going to fucking leave this here like some slob? Pick it the fuck up\" at a volume that most of the people in the house could hear. My son doesn't even want to talk back to her for fear of escalating her anger, so he just did it. Another example is that my son left a pan in the sink to soak before washing it, and she flipped a shit and started calling him lazy and a brat and all this stuff. Over one pan. One time she asked my husband to do Yoga and he didn't want to, and she basically started berating him for being unhealthy and making his refusal to do yoga into this big thing. One time my son was having a migraine and had to cancel going to his aunts dinner, and Laura just absolutely berated him and insulted him for not 'sucking the pain up and going'. That is a microcosm of how she acts, not only to them, but to us as well, and her boyfriends and friends. If she finds even the slightest thing wrong with someone, she will point it out, viciously. \n\nShe can also be funny and charming and talkative! She isn't all bad. But she seems to have a problem when it comes to not being able to keep quiet over even slight things she finds annoying. \n\nWe want to have a fun vacation. But the thought of being with her for a week makes us all groan. It only takes one of her 'attacks' at us to really dampen the mood, especially when she starts insulting peoples characters and demeaning them. Me and my husband try to calm her down and tell her she's being irrational but there's no point at all, she just aims it at us and escalates further. \n\nSo we aren't telling her we're going. We're just gonna go. Are we the asshole for this? For basically abandoning our daughter to go on vacation without her? She would 100% be excited to go if we asked her, and she only lives 2 hours away from where we're going (we live in nyc, she lives in providence (but spends half her year in nyc). It sucks, because I do love her, but I also don't want to ruin a family vacation. I keep thinking how much fun it'll be to go with just the boys, and how awful it will be to go with her... but also how bad it is to not invite my own daughter.",
  "id": 1,
  "comments": [
    {
      "score": 5817,
      "content": "ESH. I have kids about the same age - older daughter with two younger brothers. I think you need to sit down and tell her to smarten up and that if she wants to come, she has to control her temper. Little brothers can be pains - even at that age - she needs to learn how to let things go.\n\nMy daughter is in therapy - do you think yours would be open to it? Sounds like she has a bit of tension in her life!",
      "id": 2,
      "comments": [
        {
          "score": 2489,
          "content": "Yeah, I'm like astounded people are saying NTA. Like if she's this temperamental at some point that was the parents fault for allowing her to be like that. If you have to hide from your daughter to have a pleasant time you've been a bad parent.",
          "id": 3,
          "comments": [
            {
              "score": 1737,
              "content": "She may have a genuine mental illness, in which case it really isn’t anyone’s fault, but she should see someone about it.\n\nEdit: I meant the mental illness is no one’s fault, but I appreciate the comment spam and abusive PMs nonetheless.\n\nI have BPD and OCD, I know it’s the responsibility of the mentally ill to improve, but it’s not their fault they are mentally ill, which is what this comment meant.",
              "id": 4,
              "comments": [
                {
                  "score": 731,
                  "content": "Even if that's true then this should have been addressed when she was a child, and she should have seen a therapist, I honestly don't think it's likely this is anything other than bad parenting though.\n\nEdit: for the 50 people telling me you can have mental illness later in life: I know, and that's fair, OP's treatment of their kids in the present is more than enough to say their TA. If your kids has mental health issues and your solution is just avoid them, that's assholish behavior.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 220,
                      "content": "should have, would have, could have. Doesn't really matter. Address it now OP.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 195,
                      "content": "Not necessarily. I'm 1 out of 6 kids and I have one specific sibling who acts like OP's daughter. None of the other 5 of us act like that. I'm getting wary about going places with that sibling because they always end up either screaming at me or a stranger over something trivial.\n\nThe daughter is an adult. She needs to learn that if she can't control her behavior and act civilized, people won't want her around. It may be a harsh way of teaching that lesson, but at 24 years old, she's not going to learn it otherwise.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 162,
                      "content": "Maybe it’s not something that shows up at a younger age? I was always a bit of an anxious kid but it wasn’t till my very late teens early twenties that signs of my bipolar I kicked in. By then my parents couldn’t do jack, I kind of had to flounder along finding therapy and stuff on my own.\n\nBut this doesn’t sound mental illness-y I think she’s just one of those snappy bitchy people.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "Some mental illnesses can’t be diagnosed until yours 20s",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 38,
                      "content": "Yes, because EVERY mental illness gets diagnosed as a child of course. /s",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 27,
                      "content": "This could absolutely be a mental health problem. My daughter is 16 and is dealing with bipolar disorder. When she is depressed she lashes out is irritable and aggressive and just from the outside in is a complete intolerable asshole. She would go for the jugular and be completely vicious. That’s was her way of pushing people away. She would never accept blame or find fault in her behavior until she got treatment. Maybe your daughter is an asshole OP but maybe she is struggling and not getting the help she needs. People with bipolar 2 tend to sometimes get overlooked or not get diagnosed because they can function pretty well just struggle in life and relationships",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Not disagreeing with you, but in the past there was a massive stigma surrounding mental illness that prevented a lot of people from seeking help.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "In all fairness, some mental illnesses manifest later in life. My cousin was diagnosed with a mood disorder at 22 when her behavior completely changed. In fact, most mood disorders manifest in the late teens/early 20s.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "People don’t always have mental illness or symptoms from birth. It’s possible they can develop, or become more pronounced, in your later on like in your teens and 20s.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "My sister is extremely charismatic and was able to basically fool every therapist she ever had. After 18, you can't exactly force someone into therapy.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 123,
                  "content": "We've never truly been sure exactly what the problem is. I think it has more to do with her general life outlook and ideology than a mental illness, she she does have anger problems regardless.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 330,
                      "content": "OP, my sister has depression that manifests as irritability and sounds a bit like this. But with that being said, even though I am in the position of your sons, I think YTA. \n\nYeah, I've been bitter and angry and hurt over it and I have hoped she wouldn't be invited on certain trips, but my parents wouldn't display so much favoritism as to cut my sister out of a family vacation without so much as a conversation. That's awful. And again, I say that as someone in the position of your sons.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 56,
                      "content": "There is actually an entire category of mental illness that is defined as a general outlook or set of behaviors that consistently causes problems in life, and interpersonal problems with others.  \n\nBut, having said that, no matter what the diagnosis is  (or is not), this boils down to her BEHAVIOR causing problems.   She can feel as angry or upset or “I’m right” as she wants, but if she acts out in response to those feelings, you have every right to set limits about time together.  Not as a punishment, but because it’s the only healthy response to the situation.  And yes, she will most likely react really angrily to those limits.  Then you set exactly the same limit (“I understand you are feeling really angry at my choice, but if you are going to lash out at me instead of calmly talking, I’m going to stop interacting with you until you treat me appropriately.  Please let me know when you want to talk calmly, I’ll be right here when you do.”). Rinse and repeat.  Very hard to do?  Yes.  But logic won’t change her actions, only calm natural consequences.\n\nHard situation for the family, sorry.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 49,
                      "content": "I have a sister like this. As a teenager she developed a *furious* temper. Easy to set off, and she'll go zero to sixty in no time flat. Just utter *rage* over seemingly nothing. Like deep gutteral screams and slamming doors if she doesn't get the last slice of pizza, or someone playing a song on the radio that she doesn't like.\n\nThese kinds of outbursts never happened at school, or her jobs. She was a good student, and never got fired from a job. She maintained a social life, albeit it could be tumultuous at times. But all of this suggests that she could control her temper.\n\nShe can be perfectly lovely, and funny, and generous most of the time, like your daughter. She just has this absolute ***rage***, and you never know what's going to set her off.\n\nAfter she graduated college, she really wanted to move back in with my parents. My mom later related this story to me. She was frank with my sister and told her, \"You can move back in with us on the condition that you get on some sort of medication to stop being such a b*tch all the time.\"\n\nTo this day I don't know if she was diagnosed with something or what she takes, my family doesn't openly talk about mental health issues. But it worked, whatever she did.\n\nShe still has a temper. She still gets upset about innocuous things. But it's nowhere near as bad as it used to be.\n\nGet your daughter to a doctor. Your family shouldn't have to be constantly walking on eggshells around her.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "Early in my career I worked for several years with a woman who sounds much like your daughter. I was just out of school, so I didn't understand it at the time, but years later I realized she was suffering from depression of some kind.\n\nSadly, I learned she died a year ago due to complications from alcoholism. (another sign of depression was that she was self-medicating)\n\nI'm no expert, but anger issues to the degree that they negatively affect one's social life with their own family are certainly a sign of something. She's an adult now, but insofar as you have any \"pull\" with her at all, I'd use it to get her to a doctor, therapy, etc... and see if she can't get help adjusting this behavior before too much more of her life goes by.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "Did you bother to try and find out?",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "[deleted]",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "Maybe you should ask a professional. The fact that she might not have a mental illness doesn't mean she doesn't need help.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Seriously, look up IED, intermittent explosive disorder. I know you can't diagnose someone on the internet, but the way you describe her attacks sounds like the damn calling card of the disorder, especially since trying to contain it just escalates it.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "She sounds like my mother. Both my brother and I have gone to therapy for our own things and both of our therapists have said it sounds like Borderline Personality Disorder. But it’s not confirmed because she won’t go to therapy because she has no problems and is always right about everything apparently",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "So either it's the parents' fault or no-one's fault, but under no circumstances is this 24 year old woman's toxic behaviour her own fault?",
                  "id": 26,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Agreed, being a pain to be around is only her fault and causing her family to be miserable should have consequences, if nothing else it would be a wake up call to change, but she has to want to change",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Being a rude brat is not a mental illness. We need to stop making excuses for people like this.",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Okay, I hope I don’t get downvoted too harshly for this, because this comes from a genuine place. Why is “mental illness” a common suspect and pint on Reddit more than any other place. I understand d this isn’t directly helping OP or the issue but this is more a curiosity thing than anything. Maybe I’m ignorant but this seems almost entirely like a combination of a parenting fault and a character flaw. She seems overly aggressive, nit picky and just overall bratty, but this I would assume would stem from attitude. Where does mental illness come from? Seriously, again I’m being genuine and skeptical, not confrontational but where in OPs post is there context that implies mental illness more than general character flaws and parenting mistakes which makes sense. Often times it’s the simplest or most common solution instead of the more intricate, more rare answer.\n\nI really don’t mean to discredit any suggestion that sure a mental illness could be on the table, anything’s possible. But I think things should be treated progressionally I guess? Where the most common solution is the most likely solution. Then if that doesn’t help anything then you progress to the next thing. I swear there’s a word for this in medical diagnoses where it’s assumed to be s common disease before it’s something more serious or more rare. \n\nI only really comment on this because I see this on reddit all the time where the more unlikely or the more catching solutions are thrown out before the more practical solution, which in this particular instance I imagine bad parenting, developing bad attitude, no reinforcement on negative behavior, are all more practical answers. Especially since context of OPs perspective supports each of these thoughts. Mental Illness isn’t the first to jump to mind with attitude problems in my opinion. Character flaws jump to mind. And I’m not going to theorize because I’m no medical professional or psychologist but what mental illness would even be implied for the context above? Is narcissism considered a disorder? I feel it is at some point but that’s a stretch. Anger management seems like a stretch too. \n\nAgain I really don’t mean to write off mental illnesses I’m just confused why this seems to be offered as a seemingly more likely cause before standard behavioral/parental/integral flaws credited to OP or her daughter. Just confused and curious is all.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "She could just be an asshole.",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Honestly, she sounds a lot like my sister, who has a Personality Disorder. My brother and I used to refer to her as an emotional terrorist. OP is NTA, that kind of shit is exhausting.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I’m surprised no one has suggested Antisocial Personality Disorder for the daughter. I don’t want to diagnose people on the internet but... ESH.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Not everything’s a mental illness. ~~some people~~ most people are shitty people.",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 212,
              "content": "Um, no. You can be a great parent and your kid can still be an asshole",
              "id": 34,
              "comments": [
                {
                  "score": 48,
                  "content": "You can be, I don't think that's what happened though, look at their comments about how they address it with their child, they don't want to talk their daughter because she wouldn't take it well it. That is not a comment a good parent makes. I'm not entirely sure that the daughter is even in the wrong at all, because the accusations of the rest of her family being lazy and irresponsible might actually be true.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 76,
                      "content": "[deleted]",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "True or not, that's no excuse to treat people like shit.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "different children have different needs and so the same parenting style that works wonders on one kid can be completely ineffective at parenting the next one.  I'm not saying OP is a bad parent; I'm just saying that one kid turning out well is not indicative.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Op says elsewhere they’ve tried so many things, therapy, included. They’ve talked about it many times and all that happens is she becomes angry and combative. There’s not much else you can do when someone won’t admit they’re not well.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 97,
              "content": "Its really a common trope that stuff like this is the fault of the parents, but psychiatrists mostly will disagree with that. That kind of behavior is the type of behavior she would more likely learn from friends and social circles or even media. It seems like she has the view that she is some super hard working person and everyone around her is lazy and makes excuses for their laziness, so she feels the need to denigrate them. Maybe she developed this superiority complex when she went to school or something, but I doubt she learned it from home, especially considering everyone else in the family seems to be fine, normal people. \n\nI've seen lots of kids who are just flat out cruel towards people they deem 'lesser' than them, even their own family. Its rarely the families fault.",
              "id": 40,
              "comments": [
                {
                  "score": 88,
                  "content": "Well it did mostly start in her late teens, but its escalated in her college years. By then she was halfway across the country.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "loooooooool dude it does not work that way. There are tons of kids who should be tossed into a wood chipper who have nothing but the nicest parents. Personality is largely genetic. If you don't know any sweet couples with shithead kids you need to get out more.\n\nNTA",
              "id": 42,
              "comments": [
                {
                  "score": 14,
                  "content": "I'm not suggesting that all people who are bad have bad parents, additionally, being a sweet couple doesn't make you a good set of parents. I'm talking about this person in particular, who's commented multiple times, they are non-confrontational, they seem to rollover when pressured, and they have a defeatist attitude when it comes to their kids.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Wouldn't you have a defeatist attitude towards your child if, after years and years of discussing the issue, nothing had changed and you now had to consider shutting them out in order to preserve your own sanity and that of your other children?",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "\"personality is largely genetic\"\n\nWoah.. I'm gonna need some blue underlined text on that one",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "[deleted]",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Also, don't you think she's gonna be pissed when  she finds out? You're not avoiding her anger, you're delaying it.",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Not all good parents are rewarded with good kids. I’ve seen siblings who were raised identically turn out like night and day. Parenting isn’t always to blame for bad people.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "What do you want to bet that she in some way feels like OP favors her siblings in some way (and may or may not be right) and that's a not insignificant part of it",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "No. Not this. Just ignore the problem, I’m sure it will go away on it’s own. /s",
              "id": 50,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "I’m gonna add that you sure are good at/quick to point out your daughters character flaws in an unkind way.... wonder where she gets it from?",
              "id": 51,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 279,
          "content": "We tried to get her into therapy when she was in her teens and she just completely rejected the idea of it. Eventually, she 'gave in' and told us she was going, only for us to find out she was lying to us and wasn't going at all. Even the recommendation of therapy to her would make her be upset, because to her she, she can't comprehend that she is ever wrong or acting badly. Just an example, the story I said about my son leaving the blanket on the couch? If we brought up how bad she was acting, she would just say we are just trying to defend our own irresponsibility or laziness. We've tried a lot of methods to help her understand why this stuff is hurtful, but this behavior only really developed in her late teens and by then she was nearly on her way to college.",
          "id": 52,
          "comments": [
            {
              "score": 269,
              "content": "Why don't you make this clear to her and say that her behavior pushes people away and that you don't want that on your trip rather than just ghosting her?",
              "id": 53,
              "comments": [
                {
                  "score": 81,
                  "content": "If she finds out and asks why we didn't invite her, we will explain why. But we aren't going to specifically go to her and explain why we aren't inviting her. Its a quick way to make her hate us. My sons were a bit more pushing for the \"dont ever tell her anything and lie if she ever brings it up\" but I'm not entirely sure about that. \n\n&#x200B;\n\nShe mostly knows how we feel about her behavior. But its really, really hard telling your own daughter that her own family doesn't want her on vacation, and for both our sakes, I do hope she never finds out.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 390,
                      "content": ">Its a quick way to make her hate us.\n\nHow many times have you avoided disciplining your daughter in the past for this reason?\n\nYou come off as having been scared of your daughter since she was a teenager. It's, sorry to say, quite pathetic. You're supposed to be smarter, wiser, more experienced than your children. What the hell happened? Why can't you defend your sons against her?",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 58,
                      "content": ">If she finds out and asks why we didn't invite her, we will explain why.\n\nAnd this is why YTA. Because doing it this way is behind her back.\n\n>But we aren't going to specifically go to her and explain why we aren't inviting her.\n\nInstead of doing that, invite her and say that you don't want that behavior on the trip and make it clear that you won't tolerate it and won't invite her again if she behaves that way.\n\n>My sons were a bit more pushing for the \"dont ever tell her anything and lie if she ever brings it up\" but I'm not entirely sure about that.\n\nYour sons are young, and you giving into their wishes so easily is probably why you have a tempermental daughter.\n\n>But its really, really hard telling your own daughter that her own family doesn't want her on vacation, and for both our sakes, I do hope she never finds out.\n\nYeah because it seems like you've never wanted to address her bad behavior. I have almost no information of the situation, so you can't really trust my opinion, but I honestly doubt that the way you've handled this is isolated to this incident.",
                      "id": 56,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 56,
                      "content": "By your sons' reactions and the way they tip-toe around her, it seems as if their relationship with their sister borders on abusive. I would be very upset to see someone talking to my children that way and if it were my daughter, I would really try to shut that shit down. I would honestly tell her that it is no longer acceptable, whether she thinks it is justified or not. She can either get therapy, learn to keep her mouth shut, or stay away.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Totally NTA \nShe’s an adult, your sons are adults you’re a bunch of adults having a holiday together. So what if she finds out ? Go and actually enjoy the company of people you enjoy being around. My mums last holiday before she died was with my two brothers, I was too broke to join them and I’m still sad I didn’t make it . But I don’t blame anyone. It’s life . If you feel like spending time with her why not go to a show together or a meal just you and her , have some mum and daughter time . You don’t have to defend yourself to anyone.  You’re not delaying an argument if you decide not to tolerate an argument.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Expect her to find out. Someone is gonna post on social media I'm sure. This is definitely a case of asking for forgiveness, rather than permission. Do you think she'll be more mad that you had a great time without her, or that you're going to have a great time without her? From the outbursts you mention, it will be the same. She will abuse you and scream and yell and tell you how horrible you are no matter when she finds out. Be a woman, be her mother, sit her down and tell her exactly why you don't want her coming. That her behavior is unacceptable and then take the hate that comes your way. She'll be mad for awhile, then she'll either come to the realization that her family can't tolerate her, and do something about it. Or she'll be a mostly miserable person who will never change.",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "Hijacking this comment thread so that maybe you will actually see this. Obviously I am not a doctor, but a lot of people mentioned mental illness and depression. And depression can cause anger. But I would do your own research on borderline personality disorder. I struggle with it every single day and it sounds very similar to your daughter. I know you've said you've had conversations about her behaviour with her before but you need to do it again. And leaving her out of a vacation is a perfect way to bring it up and have a consequence she can actually feel. If you talk to her again, before the trip. Her bad behavior (and inability to control her feelings) will have the direct consequence of you going without her. If she does have bpd or other mental illness boundaries are incredibly important. You and the rest of your family are not obligated to spend time with her if she is always being an asshole. Family or not toxic behavior is only allowed, because you allow it. I think you as a family should have done a lot more about her behaviour when she was younger definitely not off the hook. But she's an adult and sick or not sick her bad behavior is literally pushing her family away and this a perfect way to show actual consequences for not trying to change. That being said people don't change overnight. Have this be a lesson and give her chances to work on changing. Ywbta for going without her and not telling her exactly why before hand.",
              "id": 60,
              "comments": [
                {
                  "score": 5,
                  "content": "I'd also suggest you do some research into sensory processing disorder, which therapists often don't consider unless a person is quite young, has autism, or actually reports sensory challenges... Which a lot of people would never think to do because most people assume their physical experience of the world is the norm.\n\nI behaved exactly like your daughter for years in spite of therapy, discipline, heartfelt conversations, and other efforts on my parents' parts. Finally realizing I was lashing out as a response to overstimulation was life-changing.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I had no idea this was a thing. Not diagnosing myself, but the description I just read of the \"sensory over-responsivity\" sounds very familiar. I often tell my husband I'm having one of my \"weird sensory things\" when I need him to help me bail on a situation or when I'm explaining why I don't want to eat/smell/listen to/taste/touch something.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I see what you’re saying but I don’t understand why people keep bringing this up. Does this mean if a person isn’t wonderful to be around that they have depression or a disorder? To me it seems like some people are just naturally abusive jerks rather than have mental problems.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 5,
                      "content": "That's definitely possible not all assholes are sick. But usually there is some kind of reason why they are being an asshole. Completely exploding over very minute things is a form of neuroticism and I was only relating as I suffer from BPD and it takes so much effort to relearn how to control your emotions that normal people take for granted.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "So you're saying nothing has been done? Was there consequences for not going to therapy? No loss of privileges when her temper tantrums happened? No putting the foot down and saying \"you do NOT speak to us this way and this will now happen\"? You're not the ass for not inviting her but you might be the ass if you didn't have hard and fast consequences while she was still under 18. Maybe you did and she's one of those people with issues like narcissism that makes it almost impossible to get them help. \n\nIf she does get pissed about not being invited (and I'm sure she will) just tell her this is one of those consequences of not controlling her temper better. That the family actually doesn't care to be around her anymore. She can either find help for herself or get used to missing out on certain family events. \n\nNTA",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Thats when you as the parent shouldve made sure she went while she was under your roof. You say you tried and later found out she wasnt going, but why werent YOU going with her. You cant just dump therapy on a kid and expect them to take it seriously.",
              "id": 66,
              "comments": [
                {
                  "score": 19,
                  "content": "This is just changing the goal posts now. They tried to get her into therapy. They failed, now suddenly its \"you should have been going to therapy with her\"?",
                  "id": 67,
                  "comments": [
                    {
                      "score": 13,
                      "content": "They didn't try very hard if they weren't taking her there and took forever to realize she wasn't even going.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Um she said something about therapy and i gave my thoughts on it. I was pointing out that the behavior shes complaining about should have been taken care of while she was younger. Does the family have a right to leave her out of the trip? Yes. But they are all adults and should act like it.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Did she ever has consequences for \\*any\\* of her actions? Like lying to you about going some where? Do you realize you're the parent and could have dropped her off and made sure she went?",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "How did you just let her get away with “not going”, you were the parent, right? You had the right and ability to take her in to the office yourself.\n\nAs a psychiatrist myself, whenever I hear this excuse it’s always one of these that actually happened- you never mentioned going to therapy at all, or you mentioned it and she said “no” and that was the end of discussion.\n\nIf you wanted her to get help you would of made sure she would of gotten help.",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "...Why did you give her a choice in the matter?",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": ">Little brothers can be pains - even at that age\n\nThose little brothers are grown-ass adults. She has no business ordering them around. \n\nNow I do think that, if the OP wants a family vacay, then all of the family should be invited including this asshole daughter. So I agree, OP should sit down and set some boundaries. \"You don't get to parent your adult brothers.\" I'm go along with ESH.",
          "id": 73,
          "comments": [
            {
              "score": 8,
              "content": "Yeah, wtf is up with blaming these unknown characters just because they are younger brothers??",
              "id": 74,
              "comments": [
                {
                  "score": 2,
                  "content": "Sexism.",
                  "id": 75,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I really want to hear Laura's side of this one.",
          "id": 76,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "This does not sound like a temper problem. This is mental illness. My \\[bipolar\\] dad is like this, and I \\[clinical depression\\] used to be this way before I got the right meds for my illness. You can't rationalize with someone living in their own reality.\n\n  \nETA: Get her a doctor's appointment and a therapist to do a mental health evaluation. It doesn't have to be like this.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Ok. What if that doesn’t work? Should she subject herself  to angry outbursts at the sake of her well being.? Well being meaning, happy down time. The daughter is 24. She will figure it out eventually when the family stops including her. NTA.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I’m also guessing she can dish it out hard core, but if she even got a fraction of it back she would collapse in her insecurities. This screams someone who would get defensive over the smallest Criticism and that is why they are so harsh to everyone else.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Um, fuck this shit.  NTA by a mile.  Yeah they need to talk to her, but have probably tried with disastrous results.  Ultimately people are responsible for their own behavior.",
          "id": 80,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Agreed - you can't just let your kid barrel along with their shitty behaviour without saying anything, and then cut them off for shitty behaviour when it suits you!\n\nThis behaviour should have been addressed *years* ago!  so I agree ESH.\n\nOP, you need to sit your daughter down and have the conversation with her that you've been putting off for the last XYZ years.  Her behaviour means you don't want to spend time with her.  Not that you don't love her or want to spend time *her* as a person, but her behaviour, which she is in control of, makes her difficult to be around.  Parenting means having the hard conversations - and you really should have had this one years ago, but hey ho.  \n\nHave the conversation - think about counselling/family therapy.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1757,
      "content": "INFO: what have you done throughout your daughter’s life to address these issues? Did you ever get her therapy, or set clear boundaries about her behavior with punishments? Does she have any idea you feel this way about her?",
      "id": 82,
      "comments": [
        {
          "score": 1071,
          "content": "Tried to get her into therapy, didn't work. She doesn't really comprehend that she is wrong on any of these things, so its hard to convince her she needs therapy for something she doesn't even view as bad.",
          "id": 83,
          "comments": [
            {
              "score": 715,
              "content": "Some people don’t comprehend that people can just be assholes. No matter how good of a parent you were or how hard you try to fix it, it’s just not possible to correct.",
              "id": 84,
              "comments": [
                {
                  "score": 140,
                  "content": "A lot of people also do stop being assholes",
                  "id": 85,
                  "comments": [
                    {
                      "score": 100,
                      "content": "You think so? They tried to put her in therapy and she refused. Granted, she may have enabled some of the bad behavior but in my experience most people don’t change a whole lot once they are adults.",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 41,
                      "content": "She sounds like a bullying narcissist with a superiority complex over her own family. Good luck getting her to stop.",
                      "id": 87,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 30,
                      "content": "Often that doesn't happen until they're able to do the math and realize their assholeish behavior has tangible consequences -- like not being invited on vacations.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "Some people think therapy is a magic thing that solves it all or like taking pain killers for a headache.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 50,
                      "content": "You have to want therapy for it to work. This girl doesn’t think she needs therapy.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "> taking pain killers for a headache.\n\nThat's exactly like therapy though, in that it only works sometimes and often it just buys you some comfortable room while you work on the underlying problem.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Sounds like a “we tried nothing and are all out of options” situation",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Is Mom trying to fix it through? It doesn’t sound like even the most basic “please lower your voice you are disrupting the entire house and making everyone uncomfortable” is even happening here.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "> No matter how good of a parent you were or how hard you try to fix it, it’s just not possible to correct\n\nYeh, that's just not true.",
                  "id": 94,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 124,
              "content": "Communicating clearly to her that you've chosen to go on vacation without her might be a strong step toward  convincing her that her behavior is inappropriate. If you've gotten into the habit of dodging confrontation with her over her unpleasant behavior, that's likely only reinforcing her view that her behavior is acceptable.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 116,
              "content": "INFO: Has she ever had to be responsible for her younger brothers? Like maybe you and your husband were at work so she had to keep an eye on them until you get home or sometimes you were away for a day and she had to watch them? Because if she had to be the \"grown up\" from a young age (as many oldest siblings) she might have simply never left that mentality of being the strict sibling. That could be a huge part of why she act the way she does.",
              "id": 96,
              "comments": [
                {
                  "score": 107,
                  "content": "Not that I can think of, no. I mean obviously a small handful of times when they were really young. \n\nHer behavior is not only aimed at her brothers. She has done it to boyfriends and friends and cousins and even us.",
                  "id": 97,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 96,
                  "content": "My thought was, who would get in trouble if dishes were left in the sink or blankets out when growing up?  The one who left it out, all three equally, or her because she's the older? IDK.  But the examples in the post seem to highlight she's getting upset about clutter or light untidyness.  Maybe there is a reason she flips out about these kinds of things.  Maybe not.  But that was my first thought.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "INFO: At what age did you try to get her into therapy? Surely these issues must have been apparent before she was old enough to be able to refuse?",
              "id": 99,
              "comments": [
                {
                  "score": 3,
                  "content": "You can refuse at any age. Your parents take you, you just don't participate.\n\nYou can lead a horse to water...",
                  "id": 100,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "She sounds like a shitty person tbh",
              "id": 101,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "If you want her in your life you need to be calling out this behavior as inappropriate and bad manners. Or, in the case of her brother missing dinner; not her business.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "You need to be firmer with her. Speak to her about this holiday and give her the ultimatum. Show her this post if you think it’ll help but she needs to understand you’re not alone in these feelings towards her if she is to change. If she hears one person backing her side she will continue to refuse she’s in the wrong.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "She sounds like a narcissist.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "At what age? It sounds like she has been this way since she was a child. Back then you could have done something about it. By the time she was a teen, it’s too late.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 93,
          "content": "I agree these are important points, but as someone who has someone like this in my life, it's not always that simple.  My brother has very similar qualities to Laura's.  My parents put him in therapy as a kid and we even all went to family therapy.  I do think it's been beneficial for him internally, but it has only made the interactions worse.  Basically, all therapy did for him is concrete the idea of \"I am who I am, take it or leave it\" into his head and it actually made him a lot less tolerant when things don't go the way he think they should.  He just leaves situations that \"trigger\" him and leaves the people around him questioning what they did wrong.  He isn't open to discussing it because he believes that anyone who wants to talk it out doesn't accept him for who he is and wants to change him, when in reality we just want to talk it out and find out what upset him so much.  Maybe it was a shitty therapist, I don't know, but I know my parents did everything they could try to to correct his behavior growing up and he still acts the same way, maybe even slightly worse, at 40.",
          "id": 106,
          "comments": [
            {
              "score": 26,
              "content": "Did he get diagnosed with something? That does sound like shitty therapist",
              "id": 107,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "I am wondering the exact same things. OP doesn't sound like a parent who has tried to take the necessary steps to treat this behaviour, rather she sounds like one of the children who is scared of their sister. Therefore I am inclined to think OP is TA.",
          "id": 108,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 58,
          "content": "Yeah, I'm a little confused as to how the OP seems to completely distance herself from her daughter's behavior. That kind of anger over small things suggest a much larger problem...one that probably calls for some level of therapy.",
          "id": 109,
          "comments": [
            {
              "score": 24,
              "content": "How many of you have grown children? You can’t always fix them.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1501,
      "content": "YTA. Not for going without her, but for not telling her and, what, hoping she doesn't find out? Her feelings are, rightfully, going to be hurt. \n\nYou don't have to bring her, but you do need to talk to her. If there's a way you can do something with just her to make up for it, even better.",
      "id": 111,
      "comments": [
        {
          "score": 643,
          "content": "I agree. Don't invite her but don't hide it either.  Make it clear what behavior is so intolerable that she is no longer welcome. Give her a chance to grow and improve before next year.",
          "id": 112,
          "comments": [
            {
              "score": 189,
              "content": "This is the best advice I’ve seen.\n\nOP says she’s tried speaking with her about her behavior and it didn’t work? I bet this will go a lot farther.\n\nLet her know they’re going and nobody wants her there because of her behavior. Do not argue with her about it, and if she wants to pick a fight say ‘this is why you are not welcome’ and hang up. Don’t let her think she can argue her way out of this, shutting her down will drive the point home that this behavior is no longer going to be tolerated by anyone. And then stick to that.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "Yes, you want an enjoyable vacation without her but you should tell her before it happens so she's not blindsided.  Either way, she's going to be hurt but it's best to let her know before.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "This. OP shouldn’t let it devolve into an argument, either. Tell her you’re going but she’s not invited and why. Don’t get dragged into a back and forth. Say your piece then end the conversation. If you let her, she will demand examples of her bad behavior then defend each one point by point, leaving everyone annoyed and frustrated. \n\nI would also suggest OP outline some clear opportunities for daughter to earn her invitation next time. Like she’s expected to behave herself when they get together for Thanksgiving and Christmas, etc.  If she can maintain an inoffensive demeanor during these family gatherings, then she’s shown herself to be capable of change. If she can’t, then the family will continue to make plans without her.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "Agree with everything except for:\n\n> If there's a way you can do something with just her to make up for it, even better. \n\nDon't do that. She needs to actually experience the consequences of her actions.",
          "id": 116,
          "comments": [
            {
              "score": 2,
              "content": "Yep.  There is no point in excluding her if she just gets a private vacation latere",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Dont you think it's also unfair to them? Their feelings get hurt just as much, maybe even more when she demeans them and insults them. You're only seeing one side of the story my friend.",
          "id": 118,
          "comments": [
            {
              "score": 13,
              "content": "Their feelings would be totally valid if they weren't the ones who created her. Like, if this was the brothers posting it would be a hard not asshole, but since OP is at the very least partly responsible for their daughter's behavior, they don't really get to disavow her like that.",
              "id": 119,
              "comments": [
                {
                  "score": 8,
                  "content": "It's not always the parents. It could be their friends and the environment they grew up in at school. I've personally seen a lot of kids in my school that have really known respectable parents and the kids turned out to be drug addicts cause their friends wanted them to \"try something new\". I think it's really unfair if you blame it on the parents all the time, it could be from other things.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "This sounds an awful lot like victim blaming, my friend. It sounds like she’s abusing them if even her own parents are too afraid to stand up to her.",
                  "id": 121,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "She’s a 25 year old woman. She can check herself.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1029,
      "content": "ESH. Your daughter sounds like a nightmare. A nightmare that you've enabled. If you're considering not telling her that you're going on vacation, my guess is that the way you've dealt with her to this point is by avoiding conflict rather than confronting her attitude. That's not fair to any of you, her included. It sounds like she needs therapy. If she treats you all like this, chances are it bleeds into other parts of her life.\n\nYou're definitely not TA for not wanting her on your trip, but maybe telling her point blank that she isn't welcome unless she can control herself is a better strategy.",
      "id": 123,
      "comments": [
        {
          "score": 190,
          "content": "This is so important. The fact that you’re going out of your way to avoid speaking to your adult daughter about her rude behavior speaks volumes. I get that you can’t be 100% responsible for how your kids end up as adults- so many outside influences to counter and consider, plus genetics, etc. So it may not be totally your fault she’s an asshole but this is the opposite of how you handle a situation like this. You’re doing your daughter a huge disservice by not telling her “we’re going on vacation without you because you need to learn to control your crappy attitude”. Hell, send it in an email so you don’t have to deal with the initial tantrum. Vote- ESH but you’re definitely an asshole for sneaking around.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "and what do they think the reaction is going to be when she finds out she's not coming? it'll be another nightmare.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I think youre right but also that she would just agree and then continue to act that way. Making the trip a constant battle. Definitely tell her but dont have to invite her still.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This exactlyyy this.\n\nHer bratty behavior didn't come out of nowhere.  It sounds like the whole family just tip toes around her moods instead of setting boundaries and telling her to can it when she's being a jerk",
          "id": 127,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 409,
      "content": "YTA The examples you've provided scream of repeating learnt patterns - sounds like she's behaving the way she's learnt from her parents. \n\nThat being said, excluding just one child because you don't like the way you've raised her is pretty asshole behaviour.",
      "id": 128,
      "comments": [
        {
          "score": 272,
          "content": "Blaming this entirely on the parents doesn't sound right, considering everyone else in the family is apparently fine. My guess is a mental disorder of some sort. \n\nIf this was learned behavior, and the parents are the same way, then the sons wouldn't be wanting to go with the parents either. Its possible its learned behavior from her *friends* however. I've met perfectly sweet people with good parents turn into absolute monsters because they fell into the wrong crowd in school and never looked back.",
          "id": 129,
          "comments": [
            {
              "score": 3,
              "content": "I think a super important factor would be to get her diagnosed. If it is depression like a lot of people are suggesting, it would be a step in the right direction to get her help. However, if it turns out to be narcism, they have a very good reason to leave her out of things, as my psychology professor said one of the only times he gave up on working with a patient was when they were so narcissistic that they couldn’t recognize they had a problem, and therefore didn’t want help. Reading the comments makes it sound more like the latter, and if that’s true then she would be too toxic to let her be around the family very much, and you would have a solid reason to tell her she’s not invited to stuff, because she’s narcissistic and won’t get help.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 147,
          "content": "Ah yes the ole reddit blame-the-parents-for-everything\n\nTbh, she sounds like the type of girl who got in with the popular kids at school and learned more from them. The behavior she is exhibiting doesn't sound like something you learn from your parents, it sounds like something she learned from watching Regina George in Mean Girls too many times.",
          "id": 131,
          "comments": [
            {
              "score": 5,
              "content": "The daughter sounds like a textbook narcissist so I’m not surprised the majority here are falling for her schtick.",
              "id": 132,
              "comments": [
                {
                  "score": 3,
                  "content": "Tbh they're probably narcissists themselves and see themselves in the daughter. The goal post moving and mental gymnastics is insane.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 41,
          "content": "Maybe the daughter is just a giant entitled jackass? Not everything can or should be attributed to mental illness. \n\nThe mother managed to raise two sons that seem okay. Why blame it all on her?",
          "id": 134,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "Humans could land on mars with one leap if we jumped as fast as you jump to conclusions.",
          "id": 135,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "Well, the brothers seem rational, why can't the sister be?",
          "id": 136,
          "comments": [
            {
              "score": 2,
              "content": "Some people raise their sons fifferently than their daughters, some people are stricter woth the eldest than the younger oned... we can't know.",
              "id": 137,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Are we going to ignore the fact she’s 24 and is acting like a 13 year old girl? Orrrrrr",
          "id": 138,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "I think what she learned is that people back down from her raging assholery. I doubt she is modeling behavior she sees in her parents",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Why does reddit always encourages people to go no contact with asshole parents, but then hates on parents for wanting to exclude asshole offspring?",
          "id": 140,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "These are not children, they are adults, and no one wants to spend their vacation time with a assault who can't control their temper.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 242,
      "content": "YTA. I get your feelings, I really do. I am only thinking of all the ways the shit could hit the fan. You’re not going to post any pictures of this trip where she can see them? You have a blood pact with your sons to never mention this trip in her presence? I think you’d be better off communicating with her why she’s not invited. If you don’t, she’ll always be the same.",
      "id": 142,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 159,
      "content": "NTA\n\nAt some point I feel like these kinds of people need situations like this to realize that they're not enjoyable to be around. \n\nMy brother is very similar to this.  If something doesn't go the way he thinks it should, he can just get plain nasty.  It often starts with small, playful jabs, so it's like he thinks the playful spin he tries (and fails) to put on it makes it ok to berate people.  If someone defends themselves (even if they keep it in a light, playful manner) it just escalates, he loses his shit and often storms out like a kid having a temper tantrum (he's 40) and leaves.  He's ruined almost every major holiday (Christmas, Thanksgiving, etc.  I'm from the US so I'm not referring to vacation when I say \"holiday\") for us this way.  My dad, brother and I don't typically let it get to us, but it really bothers my mom and she usually ends up crying over it and it just puts a damper on quality family time.  We got sick of it so we just stopped inviting him to small random gatherings we decide to have.  We don't exclude him for holidays, that seems cruel but we don't include him for the random gatherings.\n\nIt just stinks being around these people sometimes.  It doesn't mean you don't love them, but it's exhausting trying to keep up with their unrealistic expectations, especially when it's a vacation and you should be relaxing and enjoying yourself. (Sorry, pressed post by mistake before I was done lol)",
      "id": 143,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 133,
      "content": "I’m going to go against the majority and say NTA. I see a lot of people saying these are learned behaviors and I disagree. I have a sister like Laura. She’s mean and blows up at minor things every single day. She’s been in therapy for years and my parents have done their best to try and help her see why what she’s doing isn’t fair. Growing up, they had hour long conversations with her every other day, but she remained cruel. And just like Laura, she was vivacious and friendly at first and people loved her. Then when they saw what she could be like (i.e. selfish) they would come to me and ask what was wrong. Much like your sons, I don’t speak with my sister. When she is there I’m civil but I don’t engage with her more than polite small talk. I don’t think you should punish your sons and yourself because of how Laura behaves. Should you tell her? Probably. Do I think you should? No. But I also get that not many people will understand where you’re coming from because they haven’t seen the true horror of someone who behaves this way. \n\nTherapy may not be helpful if you’re not addressing the primary problem. To me, someone who is NOT a psychiatrist, I would look into personality disorders. Specifically Histrionic disorder (which is argued about whether it is a separate disorder) and borderline personality disorder. These both seem to fit what you’ve described for Laura. I want to make clear Laura needs to be evaluated by a trained professional before you go throwing those labels around. And I also think it’s important to note that personality disorders can be managed, but that they often describe an individual’s personality and thus can’t be changed. \n\nI wish you luck OP. I know what it’s like to be in your son’s position as a siblings but I don’t know what it’s like to be in yours as a parent. My parents are hurt every day by my sister’s selfishness and the realization she will never be a kind nor loving person to them.",
      "id": 144,
      "comments": [
        {
          "score": 38,
          "content": "I have experienced a person like this. NTA but do ANYTHING you can to address or correct her behavior problems before she has your grandchildren and they become her weapons.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I agree with you. I don’t know why everyone here is so keen to stand up for abusive behavior. I have a cousin like this and it’s miserable to be around. I wish the family would cut them out, but they continue to enable.",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I've experienced and continue to experience a person like this. Very likely Borderline personality disorder, I am not a licensed professional though. If she refuses to go to therapy it's not a bad idea for your family to go to therapy to learn tools on how to behave around her so you don't get caught up in her mania.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 91,
      "content": "ESH \n\nYou all for not talking to her and being ready to hide this forever, and her for being a brat. I'm not relieving your of parental blame either, her attitude is a product of her upbringing, be it something learned, or a condition that went un cared for. \n\nThat out of the way, I totally understand your not wanting to take her! Honestly, I wouldnt want to either, vacations are meant to be peaceful and enjoyed. \n\nThis is complicated, and for the reasons above I think you owe it to her to be honest about her attitude and the weight that is on you all because of it. She may be mad or unhappy, but if you dont help her fix it sopn, you'll always **deal** with her instead of just **love** her. \n\nMaybe the vacation would be the best time to do this.",
      "id": 148,
      "comments": [
        {
          "score": 8,
          "content": "I mean per OPs comments she doesn’t believe she has done anything wrong. So unless she can be shamed into seeing the light I don’t see her thinking there’s anything to fix. This type of behavior isn’t something they can force her into getting help for. She’s 24, they can’t force her into therapy. Likely she’ll get pissed and find any excuse except her shitty behavior as to why shes not invited. Personally I still think that she should be told they’re going and why she cannot, however I don’t think that will change anything.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 87,
      "content": "I disagree with almost everybody.  There are consequences to \"being right\" all the time.  If your whole family feels you will ruin a vacation, you are the asshole.  She has alienated her family and she is an adult.  What if her parents did her a disservice?  None of her friends or colleagues have corrected her?  A parent can't be everything, and every parent has failures.  It's her life now, and she seems to feel like her need to berate people is more important than harmony in the family.  Sorry it has consequences.",
      "id": 150,
      "comments": [
        {
          "score": 22,
          "content": "going on vacation without her and hiding it is not a consequence.  telling her she's not welcome because of her poor attitude and outbursts would be a consequence.",
          "id": 151,
          "comments": [
            {
              "score": 6,
              "content": "[deleted]",
              "id": 152,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}