{
  "post content": "My women in stem group is sponsored by the company. We invite both men and women to join. There’s a part of the business called AI that is booming over the pandemic and lots of people are wondering about job opportunities in our department. Because of this, two girls who run the women in stem group thought it would be a good idea to have a series of “a day in the life” sessions.\n\nThe first session covered manufacturing and two girls who work in that group presented their jobs. The session was a big hit (lots of executives joined, and we had over 150 ppl on the call!) and at the end they sent a survey out asking what people would like to hear next. My group is marketing and had the most interest. \n\nNow my group is relatively small. There are 6 people total and I’m the only girl. So It made sense that the organizers immediately reached out to me to ask if I’d do it  and I said sure- I’d love to present. \n\nUnbeknownst to me, my male, white, roughly 45 year old boss (who SAYS he’s participates in our women in stem group for 10 years, but I never see him at any events...) reaches out a few days later to the organizers and volunteered himself to do the presentation. Queue the awkward moment where the organizers reached back out to me and asked if I’d be willing to tag team with my male boss.\n\nThis is where i may be the a**hole (and my husband is saying I would be)- but i had already planned to reach out to one of the executive girls who is no longer in my group, but covered it for 8 years prior, to tag team with me. I thought it would be a great way for (1) me to network with this successful female and (2) for a successful female to showcase their progression from the group. I want to ask my male boss NOT to present with me. i talked to my husband and said it was just so odd that my boss, who manages the ONLY female in the group, reached out to present it himself rather reach out to me and see if I’d be willing. But my husband is saying he’s part of the group and he should have just as much of a “right” to present as I do. \n\nWIBTA if I asked him to bug off? The entire purpose in my mind of the women in stem group is to boost representation of females in the company. Doesn’t a male presuming he is best fit to present the topic defeat the purpose? The series is getting a lot of executive attention and would be a great place to showcase the females actually working in their space.",
  "id": 1,
  "comments": [
    {
      "score": 5787,
      "content": "NTA - It drives me mad when there are panels or steering groups which are ostensibly geared towards promoting under represented groups in that field but have people who are not part of that group.\n\nIt’s also telling that he only gets involved in the group when he gets to be the centre of attention.",
      "id": 2,
      "comments": [
        {
          "score": 2075,
          "content": "I think it’s important to have allies in non underrepresented groups because obviously to have more representation you need to have other allies as well. But it did strike me personally as odd that he would take it on himself to reach out. Especially since he didn’t know that marketing was “up next” because the organizers hadn’t made any announcements about it. They had just reached out to me first.",
          "id": 3,
          "comments": [
            {
              "score": 962,
              "content": "Yeah, it's extremely odd that he would reach out to them and not mention you at all. I think probably your best course of action is to reach out to the steering committee and tell them what you had planned, offer the alternative of presenting on your own, and express doubts about the suitability of a white man presenting in this particular context. Then you don't have to directly tell him to bug off.\n\nNTA.",
              "id": 4,
              "comments": [
                {
                  "score": 264,
                  "content": "I'm assuming that he didn't reach out to her because he wanted to do it instead of her not with her. If he wanted to do it with her he would have reached out to her which he didn't",
                  "id": 5,
                  "comments": [
                    {
                      "score": 107,
                      "content": "Just told OP in a comment above that he's likely to center himself during his \"presentation.\" I've seen it so often.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I like this idea. I didn't think OP was TA, but I was wondering if it would negatively affect her in the future with her boss. Having the steering committee take care of this is a perfect solution.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Honestly if the people in charge of the Women In Stem panels don't understand about shielding people from retaliation then I don't know why they've started the whole enterprise.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -18,
                  "content": "I mean, him being white has nothing to do with it.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 27,
                      "content": "You're right, it *may* not at all lead into his sense of entitlement, given the fact that white societies are far from being the most sexist and patriarchal societies on Earth.\n\nLooking at the data revealed in research such as The Global Value Survey it is more likely for white societies to be amongst the *least* sexist countries on Earth... \n\n...which is not good news for women at all.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": -47,
                  "content": "Wow, not only a sexist comment, but a racist one as well.",
                  "id": 11,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 710,
              "content": "I agree with that but allies should amplify unrepresented voices..... Not speak for them...\n\nNTA but try to speak to the organizer to see if they can talk to him, like an other commenter suggested, expose to them what you planned and see how it goes from there.",
              "id": 12,
              "comments": [
                {
                  "score": 270,
                  "content": ">I agree with that but allies should amplify unrepresented voices..... Not speak for them...\n\nBeautifully said.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 173,
                  "content": "right? OP's boss doesn't just inherently \"have the right\" to present because he's a part of the group - yeah, that's how things would generally work, but this is a women in stem event - he can offer to present when there aren't any other women who want to give that specefic presentation instead of him",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 73,
                  "content": "Happens re. disability all the time. Drives us fucking crazy.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 178,
              "content": "As someone who considers themself an ally, our job is generally speaking to let others take the lead and back them up if needed. Volunteering yourself to speak at a group that is aimed at empowering someone else is literally the opposite of that. This is where a real ally should step in, pull him aside and explain it to him.",
              "id": 16,
              "comments": [
                {
                  "score": 131,
                  "content": "The “back them up” part is really what’s problematic about the other half of this: He’s her *boss*, who is not part of the demo the group represents and outreaches to. The power dynamic skews away from him backing her because her roles supports his.\n\nI do think for this reason that OP might be better off expressing her concerns to the organizers. Let them turn him away. They’ll take less heat and OP can protect herself from the fallout. That’s a large benefit of these groups, protecting members from this exact scenario through collective organizing and representation. Like HR if HR didn’t suck most of the time.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 49,
                      "content": "Yep. Him doing this has already made an uncomfortable situation from OP.\n\nBecause now she has to worry about backlash from her boss who might be pissed off that get doesn’t get to do it - whether Op or the executives tell him no. \n\nHe sure isn’t going to take it out on the executives. But he is quite likely to make the whole experience a lot more uncomfortable for OP and it may even affect her job after this. \n\nAll because he decided to insert himself into something he clearly doesn’t belong in, instead of doing the appropriate thing and actually supporting what the entire group is supposed to be about...",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "You would have hoped that the WiSTEM group leaders would have already thought him presenting was problematic for both reasons you mentioned!!",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Yes I think it’s politically better for the organizers to handle it.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 96,
              "content": "You know what, look up panels like the original commenter mentioned, where minority issues are presented and discussed by people of the majority demographic. And collect comments and arguments from the backlash they received. Then you can say that while it’s great that your boss wants to be a representative, he will receive backlash from appearing and you think it would be better he sit back for this segment. It should absolve you of any responsibility of actually saying no. Even if he gets upset at you, stick to your narrative that you don’t want HIM to face backlash and hate.",
              "id": 21,
              "comments": [
                {
                  "score": 71,
                  "content": "/u/61508 Try what this commenter said! It’s a great balance. You get to absolve yourself of potential heat and not say “no”. But perhaps give this to the panel organizers instead if your boss, since he doesn’t necessarily know that you have the power here. Also, I agree with all the other comments saying you should tell the organizers your original idea. \n\nAnd yeah, I had a boss once who actually underpaid his female staff and didn’t necessarily give them the same opportunities as the men, and the made this hugely public (and very positively received) statement about the lack of equality in the workplace and the pay gap. He had the audacity to not pay his female workers a livable wage and the public proclaim how much he supported closing the wage gap and providing women with opportunities to grow. My other female coworker and I chatted about how it made us feel to be so disregarded, someone else overheard, got back to the boss, who then called me in to his office to admonish me about gossiping and how hurt he felt. I explained that I wasn’t gossiping, I was just sharing how hurt *I* was that he thought it was ok to preach and not act. And that he not only underpaid us (excuse after excuse for that) and expected us to work longer hours than were scheduled, stated, etc, but when he announced new positions that were available, shit both of us down when we spoke about potentially applying. And then I reminded him that I was working a job that was supposed to be temporary so I could move into a different position, but they never even opened that position, so I’m out. At that point, I was the office manager, assistant to a department head, manager of the department, and expected to also somehow be the receptionist (i straight up refused), water the plants, and man the catch all email. I put in my 2 weeks and left them scrambling in my wake. I got calls for 5 months afterwards about where was this or that (in the closet in the section labeled that) and what happened to this, even after I left a list of updated project progress and a guide to where everything was and how it was organized. They stopped calling when I started telling them that I had removed all their company files and information off of my computer so I couldn’t help. \n\nSo I have a particular anger when I see male bosses trying to jump in to represent women. Sit down dude, you don’t have a uterus or a vagina.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Exactly this. I'm part of a small society for a field we'll call \"X\". A while back, the (male) society leader decided he wanted to run a panel on \"women's representation in X\", got a big name in the field on board, started advertising it online... until people realised there were no women on the panel. There was a massive backlash from the national \"X\" community and the event was cancelled within hours. The guy's heart was in the right place but I honestly don't know what he expected.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 7,
                      "content": "As much as I am in the camp that even people outside a demographic can provide good information it's just not gonna matter how good you are in this kind of situation. If you don't have people from the demographic you are supposed to be speaking up about in the actual program you are gonna get lots of backlash. Not to mention you are also missing the biggest point about such an event, for these people to be able to speak, get exposure, etc.  You just come off as fake, disrespectful, etc if you do this kinda shit.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "NTA and tell the organizers about your original plan. Asking your boss puts the power in his hands when he already acted inappropriately. This is an entire thing meant to promote women in STEM, a group that needs to be highlighted because there aren’t enough. Case in point, you’re the only woman on your team. \n\nThis is not his time to shine, this is the time for him to step back and reflect on why he thinks it’s his place to talk over women at their own event. \n\nI’m personally salty about things like this, as I purposely find events like this because I want to see women who I can look up to. If I went to a women in STEM presentation and there was a man presenting I’d wonder why it was advertised that way. It would just be a marketing presentation, instead of what the event is intended to be.",
              "id": 25,
              "comments": [
                {
                  "score": 6,
                  "content": "Ding ding!",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -20,
                  "content": "[deleted]",
                  "id": 27,
                  "comments": [
                    {
                      "score": 14,
                      "content": "perfectly valid argument if we were talking about anything vague and nebulous like “women at work”, but we’re not, are we. we’re talking about women in STEM. that’s all that’s actually relevant.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "If the company was Public Works then that would be an appropriate question. \n\nAs this is a tech company, your point is completely irrelevant.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "This. Also, surely if he really did believe in helping the group and equalising opportunities, he wouldn't mind anyway if the organisers were to tell him \"Sorry, but we already have a speaker arranged, who also represents the group.\"\n\nI have to say I think it's unfair of the organisers to even have entertained this if they had already confirmed you. They shouldn't be putting this on you and should have just told your boss it was already sorted. And surely if you're also bringing in another potential speaker who's experienced and also a woman, they would be even more interested in the two of you speaking rather than the volunteer boss.\n\nYet another example of the extra stress & nuisance women have to go through in just pursuing their careers.\n\nNTA.",
              "id": 30,
              "comments": [
                {
                  "score": 20,
                  "content": "yeah i agree. the panel should have protected her from being in this spot",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "This was my thought too “we already have the programming worked out” should be enough of a response. It’s a shame it wasn’t nipped in the bud right away.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Another idea is to limit men who present to the VP and CxO levels unless they are from the diversity and inclusion team. Propose this to the steering committee.",
              "id": 33,
              "comments": [
                {
                  "score": 17,
                  "content": "I actually think this is even less helpful, because most companies don't actually have effective D&I teams, if they have one at all. \n\nI definitely agree that there should be guardrails in place here, but this doesn't seem like a particularly effective suggestion.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "He's clearly seen after the last event what an important networking event it actually is. He wants to be seen.",
              "id": 35,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "If he volunteered himself with no other way of knowing marketing was next, is there a chance he has access to your email?",
              "id": 36,
              "comments": [
                {
                  "score": 7,
                  "content": "I highly doubt that. I was the manager of a similar sized team in my previous role and I did not have access to my team members emails. But interesting point still!",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "This is something my wifey has struggled with in her work place\n\nEverytime a program like women in workplace or for disabled or native lands comes up, zero members of those groups work with it, partly due in some cases next to noone of said minority but even if there are members they get overlooked for middle aged white men\n\nNTA",
              "id": 38,
              "comments": [
                {
                  "score": 30,
                  "content": "[deleted]",
                  "id": 39,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I was hoping it was a typo. 😬",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -2,
                      "content": "She calls herself that too, it's one of our things",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 155,
          "content": "Hopping into top comment to say: it really grinds my gears when female adults are referred to as 'girls,' not 'women.' Male adults are nearly always referred to as 'men,' not 'boys.' This is especially annoying in a professional context. This isn't to shame you, OP, for the wording in your post, but just to note how we can  internalize patterns that infantilize women, even when we're trying to self-advocate. This pattern is something I learned to identify and unlearn in myself and I'm really grateful to the friend who taught me.\n\nNTA, for all of the other reasons on this thread. I hope I wake up tomorrow with the chutzpah of your boss. The organizing team should tell him No and diffuse any potential heat you could take. It's kind of appalling that they wouldn't say no outright but... difficult to shake off the tendency to be accommodating to people who are bosses.\n\nAlso, isn't it a little bit of a red flag that there are 6 people on your team and only one woman (so 15.6% female)??? Is this boss involved in hiring? Just  curious.\n\n*minor clarity edit",
          "id": 42,
          "comments": [
            {
              "score": 38,
              "content": ">I hope I wake up tomorrow with the chutzpah of your boss. \n\nMy work refrain: *God grant me the confidence of a mediocre white man.*",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "> Also, isn't it a little bit of a red flag that there are 6 people on your team and only one woman (so 15.6% female)??? Is this boss involved in hiring? Just curious.\n\n6 people isnt enough to meaningfully reflect the ratio of available people in the first place. By pure chance you can easily end up with a team full of minorities or a team without any minorities by simply picking the objectively best candidate in each interview.  \nAlso in many stem fields 15% women is relatively close to the ratio of women graduating with degrees in the field(I.ex. for both computer science and for overall engineering degrees its 15-20% each) so again there is nothing unusual or negative about that.",
              "id": 44,
              "comments": [
                {
                  "score": 16,
                  "content": "I hear you on low sample size, which is why I said \"little bit of\" a red flag.. Also, OP says her group is Marketing, a field that is 67% female.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 3,
                      "content": "marketing by itself also wouldnt be a stem field to begin with. I would assume they do marketing for a specific stem field requiring technical knowledge where they need people with stem degrees or equivalent technical knowledge. That may very well cut down on the ratio quite significantly.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I'm on a team of about 15 and am the only female. It's just worked out that way. We've hired 4 new positions in the last few months and we didn't even have any female applicants.",
                  "id": 47,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "YES to this! Everytime I read the word \"girl\" I felt myself just clench up. Came to comment but gillessboys articulated it here better than I would. \n\nAlso, NTA!",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "I call myself a girl all the time. I use \"guys\" and \"girls\" frequently. It's not internalized anything. I prefer a less formal phrasing. \n\n> Also, isn't it a little bit of a red flag that there are 6 people on your team and only one woman (so 15.6% female)??? Is this boss involved in hiring? Just curious.\n\nTeam of engineers? I would not at all be surprised if that accurately reflects the applicant pool. My team is ten and I'm the only female engineer. We had one applicant a while back for an open slot who was female, but her qualifications were terrible and she interviewed very poorly. I have my doubts that a guy with her level of experience and skill would've made it past the HR phone screen, and her coding test was absolutely bottom of the barrel.",
              "id": 49,
              "comments": [
                {
                  "score": 3,
                  "content": "OP says her group is Marketing.",
                  "id": 50,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": "Yes! BLM groups should be voiced by *black poc. Lgb groups should be voiced by lgb people. Trans groups should be be voiced by transgender people. Female focused groups should be voiced by women. Sexual assault victim groups should be voiced by sexual assault victims ..And so on and so forth.",
          "id": 51,
          "comments": [
            {
              "score": 65,
              "content": "It's one reason why autistics hate autism speaks, it's basically made by and for non-autistics to talk about how hard dealing with autism is and trying to fix us. Actually Autistic is a group made by and for people with autism.",
              "id": 52,
              "comments": [
                {
                  "score": 1,
                  "content": "Yea, my autistic (only mentioning that for context) bf sent me a link to that one day.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "No dude. As a sexual assault unsurvivor, I'd love to lead a sex assault workshop. /s",
              "id": 54,
              "comments": [
                {
                  "score": 18,
                  "content": "You make a compelling argument, team leader.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Just wanted to say BLM groups should be voiced by black people. POC is such a catch all term and people need to realize non black POC and black and indigenous POC have a different experience especially in America. So BLM should be voiced by black people in general period",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "NTA.\n\nYour boss’s role is to *quietly* support the women-led initiative, not to steamroll/be the figurehead of the women-led initiative.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "Totally. Me too! My company just put together a 'diversity committee'. I choked on my own throat reading their list of people on it. Several white people of both genders, one black woman, one Indian woman. Um, okay. How about the bazillion Asian and Filipino and Hispanic people we have working there? They didn't want them on the committee? What was the point in even putting one together? But of course all the white people are heads of staff, so they're deemed important enough to lead it.",
          "id": 58,
          "comments": [
            {
              "score": 7,
              "content": "*Yikes* that is quite unsettling and hugely frustrating.\n\nIs there any way people can speak to HR about this?",
              "id": 59,
              "comments": [
                {
                  "score": 2,
                  "content": "Probably not. I mean, mayyyyybe anonymously at best. It just seems so silly to me. Part of a diversity committee's role is presumably to figure out how to get more diverse people into roles of leadership. But if it's only run by the people already in roles of leadership, who are not diverse, I don't understand how they expect to enact any meaningful change. Such a Committee might need the SUPPORT of those people to get the ball rolling, but it should include as many diverse voices as we have. And boy, it sure doesn't.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1041,
      "content": "NTA. It's uncomfortabke and might make things a bit awkward with the boss for a while but I think it is worth doing as this is the only way to move things forward. I recently had to call out insensitive behaviour with a male director on international women's day and it wasn't comfortable but I would have been really annoyed with myself if I didn't do it (and he's gotten over it now)",
      "id": 61,
      "comments": [
        {
          "score": 752,
          "content": "Also, I would just go back to the organisers and tell them what you were thinking, I think they'd totally be on board with your suggestion and you can leverage them to tell him no and they'd prefer you to do it as the woman in the team",
          "id": 62,
          "comments": [
            {
              "score": 472,
              "content": "This is a great idea. I will definitely reach out to them before deciding to talk to my boss.",
              "id": 63,
              "comments": [
                {
                  "score": 479,
                  "content": "[deleted]",
                  "id": 64,
                  "comments": [
                    {
                      "score": 65,
                      "content": "This cuts both ways.  There are scenarios where addressing the boss directly is the right play.  It depends on this guy's personality.  Is he an egomaniac that only understands leverage?  Or is he a reasonable boss who is just ignorant to the unfortunate irony that he is responsible for?\n\nSome people would respect being addressed directly in a scenario like this.  End arounds rarely result in the target feeling respected.  It communicates that you believe they don't have the capacity to grasp your point of view.  If you feel like it is your only option because he's a real jackass, then yeah I agree with these sentiments because there's no real value in the professional relationship to begin with.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Yeah maybe talking to the organizers and have them talk to him mentioning they’ve tapped you for it and you’ve gotten in touch with the female executive to tag team.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 48,
                  "content": "Also I just want to add a bit about your husband— though he sounds good intentioned, he clearly does not understand how women have been treated in male dominated industries such as stem and how many businesses have a ‘Boy’s Club’ where only men are selectively promoted to maintain a male dominance in management. Despite this seeming like a small event such as a support group, having women being able to promote themselves in a professional safe space is a stellar and rare opportunity and highlights women in the professional field. Therefore, inform your husband about how this is more than just a presentation but generational progress in a man’s world. \n\n\n      Also- The fact that your boss did not even think of amplifying female voices- you being the only woman in your group- tells me that he does not want this for the right reasons, and makes me think of wanting a male savior role or getting attention for being an ally instead of letting the actual marginalized group express their struggles. I would suggest telling the event organizers that you had something planned and already asked someone to tag team with you. Also I would add something innocent to hint at the obvious- “Also because this program is to amplify female voices, don’t you think it would be great to celebrate a fellow female teammate?”\n\n\nAlso NTA",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I definitely think that's the way to do it, they reached out to you to ask you if you'd like to present with your boss, you can politely say that you have a plan to include person Y and don't they think it would be a better look for the company to have two women presenting as it's about the experiences of women in the industry?",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 890,
      "content": "Absolutely NTA. It’s your experience they want, and rightly so. \n\nI do want to point out that calling adult women girls, especially in this context is awful. How can we as a society take women seriously if we infantilize them at every turn? Just something to think about.",
      "id": 69,
      "comments": [
        {
          "score": 241,
          "content": "Ditto. I would have made this comment but you beat me to it!\n\nThe group is **Women in STEM**. Please practice using \"women\" rather than \"girls\" as the latter is undermining.",
          "id": 70,
          "comments": [
            {
              "score": 5,
              "content": "Yup. Girls in STEM is appropriate for groups targeting children in school, not people with workplaces and mortgages.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 232,
          "content": "☝🏻☝🏼☝🏽☝🏾☝🏿\nPlease accept my free THIS award for the second paragraph.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 206,
          "content": "Same goes for using \"females\", its an adjective outside of a medical setting, and generally not used for humans, but so many people use it as a noun because it has a nice little dehumanizing touch that women haters love. And they always use \"men and females\" so you know what's up.",
          "id": 73,
          "comments": [
            {
              "score": 64,
              "content": "Yes absolutely hate this!! I’d rather be called a girl than a female, but of all I would much rather be called a woman. (I’m a young adult but I feel a lot like a teenager still so maybe that’s why being called a girl doesn’t necessarily bug me. Of course I can not speak for other women on their behalf.)\n\n\nFemale just seems so disrespectful to me, and like you said it feels dehumanizing. You refer to animals as females, but you hear people calling a dog a girl more than female. \n\nSo being called female is just gross.",
              "id": 74,
              "comments": [
                {
                  "score": 4,
                  "content": "Plus if you use \"female\" when you mean woman, you're excluding trans women, which also isn't cool.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I didn’t even think about that :((",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -1,
                  "content": "In a world where gender distinction is becoming very important, we need terminology for when we're talking about biological sex. Why is everyone's first inclination to let incels dictate how everyone else speaks? There is nothing wrong with using female or male, everything is contextual. Female is used in an inoffensive manner constantly. I agree with the use of the term girl being infantalizing and strange when referring to adult women.",
                  "id": 77,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "In two sentences OP went from saying “successful female” and “male boss....” so weird how they use female as a noun but male as an adjective \n\nIt’s almost like OP has some internal misogyny going on",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Yeah, I see a lot of that in gaming subreddits. Every time I just say \"it'd be a step forward to just call them women\"; every time I get called an SJW and feminist, etc like these would be negative in the context. 🙃\n\nLike let's rewind a bit. These people get angry about addressing women like equals. 😂\n\nImo \"Females\" makes me think of a nature documentary being voiced by David Attenborough. I don't think that's how you're supposed to talk to people if you want to sound like you're on even terms.",
              "id": 79,
              "comments": [
                {
                  "score": 2,
                  "content": "SAME! every time I call someone out on calling women girls I get called sensitive",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "100%. I loathe this and I don't have the words to exactly articulate why, but getting called a female just makes me want to scream.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 134,
          "content": "Agree. It strikes me as very strange that she used the term “executive girls” to describe the executive, especially as a member of the women’s group.",
          "id": 82,
          "comments": [
            {
              "score": 40,
              "content": "I've never seen anyone use the term \"executive girls\" before. If someone is old enough to be an executive at a workplace, they're clearly not a \"girl\". It's just disrespectful AF to call anyone a \"girl\" in a professional setting, let alone a former executive.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 103,
          "content": "I wouldn’t say awful as I think that is heavy handed, but I did cringe at each usage. Be proud of using the term women, OP!",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Agreed. It can be difficult to always correct that pervasive language every time but especially in this context is an effort worth making!",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Yes! I noticed the use of girls and was frankly wondering if they were aiming at getting children into STEM, not adults. This is probably a symptom of the concern about declining their male boss - the OP does not see themselves as an equal.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Yeah OP used “girls” and “females” while is just gross\n\nIt’s the internalize misogyny for me",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I can’t take the OP seriously because of her demeaning language.",
          "id": 88,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "Yes, it’s something that I’m working on personally so I really noticed it.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 452,
      "content": "NTA \nIt's not women in stem unless there is a man explaining it to you all I guess /s \nWhat an entitled AH. And if he claims he is showing support then he should understand that it really isn't support it's undermining your capabilities.",
      "id": 90,
      "comments": [
        {
          "score": 68,
          "content": "I agree. It’s also weird he didn’t talk to her at all. He went straight to the organizers. I hope op replies in kind and only addresses the organizers saying she has a plan and would let them know if it doesn’t come through. That way they can tell him it’s handled but appreciate the offer.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This did at least make me laugh. I shared this one with my husband and he came around pretty quick.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 425,
      "content": "Please don't call yourself and other women \"girls\". But NTA.",
      "id": 93,
      "comments": [
        {
          "score": 205,
          "content": "This. Or “females.” You wouldn’t say, “We have a lot of blacks at my company.” Referring to people as adjectives is icky.",
          "id": 94,
          "comments": [
            {
              "score": 73,
              "content": "[deleted]",
              "id": 95,
              "comments": [
                {
                  "score": 36,
                  "content": "The military uses the terms female and male. It's been ingrained in my head to use it, too. I don't really see anything wrong with it depending on the context. Obviously when \"nice guys\" are using it, it's meant to be demeaning.",
                  "id": 96,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -1,
                  "content": "So we just gonna ignore this racist comment",
                  "id": 97,
                  "comments": [
                    {
                      "score": 1,
                      "content": "[deleted]",
                      "id": 98,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "You know I've always wondered why people would get upset by this. I've never minded being referred to as female myself. But you're last sentence, in it's simplicity, had finally gotten through my head what the issue is.\n\nAdjectives! It makes so much sense now.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "My gosh! This was driving me insane! Women, please understand how much you’re undercutting yourself and other women by referring and allowing yourself to be referred to as “girls” and especially in the workplace! That’s a mindset that needs to be trashed. It’s mad disrespectful since I stopped being a “girl” after I turned 12.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Please don't tell a woman what to call herself.",
          "id": 101,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I don't get this don't call woman \"girls\"? I always call my girl friends girls and boy friends boys.\n\nPeople are seriously taking offence over anything nowadays. If someone called me a girl, I wouldn't care as long as they weren't saying it in a horrible way. I prefer to be called a girl than a woman as generally find that people who call me a woman are trying to be sexist or nasty.\n\nAs long as people treat me right and respect me I will not be offended by the term girl.",
          "id": 102,
          "comments": [
            {
              "score": 24,
              "content": "The context matters. You calling your friends that is probably meant to be endearing. People calling women in professional settings girls is infatilizing. Imagine I'm a fifty year old man and call my female employees girls. Especially in a formal setting. \n\nI'm fine with my friends calling me girl. If my professor called me girl it would be upsetting. Some people don't want to be called girl in any context. You and me are probably ok with it because we are younger (I'm 23), but I can imagine a woman who's older and experienced wouldn't want anyone calling her girl because that's just not what she is. She's worked for her place and her maturity and deserves to be respected for it.",
              "id": 103,
              "comments": [
                {
                  "score": -5,
                  "content": "I just think you say whatever you normally would say and if someone corrects you saying they don't like being called that then you make a mental note to not call them that word, and ask them what they would prefer.\n\nI just think people get easily offended when majority of the time it was an innocent mistake or saying.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I used to agree with you and thought folks were being over sensitive. I wanted to be one of those cool girls in tech who didn’t care about sexist language if folks treated me well enough. After 25 years in tech I changed my mind on women versus girls. Here’s some of the reasons why.\n\n\n- The men are called men, the women are called girls. With my friends I call the men boys so it is fine if the women are called girls. But at work, if we don’t say “two executive boys” presented we shouldn’t say “two executive girls. \n\n- If you are a woman in tech trying to break into leadership or executive it is hard. And it feels harder when you are portrayed as a girl competing with men. It makes it easier for people to ignore your decades of experience.\n\n- A lot of women hate being called girls. So I don’t use it to be respectful. I use folks to be informal. “A couple folks from finance will be presenting today.”",
              "id": 105,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -19,
          "content": "People can call themselves whatever they want.",
          "id": 106,
          "comments": [
            {
              "score": 8,
              "content": "But she never called herself a girl. Its other people she called girls.\n\nEdit: this is incorrect she does refer to herself as a girl too",
              "id": 107,
              "comments": [
                {
                  "score": 19,
                  "content": "She definitely did say she was the only girl in her group, so she does refer to herself as a girl as well. It is possible that women have a hard time branding themselves and other women as such when they are younger and still feel like you know girls. Not necessarily meant as a bad thing.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -28,
          "content": "[deleted]",
          "id": 109,
          "comments": [
            {
              "score": 38,
              "content": "Nobody would dream of calling two men running a networking group a two boys. It would be considered demeaning to talk about them like they're children. Same applies to women.",
              "id": 110,
              "comments": [
                {
                  "score": 1,
                  "content": "She's allowed to call *herself* a girl if she wants, though.  If a guy was running a networking group and chose to refer to himself as a \"guy\" or a \"boy\" he probably wouldn't have to deal with a bunch of people talking down to him because they don't think he should be allowed the authority to choose how to identify himself.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I'd call them \"guys\". In this case, \"girls\" is the opposite.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Gals is the opposite of guys. Not girls. “Guys and gals” not “guys and girls.”",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -8,
              "content": "It's how feminism works. You're free to choose whatever feminists tell you is OK.",
              "id": 114,
              "comments": [
                {
                  "score": -3,
                  "content": "Don't forget that if you believe in equal rights you *have* to identify as a \"feminist,\" even if you're more comfortable using a different word.  Because nothing's more empowering to women than other people making our personal choices for us.",
                  "id": 115,
                  "comments": [
                    {
                      "score": -3,
                      "content": "I parted ways with that label 25 years ago.",
                      "id": 116,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": -7,
                  "content": "[deleted]",
                  "id": 117,
                  "comments": [
                    {
                      "score": -2,
                      "content": "The only person who gets to decide how I define myself is me.\n\nThat's why I parted ways with feminism over 25 years ago.",
                      "id": 118,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -37,
          "content": "What’s wrong with calling other women “girls”? \n\nGenuine question, most women I know have no problem having things like “girls night”. Doesn’t seem offensive in any way at all, especially when the girls themselves are the ones saying it.\n\nAnd don’t tell someone what they should or shouldn’t call themselves. If she wants to call herself a girl she is more than welcome to. She can call herself a tomboy, a girly girl, a female, woman etc. It’s her identity and you don’t get to decide what it is.\n\n\nEdit: and here I am getting downvoted for asking a question and defending someone’s right to self-identify. These kinds of people are exactly what’s wrong with the general feminist movement.\n\nPlease always take the opportunity to educate and create informed allies, rather than shutting out those who are uninformed but would support you. The more toxic feminists in the cause, the less people will listen to the real feminists that actually want to see proper social change.",
          "id": 119,
          "comments": [
            {
              "score": 41,
              "content": "You're white knighting. \n\nWomen are allowed to care how we're addressed, especially in the workplace. It's fine that your friends don't care, but plenty of us do.",
              "id": 120,
              "comments": [
                {
                  "score": 2,
                  "content": "But only if we agree with you, it seems.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 2,
                      "content": "This comment makes absolutely no sense.",
                      "id": 122,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": -16,
                  "content": "I wasn’t white knighting at all. Did you miss the part where I said “genuine question”?. \n\nAll I wanted was an answer as to WHY using the term girls would be considered offensive to women in general. As I have personally never met anyone that found it to be an issue.\n\nYou personally can prefer to be called and not to be called whatever you want, that’s your choice. I understand that if someone says “please don’t call me a girl” that you should absolutely respect that. I don’t understand why “girl” is being considered a generally offensive word.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Because \"girl\" refers to a child.",
                      "id": 124,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "No. POC are allowed to use the n word, women can say they're going out for a girls night. We wanna let our hair down and be kids again on girls night. At work we are women.",
              "id": 125,
              "comments": [
                {
                  "score": -4,
                  "content": ">\tNo. POC are allowed to use the n word\n\nSo then women are allowed to use the G word and there are no problems here. Your analogy is not good.\n\nMy question was why is “girls” considered offensive?",
                  "id": 126,
                  "comments": [
                    {
                      "score": 27,
                      "content": "In this case it’s because of the context. You wouldn’t say Executive Boys about people at work. Men and women go to work",
                      "id": 127,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "It’s offensive in a work context bc historically women were/are disrespected and calling them girls is one way to infantilize and disrespect them. I’m disheartened that folks don’t already understand that.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "because as I said, at work, we are women. \n\nWe might be girls on a night out, at work we want to be treated with as much respect as the men.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "I don’t mind “girls night” with friends. My partner is in my phone as “boy.” Socially IDGAF.\n\nAt work is different. I’ve been in tech for 20+ years at this point. I’m trying to reach director level. And when folks who are reviewing resumes for open positions or applications for events or other opportunities refer to their applicant pool as “4 men and a girl” it doesn’t feel like I’m being taken seriously. \n\nIf they said “4 guys and a girl” it would bug me less. But it would still bug me. \n\nThe female equivalent of guy is “gal” which doesn’t have the childish connotation. But many folks in this thread insist that “girl” should be used to refer to both toddlers and executives. And that’s weird and annoying.",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 192,
      "content": "I'm sorry, 'girl'? Girls are 12 and under. Teens are ambiguous, either girls or young women depending on the situation, but nobody over the age of 18 is a girl. We are women. Please use the correct words.\n\nETA: NTA for telling this man to stand back. For that matter your husband needs to stand back too. It's in the name of the group! The whole point of the group is to promote women to an equal standing. It's true that we can't do it without men, but they need to listen and learn from the group and educate people who are outside the group.",
      "id": 131,
      "comments": [
        {
          "score": 61,
          "content": "I also came here to say this. Imagine if OP had said she is the only girl in her group with 5 other boys. Sounds like they're in kindergarten.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -85,
          "content": "Sounds like a funny hill to die on. In my post I use women, female, girls, and honestly I could have thrown lady in there once or twice. Interesting trigger.",
          "id": 133,
          "comments": [
            {
              "score": 120,
              "content": "You only used \"women\" when you were talking about the name of the group. Whenever you talked about a specific woman, you called her a girl. No where did you call any of the men \"boys.\"\n\nThe difference was so marked, I at first thought maybe you were a student intern working with adults.\n\nThis is not an issue I'm usually prickly about, and have no problem with women calling their friends, \"girls,\" but in this context it was really jarring. Also using terms like this in the workplace will be counterproductive if you want to be taken seriously in STEM fields.",
              "id": 134,
              "comments": [
                {
                  "score": 8,
                  "content": "This and constantly referring to her boss’ race makes me think she is right out of school. It really bothers me to see women referred to as females and girls, especially in the workplace.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 79,
              "content": "Language is important. Labels and descriptors are important. Look at the pronoun discussion happening right now (they/them).",
              "id": 136,
              "comments": [
                {
                  "score": 65,
                  "content": "Language is important, and honestly I'm wondering if this is a teenaged troll because I know grownass women in STEM and I can't imagine them not understanding the implications or thinking it was a silly thing to point out.",
                  "id": 137,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "I thought people were allowed to refer to themselves how they choose? Hence why in people’s social profiles some people put their preferred pronouns. Or is that only ok for everyone else apart from OP as she refers to herself as a girl. Who are you to dictate she can’t put girl?",
                  "id": 138,
                  "comments": [
                    {
                      "score": 10,
                      "content": "A personal pronoun is not the same as any other way if referencing a person, but especially isn’t the same as referring to *women* as girls while simultaneously calling men, men. This can indicate a persons lower view of women, whether subconscious or not.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "Notice how you did not once refer to your boss (or any other man in your story) as a \"boy.\" You used terms appropriate for adult men. \n\n\"Executive girl\" sounds like a child playing dress up or like the name for a barbie doll in a business outfit. It's demeaning to refer to an adult woman, especially a woman with the experience and expertise to be at the executive level, as a girl. \n\nThere is some leeway in this when refering to your own friend group - such as a \"girls night out.\" But in a professional setting, do not refer to other women as girls.",
              "id": 140,
              "comments": [
                {
                  "score": 52,
                  "content": "I’m doubting a woman wrote this, actually. Just the overuse of the term “girl”.",
                  "id": 141,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 52,
              "content": "Calling (likely) fellow women triggered because they (calmly) prefer to not be addressed with language that infantilizes them or discriminates them, is really gross and makes you part of the problem. How come you didn't call the men 'boys' or 'males'? We know why and you know why. \n\nIf you truly want there to be progress, then it can't only be when you have to show at an event, it has to be in smaller, everyday things too.",
              "id": 142,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": "But you never used the term boy which should be the male equivalent. Why not? \n\n[Here's a five year old article that explains why calling grown women girls is problematic.](https://everydayfeminism.com/2015/06/grown-women-are-not-girls/) It's not a funny hill to die; it's an integral part of establishing equality of the sexes, a concept I would expect a speaker at a Women in STEM event to be familiar with.",
              "id": 143,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "You’re in marketing - you should understand the power and positioning of words and how they’re used...",
              "id": 144,
              "comments": [
                {
                  "score": 3,
                  "content": "I have a feeling they’re not in marketing.. and probably not a woman..",
                  "id": 145,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Honestly, if you listen to the criticism on how you refer to yourself and the other women in your field, it’d probably help your goal of achieving true equality and visibility for women in STEM. To me, the fact that you don’t see a problem with this mindset of viewing professional women as “girls” and are so flippant about the criticism of it makes perfect sense as to why your boss feels comfortable stepping over you to do this presentation. \n\nAlso, I find it BIZARRE that you’re the sole women in a Women in STEM special interest group. Why does that make sense to you?\n\nEdit: I’m so very curious what was the makeup of this group before this other women left after 8 years of being a part of it. Was she pushed out or did she leave on her own? Was the group originally opened to only Women (and non-Binary people)? Or did it shift after some complaints from the men? I’m especially suspicious of you really being about this kind of work since your husband is also a member of the group that - again - is almost entirely made up of men. As a women, there’s no way in hell I’d feel comfortable joining since I sincerely doubt that my authentic voice would be either heard or respected. Honestly, I smell some bullshit about OP’s dedication toward pushing all Women forward in her field vs her really just wanting push forward herself.",
              "id": 146,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -38,
              "content": "It's kind of hilarious seeing feminism+woke attack themselves. You couldn't be fighting for women harder in your post, are a women, and trying to shut down white men and yet it wasn't enough not to get shunned for not being woke enough.",
              "id": 147,
              "comments": [
                {
                  "score": 22,
                  "content": "Hm? OPs word choice was pointed out and ppl explained why. This is constructive criticism! Not “shunning“. I (white woman) said a lot of demeaning stuff without realizing it and only learned cause ppl pointed it out and explained to me. \n\nOf course, I’m woke now and Did Everything Right(TM) so criticism must never happen to me again /s 😉😉",
                  "id": 148,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -4,
                  "content": "Yeppppp I'm sorry but girl vs woman and man vs boy is not something we should be discussing when the wage gap is still an issue and we can't walk home at night alone safely NTA",
                  "id": 149,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 185,
      "content": "As a woman in STEM, please refer to us (yourself included) as women not girls. \nGo back and read how every woman is referred to as a girl, but you do not call anyone a boy. This small change will help with your mindset as an equal. \n\nApproach your boss about how it looks to exclude women for the Women in STEM group presentation. \nShare your ideas for the presentation, maybe you will get him on board. Next time tell your boss about your involvement before he gets a chance to volunteer to do it himself. \n\nNAH",
      "id": 150,
      "comments": [
        {
          "score": 43,
          "content": "Whoa whoa who not every woman was referred to as a girl.\n\nThe executive was referred to as a “female.”\n\nWhy the hell can’t people just use the word WOMAN?!?!",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -8,
          "content": "As an engineer who happens to be a girl, don't you dare presume to tell me what I can call myself.",
          "id": 152,
          "comments": [
            {
              "score": 14,
              "content": "If you want to refer to yourself as a girl, your choice. But it will hurt how others treat you, so you aren’t doing yourself any favors. \n\nI am a grown woman, also in STEM. I am probably the same age as your Mom. If anyone refers to me as a girl (especially in a professional setting) I shut that down immediately. \n\nI am excited to see more Women engineers and other technical professionals. Raise each other up, and do not sell yourself short.",
              "id": 153,
              "comments": [
                {
                  "score": -6,
                  "content": "You're well into your 70s?",
                  "id": 154,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I certainly feel like it today.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -3,
              "content": "> don’t you dare presume to tell me what I can call myself. \n\nIt’s a good thing they didn’t!",
              "id": 156,
              "comments": [
                {
                  "score": 3,
                  "content": "> As a woman in STEM, please refer to us (yourself included) as women not girls.\n\nSeems they are indeed telling all female engineers how we may refer to ourselves. That includes me because I'm an engineer *and a chick*.",
                  "id": 157,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 131,
      "content": "NTA - but quit referring to yourself and other professional women as \"girls.\" Girls are usually thought of as young, immature, and inexperienced. You and the other woman should be treated with the respect you have earned and part of that is being addressed properly. If you call yourself a girl, you are devaluing your experience and bringing down the other women, too.",
      "id": 158,
      "comments": [
        {
          "score": 8,
          "content": "I wish I could upvote this more!!",
          "id": 159,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 122,
      "content": "NTA...\n\nUnless there are details that I am missing, this is pretty clear. Yes, men can and should participate in women in stem, but I think standing your ground in this case would reflect the focus of such an initiative.\n\nThe only scenario I could possibly see where it isn't appropriate for you to push this is if your experience/knowledge with the company and or marketing is really limited-- as in you are a new hire.",
      "id": 160,
      "comments": [
        {
          "score": 97,
          "content": "I’m one of the less experienced people, but not a new hire. I’ve been with the company in various roles for 8 years. I joined this team 2.5 years ago. \n\nHe has been in the manager role for 2.5 years (since j started) and was on the team for 2 years before getting promoted.\n\nEdit to add the other 4 members of my team are male and 20+ years experience. They are heading for retirement.",
          "id": 161,
          "comments": [
            {
              "score": 72,
              "content": "They’re male? Why not call them boys, then?\nOr “executive boys”?",
              "id": 162,
              "comments": [
                {
                  "score": 32,
                  "content": "Yeah, I have to agree. If they get to call Women \"Girls\" then why can't Women/girls call Men \"Boys?\" Also, definitely NTA.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 25,
              "content": "Sounds like you're definitely NTA",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 36,
          "content": "IMO the men who are a part of groups like this are there to listen and learn, and spread what they have learned to people who are NOT in the group.",
          "id": 165,
          "comments": [
            {
              "score": 12,
              "content": "People who are not the target support demographic are welcome to participate, not to be the loudest voices in the room.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 111,
      "content": "INFO: why do you invite men to your women in STEM group, and why do you keep calling women \"girls?\"",
      "id": 167,
      "comments": [
        {
          "score": -116,
          "content": "Our groups are open to all. Anyone can join any of the diversity groups to allow individuals to experience different perspectives. \n\nI refer to myself as a girl, my friends as girlfriends, my male friends partners as girlfriends and wives... but I can see people getting triggered due to this being about work.",
          "id": 168,
          "comments": [
            {
              "score": 126,
              "content": "Thats not the point, the point is that you don't call the men \"boys\" and that over the years \"girl\" has been used to dismiss women. Same as \"female\" used as a noun while not using \"male\" as a noun.\n\nAlso, are we still using \"triggered\" in 2021 like this? Being triggered and having triggers is a real and painful issue that doesn't happen when someone merely points out your internalized misogyny.",
              "id": 169,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 103,
              "content": "It’s not about people being triggered; it’s about professionalism. You work in a heavily male-dominated field where women have to fight to be taken seriously and recognized for their contributions. You’re doing a huge disservice to other women in your field by referring to them as girls. How would you feel if a male colleague referred to your colleagues as girls?  It’s a term that’s fine in casual conversations and outside of work, but if you’re working with someone female who’s over 18, woman is the appropriate term to use.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Ugh babe I was on your side this whole post but you’re just making yourself look bad now",
              "id": 171,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "People aren’t “triggered because it’s about work.” They’re understandably upset that you repeatedly devalue women’s existence by referring to full grown adults as girls but never refer to adult men as boys. You need to understand that your words matter, both at work *and* out in the world.",
              "id": 172,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I’m in stem. I refer to my coworkers socially as girls. We have non-work sponsored girls nights and such. But if I wouldn’t refer to the men as boys in a conversation I don’t call the women girls in that conversation. If I use guys or dudes for the men I call women gals or ladies. You can be casual and not use a word that also is the section of a store for children.",
              "id": 173,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}