{
  "post content": "I(24F) have been dating Jay(28M) for four months. He is handsome, smart, funny, well-educated, has an awesome job, and is a sweetheart. Sunday he had a whole day planned for us. We were going to walk a nature trail and then go back to his place for dinner he was making. I was so excited because it was going to be the first time I'd be at his house. Since we were hiking he said I could bring my dog Shelby with us.\n\nHe made us a roast and some vegetables for dinner. I finished my plate before Jay did and took it to the kitchen. There was still about half the roast left and it was close to Shelby's dinner time so I took half of the half of roast and some still raw vegetables from the fridge to put on a plate for Shelby. I was carrying the plate to the back door with Shelby to feed her outside and Jay asked me what I was doing. I told him feeding Shelby.\n\nJay said something like \"Well that's not dog food.\" Jay knows I mainly feed Shelby a raw diet. I opened the door to put the plate down for Shelby and Jay got up, took the plate away from her, went to the kitchen and came back with it wrapped up in tinfoil and told me to leave. His excuse was that he made dinner for me and him, not me, him, and my dog and that I should've asked before I helped myself since he would've used his leftovers. I did leave but not before telling him that he made that meal for us so I could do with some of it as I pleased and he knew damn well how I feed Shelby. I tried talking to my friend about it later that night but she said Jay was right to be upset but this friend has never really approved of how I treat my own dog so I feel like she was probably a bit biased and the wrong person to ask.\n\nAITA for just feeding my dog like I normally would?\n\nClarification: She does NOT get restaurant food daily, I eat out maybe 4 times a month. If what I eat is dog safe or the restaurant makes food for dogs on request, THEN I bring some home for her. Shelby's daily meals are a bit of brown rice, raw vegetables, and ground chicken hearts and beef livers. The hearts and livers are boiled just enough to kill bacteria and that is all with the approval of Shelby's vet. I asked Jay how he prepared the roast so I could know if it was safe to give her. That's also why I got her fresh, unused vegetables from the fridge.\n\nUpdate: I accept that Im the AH for what I said and did to Jay. Some of these responses were harsh but I see now how and why I was entitled. Thanks to people that responded to the actual issue. Others going on about her diet, thanks for the concern? but I came here to ask about Jay. Not get into a debate about dog foods. Shelby's been on her diet for 6 years and is a healthy and active puppo, that's all I and my vet need to know. As for Jay, I apologized to him and he did accept my apology but he broke it off. He said it was the last straw for him over me doing things without asking first. He has talked to me about taking things off his plate or his drink without asking before. I've tried to do better but keep slipping up. I didn't realize I was that bad about it so I'm going to work on myself for the next guy. For people that said not going to his place for 4 months was a red flag, that was my decision that he respected. I don't want to go to someone's house or them know where I live the first few months of dating and getting to know each other.",
  "id": 1,
  "comments": [
    {
      "score": 44913,
      "content": "Yes, YTA.\n\nYour (now ex–) boyfriend made a special meal for you. You took a large hunk of that special meal and gave it to your dog. Not only that, but you did so knowing it would upset your (now ex–) boyfriend. You should have brought dog food to feed Shelby. You should not have fed Shelby with people food, and you should particularly not have fed your dog with the special dinner your (now ex–) boyfriend prepared for you. It is wholly irrelevant that \"Jay knows \\[you\\] mainly feed Shelby a raw diet.\"\n\nEDIT: Also, the title of your post is misleading. Table scraps are what's leftover on your plate after you finish eating. They are not a quarter of the roast your boyfriend prepared.",
      "id": 2,
      "comments": [
        {
          "score": 17185,
          "content": "I guess you haven’t been grocery shopping lately. Roasts are expensive, groceries in general are expensive! You didn’t even bother to ask if he minded if you feed your dog. You aren’t entitled to food you didn’t pay for or make. YTA",
          "id": 3,
          "comments": [
            {
              "score": 11021,
              "content": "Yes! AND OP also helped herself to the veggies… in his fridge… that he hadn’t offered or prepared. Even veggies have gone up in price. \n\nThe entitlement is astounding.",
              "id": 4,
              "comments": [
                {
                  "score": 6208,
                  "content": "Helping yourself to the contents of someone else's fridge the first time you're at their house is pretty astonishing too. I get that they're dating, but I would definitely ask until I'd feel \"at home\" at their place. And that wouldn't be during the first time I'm there.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1658,
                      "content": "Yeah, I do think when you're dating there's some leeway but not the first time you go over there! At my boyfriend's place it's completely normal for me to eat snacks and stuff without asking but the first time I was there I hesitated to even go into the kitchen myself for a glass of water lol",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 212,
                      "content": "To this day I feel horrible embarassment and shame because i made unknown bacon at my friends house (I had been there a lot).\n \n No one stopped me to say it was their new room mates bacon. He did NOT like me and I literally showed up 2 days later with 7 different packs of bacon for him. He still didnt have it when he wanted it....\n \n Food is not fun and games when you didnt pay for it. And to just take it or give it away then? Yea...",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 189,
                      "content": "First time there and after a special day which he not only planned, but executed.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "Not to mention he even said it’s not dog food but she proceeded to give it to her dog anyway!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 44,
                      "content": "Hell there's friends I've known for ten years and I still ask if I can put my beer in the fridge, let alone if I can take something from there. Fridges are private.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "My only addition to your comment would be: unless you sleep over the first time there, then the fridge is in bounds for communal snack/beveridge storage needs. \n\nOP is so far past the boundary, the boundary is a dot to her.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "yea.. Idk I am a people-pleaser but my immediate thought when reading was, I would've naturally just asked \"hey, mind if I give some of my rest to my dog?\" Same about adding veggies. Unless you've already dated for very long or its your home and your food, you just ask, its the polite thing.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "OMG the first time, I missed that. OP YTA so hard.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": ">I get that they're dating, but I would definitely ask until I'd feel \"at home\" at their place. And that wouldn't be during the first time I'm there. \n\nHonestly, I would ask even if I was \"at home\". Simply because they might have had plans for those leftovers or food. Simply put, if I didn't buy the food for myself, I generally ask before helping myself.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Ikr. If I were the boyfriend I would be wondering ehat she would be doing the next time she was invited. Throw away something she didn't approve of? Go through his medicine cabinet? Use his toothbrush because they are a couple?",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1799,
                  "content": "You have been dating him for four months. You were a guest in his home. And you made a plate of leftover roast for your dog without asking?! Do you even understand boundaries?\n\nAnd your statement that he made that meal for the two of you so could do with some of it as you pleased? Holy hell that’s such a lack of basic courtesy and understanding of where you are in a relatively new relationship as to be astounding.\n\nNGL, I’d be done with you. This is just so weird and off-putting.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 743,
                      "content": "Yup, op, yta. \n\nYou took food that your bf probably had plans for. I almost always eat all my leftover food. I cook a big dish and eat it the rest of the week. That roast was probably expensive, particularly these days with cost of beef being so high.\n\nBut even if cost wasn’t so high, it’s not your food. It’s food that your bf made so that he could share it with you. The food is actually his. I don’t understand how you could not understand this. \n\nImagine being invited to someone else’s house for dinner. After the meal, you just wrap everything from the fridge and take it without a word to your host. This is in essence what you have done. I mean why not just take your bf’s furniture home with you too.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 387,
                      "content": "Absolutely!! This story would be going round to friends years later like, \"You remember that atrocious girl I was dating? The one with the dog. God, what a shit show that was.\" \"Duuuude, you so dodged a bullet!!\"",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 164,
                      "content": "It's nice of OP to have made a HUGE red flag so bright and large that a man smitten enough to plan a wonderful day with his sweetie including hiking and a fabulous meal will see how truly wrong she is for him.    \n\n\nSo, yeah, YTA, but thanks for doing your (now ex-) boyfriend a huge service by pointing out how wrong you are.  He deserves better.  \n\n\nMaybe OP will learn how to treat someone better from this experience, and she'll treat her next bf better than this one.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 151,
                      "content": "And it was *her first time at his home* at that!",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 304,
                  "content": "Yes, OP was very rude. My MIL feeds her chihuahua raw and she always brings his meals in Tupperware and puts them in the fridge. We have a ton of meat like venison, beef, pork, and chicken, but she'd never dream of just grabbing some of the food we've prepared and give it to her dog. The bits of grisle on her plate she didn't eat? Sure. That's table scraps. NOT a big chunk of lovingly prepared roast and just helping herself to raw veggies ffs.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 97,
                  "content": "His fridge, exactly.... being in his house for the first time!!\n\nTotally YTA",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "And plated it up on an actual plate that wasnt her property.  I love my dog to pieces. He has the best avalible to us but he has dog bowls and we have people platea. Never the twain shall meet",
                  "id": 23,
                  "comments": [
                    {
                      "score": 27,
                      "content": "AND giving it to dog even after BF said no! \nEdit spelling",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "Yeah this took me back a bit.\nThe audacity to go and grab what he could have eaten for a couple of days and feed it to her dog!\nI would have been mad too.\nI bought a small roast a couple months ago and it was outrageously expensive.\nIf op treats her dog like it's her baby, then any responsible mom will pack her furbaby food knowing it will need to eat. \nThe end.\nShe isn't entitled to wasting her boyfriends expensive dinner because she didn't prepare.\nI'm honestly shocked she doesn't see how rude and entitled she is.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "Right?! I carefully plan out what meals I’m making during the week, which includes having the veg I need on hand for the meals. If someone just took them it would screw up my meals and make me run errands I wouldn’t have had to otherwise. The audacity!",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "> I did leave but not before telling him that he made that meal for us so I could do with some of it as I pleased \n\nYeah, the entitlement is disgusting. This comment here \\^\\^\\^ just pushed it way over the top. YTA x 1000.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "At only four months too! I’d get that she’d think his food is her food if they’ve dating for years, but four months is still the “get to know each other stage.” And then to come back with the meal was for them so she should “do with some of it as she pleased” is just so entitled. Feed your dog however you like with your own damn food.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Totally missed that part that it was from his fridge! I don’t even take a beverage from someone’s fridge without asking first. Can’t imagine taking food from their fridge without asking",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1181,
              "content": "I made a pot roast two days ago, cost just over 30$ - the roast alone was 25$. I only give my cat a piece once I know everyone had a plate, and/or there’s like a tiny chunk left.",
              "id": 30,
              "comments": [
                {
                  "score": 578,
                  "content": "I saw an old recipe for pot roast pop up on a site and it was called \"budget-friendly.\" It called for a five-pound chuck roast. Not on sale, that would be almost $40 worth of meat. Not very friendly!",
                  "id": 31,
                  "comments": [
                    {
                      "score": 841,
                      "content": "She took HIS leftovers and food from his fridge! Unbelievable. Not scraps from her plate. Just wow.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "I just saw chuck roast on sale for $10.99 a pound. How the hell is that a sale?",
                  "id": 33,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2984,
          "content": "yeah I was imagining like fat trims, chewy bits.  Half a plate wtf a roast not raw either like she says she feeds the dog",
          "id": 34,
          "comments": [
            {
              "score": 2072,
              "content": "See, that’s the thing too! It’s not “a raw diet” and roasts are super super fatty. Half a roast is a great way to kill your dog with pancreatitis. A raw diet is a carefully measured lean meal, not half a cooked expensive-ass fatty roast your boyfriend spent real money on and made special for you.",
              "id": 35,
              "comments": [
                {
                  "score": 786,
                  "content": "I made the mistake of giving my dog a little leftover piece of boneless skin-on chicken thigh. My wallet is now $2k lighter and I’m pretty sure that my car will never smell the same again.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 175,
                      "content": "Ohhhhh noooooooo\n\nIf I had a empathy award I would give it to you.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Me and my siblings are constantly trying to get our immigrant parents to not give our dog so much leftovers. America treats dogs very differently from where they're from it's such a battle. Nothing's happened yet but its only a matter of time.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Lol, we lucked out I guess at $1K and stains on our patio.",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 466,
                  "content": "Raw diets are dumb anyways unless medically necessary. All this crap about \"what they eat in the wild/nature* yada yada. Do you know how long dogs live in the wild on a diet like that? Like 5 years. Plus there's no real benefit and the risks to the pet and to people far outweigh any pet mom blog nonsense.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 359,
                      "content": "And domestic dogs are hardly wild animals. Humans have genetically modified dogs so far beyond what is natural it’s ridiculous to make any argument about what they’d eat “in the wild.”",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "100% agree. And there's a reason why vets have been formulating dog foods for YEARS. They are scientifically formulated to be a full, balanced diet. The raw diet is the biggest fad that I wish would go away. It's similar to people saying, \"People did just fine without vaccines and medicines back in the days!\" when the average age you lived to was 40's. 🤦‍♀️",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "Dogs have co-evolved with humans for at least 20,000, probably more than 30,000 years.   \nTheir 'wild' diet isn't wild any more. They've been eating our cooked scraps for millennia (and we've been cooking since before dogs) and have evolved to that diet (as have we!).  \nThe 'raw food diet' for pets or humans is scientific bunk and woo woo.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "I've been told by my vet and the rescue I adopted my dog from that while some foods are safe for dogs or cats, it's bad to feed them seasoned food. It has to be cooked specifically for them without seasoning.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Furreal. From top to bottom, canine diet to social cues, OP is super clueless. I’d have kicked them out too.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 30,
                      "content": "It really depends on the seasoning, though I find it very difficult to believe that OPs ex cooked them a “dog safe” roast. Who does a roast with no salt and no onion?\n\nMy mom feeds her dog kibble alongside home-made venison stew with rosemary. Retirement has made her a professional dog mom 🤣",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "And imagine the sodium content of the roast.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Yea I don’t think OP understands what a “raw diet” is. I doubt this roast was prepared in a way that was safe for dogs. Many spices used in cooking can have adverse effects on dogs and hurt them in the long run.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "A raw diet should include a lot of organ meat too, since that’s where most of the micronutrients are. Just muscle is like giving them just cake.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "ugh, pancreatitis. reminds me of the time i came home form work and went to change, i come into the kitchen where there's a roast chicken sitting on the counter while my mom's finishing the sides and all the skin is gone. i asked my father what happened to the skin, thinking he ate it. nope, he stripped it all and fed it all to my dog. in the five minutes i was home. \n\nshe got gastritis and/or pancreatitis. $280 vet bill. he paid. but i couldn't get him to stop all table scraps until she got a chronic ulcer about 5 years later. \n\nanyway, OP doesn't know what she's doing. i have no trouble believing that her vet told her a raw diet was suitable (though my company has seen quite a lot more salmonella testing since that trend started), but that's assuming that she's following the recommendations or supplying from a real raw food company, not feeding her dog half a roast from someone else's house.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Seriously that's how my grandma's two dogs (mini schnauzer and maltese) got it, she wouldn't stop feeding them human food, and for some reason dry cat treats. Now the dog has like no teeth for some reason and ugh, poor thing.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Not only that, but some of the things you cook with are poisonous for dogs. I usually use whole garlic when I am cooking a roast, which is toxic for dogs. \n\nOP should have brought the food for her dog with her and not relied on the contents of her bfs kitchen for dog food. It is just rude to not ask before you take leftovers or things from the fridge. And the title calling them \"table scraps\" is misleading AF. A quarter of a roast is not \"scraps\".",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Nevernind seasoning added to the meat.\n\nI decided she is YTA for the dog alone when mentioned taking roast to the dog and RAW diet. Reading further just confirmed that decision. She took dog without even knowing what will be for dinner, if that food will be suitable for dog and what would the dog eat if the meal would've been even more unsuitable for dog (I don't know, pasta with lots of garlicky sauce?).\n\nSo, you are YTA for the dog, and entitled $hit for the boyfriend. You are entitled to normal human things like respect, consent, privacy, your own things. You are not entitled to someone's else prepared food, unless you paid for it. If you gave the dog a bite from your plate as a treat (1 bite) or some real scraps (that no one would plan to eat(, then one thing. Now you didn't give scraps, you gave leftovers, and not even yours.",
                  "id": 53,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1345,
              "content": "I was also picturing “half of the portion she didn’t eat”. But that’s not what OP did. \n\nOP ate her portion, and then took her empty plate in to the kitchen. \n\nThen she *took half of the roast* that remained on the serving platter and gave it to the dog. \n\nWhat the fuck. \n\nThat’s an expensive portion of meat that took hours of cooking and seasoning and care. The leftovers would feed me for a day or two. \n\nThe dog literally gives no shits between a cheap, raw Chuck steak (that’s actually healthy for it) and this carefully prepared dish that’s definitely more expensive (and probably too salty to be healthy, if seasoned). \n\nI give my dog unhealthy people food, too, if I’m not going to eat it. But I am aware that he’s old and on his last legs and I don’t pretend meat soaked in Worcestershire sauce and cumin and thyme is good for him. \n\nA “raw diet” for a dog does not mean giving it “any kind of meat”. \n\nI would be understanding of someone in my life choosing a healthy raw diet for their dog. But giving it a $10 portion of unhealthy cooked meat is going to be a no.",
              "id": 54,
              "comments": [
                {
                  "score": 558,
                  "content": ">The dog literally gives no shits between a cheap, raw Chuck steak (that’s actually healthy for it) and this carefully prepared dish that’s definitely more expensive (and probably too salty to be healthy, if seasoned). \n\nMaybe I'm picturing the wrong kind of roast dinner, but in my experience the meat is slow cooked with carrots, potatoes, and onions. Onions are toxic to dogs. I don't think taking the onions off the meat before serving it to the dog would un-contaminate it.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 220,
                      "content": "It would not, and if he used any of those seasoning blends that contain onion powder (ie. 80% of them) that would make things even worse.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "I'm assuming it was like a Sunday roast so it was just meat (probably still seasoned though). But even so the entitlement of OP is crazy even if it is just plain meat and veggies",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 31,
                      "content": "That would be a pot roast. A roast could also mean just the meat roasted in the oven on its own.",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "I misread at first and thought she gave her dog what was left on her plate - I thought she had taken a large piece, only eaten half, and gave what she didn’t eat to her dog - and I was still upset for BF.  It’s fine if OP wants to invest in a raw diet for her dog - BF did not invite the dog to eat roast and did not decide the dog needs what the humans are eating.  At a minimum OP needed to ask, and honestly needed to pack a meal for her dog out of her budget.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "My dog gets table scraps, the scraps my child doesn't eat or make it on the floor. That's what I was thinking.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 697,
          "content": "YTA for feeding your dog a cooked and seasoned roast, OP! There's feeding raw, and then there's feeding something that was seasoned for humans. On top of everything else, don't claim you \"feed raw\" and then tell us you are feeding your dog human-seasoned meat and vegetables. Jeez.",
          "id": 61,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 266,
          "content": "Not to mention roast is usually made with onions garlic, both of which are bad news for dogs.",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "I was prepared to stand up for OP here. My husband and I have a little guy who means the world to us and he’s my husband’s seizure alert dog. He eats chicken and rice with veggies and gets his own plate of whatever I’m cooking (minus seasoning and unsafe things) generally served on his very own people plate. I do his dinner before I feed us. Is baby- ya know? BUT- *seriously? a quarter of a whole roast off of someone else’s dishes?* I would have packed a Tupperware container or ASKED- or fed the dog when I got home. Holy crap the entitlement.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Yeah this an important point here, the title is all wrong.\n\nI feed my dog \"table scraps\" all the time. If I'm eating a sandwich, my dog gets the \"last bite.\" If I'm eating steak, I'll cut off a small amount and give my pup some really small pieces and then let her lick the plate. What I don't do is go into the kitchen afterwards and take half of the remaining pot roast and give it to the dog.\n\nAnd I sure as HELL wouldn't do that if I was at someone else's place because I'd figure those leftovers are going to be their lunch the next day\n\nDefinitely YTA",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I genuinely don't understand OPs logic behind this 🤦🏻‍♀️ \n\nIf I were her (now ex) boyfriend, I'd be incredibly hurt. She didn't even bother to ask him.... the fuck?",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Wait! Don't forget that she also went to the fridge and took out fresh vegetables to feed her dog. So it wasn't just 'table scraps' as OP puts it.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I thought she was saying that she took half of the roast left on *her plate* to give to the dog but then I realized she was saying she gave her dog a QUARTER OF A ROAST that someone else bought and prepared.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "She would have been kicked out of my house too had she done this. \n\nYTA",
          "id": 68,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19518,
      "content": "YTA, a quarter of a roast is not \"table scraps\". How is the fact that you mainly feed your dog a raw diet at all relevant? Also holy entitlement batman at \"You made that dinner for me so I can do with it as I please!\" - by that logic it would have been perfectly acceptable to flush it down the toilet.",
      "id": 69,
      "comments": [
        {
          "score": 7076,
          "content": "AND USED DUDE'S DINNER PLATE!  That's why he wrapped the whole plate and just gave it to her. \n\nYTA..YTA...YTA!!!",
          "id": 70,
          "comments": [
            {
              "score": 2645,
              "content": "YTA\n\nAgreed. The plate bothered me as much as the rest TBH. \n\nOP your friend not agreeing with you wasn't bias, perhaps you could speak to the friend to get a better perspective as they know the situation better and you need help in understanding how your behaviours with the people in your life, and your dog, may have to change.",
              "id": 71,
              "comments": [
                {
                  "score": 1705,
                  "content": "I am 100% a crazy dog lady, and I'll let my dog \"pre-rinse\" a plate with dog safe scraps on it *in my own home with my own plates*! I *know* it's gross and not something the average person will be comfortable with so I'd never do it as a guest. Also as a crazy dog lady, if we're going to be out around my dog's dinner time, I bring her food and travel bowls with us instead of feeding her whatever random meat happens to be lying around.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 1187,
                      "content": "If I trust the dishwasher to clean up after raw chicken, I can trust it to take care of dog slobber.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 288,
                      "content": "Even without running a special “sanitizing” cycle most dishwashers get hot enough to kill harmful bacteria. What the heat doesn’t get, the detergent absolutely will.",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 45,
                      "content": "Yes to all of this! As a fellow crazy dog person, part of your obligation is to realize that not everyone is the same way... especially not with other peoples' dogs. For example, my pups are allowed on furniture, but if we're over at someone's house who doesn't allow that, we make sure they stay off the furniture. Expecting your dog to be included in a really nice meal (and a quarter of a roast is not \"table scraps\")? And to use someone else's plates? Beyond entitlement.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "Same but we just run our dishwasher on sanitize cycle. Lol",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Not only that! She also took whole ass OTHER unused ingredients from his fridge and gave them to her dog!",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1628,
          "content": "YTA, OP. A roast, with seasonings and probably garlic, is NOT fit for a dog to eat. And nowhere near raw. It's also not recommended to feed a raw diet at all. I've heard that from many vets. \n\nAlso, roasts are freaking expensive. He put a lot of thought and effort into making this meal for you, and you showed extreme disrespect. \n\nI definitely suggest you talk to your vet about finding a better diet for Shelby, and learn not to be so greedy going forward.",
          "id": 78,
          "comments": [
            {
              "score": 232,
              "content": "The only time I’ve seen a raw diet make sense for a dog was when the dog was allergic to beef, pork, chicken, corn, potatoes, wheat, and barley. That eliminates basically all dog foods.",
              "id": 79,
              "comments": [
                {
                  "score": 200,
                  "content": "One of my pups is allergic to everything you mentioned. She gets special hydrolyzed protein prescription dog food. It’s expensive, but it’s what she needs, and it’s not her fault she’s allergic to life. I feel bad she can’t get table scraps, unless it’s turkey, which is a rare treat.\n\nEdit- YTA, OP. You should’ve at least asked if your bf was ok with it before deciding to feed your dog on his plate, with food he prepared.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Yeah there’s a few other things this dog is allergic to. Like grass, and every tree except eucalyptus. Do you have a link to that dog food? It’s my friend’s dog, and they just found out about the allergies really recently so they’re trying to find something that works.",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "That was my thought too with the seasonings. She has no clue how he seasoned it. She could have easily poisoned her dog. This isn’t comparable to a raw diet at all. She should have brought food for her with her.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 855,
          "content": "Lol a “raw diet” of FULLY COOKED FOOD, almost _certainly_ containing onions and garlic, both horrible for dogs\n\nOP is 🥴",
          "id": 83,
          "comments": [
            {
              "score": 36,
              "content": "I assume they salt their food too.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 678,
          "content": "\"I feed my dog raw\" \n\n*feeds dog* ***cooked*** *and seasoned meat*",
          "id": 85,
          "comments": [
            {
              "score": 32,
              "content": "“I drink my coffee black,”\n\n*pours cream and sugar into cup of coffee* lol",
              "id": 86,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Heh, I was wondering about that too!",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 248,
          "content": "Exactly. \n\nThis is the first time OP went to this man's home. She instantly got way too comfortable and was a horrible guest. The BF cooked a lovely meal for her. OP ate her share, then took a quarter of said meal (without asking) and fed it to her dog. This was insulting, inconsiderate and rude.... and I haven't even gotten to the point of feeding the dog on that man's dining plates, yet! OP may have been this man's GF, but she was still a first-time guest in his home.\n\nGood on him for asking OP to leave. She behaved exceptionally rude.",
          "id": 88,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 88,
          "content": "OP should hook up with the dude who took a weeks worth of homemade lasagna home for his family & left his girlfriend to starve.",
          "id": 89,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 43,
          "content": "Right? Reminds me of the guy who took the leftover lasagna his girlfriend made for a special dinner and fed his family of 5 for two days leaving her with no food for the week.",
          "id": 90,
          "comments": [
            {
              "score": 18,
              "content": "I love how we both thought this at apparently the same moment 😂",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "If she does feed her dog a raw diet, why would she want to feed her a SEASONED and cooked roast? Surely the salt content alone goes against dog dietary recommendations. At that point why not go buy the dog a burger and fries?",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Also what pet owner taking their dog places they know they won't be home for dinner, this was all planned let's not forget, doesn't bring their dogs dinner with sonthe dog eats at their regular time???? \n\nCrappy gf and crappy pet owner.",
          "id": 93,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "It’s also just a terrible example of raw feeding.\n\nIf I took my dog somewhere overnight, I would have a meal for him.\n\nAnd raw veggies (can’t be broken down by dogs, needs to be steamed or puréed) and roast is missing calcium, zinc, B1, omega fatty acids, magnesium, and manganese just to make a few essential nutrients.\n\nNot an appropriate meal on top of being rude and entitled. YTA.",
          "id": 94,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12628,
      "content": "YTA.  Half the roast?  Let me introduce you to this new concept called LEFTOVERS.  Its this amazing thing where you eat some food later or the next day.",
      "id": 95,
      "comments": [
        {
          "score": 5610,
          "content": "When OP said table scraps, I thought it was the food that they left unfinished at the table, not half a pot roast in the fridge? Like that's so many new meals from that half pot roast. Sandwiches, tortilla pizza, tacos etc",
          "id": 96,
          "comments": [
            {
              "score": 2064,
              "content": "FR!! When I give MY dog table scraps, it’s usually bits of fat, tough chicken skin, the last little bite on the plate. If there’s enough food to feed a person, then those are leftovers for people, not the dog.",
              "id": 97,
              "comments": [
                {
                  "score": 777,
                  "content": "Table scraps are what you scrape off of your plate when you are finished eating,  not going into the kitchen and cutting off a quarter of an expensive roast that was bought and cooked to impress you, not your dog.  Jeez, I have a Chihuahua and if I was taking my dog to someone's house for dinner, I would bring his dinner with me.  Do you have an idea how much a good roast costs these days? No doubt he was hoping to get a couple more dinners and sandwiches out of it. I can't fathom the presumption of just helping yourself to an expensive roast at another person's home for my dog and let me assure you my dog eats very, very well, all 9 lbs of him and I would never presume I could just cut pieces off of a good roast for him.  I would even ask if it was ok to scrap my plate into a little bowl for him.  You are living in another universe OP; this was incredibly rude.  If you want to continue  seeing this man then you better find some way to give him a spectacular apology.  Frankly, I can't even think of a way to apologize that would be sufficient because you showed such a lack of manners, good sense and common decency. It better be a super spectacular apology.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 14,
                      "content": "also, not to mention that roasts usually use A LOT of salt. why would you ever want to feed your dog that?? this whole situation is a recipe for disaster",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 611,
              "content": "Yep, I was expecting maybe a small bit of the meat or a green bean or something. Not an entire PLATE with half of the remaining food lmao.",
              "id": 100,
              "comments": [
                {
                  "score": 358,
                  "content": "Oh yeah, there's no cause to be mad, really, if a Dog's owner takes the fat, fristle, or small left over bits from their plate to feed their own dog. Not an issue.\n\nBut going back to the kitchen to saw off a chunk of the roast (and raid the fridge for some raw veggies) to feed the dog? What the hell? How entitled is this person?",
                  "id": 101,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Into the fridge of someone’s house she’s never been too! Obviously he’s very private and reserved if it took 4 months to get her there.",
                      "id": 102,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 42,
                  "content": "Yeah, I was picturing her sneaking veggies under the table for the dog or \"accidentally\" dropping bits like my niece does for the dogs to hoover up.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Right?? I heard scraps and I thought \"a tiny piece here and there\" not HALF the roast!!!",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Yes! Like how wealthy is this girl that she A: doesn't understand the concept of leftovers and B: that food is Hella expensive and most people need to eat their leftovers so that, you know, *they can afford to eat.*\n\nI spoil the SHIT out of my dogs. Treats, literal laundry baskets full of toys, multiple beds, with their own blankets, expensive dog food, treats, bits of my own food, supplements, enrichment toys, big ass yard they can do whatever they want it, Barkbox, regular walks to different places so they don't get bored, you name it they probably have it.\n\nBut I would NEVER give them 1/4 of roast + vegetables out of a host's fridge without permission. NEVER. Especially with inflation pushing meat prices up significantly!\n\nThis also begs the question, did OP not plan ahead for her dogs dinner? Anytime I plan to take my dogs somewhere that *might* interfere with their meal times, I bring some kibble just in case. What if the bf had made a lasagna instead? Dog just gonna go hungry or what?",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Seriously. I bet my man was looking forward to a tasty ass sandwich the next day.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "I’m going to guess OP hasn’t bought a roasting joint recently - they’re so expensive. Yes, he earns good money but that’s food he was planing to eat. I would be pissed off too if I bought expensive meat, put half away for the next day and someone took half of that and fed it to their dog. \n\nOP did you think about what your dog was going to eat when you took her to someone else’s house? Did you just assume he would feed her? I wouldn’t make assumptions like that with my husband, let alone a new boyfriend the first time I visit his house. You didn’t even ask first! That would be the end of the relationship for me right away. Sounds like you’ve thrown away a good guy by being entitled and really rude, and you’ve still had to ask others if YTA? You definitely are.",
          "id": 107,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "It was a quarter of the roast (half of the half that remained after the humans ate it), but yeah. Meat is pricey and it's rude to take so much of the leftovers without asking, let alone feed it to your dog without asking.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "OP should also be introduced to this new concept called ASKING.",
          "id": 109,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8812,
      "content": "YTA.\n\nYou did not feed your dog table scraps. You took half of the leftover meat from the meal to feed to your dog.",
      "id": 110,
      "comments": [
        {
          "score": 3263,
          "content": "And the dude’s vegetables! Veggies aren’t cheap either! Imagine spending a couple hours making a nice meal for your new SO, and they raid your fridge and take a bunch of your food for a literal doggy bag. WTF.\n\nOP should post this dude’s phone number, because he seems like a catch and I’m pretty sure he’s single now.",
          "id": 111,
          "comments": [
            {
              "score": 542,
              "content": "Leftovers are not table scraps jfc",
              "id": 112,
              "comments": [
                {
                  "score": 645,
                  "content": "Serious “I’ll take the entire lasagna home to my family” vibes.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 341,
                      "content": "Hahaha. I remember that post. Poor girl spent her entire grocery budget for the week on that lasagna and then the boyfriend who asked if he could take “some” home ran off with the entire platter. Even after that, he wouldn’t even help her buy a sandwich to make up for it. And, I think he told his girlfriend it ended up being enough food to feed his family of 5 twice! \n\nMy boyfriend also enjoys preparing expensive cuts of meat. He would be livid if I took a quarter of a roast *and* his fresh veggies and just loaded it all up on a plate for my dog to eat. It’s understood that I serve myself what I am able or want to eat and whatever is left gets stored for him to finish later because that’s his grocery budget.",
                      "id": 114,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 36,
                      "content": "Absolutely \"I ate almost all of the sandwiches at the football party because I'm fat and need more food\" vibe too",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "And I’ll feed some of to to the dog",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Not to mention she used his dishes to feed the dog too without even asking him. The first time she went there. Which he might not even be comfortable with. YTA OP. Gross behavior.",
              "id": 117,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 603,
          "content": "Yeah so many people are getting distracted with whether or not it was healthy for the dog. ( it might not be, but I’m not going to tell someone else how to care for a pet they know better than me).\n\nBut just because OP was served a plate does not mean she has the right to go through the kitchen and rustle up what ever she wants and do anything with it. Not asking at all makes her the big AH. YTA",
          "id": 118,
          "comments": [
            {
              "score": 70,
              "content": "Yes. If somebody is in my home with their dog and tells me the dog is hungry and asks if we can feed him/her, I will go looking for what I have that would be dog appropriate and probably would not mind giving the dog my own food.\n\nBut if somebody who's never even been in my house before goes into my kitchen and starts taking my raw vegetables out of the fridge without asking and half of my leftover roast, also without asking! i will be upset about it. It's the rudeness of it all.\n\nPlus it sounds like OP knew she would be out till dinner time. She should have planned ahead for the dog's dinner. She's an AH for this as well.",
              "id": 119,
              "comments": [
                {
                  "score": 16,
                  "content": "Precisely I've got some beef mince in the freezer, a few whole duck, pheasant and partridge that cost me nothing and some fish and offal that only I would eat if they insist on not having the dog food I have. I have loads of blackberries and raspberries in the freezers. I could cook something up for your dog if I know you want me to feed him.",
                  "id": 120,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "My old cat sitter was allowed to eat whatever he wanted from the kitchen, as long as he wrote it on the grocery list so I could replace what he finished. He once went through my cupboards and used all of my expensive nuts and seeds that I use for baking. I was somewhat startled and asked what he had made, and he cheerfully told me he set it out for the birds, because he likes to feed the birds. \n\nI was pissed. He used something like £20 of nuts and seeds to feed the outside birds, who are all fat and healthy and eat just fine in our neighbourhood. The invitation to take food from my kitchen was for *him* to eat, not to serve as an open cupboard for all the wild animals nearby. \n\nI was really, really not happy about that.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 45,
          "content": "It’s not even leftovers until the meal is finished and her bf was still eating!",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "I wish I had an award for this! Absolutely agree lol. Aren't table scraps leftover from your plate?!",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "[deleted]",
          "id": 124,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 26,
          "content": "I'm also hung up on how she finished her food first and then left the boyfriend at the table alone?? I'd bet he was already taken aback by her getting up without regard for him being finished and then realizes it's not just to drop off her plate and come back, instead she's carting off half the remaining roast to feed to her dog. This is one of the most obvious YTA verdicts I've seen recently. It's wild someone could get to adulthood with this little social awareness.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7052,
      "content": "YTA. That’s not a fucking raw diet. You’re pumping your dog full of salt and harmful chemicals by feeding her a roast. Literally any vet says not to feed dogs human food.",
      "id": 126,
      "comments": [
        {
          "score": 2047,
          "content": "A raw diet is also not healthy for a dog and has been linked to heart disease.\n\nOP is the biggest asshole for not doing their research.",
          "id": 127,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 271,
          "content": "This. YTA to the dog. If you want your dog to eat fresh food, you cook it separately. I separately cook dog friendly, salt free beef and chicken to use for dog treats.",
          "id": 128,
          "comments": [
            {
              "score": 17,
              "content": "My mom used to have a dog that had a ton of food allergies so she usually cooked a combo of meat/eggs/rice/veggies that were approved by the vet. But the vet emphasized that the home cooked dog food should have no seasoning and the dog shouldn't eat table scraps, not just for allergy reasons but eating salt regularly can be really bad for dogs and cats. OP is definitely an asshole especially because the roast also likely was cooked with onion and garlic which is very toxic to dogs!!",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "This needs to have more upvotes. It wasn’t just her decision to take the roast, it was the superiority in her tone about her dog’s super special “raw diet” that is not, in fact, a raw diet or anything that a dog should even be eating with any regularity. \n\nSo YTA for a plethora of reasons OP not the least of which because you’re an inconsiderate gf.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Thank you for saying this. Roasts are typically covered in garlic and other spices toxic to pets.",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Yeah I also do not believe that the vet is okay with the \"diet\" she is feeding. Formulating your own raw diet is really hard you are almost always going to be deficient in some nutrient. If she is not supplementing her dog, it will have medical issues down the road from the diet.",
          "id": 132,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "Exactly! You don’t just put the remainder of your dinner on a plate and say “I feed raw.” You buy an appropriate complete diet or you put a lot of effort into the appropriate ratio of muscle, organ, and bone to create a raw diet. It’s a lot of work. Not just here’s some leftovers doggy.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5064,
      "content": "Bruh, a quarter of the roast isn't table scraps.... I thought you were going to let the dog lick your plate or something.  YTA obviously and can I borrow your bf? Lol",
      "id": 134,
      "comments": [
        {
          "score": 761,
          "content": "Hahahahaha yes this is what I thought to. I was like okay so she couldn't finish her plate and gave the rest to her dog no big deal, but a quarter of the roast? Come on",
          "id": 135,
          "comments": [
            {
              "score": 82,
              "content": "I read it wrong and thought she meant half the roast left on her plate aka \"I took a bite out of this and don't want my mouth germs all over my leftovers\" which is totally fair game to give to a pupper imo. I had to go back to see SHE TOOK THE REMAINING HALF ROAST for the dog?! \n\nCome on. There's no way she didn't know not to do that. She specifically chose to do that.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 299,
          "content": "I'm pretty sure her BF has declared himself a free agent, so...",
          "id": 137,
          "comments": [
            {
              "score": 45,
              "content": "I know. The Heisman he gave her is one for the ages. OP is going to be the star in his future stories about shitty dates of the past.",
              "id": 138,
              "comments": [
                {
                  "score": 12,
                  "content": "I'm picturing a little plaque on the Heisman: \"OP, 2022. Table Scraps vs. Leftovers\"",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 297,
          "content": "If it was a chunk of fat and a carrot or something… but a whole serving. Yikes.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "From the sound of it Jay is likely single now, so you may be in luck! 🤣",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3569,
      "content": "YTA. You feed your dog a raw diet. You should absolutely know better that most seasonings and vegetables involved in a roast, like onions and garlic, are potentially fatal for a dog to ingest. \n\nYou are also ridiculously entitled to do so without asking. Where are your manners? On the floor with the dog?",
      "id": 142,
      "comments": [
        {
          "score": 1319,
          "content": "Yea I work in vet med and I saw roast and immediately knew where this was going. But honestly most people (not all) that feed raw have absolutely no idea what they’re doing, and their pets are not healthy. It’s a fad thing and they just throw whatever they think is good into a bowl for them, no accounting for vitamins and nutrients to create balanced meals. I had to explain to a woman that her dog having diarrhea it’s whole life is not normal and it’s because she exclusively feeds it tacos. Literally seasoned (but raw) ground beef, lettuce, tomatoes and cheese. He was also pretty close to having pancreatitis.",
          "id": 143,
          "comments": [
            {
              "score": 303,
              "content": "This is so sad! I had a foster for six months and occasionally treated her to a home cooked meal. I researched EVERY ingredient I wanted to give her. If I was making tacos, I browned all the meat, scooped out her portion, THEN seasoned all human meat. I would never even think about trying to switch to a raw//home made diet without consulting a vet or at the minimum doing extensive research on how to make it well balanced.",
              "id": 144,
              "comments": [
                {
                  "score": 43,
                  "content": "Mmmm. Human meat.",
                  "id": 145,
                  "comments": [
                    {
                      "score": 20,
                      "content": "The other other white meat.",
                      "id": 146,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "I think by \"raw\" OP means they just give their dog people food all the time.\n\nThey just tried to make it sound better.",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3225,
      "content": "YTA\n\nIt would have taken 5 seconds to ask.\n\nA quarter of a roast is *not* table scraps, you're also the AH for misrepresenting the situation. \n\nJust because he knows the bonkers way you choose to feed your dog doesn't mean he wants to spend his hard earned money and effort to feed him the same way.",
      "id": 148,
      "comments": [
        {
          "score": 690,
          "content": "I don’t think she misinterpreted, I think she was willfully entitled.",
          "id": 149,
          "comments": [
            {
              "score": 263,
              "content": "She was definitely being manipulative with her choice of words.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "Completely entitled and inconsiderate behavior after ONLY 4 MONTHS!!! This is the bonkers part of the story for me and I like dogs more than most humans. This dude should cut his losses and move on.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Yeah, like a few strips and some leftover steamed or raw veg, sure!\n\nA quarter of a chicken? That's not her chicken?\n\nIf the dog is part wolf and she bought and cooked the chicken herself that's one thing, but a small dog and someone else's chicken? What's wrong with this chick!",
          "id": 152,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "Not only did she not ask, she continued to do so after he called her entitled ass out.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2385,
      "content": "I say this as someone who feeds their dog safe table scraps all the time - YTA . Roast is expensive and for him to have bought and prepared this meal for you to enjoy and then you just put probably $10 of meat on a plate for the dog without asking is ridiculous.",
      "id": 154,
      "comments": [
        {
          "score": 1071,
          "content": "Thanks for 8 hours of work. Now let me just dump half of it on the floor for my dog I invited over to your home. He’ll get to it after he finishes licking his butt.",
          "id": 155,
          "comments": [
            {
              "score": 305,
              "content": "LOL\n\nDogs do be like \"mmm this roast is good but not quite as flavorful as my own butt.\"",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "Dumping it on the floor would’ve been way better than using ex-boyfriend’s dinner plate to feed the dog.",
              "id": 157,
              "comments": [
                {
                  "score": 30,
                  "content": "god, right. this post made me so mad, and I adore my dog",
                  "id": 158,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I have this thing where, if you can lick your own balls, you get a paper plate",
                      "id": 159,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "And not even on the floor.. on his dinner plate!! Like wtf, I wouldn’t even want that plate back.",
              "id": 160,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 206,
          "content": "Not only without asking, she still proceeded to try to feed it to her dog after he asked her not to. AND she had gone into his fridge to get out veggies for the dog without asking! The entitlement here is insane, lmao",
          "id": 161,
          "comments": [
            {
              "score": 124,
              "content": "And to top it off, it was her FIRST time at his house. Like \"Oh I know I've been here for a whole 30 minutes but lemme just raid your kitchen real quick\".",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Depending on the cut and grade of the beef and the size of the roast, it could have been a lot more than $10.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Not only that but she helped herself to other stuff without asking either and it WAS HER FIRST TIME THERE!! It blows my mind how she thinks this was okay at all.",
          "id": 164,
          "comments": [
            {
              "score": 20,
              "content": "I'll be honest, my wife and I have been together 12 years and I still ask if I can have some things. Like if she talks about a recipe using crackers, I'll ask before eating the crackers even if I'm starving. My first time to her house I didn't even get a refill on a glass of water without asking. You just don't do some things",
              "id": 165,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Yes! We also feed our dog safe table scraps, but even we, as a couple who has been together for a long time and living together, ask each other beforehand if one of us would like to have the leftovers for the day after, or if we are going to feed it to the dog. \n\nI can't imagine bringing my dog to someone's house and not bringing his drinking and eating bowl, food, and maybe a treat or something to keep him entertained. Let alone coming to someone's home for the first time and going into their fridge and helping themselves to food, like who does that... Then to give it to your own dog on their normal dinner plate. All without asking. And when confronted, continuing and giving attitude.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2338,
      "content": "INFO:  OP are you under the impression a roast and vegetables that have been cooked are somehow still raw?",
      "id": 167,
      "comments": [
        {
          "score": 845,
          "content": "Yes! Why aren't more people asking this?!\n\nA leftover Roast is not Raw.",
          "id": 168,
          "comments": [
            {
              "score": 362,
              "content": "Especially one that has been seasoned properly. Dogs don’t do well with high fat/cholesterol meats and added salt. Not to mean there are a lot of vegetables that are toxic for them. \n\nWe still let our spoiled dog lick our dinner plates with some tiny bits of food but the amount she took could have made several meals if it was used to make chili or a soup. That’s just over the top to feed a dog.",
              "id": 169,
              "comments": [
                {
                  "score": 72,
                  "content": "Tbh, I feel a bit sorry for the dog as well, because OP doesn't seem like a very thoughtful owner. She's misled about what kind of diet she feeds her dog (most of the foods she mentioned in this post aren't raw, lmao), and being a dog owner myself I know they can't handle most veggies, I've seen the consequences.\n\nI bet the dog would've enjoyed food specifically made for dogs much better. What a waste!",
                  "id": 170,
                  "comments": [
                    {
                      "score": 44,
                      "content": "And even the raw diets have added vitamins mixed in. It’s not just toss your dog whatever meat is on sale.",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "Dogs don’t tend to do good with spices / herbs in lots of cases. \n\nIn the end though… good quality dog food takes maybe 20 mins to research to find a good brand that actually provides high quality food. It will 100% work out cheaper and will 100% work out better for your dogs health.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "hahahah exactly",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Yeah… I chuckled when I read that part of the story.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Crying laughing",
          "id": 175,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}