{
  "post content": "My husband and I are fairly young. He's 18 im 21. I was talking about it with some people and i got all sorted of questions, no big deal. That is until it was, why are you married??? You're so young? Most young marriages fail! Why would you get married? Are you religous? There has to be some weird reason right? I got slightly defensive of my marriage, especially when it came to one of the people being like, i could never have handled being married that young! Like we are not anyone else and we are doing just fine. Im curious if im the A-hole here for being slightly defensive?",
  "id": 1,
  "comments": [
    {
      "score": 4,
      "content": "NAH - I got married in my mid 20s and still get that a lot.  It is not super common and very public if you wear wedding rings so people feel like it is acceptable to ask about and they are just taking an interest, or making conversation.  \n\nEither joke around with them and tell them you felt like you were on the fast track to crazy cat lady and you were trying to duck your destiny if it is a friend or in a casual setting. or I usually tell people \"it just felt like the right time\" or \"yeah pretty crazy right?\" if I don't want to have a conversation with them or it is someone I need to be professional with.  Don't let people bug you.  You make your own decisions and no matter what people are going to judge you.  If you think you did the right thing who cares what the bank teller thinks.  \n\nAlso start saving your money while you are young! DINK is the greatest time to get a house payment together.  Live off a single salary or as close to it as possible and bank the other one for a few years and you will set yourself up forever.",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "Thank you for your insight. I do appreciate it!",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Most of the time, its strangers who put their two cents in. Our family and friends have been supportive and most of them just cant wait till our little boy gets here.",
          "id": 4,
          "comments": [
            {
              "score": 2,
              "content": "That is how it was for me.  My dentist said something the other day about \"wow you are just so young to be married\" and I have a few years on you.  But people generally have good intentions, and I have found that the more you come across as having your shit together the less you get questioned.  Family and friends know you and know you have it together enough and are mature enough to make that kind of decision, but a stranger has no idea unless you \"prove it\".",
              "id": 5,
              "comments": [
                {
                  "score": 0,
                  "content": "Which is fully insane. I truly believe people should mind their own damn business but that is simply not the way of the world.",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH. They’re asking mildly dumb questions but they seem to have your best interests at heart. Sometimes it doesn’t work, sometimes (like my great aunt and uncle) it lasts forever",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "nta.  they sound judgemental.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. Your marriage is your business and yours alone. Tell them you don’t want to discuss it.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "[deleted]",
      "id": 10,
      "comments": [
        {
          "score": 1,
          "content": "I get what you're saying but the, \"Why are you married?\" Seems like such an unintelligent question! Why do you marry someone? Because you love them.",
          "id": 11,
          "comments": [
            {
              "score": 3,
              "content": "But the reality is that tons of 18 year olds love someone...until they don't anymore. Often enough a year or two later. \nYou might not like it, but nowadays it is quite unusual to get married that young and there are very few people that young who can make marriage work. The majority doesn't. \nAlso \"love\" is imo not enough reason to get married. I love my partner, I have no intention of ever leaving. Not enough reason to get married though. I realize that might be strange for you, I don't condemn marriage. I am just pointing out that marriage at your age seems strange to a lot of people.",
              "id": 12,
              "comments": [
                {
                  "score": 1,
                  "content": "I think oneof the major things that secured our marriage is that within the first month of us being married, we had to made some really hard choices and went through a major loss. My husband is also not your typical 18 year old.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Good for you (or maybe not, depends... sry for your loss). But it doesn't change the fact that people are curious because it is unusual. Get used to the questions for the next 8-10 years or avoid the topic.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband and I are fairly young. He's 18 im 21. I was talking about it with some people and i got all sorted of questions, no big deal. That is until it was, why are you married??? You're so young? Most young marriages fail! Why would you get married? Are you religous? There has to be some weird reason right? I got slightly defensive of my marriage, especially when it came to one of the people being like, i could never have handled being married that young! Like we are not anyone else and we are doing just fine. Im curious if im the A-hole here for being slightly defensive?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 16,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA - but here's my take... people love to share unsolicited opinions; it is just part of being a human in society.  As a general rule unless is it extreme; or habitual with the same people normally taking the higher road is good.  You don't want to constantly 'take a stand' on this type of stuff.   That said if it is really derogatory or say with somebody who constantly does it and then it is fine to politely do a back check on them...",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "When people ask personal, uncomfortable questions, I’ve found that the following work well:\n\n“Gosh that’s a personal question!”\n\n“Hmm, do you realize you said that out loud?”\n\n“Your questions make me uncomfortable, stop.”\n\nNTA for being frustrated. \n\nThat said, you have to realize that in this day and age, marriage has tended to be put off to a later age after people have an education, job, several partners under their belt, etc. so you’re kind of a unicorn in 2019.  Most kids haven’t even graduated high school before 18. And it is hard to imagine when you’re 30 or 40 + having gotten married as the person you were at 18 because so much changes. \n\nSo get your rebuttals in line. You’ll be dealing with this for the next 10 years at least.",
      "id": 18,
      "comments": [
        {
          "score": 0,
          "content": "Lmao im so not looking forward to that",
          "id": 19,
          "comments": [
            {
              "score": 1,
              "content": "Oh it gets better. From about 25-40 (sooner for you since you’re already married), they’ll be asking about kids. Even if you have a kid they’ll ask when there will be more. Some people just can’t help themselves.\n\nI was so happy to turn 40 which appears to be the magic number when people stop pressuring you to have kids.",
              "id": 20,
              "comments": [
                {
                  "score": -2,
                  "content": "Im pregnant with our first right now so those questions havent come yet, but once they do im gonna curve that crap so hard!",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}