{
  "post content": "I'll try to keep this short.\n\nSo, about 3 months ago, my brother (we'll call him F) became vegan. Cool, cool, idc. The past occurrence I am mentioning happened bc he went vegan.\n\nBasically, my BIG fam was getting pizzas & all 5 of them got a pizza they really, really wanted (including my vegan brother's personal vegan pizza no one else could eat) BUT me & my youngest sis, let's call her Q. We wanted a pizza the 2 of us could split but told no bc we had our \"pizza budget\" (5 pizzas) filled already. 1 was F's, 2 were my dad's & older brother's, & 2 were my mom's & other sis's. Me & Q do not fancy the other pizzas.\n\nSo, when I asked why F got a personal pizza, the pizza that used to be reserved for Q's & I's preference, but only Q & I had to sacrifice, I was told \"it was F's lifestyle, we have to make accommodations\". I was like, fine, ok, but why can't we take one of your pizzas & make it mine & Q's. My mom got upset saying that we \"like\" the other pizzas enough & we were all sacrificing other things so we could suck it up.\n\nNeedless to say, Q & I don't get pizza w/ the fam anymore & end up having to eat something else when they get pizza.\n\nNow, our ACTUAL MONEY budget is tightening so we can pay off the mortgage & car loan in 5 yrs. Yay, fine, awesome. But IK that this means my skincare & shampoo will most likely be nixed while F still gets his specialty vegan food that he doesn't even want but my mom makes him eat for \"a balanced diet\". Me & Q love doing skincare together & my special shampoos & body wash only cost $2-3 more than the rest of the fam's, a contrast to F's \\~$5-10 diffs on stuff he lets go bad. Mine & Q's skincare is only a \\~$15-18 charge every 3 months.\n\nHere's the issue: Me & Q see \"advanced\" skincare as a lifestyle. So, Im planning that win my mom comes to me saying I cant buy my shampoos or skincare bc of the budget, I'll say that if we have to sacrifice for F's lifestyle, the rest of them can sacrifice for mine & Q's lifestyle. IK this can be really petty, but Ive been sacrificing SO much lately for the sake of a budget & for my fam's lifestyles, I dont want to have to sacrifice my bonding time w/ my sis (& better hair & skin) while others, mainly F, get stuff they dont use most of the time that costs more (for example, my older brother spends a shit ton of money on his laundry bc he likes his products better & my mom spends money on clothes). Ik they wont have to sacrifice as much, either, bc Im outside the social circle that is my fam & they think my \"extras\" arent as important as theirs.\n\nIm more than willing to spend MY OWN money on my shampoos & bodywash, but NOT on my skincare bc that's for Q & I, & its less than others' \"lifestyles\" since it's less anyway but also split bw 2 ppl.\n\nTL/DR: I & Q sacrifice for my fam's lifestyle, so Im planning to throw that in their faces concerning budget cuts.\n\n&#x200B;\n\n[https://www.reddit.com/user/hungry\\_fatty/comments/le0g2v/update\\_wibta\\_if\\_i\\_use\\_one\\_past\\_occurrence\\_as\\_fuel/](https://www.reddit.com/user/hungry_fatty/comments/le0g2v/update_wibta_if_i_use_one_past_occurrence_as_fuel/)\n\nHey, so I actually just got a text after replying to most of y'alls comments. I agree w/ most of y'all  WBTA, but as I say in my update, ig in hindsight that was my plan, to be a petty asshole since Q & I didn't get pizza.  If the situation progresses & I am faced w/ this situation, I will prolly not use this argument, sooooooo, thanks :)",
  "id": 1,
  "comments": [
    {
      "score": 53,
      "content": "ESH\n\nI'm picturing a courtroom full of tweens angrily shouting \"Lifestyle!\" as if it's \"Objection!\"",
      "id": 2,
      "comments": [
        {
          "score": 15,
          "content": " Lol exactly. Jesus this was miserable to read",
          "id": 3,
          "comments": [
            {
              "score": 5,
              "content": "Agreed. ESH. So petty.",
              "id": 4,
              "comments": [
                {
                  "score": 6,
                  "content": "Somehow I’m picturing this as a modern take on the “Home Alone” family dynamic with a tinge of The Sopranos. \n \nESH.",
                  "id": 5,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -6,
          "content": "lmao, that's so true! and, tbh, I don't see skincare = veganism, it's just the way my mom used \"lifestyle\" as an argument & she likes to throw wording in my face, so I'd do it to her lmao",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 26,
      "content": "INFO: How old is everyone involved and who has a job??",
      "id": 7,
      "comments": [
        {
          "score": 15,
          "content": "Oh god. I didn't realize that OP is from another post from earlier today. In which they divulge being \"I'm now 17 and in college.\"\n\nI just assumed everyone in here was much younger from the sound of things.",
          "id": 8,
          "comments": [
            {
              "score": 18,
              "content": "I forgot to even check this so I need to thank you.\n\nAnd also my judgment.\n\nYWBTA.\n\nYou are 17 and are perfectly able to spend your own money on buying these things, while your brother (who is vegan) is 13. \n\nA 13 year old not buying their own stuff is understandable.\n\nAlso, according to another post you made 6 days ago-- you don't even live at home.\n\n> So I (17F) am currently at uni where I was assigned a uni apartment w/ 1 roommate",
              "id": 9,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -2,
          "content": "I'm 17, in uni, have a job and sizable savings account. F is I think 15, nearly 16. Q is around 12. My parents are both near their 50s. My older bro is 20, nearly 21, & lives at home rent free & has a good paying union job. (he get's the 4 yrs he would've been at uni rent free as long as he has a job) My other sis is bw F & Q.\n\n& I wouldn't mind paying for ALL of it myself, except Q uses a lot of it too. It's our bonding time & it's good for her to start young since we're predisposed to shitty genetic acne. There's my issue with it.",
          "id": 10,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 21,
      "content": "Info: You didn’t clarify who pays the bills",
      "id": 11,
      "comments": [
        {
          "score": -3,
          "content": "My DAD pays the bills. & I pay or wouldn't mind paying for extras, normally. My mom doesn't like me OR my older bro paying for extra stuff b/c \"we need to save our money\", but if she won't buy it, she doesn't let me buy it bc I'm still not 18.\nRn, I pay for my uni (even tho my older bro dropped out & got more financial support from my parents), so  I figured the least they could do was keep paying for skincare for Q & I",
          "id": 12,
          "comments": [
            {
              "score": 8,
              "content": "YTA, If your Dad is paying. Then they get to choose what your parents choose to purchase. You wouldn’t like your parents forcing you to pay your bills. Just be grateful they provide food and shelter to you. It sucks being a teenager, trust me. I just turned 20 and there are a million small things you don’t think about, that you’ll need to pay for. Just suck it up, when you are an adult and working, you’ll get to decide what you want to buy with your money.",
              "id": 13,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "ESH. It sounds like you all spend your time bickering about who gets what, and your parents let it happen. If your parents are tightening the budget to pay off loans faster, that's a benefit for everyone. Get on board with the program and see whether you & Q can contribute to the budgeting effort by finding cheaper skincare that meets your \"lifestyle\" needs, or learn to make your own.",
      "id": 14,
      "comments": [
        {
          "score": 1,
          "content": "We already buy the cheapest stuff we can & we've tried making our own (bc I love making DIY stuff) but it just didn't work.\nI understand the budget, & have already come to terms that I won't get the same college funding my older brother got for the two yrs he went bc that's already started. \nThanks for your opinion. So far, I'm just overthinking as I usually do, so I haven't actually been asked to contribute to the budgeting that way. Rn, it's mostly less eating out, which I was doing anyway since I have a meal plan at uni. Thanks again.",
          "id": 15,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "Im sorry but skincare does not demand the same importance as someone needing to eat.\n\n\nGet a job, buy your own skincare. If its that important to your \"lifestyle\" starting earning it.",
      "id": 16,
      "comments": [
        {
          "score": 1,
          "content": "I have a job, & I said I'm willing to pay for my stuff I use by myself (my shampoos & bodywash) if my mom asks me. \nThe issue is my younger sis who's not even 12 & can't get a job who wants to get into skincare. 2 yrs ago when it was my older brother who was into skincare, my mom liked the idea bc \"acne is bad\". I got into it after my older brother stopped \"bc it was too much work\" & gave me his products, but now all of the sudden my mom has all but said skincare is just someone being vain despite the fact that our acne is genetic. \nI tried to point out in the post that it's my sis & I's I want included in the budget.  I already don't spend a lot on it, & it's nothing compared to what my mom spends (& will continue to spend) on frivolous clothing we don't need.  I'm the older sis, so ik what to buy, but it's for both of us.",
          "id": 17,
          "comments": [
            {
              "score": 2,
              "content": "There is a difference between \"getting into skin care\" for  \"lifestyle\" and being perscribed products from a medical professional.\n\nYou saying its a \"lifestyle\" is actually trivialising your matter, you are making it to be passive aggressive pettiness.\n\nYou are turning it into.\n\"Hi mum I'm really getting into skincare and its my lifestyle. If my brother gets to eat what he wants I want to play with my special toys\" \n\nYour grown up argument should be.\n\n\"The doctor recommended this product set to reduce the acne scarring on our skin. This is is a decision about my health that is as important as my brothers choice to eat vegan. I will pay for my own products, but I can you pay a portion as well as my sister is going my products too\"\n\nYou see the difference? Take the petty crap out, and be an adult if you want to be treated like one.",
              "id": 18,
              "comments": [
                {
                  "score": 2,
                  "content": "Yeah, I get that, & other places I admit that in hindsight I think that the whole argument was to be a petty asshole.\n\nBUT your point about the \"lifestyle\" v \"doctor recommended\" is actually really valid & I WILL use it if faced with this situation. Ig bc I let Q use it too, I saw it as my parents would see it as useless.  Thank you!",
                  "id": 19,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Keep in your head as well, any buzz words, life style, influencers, boomers, x gen, etc, stuff that is normal for you generation will always cheapen your argument against older generations.\n\nAlways try and keep to the more valid points to win what you are after..and going for \"but brother gets this and its not fairrrr\" just gets you put in the sibling rivalry box for all times.\n\nAs you get older you need to fight for yourself for what you want as a person, not just what you want something because your brother gets something special and you're missing out.  Start leaving him out if your reasons to get stuff, and lean on logic. You'll notice a difference steadily if you keep that in mind.\n\nGood luck with it all.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "YWNBTA. I don't think you'd really be an asshole if you did that, but I would be extremely surprised if it worked. Also, my question isn't why your brother got his own pizza, but why your dad got two!!  And tbh, expensive skincare isn't at all the same as being vegan. It's not comparable. People are vegan in order to save animals and the environment, not to have nice skin. I think it's unfair that your brother gets special treatment though, and your dad doesn't need two pizzas when you guys get none.",
      "id": 21,
      "comments": [
        {
          "score": 2,
          "content": "The Dad didn't get 2. It was one for the Dad, one for the other brother.",
          "id": 22,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -1,
          "content": "Knowing my dad, he'd be on my side, bc of my \"sound\" logic by his standards & I'm his fav (hehe).\nMy dad & older bro got 2 bc \"they eat a lot\".\n& I 100% get skincare & veganism isn't the same, I'd only use that argument bc of the wording that my chose to use concerning the pizza ordeal. I don't think they're the same, tbh, I just want to keep my bonding time w/ Q (& our acne control, even tho she doesn't need it yet)",
          "id": 23,
          "comments": [
            {
              "score": 1,
              "content": "Oh I misread the pizza thing. Yeah fair enough, I mean I don't really see much harm in trying it. YWNBTA. I just doubt they will listen, unfortunately, since they already sound unreasonable. You might have more luck if you just explain calmly to your dad how important skincare is to you. etc, and how responsible you are with it. Good luck tho!",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "INFO: Does your pizza place charge extra to get different toppings on each half of a pizza?\n\nIn all seriousness, you don’t have any right to your parents buying you nicer skincare or hair care products. If your face was like breaking out in painful acne without the skincare stuff then I could see a good argument there, but you don’t mention that. Luxury goods should come from your own paycheck.\n\nEdit to add: YWBTA",
      "id": 25,
      "comments": [
        {
          "score": 1,
          "content": "NO, the pizza does NOT charge extra for the deal we exploit.\n\nBut my face is breaking out without the painful acne, my older brother started me on it bc we have genetic acne (the products barely keep it under control to the pt where my older brother stopped bc it was too much work).  My sis hasn't started her acne problems yet, but hopefully she won't have them, especially since we do our skincare together. & I said I'd pay for my haircare & bodywash, even tho my doctor recommended them, bc I'm the only one I use them.\nPlus, the skincare is for me & my sis who's only about 12. She can't get a job, & this is the one extra charge she gets. My other siblings get extra charges that I doubt will go away.\nThankfully I haven't been given the situation to do this, but reading the comments I think I'll take a different approach anyway.\nOut of all the YWBTA comments I've read, tho, yours is the nicest, thank you!",
          "id": 26,
          "comments": [
            {
              "score": 2,
              "content": "For the pizza thing I meant usually you can order a pizza where the toppings on one half are different from the toppings on the other half. For example pepperoni on one half and all cheese on the other. Assuming you and little sister are eating half a pizza worth, it might not cost extra to change one of the other pizzas to have “half” of whatever toppings you like anyway. Good luck!",
              "id": 27,
              "comments": [
                {
                  "score": 1,
                  "content": "It wouldn't, & we brought that up, but my fam won't budge on it. Thank you tho! :)",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "sorry but YWBTA. i am OBSESSED with my skincare routine, i spend a frankly unreasonable amount of time thinking about it and i’m willing to spend a solid amount of money on it. but also I pay for it and if money is tight I’ll spend less on it because it’s not a necessity, it’s just something I like. if you want more expensive skincare products then get a job and buy them.\n\nif it’s not your money being spent then you don’t get to dictate what does and doesn’t get cut from a budget you didn’t contribute to.",
      "id": 29,
      "comments": [
        {
          "score": 1,
          "content": "I pay for my extra, I'm just talking about my mom buying it for my younger sis. I'm in uni, so I have a job & sizable bank account but my sis doesn't, & tbh it's not a lot bc it's drugstore.  I get the YWBTA, I honestly think it would be which is part of the reason why I haven't done it yet. But my sis gets shamed for doing skincare bc I do it & my mom has all but said \"it's too vain\" to me & I don't find it fair that my younger sis, who's in middle school, should be expected NOT to like something that I do. Like, my mom paid for my older bro's skincare when he got into it, but since I got into after he dropped skincare bc it was \"too much work\", it suddenly became a burden.",
          "id": 30,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "Info: how old is everyone involved",
      "id": 31,
      "comments": [
        {
          "score": 1,
          "content": "I'm 17, in uni, have a job and sizable savings account.\nF is I think 15, nearly 16.\nQ is around 12.\nMy parents are both near their 50s.\nMy older bro is 20, nearly 21, & lives at home rent free & has a good paying union job. (he get's the 4 yrs he would've been at uni rent free as long as he has a job)\nMy other sis is bw F & Q.\n\nAnd just to clarify, I wouldn't mind paying for everything if it wasn't for the fact Q uses a lot of my stuff too bc it's our bonding time. & it's good for her to start young w our genetic acne, it's awful.",
          "id": 32,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n ---\n\n I might be the asshole bc I'm planning on using one past occurrence where I & Q sacrificed (& keep sacrificing) something for someone's lifestyle as a reason Q & I keep getting to buy our skincare bc it's our \"lifestyle\".\n\n---\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 33,
      "comments": [],
      "relation": "No"
    }
  ]
}