{
  "post content": "For the past week, my wife and I had been anticipating a baseball game for which we had purchased tickets. We like baseball, but we don't attend many games, so traveling into the city to see games is a rare treat. I know, though, that it would take time to drive there and find parking, due to traffic. Because the game started at 7 PM, and we live about 45 minutes from the stadium, I told her this morning that she needed to be ready to get in the car and go by 6 PM. \n\nWell, my wife is an avid gamer, so she was engrossed in her latest video game when the clock struck 5:45 PM. She has struggled to plan in the past, and I get tired of reminding her that she needs to budget time to get ready. It's as if she has no concept of time at all, similar to a young child. Well, I was ready to go by 6 PM, and she was in the bathroom. I saw this as an opportunity to teach her personal responsibility, so I simply left the house without saying a word, got in the car, and started driving to the game.\n\nIt took my wife a few minutes to figure out what I had done, but when she called me, she was absolutely furious. She said that it was a completely unacceptable move for me to leave without telling her and that she now had no way to get to the game without paying for parking. I told her that I got tired of constantly waiting for her and that she would plan better next time if she didn't want to get left behind. I also reminded her that I had told her that morning when I expected her to be ready to leave. Absolutely none of this seemed to matter, though, and she rudely hung up on me after yelling out more insults.\n\nFrankly, I think it's completely insane that a grown woman is unable to budget her time, and I'm starting to suspect that she is doing this on purpose because she's a narcissist who expects me to accommodate her. After all, she's not a dumb woman. She has a science degree. Well, she never showed up to the stadium, and I didn't hear from her the whole game, but when I got home, there was a note on the door. She told me that I wasn't welcome in the bedroom and that I should sleep on the couch. I can't believe she wants to be this much of a pill. If I had waited for her, I would have missed the first pitch. I made my expectations clear, and she couldn't be bothered to meet them. I feel like she should be apologizing to me. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 23467,
      "content": "YTA\n\nI wouldn't have blamed you for leaving but you should have told her.\n\n\"Honey, put on your shoes I'm leaving\" : how hard is that ?\n\nWho cares if she's \"dumb\" or has a science degree, it has nothing to do with punctuality and it can happen to anyone to not see time go by.\n\nYTA because you know your wife, you knew she wouldn't be ready and you left on purpose to \"punish\" her.\n\nEnjoy your couch.",
      "id": 2,
      "comments": [
        {
          "score": 5263,
          "content": "Yup. To leave without a word is an AH move. You could have said something. Even “I told you we need to leave at 6, it’s 3 minutes to I’m going to put my shoes on, let’s go”\n\nOr when you know someone always needs that extra time, you tell them you want to be gone sooner. When planning things with my in-laws if it is just us and his parents we can set a time and be good. When the BIL and nephew are in town, we always say “let’s plan to leave by 9, which means pulling out by 930”. Add the two extra people and the kids run wild and it just takes longer. We plan for it. We still tell the kids and everyone 9. But the two of us know more than likely it will be 930. So tell your wife an earlier time. If she’s actually ready, great you’re early. But just do the easy thing and build in your buffer. \n\nAnd while you had a few hours to enjoy the game and drive home she’s been stewing about how you just left. Didn’t tell her or warn her. And it could have taken her a few minutes to call as she was looking for you. Telling you she’s ready. Not getting a response. Finding the car is gone and staring dumbstruck that you would leave without a word. So that isn’t a bedroom I would want to be sleeping in. Because you’re both not showing each other and love or respect.\n\nEdit to add: I get she’s made him late numerous times. And maybe it’s the parent of young kids in me that says “well we just say we are leaving sooner”.  But the whole point is that he stopped communicating. When he left without saying a word, he stopped communicating. And if she was in the bathroom…. He doesn’t say what she was doing. Doing to the bathroom (good idea before you go for an hour plus drive).  Not to mention he doesn’t say how late she usually is. Some people one minute is too late. They need to be in the car at 6 driving away. Others it’s shoes on and heading out the door. So without knowing how this guy views punctual, it’s hard to say.  And if she’s usually 15 min late and she’s only going to be 1 minute this time, I would consider that a win. It’s not perfect but it’s a whole lot better. \nYes he’s trying to prove a point. And I get that. But to prove your point then be mad when she’s upset about it.  What did he expect?",
          "id": 3,
          "comments": [
            {
              "score": 2425,
              "content": "THIS^ right here is exactly what I've had to do to my husband. Thank fuck i only had to do it once.  He was chronically *late* to any event, by up to a whole ass hour! Once, My aunt planned a HUGE get together to celebrate a then recent business success. We HAD to be there by 2. I told my aunt explicitly to text me that it was at 1. When my husband finally got his ass out the door, it was the first time i wasnt pissed at him in *years* for making us late. \n\nHis unmedicated ADHD made it soo bad. It wasn't even funny.  He'd decide last second to shave his face, then shower, etc etc. Wed *finally* leave and He'd have to stop for gas and snacks for the trip almost immediately.  Like havent even gone 4 blocks immediately.  When i pulled this on him,  he stopped and asked why i wasnt mad at him as  it was 1 oclock and it takes an hour to get to my aunt's house. I looked him straight in the eye and said i lied about the time and that we'd actually left on time. Hed started getting ready at 12. Yes a whole *ass hour*. I think it was only then that he realized how bad it had gotten.  We'd used the same tactic on his own mom multiple times,  and on his step mom at least twice. He *never* did it again. It really is nice to be able to leave on time and arrive within minutes of the set time. \n\nNow i tell him what time we need to leave to make it and he doesnt question me about it.",
              "id": 4,
              "comments": [
                {
                  "score": 2272,
                  "content": "My dad has undiagnosed ADHD and he's always late. My poor mom has put up with it for years. She would get all 6 of us kids ready and in the car before my dad would come sauntering out at least 10 minutes later, completely oblivious to how late we were.\n\nHe's not an idiot or a narcissist, he's just really bad at managing his time. And we love him anyway and do what we can to help him.\n\nOP,  you are 1000% TA for leaving with out a single word AND for calling your wife a narcissist simply because she struggles with being on time. A simple \"Hey, I'm leaving in the next 5 minutes whether you're ready or not\" would have sufficed.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 741,
                      "content": "I’m so glad someone else mentioned ADHD, I’m a grown ass woman and I can’t manage my time for love nor money. But I (and my family) will do things to help lessen the effects: \n\n-If I’m going out later, I’ll get my bags and clothes ready now so I can just get myself ready faster, and I’ll start the getting ready process an hour before. \n-I’ll tell myself I need to be here at 6pm, I need X minutes to travel plus extra to account for possible delays, so be mostly ready 15 minutes before that and keep an eye on the time! \n-I try not to start something I know I’ll get sucked into, if I end up hyperfocusing on said task forget it, game over. \n-Watch alarms. Phone alarms. Actual alarm clocks. Set them all, and then there’s no chance to forget. \n\nI think OP’s wife needs an assessment, and OP needs some compassion and to support her.\n\nETA: I have adhd, diagnosed and medicated.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 680,
                      "content": "Omg your mom is a saint. After getting 6 kids and myself in the car on time, I frankly would have left. That is just rough.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 413,
                      "content": "My ADHD got diagnosed when I was 39. I always had trouble being on time, timeblindness is a thing. It got better with my diagnosis as I was able to find ways to deal with it... alarms and stuff.\n\nIf my husband would have treated me like this I would have gone.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 311,
                      "content": "And I think we'll find the OP’s wife does too. Bright, can hyperfocus, time blindness.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 151,
                      "content": "My partner and I both struggle with keeping track of time, and deal with it by setting multiple phone alarms.\n\nI have four morning alarms, plus one that tells me when I need to be put the door to catch the bus to work.\n\nIf I miss that bus, there’s one more I can catch, I’d I go a different route that involves an extra train.\n\nIf I miss that one, I can still drive to work, which I’m not fond of.\n\nRealizing the problem is the first step to solving it.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 124,
                      "content": "100% this. I’m now diagnosed with ADHD and I’ve developed mechanisms not to be late, but my concept of time is just completely out of whack. I can’t tell you how long it takes me to get dressed or do any tasks, but I will work out that in order to be somewhere for x time, I need to leave at y. \n\n[New Scientist ran a great article about ADHD](https://www.newscientist.com/article/mg25834372-000-adhd-whats-behind-the-recent-explosion-in-diagnoses/) and the concept of time a few months ago. OP should give it a read. \n\nAlso OP YTA.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I'm so glad someone else committed this, this is me to a T and my dad. We where always late. Undiagnosed and untreated ADHD Is just passed off as silly from small minded people. The struggle is real.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "My mother likewise. I actually think it's an ESH. \n\nI've got ADHD and the thing is OP's wife has the responsibility to manage her own time. It's not an unreasonable boundary to set that she should manage herself. Even if she's undiagnosed, it's her job to find coping mechanisms. I have a shit ton of alarms I used before I was diagnosed and medicated to achieve that very thing. And before someone jumps in to say I must not be that bad - my official diagnosis is \"Severe ADHD, combined type\". I absolutely *am* that bad. I am bad enough that the person who diagnosed me said she'd never seen someone with ADHD as bad as mine who made it to their 30s without a diagnosis before. So that's  the context for me saying: It's not everyone else's job to manage her time for her, and it absolutely is inconsiderate and self-centered of her to keep him waiting and foist all that logistical labour onto him all the time. \n\nAt the same time, part of setting boundaries is communicating them clearly. \"I don't want to be late, so if you're not ready by [time], I'll be leaving and I'll see you there.\" Would have been fine.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I have ADHD and am medicated but leaving the house is a huge challenge sometimes. It's like my brain shuts down and I can't remember what I'm doing, why I go in a room, where anything is, etc. I will walk to my room for glasses, forget why I'm there, grab a jacket, go to put on my shoes, go back to get my glasses, forget why I'm there, grab a scarf, go to put my shoes on, rinse and repeat. \n\nI frequently repeat what I'm looking for as I walk to a room because the 10 seconds it takes to get there is apparently too much for my brain. My solution has often been giving myself the wrong time to leave so I get where I'm going 15 minutes early if I leave on time (sometimes), on time if I need the time (often), and a little late if I'm really struggling (occasional). I'm not a narcissist or an idiot but I am challenged when it comes to time management.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I'm glad you brought up ADHD. The very first thought that came to mind when I read the op was that OP's wife definitely has ADHD.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 300,
                  "content": "Time blindness is a bitch to deal wifh, honestly. Everything is Now or Not Now. I have ADHD, but I wasn't diagnosed until I was 46, and getting medicated has been a huge game changer. But for years I just thought it was a personal failure for standards I couldn't live up to. Moral is that time blindness isn't on purpose, it isn't to make anyone's life hard, or that we don't care. It's called blindness for a reason.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 65,
                      "content": "You sound like me, and I honestly didn’t get better until my daughter was diagnosed with ADHD and I started to realize what the problem might be - that was when I started to work on a million things to try and make sure I wasn’t late, or at least by only a little bit (5-10 minutes versus 45 minutes). I still slip up occasionally if there’s a lot on my plate but my husband got a lot more patient with me when he realized where it was coming from (before I did, apparently, once we talked about it). (I haven’t been diagnosed, mostly because I haven’t found a clear route to adult diagnosis yet, but since perimenopause seems to be making executive functioning even worse, I may have to try harder.)",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "40 here. Same. Being punished by those you love and trust to see you the most, is a brutal let down.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Late life diagnoses = lifetime of depression and anxiety thinking how can I be so smart and yet procrastinating and impervious to time?!?",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "My son just recently started experiencing time blindness (I've always had it to a degree, and have reminders EVERYWHERE to account for it), and he's not happy with it, but because the rest of the family has dealt with it, we're able to help him with coping strategies. He's in college, and now has alarms for everything.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "For me it was the same. I always wanted to be on time, it was just incredibly difficult for me. I knew I had to leave, but then I would just need to do one small thing and I would be too late. I never knew about time blindness in general, I was only recently diagnosed. Since my diagnosis I understand myself so much better and was able to find the right tools.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "OMG yes- I figured out I was time blind last year.  My therapist asked me why I thought I was always late before I figured it out.  I just assumed I was rude.  It's always seen as some sort of moral failing, but I just literally do not experience the passage of time the same way other people do.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 145,
                  "content": "Winston Churchill was chronically late. His wife simply forwarded the clock by an hour if he needed to attend a luncheon at a certain time, Apparently worked perfectly according to his butler.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 74,
                      "content": "My mum does that to her own clocks. She’s also chronically late and her clocks are always 15 minutes fast. I find it very confusing now when I visit her and always forget that time at her house is false.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 123,
                  "content": "Are we married to the same guy?    My husband was always perpetually an hour late to everything and would be getting into the shower 10 minutes before we had to leave somewhere.  I did literally the same exact thing (except our event was a Birthday party organized by his brother).  We showed up right on time (he was expecting the party to be in full swing by the time we got there and it wasn't) and I had to tell him that I lied and said the party started an hour earlier than it did so we could make it on time.  We haven't been late to anything since then.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I enjoy watching the sunset.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "I don’t really understand why this solution finally causes them to change their behavior? Like I understand the solution helps you get there on time, but how does it suddenly make them care? For both you and /u/littlestecho, it seems your husbands were both fully aware that they were going to be arriving late, because they even ask about it? But they apparently didn’t care enough to change the behavior before you “tricked” them? I don’t get the motivation I guess. You would think someone who is aware they are chronically late would be happy to let their partner lie to them about the time to be ready forever, not suddenly fix the problem.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Ass hour 🍑⏰",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "He asked why you weren't mad that he was stopping for snacks for a 60 minute drive, when as far as he knew, you were already late? \n\nThat doesn't really sound like unmedicated adhd... unless I'm misunderstanding something? At any rate, I'm glad he stopped & you have a better agreement now.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Oh hes diagnosed, he was diagnosed as a kid. But it was the 90s/early 00s. His mom opted to not give him meds at all. \n\nIn his mind, we were already late and stopping for his roadtrip snacks wasnt making us any later. He still stops but idc anymore as we tend to leave on time if not early now, which is impressive with 2 little kids.\n\nFor a good long while time blindness was a minor issue for him,  then we had a baby and the time blindness got so much worse. It used to be 10- 15 minutes here,  maybe 30 minutes there.  But it was almost a full year of being an hour late to *everything*. And being mad at him  wasnt helping to fix it clearly.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 354,
              "content": "Adults shouldn’t need to be lied to to get somewhere on time. Chronic lateness is rude and disrespectful. \nDo you do the same thing when you have to get to work? \n\nI have ADHD, my mind wanders and I lose track of time, but I’m not an asshole, so I set alarms and reminders. I’m never late, because I’m considerate of other people.",
              "id": 31,
              "comments": [
                {
                  "score": 237,
                  "content": "It's great that alarms and reminders work for you. It really is.\n\nI remember to turn off the alarm and get sidetracked with something else in moments. Then of course I get super into that thing and promptly forget why I had that alert on.\n\n\nIt's not like setting alarms or reminders is something people couldn't come up with. It just doesn't help everyone. So you should be happy it works for you.\n\nI'm not often late. But that's mostly because I've figured out a system that works for me. And that took time, effort and a lot of failed tries.\n\nAnd once I was indeed late from work. I called my boss and explained, promised to work in the missed time. And she didn't make a huge deal out of it because she understood that I hadn't done it out of maliciousness and it was an accident.\n\nIf someone is late, they're late. Pretty seldom it's out of rudeness, it's mostly time management issues or other mishaps. And at least I don't consider those punishable, rude or disrespectful.\n\nEdit: I was replying to someone who has ADHD from perspective of also having ADHD. I was describing a common issue with ADHD, to someone who also has it so I didn't bother to spell it out. Didn't consider that other people might comment without that \"insider info\".  Should have been clearer.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 188,
                      "content": "Occasional lateness is one thing; but the wife was gaming until 15 minutes until she was due to leave. That’s rude. \n\nAnd you said it yourself, you’re not often late, because you acted like an adult and figured it out. You were late to work once, apologised and fixed the issue. That’s what adults do.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 151,
                      "content": "You can make all the excuses you want but being chronically late is the very definition of rude.",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 123,
                      "content": "How is being late not rude or disrespectful? Especially if you are planning on meeting someone's it basically says that their time to wait around isn't valuable.  If we agree to meet somewhere at 6, one should be there no later than 559, anything else leaves the other person waiting around and than is rude and disrespectful of their time.\n\nTho I live in a country where it's completely not acceptable to be late, I've seen diners turned around for being five minutes late, appointments canceled and, for competition, matches forfiet for being 3 seconds late (match started at 6pm, ref ruled opponent arrived 18:00:03 and not at 18:00:00 or before.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 118,
                      "content": "The amount of times setting alarms and reminders has failed for me. It’s not even like it’s better when I am on my ADHD meds coz then I’m in the hyper focus zone and don’t even realise my alarm is going off and has been for 20 minutes. \n\nAnd don’t get me started on the hours I’ve literally lost, where I think I spent 2 mins just checking my phone notification’s and literally an hour or more has passed (I have to log all my tasks for work, sometimes you have to wait a min or two for the system to do something so I’ll check my notifications, and then I feel only a min or two has passed and I hit stop on the time sheet and it’s been an hour+ and that’s just at work!).\n\nMy Partner also has ADHD and we have some overlap in the way we ADHD and we also have areas where the other excels. You know what we do? It’s really crazy….We support each other. Despite alarms generally not working for me, I’m extremely good at being on time to events, my partner not so much, so I help him manage his time so we get places on time. Im terrible at looking after myself (amazing at looking after others), so he helps me to practice self care, like moisturising, cooking nutritious meals, encourage me to do art or read more etc. We both struggle to do anything we find boring so we will motivate each other. \n\nI hate when fellow ADHDers tell us to do better, thinking just because something works for them it should work for all of us. They should know more than anyone how unhelpful and hurtful it is being told to do better/apply yourself/if you really cared you would do it etc. If it was easy for us we’d bloody well do it rather than constantly disappoint ourselves and those we love, and put our livelihoods in jeopardy. \n\nYes we try, and sometimes it works sometimes it fails, sometimes we just need some help to achieve the things that neurotypical people find easy/effortless. \n\nWe should take accountability for any inconvenience/hurt etc we cause, ADHD isn’t a blanket excuse for everything. And getting meds adjusted and/or therapy if necessary to help is definitely something we should do. Compassion goes a long way.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Medication didn't help me with time blindness at all. I was pretty devastated, since that's the worst symptom for me.",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 62,
                  "content": "That's a big key with having this issue. Are they trying to manage it? It doesn't seem that OP's wife is and he's likely frustrated. I don't agree with how he handled this situation but I get where he's coming from. She at least has to try to fix her issue.\n\nMe and my husband both have this. We've found solutions that help us mitigate the problems.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Work is something that happens every day. I can set up routines and reminders for it. And usually it has a fairly hard start time. Even then, it's a struggle, especially when it's a job with a more flexible start time.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "She may have a Video Game addiction also. I mean he probably should’ve told her he was leaving. On the other hand she should be ready to roll. However the way he handled it makes him the asshole. I mean i obviously don’t know their relationship and maybe this happens way too much. It sounds like there might be some underlying issues with his his wife. Maybe ADHD or a Gaming Addiction. I think he could’ve handled it better.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 253,
              "content": "Let me share my experience. My now ex-wife was very similar. Every day I went to pick her up from work because she refused to get her driver's license. I informed her well in advance I'm on my way, then when I'm almost there, to be ready, yet she always left me waiting for hours on end. Totally disrespecting my time, always an excuse that's completely irrelevant. Going somewhere was the same, never doing the things she needed to do, stalling, doing anything but getting ready resulting in us to always be hours late, even to weddings.\n\nSome people don't give two shits about you and your time. At some point, you just leave like OP did, no communication because that's the same treatment you get. Where was OP's wife's communication that she's going to be ready in 5 minutes, where is her accountability? Why is OP responsible to get the information when on the other end, he's not receiving anything despite numerous agreements on when what should happen?\n\nI understand OP's anger. Though I would advise not to label. Can't say whether they're narcissists, suffer from depression, or what else could be going on. If you despise your partner that much, perhaps it's time to re-evaluate your relationship.\n\nYou communicate, your partner fails to respect your boundaries, then you give up and choose yourself. Just like OPs wife chose herself by gaming too long and caring too little to put effort in being on time.\n\nTalk it out, and if your partner continues to disrespect your boundaries and time, then deal with the consequences. Choose yourself and wellbeing.",
              "id": 41,
              "comments": [
                {
                  "score": 80,
                  "content": "LOL, I had a very similar experience. My ex was always late. OP's wife knew what time they had to leave and it's not his job to push her to get ready. She's not an 8 year old. I got so tired of being late and pushing her to get ready and be on time. Anyone that has put up with years of that bullshit can totally relate with OP.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "yes yes yes. he communicated his expectations clearly, and she is mad at him because she had to face the consequences of her own choices. it’s BS",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 223,
              "content": "I say they are both ass holes and need to do some growing up.",
              "id": 44,
              "comments": [
                {
                  "score": 195,
                  "content": "This. OP do you even like your wife? You set her up to fail here and that is just unkind. It's pathetic",
                  "id": 45,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Exactly the right question. While he's driving away with a smirk on his face, thinking gleefully, \"I'm teaching her a lesson.\"  But for her, when she realizes that he actually left her, she's broken hearted that he would actually treat her in such a mean spirited way. No doubt, he was expecting to gloat in her face when he got home too. What an AH he is.  You don't teach your partner a lesson; you work with them so as a couple you are better together.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Does she even like him? Doesn’t seem like it.",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 200,
              "content": "Why is it his responsibility? She knows she needs extra time. She can set an alarm. She can put a timer on to shut her game down, or the computer, or the TV.\n\nThere are all sorts of strategies she can employ.\n\nThe chronic late people often seem to make it to work on time, or to doctor’s appointments, or to catch a plane, things that are “ important” … it’s his time she doesn’t respect.",
              "id": 48,
              "comments": [
                {
                  "score": 88,
                  "content": ">The chronic late people often seem to make it to work on time, or to doctor’s appointments, or to catch a plane, things that are “ important” …\n\nThis is absolutely not true. Why would you think this?\n\nPeople miss planes all the time, or end up running through the airport because they aimed to get there an hour ahead of time and only got there with 20 minutes to spare. Doctors run late partially because of late patients.  Work is the easiest because it's generally at a consistent time but yes, people are chronically late to work. These are not separate populations from the people you insist don't value you because they are late to a party.\n\n&#x200B;\n\nedited to add- per a comment thread of time blind physicians further down on the page, sometimes the doctors are also chronically late. Yes, even to work.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 24,
                      "content": "A few months ago someone made a comment about they bet that if I was getting a million dollars to be on time that I would be.  They might have taken that bet, but I wouldn't.  I'm late to doctors appointments and for flights.  Even when I build in extra time into the schedule.  I'm late for craft fairs where getting there on time would get me more money, because of better placement and more time to set up my booth. This isn't something I like about myself.  It's frustrating as hell.  But it's also the way my brain works and all the alerts in the world aren't going to change that.",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "I'm a doctor.\n\nI have always struggled with time blindness. ADHD as fuck but good at getting into hyperfocus so I cruised through med school.\n\nI was on track to be an emergency medicine consultant (burnout whomst? I thrived on the chaos) but then I was in an accident that left me with physical limitations that meant it just wasn't going to work.\n\nI retrained to a new specialty and private practice, and now I have a secretary whose literal job it is to manage my time for me during working hours. Seriously. She is constantly reminding me. Due in the lab at this time. Patients at this time. I have ten minutes free, reminder I have eleven letters she's typed for me to check before they're sent out.\n\nEven when your doctor isn't late it's possible that's because someone is actually paid as part of their full time job to manage their time.\n\nWhich works great if you're doing the kind of job where you can justify it being someone's full time job to manage your professional life for you, but that's not that many jobs.\n\nEven if I didn't have ADHD, it would be a criminal waste of my time if I were personally doing all the paperwork she does for me, all the phoning around chasing medical records from other places, etc - I'd be able to see *maybe* half as many patients, and even now I'm booking new appointments in December and missing my lunch break several times each week to squeeze in new patients who can't wait that long.\n\n(Because your can't say, \"Well, I don't have any open appointments so I guess you'll just have to wait. Based on these test results I'd say you have a thirty percent chance of still being alive.\")",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Because all people have different expectations and if couples don’t communicate they fall apart.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I'm chronically late. Yes I make it on time for planes or job interviews. But this means I am forcing hyperfocus on these activities. It means that the day before an appointment, my clothes are chosen and laid out, my purse is checked and everything is in there. My breakfast is made. I have several alarms. \nI won't \"just quick\" clean up the kitchen or run to the store on a day like that. My wife takes over the morning dogwalk. I even can lose track of time if she talks to me about random things. Everything and anything revolves around that one task that I NEED to do. You can't live your whole life like that. \nBeing late on a daily thing has nothing to do with disrespect when you're timeblind.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I feel you. The smallest deviation from my routine and I'm totally fucked.\n\nWhen I have to hyper focus, I'm so fucking exhausted after the fact because of the anxiety involved. \n\nIsn't it funny how we can always work over when there's no deadline but the day of, it's do or die?",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Why is she supposed to be psychic and suddenly know that he is going to leave without a word?",
                  "id": 55,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 119,
              "content": "I have ADHD which comes hand in hand with “time blindness.” I always like to say, my best friends lie to me about the start time lol",
              "id": 56,
              "comments": [
                {
                  "score": 93,
                  "content": "I have ADHD also, but have such anxiety about being late that instead I am chronically early to anything instead…",
                  "id": 57,
                  "comments": [
                    {
                      "score": 5,
                      "content": "This is  my husband. He is so paranoid about being late he is chronically early. When we got married I told him he was probably going to leave his hotel for the venue (10 minutes away) 2 hours early \"in case there was traffic.\"\n\nWe had to have discussions about how arriving half an hour early to someone's house is just as rude as arriving half an hour late. He's gotten better (having a kid helped with that!) but he is still the person who is early everywhere. Just this weekend he was like \"I'm probably leaving to get my hair cut in a few minutes.\" And me: \"Um, your appointment is at 2 and it's 1, the salon is literally 7 minutes away.\"",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I try to be early, and have gotten a lot better about it. I often lose track of time though and end up rushing around. It gets to be really frustrating when I am waiting for my parent(s) for an important appointment and they end up making me late and stressed out.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "This is me right here, huge anxiety because it's so easy to lose track of time that I show up everywhere about an hour early at least.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "My friend has ADHD and is Italian - he assures me both these factors contribute to his lateness. \n\nHe told me earnestly to stop telling him the dinner was booked for 8 and to tell him it was at 7. \n\nBless him he totally forgot that it was really at 8 and ended up at a nearby coffee shop at 6 in his determination not to be late.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I struggle so hard with that too. I just don’t even realize how long something will take. I made dinner the other night and tried a new recipe and we ate dinner and hour and a half after I planned. 😩 I felt terrible because we have young kids and it was late! My husband would be sleeping on the couch if he did this too.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 114,
              "content": "I agree husband should have said something before leaving, even if it was just ‘I’m leaving now’, but he’s already stated he has to do this every time and is tired of it. If this was genders reversed it’d be called ‘weaponised incompetence’. It isn’t OPs responsibility to constantly remind his wife of timings and baby her, this grown woman should be called out for putting the emotional load on him and learn that her actions have consequences. How hard is it to set an alarm?? NTA.",
              "id": 63,
              "comments": [
                {
                  "score": 8,
                  "content": "EXACTLY",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Oh I scrolled waaaaaay to far for this!",
                  "id": 65,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I don't disagree that OP is TA here, but purposefully planning around people who are habitually late is horseshit.   \n\n\nOthers shouldn't have to plan around the fact that someone is routinely late. People who are late or make being late a part of their personalities are incredibly rude and disrespectful.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Same. My wife is the late one, and I'm a stickler for punctuality. We've simply adjusted our schedules, and events we have to be on time for we budget an extra 15-20 minutes (on top of my own neurotic doubling of travel time). I'll be a drill master until we're out the door if I have to be. Of course, we screw up sometimes. But we communicate every inch of the way, including frequent time checks. We're different people, and part of marriage is adjusting to each others' idiosyncrasies. \n\nAnd yes, when our daughter was in diapers we'd have to add 30 minutes to everything. Now that she's a kid we can make it work, and I generally have getting-ready duties when we're going somewhere so my wife can do her thing.\n\n&#x200B;\n\nSo yeah, OP, YTA. Communicate with your wife.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 969,
          "content": "Exactly! “Teach her a lesson.” “Narcissist” makes me think a lot more is going on here. Half the time I wonder if people that post on here like their spouses much less love them.",
          "id": 68,
          "comments": [
            {
              "score": 519,
              "content": "This \"Teach her a lesson\" was whap upset me. It's not his job to teach her a lesson. She is not his child.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 312,
              "content": "Bet you she just has ADHD or something and this clown pulls out the Narcissist card because it fits his agenda of no respect for this woman.",
              "id": 70,
              "comments": [
                {
                  "score": 118,
                  "content": "Yeah I have ADHD and time just escapes me I have to try really hard to make sure I'm on time. I make sure I leave for work 40mins early to get there on time.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 81,
                      "content": "Yep. I have a bad perception of passing time coupled with my brain possibly being run by squirrels on crack. Easily distracted by shiny objects. Thoughts that will not be ignored. ADHD gang unite. Later. When we remember. Might have to reschedule the meeting. And build in nap time. Planning really takes it out of me.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I have adhd and anxiety and my anxiety keeps me on time for everything.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 71,
                  "content": "I am so with you on this, the whole way thru I was thinking.. this woman has ADHD and this A is punishing her for that.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "No, ADHD is something only men get, like depression. Women don't get that stuff. They're just being drama queens!\n\n/s",
                  "id": 75,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "Right? I read this an instantly thought \"projecting much?\"",
              "id": 76,
              "comments": [
                {
                  "score": 69,
                  "content": "Totally projecting. He sounds like he's the narcissist!!",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 94,
              "content": "Pulling the narcissist card for being chronically late had me rolling my eyeballs HARD",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I grew up with narcissists, they tend to project all their shitty qualities onto the subject of their abuse. OP ticks all the boxes",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "\"I saw this as an opportunity to teach her personal responsibility,\" = *I saw an opportunity to be mean but be able to take the high ground about it.*",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 729,
          "content": "I was sympathizing with OP until I got to the part where he “wants to teach her some personal responsibility” and so he leaves quietly and without letting her know he’s leaving. \n\nOP, YTA. Go sleep on the couch. Don’t worry, it’s for your own good and it builds character.",
          "id": 81,
          "comments": [
            {
              "score": 198,
              "content": "I hope it teaches him some personal responsibilities. Like nurturing a love relationship instead of insulting partner.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 124,
              "content": "Yup this made me go NTA to YTA so fast. How on earth do you teach responsibility by behaving irresponsibly! Sounds more like petty revenge for sometime she made him miss something. If u know she's bad at times management just give her an earlier time, if she asks why you are going so early then u can clearly state because she takes longer, this may seem like an AH move at the moment but at least u clearly communicate.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "That and how he talked about his wife. He does not seem to love her , why staying together?!",
              "id": 84,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "That pissed me off too. That isn't something you do to someone you love. Someone said she was acting like a child so she should be treated like a child. I wouldn't do this to a child either.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 466,
          "content": "Imagine being in a marriage where people want to punish each other and teach each other lessons and make the other person feel bad about themselves….\n\nGet a divorce people!!",
          "id": 86,
          "comments": [
            {
              "score": 183,
              "content": "Yeah, he sounds like he hates her through the whole post.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "Right? This is so harmful. I can't imagine how she feels about herself to stay with a man like this.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 256,
          "content": "This! Plenty of intelligent people have adhd too. Time blindness is a huge problem for me!",
          "id": 89,
          "comments": [
            {
              "score": 174,
              "content": "Me too! I'm literally a doctor (not that that automatically makes me intelligent). And my time blindness is insane. It doesn't even matter how early I get up, or if I budget for more time.",
              "id": 90,
              "comments": [
                {
                  "score": 106,
                  "content": "Yep, not an MD, but i got a PhD, and had people not believe me when I said I had ADHD. It doesn’t matter what degree or career you have.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Exacrly! I've got a masters. I was diagnosed with adhd after completing it. ADHD doesn't mean you can't be intelligent!",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Same.  I'm a lawyer. I'm perceived as smart. Well, I am smart.\n\nAnd ADHD has been a huge crippling thing my whole life. I'm just NOW - well over age 50 - getting into ways to cope and manage it.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 80,
                  "content": "lol - fellow chronically late physician here. no matter what i do, i seem to always be 10-15 min late. the only way i can make it on time is to plan to leave 15 min early, upon which i'd actually leave on time.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 50,
                      "content": "I tried that but then knew I had 15 more mins so still late my brain hates me lol",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I think this must be a thing because every doctor I’ve ever had has always been late. Like, I make an appointment at 8am at the time the clinic opens, and they don’t waltz in until 8:30 with three people already waiting. Every doctor at every clinic over 40 years.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Usually I have to be at work at 10am, long commute, so my alarm goes off waaay too early for my nocturnal self and I have to hustle to catch my train. Admittedly, I usually plan for the second to last train in order to catch the last one to get me there on time, much like your solution.\n\nBut today I have to be at work at 3pm. An extra 5 hours. \n\nI'm late. I'm always late when I \"have time\". Because then I take my time and lose sight of it...",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 216,
          "content": ">Who cares if she's \"dumb\" or has a science degree\n\nOne of the smartest guys I know, a senior engineer for \"Lougle\", was/is one of the least punctual guys I know. Went to school for 6 years with him, he was late like every second morning, and he lived literally 5 minutes away.\n\nIf you omit the lack of communication (frankly I'd say if he had said that morning \"honey I'm walking out the door at 6. It's on you to make sure you're with me, I wont be reminding you\" that's enough) he's clearly NTA, but this feels like he's setting her up to fail and get a chance to pull this stunt. \n\nI get he's pissed, if my partner were like that I would be too. But there's a step between \"I'm annoyed and have expressed this too her multiple times\" and \"I didn't warn her and ditched her.\" They're *PARTNERS*. A team. Work together FFS. \n\nI would say ESH though because frankly the wife has this consistent rude habit and seems to be making no effort to change.",
          "id": 98,
          "comments": [
            {
              "score": 83,
              "content": "You nailed it. Like yes, she has to take some accountability for her actions and being on time. On the other hand, I understand his frustration.  However, he took a me vs. you approach instead of us vs. the problem. I'm so glad he got to see the first pitch though, because we all know baseball games are super quick  /s.  Hope sleeping on the couch and the resentment is worth it.",
              "id": 99,
              "comments": [
                {
                  "score": 12,
                  "content": "years and years of constantly being late, telling them about it, and nothing changes can be pretty frustrating , cant it? he might have just broke, maybe this game was really important to him for some reason, and her being oblivious seems like she doesnt care about his wants.... it really just sounds like these two need to sit down and talk about this like adults.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "i feel like it’s not enough info to say whether wife isn’t trying or not. could be undiagnosed adhd and that’s why everything she tries to do for better punctuality doesn’t work, bc typical advice doesn’t work for adhd people. or it could be that she is selfish and doesn’t care for others time. we simply don’t know",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "The absent minded professor trope is that way for a reason - just because she's not a man doesn't mean she can be smart and super absent minded or time blind.  There is a certain type of very smart people who are just terrible at navigating the world.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 202,
          "content": "YTA, bro do you even love your wife?",
          "id": 103,
          "comments": [
            {
              "score": 178,
              "content": ">It's as if she has no concept of time at all, similar to a young child. Well, I was ready to go by 6 PM, and she was in the bathroom. I saw this as an opportunity to teach her personal responsibility\n\nHe seems to think of her as a misbehaving child rather than a partner.",
              "id": 104,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 190,
          "content": ">\"Honey, put on your shoes I'm leaving\" : how hard is that ?\n\nto even make a comment at 5.45 when he noticed she was deep into her game. me and my husband always do this for eachother, sometimes even when it is not something we go to together. a simple \"keep an eye on the clock honey\". i dont think it is that much of an effort/hassle. and i say this with an ADHD husband that can be QUITE forgetful. \n\nreally sounds like he watched her for 15min, looking forward to the moment he'll leave without her and hoping she will not be on time to teach her a lesson. he literally snuck out while she was in the bathroom.",
          "id": 105,
          "comments": [
            {
              "score": 26,
              "content": "yeah the part about sneaking out while she's in the bathroom is what stuck out to me!  Was she in her underwear still doing her hair and makeup at 6:00 or was she just peeing before the 45 minute drive? The fact that she called him a few minutes later leads me to think she may have been about ready to leave and he wouldn't give her a 5 minute buffer. A simple \"Hey it's 6:00 we have to leave now\" could have her heading to the door and he just never gave her that option.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "The 5:45 part stuck out to me. Why didn't he say, \"Hey honey, it is 5:45. We need to leave soon.\" It would have taken him all of two seconds.",
              "id": 107,
              "comments": [
                {
                  "score": 14,
                  "content": ">Why didn't he say, \"Hey honey, it is 5:45. We need to leave soon.\"\n\nbecause he wanted her to be late so he can give her \"a lesson\".",
                  "id": 108,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Seriously. I have adhd. I have time blindness but actually dont struggle with being late because I'm too stressed about being late. My husband doesnt have adhd or time blindness but does sometimes struggle with being engrossed with something. All you have to say is \"hey, you know what time it is?\" And then move on.\n\nOp YTA. Mostly because of the way you talk about your wife IMO but also because you didnt even bother to communicate. I get that its annoying when someone is always late but you are supposed to ve partners.",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Myself and two of my coworkers all have ADHD and they both have to go pick up their kids/grandkids from school on work days. I usually come in a bit later and work later. ESPECIALLY if they have to leave at an unusual time we will be giving each other clock updates. Starting like an hour to 45 minutes before they have to leave. Because otherwise they will be late to pick up children that they love more than the world itself. It just be like that.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "My husband will be like \"don't you need to get ready?' At least an hour before because he knows me too well. Partners help each other. In turn, I make all the annoying phone calls to make appts and such. He hates being in the phone 😂",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 97,
          "content": "My thoughts exactly.  Except \"enjoy your couch\" I was going to say \"Say hello to your divorce lawyer for me.\"",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "Really, only the part where you didn’t communicate was the part that made YTA. \n\nI’ve honestly done the same to my own family. Except I gave all the timed warnings. And while I was screeched at, everyone else they told sided with me, well, at least when they got the full story. \n\nAs for my own wife, I have a similar situation and actually make alarms to remind her. It’s worked so far. Oh, and I have a policy for airplane trips that she pack early.",
          "id": 113,
          "comments": [
            {
              "score": 4,
              "content": "Yep. \n \nGenuinely expected OP to say “okay, I’m leaving *right now,* you can come with or not but I’m gone in 2 minutes” and then leave instead of sneaking out to “teach her a lesson.” \n \nThis kinda reminds me of the episode of Mad Men when Don leaves Megan at Howard Johnson’s lol. \n \nAlso has OP ever sat down with her and explained how she makes him feel when he does this? Because “teaching a lesson” to your partner never ever works. OP should have known that",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9614,
      "content": "You sound like you really dislike your wife. \n\n>It's as if she has no concept of time at all, similar to a young child.   \n  \n>  \n>I saw this as an opportunity to teach her personal responsibility  \n  \n>  \n>I'm starting to suspect that she is doing this on purpose because she's a narcissist  \n  \n>  \n>I can't believe she wants to be this much of a pill.  \n  \n>  \n>After all, she's not a dumb woman. She has a science degree.   \n  \n>  \n>She rudely hung up on me after yelling out more insults.",
      "id": 115,
      "comments": [
        {
          "score": 4187,
          "content": "At the very least, OP is utterly contemptuous towards her.  If she’s an adult with a science degree, it’s not OP’s place to “teach her a lesson.”  Ever.  She is an equal person.",
          "id": 116,
          "comments": [
            {
              "score": 2197,
              "content": "Contempt is normally the nail in the coffin for marriages. He comes off as much more of a Narcissist by his choice of words!",
              "id": 117,
              "comments": [
                {
                  "score": 711,
                  "content": "glad someone else caught it. OP seems like he's projecting.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 452,
                      "content": "Yep, I thought so, too. And it sounds like his wife has some major symptoms of ADHD and we do often end up with people who rate higher on the narcissism scale for some reason.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "You know who likes to accuse people of being narcissists? Narcissists. I had an ex that, during our exit fights as we were breaking up, kept accusing me of being a narcissist. I didn't know much about it, so after it was over I was like, \"Maybe I am a narcissist.\" So I did a deep dive on narcissism and wouldn't you know... it was her point-for-point. Baiting arguments, love bombing, gaslighting, never apologizing or taking any sort of personal responsibility for our struggles. All of it throughout the entire relationship was her and my reactions to her mind fucking me.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Feeling contempt from my partner was a primary motivator for my leaving my marriage. That contempt made it easy for him to blame me for *every* problem we experienced, regardless of how much of it stemmed from his anxiety and depression. \n\nI tried to get him help with that; I would help schedule his therapist appointments, fill prescriptions, give him positive encouragement... I even tried to help him get over the \"blank page\" block he was fighting with his grad school work by literally having him talk to me about what he was thinking about doing, so I could create a notes outline as a kick-off point.\n\nLeaving him to his own devices seemed to make him even more down, and gentle checkups only seemed to stress him, so I backed off of those.\n\nBut it was easier to complain about me to mutual friends behind my back, who told me what was being said. What I heard were echoes of the exact complaints he'd made about his parents when we'd started dating. I didn't sign up to be a scapegoat or someone's mom; I thought we were partners and trying to get through this life thing together. It was heartbreaking but galvanizing.\n\nLast I checked, a good long time ago, he seems to be doing well. He finished his grad work, teaches now, and is presumably still expanding his education as he goes. He's had at least a couple relationships, but I don't know and it's not my business who he's with or whatever now. Just, he moved on, got his shit together of his own accord, and is still living. Good enough and I wish him the best!\n\nEven with love, sometimes people just aren't the right people for each other, and without love--especially with contempt--you gotta let that person go. There are better realities for both parties.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 200,
              "content": "Oh I'm sure her degree is actually better than OP's which is why they're so salty about it.",
              "id": 122,
              "comments": [
                {
                  "score": 62,
                  "content": "This is a reach. He doesn’t sound salty about it at all. Quite the contrary, like, how is she so smart about subject A, but completely incapable of a layman issue like time management.",
                  "id": 123,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 59,
                  "content": "He doesn't come off as salty about the degree at all, but rather seems to mean it as a complement. Basically everything else comes off a contemptuous except maybe this one part.",
                  "id": 124,
                  "comments": [
                    {
                      "score": 102,
                      "content": "It's a backhanded one at best.  \"Omg she has a science degree but...\" Yeah, lots of super intelligent people struggle with really simple things. Lots of really intelligent people are neurodivergent.",
                      "id": 125,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "even w/o the science degree it is not your responsibility as a spouse to teach the other a lesson. You're supposed to have Adult conversation about these kinds of troubles. Like has he actually gone to her before and said it's a real problem for me when this happens? I d oubt it.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "People without science degrees are fair game to teach a lesson though.",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "I reckon she’s smarter than him. Lol. She just has adhd probably.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "include disarm rainstorm cows alive screw public violet theory secretive\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
              "id": 129,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "This. It is not the place of one partner to teach the other a lesson. Ever. If you don't like her anymore (did you ever?), leave. It's that simple.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Tbf, I think equal people can teach each other lessons, BUT this guy is definitely the AH and if he continues to treat his wife like this, his marriage is circling the drain",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yeah there is more going on at home than her being late all the time. Also by the time you marry someone you should realize thats the kind of person your marrying and shit will never change. My wife is similar and i realized a long time ago that I will just about never be on time if im with her. Married her anyway because there are other redeeming qualities and I can accept a few small flaws.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 652,
          "content": "He sure taught *her* a lesson. I bet his home life will improve immensely. What a smart man. /s",
          "id": 133,
          "comments": [
            {
              "score": 5,
              "content": "This is an exact scenario from the sitcom Everybody Loves Raymond. He “AIS’ed her.” I don’t think it worked out too well for the character of the husband either.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 539,
          "content": "It’s giving the “using therapy buzzwords to justify bad behaviour” attitude",
          "id": 135,
          "comments": [
            {
              "score": 151,
              "content": "So I’ve experienced that kind of behavior with a friend (or former?) recently where they tried to confront me at someone’s birthday party for not behaving how they wanted me to recently (there’s a lot of backround here and I’m not typing it all out lol).\n\nI diverted them away from the group because I felt it was inappropriate and they verbatim yelled at me about how they were in therapy again. I’m like ok dude that doesn’t really mean anything if you’re in your 30s and yelling at me in a parking lot. \n\nGoing to therapy doesn’t mean you’re “right” - you have to actually process it and utilize the tools. A lot of people don’t. I’m in therapy and I know I still have a lot of work to do. I wouldn’t weaponize it on someone.",
              "id": 136,
              "comments": [
                {
                  "score": 66,
                  "content": "Therapy is a journey of self-reflection and humility. A lot of people aren’t capable of that, so therapy just becomes a source of validation for their worldview.",
                  "id": 137,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Thiiiiiis. And then they go around saying you're gaslighting them if you don't agree with them, you don't have empathy if you don't agree with them, you're codependent if you need something from them, and asking for too much emotional labour.\n\nUghhhhhhhh",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I see you know my ex-wife!",
                      "id": 139,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Exactly. I can \"go\" to the gym and sit in the locker room earing chips and scrolling reddit. I'm not actually getting any benefit from going to the gym, the way those words usually imply.\n\nGoing to therapy is great--if you're actually there for the right reasons and you're doing something with it.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Hard agree with this. I don’t understand the point of people going and not trying to actually work on stuff.\n\nI have a lot of issues with anxiety and boundaries and therapy has helped a lot. I can see where I had blind spots now and as soon as I pushed boundaries I’ve gotten push back, including with my mom. Do I enjoy it? No, but they’re still important and help me preserve my mental health.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 349,
          "content": "The only narcissist I see in this post is OP.\n\nYTA",
          "id": 142,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 228,
          "content": "Honestly, the way he speaks about her is what makes him an asshole, not the leaving. Sure, he definitely should have mentioned one last time ‘it’s 6, I’m leaving right now’ but it seems he has brought her lateness up several times, which yes it becomes very frustrating after a while. But the way he talks about her, it doesn’t sound like he even likes her",
          "id": 143,
          "comments": [
            {
              "score": 22,
              "content": "Some people are bad at things like this my dad is habitually late so my stepmom tells him things start 30 minutes before they do and they’re never late now lol they’ve been together almost 30 years now and my dad is a better person because of her. I don’t foresee OPs marriage lasting because he seems like he hates her for this, like why would it hurt to tell her “you better get ready” at 615 unless he actively planned to leave her behind? It’s mean and spiteful.",
              "id": 144,
              "comments": [
                {
                  "score": 17,
                  "content": "This. I thought loving someone is also helping them. Trying to figure out ways TOGETHER. But I’m also getting old so what do I know?",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 158,
          "content": "OP is absolutely TAH, but I'm wondering if his wife might have ADHD. Time blindness is a thing that manifests in adult ADHD, which Is a disorder that affects a person's executive function. \n\nFor me personally, being diagnosed about a year ago with ADHD as an adult, and then being properly medicated, has literally changed my life. Things I've always struggled with make perfect sense now and I have been working hard to get my shit together. Time blindness is something I'm currently working on by planning things backwards from the time of departure, working with reminders an alarms, and learning how long things actually take. It's slow going, but knowing how my brain works different has been life changing.",
          "id": 146,
          "comments": [
            {
              "score": 57,
              "content": "Same thought here, and I was also diagnosed late in life. I overcame time blindness through massive anxiety and nonstop clock-checking on days when I had a scheduled appointment. Not a great solution. \n\nYTA, OP, for seeing this as something your wife is doing deliberately to spite you. Getting frustrated is natural but if you love her, then you give her some grace and help her remember and stay on schedule.",
              "id": 147,
              "comments": [
                {
                  "score": 18,
                  "content": "It really sucks when you get stuck in waiting most because you Must Be On Time so nothing else gets accomplished 🙃🙃🙃",
                  "id": 148,
                  "comments": [
                    {
                      "score": 9,
                      "content": "This. \n\nI religiously set alarms and reminders, so that “waiting mode” doesn’t prevent me from getting other things done. \n\nSometimes it makes me anxious that I have to rely on my calendar and my phone so much, but ultimately in the moment it has saved my butt so many times, it relieves anxiety on the back end and keeps me from missing important things. It is SO worth it.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Ha same here with time blindness. You cant be late if you sit on your couch and stare at the clock until its time to go lol.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "I thought this sounded like ADHD, too. Time blindness is absolutely real, and it absolutely sucks.",
              "id": 151,
              "comments": [
                {
                  "score": 11,
                  "content": "Yepppppp. It definitely sounds like my ADHD when I'm struggling with it. Which makes his behavior even worse imo.",
                  "id": 152,
                  "comments": [
                    {
                      "score": 4,
                      "content": "You know what though? And keep in mind I say this as somebody with ADHD, who also suffers from time blindness… at some point it gets really fucking old going around and having to baby somebody constantly and remind them “OK it’s 515 let’s get ready to go chop chop!” for every damned event. Plus I find that when I do that, no matter how nice and helpful and Not Condescending I try to make it sound, I often get the “don’t tell me what to do!“ attitude. \n\nI think it’s shitty to “teach her a lesson.“ That attitude sucks. But I *don’t* think it’s shitty for him to say clearly “I will be leaving at 6 o’clock. If you are not in the vehicle at that time, you will be responsible for finding your own transportation.” And then doing exactly that. I don’t think that he should have to be responsible for letting her know the time is approaching either. “Hey honey, it’s 430! Hey honey, it’s 5 o’clock!“ I want to be married to a fellow adult, not a child. I don’t need another one of those! So I can relate to the total exasperation, especially when it feels like the person is doing nothing to try to change this. There is a certain self absorption to people who are chronically late. Even when it is time blindness… we are so engrossed in ourselves and our own activity we lose consideration for others. It’s honestly extremely disrespectful.\n\nSo basically, I think his attitude sucks with regard to “teach her a lesson”… but I don’t think there’s a thing wrong with leaving at the time that you say you’re going to, and expecting other adults in your home to be responsible for getting themselves ready on time.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Same thoughts to. I’m getting diagnosed right now and I had so much problems with it for so long.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I was late diagnosed ADHD and immediately clocked the wife as probably having it. \n\nMy husband will pop in and update me on the time if we have a hard deadline and he does that because it's the solution we've come up with together after trying multiple things.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 98,
          "content": "Right?\n\nHe’s speaking down to her but “unsure” if he’s an AH 🤣 embarrassingly oblivious.",
          "id": 156,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 45,
          "content": "That's because he might be the narcissistic one in their marriage as everything I read sounded like it came out of my narcissistic fathers mouth. \nYTA, OP.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Wow! I didn’t read those statements individually. OP really doesn’t like their wife",
          "id": 158,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "I can’t fathom thinking you “need to teach your partner a lesson”… she probably acts like a young child because he acts like he’s her Dad.",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5747,
      "content": "YTA.  First of all, it's baseball. The game goes on interminably and it's not as if they don't seat you if you miss the first 10 minutes. Secondly, she was in the bathroom preparing and was a few minutes from being ready. Your response was disproportionate. Thirdly, you did not lay out the extreme consequences ahead of time. That probably wouldn't have saved you from AH status, but then it would have been more of her choice. Fourthly, your wife, as u/johnhodgman would point out, is a human being in her own right. She is not your child for you to discipline if she falls short of your standards.\n\nYou know she doesn't budget her time well. Let her know well beforehand if it's an important event. Reminding her an hour ahead of time and every 15 minutes after that, for instance. If you plan to do something so severe in the future, discuss that with her ahead of time.",
      "id": 160,
      "comments": [
        {
          "score": 1864,
          "content": "This. He sounds like he's just waiting for an excuse to teach a science degree holding adult 'a lesson'",
          "id": 161,
          "comments": [
            {
              "score": 670,
              "content": "OP sounds very insecure and jealous of his wife's career.",
              "id": 162,
              "comments": [
                {
                  "score": 11,
                  "content": "This is a reach.",
                  "id": 163,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 126,
              "content": "I'm pretty sure he wanted to go alone the whole time.",
              "id": 164,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 649,
          "content": "The fact that this was a baseball game and not live theater where they may not let you in once the performance starts or even just a movie where you're missing plot relevant scenes is huge. \n\nOh no, you're late and missed 15 minutes of a 2 and a half hour game. How can you possibly get caught up now?",
          "id": 165,
          "comments": [
            {
              "score": 263,
              "content": "Baseball games sure feel like longer than 2.5 hours. When I read that I was like, is that all?",
              "id": 166,
              "comments": [
                {
                  "score": 113,
                  "content": "They vary, as you'd expect and I believe they recently changed some MLB rules to try and make things faster, but it dropped the average game length from like just over 3 hours to just over 2.5 so... Yay?",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "The pitch clock has saved the game from watching dudes scratch their balls for 4 hours.",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Some people care very much about missing the first 15 minutes of a game in person (first pitch, kickoff, tipoff, etc).  Probably would’ve been more than 15 minutes because of parking, going through security, and finding their seats.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "It sounds like you just don’t like baseball, which has nothing to do with whether this guy is an asshole or not. This whole comment chain is insane to me. This guy is an ass because of how he treated his wife, not because of the fact that he wants to get to the game on time. It certainly isn’t “huge” and the fact that you think so makes me wonder how you treat people that have different interests than you. \n\nYou’d be ok with missing the first part of concerts then too right? They’ll still let you in, if you miss the first couple songs it doesn’t keep you from enjoying the others, and you can always listen to the songs you missed on Spotify later, right?",
              "id": 170,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I don’t care about baseball, but if I was going to a football game I would make sure I’m there at kickoff. There’s just something about being there start to finish. He went about this wrong and he’s the AH, but I don’t disagree with wanting to be on time to a ball game.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "It’s fine to want to be in your seat for the first pitch. I’m the same way. What isn’t fine, how he handled basically everything else",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 169,
          "content": "Just because you don’t like baseball doesn’t mean other people wouldn’t be upset about missing part of the game. You are also completely excusing her bad behavior. She has an established pattern of being late. Did OP overreact? Yeah, he kinda did. But if she is not his child for him to discipline, he is not her parent to constantly monitor her. Why should he have to give her reminders? I am also firmly in the camp of “if you don’t want to sleep in the same bed as me then you should sleep on the couch.” She wants to punish him by making him sleep on the couch. That is just as much AH behavior as punishing her by leaving her at home. This is ESH.",
          "id": 173,
          "comments": [
            {
              "score": 94,
              "content": "I don’t understand why everyone is saying OP could be late to the baseball game. It’s totally valid to want to experience the entirety of an event you’ve been looking forward to & to not want to miss the first part of it. He can be an asshole for the way he handled the situation but also simultaneously have a valid desire to not miss the beginning of an event he enjoys.",
              "id": 174,
              "comments": [
                {
                  "score": 17,
                  "content": "Because it's reddit and a good chunk of the people on here are 'lol go sportsball'.  They don't like sports so they don't care that OP values it.",
                  "id": 175,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I mean I hate sportsball myself but think it is such an AH move to belittle OP for wanting to be there on time. I know some people hate musicals, I love them and would expect the same respect in return. I agree, people are being wild about him wanting to be on time",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "To preface this, I don't like baseball much at all. The one Sox game I went to this season had 9 runs between both teams in the first inning, and then 6 more across the rest of the game. 3 of those runs in the first inning were homers. You can certainly miss out on the start of a baseball game, just like any event. People saying you can't are just \"sportsball\" dweebs who don't respect other people's hobbies. He likes it a lot and wants to be there, and if she loved and respected him that should've been reason enough. My partner has never made me late for a Celtics game, and I've never made them late for a musical, even though we don't particularly enjoy each other's hobbies, since it's something that someone we love cherishes and doesn't get to do often, so we show it respect.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "This is the first time when I see on Reddit actually meaningful take about the couch thing. It amazes me how acceptable has become that kind of behaviour. Media who made 'sleeping on the couch' an international joke also didn't help the situation.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I dated a girl for 8 years who would try to pull that “you can sleep on the couch” shit. I’d simply say “if you don’t want to sleep with me, you sleep on the couch. I’m sleeping in my bed”\n\n\nI really don’t understand dudes who just go to the couch",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "Baseball games may not matter to you or me but it was important to OP to be there on time to see the opening pitch. He even says it's a rare treat. \n\nStill he should've warned her that he's leaving right at 6 with or without her.",
          "id": 180,
          "comments": [
            {
              "score": 10,
              "content": "Yeah, everyone's an asshole in this story, but not wanting to miss a chunk of an event you really like is understandable.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "With the new pitch clock, if you’re 30 minutes late, it will be almost top of the third",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": ">Let her know well beforehand if it's an important event. Reminding her an hour ahead of time and every 15 minutes after that, for instance.\n\nI agree he's an AH for how he handled this, but that is an unreasonable expectation to put on an adult. Or rather, it's too little expectation to put on the other adult here. She's a grown gamer, she can get herself ready in time. \n\nPersonally, I appreciate it when my GF gives me a head-up while I'm gaming (\"Remember, our reservations are in an hour!\"), but I don't expect her to - I'm absolutely capable of getting myself ready on time. OP's wife should as well.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "> Reminding her an hour ahead of time and every 15 minutes after that, for instance.\n\nSo you are basically saying threat your wife like a child?",
          "id": 184,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "I agree it was an asshole move, but I don't see why he should always have to remind his wife of when they are leaving as you suggest. She knows it bothers her husband when they are constantly late to everything, she can use her phone to set a few reminders to mitigate that. Why should he always have  to make sure his wife is ready on time? It's exhausting.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I find it funny.\n\nYou say she isnt his child but you want him to remind her every 15min about it, because she cant be responsible for her time management.\n\nIts not about discipline but about consequences. Should it be that harsh and without a warning? No",
          "id": 186,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "I might be the only female with AuDHD on this tread who says OP is NTA. \n\nMy husband is always late and has no concept of time and it drives me insane.\n\nReminding someone every 15 minutes is exhausting… why can’t OP’s wife be a responsible adult?",
          "id": 187,
          "comments": [
            {
              "score": 3,
              "content": "Nope.  Not the only one.  I agree.",
              "id": 188,
              "comments": [
                {
                  "score": 6,
                  "content": "Thank you!\nMaybe I am over analyzing it, but I feel if the genders were reversed, they would say OP is NTA. \n\nIf it was a man who was not managing his time well and causing the wife to be late, he would definitely be the a-hole to the Reddit community.",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4364,
      "content": "YTA. You waited until she was in the bathroom and couldn't see you to leave to \"teach her a lesson\" (while she was actively getting ready and nearly done by your timeline of just a couple minutes to notice you were gone). You are infantalizing her and she was literally just a couple minutes behind you. She is not the pill here. You're a whole entire chore.",
      "id": 190,
      "comments": [
        {
          "score": 1508,
          "content": "Yup. If he had said, “I am leaving at 6:00 with or without you,” I would have said N T A. It IS her job to budget her time. But he snuck out of the house without saying anything, which makes him TA.",
          "id": 191,
          "comments": [
            {
              "score": 554,
              "content": "Agreed. I really disagree with the people who are suggesting he should have to play games (e.g. telling her the event is an hour earlier than it is) in order to get to things on time. She’s a grown ass woman and “The event starts at 7 so I’m leaving at 6 with or without you” should suffice. No need to treat her like a child.\n\nThat being said, he wasn’t explicit with her and it sounds like he was chomping at the bit to “teach her a lesson” in order to punish her for all the other times she made them late instead of having a conversation with her like an adult.\n\nHe doesn’t have to put up with her inability to manage her time, esp. if he gives her ample warning, but to sneak out without saying anything (“I told you this morning“ doesn’t count) is an AH move. YTA",
              "id": 192,
              "comments": [
                {
                  "score": 181,
                  "content": "I would like to point out the thing where people tell others to be ready earlier than needed doesn't have to be about treating them like children, but just giving them a little kindness and understanding. Many people with disorders like adhd and autism can deal with something called time blindness where they don't perceive time the way others do, and one of the main issues there is struggling to plan out enough time for things. Just a reminder that not all brains function the same way and a little compassion can mean a lot to someone.",
                  "id": 193,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Agreed. I have ADHD and am terrible at managing my time. My parents started doing this to me as a teenager, like going to a relatives house for a holiday dinner, they’d say we’re leaving at 3, so be ready by then. I’d guiltily come downstairs at like 3:15 or 3:30, apologize from running late only to see my fam just chilling in the living room and saying something like oh don’t worry, we’re not actually leaving until 4. At first, I was slightly annoyed at being duped, but honestly it just felt like such a relief off my shoulders knowing I had time to spare and wasn’t holding everyone up for once. Now I get annoyed when they don’t try and trick me",
                      "id": 194,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "I’ve done this with a friend just a couple weeks ago. I booked dinner for 8 and he told me to just tell him it was at 7. \n\nHe has ADHD and actually ended up nearby at 6 because he was so anxious about being late. \n\nI don’t think I have ADHD, but my husband and I look at time very differently. For things like the airport I feel anxious if I’m not there at least 2 hours early. He feels pretty calm strolling in with an hour to boarding. \n\nIf someone is picking us up he’ll have us both ready and standing outside 5-10 minutes early, which I don’t particularly enjoy when it’s 40C and humid outside. \n\nSometimes he’s chivvying me to get up and ready. Sometimes I’m the one chivvying him. Sometimes we both mutually agree we’re going to pretend something is earlier than it is to give us more of a sense of urgency, particularly if it’s early in the morning and we both feel like absolute slugs.\n\nEven with neurotypical people you sometimes need to play tricks on your brain to get yourself to do things.",
                      "id": 195,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "People fail to understand the concept of “being kind to your partner”",
                      "id": 196,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Totally unrelated but I recently learned that the original phrase was “champing at the bit”. The verb champ lacks modern context and a more recognizable word took over as the understood phrase.\n\nJust wanted to share.",
                  "id": 197,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Thank you, internet friend!  It always makes my day when I learn some neat bit of etymology.",
                      "id": 198,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 81,
              "content": "Why does it remove all responsibility from her though? People are conveniently forgetting that she’s spent their whole relationship refusing to take any responsibility for her time, but because OP didn’t handle it well that’s forgotten?\n\nI agree the way he handled it makes him an AH, but it’s got this bad then so is she. He infantilised her, but she’s also behaving like an infant who needs to be told exactly what to do at every moment - that’s OP’s entire point, that for once she should be capable to coordinate her own time without being told.\n\nESH.",
              "id": 199,
              "comments": [
                {
                  "score": 11,
                  "content": "I agree, actually. I should have added the official judgment ESH to my original comment, cause that’s the way I was thinking. I just didn’t articulate it well.",
                  "id": 200,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 143,
          "content": "I wholeheartedly agree. You let your partner know when you are leaving, especially if the partner is expecting to leave with you. And you sure as hell give a warning a few minutes before, emphasizing your intent to leave without your partner and force the partner to find his/her own way.",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 121,
          "content": "He even admits that she would have been ready in a few minutes. It's not like he had to wait hours for her",
          "id": 202,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "“Pill” and “chore” sound like rich-people insults from the 1930s. But maybe they’re poor-people insults from the 2030s.",
          "id": 203,
          "comments": [
            {
              "score": 4,
              "content": "Sorry, we can only afford budget insults, you gherkin.",
              "id": 204,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2760,
      "content": "YTA. My partner is CONSTANTLY late and is the furthest from \"narcissistic\" it's literally an ADHD symptom. \n\nYou passive aggressively leaving, and trying to \"teach her a lesson\" like that tho? Red flaggy af. \n\nBaseball < your marriage.",
      "id": 205,
      "comments": [
        {
          "score": 242,
          "content": "It’s definitely a possibility that his wife has ADHD but as someone who has pretty severe ADHD-I used to constantly struggle with being in time to things and was always really embarrassed because I felt like it was something that was out of my control because I had ADHD- until I realised that just because my ADHD explains my behaviours it doesn’t always excuse them. Wasting someones time and being constantly late regardless of if it’s a symptom of ADHD is rude and unacceptable and honestly makes that person a massive dick. I have had to learn coping methods for my lateness to make sure I no longer make anyone feel like their time isn’t valuable and I now am able to make it on time to things/ not make people wait on me (I obviously do occasionally slip up and get distracted but the point is I still try)- it takes a lot of effort but it is 100% accomplishable for someone with ADHD. \n\nSo my point is using ADHD to excuse her behaviour (if she does have ADHD) is an irrelevant argument and honestly I think saying that people with ADHD are CONSTANTLY late just because it’s a symptom gives us a bad rep- because again, although obviously your partner doesn’t make that effort- people with ADHD are 100% capable of being on time and those who are/ try to- consistently make that effort, because they understand that inconveniencing people like that is an asshole move and people don’t deserve to deal with or be treated like that. \n\nThis is longer than I intended but anyway lol: it seems like his wife obviously knows that being constantly late is a reoccurring behaviour - and has obviously made no effort to improve or work to fix that problem which in my opinion says that she couldn’t care less that she’s being rude or that always people are always waiting on her- and that the people she’s inconveniencing are not important enough to at least try to fix her problem which makes her a massive AH and although I don’t agree with him just leaving her at home, it was definitely immature- I think that having to constantly deal with her being inconsiderate of his time would naturally make him endlessly frustrated.",
          "id": 206,
          "comments": [
            {
              "score": 527,
              "content": "Yes, but you *know* you have adhd. I was diagnosed in my 40s. Now I have better strategies. Before I thought I was just shit at adulting and would try and try to be on time and repeatedly fail because I didn't understand why all those techniques other people use didn't work for me.  And it's still not perfect. But it's better. And a large part is my family understanding better as well and helping me.",
              "id": 207,
              "comments": [
                {
                  "score": 272,
                  "content": "This is super important. Not to mention the time it takes to overcome those behaviors, because it sure as hell doesn't happen overnight! \n\nI have ADHD and autism. As a teen I was regularly late by an hour or more. It was awful. Time blindness was not the only factor at play by a long shot, so it wasn't as simple as getting a watch. \n\nAfter 10 years of working very hard on my punctuality, I'm on time half the time and 5-15min late for the rest. This is a MASSIVE improvement for me, but still unacceptable to most people.\n\nI'm not saying it's acceptable to be chronically late, but a little understanding goes a long way for those of us who are actually working to improve our tardiness.",
                  "id": 208,
                  "comments": [
                    {
                      "score": 78,
                      "content": "Exactly. I have ADHD. I know how I am with things. Doesn’t make it any easier to “Not be that way” in practice. Especially when you understand it’s literally a brain issue. You have to really understand yourself and create tools to help you. Even when you try with adhd you have trouble with things because you know. That’s how your brain is hardwired to function. It’s definitely not an excuse and accountability is important. You can’t shame or explain away your biological reality.",
                      "id": 209,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "This for sure. I’ve been fired from jobs for being late. This did not cure my lateness. Figuring out new strategies WELL into my 30s cured my lateness. Mostly. \n\nAs a result I also have severe anxiety over being late, so even then I haven truly “cured” it… I’ve just swapped it for being incredibly early. I’m still just as time blind, I just learned to accommodate it. \n\nBut it took a lot more than simply “being fired” to solve it. And a spouse being a dick to me absolutely wouldn’t have done a damn thing.",
                      "id": 210,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I have the opposite version of time blindness you have. I'm always early. I'm not talking about 5-10mins. It's me sitting in my car for 30+ mins to be 15mins early. If I have to be somewhere at 4pm I start freaking out and constantly looking at the clock at noon obsessing over when I should start preparing to leave. It's exhausting",
                      "id": 211,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Well done on making those improvements and I appreciate you sharing this as well as the few commenters above you.\n\nWhen people know there is a reason for this lateness, when we're educated about how difficult it is, which is what you're doing for me now, then everyone can be happier.\n\nI don't have this time blindness but I have a couple of people in my life that do, some try their hardest to overcome it, some can't so much.\n\nBut as a person that's pretty much always on time please believe me that most of us aren't anywhere close to being angry if others can't. Especially when there's a little communication.  Also it's hardly the be all and end all of life is it. I can make adjustments for time it's no biggie. Like I turn up 13.50 for a 14.00 appointment oooohhhh I'm hard haha. I bet you can do something better than me, guaranteed there's something.\n\nAnyway, don't beat yourself up you're doing great.",
                      "id": 212,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 210,
              "content": "He is attempting to DIAGNOSE HER with narcissism for being late. My partner and I both have ADHD. I was offering a different mental health condition that I know has an issue with being late/time management. Yes you have worked on your shit, but this is bootstrap mentality when someone is being seriously passive aggressive idk\n He didn't communicate he would leave without her. She was getting ready, maybe only a few mins behind him. He just left as \"punishment\" you don't \"punish\" or \"teach your partner a lesson\" like that.\n You communicate and make boundaries.\n \"I am leaving at 6, whether you're in the car or not I am not missing the game.\" Is a fair boundary. Leaving while she's in the bathroom is just rude and immature. He didn't have a boundary he had an \"expectation\" he's TA. \nSo are a lot of his comments about her in the OP. AH",
              "id": 213,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 105,
              "content": "I have pretty severe adhd too.  I use to be late for everything, now i get stuck doing nothing because i’m afraid if i start something i’ll hyper focus and be late.  And if i am running late i panic lol.   I just can’t seem to find that balance yet.",
              "id": 214,
              "comments": [
                {
                  "score": 36,
                  "content": "I’m the same!! If I have plans with someone even if it’s later in the day I literally avoid doing anything because the thought of being late makes me anxious!",
                  "id": 215,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I call this 'waiting mode'.",
                      "id": 216,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "“Task paralysis”",
                  "id": 217,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I have ADHD - diagnosed in my 30s. My dad and my sister have it, too - both diagnosed as children/teens. My dad and I were never late to stuff because it gave us huge anxiety. We were always early. The shame of people thinking less of us was such a motivator for being early. But that meant we usually just sat around waiting to leave instead of doing anything before going. Like, I can't do the dishes because I have to leave the house in 45 minutes and what if washing dishes ends up taking me an hour? Absolutely irrational stuff. My sister was constantly late to everything so it was different for her. \n\nThe pandemic really fucked with my arrival times because during various lockdowns, businesses didn't want you arriving early for appointments. Normally I'd be 15 minutes early, but with them trying to reduce people hanging out in waiting rooms together they'd ask you to arrive no more than a couple minutes before your appointment time. This was sooooo hard for me, and I ended up becoming the person who is often late - usually only by a couple minutes and five at most, but it was such a different switch for me. \n\nNow I'm usually right on time, or a couple minutes early, and I don't have that constant \"waiting room\" feeling like I can't start anything when I know I have to be somewhere at a certain time. What really helped was the recommendation to time how long it took you to do certain tasks - it'll take two minutes to respond to that email, 5 minutes to unload the dishwasher, two minutes to switch over laundry - and reinforce that these tasks don't take much time and you can budget for them. I'm always looking up directions and double checking how long a route will take so I can appropriately time everything. It's a lot of mental energy, but honestly I think I spent the same amount of brain power panicking about stuff I needed to do but wouldn't do because I worried it would make me late for somewhere I had to be in 4 hours. \n\nThe baby step to getting where I'm at was telling myself every chore took 15 minutes, even if it took significantly less. I'd just budget 15 minute time slots in my mind to get small tasks done. It made it possible to accomplish things by saying \"I have time to get 4 15-minute tasks done\" instead of overanalyzing the amount of time I'd need and end up doing nothing at all.",
                  "id": 218,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 85,
              "content": "Yeah, this. OP needs to read up on “time blindness”, it is real and chances are she’s not doing it on purpose to annoy you (why would you marry someone who doesn’t care about your feelings?). But absolutely, ADHD is no excuse, and the wife needs to realize how much it bothers OP to be late. They need to work together to solve this, not try to teach lessons and banish each other to the couch like brats.",
              "id": 219,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "She was in the bathroom getting ready. Just a few minutes behind him. He could have told her he was going to leave without her if she wasn't ready in time. But also, it's a baseball game. I've been to tons of them. Majority of people are buying merchandise or food even when the first pitch is thrown. He's complaining that he would have missed the first couple minutes of the game. If it was that important to him, he would have said he wanted to leave more than an hour before first pitch. 15 mins doesn't give you that much time to to your seats to begin with, especially getting through security.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "What are your coping methods to be on time?  I've struggled with being late my entire life and I set so many alarms and reminders and still am late at times. If I get distracted by something, I will lose track of all time.",
              "id": 221,
              "comments": [
                {
                  "score": 22,
                  "content": "Reminders alarms and being ridiculously early for things. Also stressing over everything all the time.",
                  "id": 222,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "It needs to be frankly discussed and yes, there does need to be actual mechanisms to improve. I have adhd and don’t struggle as much with this, but I know people who do, and we discuss it if it becomes an issue. \n\nI don’t see it as a personal fault unless they show no remorse or willingness to improve after we discuss the situation. \n\nBut “teaching someone a lesson” is useless and they need to learn how to communicate.",
              "id": 223,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "It’s possible the wife could have ADHD and just be undiagnosed if this is a chronic problem for her. I’m not saying it’s an out but there are options to help her manage her time better like medication and stuff if she truly does have adhd",
              "id": 224,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Have you considered that perhaps she's undiagnosed so doesn't realize that she has to figure out ways to trick her brain into behaving like a neurotypical?",
              "id": 225,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "There are ways to help someone with time blindness. He is her partner, he should be helping her, not punishing her. There are lots of tips and tricks that could help. Just leaving though, is deffinitly not one of them.",
              "id": 226,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Yeah sounds like if anything this guys the narcissist. \"How dare she fall short of my standards i must discipline her like a child\"",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "THIS \n\nChronic lateness is an ADHD symptom due to something called \"time blindness.\". I only recently rediscovered this and it explains so much.\n\nNot only being chronically late, but after many years of work to fix it, I'm often just barely NOT on time.  Like consistently ready for work around 5 minutes late.  Drives my partner insane since he drives me to work and is chronically early.  Not because I'm not trying, but I literally feel like I'll look up at the clock and have somehow lost 5 minutes.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "same, the person he described just sounds adhd as shit (and that goes hand in hand with the science degree - shocker, a shitload of us are adhd)",
          "id": 229,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1877,
      "content": "YTA \n\nWow.\n\nMy favorite part is where you are shocked, SHOCKED that your wife is mad at you and wants you on the couch.",
      "id": 230,
      "comments": [
        {
          "score": 406,
          "content": "The lack of self awareness is embarrassing",
          "id": 231,
          "comments": [
            {
              "score": 193,
              "content": "And he claims SHE’S the narcissist?",
              "id": 232,
              "comments": [
                {
                  "score": 36,
                  "content": "I think that part really showed his delusion. And perhaps his own Narc tendencies to think he is a superior person to his spouse",
                  "id": 233,
                  "comments": [
                    {
                      "score": 8,
                      "content": "He really taught her a lesson! /s\n\nYTA OP",
                      "id": 234,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 95,
          "content": "This was in an Everybody Loves Raymond episode. Even the ornery grandfather said the Ass In Seat rule only applies to children.",
          "id": 235,
          "comments": [
            {
              "score": 75,
              "content": "\"You don't AIS your wife!\"\n\nGenerally speaking, if you find yourself living out an episode of Everybody Loves Raymond, you've probably messed up somewhere. By no means was the character an AH, but he's not a person you want to emulate in a relationship.",
              "id": 236,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "I thought the same thing! She actually needed his help with something but he had gone, and everyone at the event was horrified with him for leaving her behind.",
              "id": 237,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I love that guy, always watched that show as a kid with my parents, good memories man",
              "id": 238,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I remember that one. And it turned out she had a genuine emergency, her curling iron got stuck in her hair. Imagine doing something as dumb as Ray Barone 🤣🤣🤣",
              "id": 239,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I thought of this episode as soon as I read the post.",
              "id": 240,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I was hoping someone would mention A.I.S.!",
              "id": 241,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "What a pill!\n\nSounds like a 50s husband casually complaining about his housewife having feelings.",
          "id": 242,
          "comments": [
            {
              "score": 6,
              "content": "*smoking a cigarette*\n\nCan you believe that dame? She’s cuckoo if she thinks I want to hear her feelings. Just be in the car with my steak sandwich and my team pennant. Anymore lip out of her and I may have her committed.",
              "id": 243,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1762,
      "content": "Divorce her if you hate her this much",
      "id": 244,
      "comments": [
        {
          "score": 510,
          "content": "I feel this in my bones. He hates this woman unreservedly",
          "id": 245,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 111,
          "content": "Literally. OP should give his wife a chance to find someone who doesn't talk like this about her and treats her like a child when she is, in fact, not acting like one.",
          "id": 246,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "How much you wanna bet she's the higher income earner?",
          "id": 247,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "My thoughts.  Why do people that dislike each other stay?",
          "id": 248,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 949,
      "content": "[deleted]",
      "id": 249,
      "comments": [
        {
          "score": 91,
          "content": "Sounds like all of the above.",
          "id": 250,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 40,
          "content": "Agree ESH, they both sound like AH’s",
          "id": 251,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "He sounds like he was never socialized. Communication skills on the floor of the basement.",
          "id": 252,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "As a clarification - does ESH mean everybody sucks equally? Like, my partner also has no concept of time or lateness and it drives me crazy, but I feel like that’s still relatively low AH compared to the OP…",
          "id": 253,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 923,
      "content": "Being right and being an AH are not mutually exclusive. YTA.",
      "id": 254,
      "comments": [
        {
          "score": 190,
          "content": "This definitely feels like a “time and place” scenario. I don’t blame him for being upset about her being late all the time, that would bother me too. But a baseball game is not the kind of event where you HAVE to be there right as it starts, like a movie or a play. Plus it was something that OP goes out of his way to specifically note that she was also excited for. That means he chose to deny her that opportunity to attend to “make a point”. That’s abhorrent. I don’t care how made you are at a partner, if you actually loved them you wouldn’t do something like that",
          "id": 255,
          "comments": [
            {
              "score": 21,
              "content": "I think you're minimizing the love of the baseball they have. You might think it's relatively meaningless but OP does say they both love the game so it might mean way more to them than it does to you. That in turn means it might be actually important to them to be there for first pitch. \n\nAnyway, a lot of people are omitting that OP has been on her case about being on time for ages and this wasn't a 0-60mph in half a second deal. OP is at the end of their rope with a wife that refuses to at least reign it in for him when he's voiced his concerns for tons of time \n\nIt's a ESH to me. She's inconsiderate of him and the way OP went about is kinda wrong. I think the wife is more to blame though since at least OP communicated ready to leave by 6 AND told her about the time readiness a lot before. \n\nWhat else is he gonna do? Keep being late when he's explained his feelings on the matter time and again?",
              "id": 256,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Even if she did make it there herself, I wouldn’t want to watch the game w OP. Night is ruined now.",
              "id": 257,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Flip that right around. If she loved him she wouldn’t  constantly be late and put her interests first all the time. She should be doing things *like that*.",
              "id": 258,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "There it is",
          "id": 259,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 758,
      "content": "YTA. I was in your corner until you said you left without a word while she was in the bathroom. Just a simple “Hey I’m leaving in 5 mins whether you’re ready or not” and then it would have been a solid NTA.",
      "id": 260,
      "comments": [
        {
          "score": 173,
          "content": "After he said that, I didn’t truly believe there was any real communication beforehand about the game. He sounds more petty and vindictive than anything.",
          "id": 261,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "Totally agree with you. It's frustrating dealing with her not trying but he should have said I'm going in 5 with or without you. She might have actually been ready before those 5 minuets, we don't know, neither does he.",
          "id": 262,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "He fuckin wanted to leave her behind",
          "id": 263,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "This. If he said that and she still wasn’t t ready I’d say it’d be alright to leave but just leaving without saying anything? That’s just being rude in any scenario",
          "id": 264,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "And it's not like they live in the city where she could just hop on public transport or catch a cab! They live out of the city he said.",
          "id": 265,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}