{
  "post content": "My husband, our daughters (18, 16, 16, 12), and I live in a 4 bed 2 bath house. \n\nAll of the girls share a bathroom and they’ve been complaining about it for a while. We’ve been saying we’ll convert the laundry room into a bathroom for the twins for a while. It’s an expensive project so we’ve never gotten to it. \n\nMy husband and I started working on our garage recently and turned it into a gym for him, a new laundry room, and an office for me. Then we came into some money and decided to renovate both bathrooms, remodel the kitchen, and do work on the backyard. \n\nThe girls were pissed when we told them about the work we were doing on the house. They were saying it’s not fair that my husband gets a gym when the twins share a room and that we chose to work on the backyard instead of adding the third bathroom. \n\nThey’ve been calling us selfish and even got our parents and siblings to give us a hard time for not giving the girls another bathroom or giving the twins their own rooms. They don’t understand that now that the laundry room is done we have the space for the bathroom. The bathroom is next on our list. \n\nI wanted to get some outside opinions on this since our kids and our families have been giving us a hard time.",
  "id": 1,
  "comments": [
    {
      "score": 30826,
      "content": "YTA. Does going without a home gym diminish quality of life? No. Does forcing four humans to share one source of plumbing diminish quality of life? Yes. YTA for springing for a luxury instead of choosing to make life easier for your kids.\n\nEditing because I keep getting the same comment over and over of people saying something along the lines of \"HOW DARE YOU! I live in a house of 6/9/12 and we share 1/2/a fraction of a bathroom! You are spoiled and icky!\", and I'm really tired of penning the same response over and over, so I'll just say here:\n\n1. I grew up the youngest of five. I shared a bathroom for eighteen years with siblings.\n2. I share an apartment with a few folks, and we share one bathroom.\n3. My point is that, if I had a bunch of money lying around, I'd spend it to make the lives of my kids a bit easier, rather than on something frivolous.\n4. For all of you crying out \"ENTITLEMENT AND LUXURY! UGH!\" Please take the time, whilst you redden your faces in rage at the prospect of two people sharing a bathroom instead of four, to also take your energy to defend OP's choice to redo the existing bathrooms, redo her kitchen, add a new gym, and redesign her backyard.\n5. You all like to skate over the fact that OP lied to her kids about a new bathroom, and has presumably been doing so for a while.\n\nHopefully that hits anything that anybody else who wants to hop on and complain into the internet void could possibly care about.\n\nEdit 2: Jesus Christ y'all, everyone here has probably had to share a bathroom. You are adding NOTHING to the discussion by spamming this thread with \"Me! Me! Me! I grew up sharing a bathroom and was fine!\" That's great but.... once again.... NOT THE POINT. YOU ARE SOMEHOW ENTIRELY MISSING THE POINT. \n\nThe new trend is for folks to say \"well, the older kids are gonna be gone soon, so it doesn't matter!\". No, they're not. OP has commented that the kids aren't gonna be moving out until at least after they're done with college. \n\nAaaaaaand finally, for you sexxxxxy edgelords who are commenting calling me and others dumb or derogatory things, I sincerely have to ask: what do you wish to accomplish? What special contribution do you think you're making to the internet? Do you think a nice, spicy \"fuck you\" is gonna change the mind of myself and others on here? All you're doing is making me chuckle at the fact that you're sitting with your phone or computer puffing in anger over something that, in abstract, doesn't effect you at all. I'm not gonna answer you, so you're wasting the precious energy of the joints of your phalanges. But do you :)",
      "id": 2,
      "comments": [
        {
          "score": 4294,
          "content": "To me it depends on the work needed to do the gym. If dad already owed all the equipment. And just did some studs drywall and flooring that's allot more affordable then a full bathroom reno. Especially if it's just the back side of the office where mom brings in an income. I also understand that teenagers don't understand the difference between a five hundred dollar room and a five thousand dollar bathroom.",
          "id": 3,
          "comments": [
            {
              "score": 2593,
              "content": "[removed]",
              "id": 4,
              "comments": [
                {
                  "score": 928,
                  "content": "Honestly would depend what kind of quality you want the work to be and how much work you're willing to do yourself.  I could see it coming in under $5000 if you're handy.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 501,
                      "content": "No way. Maybe a toilet and a sink but adding a shower more than doubles. Could probably do it cheaply in the 12-15k range but definitely not for 5k.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 29,
                      "content": "Are they doing all the plumbing themselves?",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "I can't and I have lots of handy friends and family. Source: I am actively sourcing quotes to put in a third bathroom and even with us doing a lot of the work, we are looking at around $15k for a half-bath.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "As a very handy person who could all of this for a pittance, I want to advocate for people who do NOT have those skills. There’s just no way for them to cheaply, quickly and properly install a bathroom. You can have cheap and good, cheap and fast, fast and good, but not all three, and a laundry can’t be removed and reinstalled plus a bathroom without upending six people’s lives. So let’s not wag our fingers about they ‘just need to _____’ cause it took years and years of tool use to be able ‘just’ do such a thing.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 123,
                  "content": "Eh not really the plumbings already there you can tie the sink and drain all into the existing.You can get a panel shower kit for under 300 or upwards of 2k. Same with sinks,floors,hardware. All in all you could do it for under 5 k or you could make it cost 20 or 30.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 86,
                      "content": "I doubt the current drain is adequate for the toilet. Running 4 inch for the toilet and 2 for a shower will be quite expensive.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 45,
                      "content": "My husband and I are renovating a bathroom ourselves and it's costing over $10k just in materials.\n\nEdited because I forgot a word.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "My bf and his dad recently converted an old walk in pantry into a bathroom with a brand new shower and toilet and it cost us under 2k. If you can tie into already existing plumbing it can be done!",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "It all depends on where you're at. I could remodel most of my house with 30k!",
                  "id": 14,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Seriously! Bathrooms (that are done right and well so they last for decades) are expensive.",
                  "id": 15,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "If it was a Landry room it would have the essential plumbing and pipes already there. A lot of the work is already done. If they got a simple toilet and shower it wouldn’t reach to 20k. Since it is for the kids I assume they would go basic and upgrade later",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I live in the UK. My bathroom remodel was just under 6k, I plurged on a couple of things. Just saying",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Yeah we just did a full bathroom reno and the cheapest quote we had was 20k up to 40k. That was without moving any plumbing at all",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 186,
              "content": "Also to add to this Gym equipment can also be fairly affordable. You can do it easily for under 5k and have a sick gym",
              "id": 19,
              "comments": [
                {
                  "score": 43,
                  "content": "[removed]",
                  "id": 20,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Stupid bot stealing u/Shnipi's [comment](https://www.reddit.com/r/AmItheAsshole/comments/z6avg4/aita_for_not_adding_a_third_bathroom_to_our_house/iy0c6l1/).",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Bad comment stelaling bot!",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "You just wait until Feb/March and look on craigslist for everyone who has given up on their new years resolutions selling their stuff. ;-)",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 141,
              "content": "[deleted]",
              "id": 24,
              "comments": [
                {
                  "score": 223,
                  "content": ">Creating a whole bathroom is not a cheap project. Some family members already had an existing bathroom that they wanted to redo and all the quotes they got were minimum $15k-$20k, and this was almost ten years ago!\n\nBut OP spent the money to redo the 2 existing bathrooms and says that they'll get around to adding a bathroom \"next\".  Sounds like all of the girls would have preferred a new bathroom over an update to the existing one.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 72,
                      "content": "Updating a current bathroom is waaaay cheaper than building a new one, even with some existing plumbing, more or less from scratch. A lot of work like this has gone waaaay up the last few years. Building a brand new one can easily cost someone 20-40K if they're not handy",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "That's what I don't understand. If I were doing a Reno like this, I would do the new bathroom first (maybe second since they had to relocate the laundry, but they could use a laundromat in the intrim), one of the largest cost first, plus it would provide a second bathroom while they were renovating the existing ones. OP, are you telling us that you all are using one bathroom while renovating the other? That doesn't make logical sense to me.\n\nETA, YTA OP, and when all is said and done, you just taught your daughters that your word isn't worth that much, if anything.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "I remodelled both our bathrooms when we moved in four years ago and it was around 10k for both and that was.eith existing plumbing.",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "But kitchen remodels aren’t cheap either. I just did a kitchen renovation in a tiny 60 square foot space and it cost 20k. Mom and dad have the money to renovate their kitchen AND both existing bathrooms. I’m not denying that the laundry bathroom conversion is expensive, but it’s cheaper than all this other stuff once you add it together.",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Moving the laundry room was part of the garage conversion so obviously that had to come first. \n\nThe debate is the order of the other projects - kitchen, bathroom updates, and backyard. And there are a lot of details that can affect the order. Finances, cash flow, and relative costs, contractor availability (we just booked a home repair project for next September, nobody in this specialty had openings at all before next summer), and time of year for the back yard. \n\nSo INFO: why are the other projects higher on the list, and how much do they delay the new bathroom? If it’s only a couple of months and there are practical reasons for the scheduling order, the complainers are out of line. If prettier countertops in a functioning kitchen were considered a more pressing need than the new bathroom, they have a legitimate gripe.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Just got quoted to remodel our shower (whoever thought 1in square tiles in a shower is an idiot), admittedly we upgraded a couple of things, but it’s around 17k.",
              "id": 31,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 678,
          "content": "A good chunk of the world makes do with homes with 1 or 2 bathroom.  Why spend thousands of dollars when three of the girls will be gone in less than 2 years instead of a gym which can be used by everyone for years to come.  By the time the bathroom is done there's only going to be one kid left in the house.",
          "id": 32,
          "comments": [
            {
              "score": 1307,
              "content": "Who says we live in a world where 18 year olds leave the house. In this economy!",
              "id": 33,
              "comments": [
                {
                  "score": 84,
                  "content": "So I live in the U.K. in my parents home. My sister moved out in 2018. At that point, my parents, me (23F), my younger sister (18F), my older sister (27F) and her fiancé (27M) shared 1 bathroom. Which is to say, I see the points of both you and the commenter you replied to lol",
                  "id": 34,
                  "comments": [
                    {
                      "score": 5,
                      "content": "UK here too, think slightly different for us as we don't have appliances in the bathroom (hair dryer, straighteners and so on) and make up done in room (well, we did! I have 2 sisters! Shared with younger sis for 18 years!)",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Yeah I will never understand this fixation people in USA have for throwing their kids out as soon as they turn 18. Here it’s perfectly common for parents to keep supporting them thorough the university years and until they are ready to move out on their own.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I swear it's an American thing to throw children out at 18 like they've been a millstone around your neck.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 427,
              "content": "They haven’t said how long they’ve been discussing this. If it’s been years and years then the “a few will be gone in 2 years argument” doesn’t apply. These kids have been made to suffer sharing 1 bathroom between all of them for probably a long time, and with all of them being women that’s just really a lot. While I agree that no one is entitled to anything, I still think this is YTA because the parents are the ones who kept promising another bathroom and their kids watched them do everything but.",
              "id": 38,
              "comments": [
                {
                  "score": 113,
                  "content": "How is it suffering? In my part of the world a lot people live in the flats and whole families share one bathroom. Nobody suffers because of that.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 302,
                      "content": "I’m guessing those people also don’t build a gym, remodel multiple rooms and redo their backyard.",
                      "id": 40,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 165,
                      "content": "Few bathrooms have enough storage for 4 people. Where do these ladies put their makeup , hair products, etc? Plus someone has to wait for 3 other  people to shower every day before her turn comes, that sounds like a nightmare. First world problems? Maybe, but it’s also not the 50s where people like my mom grew up sharing a bathroom with a dozen people. It’s 20-freaking-22, let’s not act like indoor plumbing is some hard to come by luxury.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 93,
                      "content": "In your part of the world do parents keep their promises?",
                      "id": 42,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 73,
                      "content": "I won't believe for a second that if given the chance to have a second bathroom that you wouldn't take it.",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 369,
              "content": "Read OP's comments. The kids aren't leaving.",
              "id": 44,
              "comments": [
                {
                  "score": 18,
                  "content": "Then OP super sucks.",
                  "id": 45,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 333,
              "content": "A good chunk of the world also makes do without a home gym and home office and without remodeling their kitchen and also in a good chunk of the world kids don’t move out at 18, so this is a pretty terrible point.",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 233,
              "content": "Not everyone will use a home gym (whether because of lifestyle choice, physical ability/limitations, etc.). On the other hand, bathrooms are a room of the house that everyone could/would use. \n\nAdditionally, if OP wants to sell the house, they’re likely to entice more buyers if they have more than just two bathrooms. According to this [article](https://www.budgetdumpster.com/blog/benefits-of-adding-a-bathroom/#:~:text=Exactly%20how%20much%20value%20does,bath%20increases%20it%20by%2020%25), adding another full bathroom could potentially increase the value of the home by 20% (even an additional half bathroom could potentially increase the value of their home by 10%).\n\nEdit: (1) Fixed a typo. (2) Also, I don’t see adding the gym, home office, and laundry room in the garage first as the main issue. OP stated that now that the laundry room is moved from the main house to the garage, then there is more space for an additional (third) full bath in the main house. \n\nThe issue is if OP and spouse decide to prioritize renovating the two preexisting bathrooms and kitchen and updating the backyard over adding a third bathroom for their daughters. From the post, it seems like the bathrooms and kitchen are functional enough.",
              "id": 47,
              "comments": [
                {
                  "score": 12,
                  "content": "Exactly. And the parents have been promising for a while that they would put in a third bathroom to ease the girls’ lives. Yet here they are with the money to do it and are focusing on other projects first. YTA",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I would never purchase a house without at least 2 bathrooms. It sucks having to wait to use the bathroom when you need to go now.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 159,
              "content": "What happens when all four girls have their period at the same time?\n\nI grew up in a family of seven, with three bathrooms. Sometimes that wasn't enough, and e.g. someone had to puke in a bucket because the toilet wasn't free",
              "id": 50,
              "comments": [
                {
                  "score": 124,
                  "content": "Family of 8 and 2 bathrooms here. It wasn't the worst, but I vividly remember the time the entire family came down with a 24 hour puke bug. Every large pot in the house was in the living room and both bathrooms were always occupied. It was a nightmare.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 15,
                      "content": "That sounds horrifying. I can’t even stand the THOUGHT of someone else puking without puking myself.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Family of 7, 1 1/2 baths. We had the same thing happen once when we were all younger and my dad was on a business trip. That cut it down to 6 ppl, but it was before the half bath was added, and the toilet in the only bathroom was clogged. We were puking into anything not moving and my mom had called a plumber. The poor guy had to come into a house with mom and 5 young kids shouting groceries all over. She was mortified.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "How long do you think it takes to change a tampon, pad, or cup?!",
                  "id": 54,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "Hey seriously doubt anyone but the dad is using the gym LOL",
              "id": 55,
              "comments": [
                {
                  "score": 6,
                  "content": "If him....",
                  "id": 56,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": ">We’ve been saying we’ll convert the laundry room into a bathroom for the twins for a while \n\nbecause they said they would. You do not make a commitment to your children and then back out like this.  It causes trust issues and irrevocably damages the relationship \n\n\"They'll be gone in 2 years!\" \n\nwhat a disgusting and frankly completely out of touch mindset to have. No, the kids won't be gone the second they're 18. the CURRENT 18yo isn't even out of the house. \n\nshame on you and everyone else spewing this garbage",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "3 girls will be gone soon, but those 3 kids can use the gym for years to come? Are parents going to turn the house into a Planet Fitness?\n\nIf I tell my kid I'm going to buy him an ice cream, and then I buy myself 3 ice creams, my wife 10 ice creams, and the neighborhood cat 7 ice creams and then say \"sorry son, I'm out of cash. Sucks to be you bro\" then I'm an AH.\n\nIf OP didn't want to remodel the bathroom, don't promise your kids over and over and then do massive remodeling work on the home without doing the thing you promised.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "You think a bathroom takes two years?",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 455,
          "content": "At least one, maybe two of the girls should get to share the parents bathroom. We’ll see how fast that extra bathroom becomes a necessity then!",
          "id": 60,
          "comments": [
            {
              "score": 39,
              "content": "I was hoping someone already said this!",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Oh, yess! Three ppl per bathroom, absolutely fair, or give thé \"lied to\" daughters a rotating break, (ha, ha) two parents plus two kids, one bathroom, only two girls in the other. But parents must always share with two kids.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "They probably already do in a pinch. That's how it normally works in houses where people share bathrooms.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 385,
          "content": "Not to mention it’s not just the gym, it’s also the office and another laundry room. Then the kitchen, and the backyard… everything else seems to be a lot more important than allowing the girls better access to the facilities. \n\nYTA.",
          "id": 64,
          "comments": [
            {
              "score": 14,
              "content": "If the laundry is getting converted to a bathroom, they needed to build a new laundry first right?",
              "id": 65,
              "comments": [
                {
                  "score": 19,
                  "content": "And if they then had built the second bathroom for their children afterwards, you might have a point. Instead, they built a whole new kitchen, and a chicken coop.",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Apparently you missed the part where they completely renovated multiple other rooms as well before even considering another bathroom. Why are people this dense?",
                  "id": 67,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 285,
          "content": "I grew up sharing a bathroom with three sisters until I was… what, 21? And I’m with you here. Because remodeling the garage included moving the laundry room there, I don’t think they’re the AH for doing gym/laundry/office first. However, being that they’d promised this to their children already and do have the funds, I do think they’re the AH for working on the bathrooms/kitchen/backyard before the new bathroom.",
          "id": 68,
          "comments": [
            {
              "score": 16,
              "content": "> Because remodeling the garage included moving the laundry room there, \n\nThere were laundry hookups in the garage already.   They didn't have to spend a dime on the garage to get started on the bathroom first.",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I'd want some info on the bathroom remodel. If it was pretty shitty before and prone to leaks, blockages or whatever, and the remodel was significantly quicker and cheaper than adding an entire bathroom, then it makes sense to get that one functioning properly first. Otherwise, surely adding the new one first would mean it would be available while the remodelling put the other out of action.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 229,
          "content": "This.  OP said they’d put in a second bathroom, then did EVERYTHING ELSE before getting around to what they’d promised.  YTA OP.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 156,
          "content": "My 4 kids, my husband and myself, shared 1 bathroom. Now there are only 4 of us in the house. We actually had a new rebuild. Knocked the old house down and built a new one. We have 2 bathrooms now.\n4 ppl to share 1 bathroom is not so bad. HOWEVER, I agree with you. They said they would convert the laundry room to a new bathroom. And now even their remodeled bathrooms come first. Heck the backyard comes first. They are totally the AHs here.\n\nGive you kids what you said they would get.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "The fact that people think their personal shitty (no pun intended) bathroom situations are relevant or need to be the standard by which everyone else lives is so ridiculous and self-centered. Just because you dealt with something doesn’t mean anybody else has to.",
          "id": 73,
          "comments": [
            {
              "score": 3,
              "content": "And just to add to your comment, none of those \"I grew up with 10 people and only 1 bathroom\" matter at all with what we're supposed to be judging. The parents promise to add another bathroom for \"a while\", whatever that means. Probably years at this point. The parents came into the means to do so. They instead decided to renovate multiple rooms, and from the sounds of the comments, weren't even necessary. They broke their promise. 100% yta.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "YTA.  You’re forcing two almost adults to bunk together - but your husband needed a gym?  \n\nAnd you’ve been telling them that you’d convert the laundry room to an additonal bathroom “for a while”.  Yet it sounds as if literally every single other project you want done is being done prior to that.  \n\nEven after reading your side of the story only, both you & your husband appear to be a (1) extremely selfish & (2) liars.  I can’t even imagine how much worse you’d both appear if your daughters could tell their side of the story.",
          "id": 75,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Agreed. Ok, now that the laundry room is moved, there’s space for the bathroom but you’re also doing the backyard, and the gym, and the existing bathrooms remodel. When is the 3rd bathroom going in? I can see why your twins are frustrated. They’re 16. They’re not that far from moving out. By the time you get the 3rd bathroom put in, they won’t get any time to enjoy it before they leave home. Or is that your plan? When it comes time to do it, tell them they’re moving out soon, so mommy needs a wrapping paper room or some other ridiculous thing.\n\nOP, YTA. Don’t promise kids things that you’re not going to deliver on.",
          "id": 76,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 13067,
      "content": "YTA. You said the bathroom is “next,” but you also said you’re working on the backyard first. So which is true?\n\nEither way you’re prioritizing projects that only benefit you and your husband, and putting off the project that will benefit four people. Are you trying to postpone it until they’ve all moved out?",
      "id": 77,
      "comments": [
        {
          "score": 3424,
          "content": "Also why redo the bathroom they’re already sharing if they would rather have the second bathroom built first? It was already used as a laundry room, so there is already water access to the room. It seems like it wouldn’t be too much more expensive to add the third bathroom than it would be to redo both bathrooms?",
          "id": 78,
          "comments": [
            {
              "score": 536,
              "content": "Rerouting the plumbing is actually really expensive. Just getting our bathroom fixed is expected to cost more than 30K, not counting rerouting to improve the layout",
              "id": 79,
              "comments": [
                {
                  "score": 509,
                  "content": "Really? We added a bathroom to the second floor and it cost us $7,000.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 241,
                      "content": "I’m sure it depends on location. I would LOVE to have my bath done for $7k on the second floor but it would be $20k where I am.",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "The cost of renovations can vary quite a bit depending on your state/country in the same way as any other product or service can.",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Holy cow, that’s less than my remodel.",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Genuinely would love to know the company haha that is an incredible price.",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": ">Really? We added a bathroom to the second floor and it cost us $7,000.\n\nYa it really depends on the piping . They may have to add extra/different pipes or a tank",
                      "id": 85,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "It also depends on how much of the work you want to do yourself and how much you want to contract out.",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 245,
                  "content": "I mean my dad took a room that already had water access (like this laundry room) and did a whole second bathroom for 2k. Sure he did the work himself but you are being ripped off babe. Even four times what my dad paid isn’t close to what you were overcharged.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 103,
                      "content": "Yeah I just finished remodeling our kids bathroom, rerouting the sink, and taking a wall out for about $3600.",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Not necessarily, for example our laundry room has a water line but no sewage, to route the sewage line to the bathroom is expensive and we are getting quotes of around $25k to get the layout as we want.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Yeeesh, sorry to hear that.",
                  "id": 90,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "But from what OP says, they have it 'on the list' so it seems it's not a matter of affordability, but priority. So whether they are in an area that costs 3k or 30k to do the conversion they have the funding. It's just more important to do the yard apparently. \n\nOP YTA. If you have been putting it off due to the costs, now you have the money the promise to your daughters should be the highest priority. Once the laundry was moved you should have immediately started on the additional bathroom.",
                  "id": 91,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "[deleted]",
                  "id": 92,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "I had every pipe in the walls  and attic of my house replaced for less than 3k. It's not a big house, but a house double It's size wouldn't double the cost.",
                  "id": 93,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "You can remodel an entire kitchen for $30k, no way a bathroom reno would get that high unless you're in a HCOL area or going for ultra-premium finishes",
                  "id": 94,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Somebody is screwing you. It should not cost that much. \n\nAre you in a rich/wealthy part of town? Because it sounds like youre being up-charged because you can already afford it. 30k is outrageous...",
                  "id": 95,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 326,
              "content": "Has anyone else considered the fact that redoing the bathrooms before adding a bathroom means these six people will have to share one bathroom during the two renos?",
              "id": 96,
              "comments": [
                {
                  "score": 141,
                  "content": "Yeah, that's pretty stupid. They should definitely install the new bathroom before redoing either of the existing bathrooms.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I lived in a dorm-thing for a bit and we were 7+ sharing one shower and one toilet (thank fuck at least those two rooms were separated), and all of this in the early mornings and late evenings.  \nI mean I survived... But I was very happy to be able to take a long shower when I was home lol.   \n\n\nEdit: just to be clear I'm in the YTA camp because cmon it's 2022 people should be able to take a long shower in their own home. It's not a boot camp. 🤣",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "That’s why I think OP is full of it and not going to bother until the kids are already moved out, they aren’t taking it into consideration bc it won’t be an issue by the time they get around to it",
                  "id": 99,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Yes, that's bound to cause problems.\n\nI don't want to get into asshole judegment here, but I do want to say to OP if you want your girls to always fight and never become good friends and loving sisters, making 4 teenage girls share a bathroom is the right way to do it. They'll be each other's throats over who's hogging the bathroom.\n\nIf you want to foster good relationships between your daughters, prioritise givng them separate bedrooms and another bathroom. Their lifelong relationship is more important then your backyard, your husband's gym or the kitchen re-model. Your responsibility as a parent is not just to nurture every child, but to nurture the relationships between them.\n\nI was one of four girls. I promise you, you will regret it for the rest of your life if you don't start prioritising their relationships now. My sisters and I don't speak to each other anymore, and our adolescent years of fighting over shared bedrooms and bathrooms started that.",
                  "id": 100,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "Well putting in a new bathroom could involve a lot of plumbing even if the room was originally a laundry room and has basic plumbing already but if I remember right from something my dad who was a contractor at the time (80s) you would have to run a separate pipe to the sewer and then different ones to the shower/tub and the the sink(s) from the one that’s there. And even back then that was thousands alone. But yeah redo a couple bathrooms can be expensive but probably not as expensive as a whole new bathroom.",
              "id": 101,
              "comments": [
                {
                  "score": 6,
                  "content": "Most laundry rooms have an out drain that goes to your sewer system or septic tank so those should be usable. There is an exception if they have a sump pit as you can't drain the laundry into that.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Ok learn something everyday. Like I said it was the 80s I’m sure things are different now.",
                      "id": 103,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 711,
          "content": "It sounds like they have been saying the extra bathroom is \"next\" for a while now and yet it keeps getting bumped down the list so its understandable that their daughters are frustrated by it.\n\nIt makes sense to wait until after you had a new laundry room built, but after that the new bathroom should actually be next. \n\nIf OP and her husband have no intention of doing the third bathroom they should have never told the daughters they would and they should certainly not keep saying it's \"next\" and then doing other projects. That's what makes them assholes.",
          "id": 104,
          "comments": [
            {
              "score": 237,
              "content": "Yeah, not doing a third bathroom at all isn't the asshole move. It's promising to do it (presumably to stop arguments in the moment), and then not following through which is the asshole move.",
              "id": 105,
              "comments": [
                {
                  "score": 89,
                  "content": "No I think it's the fact that they \"came into some money\" and instead of spending on the objectively more sensible renovation they use it on literally everything BUT an extra bathroom",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 394,
          "content": "They choose to bring those 4 people into this world and it's their responsibility to take care of them, and this whole situation just shows how much they prioritize their children. \n\nTo the people saying that they've all survived with one bathroom: that isn't the point. The parents had the money to do the renovations that would've helped make their daughters more comfortable in their own home, but instead they redid the kitchen and existing bathrooms AFTER saying that they would add the bathroom FIRST.  I get that they had to move the laundry to have the space for the bathroom, but then they used the rest of the money for cosmetic renovations instead of more practical ones. \n\nOP: YTA, mostly because you promised your daughters something and it just sounds like you are and will continue to renege on it",
          "id": 107,
          "comments": [
            {
              "score": 95,
              "content": "And I’m sure of the parents also had to share, an extra bathroom would have been done first thing. It’s not an inconvenience to the parents, so they don’t care!",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I actually paused on this because OP said they had twins which might imply they intended to have 3 children not 4.\n\n&#x200B;\n\nNope. They literally had twins and decided 4 years later to get a 4th child which is only even more YTA because that forced the kids to share bedrooms on top of already sharing a bathroom.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Y'all, read my comment again before responding because I said they were TA for telling them that they were going to add the bathroom for them NEXT but then not following through. This isn't about entitlement. This is about the parents not doing what they said they would.  If the additional bathroom was never going to be their top priority, then they should've been straightforward with their kids. \n\nAlso, I DO own a home and have a $4k/mo mortgage so I understand how much work goes into it.  I watched my parents work their way up from the floor and am very well aware of the value of hardwork.  I just spent $15k to add a full bathroom to my basement.  I also have never lived in a house with more than one bathroom until very recently, including a good part of my childhood living in an apartment with 8 people and only 1 bathroom.  My parents were honest and realistic with me and wouldn't tell me that they were going to do something for me if it wasn't something they were actually going to do.  \n\nThe parents had two simple options: 1) tell them they were going to add a bathroom for them and then DO IT, or 2) don't tell them they are going to add a bathroom and then not add one. 🤷🏻‍♀️",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 50,
          "content": "Bingo",
          "id": 111,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "And they’re also prioritizing projects that won’t add all that much value to the house, verses adding an additional bathroom which is a GREAT long term investment.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Gym, then renovate 2 bathrooms, remodel kitchen, backyard and **then** new bathroom. Of course kids feel snubbed. \n\nThis thinking, ladies and gentlemen, arises from the classic children-as-possessions style of parenting. YTA OP.",
          "id": 113,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "OP just be honest, you see your kids living at the house for only a few more years and you’re making upgrades that benefit only you and your husband cause you know that. \n\nDo you at least let the girls use the master bath? Or are you forcing the four of them to share one bathroom for *everything* ?",
          "id": 114,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "And on the note of priorities, OP has just demonstrated to their kids that they don't prioritise them. An added insult to injury",
          "id": 115,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "This is the only reason I agree with YTA. If you told them the bathroom was next, do the bathroom. Not the yard. The gym in the garage with the laundry, I understand. That was to make a new place for the laundry and why work on the garage twice but to say the bathroom is next and then work on the backyard before? Is it that the bathroom was going to cost more and didn't have the funds but wanted the backyard done? To be fair the backyard is meant to be enjoyed by the whole home, but I can't see the logic of starting it and not the new bathroom.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7860,
      "content": "YTA\n\n4 share one bathroom and you and your husband 1?!?\n\nAnd dearest daddy needs his gym 😭😭😭😭/s",
      "id": 117,
      "comments": [
        {
          "score": 1769,
          "content": "I don't get the obsession with needing a 3rd bathroom but surely another bedroom seems an obvious thing to do ahead of everything else. Yta",
          "id": 118,
          "comments": [
            {
              "score": 1113,
              "content": "I grew up in a one bathroom house with four people so similar dynamic to the girls-and it would’ve been incredible to have another bathroom.  My mother and I both have Chrons so there would be times one or both of us would be having a flair and really needing the bathroom which was tough enough, but then there were two other people who needed the bathroom from time to time also.  It was absolute torture sometimes.   I made sure every house/apt I lived in after leaving home had 2 bathrooms until my latest apt-but now it’s only me and hubby (and chrons meds have come along way in 30 years-thank you science!!) so we’re down to just one and things have been good this time around with only one bathroom.",
              "id": 119,
              "comments": [
                {
                  "score": 314,
                  "content": "I feel this one. Grew up family of 6- 5 girls, 1 boy- one bathroom to serve the house. About the size of a pantry. We mastered the art of peeing in sinks, outside, wherever we could, not as easily done for a #2. It would get tense! One of the things in life that brings me the most comfort is having a bathroom for each member of the family. If we all get food poisoning- we have can privacy and time. Knock on wood I don’t want it to actually happen!",
                  "id": 120,
                  "comments": [
                    {
                      "score": 41,
                      "content": "haha same in my house. my brothers would frequently pee outside. We were a family of six with one bathroom. People would sometimes brush their teeth at the kitchen sink. We also has a pretty \"open\" bathroom door policy. Someone in the shower? Someone else would go in to use the sink or to pee. The shower curtain was never sheer. The shower curtain could also function as a curtain that tucked behind the toilet seat when you were \"taking your time\" and someone needed to use the sink. Family had no shame. I'm so glad my house has two bathrooms now.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 106,
                  "content": "The only reason I’ve never pissed or shat my pants in over 15 years is because my families home has at least three toilets. When I went to stay in my aunts one bathroom apartment with three other people I almost cried I thought I would piss my pants a few times.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I share a bathroom with one roommate, and I still almost piss my pants sometimes. I also end up showering late at night a lot.\n\nIt's just that she and I seem to always need it at the same time. We work the same shifts sometimes, so we leave and come home at the same time. Also the issue of showering too, because if you're running the washing machine or dishwasher, it'll be a cold and low pressure one (old house).\n\nI'm an only child, and my house growing up had 3.5 bathrooms, so there was always an extra toilet in case the guest got food poisoning too.",
                      "id": 123,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yeah, our family of five (including a dad and 2 brothers) lived in a one bathroom home. Was just fucking awful.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 205,
              "content": "someones showering, gotta shit. Not the end of the world, but its a stressful situation that can be eliminated if the available resources allow for another facility.... which they do.",
              "id": 125,
              "comments": [
                {
                  "score": 14,
                  "content": "If I was one of those teenagers, I would acquire a camping toilet, and a bucket. I would use that, and make the parents dispose of the contents.",
                  "id": 126,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Four young women in the home forced to share one toilet, and unless OP clarifies/d otherwise that sounds like a nightmare for day to day life since toileting needs can be unpredictable. Throw menstruation into the mix and it can be a really fun time. When it’s that time for me, I have so much pain I vomit. That’s no time for one toilet in the house.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "You’ll get it when you need to start getting ready 1 before you need to because 3 other people are going to shower",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Or just let the girls use the master bathroom since it's bigger 🤷🏻‍♀️",
              "id": 129,
              "comments": [
                {
                  "score": 3,
                  "content": "It might not be, it's common at least where I am for the ensuite to be smaller than the family bathroom. Normally the ensuite is just a small shower room if you have one.",
                  "id": 130,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Nah, a third bathroom is much more needed. Imagine being the fourth in line when you desperately need to take a shower to get out or even worse when you need to take a dump. i don't understand the need for a home office tho",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "As far as the girls are concerned there's functionally only one bathroom because it doesn't sound like they're allowed to use the en suite bathroom attached to the master bedroom",
              "id": 132,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Scrolled for way too long to see this comment. Twins are not one person. So why should they be treated like one? The eldest and the youngest get their own rooms, but sounds like the twins are both being treated like half a person.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Have you ever shared a single bathroom with 4 people???",
              "id": 134,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Yeah, in the Netherlands a 1.5 bathroom setup is pretty much the default for single family houses. And if I had to choose between sharing my bathroom with 3 other people or sharing my bedroom with 1 other person, I'd 100% take a bedroom for myself and share the bathroom.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "He probably won’t even use it anymore by the time February gets here",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6273,
      "content": "YTA for no other reason than you've lead the girls to believe that it would be done when you get the opportunity.  You had/have the chance and doing everything but.",
      "id": 137,
      "comments": [
        {
          "score": 1694,
          "content": "Yeah all of the N-T-A people are missing that OP has been telling her kids \"for a while\" that they will get another bathroom. If OP hadn't set that expectation, then she wouldn't be an AH, but lying to your kids (for literally no reason!) is definitely an AH move. She literally could've said no to the bathroom and then come back and said yes later if they decided they could do it.",
          "id": 138,
          "comments": [
            {
              "score": 406,
              "content": "This is exactly my thinking also. It’s not about how much it will cost or if they really need it or if the kids will be leaving home soon. OP and her husband didn’t communicate with the kids about the plan. And before anyone comes at me saying “it’s their house, they don’t have to tell them anything” yes, that’s true, but then OP shouldn’t be upset when her kids are upset because they’ve essentially been mislead for at least a few years thinking they were going to get a new bathroom.",
              "id": 139,
              "comments": [
                {
                  "score": 164,
                  "content": "Exactly, all four of them have been sharing a bathroom for years with their mother telling them that it was a problem that would soon be fixed.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 107,
                  "content": "Also whether or not they have the right to do something doesn’t matter here. We’re not here for legal advice or permission it’s an asshole subreddit. They’re being assholes. For some reason everyone seems to forget that when it’s minors against their parents. Minors deserve comfort and have needs/wants too.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 15,
                      "content": " Very well said. You’re absolutely right and minors also deserve respect.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": ">OP and her husband didn’t communicate with the kids about the plan.\n\nThey definitely communicated a plan, probably just to stop arguments in the moment.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 151,
          "content": "100%. I'd agree that OP's kids aren't entitled to an extra bathroom (I grew in in a family of 6 kids and we all shared a bathroom; it sucked but we lived with), but OP, you've given your word on something and then repeatedly failed to follow through. It's your lack of commitment to what you told your kids, not the bathroom itself that makes you the AH. Yes, it's your house and you can do things how you want, but your kids are entitled to their hurt/disappointed feelings if you've promised them something and then keep putting it off.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Because we live on a world where adults think it's perfectly acceptable to lie, repeatedly, to their children because \"they're just kids, they'll get over it.\" News flash, folks, lying to your kids over and over is how you get adult children who no longer take you for your word and don't trust a thing that comes out of your mouth.\n\nSource: My mother could tell me snow is white and I'd conclude that she's lying because my entire life she was completely incapable of ever keeping her word, so now I just assume everything she has to tell me is a lie.\n\nOP YTA for making promises you NEVER intended to keep. You obviously told them that to placate them.",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "That’s my thought as well. It’s the lying that pisses me off and would lead to issues. If they don’t want to do it, at least be honest instead of leading the poor kids on.",
          "id": 146,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Also INFO is the toilet inside the bathroom?\nDoes the shower have privacy glass so one can shower and another can brush their teeth?\n\nThere's 2 bathroom houses that have a separate loo with a sink (some call this a half bath), and  with a well organised laundry with mirror doubles as a toothbrush area, so one can poop, one can shower, one can brush teeth, all at the same time. \nI've even seen two bathroom houses with separate toilet plus additional toilet and/or shower in the laundry. \n\nOne house I know of has one toilet in the bathroom, and a separate toilet down the hall. So 3 toilets in a 2 bathroom house.\n\nThen there's literally two bathrooms where only two persons can do any bathroom activity at the same time. \n\n\nThis makes quite a difference, and with 4 daughters I'd be doing everything humanly possible to ensure maximum concurrent bathroom usage.\n\nAt a minimum, if money were tight (which it clearly isnt)  I'd be putting a shower over bath and opaque curtain as well as a shower nearby, with privacy glass so two can shower and one can brush teeth in the same room. \n\nI'd also have a basin in the toilet for hand washing, and make the laundry to have some bathroom function.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This is the right answer",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yep, it’s an issue of expectations over everything else. Had they not led their kids to believe they’d be getting it next, the kids would probably feel differently. It’s never nice to bait and switch. \n\nThe garage laundry & office work might be necessary before doing the bathroom work, but the other projects probably should’ve waited unless something was broken. I understand the gym and backyard work are probably much simpler and cheaper, but it’s still rude to renege on a promise without good reason.\n\nIf they needed to change expectations, they have to explain *why*. And they could’ve also put the kids to work on doing the renovation projects (for the easy but time consuming stuff - ex., painting and replacing small hardware) and they could be a lot cheaper and have faster timelines. Then the kids would also appreciate how much they’ve been asking for with their bathroom project, compared to the ease of stuff like making a home gym.",
          "id": 149,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3122,
      "content": "So, how long have they known where \"on the list\" their project was? \n\nBecause if I were the teenager, if \"at some point,  after 5 other projects\"was not an explicit statement as a part of \"yeah, we'll add a bathroom\", if feel lied to. \n(Probably because, really, it was being lied to.  If nothing else, lie of omission) \n\nYta",
      "id": 150,
      "comments": [
        {
          "score": 768,
          "content": "If the parents stall long enough, they can avoid doing it at all because kids are starting to move out. Once 18 goes to college next year, they can say “well, there’s only 3 of you now, you don’t need another bathroom!”",
          "id": 151,
          "comments": [
            {
              "score": 463,
              "content": "Seems like that’s been the plan. They’re fixing it to be suitable a for empty nesters.",
              "id": 152,
              "comments": [
                {
                  "score": 251,
                  "content": "Lucky for them, if they keep this up, none of their kids will want to visit or stay with them after they turn 18.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 81,
                      "content": "Yikes… I never understand why people want big families and lot of kids if the idea is for them to move out at 18… with no relationship with the kids.\n\nI would rather have one or two… provide for them to the best of my abilities and have a good relationship with them.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Honestly, it's impractical for them to visit after 18. They won't have enough space for all of them, and if they ever try to bring a friend or SO there would be no space for them either. \n\nI refuse to stay at my in-laws because they insisted on keeping the twin sized beds (and old mattresses!) that the kids grew up with. Kids moved out over 20 years ago. They get their feelings hurt every time we visit home, but the one time I tried to sleep on the old beds, my back was jacked up for days. I ended up sleeping on the floor because it was more comfortable. \n\nOP is setting herself up for failure. I am honestly shocked this has never been an issue. What happens if all of the kids come down with a stomach virus or get food poisioning? There should be at least 2.5 baths in that house, but honestly adding in a shower as well is not that difficult.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "So I read through all her comments and they don’t have money for the kids’ college so they are all going to be going to community college and living at home. But they can spend 6 digits on multiple renovations to add luxuries.",
                  "id": 156,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 110,
              "content": "and i can easily foresee all of these kids avoiding coming home as much as possible once they move out…..let us know in a few years if your kids start staying at school for holidays, OP!",
              "id": 157,
              "comments": [
                {
                  "score": 6,
                  "content": "I mean at least for the oldest her room is going to be immediately reallocated so the others can each have their own room. If she wants to come back home it'll either be sharing a room or sleeping on the couch",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Hah! Sucks to be OP then. Gone are the days when kids can leave at 18 and expect not to starve on the streets. They'll probably be stuck in that house long past 18.",
              "id": 159,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2563,
      "content": "There is four of us in our home and we share one bathroom and all have the smallest bedrooms you can even imagine. If I came into some money the first thing I would do is extend to give my children more space and another bathroom. There is no way I'd be adding a gym, a second laundry room and whatever else until I made my children more comfortable. \n\nYTA.",
      "id": 160,
      "comments": [
        {
          "score": 713,
          "content": "THIS. All these NTA folks keep saying that those of us who are criticizing OP must be rich, but it's exactly because we understand how crappy it is to share several to a bathroom that we think it's ridiculous that they chose a gym, kitchen and backyard before a helpful extra bathroom.",
          "id": 161,
          "comments": [
            {
              "score": 280,
              "content": "Yeah I just saw a reply that said \"all you YTA must be so spoilt\".  Couldn't be further from the truth. We bought the only house we could afford and we love it but our entire upstairs could fit in OPs garage by the sound of it! I would do anything to give my children more space.",
              "id": 162,
              "comments": [
                {
                  "score": 130,
                  "content": "So ironic that 'we're' spoiled for thinking they could add a much more useful room ahead of 5 other distinctly luxury projects, lol.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Yea as a woman I had to share a bathroom with my 2 brothers growing up and the logistics of getting ready in the morning on school days was sometimes a nightmare. I was always in my parents bathroom showering or brushing my teeth because my brothers would be in the bathroom when I needed to be in there. At least I had my own bedroom while the boys had to share (though their room was rather large and mine was quite small). I’d be so resentful to my parents if I had been told that I’d get my own bathroom when we can, and then when they could they went and did all these other things first. And also why work on the backyard in November almost December? I live in California and I still would rather wait to do my yard until the spring.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I think the argument that another bathroom is too expensive becomes irrelevant when OP can apparently afford 50K-100K in renovations, none of which are even remotely as important for the quality of their living conditions as another bedroom or bathroom. But wait, that would only improve their ***children's*** lives so I guess it's not as important as a new laundry room",
              "id": 165,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 191,
          "content": "Jeeze two of us share 1 full bath and one powder room. That 1/2 bathroom is a life saver some days. Six people for 2 bathrooms?  Just because you can doesn’t mean you should.",
          "id": 166,
          "comments": [
            {
              "score": 14,
              "content": "To add to this- my family is a family of six within a similar age range and similarly sized home, and if we didn't have 3 full bathrooms all hell would break loose. My parents also pulled the \"we'll redo the falling-apart bathroom soon\" turned into \"we'll do it after xyz\" super frustrating as a teenager who basically lived in the bathroom lol",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 68,
          "content": "I mean, it sounds like the gym/laundry room combo is what would allow them to make a new bathroom (well, at least the laundry side and I can see the argument to just redo that whole area vs half doing now and half later). But I still would have expected the bathroom to be next on the list. I could maybe see the kitchen depending on what they did (how functional was it beforehand) but to prioritize the backyard looking nice over a 2nd bathroom?!",
          "id": 168,
          "comments": [
            {
              "score": 17,
              "content": "> I can see the argument to just redo that whole area vs half doing now and half later\n\nThey didn't need to redo anything in the garage to get started on the bathroom, there were old hookups in the garage already.   In other words, they could have moved the machines at no cost and started with the new bathroom right away.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Exactly 💯. They seem to be doing projects that directly benefit them. They don't care about their kids' needs. They must've been really selfish parents growing up.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yes so much yes have you tried seeing your children as humans who should have at least a little bit comparable quality of life as you. If not enjoy your time in the lowest cost nursing home 😬",
          "id": 171,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1999,
      "content": "YTA. \"we told our kids we'd add a bathroom when we could, and then we spent tens of thousands of dollars on the yard, a gym, an office and remodeling the existing bathrooms. Am I the asshole?\"\n\nNow OP, read that back and think for a minute. You didn't have to lie to your kids. Lots of families struggle with bathrooms. But you lied about it and then acted wildly selfishly.",
      "id": 172,
      "comments": [
        {
          "score": 423,
          "content": "don’t forget the kitchen 👀 OP + husband are ridiculous.",
          "id": 173,
          "comments": [
            {
              "score": 16,
              "content": "Also kitchen remodels are hekking expensive and rarely necessary unless the shit is literally falling apart or you are adding functionality (and then it's even more expensive).  \n200 bucks of supplies and a weekend will remodel that kitchen just fine. Lots of us live with outdated kitchens and we survive just fine! I don't even have a dishwasher! (Semi /s because it's the same argument against a 3rd bathroom)",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 257,
          "content": "Yeah, the problem isn't necessarily that they aren't getting a third bathroom, the problem is that OP promised them a third bathroom and then when they have the means to make one they instead do everything else. OP set the expectation, didn't deliver and now doesn't like being called out for lying.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Right? \n\nMoving the laundry stuff into the garage was necessary to free up bathroom space. Okay. TELL THEM THAT. And start on the bathroom IMMEDIATELY after you've moved the laundry stuff, not faffed around with a gym and an office and a deck and a firepit and a chicken coop (you can't even handle your children's poop, you are not ready for the amount of poop chickens make) and redoing the kitchen and bathroom you've already got, good lord.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1433,
      "content": "“We’ve been saying we’ll convert the laundry room into a bathroom for a while.”\n\nI N F O: how long is ‘a while’ and how transparent were you with your plans while you undertook work on SEVEN different rooms/spaces instead of the promised bathroom?\n\n“They don’t understand that now the laundry is done we have the space for the bathroom.” Why do they not understand this? Did you not tell them? And how do all the other renovations help?\n\nYTA",
      "id": 177,
      "comments": [
        {
          "score": 511,
          "content": "I think they do understand that converting the garage into a laundry room makes the former laundry room possible to convert into a new bathroom. My main issue would be choosing to renovate all the other spaces before adding the new bathroom. OP is making it seem like all these changes are necessary and that the new bathroom is “next on the list” but is squeezing all this other stuff in.",
          "id": 178,
          "comments": [
            {
              "score": 193,
              "content": "Yep, totally. Seven rooms/spaces. They’ve created or renovated seven spaces before getting to it.",
              "id": 179,
              "comments": [
                {
                  "score": 21,
                  "content": "Laundry in the garage seems like an easy first reno project. Get the outlets in order, maybe build a table and some cubbies. Boom, former laundry soon to be bathroom is open for the next project!",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "> I think they do understand that converting the garage into a laundry room makes the former laundry room possible to convert into a new bathroom.\n\nNO, even that was unnecessary.   The OP says that there were existing laundry hookups in the garage.  So they could have moved the machines and started with the extra bathroom before everything else.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Also, choosing to prioritise a luxury for one person like a home gym over a bathroom renovation that will benefit 2/3 of the current residents of the house",
              "id": 182,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "THIS - looks like the girls have been strung along for awhile. They know you're calling wolf and don't believe you. ESPECIALLY given the fact that you're renovating the existing bathrooms before you build a new one. YTA.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 882,
      "content": "you did a gym, a new laundry room AND an office, not to mention renovate both existing bathrooms, remodel the kitchen, and do work on the backyard before doing either another bedroom so twins can have their own rooms and/or another bathroom?? YTA majorly and need to sort out your priorities better.",
      "id": 184,
      "comments": [
        {
          "score": 195,
          "content": ">you did a gym, a new laundry room AND an office, not to mention renovate both existing bathrooms, \n\nI would've thought that once the new laundry room was built, you'd then build the new bathroom in the old laundry room, because you don't need two laundry rooms, and then once you've got the extra bathroom done, you'd renovate the existing bathrooms one at a time so that while that work is being done, you'd still always have two bathrooms in the house, until it's finished and you finally have three. \n\nIt's either really selfish or really stupid to do things in the order they have done them.",
          "id": 185,
          "comments": [
            {
              "score": 41,
              "content": "[deleted]",
              "id": 186,
              "comments": [
                {
                  "score": 18,
                  "content": "Well yeah, but that at least would have required a *little* sacrifice - Moving the laundry into the garage, rather than a finished laundry. \n\nThe situation I described literally requires no interruption of availability of anything until they eventually end up with an extra bathroom. There's no reason not to do it that way, other than pure selfishness/narcissism.",
                  "id": 187,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Moving the laundry into an unfinished space would have been *temporary* with no actual interruption of function.   It \nwould have been a matter or weeks, or a couple of months then they could have gone back to redo the entire garage.  Apparently though, dad was hot to get his gym...and his upgraded bathroom, his chicken coop, an fire pit.\n\n>There's no reason not to do it that way, other than pure selfishness/narcissism.\n\nAbsolutely.",
                      "id": 188,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 762,
      "content": "You need to do the bathroom before the kitchen and lawn.  4 teenagers to one bathroom?  How do you get them all to school on time?",
      "id": 189,
      "comments": [
        {
          "score": 581,
          "content": "This woman and her husband really invested in a fire pit, garden, and CHICKEN COOP before making their girls’ lives better in a very reasonable way that they’ve been begging them for. I’m in awe",
          "id": 190,
          "comments": [
            {
              "score": 230,
              "content": "Not even that the girls have been begging for, mom and dad have been *promising* but “just haven’t gotten around to it”",
              "id": 191,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 84,
              "content": "But you don't understand! The chickens need space of their own, otherwise they have to fight just to have psychological self-worth as well as severely damaging their relationships with each other.\n\nOh, did I say chickens? I meant children.",
              "id": 192,
              "comments": [
                {
                  "score": 3,
                  "content": "You had me until the very end... bravo!",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "I grew up in a 4 bed one bath with 6 siblings. We had to stagger showers and stuff, and just get up earlier. If you need to be on the bus at 6:30, wake up at 6 and then the bathroom is taken up, it was your fault if you were late since you weren't up early enough. My parents also had to be at work for 7, so they had priority for the \"later\" times for the bathroom. It was on us to get up earlier to get ready, and we wouldn't take morning showers, we'd stagger them at night mostly. Granted only 4 of us were ever teenagers and home at a time, the little ones had later school so it wasn't as bad.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}