{
  "post content": "My sister is a serious prick. Throughout our life she basically bullied me and our parents always took her side. She’s stolen many things from me. (phones, laptops, clothes, books,etc) last year my husband and I got pregnant with our first. We had been trying for years and were really excited when we found out. The pregnancy went smoothly until about 7 months in when u went into an early labor. The baby was kept in the hospital and they did what they could but she ended up dying about 4 days after her birth. My sister told me “that’s what I get for always bullying her” which really crushed me. I shouted at her and stopped talking to her for about 3 months but our family ended up forcing us back together. Fast forward to about 5-6 months ago and I just had a miscarriage and was told my husband and I would probably not be able to have a kid. I was crushed. It had always been my dream to be able to hold a baby and call him or her mine. My sister has been repeatedly telling me I deserve this for not being Christian, she says I deserve it for liking women (I don’t) she says I deserve it for bullying her our entire lives which is just a lie. She’s been making me feel like complete shit about everything that’s happened. My sister announced her pregnancy 9 months ago. She gave birth way too late and the baby ended up dying. She came to me in tears and started screaming at me for cursing her child with my ‘homosexual agenda’ (?) I told her to calm down and offered her some tea and cake since I always have some in my house. She told me to go and suck the horse I consider a husband and I just kinda snapped. I started shouting at her that she had no right to come into my home and start insulting me and my husband. She tried to say something but I cut her off and told her that I was really happy her baby was dead because she would have been a shitty mother. I then kicked her out and told her she can go get fucked by the horse she considered a baby daddy. We haven’t spoken since but she told everyone else and made several posts about it. My family and her social media followers have been blowing my phone up calling me a really shitty person and telling me that I needed to apologize. It felt like she deserved to hear it at first but it’s been a few hours now and I’m really regretting what I said. My husband said she had it coming but my friends are split so I just wanna know.\n\nAita for telling my sister I was happy her baby died?\n\nEDIT: Okay I’ll except my judgement. I’ll apologize and cut contact with them. Thanks for replying to my post everyone :)",
  "id": 1,
  "comments": [
    {
      "score": 46,
      "content": "ESH.  Except maybe these horse husbands.  I’d like to hear more about them.",
      "id": 2,
      "comments": [
        {
          "score": 4,
          "content": "😆😆",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 23,
      "content": "ESH. There isn't a single person right in this situation. She started off wrong, REALLY wrong, but then you met her at that level.",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 22,
      "content": "ESH. Please go no contact and get some therapy. \n\nAlso there are a suspicious number of dead babies in this story.",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 19,
      "content": "EDIT: Changing to YTA after clocking your name ( [u/AnObviousTroll69](https://www.reddit.com/user/AnObviousTroll69/))\n\nThe biggest ever E-S-H.\n\nChildren died and you're both busy being horrible to eachother.\n\nYou both need to never see each other again.",
      "id": 6,
      "comments": [
        {
          "score": 1,
          "content": "And you both need to get help, I am so sorry you have gone through so much in your life, and the loss of multiple children/pregnancies.\n\nYes your sister was/is completely out of line, and I can understand you lashing out at her for what she said, but you went very low with your response.  \n\nTo those that have attacked you, do they know how much your sister has abused you over the years, the struggles and loses you have been through?   If your want to respond maybe talk about how you have struggled for years, how you lost your child, and that your sister's respond was to yell at you and blame you.\n\nHow she had no compassion and that when you tried to support her in her time of despair she attacked you and blamed you in your own home.\n\nIf they don't get in then cut contact as they will never support you",
          "id": 7,
          "comments": [
            {
              "score": -4,
              "content": "They know they take her side because she’s more of a teachers pet then I was",
              "id": 8,
              "comments": [
                {
                  "score": -1,
                  "content": "Then I am so sorry your are surrounded by arseholes.\n\nDespite my verdict, I don't think your were out of line and I would surely have done the same.\n\nAll the very best.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "ESH. I can’t even explain how cruel you both are. You maybe more so, because you KNEW how bad it hurts and you still did it.",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "ESH. What is wrong with both of you?",
      "id": 11,
      "comments": [
        {
          "score": 3,
          "content": "Seriously",
          "id": 12,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "Huge ESH.",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "ESH. Y'all need help. Or just cut each other out and deal with your own issues.",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "ESH. Sounds like everyone is toxic. What you and your sister said to each other is something that is so hurtful and mean that only horrible toxic AHs would say that. Everyone sucks in this situation to high degrees. EDIT. After seeing your SN your an AH for being a troll",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "ESH. You both need to be out of each other’s lives.",
      "id": 16,
      "comments": [],
      "relation": "No"
    }
  ]
}