{
  "post content": "\n\nMy wife and I had our babyboy 5 weeks ago. Everythibg's going fine, no health problems or complications whatsoever. However, my wife is often exhausted so I let my mom come over to help out with cleaning and stuff (I can barely have time to work) and also, at the same time, Spend time with the baby and bond with him a little bit.\n\n\nThing is my wife acts strange whenever she sees my mom with our son. She'd make a face and talk to her in a descending tone, even raises her voice at her causing mom to feel hurt. I asked my wife about it and she said it was because of what my mom is doing. I asked her to elaporate and she complained about mom holding the baby for long and taking forever to give him back to her. mom argued that my wife could ask nicely instead of outright yelling but my wife defended herself saying that she only starts raising her voice after she's already asked a couple of times and mom won't listen. They started arguing and mom started crying. that's when I felt enraged,  pulled my wife aside and told her to stop acting out and that if she keeps this up then we won't get anymore help from mom. She argued that she was trying to feed our son and that it was awful of me to think of it as \"acting out\". I said I understood her frustration and yes mom can do things that require some patience from us. but a little kindness can go a long way in keeping the peace in this difficult time. She called me selfish and said that it's easy for me to say when I'm not the one \"dealing with this\". from there the argument escalated despite me trying to cut it short. I went outside to calm down and after that my wife started cold shouldering me. I told her this was not okay but she told me to go sc*ew myself and that from now on out I should deal with taking our son back from my mom when it's time for feeding since I \"condone\" this behabior.\n\nI really am not condoning anything and really think she's stressed out yes but the way she behaves around mom is, in my opinion, not okay.\n\n\nETM:: My goodness! I'm seeing so much anger here. I'm sorry I can not respond to you all but I just want people to calm down and understand that I in no way  agree with some of my mom's behaviors, just how my wife reacts is......not okay and that's all. really. thank you very much though! Ok. have a nice day.",
  "id": 1,
  "comments": [
    {
      "score": 38454,
      "content": "YTA, and your edit only solidifies it. *\"I in no way agree with some of my mom's behaviors, just how my wife reacts is......not okay.\"* So you think your wife should sit there with a dumb smile on her face while your mother keeps him from her and refuses to let her grandson be fed in a timely manner? Puh-leeeeeeeeeeze.\n\nIt's pretty clear you're letting your mother run roughshod over your wife, and you're doubling down by saying she should manage her reaction. You need to get control of your mother, apologize to your wife profusely, and start directly helping out with your son and household. Yesterday.\n\nETA: Verdict.\n\nINFO: What is your mother actually doing to help out you and your wife, in regards to cleaning and household management?\n\nIf by \"helping\" you mean holding the baby while your wife takes care of all the household drudgery...that isn't helping.",
      "id": 2,
      "comments": [
        {
          "score": 13634,
          "content": "Exactly. The grandmother is not helping at all. She’s just having fun with the baby like a selfish asshole",
          "id": 3,
          "comments": [
            {
              "score": 5924,
              "content": "I bet grandmother says a lot of...\"All I said was, blah, blah, blah...\" or \"All I did was..... and she just hurt my feelings\" or \"I was only trying to help, I don't know what I did that was so wrong......\"",
              "id": 4,
              "comments": [
                {
                  "score": 1811,
                  "content": "People can really be manipulated and it sounds exactly like this and how OP is feeding into the BS\n\nI wish he could understand that having a newborn is extremely stressful and the last thing you want to feal with is someone making issues which sounds exactly like what MIL is doing",
                  "id": 5,
                  "comments": [
                    {
                      "score": 504,
                      "content": "[removed]",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 121,
                      "content": "Especially if she's a first time mom! It takes time to find your way and the last thing you need is a toxic MIL interfering. \n\nOP, send mom home. Tell her it would be helpful if she cooked some things and dropped them off. Give her some laundry to do at home and return (unless you think she'd \"accidentally\" ruin things). Have her grocery shop. There are SO MANY things your mom can do if she wants to be helpful. But I don't think she wants to be helpful. She just wants to hold her grandbaby and antagonize your wife. YTA.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "Don't forget all the \"When *I* was just home from the hospital I was doing blah blah blah\", and \"When *my* babies were this age they were sleeping through the night / nursing once every 6 hours / smiling / potty trained / ...\" (i.e. blatant lies intended to make Mom feel worse about herself).",
                  "id": 8,
                  "comments": [
                    {
                      "score": 25,
                      "content": "My MIL told me....many years ago....that HER SON (my hubby) was walking at 5 months and potty trained at 6 months. I knew it was a lie so I just looked at her and said...Really? She wanted me to argue with her but it wasn't worth the effort when I already knew it wasn't true.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "Jesus Christ I just cringed out of my /isoul/i! That sound exactly like my grandmother",
                  "id": 10,
                  "comments": [
                    {
                      "score": 49,
                      "content": "I've now realised this is exactly what my mum always says. She can never seem to admit anything is her fault, it's always someone else's reaction that is the problem. Mind blown.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 41,
                  "content": "Passive aggressive.    I know someone like that.  They want you do it their way.  When you get irritated with them, they say, I am just trying to help.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2258,
              "content": "This doesn’t surprise me since she’s the one who raised a massive asshole for a son. OP, you need to start respecting your wife. Period. YTA",
              "id": 13,
              "comments": [
                {
                  "score": 64,
                  "content": "Not just respecting, but also protecting. He needs to protect his wife from his AH mother.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1702,
              "content": "[removed]",
              "id": 15,
              "comments": [
                {
                  "score": 321,
                  "content": "It reminds me of dealing with my toddler- he ignores my calm requests and then flips out when I lose my patience. MIL is a giant AH toddler.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 146,
                  "content": "My mother in law did this once and I almost had a panic attack. Op is such an AH. I feel really sorry for his wife.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 47,
                      "content": "I hear it’s really normal (and evolutionarily necessary) for mother’s to be attached to their newborns, & feeling the need to hold them & not let others have them. It’s how so many humans are alive, because momma bear makes sure of it",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 66,
                  "content": "Especially a newborn. I would have lost my shit if someone didn't give my babies back right away after asking. The feelings were so raw and visceral that soon after birth.",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 35,
                  "content": "after the first time, im no longer asking.",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 27,
                  "content": "Wife should keep the baby and give the grown ass baby (OP) back to HIS mother. Problem solved.\n\nYTA, OP. Defend your wife. She (and the baby) should be your first priority now. Not your mommy's feelings.",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "OP sounds like every r/JUSTNOMIL husband",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 75,
              "content": "Yes new moms have serious protection hormones, I barely let anyone hold my baby for more than a couple minutes.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "In addition, the grandmother is interfering with feeding time, which many women still struggle with at 5 weeks.",
              "id": 24,
              "comments": [
                {
                  "score": 26,
                  "content": "Why is OP sending his mom in rather than parenting his own kid? He should be doing feeds himself.",
                  "id": 25,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "Yup! She doesn’t *need* to bond with the baby! His mom does and protip OP that’s not the same as *your* mom! \n\nAlso fucking typical that he expects the bigger person, the one to be reasonable to be the one that has been growing a whole ass human and gave birth to that whole ass human only five weeks ago is not going through all that comes with that. Who should be the bigger person, the forgiver, OPs entitled rude mother or the actual postpartum mother of the baby? I see a lot of resentment growing in OPs wife’s future unless he gets his crap together. This is the kind of behaviour that eventually kill all love and care, OP.",
              "id": 26,
              "comments": [
                {
                  "score": 27,
                  "content": "Exactly what I thought, why TF is the hormonal new mother supposed to be “patient” over the moody mother in law? MIL should understand & be patient with her!",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Like mother like son",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Which is fine if she is respectful about it. When my mom came I mostly had her hold the baby. She’s older so she really can’t be running around and I don’t kind people to clean house for me anyways since I’m the one who knows where everything goes. And my mother has never been one too cook, all she eats is Asian soups lol\n\nBut It was so helpful because I could finally get some stuff done around the house and she enjoyed being able to relax and spend time with him. He wasn’t crying because he was being held. Everyone wins.\n\nBut she always gave him back soooo",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5191,
          "content": "yes yes yes. After i had babies, my mom came and helped. But her explicit words were \"I'm here to take care of my baby, so that she can take care of her baby.\"   \nShe still got lots of baby snuggles, but as soon as that baby needed to feed, or as soon as the timer on the oven dinged or whatever, that baby came back to me.",
          "id": 30,
          "comments": [
            {
              "score": 2468,
              "content": "Your mom sounds amazing. Is she interested in adopting a 39 year-old woman? I come with two fabulous grandkids for her and they’re both out of diapers.",
              "id": 31,
              "comments": [
                {
                  "score": 1589,
                  "content": "This could be a trick.  Do you mean out of diapers as in potty-trained, or out of diapers as in you ran out of diapers and now they are peeing and pooping all over themselves.  There is a fairly substantial difference.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 605,
                      "content": "I was vague for a different reason, but I like the way you think! I meant “out of diapers” as in “I have two teenage daughters.” As someone who was once a teenager and now has two teenage daughters, I’m all too aware of how this isn’t an appealing trait for everyone.",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "My mom did this too! She was at the hospital the whole time but didn't even hold the baby until the second day because she was busy helping me after my C-Section. \nThat's exactly what I needed, not my MIL who eats my food and holds the baby when he's calm.",
              "id": 34,
              "comments": [
                {
                  "score": 42,
                  "content": "My dad's parents were not particularly helpful after my parents had their first kid. Grandma and Grandpa came over the day mom and dad got home from the hospital with their new baby...and expected my mom to make dinner for everyone. She thought they just were out of touch with what it's like to have a baby around. But she never forgot how she felt that day and made sure we never felt like that.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Sadly, not the first time I've heard this. Etiquette is to bring food for the new parents and for good reason!",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3830,
          "content": "OP: \"If you keep this up Mom won't come to help anymore.\"\n\nOP's wife: \"Ooh, don't threaten me with a good time!\"\n\nSeriously, what kind of threat is that. Cracked me up.\n\nYTA because your mom is not helping, she's stressing out your wife.",
          "id": 37,
          "comments": [
            {
              "score": 351,
              "content": "This killed me! I'm imagining a Shania Twain \"Let's go, girls!\" playing in the wife's head before she did something to make dang sure he kept his word.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1530,
          "content": "Grandma is getting her baby fix and making a tired, stressed, hormonal mother out to be the bad guy and dad is helping frame it that way. \n\nOP, You don't get to tell your wife to be nice and ignore your mother's bad behavior! You're not the one dealing with any of this since you are just too busy, so maybe consider seeing it from your wife's PoV. In other words, OP is definitely TAH.",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 391,
          "content": "The only way grandma gets to call holding the baby \"helping\" is if she's doing it so that new mom can get more than 2 consecutive hours of sleep. Cause I'm willing to go out on a limb and say that OP is 'too busy' or whatever to take turns with night care.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 344,
          "content": "OP seems more concerned with his mother bonding with the baby than his own wife.  Mother is not helping at all, she is making sure the baby is \"ok\" while his wife that bore the baby hands it over so she could \"get back to chores\".  Is OP's wife a surrogate for his mom?  That's what this comes across as.",
          "id": 41,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 239,
          "content": "It reminds me of how men will just wear on women and wear on them until the woman is shouting and feels so trapped in a corner that there's literally no option other than to lash out. Then the cameras come out and it's all about how she should handle it better. The mother is literally just doing that and the fucking OP is aiding in it.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "Dude. I saw that edit and thought that’s worse! Good grief. You’re so right. His wife is the mother of the child and if it’s time to feed the baby his mom needs to give him back. He should be talking to his mother about *her* behavior, not his wife.",
          "id": 43,
          "comments": [
            {
              "score": 44,
              "content": "He STILL thinks his wife’s an AH! Even after acknowledging how badly his moms behaving. He’s literally forcing his wife’s hand— how should she handle a situation where two people gang up on her and gaslight her into accepting bad treatment?",
              "id": 44,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "Why do people even come to AITA if they’re only going to go, “Ah, I see that THOUSANDS of you have voted Y T A, but none of you understand, everything’s fine and I totally handled it well!” Um… then why are you here if you never thought you could be wrong? Because the general consensus of thousands of people is… Y T A",
          "id": 45,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 54,
          "content": "The edit made it SO MUCH WORSE. So you agree your mom is not helping? You agree your mom is not being fair to your wife? And then you scream at your wife for refusing to let MIL walk all over her?\n\nBack your wife up. Send your MIL home.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 20569,
      "content": "YTA. Also if your mom is holding the baby that’s not helping. She’s helping if she’s doing dishes or making a meal so your wife can rest with the baby.",
      "id": 47,
      "comments": [
        {
          "score": 6231,
          "content": "This. All day long. If your mum is genuinely there to help she should be too busy to be snuggling the newborn for extended periods",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4806,
          "content": "It sounds like mom is not only doing the opposite of helping, she's preventing baby from eating while she does the opposite of helping. It seems like OP's wife is breastfeeding from the post, and OP's mom is literally doing the worst thing ever to a new mom trying to build up a supply. Baby is just hitting/about to hit a major growth spurt, the milk supply needs to be kept up.\n\nActually, writing that out, it seems like OP's mom is sabotaging breastfeeding on purpose, because she wants to be able to feed thr baby.",
          "id": 49,
          "comments": [
            {
              "score": 2297,
              "content": "YEP. Second this. Nothing, nobody, no one should come between a new breastfeeding mom and her baby. She needs the snuggles, she needs the physical bonding and connection, she needs the frequent feedings without delay. This ALL affects her milk production. \n\nThe job of ANYONE who is not the mom, right now, is to make her life as easy as possible. Sure, hold the baby when she needs to do something else, for her own sake. Hold the baby to let her nap. Hold the baby to let her take a shower. It’s fine to ask to hold the baby for a bit here and there, but nobody should be taking it from her for any longer than she is comfortable with. Nobody.",
              "id": 50,
              "comments": [
                {
                  "score": 980,
                  "content": "Tbh, even if the mum isn't breastfeeding, she's trying to bond with HER OWN BABY still. Your wife has just shoved an entire human out of her hoo-haa, and that pretty much gives her a free pass for the next ooh, month to six weeks. \n\nSeriously. Never underestimate how tired, sore, anaemic, sick, and exhausted a new mother is. There is no time for being lovely and tactful when someone crosses you.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 103,
                      "content": "Either it was a watermelon through a hole the size of a lemon, OR she was sliced in half to get baby out! Honestly my recoveries from vaginal birth were not so bad, major surgery sounds way worse. Free pass for sure.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 66,
                      "content": "This right here! I was unable to breastfeed. My MIL and SIL would come over every Sunday just to hold the baby all day long. It was fine because it allowed me some time to do what I wanted and needed to do. We had a situation where my SIL was holding my son and he started getting fussy so my MIL took him to try to settle him down. He got even more fussy so I came to take him. My SIL actually got mad that I took him and said that my son needed to learn to let other people soothe him. That was a big ole NOPE from me. When I took him, he settled almost immediately. I wasn't going to sit there and listen to my child scream while a woman that's not part of his daily care tried to soothe him. I'm a SAHM so I tended to his every need everyday until his sad got home. We were the only ones who could settle him if he was really really fussy as we were the only ones he really ever knew at that point.\n\nEdit: spelling",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": ">Nothing, nobody, no one should come between a new breastfeeding mom and her baby\n\nSeriously, having given birth to babies IT IS INSTINCT TO FEED AND DEFEND THE HUNGRY BABY. Like, \"Keep offspring alive\" is the most fundamental instinct. OF COURSE a mother flips her shit at someone preventing her from feeding a baby.   \nThere's a reason why there's the term \"mama bear.\" Keep a mama bear from her baby? SHE WILL KILL YOU.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "YES YES YES all of this",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1154,
              "content": "On the breastfeeding, I cannot agree with you more.  Stress plays a huge role in supply too, and there is nothing more physically uncomfortable than your body recognizing that your baby is hungry and you can’t get to the baby.  I struggled hard with people hogging my clusterfeeding newborn.  I also had unexpected protective urges that went into hyperdrive when people wouldn’t give me my fucking child. \n\nOP and his mom are huge, gaping AH.  His wife will never ever forget this.",
              "id": 56,
              "comments": [
                {
                  "score": 806,
                  "content": "Yup. It’s already changed the way she feels about him. He better do a complete 180 if he wants to stay married. \n\nYou’re so into your mom, go live with her.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 278,
                  "content": "I doubt it's the intention, but I'm sure OP and mommy would LOVE if his wife's supply suffered, that way the one piece of a newborn's life that exclusively belongs to their mother would be taken from her. It's easier to deny a mother her infant if there's nothing you can't argue you can do as well as she can.\n\nOP, you're not a nice person. That's as much as I can say without running afoul of the rules. YTA YTA YTA",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "I struggled with even letting my wife hold our oldest when she was a newborn. Obviously I let my wife hold her and never said anything about it, but the whole time I was just screaming \"GIVE ME MY BABY BACK RIGHT NOW!!!!!!\" In my head. I did actually accidentally say that to my favourite aunt when I was about a week postpartum. She had been holding baby for all of 2 minutes and instantly handed me my baby back. Then she went out, bought me sushi and a blizzard, did a load of laundry and cleaned my bathroom. \n\n\nPostpartum and breastfeeding hormones are a hell of a ride. I think I would have divorced my wife if she had let her mother behave half as badly as OP's mother is behaving, let alone forgiving her. And I didn't even divorce my wife (MTF) when she for another woman pregnant when I was pregnant with our oldest. Letting his mother run over OP whole 5 weeks postpartum is a huge betrayal of OP's wife and their marriage.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "Not to mention when it's feeding time, if you don't have a baby latched on, your breasts start leaking, so this poor mom is probably just soaking her shirt waiting for grandma to have her fun. \n\nThis is one of those rules that's so obvious I didn't think it had to be spelled out. If a newborn baby's mom says, \"Give me the baby\" you GIVE HER THE BABY.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Nevermind the fact that delays, even short ones, or things that interfere with letdown and active feeding can have serious impacts for a baby that young. Their systems are really fragile and blood sugar, fats, etc are all critically vital at that time and any imbalance can go bad quick. This grandmother could potentially cause health issues by denying her grandson his right to nourishment, proper sleep, and above all else, access to his mother who is literally the only person that child needs or wants at that age. She is comfort, nourishment, safety, home. Mothers and babies are so biologically attuned to each other (yay pheromones) that it causes physical responses in mom when her child needs her and she cannot get to them.\nIt is cruel, selfish, damaging to the mother, and potentially dangerous to the child.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Grandma and husband are both acting like major A-holes.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1444,
          "content": "I would I could upvote this a million times. When I had a newborn I wanted coffee, food, help doing chores & maybe a nap or shower. Not someone to selfishly hog my new baby.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 236,
          "content": "This x1 million. Hogging the baby is SELFISH, NOT HELPING. Helping would be doing the not fun stuff…like changing diapers. Or holding baby while Mom takes a shower. Or making preferred snack for Mom that she can eat with 1 hand while holding baby (sliced apples and cheese was fabulous). Or making dinner so Mom doesnt have to. Or doing dishes and laundry.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "Let's run the play by play here:\n\n* OP's mom comes over to \"help\" around the WIFE'S HOUSE. Is she actually helping, or is she just forcing a bonding experience with the baby?\n* OP's wife sees the baby getting fussy, and decides it's time for a feeding.\n* OP's wife asks OP's mom to hand over baby. Mom says no. Wife asks again. Mom says no. Round and round and round we go.\n* Wife get's upset because mom is ignoring her requests for HER OWN CHILD, and yells at mom.\n* Mom acts upset because she was yelled at, because she was being difficult.\n* OP gets involved. OP openly admits (!!) that *\"yes mom can do things that require some patience from us. but a little kindness can go a long way in keeping the peace in this difficult time\"*\n* OP demands that in THE WIFE'S OWN HOME that she \"give mom tons of patience and respect\", but OP's mom does NOT have to show any respect to wife.\n* OP tries to make wife feel guilty for trying to force a boundary on his mommy, and now is angry.\n* OP pulls the \"I was trying to be calm and collected, but SHE was the one getting all 'crazy'\" card.\n\nDear OP: way to team up AGAINST your partner so you can defend YOUR MOM in YOUR WIFE'S HOUSE, in regards to YOUR WIFE'S CHILD. I guess your mom is more important to you than your wife.",
          "id": 65,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 56,
          "content": "This. I go to help my sisters when they have new babies. I get most of my baby time when the new mom is showering or doing something she wants to do...the rest of the time I'm playing with the other kids, cooking, or cleaning. I can't imagine a mom having to ask twice for her own baby.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Exactly. The child isn’t the burden. You know what you can take off her hands? The housework. Make her a sandwich, damn. Don’t come up in someone’s house after they give birth and expect to play house with their newborn baby while they entertain it. I’d be absolutely next level primal raging.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Exactly. When my daughter was born my MIL stayed down for 3 weeks keeping our toddler busy and cleaning things and only held the baby when it was offered. I asked after a week if a little cleaning could be left for me because I was feeling a little trapped from all the late night breastfeeding and just wanted to do something in my old routine and my husband tried to get her to help me, and she was like 'nope, they asked to clean something alone so I'm letting it happen'. 😅 Like come on how does anyone think just holding the baby the whole time is helping",
          "id": 68,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13239,
      "content": "YTA.\n\nYou're mom sounds like a meddlesome pest.\n\nYour wife shouldn't have to ask more then once for her baby.\n\nPut your mother in her proper place and Stand-up for and support your wife.",
      "id": 69,
      "comments": [
        {
          "score": 5741,
          "content": ">Put your mother in her proper place and Stand-up for and support your wife.\n\n90% sure OP is going to read this *completely correct* advice and decide that *People on reddit just don't understand! She's my mooom!* \n\nOh, my friend, you'll understand too when your wife decides she's done with your mama's boy shit - and from the sound of it, that time is not far off.",
          "id": 70,
          "comments": [
            {
              "score": 3411,
              "content": "OP should be more understanding of the baby's needs, since he's apparently still breastfeeding himself.",
              "id": 71,
              "comments": [
                {
                  "score": 437,
                  "content": "Also, if mom is breastfeeding and hasn’t fed the baby in a while, she is probably in pain!",
                  "id": 72,
                  "comments": [
                    {
                      "score": 33,
                      "content": "And at risk of mastitis.\nGod I'm having phantom engorgement pain just thinking about it",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 87,
                  "content": "Maybe his mother should only be allowed in the house when OP is there - or never - and they only meet her in public. Wife should set the boundary now because there is a really good chance this will get worse until OP is weaned.",
                  "id": 74,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 39,
                  "content": "BEST COMMENT EVER!!!!!",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "I got the mumma’s boy vibe too.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 25,
                      "content": "This whole post screams Mama's Boy",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 62,
              "content": "LOL. Look at his edit. You called it. \n\n\"I'm sensing a lot of hostility here, but you just don't understand.\"\n\nSMH. OP, YTA.",
              "id": 78,
              "comments": [
                {
                  "score": 33,
                  "content": "Also that wording is hilarious. *Sensing a lot of hostility?* \n\na. You are on a subreddit literally entitled Am I The Asshole, what were you expecting? \n\nb. You see thousands of people calling you an asshole and you just SENSE hostility? *Dayum.*",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "Definitely YTA ! \n\nWhen a mom asks for her baby, you give her the baby! It doesn't matter if you're grandma, dad, a stranger, the pope, or the president. You don't stand between a woman and her baby! \n\nYour mom is ignoring her requests for the baby and making her ask until she gets mad. WTH is wrong with your mom?! Is your mom deaf? Does she need a doctor appointment? If so, maybe she shouldn't be holding the baby.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": ">90% sure OP is going to read this completely correct advice and decide that People on reddit just don't understand! She's my mooom!\n\nI'm not saying you're 100% correct, but you ARE 100% correct. OP's edit:\n\n>ETM:: My goodness! I'm seeing so much anger here. I'm sorry I can not respond to you all but I just want people to calm down and understand that I in no way agree with some of my mom's behaviors, just how my wife reacts is......not okay and that's all. really. thank you very much though! Ok. have a nice day.\n\nOP just blatantly said \"my mom can do whatever she wants to my wife, but my wife needs to show respect, ESPECIALLY when my mom is showing her zero respect\"",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 807,
          "content": "Exactly!\n\nWhat is with MILs on here lately making a power play by not giving the baby back to its mother and husbands taking the MILs side? A mother should NEVER have to ask more than once for their child! \n\nOP YTA",
          "id": 82,
          "comments": [
            {
              "score": 67,
              "content": "If I ever decided to have a child, after all this time on Reddit, you bet your ass I’d be having a serious sit-down chat with my spouse about this stuff before even getting pregnant. \n\nGod, imagine how awful it’d be to feel trapped in a situation with a spouse who is ganging up with some other third party to oppose the things you needed to do to care for your own child. No no no no no. Nightmares for years.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "I have such a visceral reaction to the thought of my MIL camped out in my house while I'm newly postpartum refusing to hand me my HUNGRY BABY. like it makes my skin literally crawl. Biology is wild y'all. This poor woman 😭😭\n\nYTA obviously",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "The edit is what sealed it for me—he basically is now telling US to “calm down.” Evidently the only person who DOESN’T have to “calm down” is his mommy. Sometimes I feel we speculate and read too much between the lines, but in this case OP laid it out pretty clearly.\n\nOP, you and your mother are out of line. You owe your wife an apology and really need to reassess how you view your mother, her behavior, and how you accommodate what she does. She is no longer your main priority, nor should her behavior get this kind of pass. Your wife is in charge at home, with the baby. Your mother needs to demonstrate some respect, as do you.",
          "id": 85,
          "comments": [
            {
              "score": 31,
              "content": "It's ridiculous that he doesn't realize that if he just stopped allowing his mother to bring his wife to the breaking point with her ridiculous antics... His wife would stop breaking. It's a novel idea.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "What kind of grandma resists giving a hungry baby to his mother. Gahhhh. \nPlus, this father shd step up his household chore game. Hire a cleaner or order groceries, door dash or sitters but putting your wife thru stress is unacceptable. The bonding period os the most important time for a mother and child. YTA.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12394,
      "content": "YTA\n\nTrying to picture how I'd feel if I gave birth five weeks ago, had to ask multiple times to have access to my own baby, and then my husband told me that I was the problem. \n\nI wouldn't feel good about my marriage, that's for sure. \n\nDid you marry her just to get a grandbaby for your mom?",
      "id": 88,
      "comments": [
        {
          "score": 2264,
          "content": "I would feel like it was time to talk to a divorce attorney tbh. Denying access to a child is a dealbreaker",
          "id": 89,
          "comments": [
            {
              "score": 547,
              "content": "I wish I'd done that. I really do. But new moms are incredibly vulnerable and wind up in straight up survival mode and just trying to keep one foot in front of the other -- it impacts executive function and the ability to plan nevermind envision something different.",
              "id": 90,
              "comments": [
                {
                  "score": 284,
                  "content": "Which just makes it that much more fucked up that she can’t count on ANY support from her partner. Just the opposite in fact, he’s going to berate her for trying to feed her freaking baby when his mother refused to give it back. I certainly don’t judge her if she doesn’t, childbirth sounds like a special type of hell and I can’t imagine how hard it is to do ANYTHING afterward, let alone make a decision that big. I hope she has family nearby who can give her the support she’s clearly lacking from her partner. I’m sorry you went through that as well ❤️",
                  "id": 91,
                  "comments": [
                    {
                      "score": 908,
                      "content": "With my first, my mil came into my hospital room before the epidural had a chance to wear off, snatched my sleeping newborn from his bassinet, woke him up, help him, looked directly at me and said, \"well, this baby doesn't need you anymore. Literally anyone would be a better mother than you. Thank god he has my son and me.\" The charge nurse frogmarched her out of the room and told her I'd she came back she'd call security and the police if she didn't comply with security.\nWith my second, I literally died having my daughter (h1n1 and placental abruption) and when we got home from the hospital, my husband invited his mother over - his mother who spent my entire pregnancy telling me she wouldn't rest until I lost the baby and the stress caused me to lose my daughter's twin and spend a lot of time in hospital on bed rest and blood transfusions because I was bleeding heavily from the miscarriage. \n\nI couldn't stand without blacking out and that woman took my daughter out of my arms and I was literally too weak to protect my daughter. I have never felt so helpless in my entire life. \nMy husband yelled at me for bursting into tears and \"making a scene\" because I was genuinely terrified and unable to protect myself or my fucking daughter. A few days later he forced me to apologize to my mil for my behaviour and hurting her feelings.\nMy husband did the exact same thing as this little boy and, while he did get therapy and is doing the work because he truly sees and is remorseful of his actions, I will never ever forgive him for some of what he did. Ever. I love him, he's now the partner I thought I'd married, and I am very content now, but I wouldn't hesitate to leave him if he ever backslid. I love him, but I love myself and children more.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 47,
              "content": "Actually this is more like denying a hungry baby access to food.",
              "id": 93,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 562,
          "content": "[deleted]",
          "id": 94,
          "comments": [
            {
              "score": 37,
              "content": "Man this why my husband and I didn't let anyone over for the first month (and pediatrician said \"no visitors at all, please blame me, flu season and COVID, no baby visits). I was fucking feral the first month with healing, sleep deprivation and adjusting. And I had a great newborn!",
              "id": 95,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "Same. My MIL showed up with her parents in-tow, 2 hours late, and then expected us to host a formal sit-down dinner, keeping our new baby awake during his usual nap time. Family, man. They suck when a new baby comes around.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 344,
          "content": "at 5 weeks why is she up their ass so much, new parents with a brand new baby?? 5 weeks is still bonding as a new family and crying at the precious little creature you made from scratch. \n\nmil needs to go home.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 119,
          "content": "But he's really busy working! /s\n\nJesus dude, help your wife! Clean the damn house for a change, and stand up to your mother.",
          "id": 98,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 61,
          "content": "My boobs hurt just thinking of this. I'd be cranky asking the first time!",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "> that's when I felt enraged, pulled my wife aside \n\nCan you imagine not just being denied your baby but then to be REMOVED FROM THE ROOM???????\n\nI think that's the kind of rage or hate I'd feel for years to come, it's just such a massive betrayal",
          "id": 100,
          "comments": [
            {
              "score": 27,
              "content": "I don't even have kids and thinking about how this poor woman is being treated just makes me so uncomfortable and angry. He's treating her like she's unbalanced because she wants to hold and feed her five week old baby, probably one of the strongest impulses a person can feel...and one that is good for both of them to fulfill.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9555,
      "content": "YTA \n\n“Yeah my mom can do some things that require some patience from us”\n\nYour logic is backwards dude. Your wife doesn’t have any patience. She had a baby **5 weeks ago**, you may think there’s no complications or health problems but she’s still physically recovering. Her hormones are all over the place and what she needs is for you to have **her** back and support **her**.\n\nThe cluelessness of some fellas.\n\nBe enraged at your mom for making your wife upset, pull your mom aside and talk to her about *her* being the one that’s “acting out”.\n\nHow about you show some empathy and kindness to the woman that grew and birthed your kid.\n\nJFC.",
      "id": 102,
      "comments": [
        {
          "score": 2396,
          "content": "Those manipulative tears from the mom seemed to work wonders on the OP but his wife's frustration and upset did nothing. I can see this marriage ending in divorce soon if he doesn't start prioritising his wife and child. Not only that but he was prepared to put his mother's wants before his child's needs. It's a 5 week old baby, the time it can spend away from its main caregiver (nearly always the mother) is very limited. The baby is not a toy to pass around, the mother is being generous by allowing your mother extended time with the baby at this stage. \n\nIt's not even clear if your wife wanted her MiL there in any capacity, unless they have an exceptionally good relationship most women don't want their MiL there for extended periods at this stage. Your mother's or your wants come secondary to what your wife needs right now which is time to adjust to being a mother and primary caregiver to a very much dependent baby. You need to do everything you can to make sure she isn't stressed about unnecessary things (like cleaning, cooking, their MiL or getting their baby back) and it's well overdue for your mother to go home and you take on the lion's share. YTA.",
          "id": 103,
          "comments": [
            {
              "score": 356,
              "content": "Yes! I find it very telling you that OP says he is the one that invites his mom over. Nothing about whether wife wants mother-in-law to be over.",
              "id": 104,
              "comments": [
                {
                  "score": 66,
                  "content": "Yeah, it is also very telling that the reason why OP wants the wife to stop reacting that way is because, otherwise, his mom won't want to \"help\" anymore.\n\nThat is, it seems like he doesn't really care about wife's or even mom's feelings, he just wants the help.\n\nSo yeah, it feels like OP is the one who wants his mom there, for his convenience. He doesn't want to lose that \"help\", because, if he does, he will have to help with the baby much more. That is why he is trying to pressure wife to stop complaining.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 44,
                      "content": "He doesn’t just want the help, he wants someone there so HE doesn’t have to help. He should be by her side, but he seems to always be away from the room when altercations happen, yet is still at home? MIL should be helping with housework if she came to “help” so the new parents can work together in caring for their child",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "I definitely didn't! I didn't even want my own mom that much. I was topless almost all day with a cluster feeding baby. Anyone who has had milk come in for the first time understands also how sometimes it just feels \"icky\"  because milk is just everywhere, your nipples feel like their being sawed off, you're pretty much just topless all of the time.\n\nAdd to that you have nasty stuff coming out of you for weeks by this point, you're exhausted, probably haven't showered a whole lot......\n\nI didn't have ANYONE over for weeks after my first. It was so hard to transition into motherhood. I was different after my second because I knew what to expect and wasn't so \"embarrassed\" but still would have not wanted my MIL over...and I love me MIL. Just sounds exhausting. I want to feed my baby in peace, nap with my baby in peace etc.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1736,
          "content": "\"No complications\" after a birth just means the *dinner-plate-sized open wound* in your wife's abdomen is healing as expected. It means her hormones are peaking and fluctuating within acceptable ranges. It means her vagina doesn't need any more stitches, that her hips are migrating back to roughly their original location, and that the heat flashes, profuse sweating, and hair loss are totally normal thus and can't be helped. No complications is a medical term, not a lay term for \"yeah she's basically fine\". \n\nYTA\n\nWhen I was postpartum I swore and cried and raged in front of my MIL and mom for random stuff and no one said a darn thing except to pet me and bring me food and fluids. Because that's what you do for people healing from a massively traumatic \"uncomplicated\" event.",
          "id": 108,
          "comments": [
            {
              "score": 554,
              "content": "You’re touching on one of my faaaaavourite parts of childbirth recovery: the relaxin.\n\nRelaxin is the hormone that lets our ligaments loosen to accommodate a uterus growing from the size of an avocado to the size of a decent pumpkin & to accommodate our vaginas and pelvises (pelvi? pelves? lol) loosening enough to squish a baby head through. Relaxin starts right away in a pregnancy, because the uterus needs to grow right away, and reaches a peak level in time for the main event. Relaxin is the reason pregnant people aren’t supposed to do heavy lifting - too easy to dislocate something.\n\nBut! Relaxin does not leave the body immediately! It stays in the parent’s body for up to a year!\n\nI have heard horror stories of parents going back to exercise too early to drop the baby weight, and permanently fucking up their joints. The ligaments that hold our bones in place aren’t ready for a normal load. Personally I’m nearly a year postpartum and I still have pregnancy posture (though this is aggravated by many things, primarily not finding time for my preferred exercise). Tried doing a minor ab exercise the other day and I was physically incapable, even though I did it fine pre-pregnancy. It sucks.\n\nSo on top of everything else (dinner plate sized wound!!!) her bones don’t wanna stay together yet 🙃 give the woman her damn baby already",
              "id": 109,
              "comments": [
                {
                  "score": 56,
                  "content": "Popped my knee out of place real good by standing up from the couch about 8 weeks post partum. Thank god I didn’t tear anything since I had a newborn and no time off left cause of all my Merican freedom.  Newborn when on crutches is no fun tho.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "i've chosen to be childfree so there's a lot about that entire process i haven't learned about, and everything i learn makes me more and more amazed by people who do have and raise kids. (+ more and more horrified by people being unsympathetic about it! it's common sense for OP to treat his wife gently right now but someone with a newborn should know that better than i do!)",
                  "id": 111,
                  "comments": [
                    {
                      "score": 27,
                      "content": "During pregnancy with my second child, most days I could be found moaning “I can’t believe I like babies enough to do this again”. It’s a bit mind blowing that the drive to reproduce (and the desire for more tiny baby snuggles) overcomes all memory of some truly horrific times. I gave myself 4+ shots a day for months! (Early gestational diabetes, insulin dependent, both babies.) But instead of “ugh that was so many needles”, what I remember is “my 2 year old was so sweet helping me with my ‘pokes’, aren’t kids grand” 😂",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": ">\"No complications\" after a birth just means the dinner-plate-sized open wound in your wife's abdomen is healing as expected. It means her hormones are peaking and fluctuating within acceptable ranges. It means her vagina doesn't need any more stitches, that her hips are migrating back to roughly their original location, and that the heat flashes, profuse sweating, and hair loss are totally normal thus and can't be helped. No complications is a medical term, not a lay term for \"yeah she's basically fine\". \n\nShut down the church, synagogue, temple, tabernacle - cause you just preached a whole sermon here!! People who haven't given birth just are clueless and I will say that to my dying day!! Folks that can barely take a day of being sick look at a year of pregnancy and postpartum pains and discomforts as if it is no big deal.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 379,
          "content": "<She had a baby 5 weeks ago\n\nEven with a no complication birth, in the US she'd still be on short term disability. 5 weeks is not a lot of time, especially if she is also nursing and up a lot with the baby.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "Wife shouldn't have to explain or defend herself. Grandma and her husband are way out of line.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "And then he's all....'I'm seeing a lot of anger here'..\n\nWe, a bunch if internet strangers, are actually standing up for his wife, and all he see's is anger.\n\nThis MFer",
          "id": 116,
          "comments": [
            {
              "score": 36,
              "content": "Oh yeah, his edit is something alright. It’s us that need to calm down 🙄 \n\nI feel for his wife, this guy doesn’t seem to get it and refuses to listen to feedback.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7541,
      "content": "When my MIL came over after the birth of our daughter and pulled this exact sh*t my husband’s reaction was to physically take the baby from his mom, hand her to me, and show his mom to her car. \n\nYou support a new mom by supporting her, not by trying to make things easier for yourself.\n\n\nYTA\n\nEdited to add: a mother should never have to ask for her child to be returned to her more than once, no matter who has them or the circumstances. Especially when it pertains to caring for the baby. This is a bananas thing to have to say. If a mom wants her child back, give them back.\n\nThe talk you had with your wife should have been a talk you had with your mother",
      "id": 118,
      "comments": [
        {
          "score": 859,
          "content": "This should be the top comment, your husband sounds wonderful. I’m 36 weeks and hope my husband would have a similar reaction. But he def wouldn’t be like OP and yell at me for stuff his mom is doing wrong. Husbands are bouncers during this time and should support their wives. Wife wants houseguest gone, then houseguest be gone!",
          "id": 119,
          "comments": [
            {
              "score": 63,
              "content": "Upvoted for \"Husbands are bouncers.\"",
              "id": 120,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 497,
          "content": "My boobs hurt just thinking about my newborn crying for a feed & someone else keeping him away from me. Of course OP’s wife is getting angry.",
          "id": 121,
          "comments": [
            {
              "score": 31,
              "content": "Same. Read that w my 8 month old beside me and had an immediate “must be time to feed baby” physical reaction. That  poor Mama!",
              "id": 122,
              "comments": [
                {
                  "score": 35,
                  "content": "I haven't nursed in 25 years & my boobs had sympathy pains too 😆",
                  "id": 123,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Right?! 16 years for me and I remember the pain like it was yesterday…",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 179,
          "content": "This is the end all be all of the argument. **She should not have had to ask twice.**\n\nOP, your MIL was out of line no matter what else she’s doing to “help.” The second she asked, the baby should’ve been back in your wife’s arms. That’s why YTA for defending your mom.\n\nSide note: I would ask your wife what your MIL spends most of her time actually doing. Sounds like you’re not around all the time (cuz work), and I wouldn’t be surprised if your mom isn’t contributing how you think she is.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "Yep, my MIL tried to not give me my oldest back exactly one time. I looked at my husband and said you get that baby back for me RIGHT NOW and he sure did. And that shit never happened again.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "Or hand to MIL a list of specific things to do that are actually helpful: go run to the store for milk and eggs, keep the sink cleared of dishes, change the sheets and water the plants.... In other words, perform the tasks that will reduce the stress on the new mommy, not add new stresses. \n\nAs for holding the baby, the newborn stage is the most important time for body-to-body contact with Mom. And it is fleeting--only a couple of months. MIL can hold the baby when mom needs an extra set of hands--to shower, to eat, etc.--and that'll be plenty of grandbaby time!\n\nSpeaking as a new grandparent in 2022!",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Like literally the alternative to not raising voice is snatching the baby. She had no other choice! \nEven she tried to physically take the baby playing a dangerous tug of war, I can’t even imagine the drama OPs mother would’ve pulled!",
          "id": 128,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6650,
      "content": "YTA.  She just had a fucking baby.  It's easy to say \"everything's going fine\" when all you did is orgasm 10 months ago.  Your wife is still recovering from birth and when she needs to feed her kid, there should be no hesitation or arguments whatsoever from anyone else.  Get on your wife's side, man.\n\nYour edit isn't helping you at all, it actually makes you look worse.  Your wife's reactions are not out of line.  You and your mother are out of line.",
      "id": 129,
      "comments": [
        {
          "score": 913,
          "content": "I love you",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 425,
          "content": "This comment is *chefs kiss*",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 242,
          "content": "“All you did is orgasm 10 months ago.” You’re so great. I love you too.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "This. Every last bit of this. \n\nAnd the edit only makes OP look worse. “*I don’t agree with moms behavior but I’m going to lash out at the woman who birthed a whole ass human five weeks ago because I’m still on the tit and my moms fake tears upset me far more than the disrespect for my wife.*” \n\nThere seems to be this prevailing thought that “helping” after the birth of a baby is showing up, holding the baby, and letting a new mother entertain you. Helping is dropping off dinner, throwing in a load of laundry, doing the dishes- your mom isn’t *helping*. Your mother is only adding to a new mothers stress.\n\nOh, and just in case it wasn’t clear, YTA, OP.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3535,
      "content": "YTA.  So let me be sure I’ve got this straight: your mom needs “patience and kindness,” but your wife - who *just* gave birth - gets an “enraged” reaction from you for needing to enforce that when she says it’s time to give the baby back, it’s time to give the baby back without pulling an “only if you ask nicely” routine?  Who are you under the impression you’re raising this child with, dude?  If your mom’s “help” is not only getting in the way of your wife being able to do her job but preventing you two from operating as a team, then no, you really *don’t* benefit from placating her at all costs.",
      "id": 134,
      "comments": [
        {
          "score": 570,
          "content": "OMG this. OP, get your head out of your ass. If your mom is there to help but her presence there isn’t helping (for whatever reason and whoever you think is at fault) then it’s time to end the arrangement.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "Right?? The mom saying OP’s poor wife needs to “ask nicely” to get her own baby back is treating the wife like a toddler. Of course she’s pissed off! OP’s mom is rude and condescending. She doesn’t get to set the terms under which she returns a newborn to it’s mother. You give the baby back the first time you are asked. Period. I feel bad for OP’s wife. OP should be setting boundaries with his mom and defending his wife. Also, holding the baby isn’t helping. OP, YTA\n\nEdit: OP’s edit telling everyone to calm down makes me feel like he’s not going to learn anything from this.",
          "id": 136,
          "comments": [
            {
              "score": 36,
              "content": "He didn't get the response he expected and now he's treating all of us the way he treats his (soon to be ex) wife. What an AH.",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2827,
      "content": "YTA. Your wife just went through a major medical procedure bringing a child into the world, whether you get that or not. It's *her* child, not your mother's, so your wife should *never* be in a position where she has to ask more than once for your mom to give the baby back for any reason. As it happens, though, your wife is literally trying to nourish y'all's offspring! So your mom is the one who needs to accommodate your wife, not the other way around, & YOU should have your wife's back rather than attacking her for her perfectly understandable upset.",
      "id": 138,
      "comments": [
        {
          "score": 119,
          "content": "The husband's complete disregard for the fact his wife just went through *childbirth* is appalling. It's not even on his radar.",
          "id": 139,
          "comments": [
            {
              "score": 27,
              "content": "Just yet another in the depressing parade of somehow-married mummy’s boys that seem to litter this sub. It’s so much easier to stand up to wife than All Powerful Mommy in case Mommy cwiiiiies or gets a saaaaaad. But if wife cries or gets sad she’s totally out of line. Ugh. Who is telling these amazing (mostly younger I notice!) women it’s a good idea to marry these overgrown toddlers and by extension their batshit mothers?!",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "If a mother asks for her baby back there should be ZERO negotiation. ZERO discussion. You give that baby back immediately. No questions asked.\n\nYTA, and so is your mother. Your wife is NOT overreacting. I would be fuming if I was her.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2279,
      "content": "[removed]",
      "id": 142,
      "comments": [
        {
          "score": 2649,
          "content": "[removed]",
          "id": 143,
          "comments": [
            {
              "score": 355,
              "content": "Tbh, I cannot imagine my MIL or mom doing this, because neither one of them are manipulative and would put their grandson at risk to make themselves feel important. And I can’t imagine my husband berating me for establishing those boundaries.",
              "id": 144,
              "comments": [
                {
                  "score": 31,
                  "content": "I thank the stars for my MIL every time I read these stories. She has her moments of hovering and anxiety (classic Jewish mom) but overall she's practical and understanding and I just feel so blessed to have healthy relationships with my in-laws.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 41,
              "content": "Not just that, he also acknowledged that his mom can do things that \"require some patience\" ...aka, Op's mom is an AH (just like Op) but after years of being a mommy's enabler, he is tasking his wife to support him cos mommy dearest might get her feelings hurt by someone standing up to her.\n\nOp go and clean your house starting from your mommy!!!!",
              "id": 146,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "YTA\n\nAgree 100%\n\nI know that during post partum time when a woman is at her most vulnerable… anyone that messes with her or takes advantage… it will be remembered.\n\nI’m lucky my DH is freaking  awesome and put me first 1000 x over. There were a couple of people that did try and take advantage of me and my most vulnerable and it did mess me up. Honestly, 7 years later I still have my guard up around them and it’s a shame.\n\nYou are putting your mother ahead of your wife. Your wife just had a baby and needs time to bond with her own baby as well as rest. Having to deal with your mother regularly and deal with her not giving her baby back, comments and whatever BS you consider small is going to cut your wife so much more.\n\nYour wife has enough energy to be a new mum, taking care of her baby and herself. Nothing more. You are a major major AH asking her to have patience for your mother.\n\nHonestly, your wife will not forget this. I’d be surprised if she wanted any more babies after this.\n\nMy friend went through this and the only way they had baby number two was after intense marital counselling and the mother in law staying in a hotel 2 weeks after the new baby arrived. Visits were 2 hours max. They’re still married and happy now.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 764,
          "content": "[removed]",
          "id": 148,
          "comments": [
            {
              "score": 30,
              "content": "It's not \"like trying to please your mommy.\"  This is exactly what he's doing.  He really needs to get his priorities straight...",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 65,
          "content": "100%. Why do we have to be this blunt to get this fucking point across? Growing a human is hard. Giving birth to a human is hard. Being flush with hormones is hard. Just clean the house, make dinner, and let us care for the tiny human for a few months until we are safe and viable. Stop choosing your mother's wants over our needs. This is not a transaction if mother wants to help then help, with no strings attached. If it is just an excuse to swan in and hold a baby, then GTFO.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "[removed]",
          "id": 151,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 37,
          "content": "OP admits his mom crosses boundaries and \"needs patience\" but when it comes to feeding a hungry baby, OP's mom has NO RIGHT to intrude. I'd go full mama bear on her too! Totally YTA and grow a pair.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "All of this!!! And saying your wife is \"acting out\" like she's a disobedient child??? You better figure out how to better support your wife and baby OP, or your heading for divorce. Your mom is adding stress to your poor exhausted wife, not helping.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}