{
  "post content": "I received a gift card to a local hole-in-the-walk “mom and pop” type restaurant back in Jan 2020. The gift card is enough to cover a decent meal for two at this place. \n\nBefore I had a chance to use it, things went into lockdown and the restaurant has since been either closed, outdoor dining only with very limited capacity, or takeout only. \n\nJust last week things opened back up here at full capacity for the first time in nearly a year. \n\nThing is, I know restaurants have been struggling, especially the smaller locally owned ones. WIBTAH if I used the gift card to pay for our meal when my spouse and I dine there this weekend?",
  "id": 1,
  "comments": [
    {
      "score": 37,
      "content": "NAH\n\nThey have already received a benefit from it compared to not buying the gift card. Interest-free loan for 12 months.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 25,
      "content": "NAH. There's no conflict here, and if you have a gift card the restaurant already has your money, so you're just ordering meals you've technically already paid for.",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 21,
      "content": "NAH. Me personally, though, I'd tip very generously and maybe get some high-margin items (like wine or something). I know they received the money in advance, but things were different then, and I don't want them to be struggling MORE as a result of my business, you know?",
      "id": 4,
      "comments": [
        {
          "score": 11,
          "content": "Good idea - we can do that to make sure it’s higher than the gift card amount.",
          "id": 5,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Also agree! OP can use up the gift card, but also get some extra stuff to make sure the restaurant gets more business!",
          "id": 6,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "NTA. The gift card means they were paid in advance.",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "[deleted]",
      "id": 8,
      "comments": [
        {
          "score": 2,
          "content": "Great idea!",
          "id": 9,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "NTA. A gift card involved full cash already. It might be different to use a heavy coupon but this is definitely fine.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA mom and pop cafe owner here....",
      "id": 11,
      "comments": [
        {
          "score": 1,
          "content": "Good to hear this!",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH. If they are a place that accepts gift cards from a year ago, then that's their policy! It's a meal that's already paid for, there's not much sense wasting it. But if it helps your conscious, you can give a good tip, or possibly buy more than what is on the gift card.",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "Sure, you can use the gift card. But tip like a queen.\n\nNAH",
      "id": 14,
      "comments": [
        {
          "score": 3,
          "content": "I’ll do that for sure.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n ---\n\n I feel it might be an asshole move to use a gift card to pay for our meal at a struggling restaurant because at this point it won’t generate any income for them, but will cost them time and resources to serve us the meal.\n\n---\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 16,
      "comments": [],
      "relation": "No"
    }
  ]
}