{
  "post content": "I (22F) have three dogs, all purebred and respectively with extremely sensitive stomachs. Two of them have allergies as well. I take them to a dog park where everyone has unanimously agreed to not give other dogs treats unless the owner is okay with it. Everyone except this one guy (29M) and his kids follow this rule.\n\nI’ve had a lot of fights with him and he has agreed to back off. He doesn’t even bring treats, more like cooked leftovers his kids eat and give to the dogs when they are full.\n\nWell a month ago they brought a whole loaf of bread and started feeding the ducks in the pond even though there are signs up not to do that. I only intervened when I saw his kid (7F) handing out to my dogs slices of bread.\n\nI told the girl to stop and that she shouldn’t give strange dogs food. Kid completely ignores me. I called the dogs to where I was sitting and lo and behold the kids came and started feeding the dogs again. I saw some owners scowling, others leaving..\n\n I approached the guy and told him to control his kids. He went ‘sure Karen, no one should have fun around here when you are around’. \n\nMe: ‘At least I can get my animals under control. Wanna pay for the vet bills? Get your kids to stop.’\n\nHim: ‘No one but you minds, go get a social life and maybe you wouldn’t be this insufferable.’\n\nThe next time I came around I brought a giant box of cupcakes and handed them out to the rest of the dog owners and the few kids that they had along. This guy and his kids came around and tried to take some but I closed the box. The guy got confrontational and asked me why everyone could have some but they couldn’t.\n\nI responded.’ Because you need to be taught a lesson about giving and receiving food. Teach you kids to only feed your dog and then I will be more than happy to share my food with you.’\n\nI did it a few more times as I had a birthday, one of my dogs did as well and my niece was born. Each time I left them out of it and refused to let them have any of the sweets.\n\nOne of the other owners approached me and called me an a-hole and vindictive. His logic is that yes, the dad is a complete idiot but I was punishing the kids as well for no reason. AITA?\n\nEdit I have attempted to take the dogs away and keep them by my side. The kids still come and feed them. I have attempted several times to ask the kids to stop but when their dad is telling them it’s okay, they have no reason to listen to me. Short of driving to another dog park an hour away, I cannot separate the dogs and the children.\n\nAlso, cupcakes and human treats are a common thing there. In my country it is believed any happy occasion should be celebrated with sweets for health and prosperity. There is cupcakes or cake almost every week. We contain it to a big picnic table and the dogs have no access to it. Most of them are off running and do not beg. I am not the only one that brings stuff to share.\n\nThis is fine, no one has complained about it as there has been no accidents.\n\n I am quite aware I am running into the risk of someone giving my dogs stuff they are not supposed to have and it has happened. It has, however, always gotten resolved with ‘hey, please don’t, those three have stomach issues’.",
  "id": 1,
  "comments": [
    {
      "score": 6169,
      "content": "NTA. You are not being mean to the kids. You’re simply not being generous. 7 is old enough to read and follow signs",
      "id": 2,
      "comments": [
        {
          "score": 1589,
          "content": "not being mean, simply not being generous\n\nIdk why i like this line that much",
          "id": 3,
          "comments": [
            {
              "score": 551,
              "content": "Because it is drilled into us that niceness, politeness and selfless generosity is required, when it is in fact *not*.",
              "id": 4,
              "comments": [
                {
                  "score": 208,
                  "content": "Being generous feels good. Giving things or doing things for people with no strings feels good.\n\nGiving or doing things because of an obligation does not.\n\nAs a kid I always thought I was being selfish and stingy because I didn’t want to share toys with children who I knew from experience would not return the toys when asked or treat the objects with respect.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 78,
                      "content": "As a kid whenever I had pocket money and bought sweets/treats I was always told to share and be nice. I hated it because it was like I was being forced. Now as an adult I do share often and I feel good doing it as it’s my own money and I’m not being forced.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -3,
                  "content": "…are we trying to live in a world without nice polite people and sometimes selfless generosity?",
                  "id": 7,
                  "comments": [
                    {
                      "score": 13,
                      "content": "No, we are trying to live in a world where that isn't required for random strangers. Edit, not random strnagers, AHs who won't control their kids or be respectful",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "Giving a treat, gift, or favor to everyone in a group *except* a couple of people is not merely \"not being generous\". It is targeted exclusion. OP is justified in her exclusion, which is fine, but don't pretend it isn't exclusion.\n\nThe reason OP isn't mean is because the behavior is justified, not because it's inherently not mean. If she deliberately brought cupcakes for everyone except one guy and his kid for *no good reason*, OP would be an AH.",
              "id": 9,
              "comments": [
                {
                  "score": 89,
                  "content": "It's exclusion yes, but the guy and his kids had also excluded themselves from the social agreement everyone had (about not feeding dogs without owners' permission). So if they wanted to be included in the social activities they should abide by the rules of that society, not pick and choose which parts to be involved in.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 263,
          "content": "Exactly! Idk what the other guys problem is either, but looks like no cupcakes for him, too! Unfortunately in this situation if you gave the kids the cupcakes you would only be enabling their behavior, they might even feed those to your dogs given how horrible they sound.",
          "id": 11,
          "comments": [
            {
              "score": 52,
              "content": "Yeah, OP has zero obligation to share. If she doesn't like the guy, then why should she? This would piss me off so much. My dog is a garborator but I still don't want people feeding him random food.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">they might even feed those to your dogs given how horrible they sound.\n\nThissss!",
              "id": 13,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 252,
          "content": "also bread is not good for ducks!! they much prefer birdseed or cooked/roasted frozen peas. also, crows absolutely love roasted, unsalted peanuts still in the shell. breaking the peanuts out of their shell is very good for their beaks, and peanuts are one of the best foods for crows. also, if you feed crows they will remember you and love you as well as tell their crow friends about you. all the crows will come to expect peanuts from you.",
          "id": 14,
          "comments": [
            {
              "score": 154,
              "content": "I started giving peanuts to the crows that migrate into my neighborhood over the winter (about a mile from their preferred-yet-food-scarce spring to fall area). I thought I'd sort of train them by shaking the can and getting them to come eat. Maybe they'd bring me something shiny! I even added mealworms to the mix, and twice a day, there they are chowing down.\n   \n Fast forward a month, and when Gregory Peck (the \"lead\" crow, it seems) shows up in the tree shrieking his head off at 7am, I run out the door, shaking peanut cans and scattering worms like an idiot so everyone can come eat.\n   \nThe neighbors are starting to ask questions. The mailman hates the worms. The car looks like a Jackson Pollock painting. There are no shiny things to be found. I believe that they actually trained *me*.",
              "id": 15,
              "comments": [
                {
                  "score": 46,
                  "content": "hahaha! yeah wow that sounds like a mess. i typically feed them in parks (im in portland, or so we have a lot of parks near me within walking distance) or just on neighborhood strolls haha.\n\nno intention to train an army. yet..",
                  "id": 16,
                  "comments": [
                    {
                      "score": 18,
                      "content": "There was a dude who would ride his bike around my old neighborhood (also in Portland) and throw a handful of peanuts on every street corner for the crows.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "The funny thing is crows remember faces. They’re so smart. They 100% KNOW who you are and what’s really interesting, is there have been instances of crows protecting the person that feeds them.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 18,
                      "content": "I once made a crow hate me and it still bothers me to this day.\n\nIt was a misunderstanding born of my own ignorance. I cawed at it using a crow call I had heard many times before. Unfortunately I’m pretty sure it was a territorial call and I was doing to a mature, territory holding bird. It was an affront that the bird wouldn’t suffer. He or she would follow me cawing and dive bombing me every time I left my house and walked to work. This went on for months and only stopped when I moved to a new town. I would like to make friends with crows one day as a way to atone.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Hahaha I love this story. \n\nI have a murder that I feed too. They pay me in shiny feathers and now I have a bouquet!",
                  "id": 20,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I'm jealous!! All I have so far is poop and very loud cawing twice a day. I've started leaving out baskets of water, candy, Twinkies, fruit gummies, and granola bars for the mailman who is *clearly* annoyed about traversing piles of peanuts, worms, and dung to deliver my mail!!",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Peanuts, great idea! I pass by a lot of crows and I've been wanting to give them treats. Though someone tossed out a full styrofoam container of nachos last week and they were going all fucking out",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Please write a children’s book about this",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Gregory Peck ! Nice",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "*immediately runs out to buy peanuts*",
              "id": 25,
              "comments": [
                {
                  "score": 65,
                  "content": "woot! do it - and you can google \"best ways to feed crows\". I carry a small bag of these roasted, unsalted, unshelled peanuts in my back packpack and always toss a few to crows when i see them on my walks.\n\nthe things i remember when i was learning about it was to place them on the ground near ish to the crow or under them without making eye contact, then just go about your day. they are very intelligent and will immediately mark you as a friendly ahha",
                  "id": 26,
                  "comments": [
                    {
                      "score": 23,
                      "content": "That is so awesome! I adore crows and have always wanted to make crow friends. I'm totally going to do this when I go on walks! Thanks for the info and tips!",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I learned so much and at the same time imagined the cover from the movie \"The Birds.\"",
              "id": 28,
              "comments": [
                {
                  "score": 10,
                  "content": "The remember... and spread the word to their friends...",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "And then you'll gave your own army of crows like a girl from a previous aita thread. It was epic",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "Exactly. There is no assumption, no requirement, that in a setting with grown adults, but essentially strangers, you share with everyone. You can include or exclude whoever you want, this is not elementary school.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I don’t know why some people have the idea in their heads that kids automatically deserve treats from other people just for the sheer fact that they’re kids. Nobody has to share anything with anyone they don’t like. NTA.",
          "id": 32,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "This. My son (who just turned 8) has known for a long time you don't ever approach a strange animal without the owners permission and you NEVER feed said animal without getting their approval.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "They're being safe! I'd be afraid the kids would give half the cupcake to a dog.",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "I agree NTA but I would say “being generous to everyone except one person” is mean. Think of being in a classroom and a teacher gives everyone a star sticker except one particular kid. Or a kid having a birthday party and making a big show of not giving an invitation to one kid. I admit I’m somewhat biased by the fact that the situation involves kids who are usually not well suited  emotionally to ostracization.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2242,
      "content": "NTA.\n\nRules are made, even informally, to help everyone get along easier and fairly use resources. Rules also keep the peace.\n\nThat guy not only didn't respect the rules of the dog park, they seem to want a special exclusion, just for them. If he wants to teach his kids to be assholes... that's okay, I guess. Feel free to teach them how OTHER PEOPLE react to assholes.",
      "id": 36,
      "comments": [
        {
          "score": 334,
          "content": "It's not even about the rules of the park, it's just common sense. Don't interact with pets without their owner's permission!",
          "id": 37,
          "comments": [
            {
              "score": 235,
              "content": "Gotta love it when owners let their maniac dog run straight up to my dog on walks and go “don’t worry, he’s friendly!” Cool, but what if my dog isn’t?\n\n(Mine is a sweetheart, but my previous dog would NOT have been ok with a random dog jumping into their space uninvited)",
              "id": 38,
              "comments": [
                {
                  "score": 115,
                  "content": "I once had someone's dog come up to mine and mine is dog anxious so she was hiding behind me and eventually snipped at this other dog. I tried pushing it away while telling the owner \"sorry my dog get pretty anxious and nervous around dogs she doesn't know I don't want her hurting yours 😅\" \n\nOwners response? \"Oh don't worry she knows how to fight\" and he just walked away as I had to pick up my dog and go inside. \n\nLet me be clear that his dog was a total sweetheart and seemed to be super happy and excited to see my dog. Absolutely no aggressive body language...but this guy basically told me if my dog went after his he was OK with it because he knew his dog would be aggressive af and come out on top.\n\nLike sir....it's not a matter of my dog killing yours and you needing to prove yours would actually kill mine, it's that I don't want them to fight *at all*.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 62,
                      "content": "That's got me seeing red. Shit like this is why I got a body cam for walking my dogs.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Man… So I own a big GSD who does not get along with other dogs at all (when he was little we didn’t socialize him well. He’s either mean to other dogs or gets too excited but is way too big and doesn’t know how to play nice without hurting somebody). \n\nYeah… I admit that’s not too fun. We babied him too much and didn’t train him right so now we gotta be careful when walking him to avoid encountering other dogs. Anyways, one day my sister and I are walking our dog and some tiny little dog rushes out of an open front door. We tried to rush away from little dog in hopes that we could shake them off our trail but oh god that little critter kept tailing us for at least two or three blocks with no owner intervention. Our dog was losing his mind and it was difficult to control, I was almost ready to just let my dog eat the smaller one and be done with it. \n\nSo yeah… Please keep a close eye on your dogs, for the safety of all parties. No one wants their dog to eat the mailman, nor does anyone want their dog to be eaten by the neighbor’s giant GSD…",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "Oh I hate this! My dog is not friendly but will behave if he's given space. He has a basket muzzle when we walk (which is very obvious and easy to see) because he's had issues before and that still does not deter people from letting their dogs run up to him.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 42,
                      "content": "My dog is very friendly to other adults. He’s a mix of excitable breeds and has only seen kids a handful of times in his 11 year life. They scare him. \n\nHe flat out is dominant and won’t tolerate other dogs in his space. He’s not in at all. He’s well trained. He listens and takes social cues from me etc. but he’s fiercely protective of me and is also fearful at times because frankly I’m afraid of other big dogs. He will fight your dog and he will knock down or even snap at little loud kids who invade his space. \n\nWhen we take him out he wears a soft muzzle and gentle leader harness. He’s controlled by it but NOTHING is certain and accidents can happen. \n\nThe only acceptable way to behave around dogs is to ask their owners permission before you do anything with them. Don’t approach. Don’t touch. Don’t feed. Don’t play. That’s a basic common sense rule of thumb. Anyone who doesn’t respect or understand that has no business at a dog park.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Pro tip: yell that you’re dog has Parvo or something else that is really contagious and expensive.\nPeople will avoid you after that but totally worth avoiding the hassle of having the discussion every time.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I worry about that all the time too. My dog is very protective of me I get to nervous when ppl or other dogs are around because I got harrast by someone",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "That's my dog! Other dogs do not respect his very clear \"fuck off\" signals and he's 12 lbs so he's not going to win any battles here.  We've already had to sew his eyelid back on once because a dog ran up, he growled, she tried to play, he snapped at air, and she snapped at his face.  I will straight up lose my mind screaming at strangers who do this shit.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I get annoyed with this,and its not even my dog with the problem. She's an angel...a 70 lbs angel. I, on the other hand, am a person with noodle arms and chronic joint issues. The number of times people decide to ignore me when I am trying to heel my dog and send theirs over to make her crazy...I have her under control, but it causes me pain for hours afterwards.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Same here. People always looked terrified when I told them my Labrador wasn't the big, friendly giant as they are always shown in movies etc.\n\nMy biggest laughable moment was when some punk tried to impress his date by walking his Rottweiler near my Labrador and making snide remarks about my dog being pray for his. When he got to close, my dog went in full rage mode (I had him under control, he was trained) and his dog whimpered away 🤣\n\nSadly we had to put him down because of his cancer",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "One of my greatest pet peeves. I have a large breed dog, and I am always shocked that people just let their dogs run up to him. What if he wasn’t nice?",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I have a Rhodesian Ridgeback Pittbull mix and it frustrates me too no end when people let their dogs just run up to him. He’s a sweetheart but he’s also 110lbs of muscle and doesn’t understand that he is huge and I would hate to have him accidentally hurt someone’s pet because he got to excited/overwhelmed. I don’t get why it’s so hard for people to understand that dogs aren’t people and won’t have the same reaction to a dog running up to them that a human would.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "If I ever want to give another dog a treat, I always ask before. You never know if the dog has a sensitive stomach or allergies or the owner is trying to train their dog and don't want to mess that up. It's just good practice to have. The guy is teaching his kids to put animals at risk for their own enjoyment.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "yes, wait until that kid gets bit trying to feed someone's dog & then the dad's tune will change",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "[removed]",
          "id": 53,
          "comments": [
            {
              "score": 56,
              "content": "Play stupid games win stupid prizes",
              "id": 54,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "u/unuseddynamic is a comment stealing bot \n\nhttps://reddit.com/r/AmItheAsshole/comments/tfemzs/_/i0vc7kq/?context=1",
              "id": 55,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "AND...the kid's dad wasn't listening to the dog's owner about not feeding them. The dad's the AH and therefore he doesn't get any treats and his kids don't either since they are HIS kids.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Put simply: he wants to be excluded but he doesn't want to be excluded. NTA.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1085,
      "content": "NTA. You shouldn't even pet a strange dog let alone feed one. My dogs have sensitive tummies as well so I feel your pain on the vet bills. Maybe you're being a teeny tiny bit vindictive but IMHO he shouldn't have been such an ass",
      "id": 58,
      "comments": [
        {
          "score": 307,
          "content": "My husband, my MIL, and I got into a huge fight because she kept feeding my friend's dogs when we were at a Superbowl party. And she made my corgi fat. Like 40 lbs. He has to be on a diet for 3 years and has knee dysplasia now. It is NOT okay for anyone to feed an animal without the owner's permission.",
          "id": 59,
          "comments": [
            {
              "score": 54,
              "content": "how did it get that far??",
              "id": 60,
              "comments": [
                {
                  "score": 75,
                  "content": "Hell my grandmother does the same to any dog in her care. She watched my cousins dog for 3-4 months (they were overseas) and the dog gained over 15lbs. Had to be put on a special diet. She thinks that the food bowl always has to have food in it. Where the rest of the family only believes in feeding twice a day.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 31,
                      "content": "I have a large breed dog who is slim at 95 lbs. He eats twice a day. If we overfed him like that he'd probably gain 40 lbs in 3-4 months and it would be hell to get him back down to 95.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "some pets do well with the eat at will and others with schedules but giving eat at will to dogs with schedules is asking for trouble",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I’ve sat more than a couple dogs that I just needed to keep their food bowl full and they’ll pace themselves accordingly. My dog would eat until he made himself sick if he could break into his food container",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "It took him 2 years to get so heavy, so we didn't really notice it. She lived with us for a large chunk of those 2 years. And she'd feed him extra stuff when he and I were both working, behind our backs. He's doing so much better now that he's lost the weight. The only time we even can tell is when we go to the lake; he'll run and run and run until he starts to limp, and he still doesn't want to stop. We have to leash him and sit with him to slow him down when it starts to bother him. My high energy baby!",
                  "id": 65,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "I had a roommate whose cat died young from obesity related causes which I didn't even know could happen. It was because she fed him human food. My 3 cats only are fed cat kibble, chicken wet food and Greenies treats, and they weren't interested in human food until she moved in. She started feeding them whatever she ate, even salty stuff like sandwich ham and anchovies, and they turned into obese, screaming monsters you couldn't eat around without getting buried in begging cats. I didn't even realize she was feeding them food until I caught her, then I had to have multiple talks with her about it and she just kept doing it. I'd say \"no human food for kitties\" and see one of mine with a sardine in his mouth two minutes later, \"He just looked so CUTE and SAD\". She only lived with us for two months, it took 6 to train them out of wailing at dinnertime and another year to get the boy cat to a halfway normal weight. One of mine still has sagging skin from her weight loss afterwards. It was so frustrating.",
              "id": 66,
              "comments": [
                {
                  "score": 5,
                  "content": "That's so awful! I'm sorry your furbabies had to go through that because a dumb roommate had no self-control.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Jesus, I wonder if my cat's old owner did this. She was 22 lbs when I adopted her (12 lbs now) and makes horrible, ugly, chain-smoker screams for hours on end before feeding time. Her greediness is the only thing I dislike about her. I've had her 2 years, and she still will scratch you if you have a Greenie in your hand.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "Yup so do mine. Great Danes. The bills can be ridiculous. And Great Dane diarrhea? God, it's awful. And one of them is allergic to chicken. I don't let other people give my dogs things because they don't know. On the plus side, though, most kids seem to be a bit freaked out by their size, so they stay away.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I had a chihuahua that a relative kept feeding scraps to during a thanksgiving dinner (we did not know until after or we would have stopped it). She has much bigger dogs with stronger stomachs plus she figured she didn’t need to ask us. Well our dog ended up in the vets for 3 days and it’s was like $2500 between overnight fees and testing and care. It was horrible and poor baby was so upset there. We had to specify the following year no feeding her!",
          "id": 70,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 434,
      "content": "NTA. I’d be absolutely furious if someone fed my dog without asking me for permission.",
      "id": 71,
      "comments": [
        {
          "score": 9,
          "content": "It's even worse when someone feeds your horses without getting permission!\n\nNot only can they die from some \"treats\" or being extremely overweight but they can also take off the fingers of an ignorant person (completely by accident).",
          "id": 72,
          "comments": [
            {
              "score": 1,
              "content": "Yeah fuck that, not sure if it’s true but I heard horses can’t unclamp their jaw. Like they have to fully bite down or something like that?",
              "id": 73,
              "comments": [
                {
                  "score": 3,
                  "content": "Not true.  They can let go any time they want to.  They can nip or take a full-on bite.  I can tell you that it hurts to get bit by a horse!",
                  "id": 74,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 390,
      "content": "NTA: is the dog park a membership group or open to the public?  If the former, then there should be a board who can revoke this guy's access for breaking the rules.",
      "id": 75,
      "comments": [
        {
          "score": 385,
          "content": "Nope, it’s a public park and feeding stranger’s dogs is not illegal and there are no official rules banning it. I did make a petition to put up signs to not feed dogs without permission and they are up in several places around the park but that hasn’t helped at all.",
          "id": 76,
          "comments": [
            {
              "score": 208,
              "content": "You shouldn’t even need signs. This is dog park etiquette 101…always ask before giving other dogs a treat. \n\nI wish I had a good idea for a better solution for you because that guy would drive me bananas. The only action that I could think of would be a staged walk out when he arrives. That happened at a downtown dog park I used to live near as it was super small. Guy would let his asshole dog terrorize everyone part of the early morning crew. So the 7 or so others showed up wicked early and all made a big hubbub about leaving at once so his dog was all alone. I was in the later morning crew and saw the tail end of his toddler like breakdown and I guess he never came back from sheer embarrassment.",
              "id": 77,
              "comments": [
                {
                  "score": 62,
                  "content": "I suggest that op starts feeding the kids random things. Espresso shots and cotton candy, perhaps?",
                  "id": 78,
                  "comments": [
                    {
                      "score": 22,
                      "content": "It’s really not the fault of the kids if they are young. They didn’t choose to have such shitty parents. Obviously espresso beans won’t harm them but it’s still crossing a line when you involve kids like that IMO. \n\nPlus it’s probably going to just escalate things.",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "My suggestion was to yell at the kids if they do it again. OP has been kind and asked nicely. Now I think its justified if OP raised their voice a bit to get the kids to understand. Maybe that's an asshole suggestion LOL",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Its not even dog park etiquette. Its just basic etiquette. Id be pissed if someone was giving my dog food I didnt approve of even if its not at a dog park",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "Does your dog park have a minimum age? If it does you may be able to get them booted for that. Also, does this guy even bring a dog? Some dog parks have rules against entering unless you're actually bringing a dog because some people will bring their kids so they can play with other people's dogs.",
              "id": 82,
              "comments": [
                {
                  "score": 10,
                  "content": ">Also, does this guy even bring a dog?\n\nThat was my first thought. He seems like the type of guy to bring kids to the park but not an actual dog.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Unfortunately not much you can do except to go somewhere else.  Maybe it's possible to call child welfare to say a dad is allowing his children near unfamilar dogs, but that can escalate like crazy.",
              "id": 84,
              "comments": [
                {
                  "score": 55,
                  "content": "Calling the authorities and labeling your own dogs as unfriendly, now *that’s* a big brain move.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Oops, it auto corrected from unfamiliar!",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 36,
                  "content": "That would likely just get the dogs investigated and banned. Almost every park I’ve been to has Rule #1: No aggressive dogs.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Seems like you’ve done everything else you could. Lesson cupcake is the completely perfect next step. \n\nNTA op",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "If there are signs, then use the police to enforce it.",
              "id": 89,
              "comments": [
                {
                  "score": -1,
                  "content": "signs aren't law...",
                  "id": 90,
                  "comments": [
                    {
                      "score": 6,
                      "content": "No, but they are an indicator of the property owners express rules. If someone isn't following them, then they can be removed from the property. Similarly to how a camp site may not allow open campfires and have signs posted, a police officer or park ranger or deputy/sheriff can have the person removed for not adhering.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 264,
      "content": "NTA. If this guy won't teach his kids then how will they ever learn? I hope you are explaining to the kids why they don't get treats so they are learning a lesson, if you are not and are just not giving them treats without explaining why, then you are TA. Hopefully he'll get the point or the kids will learn. \n\nIf you went to a school giving out treats making kids sick because of allergies you would be in trouble, same should go for pets.",
      "id": 92,
      "comments": [
        {
          "score": 218,
          "content": "I did explain it to them but it’s hard because they always go ‘but ours eats leftovers and it’s fine’. Without the dad I cannot really get through to them.",
          "id": 93,
          "comments": [
            {
              "score": 121,
              "content": "But they’re not fine! They might LOOK fine now, but feeding table scraps to dogs is so unhealthy for them in the long-term. They’re putting their pets at risk of obesity and other illnesses, potentially shortening their life span. We adopted a beautiful, sweet dog and her prior people fed her table scraps her entire life. She was hopelessly overweight and sick by the time we adopted her. She only lived a few short years despite everything we did to turn her health around. It was totally avoidable.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "Sometimes the only thing you can do is be the bigger b*tch. I had to do this with some people who kept trying to give my dog chicken bones. I got between him and them, said loudly (didn't yell) \"do not feed my dog, I'm tired of telling you this, you will not feed him anymore.\" And when they tried to whine or say \"but ...\" I just said it again. And again. Did they like me? No. But who cares? You're the only one who can advocate for your dogs' health and if this guy doesn't think you're \"fun\" then let him feed his own dogs.",
              "id": 95,
              "comments": [
                {
                  "score": 34,
                  "content": "Yes! Be the advocate for your dogs! I had to do this walking my dogs,- some stranger walked up to them and offered them a treat. I didn't know him from Adam - he could have been trying to poison my dogs. I straight up said to him (didn't yell) \"don't feed my dogs.\" He replied (because he couldnt believe it) \"No treats?\" I said \"No treats.\" and walked away. I don't care how big of a bitch they think I am.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "Tell them you don't care. I'd be a lot more aggressive honestly and tell the kids directly to STAY THE F AWAY FROM ME AND MY DOGS. You told them to stop and they didn't listen, tell them in a way they will listen to. Yell. Repeat. Until the point gets across. \n\nAlso take multiple videos of them doing this and tell the dad that if your dogs ever have to be taken to the vet because of food picked up at the dog park you will be coming after him legally to pay for the vet fees. I'd also be blasting them on social media and posting shame videos of this ah.",
              "id": 97,
              "comments": [
                {
                  "score": 31,
                  "content": "Yes agreed! What you do is step in front of your dog blocking the child from your dog - i do this with my nervous dog, she's very cute so people think they have the right to pat - i step in front of her to create space and clearly state not to pat her. \n\nYou may even have to force your dog away from the situation if food is involved, put him/,her on their lead and walk her away from the child a few feet.\n\nTaking your phone out and recording is also a good idea - be sure to record yourself asking the child and the father to stay away from your dog.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Or maybe take a supersoaker water gun with you and just shoot it around at first, but the second any kid gets near your dogs with food, squirt the kid. Bad Kid! Bad! LOL!",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "Maybe they have a friend or know someone with an allergy and you can relate the dogs to that?  Though with the dads temperament I'd bet he doesn't belief allergies are real either.",
              "id": 100,
              "comments": [
                {
                  "score": 11,
                  "content": "I was going to suggest this as well. Using the argument, just because they’re all dogs, doesn’t mean they are all the same. Some people have food allergies, and some don’t. Would you force a pb&j onto someone with a peanut allergy?",
                  "id": 101,
                  "comments": [
                    {
                      "score": 7,
                      "content": "There are people who do try to trick people with allergies into eating their trigger food because they think they're faking. It's disgusting.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I love your solution. The man is a sexist and the other guy who called you out sounds like one too. One thing you could try if you haven't yet is to tell the kids that if they can go the whole time without feeding the dogs, then they can have a cupcake to take home. With kids that age the more immediate the lesson the better.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "This makes me so sad because my mom’s dog has severe allergies to several foods including chicken. I have to really be careful with my kids and my dog (and cats) and their food if my mom brings her dog around. One time when my middle child was 3 or 4, my mom was babysitting and my kid dropped some chicken salad and no one noticed until the dog was really sick.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "And when their dogs ends up with permanent damage or death from things like pancreatitis from eating those leftovers (from cooked/high fat) or diabetes or liver damage (many foods we consume regularly are dangerous for dogs and cats with how they break down in the liver) that’s their father’s issue, not yours.  \n\nNTA- You don’t give other people’s children or pets food unless approved because you have no idea of medical needs or other factors.  It’s also perfectly reasonable to share food with friends and not those who don’t respect your boundaries.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "This sounds weird, but I think you should be raising your voice to those kids.  \"I said **NO!**\"  etc.  There should be no refuting your answer, and if their parent yells at you in return, so be it.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Tell them your dogs are allergic to people food and will vomit all over, maybe even on them!",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Could you explain it in a harsher way so they actually get it?\n\n\"Do you know that you could kill someone's poor puppy by feeding them something they're allergic to? You're not a nasty person who doesn't care if you kill someone's dog, are you?\"\n\nIt's a little mean, but it'll probably get through to them.",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Not OPs kid, not OPs responsibility to teach the lesson. The kids dad can explain to them why they aren't getting treats and why they can't give every dog treats. If he's not doing that, he can deal with whiny kids when they see everyone else getting treats except them because of their poor behavior. Would it be nice to tell the kids why they aren't getting treats? Yes. Does it make OP an AH for not explaining? No because it's not OPs responsibility to parent some random guys kids.",
          "id": 109,
          "comments": [
            {
              "score": 15,
              "content": "Unfortunately the dad probably won't and will make excuses for OP being the bad guy and dad being the good guy. Tough situation all over.",
              "id": 110,
              "comments": [
                {
                  "score": 5,
                  "content": "Not OPs problem then. Aside from at the dog park, they probably never see OP so why should she care if some random kids don't like her? Plus, they may leave her dogs alone if they think she's a bad guy. Win win.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "No it's not. But In this case \"AL Bundy\" is a negligent AH, who is not teaching his children properly.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 121,
      "content": "Nta. The kids aren't going to be traumatized by missing out on a cupcake. It's not your job to parent them but I don't think that's what you're doing here, it sounds like you're just proving a point to the irresponsible dog owner in a way that hurts no one.",
      "id": 113,
      "comments": [
        {
          "score": 93,
          "content": "Yeah, admittedly I do not know how to communicate with kids. People keep trying to tell me to teach them but I don’t know how. Short of ‘hey, that will make the puppy sick, he needs to ear special food.’ I really don’t know what more I can tell those children.",
          "id": 114,
          "comments": [
            {
              "score": 63,
              "content": "You said it better than I would have. I have no idea how to talk to kids who refuse to listen. It probably would've ended with me telling them \"If you keep feeding other people's dogs you might accidentally kill one one day.\" 😬 Not trying to be malicious, but I imagine it wouldn't go over well either lol",
              "id": 115,
              "comments": [
                {
                  "score": 44,
                  "content": "Yeah seriously if this were me I’d probably spend a just couple days bringing only two of my dogs and wait for the kids to ask what happened to the third one. Then I’d tell them he died because you and your dad kept feeding him things that aren’t good for him even though I asked you not to. That would learn them.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Not dog-related but my husband’s mom is a pharmacist who homeschooled him and whenever he messed up a math problem she would say “if you had my job, you would kill someone.” Malicious but works!",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "Sounds like you communicated just fine - 7 years is ABSOLUTELY old enough to understand \"please don't give that to my dog, it will make them sick\". I have a 3 year old and he would definitely understand that if you told him.",
              "id": 118,
              "comments": [
                {
                  "score": 36,
                  "content": "Yeah but you are a nice parent that will encourage your kid to listen.\n\nKids always look up to their parents for guidance and when the dad is like ‘yeah, go feed salsa to everyone’ I can’t do much.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Thank you for saying so. I guess my point is that it's not your fault - you did the right thing and the dad is 100% the asshole in this situation. Hope those kids can learn to adjust to society on their own somehow.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "You could get eye level with the kids (this is a proven technique) and tell them they may have a cupcake if they pinkie promise not to feed other people’s dogs. There’s the phrase “you attract more bees with honey than vinegar” and it holds pretty true to children. If Dad can’t be mature, maybe you can get through to the kids.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Relate it to something they understand. Drop the argument you're making, even if it's correct. Do they have the same bedtime? The same bedroom? The same teacher at school, the same friends? If they eat pizza today, do their neighbours also eat pizza? Do they have cereal for dinner? No, because sometimes different people do things differently or have different things. That doesn't make it wrong, but everyone has their own rules. *Your* dogs have a dinner time which is *not now*. Because *your dogs* have different rules and things than *their dog*. That's why it's not okay to feed your dogs at the dog park. \n\nIt's basically kids that, after getting corrected, yell at the sitter \"but dad lets me do X!\" The only constructive reply to that is \"he's not here, I'm here, and *my rule* is Y. When your dad gets back, his rules are also back. But for now, it's my rules.\" Any attempt at arguing about right/just rules will fall flat without support of the parent. But you can set your own rules! Just like how school has different rules than home.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 117,
      "content": "NTA… i can’t stand those a holes who feed the animals when there are signs stating “do not feed the wild animals”!",
      "id": 123,
      "comments": [
        {
          "score": 45,
          "content": "Yup. Bread is pretty bad for ducks too. It’s better than starving to death, but it’s tasty junk food to them and they don’t really get any nutrients out of it and can end up with issues like angel wing. Iirc it can also fuck with the ecosystem because they poop it out and weird ass algae starts growing in whatever body of water they’re inhabiting. \n\nIt’s better to feed them stuff like peas or dried corn, *if* there are no signs asking you to not feed them.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 80,
      "content": "I mean he is a giant asshole. Who feeds someone’s dog?! That’s crazy. And even after you told him to stop he is still doing it. He is the insufferable one. It’s true that you are making the kids suffer by not giving them cupcakes though. And it’s the dads fault, not the kids. I’d stop bringing cupcakes now. You’ve made your point and he is clearly not mature enough to see and admit he is wrong and stop feeding your dogs. I’m going with NTA.",
      "id": 125,
      "comments": [
        {
          "score": 75,
          "content": "The kids were told not to feed the dog though. \n\n7 years is old enough to understand that if someone says \"please stop feeding my dog\", they should listen.\n\nThe dad might be giving permission but it's not HIS dog. At 7, they understand that the dog does not belong to them and that they are going against what the owner wants by giving the dog human food.\n\nIf they can't obey a simple request that they understand, then they shouldn't get cupcakes.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 55,
      "content": "Lol I love it. Obviously you're both kind of assholes but I love it.",
      "id": 127,
      "comments": [
        {
          "score": 20,
          "content": "The person excluding the asshole for being an asshole isn’t an asshole, WTF? Actions have consequences. These are his. If he and his kids want cupcakes, they’ll stop feeding other dogs. It’s not rocket science.",
          "id": 128,
          "comments": [
            {
              "score": 21,
              "content": "The person excluding the asshole for being an asshole is doing so.. by being an asshole to children. OP is in the right, but it's still being an asshole lmao. Calm down.",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "This isn't a direct consequence, though. This is a consequence that OP has CHOSEN to create to prove a point, which makes them a bit of an asshole. Obviously the dad is a bigger asshole.",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "It's am I the asshole sub. Not am I a bad person. Ots an asshole thing to do but as I said I love it.",
              "id": 131,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}