{
  "post content": "My wife and I live in a secluded suburban neighborhood in NE Austin. Our house is situated on a cul-de-sac that is also near a community trail that extends behind our house. The trail is small and circles a natural detention pond, but many of the the neighborhood residents use. Our backyard can see everything and we have interacted with many people walking because we are so close.   \n\n&#x200B;\n\nSo, last night at 9:15 pm my wife and I are playing a card game. We have been busy lately and ordered in food, watched the Killing Eve finale and wanted to play some games. As we are playing, our doorbell rings. We both look at each other confused, and our dogs go crazy barking at the front door. My wife and I have the same thought, it's probably one of our neighbors we are close to and needed something or whatever. I walk up to the front door and peep through the hole and am surprised to see a teenage kid my guess is he's about 16 years old. I hesitate to say anything or open the door. I look at him again and recognize that I have seen him on the trail walking all the time with his dog, usually on his phone. Having recognized him, I open the door. Here is our conversation:\n\n&#x200B;\n\nMe: Hey what's up?\n\n&#x200B;\n\nHim: My airpods are in your house.\n\n&#x200B;\n\nMe:..........um what's that?\n\n&#x200B;\n\nHim: My Apple airpods are in your house.\n\n&#x200B;\n\nMe: I don't understand what you mean, why would your airpods be in my house. You have never been in my house and we have never interacted before. \n\n&#x200B;\n\nHim: Can I come in and look?\n\n&#x200B;\n\nMe: No, why do you think your airpods are in my house?\n\n&#x200B;\n\nHim: I lost them while walking the trail, and the ap says there are in your house. \\[He shows me\\]\n\n&#x200B;\n\nMe: \\[Not understanding how the ap works because I don't have any of my own\\] Look, I don't know why they are showing to be in my house, but they aren't. They are probably still on the trail somewhere. I am happy to let you look around my yard if you want, but you're not coming in my house.\n\n&#x200B;\n\nHim: \\[Aggravated now\\] Can I ping them and see if I hear them?\n\n&#x200B;\n\nMe: Sure, go for it. \\[He does, shockingly no sound occurs\\] There aren't here dude, they must still be on the trail. \n\n&#x200B;\n\nHim: So I can't come in and look.\n\n&#x200B;\n\nMe: No, there aren't here. Goodnight. \\[closes door\\]\n\n&#x200B;\n\nAm I the asshole for not letting a 16 year old teenager search my house at 9:15 at night after being accused of basically finding his airpods, and lying to him that I had them instead of returning them to their rightful owner?",
  "id": 1,
  "comments": [
    {
      "score": 8849,
      "content": "NTA - might be a good idea to make sure your dogs didn’t find them but IMO it’s easy to fake stuff and I don’t really trust anyone so I’d look around for them yourself and leave it at that",
      "id": 2,
      "comments": [
        {
          "score": 3898,
          "content": "Probably not faking, the app isn’t that great. I remember in college (~5 years ago) I was helping a girl look for her iPhone using the find\nmy iPhone app on my phone. \n\nThat thing swore up and down it was in the campus police department (which actually kind of made sense). We thought the cop was an ass giving us the run around and hiding it. \n\n\nWhoops, turns out it was in the dorm next door. Someone found it and popped it on a charger to return it—-they called her mom a few hours later.  \n\nIt’s only accurate to a certain extent. Especially with AirPods! Don’t lose those suckers.",
          "id": 3,
          "comments": [
            {
              "score": 665,
              "content": "No kidding, I have mine on a carabiner clipped to my pants at all times when I have them outside the house.",
              "id": 4,
              "comments": [
                {
                  "score": 492,
                  "content": "Yep, mine are on a carabiner too. I put a Tile on them yesterday because I tend to forget where I leave them in the house. \n\nI. Am. *Invincible.*",
                  "id": 5,
                  "comments": [
                    {
                      "score": 249,
                      "content": "Mine are always in the exact same place, my apartment is pretty small, so pretty hard to lose them thankfully. And I’m blind, so that’s saying quite a bit. LOL",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 42,
                      "content": "I currently can't find mine. Well, actually, I have a single AirPod without the case. They were both in the case, which was sitting on my table. My cat is obsessed with them, so I guess she knocked the case off the table and dragged it away somewhere. \n\nI found the single AirPod in her mouth. \n\nI keep expecting the others to turn up, but no luck yet.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "I use the carabiner but the tiler is an excellent idea, thank you!!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Was that a GoldenEye reference?",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "That... just sounds like a wire with extra steps.\n\nWhy did Apple invent \"wireless\" headphones again?",
                  "id": 10,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Because they wanted to remove the headphone jack\n\nBecause it’s a new (compared to other Bluetooth headphones that are still connected to each other) ‘premium’ product that they can charge exorbitant prices for \n\nBecause they’re marketing a ‘lifestyle’\n\nBecause money",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "\"invent\"",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "My million dollar idea. Faux Wired Earbuds. Attachable to a cable like old earbuds but detachable when you really need wireless. Wire plugs into the earphone jack so you can charge them and use them without Bluetooth.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 75,
              "content": "It’s crazy how sometimes it’s not accurate and other times it is. \nA story from about 5-10 years ago, I was witness to a girl using it to get her phone back. She had dropped her phone while sitting on the toilet and someone took it right away. By the time she got out of the stall, she could see the person who took it but didn’t have proof because they already hid it in a pocket. Get on the bus, lady was on bus too, did find my iPhone, it showed it on the bus. So she was able to call the cops, they come, ask for the phone, of course no one brings it forward. They call the phone, and it rings, the person didn’t turn it off or silence it and had put it in seat next to her. Owner didn’t press charges as everyone wanted to just get started on getting to where we were going. (It was an Amtrak bus) \n\nIt’s been a while so I’m not able to share the story as well as when it first happened. But I remember being shocked, like what just happened?",
              "id": 14,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 43,
              "content": "My dad found a pair with the case in the park late last year. He tried to find the owner using local FB groups but never did. They were named something  really generic like “Jane’s AirPods” so he couldn’t even go by that. And that’s how my dad got a free pair lol",
              "id": 15,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 37,
              "content": "One time my sister lost her phone so I did the Find my IPhone thing, she spent almost two hours looking around outside her apartment complex and the parking lot, turns out she left it in her car. Fucking hilarious to watch",
              "id": 16,
              "comments": [
                {
                  "score": 24,
                  "content": "I used to work in a bar and had someone come in using find my iPhone to track their phone they'd lost the night before. It was in another bar a street over and about half a street along.",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I do a lot of troubleshooting in my job (IT) and I always try to remember to knock out the easiest things *first*.  Nothing like replacing a piece of hardware just to find out the break room microwave tripped a circuit breaker :-/\n\nThat said, when I am looking for something I always try and look in the most logical places for me to put it... helps that I almost always put things in a logical spot.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "Happened to me just recently with the Find My Phone app and my AirPods. The app showed the last place I had them on. Not where they were. They were in my pocket at home. Showed in the park half a mile away.",
              "id": 19,
              "comments": [
                {
                  "score": 6,
                  "content": "Did the batteries die where they were shown at?",
                  "id": 20,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Good question. The park was where I put them back in their case. Batteries still had plenty of juice.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "This. I had cops pounding on my door at 2 AM once, when my husband opened the door they said \"did you find an iphone downtown and take it?\" \n\n\"Um, no.\"\n\n\"Yes you did. It says it's in your house.\"\n\n\"Well, it's not sooo...\"\n\n\"Yes it is. It says it is here.\"\n\nThis went on for like 10 minutes straight before they finally gave up and left.",
              "id": 22,
              "comments": [
                {
                  "score": 3,
                  "content": "...how the fuck was that enough of an emergency to disturb your sleep at 2am? Your cops must be really bored! Here you would be lucky if they even bothered to write a report if your phone was stolen",
                  "id": 23,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yeah I was pissed. That's not the only time they disturbed us in the middle of the night for something that had nothing to do with us.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Oh yeah, it’s not very accurate. Sometimes I need to use it to hear my phone because I lost track of it in the house and it’s wedged behind a couch cushion or something. The sound feature is really helpful, but anyone looking at the map would think I was having a torrid affair with whoever lives around the corner from me, because that’s where it always shows my phone being located.",
              "id": 25,
              "comments": [
                {
                  "score": 5,
                  "content": "I was looking for my cell phone the other night, and of course, I had it on silent :-/\n\nMy Google Wifi said it was connected to the wireless in my master bedroom, but it wasn't on the charger.  I called it from my other phone and my Fitbit started to buzz... Ahah!  It's nearby!  Turned out it fell out of my pocket when I sat on the bed and slid between the bed and nightstand.",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "i “lost” my phone in Santorini, and i used find my iphone to locate it. i walked up and down the beach several times, only to go back to the hotel and find it sitting on the desk under a towel. the location services on the app are bad. losing my phone while drunk in a foreign county was also bad",
              "id": 27,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Yeah it’s good for getting an approximate location, but a specific one I wouldn’t trust that much. It’s helpful for like, if you left something at work or your mom’s house across town, and then you know you didn’t just lose them in your own house in the bottom of your purse. I wouldn’t trust it to be in a stranger’s house and definitely wouldn’t knock without first scouring the near by trail where I was. The kid probably didn’t know this though and genuinely believed they must be in there. I’d say NAH, and hopefully the kid learns.",
              "id": 28,
              "comments": [
                {
                  "score": 10,
                  "content": "I think that people should use some logic when using find my phone. Like, if you use the app and see that it's in a restaurant in front of the one you ate before losing it, well, chances are that it's in the restaurnt you went to instead of it having walked across the street to the other restaurant. Or, if you see that it's in the house two over from your mom's, it's probably at your mom's instead. \n\nOf course that only works for when it was lost instead of stolen, and it could be that someone found it in the restaurant, took it, an decided to grab dessert at the restaurant in front, but most likely those won't really be the case",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I lost one a couple years ago and I was surprised by how accurate it showed the location. I know it was probably a one off but it showed the exact place in the parking lot a dropped it. Every once in awhile it’s great but I agree that 90% of the time it’s very much just a general area",
              "id": 30,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 153,
          "content": "The app told my son his AirPods were at X location, which didn’t actually exist. They were at home, a half mile from that location, in the couch. It also told me mine were at work on my desk when they were at home in my purse. If the kid comes back, tell him the app is buggy.",
          "id": 31,
          "comments": [
            {
              "score": 77,
              "content": "I think it actually shows you where you last used them. I take mine with me to work for example, but don‘t use them (last used at home) and it will show me they are at home.\n\nAfter all the AirPods don‘t have connection to the internet/mobile network. They use the bluetooth from your phone to be able to connect to the network. So that‘s why it seems buggy. It basically just pings where they were last used/connected.",
              "id": 32,
              "comments": [
                {
                  "score": 78,
                  "content": "There’s a really interesting podcast about a couple that bought a house and dealt with dozens and dozens of people knocking on their door saying the Find my IPhone app pointed them there. I think it turned out to be a super weird cell tower glitch",
                  "id": 33,
                  "comments": [
                    {
                      "score": 15,
                      "content": "That sounds funny. You got a name for that podcast?",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Oh I remember that story!!  It was something about cell towers triangulating",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Oh yeah, I’m sure it glitches a lot! Mine does that too. But I think for AirPods its also the main problem that you can loose them for example at work but used them last at home and you will search at home because it pings them there even though they‘re at work. \n\nBut generally yes - it sure glitches!",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "[deleted]",
                  "id": 37,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I actually thought it might take a turn for this haha",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Yeah any product using Find My shows last location used if they're not currently online. Which is why it particularly does badly with AirPods.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "yeah this is a clear case of tech being the asshole. It's also possible the app isn't even glitching, just giving an incorrect location (see: episode 53 of Reply All). The kid showed OP what the app said, sounds like an honest mistake. OP doesn't have to let him search the place, but it doesn't sound like the kid was rude or dangerous or anything.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "Yeah, I don't trust strangers either. Maybe I watch too much true crime, but this reminds me of the old, \"my car broke down, can I use your phone to call for help\" scam that then leads to them either casing the house or outright robbing it or worse.",
          "id": 41,
          "comments": [
            {
              "score": 15,
              "content": "That was my thought! He was casing the house. After he didnt hear it ding, the case was closed.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Literally that exact thing happened to my father middle of the day in town. There’s crazy stuff out there man! You can still be very helpful, just gotta watch out for yourself too!",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "I'm sure he's not faking. The app can locate the general area where things are, but it's not specific to, like, where in the house they are. (I know this because I lose mine all the damn time). So they're probably behind his house on the trail, but they're going to show up as being at the closest address.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Maybe they show as in the house cos they are in the dog!!! The🤢💩🐶",
          "id": 45,
          "comments": [
            {
              "score": 8,
              "content": "That was my first thought too!",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I'm not really sure why the kid is an asshole here either? Like, he probably thought OP had found them on the trail and brought them in (whether honestly or to steal them, who knows?). I would do the same. It's not like he acted badly, he was just frustrated.",
          "id": 47,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "If it’s anything like find my iPhone, the ap is reasonably accurate in that it gives a general location but it’s not 100%. I used to work at a homeless shelter and there was a seedy hotel close by. One shift I couldn’t find my phone and tried to use the ap. It said my phone was in said seedy hotel. I freaked, thinking I’d dropped it or it had been stolen and whoever had taken it was in the hotel. Nope. It was in my car. Down the street from the hotel. I feel like it finds the closest building and plops the signal there?? Or sometimes it’s misleading because it’s giving a radius and the way it looks on a map can give a false idea of where the item is? But I’m no expert.\n\nShort version: the ap probably makes it look like the AirPods are in OP’s house. They’re probably on the trail. \n\nI have zero clue why the kid thinks he should be able to come in and literally search for them though. The reasonable thing to ask would be ‘hey did you find my AirPods? The tracking ap I have says they’re close by.’ Then op would say ‘no, sorry. They’re probably still on the trail where you dropped them.’",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I am not responding to if the airpods exist but this comment. We had a neighbor over to be friendly and then the house was robbed next day.",
          "id": 49,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "A bird may have picked them up and nested on the roof?\n\nNTA, so weird",
          "id": 50,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Definitely keep an eye on the dogs. Swallowing one headphone is not a big deal, it will just pass through. If both are swallowed the magnets in them can attach to each other and crimp a loop of intestine and cause a serious medical problem.",
          "id": 51,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2853,
      "content": "Lol I dont care if his app tells him the holy grail happens to be in my living room.  You're not coming in if I say no.\n\nYou handled it well.  NTA",
      "id": 52,
      "comments": [
        {
          "score": 542,
          "content": "But can I look to make sure the holy grail isn't in your living room?",
          "id": 53,
          "comments": [
            {
              "score": 222,
              "content": "It could have been carried there by a swallow.",
              "id": 54,
              "comments": [
                {
                  "score": 154,
                  "content": " Oh, yeah, an African swallow maybe, but not a European swallow",
                  "id": 55,
                  "comments": [
                    {
                      "score": 18,
                      "content": "But is it laden or unladen?",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 28,
                  "content": "An african or a european swallow?",
                  "id": 57,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "You chose...poorly.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "It couldn't be in my living room. I've already got one, you see.",
              "id": 59,
              "comments": [
                {
                  "score": 8,
                  "content": "*“What did he say?”*",
                  "id": 60,
                  "comments": [
                    {
                      "score": 5,
                      "content": "He says he's already got one.",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Would've saved a lot of time",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Mongrel.",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 42,
          "content": "But the grail-shaped beacon is lit!",
          "id": 64,
          "comments": [
            {
              "score": 28,
              "content": "Oh, wicked, bad, *naughty* Zoot!",
              "id": 65,
              "comments": [
                {
                  "score": 3,
                  "content": "Here in Castle Anthrax, we have but one punishment for setting alight the grail-shaped beacon. You must tie her down on a bed and spank her.",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1134,
      "content": "NTA- There was no reason for them to be in your house. They probably are still on the trail nearby your house and the app pinged there. It’s only an approximate location than an exact one. On another note; Killing Eve is fantastic! I love Sandra Oh.",
      "id": 67,
      "comments": [
        {
          "score": 190,
          "content": "Agree. My Apple Watch was showing inside the location of my car when it was really hidden in my kids room. Locations are approximate.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "Yep, one of my co-workers used that at work to find hers it basically said it is somewhere in this 50m radius which was our entire building.",
          "id": 69,
          "comments": [
            {
              "score": 10,
              "content": "So at least you knew it was in the building.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Right?  Kid should have looked along the trail for DAYS before even asking if the home owner might have run across them.  NTA",
          "id": 71,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 816,
      "content": "NTA \n\n\nHe was the rude one but get yourself some ring cameras just in case something else happens \n\nThe whole interaction gave me the “gut feeling”",
      "id": 72,
      "comments": [
        {
          "score": 156,
          "content": "Get a proper set up, don't buy Ring cameras.",
          "id": 73,
          "comments": [
            {
              "score": 79,
              "content": "I'm being completely genuine when I say: what would be a proper setup and what would it cost in comparison to a branded door camera?",
              "id": 74,
              "comments": [
                {
                  "score": 27,
                  "content": "Get a network capable camera and setup the network yourself. Cost is comparable it's more difficult and time consuming because you have to know how to setup a network security camera but they are getting easier. Many have quick apps for setup that allow your phone to tell the camera all the network details.\n\nI am on the fence about home setups because while Ring has its issues, sharing videos with law enforcement without your knowledge, etc. They do have an onus to keep there software as secure as possible.\n\nThe average homeowner might make a mistake in their setup leaving themselves vulnerable to hackers. Although the risk from hackers is based on whether you are a likely target or not.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 111,
                      "content": "Kinda ridiculous to go from \"buy this basically pre-set up product that is extremely easy to install\" to \"set up an entire camera network yourself\". There are many products that could be considered \"proper\" that don't require you to do that.\n\nI see this all the time. Sure, it's likely better once you set it up, but come on now. This is like telling a 60 year old dude that's asking for advice on a new computer that it's better if he built it himself. Sure, but just, no.",
                      "id": 76,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Ring setups tend to have a lot of vulnerabilities with security and people hacking into them to talk to children and what not. Go with the basic wifi cameras and keep them on a separate network from all your other devices. \n\nIf you don't care about accessing them with your phone or away from the house, you can buy full offline kits that store it on a drive (CCTV).\n\nIf you go for a cheap wifi camera, try to stay away from anything produced by hikvision/hiwatch. They tend to phone home alot if you don't lock them down.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 1,
                      "content": "[deleted]",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I mean, technology is faulty probably just an poor app design.  Most people aren’t automatically bad just because they show up to your door unexpectedly. That’s frankly a huge problem with our society, expecting the worst just because it’s unusual, when crime is at all time lows (well...aside from current rioting).  It’s not like he was peering in the windows, he asked them to ping to see if they could hear his pods.",
          "id": 79,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "He lives in Austin off of a trail, that is an extremely common set up in the area. I very seriously doubt this was anything but a kid looking for his EarPods.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 594,
      "content": "NTA, this is the kind of thing you hear about as a robbery set up. Never let anyone into your home that you don't know, and if they are trying to pull something like that you can roll the dice and say you are are going to call the police so an officer can be there while your home is being searched. I bet they back-peddle real quick and say they've made a mistake.",
      "id": 81,
      "comments": [
        {
          "score": 203,
          "content": "Yup, this is the kind of thing I would be paranoid about as well\n\nAlternatively, if I were the teenager, I wouldn't be asking to enter a stranger's house alone either. I mean if someone shot me, no one would ever know.\n\nI might also have been watching too many Criminal Minds episodes",
          "id": 82,
          "comments": [
            {
              "score": 40,
              "content": "Teens are teens though. They’re notoriously unaware of their own vulnerability. Put myself in so many dumb situations as a teen unthinkingly",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "[deleted]",
              "id": 84,
              "comments": [
                {
                  "score": 8,
                  "content": "Lmaoo I was 16 5 years ago and I was never scared of anyone! I swear I am still surprised I survived that time in my life. I once knocked on a lady’s door at like 11 pm because I was lost and my phone had no service in that area. By myself! She helped me btw nice lady.",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I mean neither would I when I was that age but I certainly knew plenty that would.",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I got my parents into Criminal Minds a few years ago. For a year if my dad couldn't get a hold of me (I was living on my own with a roommate) my parents thought I was in someone's trunk or in a ditch somewhere. More recently after I got my bf into Mindhunters, he double checks the locks on all the doors when we go to bed. Those shows can really freak people out",
              "id": 87,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "This was a common robbery technique where I used to live. There's a fake app that they use (they set the location themselves) to get people distracted while they scope out the place or have an accomplice rob the place. They would always come by at 9-10pm and pull the same exact thing that happened to OP.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "This. This needs more upvotes. Social engineering is dangerously easy and on the rise, and many people are unaware of what it even means. (I'm not saying this was the case here necessarily, but needs more awareness and is a completely justified reason to not let anyone in).",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Yeah that’s what I thought! Like some kind of set up. \n\nLike... unless OP or partner picked them up there is no way they would be in the house.",
          "id": 90,
          "comments": [
            {
              "score": 8,
              "content": "The dogs could have swallowed them",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 204,
      "content": "NTA- by the description of the interaction you gave he was rude to you from the off. And once he didn’t hear them “ping” he should have gone off.\n\nHave a look yourself incase the dogs picked one up or something. He is probably very upset to lose an expensive accessory it that is certainly no justification for being confrontational and rude like he was.",
      "id": 92,
      "comments": [
        {
          "score": 7,
          "content": "Yeah my guess was the dogs probably ate them.",
          "id": 93,
          "comments": [
            {
              "score": 40,
              "content": "No, more likely is that the Find My iPhone app doesn’t give an exact location. They’re probably still on the trail, the kid is just kinda dumb. He’s never been in the house before so why would they be there?",
              "id": 94,
              "comments": [
                {
                  "score": 8,
                  "content": "well yeah, I agree kids are dumb, but I'm giving the possibility that it's in the house a fair shot. Dogs are dumb and eat things all the time.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 5,
                      "content": "That is true, he also could’ve thought that OP had stolen the airpods. I still agree that OP is NTA, as he had no idea what was going on.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I doubt the dogs ate them but they do love ear wax. Source my dog ate my hearing aids when younger",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 125,
      "content": "NTA- You let him ping there was no sound, you told him to search your lawn. You are completely in the clear",
      "id": 98,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 117,
      "content": "NTA \n\nBit creepy wanting to enter your home at night and search for the airpods",
      "id": 99,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 107,
      "content": "NTA\n\nA 16 year old claiming that probably knows enough about airpods that they're not in your house. He wants to look for other stuff.",
      "id": 100,
      "comments": [
        {
          "score": 97,
          "content": "It might have been innocent. 16 year olds are surprisingly technologically illiterate. They know how to use and ping AirPods, but they don’t understand how the GPS location actually works and don’t realize how often it’s inaccurate. And their reasoning skills usually aren’t great yet. And they’re bad at Google. \n\n(Source: I’m a high school teacher, and my students lose their AirPods and try to trace all the time. Location often shows them in the pond on the edge of school property. 😂)\n\nEdit: I’m not saying anyone should let a stranger of any age into their house. Just saying the kid might not have been up to nefarious shenanigans.",
          "id": 101,
          "comments": [
            {
              "score": 68,
              "content": "It just sounds like the kid thought the people living in the house found his AirPods and kept them. It explains why he was so pissed and confrontational: he thought he had GPS evidence that OP had something of his and didn't intend to return it.",
              "id": 102,
              "comments": [
                {
                  "score": 26,
                  "content": "Exactly. How would you behave if you were convinced someone had something very expensive that belonged to you, but wouldn’t give it back? If OP hadn’t seen him before, it would be suspicious. I don’t think there’s an AH here.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 17,
                      "content": "When you ring a stranger's doorbell at 9 o'clock at night and accuse them of stealing, then get aggravated when they won't allow you to search inside, you're an asshole. No responsible parent wants their 16 year old ringing strangers doorbells at 9 o'clock demanding to search their house. \n\nGoing to a strangers house and asking to be let in, after dark, is a big ask, especially for something as implausible as these people miraculously having this kids ear buds in their house without knowing it. The fact he was rude about it reeks of foul play, casing the house for shit to steal, testing how many norms OP would allow him to violate.\n\nThis kid had no idea who would answer the door. What if OPs wife had been home alone? Would this kid get aggravated with a woman home alone at night, demanding she let him search her home on the spot? What else is this person capable of? There are too many fishy things going on. This kid is an asshole, at best, and possibly much worse.",
                      "id": 104,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Exactly. He didn't hear them ping in his house. Also why wait until after 9pm to go looking for them?",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 74,
      "content": "Unless you found them and brought them into your house (which I do not believe you did) then NTA. Air pods don’t walk.",
      "id": 106,
      "comments": [],
      "relation": "No"
    }
  ]
}