{
  "post content": "My wife and I are getting a divorce.  I won't get into the details of it other than to say the whole thing sucks and I want it all over with so that I can start to move on.  She has been living with her parents for the last few months and I have been staying at the house we rented together. This past weekend was when she planned to come and move all of her stuff out.  This past Saturday also happened to be my birthday.  She asked if I was going to be around the house when she was moving and I said I didn't know.  I really didn't want to be there while she was moving all her stuff out, it would not be fun for me and she said she had people to help anyway.\n\nSo I decided to take my dog out to a couple state parks nearby to get out of the house while she was there.  I told her I am going to be out of the house all day because I don't want to be there while she's moving.  She just said \"OK\" and hung up.  I decided to turn my phone off because I just wanted to be able to relax a little bit and not focus on my failed marriage.  \n\nWhen I got home she was still there and I'll admit I was going to just drive right by and not stop, but she saw me and flagged me down.  She was sweaty and dirty and looked tired.  She said she still had a bunch of stuff to move and asked if I could help.  I said no it's her stuff.  Not mine, not ours.  Her's.  \n\nSo I went inside and the place is a mess.  Boxes everywhere, furniture half disassembled, it didn't look like she had moved a single thing.  I went to the kitchen, grabbed a bottle of whiskey and went on to our back patio to have a drink and start up the grill to make myself a nice steak I had gotten for myself.  She tried to ask me again to help because apparently the people she had asked backed out and she was doing it on her own.  I told her that wasn't my problem but if she needed to come back tomorrow that was fine by me.  I also told her not to worry about the mess, I would clean that up if it meant she would be done faster. \n\nSo I sat on the patio drinking whiskey and cooking my steak and by this time it was getting dark so she came out to tell me she was going to have to come back the next day to finish up.  I said that was fine by me, but I'm still not going to help other than to clean up after her.  She left in a huff and I did kind of feel bad about it, but fuck her, in my eyes she did this to herself.  \n\nAfter a few glasses of whiskey I decided to help her out after all.  I finished taking apart furniture, boxed up a bunch of her shit, and brought everything out onto the curb.  When she came back the next day she was pissed that I put all of her stuff outside and that anyone could have came by and taken it.  I told her she asked for help, I helped, now finish packing your stuff up, I have to finish cleaning up after you.  She called me an asshole but I feel I did more work in 2 hours while half-drunk than she did in an entire day and she didn't even remember that it was my birthday.",
  "id": 1,
  "comments": [
    {
      "score": 19,
      "content": "[removed]",
      "id": 2,
      "comments": [
        {
          "score": 7,
          "content": "From my point of view she either picked that day because she knew it was my birthday and did it out of spite, or she completely forgot it was my birthday and it was merely coincidence.  Neither one of those makes me feel good.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "How is that underhanded? It would make sense, as most people celebrate their birthday and wouldn’t be home. If you were getting divorced, would you want to be around your soon to be ex all day? I would imagine that would be awkward and uncomfortable.",
          "id": 4,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "You left out some really vital information in telling your side of the story that will make people think you are an asshole. You need to edit your original post to include that you ex cheated, gaslighted, and strung you along your while you were planning your wedding and married (with the same person from her gym). That she stuck another knife in your heart to picking your birthday to move out of your house. You may be slightly in the wrong for putting her stuff on the curb but it is not even a little bit close in comparison to the HELL she put you through. I don't know why you chose to leave out her wrongdoings and just leave in yours but you're not going to get an accurate deliberation on your actions if you leave out her bad behavior.",
      "id": 5,
      "comments": [
        {
          "score": 2,
          "content": "I would have included more of the history if there wasn't a character limit.  I wasn't aware my previous posts were locked or removed.",
          "id": 6,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "ESH. She shouldn't have expected your help especially on your birthday but you shouldn't have left her stuff outside.",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "ESH, as usual in a messy divorce. Her for nagging you to help, ‘No’ is a complete sentence. You, for leaving her stuff on the curb. C’mon, dude. Be better.\n\nBTW the other posts have been removed from your profile, I got the gist that you ‘thought’ she had an affair. Doesn’t really matter in reference to here, but why ask people to go look at nothing?",
      "id": 8,
      "comments": [
        {
          "score": 3,
          "content": "They still showed up when I just looked at them, but not sure if I can post links to them here or not.  Long story short, she went through with our marriage even though she was having an emotional affair with someone at her gym for months leading up to our wedding (at best, she still denies physical cheating despite all the evidence I have).  I can give you more details if you want, but I feel I owe this woman nothing.",
          "id": 9,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "[https://www.reddit.com/r/relationships/comments/dmyhuw/i\\_35m\\_think\\_my\\_wife\\_27f\\_is\\_having\\_an\\_affair\\_with/](https://www.reddit.com/r/relationships/comments/dmyhuw/i_35m_think_my_wife_27f_is_having_an_affair_with/)",
          "id": 10,
          "comments": [
            {
              "score": 0,
              "content": "Removed.",
              "id": 11,
              "comments": [
                {
                  "score": 5,
                  "content": "Sorry everyone, this is going to be long. I'm dealing with a lot right now and hopefully I can keep my thoughts coherent.\n\nMy wife and I just got married in August and I think my marriage is already over. I don't want to believe it, but I have a sinking feeling in my gut that she is having an affair with a coach at the CrossFit gym she goes to. She has always been very fitness conscious and spends a lot of time at our local CrossFit gym. I would join her occasionally, but that type of workout doesn't appeal to me. I would much rather go for a bike ride outside, something my wife and I used to do a lot together before she got in to CrossFit. Over the last 5-6 months, she would spend upwards of 20 hours a week at the gym. She would go there right after work pretty much everyday and stay until 11pm some nights.\n\nShe started blowing off our dinner dates together to stay at the gym. We used to meal plan together and cook dinner together, but she started choosing to eat at the gym or go out to dinner with friends from the gym instead. Leading up to our wedding I expressed concern that she was spending so much time there and that I felt that I was becoming less of a priority to her and that she was putting her time at the gym ahead of our relationship. She told me that going to the gym helped increase her self-confidence, she wanted to look good in her wedding dress, and that I was always free to join her there. When I told her that I would like her to dedicate two nights a week for us to have dinner at home together she agreed we would have dinner together on Monday and Thursday nights. That never happened. The first Monday after that agreement she called as I was cooking dinner and said she was going to the gym. I cried in the kitchen alone over a cold plate of chicken parm.\n\nThe next day I brought up our agreement and she told me I was smothering her and trying to control her. I told her I feel like she's pulling away from me, and straight up asked her if she still wants to get married. She told me the gym is just a hobby for her and that of course she still wants to get married, she loves me. Then she told me I need to get a hobby and to stop pressuring her for her time. I told her that I don't get any of her time anyway, she's either at work or the gym. I asked her straight up if there was anyone else, she didn't answer, she got pissed and left, you guessed it, for the gym.\n\nSo we still got married, because I believed her when she said she loves me. We both put a lot of time and effort into the planning, so she was always able to make time for wedding planning, but not for me. We had a lovely wedding. Catholic at her and her family's request. Big guestlist, friends and family from all over. It was one of the happiest days of my life.\n\nBut that shine wore off quick. Within a week of our marriage I was looking over our bills and noticed our phone bill was a little different. She had changed her phone plan to unlimited texting, not a huge deal, but I still asked her about it. She said that she was texting a lot for the wedding planning and wanted unlimited. Makes sense to me, so I didn't think twice about it. Then I noticed she started hiding her phone from me, something she never did before. She was constantly texting. I would ask who she's texting so much and she would just say friends from the gym. So finally, one day I caved and snooped on her phone. She was texting a coach from the gym hundreds of times a day. Nothing sexual that I saw, but there were thousands of messages going back to before our wedding. She was texting this guy on our wedding day too. He and his wife were invited, but didn't attend, but knowing that she was taking time out of our wedding day to text this guy gave me a pit in my stomach.\n\nSo I confronted her about this guy. I ask her if there's anything going on between them. She said they are just friends and that the only thing they have in common is the gym. I ask why she has to text him hundreds of times a day if they only have the gym and she doesn't know how to answer. She leaves and goes to her parent's house. A couple hours later her mom calls me and asks me to come over to talk. Her mom is a church counselor and wants to talk to us both about what's going on. I tell my side of the story and don't pull punches. I pretty much do everything short of accusing her of cheating. My wife denies nothing. She says she knows what I'm saying is true, but that she doesn't feel she needs to change anything. Even her mom tells her that texting another man hundreds of times a day is concerning, that at the very least it appears she having an emotional affair and asks if she feels she should put up some boundaries with this guy. My wife says she doesn't feel she's doing anything wrong. I finally have enough and ask her if my feelings even matter to her anymore, and she says she's always been self-centered and that I already knew that about her.\n\nI've been trying to get her to talk to me, but she refuses. I asked her to attend couples counseling but she says I need therapy and that until I work on myself that there is nothing she can do. I cry a lot, and I know she can hear me sobbing but she never comes to comfort me or ask me what she can do. She has literally walked right passed me while I'm crying to go to the gym. I feel like I'm going crazy.\n\nThis weekend we are supposed to travel out of state with some of her friends to attend a college football game. She was going to leave with friends last night and I was going to leave after work on Friday. I'm getting my bag packed and accidentally knock her gym bag over. I go to pick it up and I find a sex toy and lube, neither of which we have ever used together. I immediately text her and she gets pissed at me for snooping, accusing me of not trusting her and says she has sexual needs and who am I to judge. I stop packing and start crying.\n\nI picked her up from work yesterday and told her that I don't think we should go. I want us to stay home and try to work things out. I want to talk and see if we can reestablish the connection that we've lost. She refuses, saying we already have tickets and it would put her friends out if we don't go. I tell her that I don't think a football game is more important than our marriage, and that her friends will understand and can probably find someone to scalp the tickets to. She still refuses, she says she's going to be with her friends. We get home and she gets out of the car, I sit and cry in the driver's seat. I compose myself and go back inside and she's all packed up and ready to leave for the weekend. I ask her one more time to stay, almost begging. She says she's decided on going to the game and walks out. No goodbye, no \"I love you\", nothing.\n\nPlease, is there anything left for me to do? I feel so broken, I feel exhausted, I feel like my mind is playing tricks on me, like I must have done something but can't figure out what it is. I know I'm not going to the football game this weekend. I know her friends will ask why I'm not there. But I also know my wife won't care, and it breaks my heart. I don't want to believe my marriage is over a few short months after it began. I'm scared and lonely and I don't know what else to do.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Damn. So sorry, OP, and now pulling this on your birthday too :(  2020 has been a terrible year for so many reasons, at least you can put it all behind you soon.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NTA- She planned on getting her stuff that day and she had plenty of time. She should have been prepared instead of expecting you to do it. You're not together anymore and you sure as hell aren't her keeper.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "ESH- her for thinking you would help her, you’re not friends, and you for putting her stuff out on the curb.",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA.  Reading the original post in this wow I think you’re amazing to frankly have trusted her in the house all day on her own or with even thinking there would be friends helping her there. I wonder if she really even had anybody planned - looks like you’ve been a doormat for her for a long time and she just assumed you’d help her out.  And she’s been gone for months - picking your birthday kinda jerky.   that’s why she didn’t get much done all day she didn’t DO anything all day, she planned for you to spend your birthday packing up her crap for her.  I understand the instinct to leave her stuff out on the street but that could have landed you in legal trouble.   I hope now that’s she’s truly gone you can move on and find someone who will be nice to you.   Trust your instincts they were right on with her you just didn’t heed them.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. She put you through the ringer. \nHowever, putting her stuff in the curb was kind of a d*ck move, unless You were you symbolically getting rid of the trash?",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. It's her stuff, if she cares that much she would have made proper arrangements to move it.",
      "id": 18,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "ESH. She should have hired professional movers, and while you (understandably) aren't exactly in the mood to deal with her, helping her would have gotten her out of the house faster.",
      "id": 19,
      "comments": [
        {
          "score": 1,
          "content": "[removed]",
          "id": 20,
          "comments": [
            {
              "score": 1,
              "content": "True, but having been through the same experience, pros are better at packing stuff without breaking it. Not to mention in better shape to move heavy items...",
              "id": 21,
              "comments": [
                {
                  "score": 2,
                  "content": "[removed]",
                  "id": 22,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Agreed, I wouldn't expect her to hire anyone. But when folk backed out, surely messaging OP to say \"folk backed out, can I reschedule for when I can get some help?\" would have been the next step, not do half a job and try to guilt (or inconvenience with mess) him into helping.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Yeah, seems like a rock vs hard place situation.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}