{
  "post content": "I (37f) have two kids with my husband (41m); a 14-year-old daughter and a 10 year-old son.\n\nOur daughter has always been a little socially awkward to the point that we've had her tested since we suspected her of being on the spectrum. Turns out she isn't on the spectrum; she's just a natural introvert.\n\nHowever, this year in school we were thrilled when our daughter made a new friend her age since that is an area in which she struggles. Long story short she recently invited her new friend over (with our aproval) to have dinner at our house and then spend the night.\n\nSo, my daughter's friend came over. My husband is usually the cook in the family and this night was no exception; he made us all a really nice meal. During the course of said meal I asked my daughter's friend; \"Are you enjoying the food?\" She responded \"Yes! \\[Your husband\\] is a great cook! No wonder you've ended up a bigger woman.\"\n\nThe room got quiet for several moments. My husband tried to laugh it off and change the subject but I wasn't having it. The girl had just leveled a completely uncalled-for insult at me. My daughter's friend seemed to realize that she'd messed up but she didn't say anything else. We finished an awkward dinner in mostly silence and my daughter's friend did stay the night.\n\nThis was a couple of months ago. Recently my daughter asked if she could have her friend back over and I told her \"Sure; if she's going to apologize to me.\" When our daughter asked what I meant I reminded her of what she'd said. My daughter responded that it was over and she didn't want to bring it up again.\n\nShe then went to her father and asked. He said \"sure\" but she then told him what I'd said. He came to me and said: \"\\[Daughter's friend\\]  just felt awkward and tried to make a joke. It didn't land. For the sake of our daughter can't you just let it go?\"\n\nYes, I could, but the thing is that I just want an apology from the girl. I need to see that she understands how rude she was before I can get on board with her and myy daughter hanging out. My husband says that I am being weird for insisting on an apology from a 14 year-old, especially since that girl is such a good friend of our daughter. I think it's weird that I'm still waiting for an apology from that same girl. Seriously. That's all I need. I just need to know that any friend of my daughter is willing to own up to her screw ups.",
  "id": 1,
  "comments": [
    {
      "score": 87126,
      "content": "YTA. Did it ever occur to you that the reason this girl and your daughter “clicked” as friends is that they’re *both* socially awkward? \n\nShe’s a 14 year old kid. Even with the best social skills, they often put their foot in their mouths. Let it go. Don’t ruin your daughter’s friendship because your ego was hurt by one off hand comment.\n\n**ETA:** Thanks for all the awards, kind Redditors! I am also thrilled that so many of you like my username. And LMAO at whoever reported me to the Reddit Cares thing because of this comment. Have a great night/day, y’all!",
      "id": 2,
      "comments": [
        {
          "score": 29254,
          "content": "This. YTA if you don’t show this other awkward kid the same parental grace and gentle guidance you probably hope others will show toward your kid.",
          "id": 3,
          "comments": [
            {
              "score": 11591,
              "content": "Agreed wholeheartedly. \n\nYou should have acted like an adult and gently redirected. Have the kid back - if something happens again and it has a malicious tone then yeah, go all Gandalf on her. \n\nYou’re just hurting your daughter by continuing to hold a grudge from a teenager. \n\nYTA.",
              "id": 4,
              "comments": [
                {
                  "score": 6185,
                  "content": "Not even a 'matured teenager' so to speak, she's bloody 14 and if she is the same as ops daughter she was probably nervous as hell in a new house with new people having a lovely sit down dinner. \n\nThat can be intimidating as hell for anyone at any age. \n\nI remember when I was around 11/12 I turnt to my old man after he told me off for something and said \"hey shut up you're not my real dad!\", I had watched friends the night before and Chandler had said it so it was stuck in my head. When I saw my old mans face I was crushed. \n\n18 years later and I still think about that moment and it's probably gonna be no different for ops daughters friend. \n\nKids do and say stupid shit op, let it go. \n\nYTA.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3750,
                      "content": "Around OP's daughter's age, I was at a friend's house (we'll call her Jade) with another friend with the same name as me (\"Lisa\"). Jade's mom walked in \"Lisa, you're dad's here to get you.\" \n\nI automatically responded with \"But my dad shouldn't even know where I am!!\" \n\nAll 3 of them just stared at me dumbfounded until I realized and went red and quiet. \n\nIt wasn't even rude, but here I am at 30 and I still recall it occasionally and cringe from it. Teens, especially those of us who, like my ADHD self, are socially awkward, are just cringe sometimes. We mean nothing by it and we're just trying to figure out how to people. \n\nI've never thought maliciously about weights; growing up with plus size parents, weight isn't something you place value on so much. That said, I feel like the friend's comment is something I might have slipped and said at that age with a similar prompt. I didn't know what was offensive or why it would be so...",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 790,
                      "content": "[removed]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "I made a remark about there being a nip in the air around some Japanese visitors. Then burst out laughing after realising what I'd said. I was 12, I still remember to this day. I'm now 60.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "I teach freshmen (14 year olds) and they are still at the age where they are learning how to interact appropriately with adults. They say some stuff sometimes that can be genuinely hurtful but their brains are even fully cooked yet, so you just gotta take it as the unfiltered stuff kids say without knowing better. It's a teaching moment to kindly explain how what they said could be hurtful and almost 100% of the time they are super apologetic and it doesn't happen again.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Also, you have to take into account that for awkward 14 year olds these days, weight is often not an insult. That’s been a pretty popular trend lately, influenced heavily by social media. She may not have been insulting you at all, and felt scared and shut down when her attempt at a compliment was clearly ill-received.  \n\nIf a child mentioned that I’d become a bigger woman in the same breath as complimenting my husband’s incredible cooking, I’d be honored. It’s not really her fault that you’re so insecure about it, and she probably doesn’t know how to fix it. Cut her some slack. She’s a kid, for christ’s sake.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I’m was a very leveled teenager without a real teenager crisis. At 14 I said to my mom she was really starting to piss me off when she asked me to do something and regretted it immediately. I said this because my girlfriend at the time spoke like that to her parents. I still remember this 8 years later…",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "Oof, when I was 14, my teacher (reputation for being a real chill dude and always joking around) paused at the end of our first lesson and said “I want you all to pay close attention to what I have to say for the next few minutes. I have grand mal epilepsy.”\n\nI thought he was making a joke, god knows why, and burst out laughing in the completely silent classroom. Just... absolutely mortified. That was his first impression of me, who wanted to impress this cool teacher I had heard so much about.\n\nHe just wanted to give us instructions for if he ever had a seizure in class. I’m 30 now and that teacher has since been arrested for having a relationship with my classmate, but that still makes me fucking cringe.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Oh good, I'm not the only one torturing myself to this day over dumb shit I did or said as a teenager.  \nI feel like if you *don't* look back at your child self and cringe intensely, that's a bad sign lol. I feel like that means you probably haven't matured much since then. Looking back at your past self and going \"Oh god, I was so dumb\" means you've *grown* in the years since, right?",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "She may also not see being \"a bigger woman\" as an insult. OP is an older millennial, a few years younger than me, and it was hellish to be even average or busty in the 90s, heroin chic ruled. Today, kids may or may not place value on different sizes, depending on what internet communities they hang out in. Kid's friend may have an attitude of body neutrality, rather than the shame and self-loathing OP demonstrates.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I overheard my mom say something to my aunt about her jiggly neck one time. I parroted it back to her later, not even trying to be mean, I just thought it was ok to be casually discussed since I heard her casually discuss it. \n\nIt was not ok to be casually discussed. \n\nAnd it was hereditary. 😂",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1144,
                  "content": "Exactly, if OP was ever going to push for an apology it should have been done that night. \n\nKid: says a bad joke that is hurtful\n\nAdult: that was rude and uncalled for, please be considerate of how your words effect others\n\nKid: I'm sorry\n\nLetting months go by then holding your daughter's only friendship hostage for an apology is not good parenting and doesn't teach the kids anything valuable.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 668,
                      "content": "Honestly I wouldn’t even phrase it like that. \n\n“I know you didn’t mean it negatively, but when you said this it sounded to me like you were commenting on my weight.  Some people may take it as an insult, so be careful how you phrase things.”",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": ">I need to see that she understands how rude she was before I can get on board with her and myy daughter hanging out.\n\nthis also is too little too late. your daughter and her have been hanging out. you can't retroactively make a judgment call now.. she is either good enough for your kid or not. \n\ngrow up. you're holding a grudge and you're going to ruin your daughter's first friendship. it's not your job to teach other kids how to act. you want to enforce rules about what is rude and what at the dining table, you missed your chance. hold a grudge against your husband, who also didn't address it.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "It probably took all those months for the friend to stop feeling sick about the slip enough to brave coming back over. Poor kid.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "honestly if this is how OP acts around kids its a small freaking wonder her kid has limited social skills. Her mother has zero grace or idea with how to handle awkward social situations, she can't pass on or teach skills she clearly doesn't have",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 629,
                  "content": "[removed]",
                  "id": 21,
                  "comments": [
                    {
                      "score": 290,
                      "content": "The thing is (and I say this as a bigger woman), what the kid said isn't even a \"shaming\" comment. There's not actually any judgement attached to it, other than that OP is \"bigger\" so unless OP is actually slim or of average weight and what the kid said isn't true, the only judgement is in OP's head and her own insecurity.\n\n\"You're a bigger woman\" is a statement of fact, albeit blunt and socially loaded. \"You're disgusting because you're a bigger woman\" is body shaming.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Yes! Not to mention the only shaming came from OP's feelings about her size. There were no shaming words used. The OP really should have owned up to her own feelings and said \"That comment about my weight hurt my feelings and I don't want any more comments like that going forward\" no need to accuse the friend of shaming,  especially if we don't know it was intentional. My husband jokes about his belly as a compliment to my cooking with no shame.  He also runs and works out regularly. So if the friend came from a family like ours where that's just the way we joke without moral value assigned to weight she may never have intended it to be anything mean at all.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Also, the child clearly didn’t intend to shame OP for her weight. It was intended as a compliment of her husband’s cooking. The child’s family must teach more body positivity and less fatphobia than OP does.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 426,
                  "content": "There didn’t even need to be redirection. OP admits once the girl realized her error, she shut up.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Yeah the poor kid obviously felt terrible. There are so many things I blurted out as a teenager that I immediately felt awful about.\nSorry OP, YTA. If it helps though here’s a fun factoid about teenagers: During the teenage years children go through a massive pruning of neural connections. Up until that point the brain basically keeps everything because it MIGHT be useful later on. Then during puberty it starts to pick and choose which ones are ACTUALLY useful but during this time teenagers are essentially sociopaths. \nDon’t punish your daughter for something so small that her friend said carelessly.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 313,
                  "content": "Kids make mistakes. They’re not adults. They may do and say stupid things. Give them a chance and they will eventually learn the best way to handle social situations. \n\nYou on the other hand can really, really hold a grudge. Very adult of you.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 25,
                      "content": "And honestly insecure. Assuming the comment was an insult and then focusing on it for so long shows there is an insecurity there.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Isn’t part of maturing and growing up apologizing when you’ve made a mistake? It was certainly something I was taught as a child.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "“A woman is never big. She weighs precisely what she means to.”",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Eh, I had to teach these kinds of things to someone (in his case cultural differences) and it was much easier to be direct \"oh, that hurt my feelings - how would you feel if someone commented negatively about you or your appearance?\" And he said not good and I said \"exactly how you just made me feel.\" And then that was the end of it. He never got close to commenting on my appearance and hopefully didn't do it to anyone else either. Maybe since the kid in OPs story was less directly negative she would need a different script, but just give the girl the correction she needs and then move on. I also didn't need an apology because I'm a freaking adult. Teach and move on, OP!",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I’m heavy and know I’m heavy. I woulda been like “yeah, you’re telling me” then laughed it off. I’ve been told by a few young kids that I’m fat. It’s not great, but I know it’s not malicious.",
                  "id": 32,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": ">if something happens again and it has a malicious tone then yeah, go all Gandalf on her.\n\nThank you for saying it this way. By the way OP describes the encounter, it wasn't malicious, it seemed like a genuine compliment from an awkward person who is unused to these situations. Maybe the wording was off, but it sounds like something many people would say if they married a chef or a baker: \"J is such a great cook/baker, I can't keep myself away from his goodies, and it shows\" The problem came when it came from someone else, and OP is holding a teenage girl to the standards of a rival adult woman.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "In addition, if OP is a \"bigger woman\" then it was just a statement of fact, not an insult, by a slightly insensitive teenager. In fact a fairly tactful, if unnecessary statement. Bigger is much kinder than fat. OP needs to stop punishing her child for her oversensativity. She is in for a hard time when she gets older and people start telling her she looks old all the time, which they do, even adults for absolutely no reason. At some point you need to accept the fact that you are old, or \"bigger\".",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 925,
              "content": "This could also be a cultural difference.  In some cultures being larger is seen as a marker of social status, desirability, and good health.  \"Lucky you, your husband is such a good cook and you have regular access to nice food and so you are plump!\"  What is OP teaching girls about body image if she takes \"bigger woman\" as such a terrible insult?  I read this expecting to hear she argued with her and called her a derogatory name or something.  YTA, OP.",
              "id": 35,
              "comments": [
                {
                  "score": 334,
                  "content": "This. It's just regular for people in my culture to remark on weight without judgement/hurtful intent. \"I see you been eating good!\" is ultimately a compliment about how you seem to be well taken care of.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 72,
                      "content": "When my husband and I got married he put on a bunch of weight because he wasn't used to having someone cook (and bake) for him regularly. One of his favorite customers at work came up to him about 6 months after our wedding and patted his tummy and said \"looks like marriage agrees with you.\" Luckily he took it well because she definitely didn't mean it as a bad thing but I can also see how it could have been bad. I was there at the time and thought it was hilarious.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "That is exactly what it is I think. In my culture this would never be percieved as an insult. It sounds weird in American but I don't think the girl could have think that. In the end, the girl never had a bad intention to start with not even a \"joke\". Her intention was to compliment both the cook and the OP pure out of kindness. I think a 14-year-old girl should be forgiven especially if its cultural.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Name one such culture please so I can retire there.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Latinos love to fatten people up!",
                      "id": 40,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "Mauritania, but you probably wouldn’t want to live there. Their beauty standard has people force-feeding their daughters to plump them up.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "India. We lived there for 18 months for my husband’s job. “You’ve been eating well” and “you’ve gotten fat” were considered compliments.",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Arab/African culture also, when you gain weight its a sign that you are eating well. If you are in a relationship with someone we say «happiness looks good on you » or something along those lines.\n\nMost cultures value gaining weight as a good sign. As being skinny can be related to poverty, we struggled a lot when i was younger, we were really poor, not middle class poor, just poor. When my mom got with my step-father he brought food to the table, with a few years we started gaining weight, all of us.\n\nThe occidental world loves skinny people because its «fashion » not because of health issues as they love to claim it. Thats what i find funny, they are now bringing back «her*ine-addict-body » back into fashion so people with normal body weight are going to be seen fat once again after a few years.\n\n\nAnyway, you are welcome to come live in our countries, you will eat delicious stuff 😎",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "I thought similar. I lived in China for a year. I was probably a size 8 at the time. I was constantly told I was fat, by literally everyone. Students, other teachers, constantly when out shopping if I so much as stopped to look at a shirt as I walked by a store I was told I was too fat to shop there….  (In truth, I actually *did* fit their xl shirts, and I knew it). Things are only rude if we deem them rude. \n\nI once dated a guy who was 6’7” people constantly commented on his height no one thought that was rude. Factually he was tall, and I’m gonna bet that factually OP is a “bigger woman”.  The kid might not even know that only one of those things is rude to say.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "My grandma always said that you gain weight in a happy relationship because you’re eating lots of good food together. It’s not a saying I plan to pass on because I don’t think it’s helpful to comment on people’s bodies or weight at all but I do think it’s a nice sentiment and in a weight neutral society I think it would be a perfectly lovely thing to say.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 341,
              "content": "Seriously. I did a similar thing at 15 (not insulting anyone, just awkward and making dumb teenager choices after I got emancipated), and I was staying with a friend for the summer (end of July through August, and stayed with other friend through October and moved to a new city in November). I tried to help with chores and offered money for my stay, but they wouldn't let me help *at all*, and then would bring up money and expenses and make me feel terrible. \n\nI was staying with them in upstate NY (I am from Tx, met my friends up there through World of Warcraft, saved up money and came to visit), and I ended up bonding with her kid more than another friend I came to visit. My friend wanted me to stay with them, so with their permission I did for a while until I found a place to stay in town. I was sleeping in a heated barn out behind their house, too, not in the house. \n\nMy friend saw I was lonely a bit (since I came across the country from Texas), and since I was there possibly permanently (in NY, not their backyard), they got me a kitten.\n\nShe BLEW UP. Apparently not allowed (even though they have barn cats and it wasn't in the house itself). It went downhill fast. *She locked me out of the house in the snow without a coat* because she \"just didn't like me\" and \"was worried I was going to take her child away from her\". My friend's parent started hounding and harrassing me for not being more like my friend's other friends. She was an older woman who had a boob job and walked around without a bra, around her childrens' friends.\n\nI got a yeast infection (sorry, TMI) and went to a local Planned Parenthood-like clinic. I came home, did the treatment, no big deal (I thought). The next day, she comes running up to me and my friend with a paper in her hand, calling me a whore. She was ranting and raving . \"IT'S NOT DEBBIE DOES DALLAS, IT'S LUCKY-FU DOES TEXAS. WHY ARE YOU GETTING INFECTIONS LIKE THIS? I CAN'T BELIEVE SOMEONE LIKE YOU IS FRIENDS WITH MY CHILD, YOU ARE DIRTY\" I realized she had been going through my things in the shed, because it was my clinic paperwork that was under my bed inside my suitcase. I had 0 defense (grew up in narcissistic household and was the scapegoat). I just cried. And she felt triumphant.\n\nObviously I wasn't there much longer and my friend and I didn't really stay close either.\n\nI'll never forget it. An adult treating a child/teenager like they were another adult they were in some kind of weird competition with (I suspect due to body image issues). I own up that I made plenty of errors in judgment, but that could have been a sit-down talk or two, not screaming in my face over unrelated things.\n\nI'm sure I made more mistakes than what is here, I just don't know what the things were because she never explained and just attacked me verbally. I was saying/doing the wrong things, and she built up resentment instead of just talking to me and telling me what I was doing/saying wrong.\n\nTEENAGERS NEED GUIDANCE IF THEY ARE MAKING A MISTAKE, NOT ABUSE.\n\nIf OP's daughter's friend said anything again, OP could just explain that it bothers her without making the friend feel like she's a bad person (by doing things like demanding an apology and threatening punishment). If someone accidentally hurt my feelings and then never said anything like it again, I'd just let it go.\n\nEdit: Whoever posted the \"uncivil\" message to me, I am really curious about what you said to have your comment removed.\n\nAlso, YTA OP.",
              "id": 46,
              "comments": [
                {
                  "score": 119,
                  "content": "That seriously makes me want to cry! I’m so sorry you were treated so horribly!! 😞 you absolutely did not deserve any of that! And wtf, being called a whore over a yeast infection?! I used to get them all the time back when I was going through puberty and had just started my period (way before I’d had sex!)",
                  "id": 47,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Exactly! As a pharmacist I get so so sick of the stigma around these things, the number of awkward and horrified women of all ages I deal with every day is absurd. Thrush and even bacterial vaginal infections happen at the slightest change, it doesn’t mean you’re dirty or anything.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I have had a kidney transplant, and take antirejection drugs which weaken my immune system. \n I am a 55 year old married woman who hasn't had 'relations' with my husband (or anyone else, should minds run that way) in several months due to illness.  Last week I ended up in ICU with multiple blood clots in my lungs (PEs). I was catheterized, and to add insult to injury, I got a yeast infection after it was removed. It was hard enough to try and breathe and sleep without wanting to claw myself raw. I am home now, and still dealing with the 'tail end' of it (ha ha).\nSome people are SOOOO ignorant.  One does not need to have sex or any sort of physical relations to get a yeast infection. You just need to have a run-down immune system to lose your ph balance and be susceptible.\nI can only imagine how weakened an immune system can get under such stress of having no permanent home or loving support.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Hey I just wanted to say, nowhere in that comment did I see a dumb decision that you made, aside from maybe not getting out sooner. You didn’t deserve any of that, and I hope you’re doing okay now \\*hugs*",
                  "id": 50,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Truthfully, I should have asked her about the pet because it was her home, and just gave them money/did chores anyway to not be a burden. It became resentment that grew to hatred very fast, within a couple of weeks! All good now! Thank you",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 260,
              "content": "Also... I think I figured out why daughter is socially awkward.... look at who raised her. She learned from the best, it seems.",
              "id": 52,
              "comments": [
                {
                  "score": 18,
                  "content": "BINGO! I was waiting for this comment.\n\nYTA and it may be wise if you could indulge in some self examination about how you treat your child and the expectations you have for her.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Also makes me wonder if her daughter really IS that socially awkward cause she's introverted or if she's socially awkward because her mom imposed really weird habits on her.... and also, some really low self esteem cause her mother keeps telling her how socially awkward she is",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "YTA. This is exactly the perfect teachable moment for some gentle guidance. \"I know you didn't intend to be mean, but that comment can be taken as being unkind. Try to avoid commenting on other people's bodies.\"\n\nEdit to add: Best to communicate that off to the side and not call her out in front of everybody at the table.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Also, the title is misleading. She didnt make fun of OPs weight. At least not in a toxic, mean spirited way that most would take “make fun of” to mean. She made a joke that involved OP’s weight but the punchline wasnt the weight, but the husbands cooking skill. Certainly not a good joke to make but she’s an awkward teen girl who has probably learned to not say such things now.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Omg I’m cringing so hard because I *was* that awkward kid. Actually on the spectrum (though not diagnosed until adulthood). My dad was one of those people who was just naturally funny, and he had a very raunchy/inappropriate sense of humor. As a teen I always tried to emulate that because I knew how awkward I was and I just wanted to be liked by people. Unfortunately, I just didn’t have the emotional intelligence back then to understand *why* his jokes worked. I didn’t know anything about what made adult humor actually funny, I just tried desperately to do it. I’m 99% sure the poor kid was just trying to come across as likable and way more mature for her age than she actually is. OP is the *actual* adult here but she’s acting like a child.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "This. Am I the only one though that is thinking this kid was raised with the mindset that it’s not a bad thing if someone is bigger? I don’t know how to explain this but this kid grew up in the generation where body positivity is more talked about - maybe she thought calling someone “bigger” wasn’t an insult but just a normal topic to bring up. And if she’s socially awkward, then definitely doesn’t know how to approach things. \n\nEither way, I think it’s clear that this kid had no malice. God knows what kind of things I said at 14 years old, but the adults in my life aren’t petty enough to hold them against me.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Agreed.  And if the apology was so important, you had your chance at the table to make this a light hearted learning experience for everyone including your 10 year old.  But, you choose to have an awkward silent dinner.\n\nAlso give props to these two girls for still being friend after a parent fail.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2276,
          "content": "Also it has been months. Seriously op should have said something when it happened or just let it go already. As you said they are probably both awkward. How does op know this girl isn't on the spectrum",
          "id": 60,
          "comments": [
            {
              "score": 617,
              "content": "That's my thought. At the time, it absolutely would've been appropriate for Op to gently demand an apology. Months later knowing that's just an awkward kid who didn't actually have any I'll intentions, it's weird.",
              "id": 61,
              "comments": [
                {
                  "score": 384,
                  "content": "Why should the kid apologize? She didn’t say “ no wonder you are so fat and disgusting” she said “ no wonder you’re a bigger woman”. Hth is that an insult??!! Especially if you are a bigger woman. Big deal.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 273,
                      "content": "Impact matters as well as intent. I agree with you that OP’s reaction to that lighthearted comment as being an insult is probably due to internalised fatphobia, but people are allowed to have feelings (especially when fatphobia is basically societal and people *have* decided that fat = a negative trait rather than a neutral one). The friend clearly didn’t mean it to be an insult but if the comment upset OP irregardless of that original intent, the kid still could have said sorry. Commenting on people’s weight unasked for is generally seen as a social faux pas for a reason",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "When you are in (or want) a friendly relationship with someones, you sometimes need to apologize to something that is, on general, not a bad thing (like in this case). She didn't know that op have issues with her weight, and unintentionally hurt her feelings. \nIf she have been made aware, I'm sure she would've apologize.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "i mean, it's rude to comment on people's bodies either way. Even if she would've said \"no wonder you're so hot!\", that would've been inappropriate / rude too. Who knows why OP is \"bigger\", it could be because of a medical condition, not because she eats too much of her husband's cooking, or something else. It's just something that shouldn't be done",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 204,
              "content": "she probably *is* on the spectrum. as someone who found out last year at 18 that i was on the spectrum, social awkwardness/struggling to make friends is a *massive* part of autism, though it has to come with the rest of the traits, like sensory issues, requiring a strict routine in order to function, limited interests, stimming/other repetitive self-soothing behaviors, not understanding jokes/sarcasm and having issues reading social and nonverbal cues. there's a lot more, but that's the overall gist of it.\n\nbut yeah, op *seriously* needs to let it go, i'd be pissed at my mom if she held a grudge over something my friend told her months ago. the kid is 14, op is 37.",
              "id": 66,
              "comments": [
                {
                  "score": 21,
                  "content": "Exactly.   OP should have said something about this in the moment not months later.  She is being ridiculous",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Right, can you imagine if that interaction were between her and her husband and she tried to address it MONTHS later? That's not a healthy communication mechanism. I'm always so frustrated when we have higher expectations for children than we do ourselves. \n\nShe was clearly commenting on the evidence of the good cooking, and probably didn't realize until everyone else went awkward that it might have hurt OPs feelings. \n\nOP has an expectation that was never vocalized directly to the offender. Don't teach your daughter that. That's hell on any relationship.",
              "id": 68,
              "comments": [
                {
                  "score": 14,
                  "content": "The friend has probably heard her family members say similar stuff about themselves and the cooking being so good.  Ex. Her parents or grandparents. \n\nOP has serious problems if she is holding a child accountable for something said months ago that she never addressed.  There maybe a reason why her daughter has such awkward social skills",
                  "id": 69,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Oh I did that once. My sister, she used to find herself in front of my dad and asked him (I supposed one too many times) if \"she looks fat in this outfit.\" \n\nMy dad responded: *daughter's name* You are fat, whatever you wear is going to make you look fat. \n\nAnd then MY dumb ass 6-yr-old self followed my sister to repeat the very same thing. She told me to gtfo (rightfully so). \n\nShe just brought that memory back up over Thanksgiving. And my mom was like: YOUR DAD SAID THAT?! And I confirmed he did, because I was there. And my sister went on to tell us how much that actually ended up helping her anxiety forever in her future. She never carried that line of questioning into any other relationships. \n\nAnyway my point was to confirm that there are any number of combinations of repeatable phrases we could be learning in the home. Different communication styles, different ways of receiving the info. But there are many mechanisms and burdens for each of us during communication. \n\nMy dad was always extremely blunt and really gave no mind to how it would be received and my sister and I had a lot of trouble with that growing up. I found it really difficult to make friends because I was a lot like him. My friend group once did an intervention and told me I'm a bitch. I didn't understand. They were like: it's not even really the information, it's the way you sarcastically deliver it without any regard for how it makes someone feel. Took me *a lot* of practice to mimic appropriate social behaviors. \n\nMy sister and I also got really, really close to our dad before the end of his life. We constantly lament about his absence now whenever we need someone to tell us something honestly - and not something we want to hear... Because it's a social faux pas and he doesn't want to hurt our feelings. \n\n(I apologize profusely for the novella here 🫠)",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "This is what I came to say. If she had said \"you know what, that hurt my feelings, I'd really appreciate an apology\" at the time that would have been perfectly fine. But to bring it up now is bizarre. To hold her daughter's friendship hostage in exchange for an apology, months later is even more bizarre. OP needs to learn to let things go.",
              "id": 71,
              "comments": [
                {
                  "score": 8,
                  "content": "And to try to force your already socially awkward daughter into a weird conversation with her friend about her hurt feelings.  Does op even want her daughter to have friends",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1491,
          "content": "[removed]",
          "id": 73,
          "comments": [
            {
              "score": 548,
              "content": "Completely agree! OP YTA\n\nSomethings can be both ‘offensive’ and ‘not meant to offend’. She’s 14, clearly meant as a compliment and not malicious. And 14 year old girls think they’re subtle. If it was meant to be malicious you’d have noticed.",
              "id": 74,
              "comments": [
                {
                  "score": 304,
                  "content": ">If it was meant to be malicious you’d have noticed\n\nAgreed!  Teenage girls are NOT subtle in that regard. 😂",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 67,
                  "content": "> And 14 year old girls think they’re subtle. \n\nAnd 14 yo boys think they're the most clever thing on the planet... \\*Whispers\\**They're really not.*\n\nYTA OP. Be an adult and let it go. If you can't roll with the punches don't get in the ring. If you're this thin-skinned you might as well leave your family now. If your daughter is anything like the majority of young women, within the next 2 years she's going to say at least 1 thing 50x worse than this to you. You sound like the kind of woman that kicks their daughter out of the house for \"back-talk\".",
                  "id": 76,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Never understood the ‘back chat/back talk’ phrase. If I don’t answer you tell me I’m not listening and ignoring you, if I do, it’s back chat. \n\nAll I understand here is that I’m losing this battle regardless…",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 178,
              "content": "Exactly! OP is older than me but even as someone in my 30s I would maybe have been taken aback for a minute and then had a funny response about being thick or my husband’s amazing cooking. Sounds like OP is socially awkward as well.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "My husband and I are both big, in no small part because I'm a great cook. We joke about how I made us fat all the time. 😅\n\nIf a kid said that same line to me at my dinner table, it would be a compliment to my cooking, not an insult to our weight.",
              "id": 79,
              "comments": [
                {
                  "score": 15,
                  "content": "Maybe it’s something that kid heard at home that her own parents say to each other and she said it just to be conversational.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Honestly! I think most of us would realize the kiddo wasn't meaning it in any kind of malicious way after 20 seconds of thought. OP is just super insecure about her weight.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 75,
              "content": "Fr, and switch the sexes in the scenario. Even if it’s still in poor taste, nobody can say it’s uncommon to comment on a man’s weight as it relates to his wife’s cooking skills. She probably didn’t realize it didn’t land as well the other way around until after it came out.",
              "id": 82,
              "comments": [
                {
                  "score": 14,
                  "content": "Came here to say something similar. My husband is on the larger side of things and people have definitely made comments about how I must be a good cook. It's in poor taste, but I don't see how it's banish-worthy.",
                  "id": 83,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 61,
              "content": "This. You must have a thicker skin and teach your daughter resilience. Shrug it off and move on.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1451,
          "content": "[deleted]",
          "id": 85,
          "comments": [
            {
              "score": 459,
              "content": "I have kids the same age as OPs daughter. If I expected an apology every time their friends accidental said something mildly offensive to me, my kids would never have friends.",
              "id": 86,
              "comments": [
                {
                  "score": 99,
                  "content": "I still look back on things my friends and I said when we were kids/teens and absolutely cringe. Thing is, we were all socially awkward, generally kind-hearted people - we weren't bullies, we sure as hell weren't popular, we were raised to be polite, be kind, share, have empathy, etc. \n\nBut we still managed to blurt out things that were hurtful or at least rude by society's rules. I'm so glad neither my parents nor anyone else's in this case took any sort of massive offense to our occasional faux pas. Sometimes they let the comments just slide off, sometimes it was an educational moment (\"So-And-So, you know it's not usually considered polite to talk about blah!\"). \n\nTeens are still learning. Unless they're being malicious on purpose, social interactions are still in a bit of a \"teachable moment\" stage.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I'm a pediatrician and I had two separate teenage patients last week tell me I'm \"old\". They didn't mean it as an insult and it was actually really funny. Kids (and adolescents are still kids!) do this kind of thing sometimes. As the adult you either laugh it off or let them know why that's hurtful. \n\nIt's easy to know when a teenager means to be an asshole and when they're just putting their foot in their mouth. As the adult you have to be a good role model and sometimes that means letting things go.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I teach 14 year olds. If I reacted to what my abuse TA say like the Op did here I would never leave my house. Kids this age say stupid and thoughtless stuff. \n\nI always tell a student, “I know you but not everyone does. You need to be careful how you talk to people because they may hear what you said and think you are saying z, y or z.”  Also, I don’t automatically assume every comment is an insult. Maybe their grandmother or mom is larger and they associate larger with someone they know is happy.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "Sounds like OP has very oppressive body esteem issues, so much so that she takes mentions of her weight a lot more personally than it should.\n\nShe's letting her own personal insecurities dictate her attitudes and behaviors. Unfortunately she's the adult in this situation, and she should be willing to be an example of how to forgive and forget when someone makes a mistake. Not force a child to cater to said insecurities.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 872,
          "content": "I'll also say that not getting an autism diagnosis when a girl is actually autistic is quite common. The system is taking a while to catch up to the reality. You're daughter has a friend, don't ruin it for her. YTA",
          "id": 91,
          "comments": [
            {
              "score": 187,
              "content": "I (27F) suspect I'm ASD but there's no point in even trying to get diagnosed because there's a 10 year waiting list. I was diagnosed with ADHD a couple years ago but those meds don't work for me, they just make me stay up for 5 days straight. I'm not exaggerating on that, the first med they put me on caused me to only get 15-20 minutes of sleep here and there for 5 days, until it got out of my system since I stopped it after like 2 days.\n\nOP, YTA. I am forever putting my foot in my mouth. My best friend (also ADHD introvert) has to constantly point out when I've said something that comes across wrong. She knows I don't actually mean what it sounds like, I just can't talk like a normal person. From what you said about your daughter she sounds a lot like me. And there's a good chance her friend is equally awkward and introverted. I find we rarely make friends with confident extroverts. Those people scare me lol If the friend is also like me, she's probably still mentally kicking herself for saying that. I know I would be. Please just let it go.",
              "id": 92,
              "comments": [
                {
                  "score": 97,
                  "content": "This last bit. I'm on the spectrum (diagnosed in my 40s) and I still have times I can't sleep thinking about something random I said or did 5 years ago.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Just posted this in response to another comment: I saw three days grace a month ago and when I was talking to some random couple before the show, I said I grew up listening to them all the time. Then specifically said I listened to things like Santa Monica growing up. Which is a song by Theory of a Deadman. I can't listen to either band now without getting slapped with that memory. I just hope they were too drunk to remember what I said 😂😂",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "My wife is 26 and got diagnosed earlier this year after a few months waiting time, so I suspect it depends on where you live. Don't give up!",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "My understanding is autism may present differently in girls and the medical field hasn’t really taken the time or care *as a whole* (obviously with exceptions) to get that information updated and out there for diagnosis. I agree with ifelife—your daughter could still be autistic. Tangential to the AITA but worth thinking about a second opinion if she may need more accommodations at school and work in future, not to mention support.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I have never had an official diagnosis. I'm 47m.  Both of my sons were diagnosed and when we were my oldest was on the spectrum the neurologist said \"he has many classical traits of autism, it's obvious, you should have already known\" My response was immediately \"No, I did the same things as a kid, that doesn't mean anything\"\n\nI've talked about this with my therapist.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My son hasn't received a diagnosis because he's highly verbal (has been since he could talk), makes eye contact and is social. He prefers to do things on his own, but he is also very extroverted and looooooves to talk. Like when does he even take a breath talk (he also has ADHD). Yet, he nails every other autistic trait when tested and benefits with autistic focused parenting and education.\n\nMaybe she isn't necessarily autistic as the DSM defines it, but that doesn't mean she isn't on the spectrum of neurodivergence as a whole. She may also have learned to effectively mask and is good at it. I think OP is being shortsighted in all of this. If she is simply introverted, the daughter is going to have anxiety about having to tell her friend to apologize. Op is making her the middle man.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 688,
          "content": "I spent my entire teaching career working with adolescents, and there's really only one word to describe them: awkward. They're no longer kids but are far from being adults, and they're trying desperately to join the \"grown-ups club\" in both intellectual discussion and humor. The joke your daughter's friend made was her attempt at having an in with you, and by all accounts it failed. \n\nWhat I also know about adolescents (ESPECIALLY the awkward ones) is that they don't quickly forget the embarrassing/awkward things they do. This girl is mortified by what she said. Any time she thinks of coming to your house, she experiences a wave of embarrassment because of what she said. She probably even felt a little nervous just being around your daughter for awhile afterward. She's already paid her penance in regret and shame - forcing her to apologize would only make it worse (and would likely feel like punishment).\n\nI'm not going to vote because I understand where you're coming from and I don't think you've got any ill intention.  But demanding an apology really isn't necessary. Be the grown-up this kid needs and give her a little grace.",
          "id": 99,
          "comments": [
            {
              "score": 197,
              "content": "Came here to say this. This incident lives rent-free in this poor girl's head and she probably lies awake thinking about it at night.  If OP wanted an apology, she should have asked for one then and there, or just laughed it off to reassure the girl. Demanding an apology NOW would just increase her mortification and ensure that coming over to OP's house is an anxiety-ridden nightmare, and all because OP, an adult, is so bothered by an awkward child's comment that she can't let it go. Incredible.",
              "id": 100,
              "comments": [
                {
                  "score": 12,
                  "content": "How about the fact that the a comment from a 14 year old is living rent free in the OPs head. That’s more concerning to me than the comment the 14 year old made.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I'm not so worried about OP still being bothered by the comment - it's only natural for things that bother us to do so for awhile.  There are things students said to/about me 20 years ago that still sometimes pop into my head and will make me feel self-conscious, even though those comments would be inaccurate now and have no bearing on my life. As soon as I remind myself \"that was a kid saying that, they've grown since then and so have I,\" I'm completely over it.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 332,
          "content": "This so much. OP, YTA, for not having the compassion for your daughters friend that you would expect for your own daughter.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 302,
          "content": "Exactly! YTA OP. And instead of an apology look into why this is hurting you to this extent. It could be coming from your own insecurities or perception. I’d say always look at the intention. The girl didn’t mean to insult you. She just got carried away and said something that came to her mind unfiltered and with the understanding of a fourteen year old. \n\nYour daughter is finally trying to branch out and has found a like minded friend. Maybe just have an open conversation and tell her that if it happens again she should speak to her friend and talk it out. Forcing an apology is the worst way to deal with this",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 200,
          "content": "I couldn't put it better myself. OP, this is more about you and your body image, not a socially awkward 14 year old's mistaken comments. Come on, don't destroy your daughter's first real friendship.\n\nYBTA if you continue with this.\n\nEdited from YTA to YBTA.",
          "id": 105,
          "comments": [
            {
              "score": 10,
              "content": "Seriously! Personally I would have laughed it off. The kid has two working eyeballs and I am fat. If you don’t have an issue with it, no one else will either. And If they do, it’s their problem not mine.\n\nOP it is months later and you’re still stewing about what a 14 year old said. That’s a lot of mental real estate for a non-malicious comment. YTA",
              "id": 106,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "I still cringe when I think of the fucking stupid things I said at that age! \n\nThe friend probably thought she was complementing the food and then realised what an incredibly stupid thing she said. She then didn’t know how to rectify it.",
          "id": 107,
          "comments": [
            {
              "score": 32,
              "content": "I still cringe at the fucking stupid things I said like a week ago.",
              "id": 108,
              "comments": [
                {
                  "score": 14,
                  "content": "Oh man. At 23 I was picking up a couch from a girl my age who had just had a horrible breakup with her bf. I of course didn’t know that till we got there. I was just excited to get a really nice free couch.\n\nI brought my bf along to help with the heavy lifting and when she told me what was going on, I said while lifting the couch with my bf on the other end, “oh wow, that definitely could have been us a couple months ago!” And my bf just looked at me in horror. In my mind I was thinking about the horrible fights we had a couple months prior  and was trying to relate but it was just an insensitive response. I still cringe about it to this day. I’m with the same guy and he still makes fun of me for it all the time lol",
                  "id": 109,
                  "comments": [
                    {
                      "score": 10,
                      "content": "God you think that’s bad? I had a patient who had come in for suicidal ideation. I was just making small talk while assessing and getting them set on the stretcher, and honestly it was like hour 10 of a 12 hour shift, so the small talk was sort of on autopilot while my brain focused on doing the more important parts of my job. It was shit weather, like blizzard-level snow and cold, so before I could realize what I was saying or stop myself I said “Let’s bundle you up, this weather is horrible. When I woke up this morning and saw all the snow I just wanted to die.”\n\nTo a suicidal patient.\n\nNot my best moment and I still cringe hard years later.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I don’t think what you said was that bad.\n\nWe all say really silly things at times. We are only human!",
                      "id": 111,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "I'd also add that a lot of women make self-deprecating jokes exactly like this. At 14, you're just starting to realize that things your family laughs about might not seem funny to someone else's family.\n\nDifferent subject matter, but a friend of mine jokes how she always hoped her kids would get her looks and their father's brain. One of her kids told a friend's mom who was complaining about his report card, \"too bad he didn't get his dad's brain.\"",
              "id": 112,
              "comments": [
                {
                  "score": 6,
                  "content": "I know I shouldn’t laugh…. But I did.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 39132,
      "content": "YTA. You should have asked for an apology at the table. What she said was very rude, and I think she knew it as soon as it came out of her mouth, but she didn’t know what to do to make it right. If you’d said “that’s was very rude, and I’d like an apology” she would have said “I’m sorry” right there, and while awkward, it would have been over. \n\nYou missed your teaching moment. Holding a grudge for months against a 14-year-old is silly, and you’re punishing your daughter unfairly. Let the kid have a friend.",
      "id": 114,
      "comments": [
        {
          "score": 7030,
          "content": "This! She didn’t know how to make it right! Her husband laughed off the joke at the time so how was she supposed to know she had upset the mum so much?",
          "id": 115,
          "comments": [
            {
              "score": 137,
              "content": "She didn’t know how to make it right because she’s still a kid - it takes a lot of maturing to really understand the impact of these kinds of things.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "And at 14 I can sympathize with sometimes you just open your mouth and the wrong thing comes out. Ive put my foot in my mouth several times but I didn’t get better til I learned how to read social ques and situations. It’s hard to know what to do next because they haven’t been in that kind of situation too much to know how to backpedal and apologize. \n\nYTA. Op went for a nuclear option when they should have just done a verbal slap on the wrist",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "[removed]",
              "id": 118,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 648,
          "content": "Exactly this. We live in a fatphobic society, she's certainly internalized that, but it doesn't sound like she was trying to be offensive. Her own mom or dad might say they're bigger because of the other spouse's cooking or constantly remind her daughter about food habits. She could be on the spectrum or also be socially awkward, who knows. \n\nIf she was regularly rude, then that's something to bring up with her or her parents, but at this point, this feels like trying to parent someone else's kid or punishing your own.",
          "id": 119,
          "comments": [
            {
              "score": 454,
              "content": "Perhaps I’ll get downvoted for this, but isn’t it fatphobic to be insulted by being called “bigger”? I mean, if we’re trying to be body positive, and it’s okay to be a bigger person, then why is a child calling a spade “a spade” an insult that needs to be apologized for?",
              "id": 120,
              "comments": [
                {
                  "score": 206,
                  "content": "I don't disagree. It's part of why I think it's entirely likely that the friend wasn't trying to be rude.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 169,
                  "content": "Yeah, being called a larger woman isn't inherently insulting, but OP took it that way. There wasn't any negative judgment made on her size, yet she thought it was insulting. Stuff like this, I think, could generally be considered internalized fatphobia.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 112,
                  "content": "Because OP, like many other 'bigger' people, is secretly not okay with being 'big'.",
                  "id": 123,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 83,
                  "content": "Yep. You can call me fat, because I am, and we only have to euphemize that because of massive cultural fatphobia. I know it makes people uncomfortable sometimes when I describe myself that way and they try to talk me out of it. (\"You're not fat, you're beautiful.\" \"No, I'm fat AND beautiful, and I need you to examine why you think those things are mutually exclusive.\")",
                  "id": 124,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Our society has a hard time with two things being true at once. My mom was a hot girl when she was growing up and I wasn’t. She’s very much the “you’d be so pretty if you lost weight “ type. Telling her that I already am pretty but that I’m not going to put life on hold until I lose weight was a real revelation to her- she very much sees things as either/or. So it’s not possible for me to be pretty AND overweight in her mind, which seems pretty typical for our society.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "In fact, I think that saying the kid internalized fatphobia is flat out wrong, she said exactly what someone who is NOT fat phobic would say.  Someone who didn't think observing someone's weight was an insult.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Yeah - this is kind of a minefield. There has been a push to reclaim “fat” - both the word, and pride in self despite or because of one’s weight. “Fat is a neutral descriptor” is a phrase I’ve seen around. And that I agree with, although back when I was fat myself I would have been crushed to have been described that way. I wouldn’t love it today, either, but it wouldn’t hit home so hard. \n\nSo, you can’t go around using it that way, the way you would “tall” or “short” or “blonde” or “black.” We’re not there (yet) as a society, but if you’re raised in a household that does speak of fat as being neutral, and you lack life experience, how are you supposed to know?",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "It's rude to make personal comments, fat or thin, about people's bodies. It has nothing to do with how one takes it. It's still rude.",
                  "id": 128,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "I don't understand this, either! If the child had said something cruel or untrue eg \"you're as big as a house\" THAT would be an insult. If we're all supposed to be okay with our bodies as they are (which may well be how this girl was raised to think) then she'd never see it as insulting. And the fact that OP does makes her the fat phobe, not the kid, who clearly meant no harm.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This is exactly what I came on here to say. We talk about how we're so fatphobic yet we get insulted by mere facts. There is nothing wrong with being a bigger woman just like there is nothing wrong with being a smaller woman. I get called a smaller women at times and it doesn't offend me, so why should it offend her that she was called bigger, is the volume to surface area ratio of her body really that insulting to her ? Maybe she's inherently fatfhobic herself. Anyone who thinks the teenager was being rude is an idiot. Observations are not rude. She woukd have been if she used a derogatory term, but she did not. \n\nAlso, in many cultures, there's a positive connotation with saying bigger. It means you are well fed and \"rich\"  not everyone is insulted by it.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 435,
              "content": ">Her own mom or dad might say they're bigger because of the other spouse's cooking or constantly remind her daughter about food habits. She could be on the spectrum or also be socially awkward, who knows.\n\nWe had a joke with my grandparents being bigger and all the good food they had that their house was \"the fat house\" they were the ones who started it when we used to stay the weekend and gain like 5 pounds lol. \n\nI'm on the spectrum if a situation had come up for me to make a similar statement towards another when I was around 14 I probably wouldn't have seen anything wrong with it either. \n\nHonestly to me it seems \"this is so good I can see why you're larger\" is a compliment, but OP (and most of society) has internalized fatphobia and assumes whenever someone mentions their size it's negative.",
              "id": 131,
              "comments": [
                {
                  "score": 123,
                  "content": "Of course I read it as an intended compliment. Kind of like how being bigger was a sign of wealth- because you could afford hearty foods to be able to put on the weight. If she had a problem with it she should have said, \"Hey I know you might not have meant anything by it, but stuff like that hurts my feelings. Even if I was bigger, I don't want my weight discussed at the table like this. Would you please not do that again?\"",
                  "id": 132,
                  "comments": [
                    {
                      "score": 25,
                      "content": "I think like others have said, it should have been brought up when the friend said it and not after.  Awkward kids are always afraid that everyone remembers every little fuck up they make, going over it now would just internalize it in her head and make her fear saying anything at OP’s house.\n\nIf it happens again, saying something like “that’s not very nice” or something to acknowledge that you don’t appreciate people commenting on your weight (and having your husband on the same page that it’s not ok) will help the kid learn that it’s not acceptable and they can grow from it.  But right now all OP is doing is denying their daughter a friend.\n\nOP is the adult here, and it seems like her insecurity about her weight is more important than her daughter making friends.  I’m not saying that what the kid said is ok, but as the adult you need to move past it and use it as a teaching moment if it happens again.",
                      "id": 133,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "As the fatter parent who is trying to maintain the outward appearance that size is not an issue (don't want the kid growing up thinking fat = bad like we all did) I would have made some equally lame joke agreeing with her to de-awkward the situation and then secretly cried about it later.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 144,
              "content": "This is the comment! I wish I had an award to give ya! The comment didn’t sound hateful—just observant. And because of the way we view fat people in society, it was taken as offensive. She’s only 14 and socially awkward, so it’s possible she doesn’t realize yet that it’s not okay to comment on other people’s bodies even in a way she perceives as neutral. But it really didn’t seem mean spirited to me in the slightest. YTA for harboring resentment towards a teenager.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 249,
          "content": "A simple, “ Now Jan, we try not comment on peoples weight or sizes in this home but you are right, my husband is a fantastic cook!” Or even “a talented man in the kitchen makes for a happy well fed woman” as a joke and it would have been fine. Her not saying anything and stewing was in fact NOT letting it go. It’s clear she is passive Agressive, struggles to communicate healthy boundaries and is harnessing her own self image insecurities. Which is all fine and normal but take it out with a therapist not your daughters first friend.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 188,
          "content": "That was my thought.  Expressing, even the next day (so you don't say something out of upset) to ask for an apology isn't an A-Hole but holding onto it for months is ridiculous. She's 14. Do you not remember being 14? And saying or doing things that were dumb? I can and I cringe at my moments. \n\nAlso, I think YTA...for judgement sake.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "Completely agree with the above, YTA and you missed your moment to teach both girls and your son how to handle the situation. Address it up front or be passive aggressive (AH) to a 14 y/o. Again, 14 y/o.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Holding a grudge against a teen is what got me. \nOP, I hope you realize you are wrong and allow your daughters friend over.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Agreed and id like to add that even if OP did not ask for an apology per-say she could have taught her that that kind of comment is not usually perceived well and can be hurtful to some. Maybe this child has had someone in her family say things like this and they laugh it off unlike OP.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "You’ve hit the nail on the head. That was the perfect opportunity to calmly say, “sometimes, just because something comes to our head, that doesn’t mean it should come out our mouths.” Lesson done. Really, to hold a grudge against a 14 year old girl who was only trying to compliment, just isn’t healthy. OP, YTA.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I think she should have been more helpful than that, as a parent of an awkward kid and done something like \"I don't think you meant to hurt my feelings, but commenting on my appearance did that. You should steer clear of commenting on other people's bodies, especially as a joke topic.\" Boom",
          "id": 142,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "And even instead of just \"that was rude\" she could have turned it into a teachable moment by saying, \"It's not kind to ever comment on somebody's body unless they explicitly ask us to.\"",
          "id": 143,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 20328,
      "content": "YTA. Stop it.\n\nYou're the adult here; don't pick a fight with a 14 year old child. It's clear this kid didn't mean to upset you. Do you really want to sabotage your own child's friendships because of your ego? You don't 'need' an apology. You need to act like an adult and shake it off.\n\nEdited to add:\n\nI also think it's pretty disgusting that you're putting your daughter in the middle of this. Because you didn't properly address the perceived slight at the time, you now expect your daughter to tell her friend she has to apologise to you while you sit on your throne and wait.",
      "id": 144,
      "comments": [
        {
          "score": 4904,
          "content": "Her arch nemesis is a 14 yo named Katlynn LOL",
          "id": 145,
          "comments": [
            {
              "score": 509,
              "content": "Listen, when you’re both vying to become the head of Kabletown things get dicey.",
              "id": 146,
              "comments": [
                {
                  "score": 34,
                  "content": "The ocean is for tools!",
                  "id": 147,
                  "comments": [
                    {
                      "score": 38,
                      "content": "The ocean is awesome and for winners! You’re for tools.",
                      "id": 148,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "Wonderful reference",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I don’t even get this reference but sounds hilarious",
                  "id": 150,
                  "comments": [
                    {
                      "score": 20,
                      "content": "30 Rock",
                      "id": 151,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "With 1 y *but it's not where you think*",
              "id": 152,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Britknee vs Kaitlynn",
              "id": 153,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": ">Her arch nemesis is a 14 yo named Katlynn LOL\n\nliterally my mom with a girl named Amanda from when i was in the middle school LOL \n\nAmanda and i used to beef over a guy we both liked... like literally the dumbest shit ever and the most typical 14 year old fight ever, yet my mom made it her whole will to hate this girl. so fucking weird",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1782,
          "content": "OP should be the bigger person",
          "id": 155,
          "comments": [
            {
              "score": 1582,
              "content": "You owe OP an apology in a few months.",
              "id": 156,
              "comments": [
                {
                  "score": 177,
                  "content": "🤣🤣🤣",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I wish I could award this comment lmfaoooo",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Absolute gold",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "best comment ever",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yeah, she needs you to understand how rude you were…",
                  "id": 161,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Deceased.",
                  "id": 162,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 307,
              "content": "she is...",
              "id": 163,
              "comments": [
                {
                  "score": 119,
                  "content": "I’m glad someone else said this because I didn’t want to be an asshole.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "That's the joke.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "whoosh",
                  "id": 166,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 143,
              "content": "She could have been the biggest person at the dining table but sadly it didn't affect her maturity",
              "id": 167,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "I’m rolling",
              "id": 168,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "This.  Exactly.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "I think op needs to apologize to the 14 year old for not having her over, just a simple “my feelings were hurt when you said x. However, I’m sorry I acted on my hurt feelings. You’re welcome to come over, we just ask that everyone treats each other with respect”",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "With this kind of behavior, it’s kind of no wonder that her kid is shy and introverted. Can you extrapolate what mom must be like if she holds this grudge for this long? Yikes.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yep! 14yos can definitely be malicious but even OP doesn’t seem to think that was the intention here. If it’s repeated then perhaps that’s when she needs to bring it up.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I recommend OP allows the girl to come over. Then, once she's in the house, her plan for a sting operation by the cops is put into place and the girl is arrested for being an awkward teenager. THROW HER IN PRISON. \n\nOP. Your need for an apology is just as ridiculous as the scenario above. YTA",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "Op is socal awkwardness like me, and like my mom she's putting all her issues onto her daughter. Who happens to also be introverted like I am. \n\nI'd wager a guess op is socially awkward at best and at worst is emotionally immature like my mom. \n\nIf it is then op will not be able to see her error as all others must read her mind and know what she wants. Her moods dictate evreyhing and last but not least, she does not care about anyone but herself becouse she can't. \n\nDue to this all issues with my friends where I was \"awkward\" was actually her making it awkward for me. \n\nMy introverted Ness was a defenceman mechanism to keep her away from my friends. \n\nI recommend op seek thearipy before she ruins the relationship with her daughter like mine did with me. \n\nHopfully that made since I dident proof read this.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This, this is the answer right here. The woman is grown and needs to get over herself. Also, if she's upset at a 14 yo's opinion of herself, there are obviously bigger issues going on in her life that she's not willing to admit- And now she's letting it all land on this one comment.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14512,
      "content": "As a bigger woman myself, YTA. Kids say dumb things. \n\nOnce a kid came up to me in the mall and said, “Ewwww, you’re fat!”  I responded, “Ewww, you have brown hair!”\n\nShe ran off crying to her mother.",
      "id": 176,
      "comments": [
        {
          "score": 3901,
          "content": "Why did I laugh so hard at your reaction? 😂",
          "id": 177,
          "comments": [
            {
              "score": 843,
              "content": "I practically spit out my coffee 😂",
              "id": 178,
              "comments": [
                {
                  "score": 345,
                  "content": "I imagined u/vavamama has brown hair too, and it made it all the more funny!",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "Ewww you're drinking beans!",
                  "id": 180,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Bitter bean soup 😣",
                      "id": 181,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1927,
          "content": "My kid said “I love my poofy pancakes because they’re like mommy’s poofy belly.” Obviously he’ll be grounded for a month /s.",
          "id": 182,
          "comments": [
            {
              "score": 684,
              "content": "When I was a kid, I used to say that I didn't understand how the kids with thinner mommies felt. My mom is on the chubby side, and I loved her cushiony embrace!\n\nETA: Thanks for the award, kind stranger!",
              "id": 183,
              "comments": [
                {
                  "score": 339,
                  "content": "Same here!! I always called my parents squishy and said it must suck for the kids with skinnier parents.",
                  "id": 184,
                  "comments": [
                    {
                      "score": 509,
                      "content": "I personally got offended when my dad lost weight. I think I was a toddler and I cried that he didn’t have a jelly belly pillow anymore lol. My poor dad felt so bad. It was not good weight loss encouragement",
                      "id": 185,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Omg my kid (9f) calls me squishy now. And proceeds to jiggle everything that jiggles and hugs me. It sometimes makes me sad, the brutal honesty. BUT she is in no way being mean...she genuinely loves that I'm squeezable. And I do remind her that talking about my belly is fine, but to understand that others may not like their jiggles and not want them pointed out.",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 241,
                  "content": "When I was, like, 9 I told my uncle that his son looks like Frankenstein. Not knowing that basically likened my new baby cousin to n ugly monster. 🫠 What I meant when I said it is that his hair stood up to create what looked like a flat surface and that shape, for whatever reason, reminded me of the top of Frankenstein's head. 😂",
                  "id": 187,
                  "comments": [
                    {
                      "score": 26,
                      "content": "🤣🤣🤣🤣 that's hilarious!",
                      "id": 188,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Don't feel too bad. Frankenstein is the name of the mad scientist, not the monster.",
                      "id": 189,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Yes! My son told me I’m not comfy like nana 😂",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Same, but with my dad, as my mom left me a while ago. I'm glad I'm not the only person who feels more comfortable hugging people with bulky bodies, thin people hugs are like hugging sticks. Weird af.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "[deleted]",
              "id": 192,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "My 9 year old son tells my wife when he hugs her that he is sorry she is chubby he must have forgot to move everything out when he left her belly.",
              "id": 193,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "My brother as a toddler loved to rub his hands on my mom's shins when they were stubbly and say \"Cactus legs!\". Kids are so weird haha",
              "id": 194,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Jesus. Just grounded? Obviously it's time to put that kid up for adoption. They sound absolutely unruly. /s",
              "id": 195,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Ha my daughter told me that my breasts were wrinkly and tried to lift them up to where they should be 💀 I laughed.",
              "id": 196,
              "comments": [
                {
                  "score": 6,
                  "content": "Omg that’s amazing. Mine thought my chest was my “2nd stomach”. Kids are so silly",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Omg. I just remembered when my I was younger , Maybe 4 or 5my mom had some red spots/moles on her face and I told her that a cooked flour tortilla reminded me of her face. Jesus",
              "id": 198,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "My kids come from the other room to randomly pinch my tummy “its so squishy” they say.\n“Yes it is. Because I carried you 2 monkeys in it for 18 months combined.”",
              "id": 199,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "My kid called me “ancient” when he learned what that word meant. He was so proud to use it correctly. He’s right, compared to his friends parents, I am old. Now, he’ll be 12 & he roasts me constantly.",
              "id": 200,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "When I was a child, my mom used to braid her hair and put it up in two buns on the sides of her head. Whenever 5-year-old-me would draw pictures of her, I would draw her as a bear with two big fluffy ears, because big fluffy bear ears are what hair buns looked like from down here, 3 feet off the ground. \n\nKids just do things like this, they're not insulting their parents in any way. They're expressing love!",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1187,
          "content": "I had one of my kids friends (admittedly only around 7-8) jiggle my belly in the summer and ask if it's full of pizza or ice cream.\n\nI just jiggled it harder and said \"both\" and we both laughed.\n\nKids say stupid stuff. Yes, we lay more accountability on them as they get older, but even at 14, they're still kids and still say utterly stupid stuff, sometimes. \n\nHell, I'm 37 and I say stupid stuff a lot.\n\nOP missed the intent behind what was said and got stuck on:\n\n>The girl had just leveled a completely uncalled-for insult at me.\n\nwhen she really didn't. There was no ill intent, no malicious name calling, she just put her foot in her mouth and said something daft.\n\nOP's inability to brush it off kinda of makes me think that she might be the reason her kid is socially awkward and struggles to know what to say to people.",
          "id": 202,
          "comments": [
            {
              "score": 159,
              "content": "Yes, my child is socially awkward and his dad has NPD, that is not a coincidence.",
              "id": 203,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 103,
              "content": "I wonder if OP is sabotaging her daughter socially so her daughter will remain dependent upon her. Maybe not consciously, but this woman is not well-adjusted. It's in the realm of possibility.",
              "id": 204,
              "comments": [
                {
                  "score": 8,
                  "content": "'Oh the audacity! How dare she level an insult at me by complimenting my husband! Oh!'",
                  "id": 205,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 96,
              "content": "This is a good point. It wasn't an insult. It was a statement of fact. Being bigger isn't a bad thing and this girl wasn't referring to anything negative. The husband's food was good, the wife appreciates it,  as did the friend. You eat more, you weigh more, and none of that makes someone a bad person. It feels like much more internal fat phobia on the OP, which is engrained in pretty much all of us, but kids lately seem to be moving towards more and more acceptance of all sizes and that's probably where she was coming from",
              "id": 206,
              "comments": [
                {
                  "score": 11,
                  "content": "That’s what I thought too!\nHad she said “This food is shit I get why you’re so skinny”, no one would have taken that as an insult (except for the chef lmao). It’s just about “fat” being a bad word, which shouldn’t be, rather than the sentence actually being an insult.\n\n(From the perspective of a fat person who had actually been bullied a lot because of it.)\n\nEdit: typo",
                  "id": 207,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "I also think it's actually more common in media *now* to just be more accepting of weight on people. There can be more gentleness and silliness in certain conversations around weight. I love that people are more often embracing their \"bigger\" selves and recognizing that we only have one life to live and it's not worth tearing ourselves up about a beauty ideal that is only promulgated so that we hurt ourselves. In another context, the kiddo might have said that and everyone laughed and said, \"You bet!\" The OP can feel how she feels, for sure, but forcing a huge embarrassing apology out of the teen is just not worth it. Will she really feel better to have a teen humiliated in front of her? *Really?* If so, that's some shit to work on in therapy. But, this is all something to work on in therapy. She should do her best to welcome this friend who her kiddo likes with open arms and she should reinforce to her kid that she is a safe parent who isn't going to hold a grudge and be weird for years. C'mon.",
              "id": 208,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Not only was there no ill intent, she was actually trying to give a compliment to the dad!",
              "id": 209,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "YESSS op needs an autism screening herself",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": ">Hell, I'm 37 and I say stupid stuff a lot.\n\nThis! A million times this! People, not just children say shit all the time that doesn't land, is misconstrued, or was unintentionally meaner than they intended. \n\nNow most of the time we catch ourselves and immediately apologize and back it off a bit. But, if you are taking a comment from a teenager to heart and holding a grudge for months that is most certainly a personal problem.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I have big teeth and when I was like 15-ish my dad took me to his friends house. The friend had a couple of kids. Like 6-ish and 9 or something. We were eating a snack and the younger boy goes “I love carrots!” And I said “me too!” And he had a big cheery smile on his face and said “yeah and you have really big teeth to eat them with, too!” And I could tell he meant no harm even though the words stung because I’ve been made fun of for my big teeth my whole life. I smiled and said “yup, I do!” And we moved on. The kid was smiling and dancing around eating his carrots. And I don’t even like kids, but I knew it wasn’t a big deal. \n\nI know that’s a bit different, but the thing is that OP’s an adult and the “insulter” was a child. Get over it, apologize to your daughter and husband and let them know you’re sorry. If you want, you can mention that your feelings are still hurt and you would like them as your family to acknowledge that and then you all move on. Don’t ruin this for your kid and don’t hold a grudge unless it deliberately happens again which at that point you can demand an apology on the spot.",
              "id": 212,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 227,
          "content": "Thank you for this laugh. I needed it!",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 55,
          "content": "LOL kids are brutal. OP needs to let it go",
          "id": 214,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "My ASD 5yo at the time went up to a bigger woman and told her “I love you, you have a pretty tummy”. Mind you, he was in therapy for selective mutism and almost never initiated talking to strangers. I was proud of his progress and also wanted the earth to just swallow me whole, lol.",
          "id": 215,
          "comments": [
            {
              "score": 21,
              "content": "I’m still getting used to my much more substantial post baby body, and I honestly think I would cry tears of gratitude to hear a child call my belly pretty 😭\n\nMy daughter does love  to pat it with her little dough ball hands and giggle at the jiggle, which is also helping me to love it more.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "As a bigger woman myself, I don’t even really see the term “bigger woman” as an insult. It’s a fact. It’s not like she said “no wonder you’re a fat cow” or “no wonder you’re a chunk” or even as graphic as the word “obese”. She’s a kid and clearly a bit awkward, just like OPs daughter. I can’t imagine being 37 and being so bitter about a 14 year olds comment. So much so that she’s going to put her own kid in conflict with her only friend.\n\nEdit: YTA",
          "id": 217,
          "comments": [
            {
              "score": 8,
              "content": "Exactly. It's just a fact, and some \"bigger women\" have no problem with their size. Also, not every culture gets touchy bringing up weight in conversation.",
              "id": 218,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "When I was 7, my grandmother (age 70) wore dentures. In private, she'd push her bottom dentures out of her mouth and let them hang on the edge of her lips and then pull them back in. I thought that was the coolest thing ever.\n\nOne day she had a gentleman caller courting her, and we all sat in the living room to talk with him. I got up and walked around the room jutting the bottom of my mouth out. When he asked what I was doing, I told him that I was pushing my teeth out the way my grandmother always did.\n\nI don't know if he ever visited her again, but I was never invited back to the living room to receive guests. She and I laughed about it years later.",
          "id": 219,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "Would you have taken it as an insult? I don't think the kid was trying to insult her, just state a fact. In awkward/spectrum kids you tell them that while what they said was factual that can hurt people's feelings. They truly don't comprehend until it's explained. \n\nBTW, you sound awesome!",
          "id": 220,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "That's an awesome response. 😭😂\n\nI had a little kid ask me why my teeth were yellow. I brush multiple times a day, floss, etc so I just said, \"I reaaaaally love coffee! It's so good!\" Then the kid said something about mommy loving coffee.\n\nKids don't mean to be rude, they just make observations about things in life and haven't grasped social graces of time/place/context.",
          "id": 221,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12266,
      "content": "YTA.\n\nIf 14 is old enough to apologize, 37 is old enough to communicate that at the time. You've taken an awkward moment that this girl probably wishes she could forget and made it into some huge issue. Have some grace, let it go, let her think it's forgotten. And let your daughter have a friend, ffs.",
      "id": 222,
      "comments": [
        {
          "score": 1903,
          "content": "This ^. The time to address her comment was at the time it was said.  A gentle comment in the moment and move on.  Sounds like the girl simply spoke before thinking and realized what she said after she said it.\n\nFor the sake of your kid, find your inner Elsa and let it go.",
          "id": 223,
          "comments": [
            {
              "score": 544,
              "content": "Yes. Even if OP had said something not right there in front of everybody, but shortly after to the girl in a gentle way. Something like “ you know we don’t really talk about peoples bodies like that. It could hurt somebody’s feelings. You’re a great kid so I just wanted to let you know this so you don’t inadvertently  insult someone in the future” and then just move on, change the subject so the girl doesn’t feel too embarrassed /awkward",
              "id": 224,
              "comments": [
                {
                  "score": 22,
                  "content": "So well said 👏🏻👏🏻👏🏻",
                  "id": 225,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "> find your inner Elsa and let it go.\n\ni'm soooo saving this line to use one day",
              "id": 226,
              "comments": [
                {
                  "score": 31,
                  "content": "“Find your inner Elsa and bottle up your feelings until it destroys the economy!”",
                  "id": 227,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "I always say “make like Elsa and let it go” 😆",
                  "id": 228,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 528,
          "content": "I have anxiety and there are moments I said things that I then overthink every night for a decade when I'm trying to sleep. I get through it by convincing myself no one else remembers the awkward thing I said. OP is ruining that for me by clinging to this so hard.",
          "id": 229,
          "comments": [
            {
              "score": 156,
              "content": "Tbf most people really don't cling to things like OP does. From the title I was expecting something really awful, not a slightly awkward joke that was unintentionally offensive. In some families that joke would have been perfectly fine so it could be that the girl comes from a more direct family and didn't realise how much it would upset OP.",
              "id": 230,
              "comments": [
                {
                  "score": 26,
                  "content": "Yeah, my husband and I make jokes like that about ourselves all the time, so I'm careful to teach my kids that other people might get their feelings hurt by those kinds of things. But geez, 14 is awkward enough in general, let alone for a kid that's already struggling with social situations. OP could extend some grace.",
                  "id": 231,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Right, now I’m trying to think of who was present when I said awkward things in my life, and which of those people are more likely to post about it to AITA months later so my faults are aired to the world.",
              "id": 232,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I so relate!",
              "id": 233,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "For real!!!! OP, YTA! Fucking move on! Ffs!",
              "id": 234,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 359,
          "content": "This is so true. OP, I agree it was a rude comment. But you didnt say anything when it happened, so it is now water under the bridge. Let it go. \n\nLet your daughter have her ONE FRIEND and dont mess this up for her. This is way more important than your hurt feelings. You are a grow woman. Act like it. \n\nIf the friend is rude again, correct her gently in the moment, or not at all.",
          "id": 235,
          "comments": [
            {
              "score": 87,
              "content": "Her mother might be the reason the daughter is such an introvert.  The mother sounds completely overbearing.",
              "id": 236,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "And since the daughter was already tested for ASS, maybe the friend she found truly has it. Saying socially awkward things and bad timing is very much an autism thing.",
              "id": 237,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "It's fascinating that OP has considered her child might be on the spectrum, but could not extend this to another child.",
          "id": 238,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "The Mom is probably THE REASON why her daughter hasn't had a friend until now. I can just feel the anxieties and insecurities oozing out of the OP and downloaded onto her daughter. \n\nOP go see a therapist, get your life in order, and actually recognize what being there for your daughter is. \n\nAm I the only one noticing a trend of parents with insecurities/anxiety incorrectly projecting the Autism spectrum onto their kids? All kids are weird and socially awkward(not just those on the spectrum) it's up to you as a parent to help your kid get out of the awkwardness and it starts when they are babies... Just stop automatically assuming your kid has a developmental delay.",
          "id": 239,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I have a feeling it's not about the apology or \"owning it.\" She wants to rub this girl's nose in a mistake she made months ago. As someone who has an emotional eating disorder and dealt with weight issues as an adult, this feels much more \"I'm unhappy with myself and going to make others feel the same way for noticing.\"",
          "id": 240,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yep. I don't understand why it's so hard to just get past it. The kid didn't intend to insult her friend's mother at the table.",
          "id": 241,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4758,
      "content": "YTA\n\nTeenagers say dumb things. And the time to correct it was in the moment.\n\nLet the faux pas slide, but if it happens again, explain why it isn't ok to joke like that with you.\n\nThis is your daughter's friendship, keep the peace.",
      "id": 242,
      "comments": [
        {
          "score": 530,
          "content": "Yes to correcting it into the moment! Not harboring resentment towards a teenager for months",
          "id": 243,
          "comments": [
            {
              "score": 8,
              "content": "Even in the moment it would be like…yeah it wasn’t nice but it was clearly just a bad joke meant to praise the husband’s cooking. Shit happens and kids say dumb shit. Anyone who would demand an apology for that needs to stop taking themselves so seriously.",
              "id": 244,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "And also be an adult! Help them learn and navigate weird social situations! I am also 37 and as recently as last week said something in a social setting and then thought, “oops, shouldn’t have said that.” This is part of life, and OP is trying to punish a teenager instead of helping her learn.",
          "id": 245,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "THIS, I'm so glad my friends parents had the grace to let some of my more foot in the mouth moments slide when I was 14. these young kids are still learning.",
          "id": 246,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This happened to me as a teen with my only friend at the time. She insulted my dad and it flew over both of our heads because she didn’t mean anything harmful at all, then suddenly I was grounded for around a month and my friend wasn’t allowed over. I was punished for no reason, with my dad being weirdly mean to me and even used my guitar against me as a punishment. After like a month my mom finally told me it was because of what my friend said, and I believe that my dad still wouldn’t budge when my friend wanted to make it right.",
          "id": 247,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3954,
      "content": "YTA. Move on. You are an adult. It wasn't even a hateful derogatory statement. If anything, women of all body types are being celebrated in the media lately and at her impressionable age it might have been a well-meant, positive comment. \n\nLet your insecurities go. She's a teenager, not some coworker, and possibly one of your daughter's only friends.",
      "id": 248,
      "comments": [
        {
          "score": 1873,
          "content": "It totally shows the OPs internal fatphobia that she has taken \"bigger woman\" as such a horrendous insult. It's descriptive if she's bigger....so what? Why is it insulting? She's definitely the AH",
          "id": 249,
          "comments": [
            {
              "score": 472,
              "content": "It's more indicative of the woman being sensitive and self-conscious about her weight rather than fatphobic.",
              "id": 250,
              "comments": [
                {
                  "score": 267,
                  "content": "But if we boil down to WHY she would feel self-conscious about her weight, we arrive at internalized fatphobia. Society has taught her (and everyone else) that having fat on your body is bad and ugly, so she thinks fat in her body is bad and ugly. This is the definition of fatphobia. I’m not demonizing her for it, I think most people deal with fatphobic thoughts and feelings, I know that I sure do, but let’s call a spade and spade. It’s the first step to breaking down those fatphobic thoughts.",
                  "id": 251,
                  "comments": [
                    {
                      "score": 63,
                      "content": ">Society has taught her (and everyone else) that having fat on your body is bad and ugly\n\nNah. I didn't lose 100+lbs because society told me I was ugly. I did it because I hated being fat.  \nSociety didn't make me unable to tie my own shoes. My belly did.  \nSociety didn't make me out of breath after a flight of stairs. My weight did.  \nSociety didn't give me rashes in skin folds after ten minutes of sweating. My fat did.  \nAm I fatphobic? Yep. Sure am. I'm TERRIFIED of being fat again. I was sick, uncomfortable, in constant pain & unable to do the basic activities I enjoyed. I'm not fatphobic because of \"society, I'm fatphobic due to what having too much fat on my body did to my quality of life.",
                      "id": 252,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": "That's how I felt about it!",
              "id": 253,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 98,
              "content": "For real though! As a fat person myself I would have taken a comment like that in stride. Just own it. People will respect you a lot more for it",
              "id": 254,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 84,
              "content": "That’s a pot, that’s a chair, you’re a bigger woman. Sounds factual.",
              "id": 255,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "YTA - Even the title is so misleading. Teenagers can be MEAN, I was expecting her to be made fun of for her weight. Not a comment that sounds purely descriptive. Mom needs to get her ego out of this. The kid was not intentionally upsetting and the time to address it is not months later.",
              "id": 256,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "I taught high school for years. I always referred to myself as a bigger woman. It's not an insult at all. It's descriptive of body type.",
              "id": 257,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "It also sounds maybe like the friend’s parents have raised her trying not to body-shame others.  I know when my kids were little I tried avoid labeling people as “fat” or say anything derogatory about size one way or another.  I used terms like “bigger” or “heavier” as descriptive terms if needed (and to the inevitable “why” questions small kids ask, just tried to be matter-of-fact about energy intake from food vs energy burned in daily life and the scientific causes of weight gain).  This poor awkward kid may have had no idea a factually descriptive term like “bigger” would cause a grown-ass woman to hold a months-long grudge.",
              "id": 258,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "OP could have used it as a teaching moment about social grace and society's beauty standards and said something like, \"That's not a very polite thing to point out, but you're right, I'm not one to deny myself delicious food.\" But instead, she ended up being the most socially awkward and held an unspoken grudge against a 14 year old.  I'm not surprised her daughter is social awkward and made friends with another introvert when her mother is exactly the same.",
              "id": 259,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 229,
          "content": "Yes! I just said this to another comment. Her intent was surely to compliment dad, not insult mom. If she had said \"man if I ate here every day I'd be 1,000 pounds! ”... Same thing.",
          "id": 260,
          "comments": [
            {
              "score": 29,
              "content": "this!! my boyfriend says this all the time when we eat at others’ houses. nobody has ever taken offense to that- everyone is aware its a comment on how good the food is, never an attack on the people hosting.",
              "id": 261,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "This is what i commented too! Why does she see being bigger as an insult? It means her husband cooks very delicious food, it's a compliment.  \nIf she sees being big as an insult, she has other issues to address",
          "id": 262,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "> You are an adult.\n\ntechnically!",
          "id": 263,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "First of all, my intent is not bashing on any of those types mentioned here.\n\nThis is the comment I was looking for. How is it rude? She just pointed out that she is a bigger person (didn't even call her fat) while trying to make a joke and people are commenting that it was very rude and what she said was dumb and stuff. It was OP who got extremely sensitive about it.\n\nPeople here act like this is a big deal (or some deal), then think that telling skinny people to eat more is a completely normal thing. Mind you, these are the same people who go \"but wHat iF gEnDeRS wERe RevERsEd?!!?\" at man-woman questions, or \"wHaT iF thEY WeRE BLaCk?!!\" at black-white questions. So why aren't those said here?",
          "id": 264,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "I agree, I don’t really think it was a rude comment. She didn’t say she was ugly, gross, or anything. Just bigger. And bigger because her husbands food is delicious, which in my mind is really loving and sounds like a great relationship lol",
          "id": 265,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "My thoughts exactly! What’s wrong with pointing out the truth if it is the truth? I love food, I am bigger. It’s no secret to anyone and my man loves both of those traits about me! I don’t see anything wrong with what she said. OP YTA",
          "id": 266,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Thank you! Finally! Why is this being perceived as such a huge insult? I don't get it!",
          "id": 267,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2120,
      "content": "Are you really going to prevent your daughter from having this one single friend because she called you fat? Is this the hill you wanna die on?....I'm also really introverted and can confidently tell you that this will prevent your daughter from having the courage to make other friends because this is how you react to kids trying to make a joke. Their brains are still developing and sometimes they can't control what just comes out of their mouths.",
      "id": 268,
      "comments": [
        {
          "score": 661,
          "content": "and she didn’t even call her fat, she just said she was bigger. “fat” has such a negative connotation in today’s society so it would be understandable to get offended by that, even if it’s just a descriptor.\n\nmy boyfriend is fat, he says he’s fat. when he eats good food at a host’s, he says “man i’d be twice as big if i ate here. i’d be so fat!”",
          "id": 269,
          "comments": [
            {
              "score": 32,
              "content": "She clearly meant it as a compliment too. Op is an idiot.",
              "id": 270,
              "comments": [
                {
                  "score": 23,
                  "content": "This. The remark seems more positive than negative. It signifies how the husband is capable of keeping his family well fed and rested!",
                  "id": 271,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 183,
          "content": "Yep. Daughter will grow up thinking \"I had a friend once but my mom wouldn't let her come over.\"",
          "id": 272,
          "comments": [
            {
              "score": 17,
              "content": "If she's that introverted and gets reactions like this from her mom, I wouldn't be surprised if she didn't try to make another one :(",
              "id": 273,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "no one called OP fat, except OP’s ego",
          "id": 274,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "And she didn’t say fat, she said “bigger woman” which I perceive as her trying to be polite TBH especially if she is also socially awkward",
          "id": 275,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I am fat. Like, fat. If a kid said this to me, I would handle it the way I always do when a kid says this to me, because they are just kids. \n\n“You’re right, I am fat. I am okay with being fat, but some people aren’t, just like some people who are skinny don’t feel good about that. That is why it is best to not comment at all on anyone’s body.”\n\nLike, what an easy thing to do.",
          "id": 276,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I dont even think the kid was trying to make a joke. I think she was trying to complement the cooking skills. Good cook = eat lots = bigger woman i think was the logic behind that one.",
          "id": 277,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Also could lead to resentment from daughter and end up being the start of a wedge between mother and daughter.",
          "id": 278,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1773,
      "content": "YTA. You said your daughter is socially awkward to the point of having her tested. Birds of a feather flock together. This girl absolutely did not mean to insult you. \n\nYou, as the adult, should have and could have used the opportunity to talk about appropriate comments and kindness but instead chose to ignore it. \n\nI think inviting her into your home is appropriate especially if this is your daughters only friend. If you feel so inclined, let her know how the comment upset you and moving forward you’d appreciate if any jokes were made not involving anyone’s weight in the house. A healthy boundary to set.",
      "id": 279,
      "comments": [
        {
          "score": 371,
          "content": "If she meant to insult she could have said fat tbh. She was paying the cook a compliment and depending on the receiver what she said wasn’t insulting. But to someone trying to lost weight I can see it being a bit hurtful. Move on from this. YTA",
          "id": 280,
          "comments": [
            {
              "score": 5,
              "content": "Exactly, when it’s a magazine cover “bigger” women is a compliment, when it’s your daughters only friend it’s a unearthly insult",
              "id": 281,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "Yep. As she was saying it, she probably even thought it a compliment to dad's food.",
          "id": 282,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1691,
      "content": "She called you a bigger woman and complimented your husband’s food. If this is a fact I can’t see how she was being insulting, you’re just being over sensitive. I’m an obese guy, if someone points that out to me with no malicious intentions how on earth am I going to demand an apology for stating a fact? Your husband is right. Get over your bruised ego for your daughter’s sake. Is it an insult to say someone is tall, short, curly-haired or brown-eyed? She didn’t make fun of you. Why should you get an apology?",
      "id": 283,
      "comments": [
        {
          "score": 485,
          "content": "That's what I think too! It wasn't like she said 'wow, you obviously enjoy eating cause you damn fat'. That would have warranted instant anger and an apology. Is there a more pc way of saying someone is a little heavier? I think the friend was trying to give a compliment and didn't realize you had such strong body issues.",
          "id": 284,
          "comments": [
            {
              "score": 23,
              "content": "I don't understand how people can live when someone state a fact about them with no malicious intent and take offense. If it's true then is a fact, don't get bad about the truth. If it's a lie, then why would you get bad about it? It is not true, just correct it and continue with your life and brush it off. That's how I usually live my life and almost nothing makes me mad, because is either a lie or my fault, nothing to be offended about.",
              "id": 285,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 163,
          "content": "I had this exact same thought. It doesn't sound like it was intended as an insult and it's only insulting because OP is not accepting of her weight. It says more about OPs insecurity than anything.",
          "id": 286,
          "comments": [
            {
              "score": 18,
              "content": "this makes sense. if OP was body positive about herself she would have laughed right along and said something like, “i know, right? who wants seconds!” \n\nbut there seems to be insecurity here. insecurity that may have been passed onto the daughter which is why she seems to have such social awkwardness such to the point of having only one friend.\n\nthe kid knew she fucked up, that’s why she got quiet. she was actually trying to make a joke and be nice. \n\ni would have said N,T,A if it was another woman or man OPs age who made that comment, but it was an awkward kid. i also immediately thought N,T,A bc I’m body conscious. but it’s a kid.\n\nOP, set a good example and let it slide. I’m sure you’ve made a social gaffe before. it’s okay.\n\nif you’re conscious about your weight then do something about it. good luck and don’t let this ruin your day!\n\nYTA, but i get where you’re coming from.",
              "id": 287,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "This. \n\nI gained weight being with my partner. I'd never been overweight before but no one said anything when I was scary underweight. My grandmother recently made a comment that I gained weight and all I could say is \"[partner] is a damn good cook.\"\n\nNo hard feelings anywhere. She was right. I am fat, loved and well-fed. At worst I shot down her fatphobia with my own happiness and at best we both acknowledged that love sometimes looks like a few extra pounds.",
          "id": 288,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Right, this is definitely an introverted, possibly on the spectrum girl trying to communicate that she loves the food and it just came out weird because that's what kids, introverts, and people with ADHD and/or autism do! And who knows how many of those descriptors happen to apply here, but it is possibly all of them but if not it is at least the first two.\n\nI am still mortified to this day about things I said as a kid that I didn't realize sounded mean or rude. This girl will remember this situation for literally the rest of her life, when it could have been remembering wonderful moments with her friend. \n\nI have run into situations like this countless times where a person will think I am making a judgement about them when really it is just an observation or statement with literally no judgement. But unfortunately we live in a society that equates \"being a bigger woman\" with \"not valuable, very bad, etc\" and so that is all OP heard when her daughter's friend said that.\n\nOP I IMPLORE you to please understand that it was a mistake, she likely did not mean to sound judgemental, and your daughter is the one ultimately suffering for not getting to enjoy her ONLY FRIEND. And if you do decide to have her over again, and the friend seems untalkative, do not interpret that as rude either; she is embarrassed and doesn't know how to talk to you anymore.",
          "id": 289,
          "comments": [
            {
              "score": 8,
              "content": "On the Great British Baking Show, Mary Berry compliments a baker by saying \"Your friends and family must be very plump.\" And I thought it was the BIGGEST compliment you could give. It just meant they enjoy what you make so much they continue to eat it. The child probably wouldn't have made the comment if they thought being plump was something to be ashamed of. If OP would have responded, \"I know, right! He takes good care of me!\" it would be a different scenario. Maybe in the child's mind she was thinking about how she hates to eat at home because her mom's a bad cook, and that lead her to observe that OP is a little bigger, therefore she must enjoy the husband's cooking also. **The poor awkward child was actually trying to bond with OP over what a great time she was having.** I hope OP continues to let the friend come over and maybe one day it can be a joke between them.",
              "id": 290,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Ya my uncle is extremely socially awkward and it doesn't help that he had a stroke a while ago so he struggled to talk a lot. \n\nFirst time he saw me in a few years he just goes \"oh wow you've gotten fat\" and I laughed so hard because ya I've definitely put on like 40 lbs and I knew he wasn't trying to be rude at all",
          "id": 291,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}