{
  "post content": "My daughter just turned 6. We had a birthday party for her on Saturday. That morning was pretty hectic. I was outside setting up and suddenly my wife comes outside yelling about how the grocery store screwed up the birthday cake and I didn't notice.\n\nAll that happened was that they spelled our daughter's name as \"Sarah\" and it's \"Sara\" and I said, \"who cares, just scrape off the H\" but she insisted on returning it. So I said \"fine whatever.\" And then as she's leaving she says since I screwed up already I should make upfor it by finishing the decorations. \n\nAnd I go into the kitchen and I ask my daughter, \"what's the most important thing?\" She says \"the gift bags.\" I found all the candy and toys and what I thought were the bags they were supposed to go into. So I make up the bags, my daughter helps, and she thinks they look great and she's happy with them.\n\nMy wife comes home and takes over, satisfied by the new cake and the attempt I made at helping. So a little while after that, the guests arrive. The day went pretty well until the end. My daughter reminds us that they need to hand out gift bags. My wife panics thinking she forgot about them, but she says \"dont worry, dad made them\" and she looked so relieved until I got the box. She looked inside an was horrified\n\n\"What the fuck is this?\" she whispers. And she thrusts the box back at me and rushes to the bedroom. I follow her and find her sitting on the bed crying. She's SO embarrassed. Why? She wont say. I'm not sure what to do because people are trying to leave and they're confused as to whats going on. I then I just take over \"goodbye\" duty and hand out the bags to kids at the door and say bye with my daughter.\n\nWell halfway through doing that my wife came back out and took the box from me and brought it into the bedroom and threw it on the ground. wtf? she finally tells me \"those are dog poop bags\" and basically I'm stupid and I've ruined all the hard work she put into the party.\n\nwell, reddit, they dont look like \"dog poop\" bags. they're just small pink bags with hearts on them. who really cares? I tell her \"It's not like they're dirty. they're small bags like any other bags\" and damn it she freaked. She says she's so mortified she doesnt even want to show her face at the school anymore.\n\nSo yeah I've been bringing my daughter to school every day this week (which has been making me late for work). my wife will barely even speak to me even though my daughter thinks everything was fine. she laughed when i told her they were really dog poop bags. my wife got even more mad at me for telling her. I told my wife she needs to chill and she basically said I was a huge asshole and she's mad that I dont think it's a big deal. and I still dont. Actually, I think I'm the one that should be mad at HER for keeping this going for almost a week.\n\nSo, Reddit, AITA?\n\nTL;DR: I used dog poop bags as goody bags by accident for 6 year old daughter's bday party",
  "id": 1,
  "comments": [
    {
      "score": 13707,
      "content": "YTA, not only for using poop bags but for being so disengaged with what's going on in your own home.\n\n1. They misspelled your daughter's name and you didn't notice or care. Birthdays are a BFD to a 6-year old.\n\n2. You asked your daughter what was the most important thing. This is her birthday, and you put the onus on her to tell you what to do. Why do you have to be told what to do at every step? Have you never been to one of your kid's friends' birthday parties? Think for yourself what has to be done!\n\n3. You describe your contribution as \"the attempt I made at helping.\" Definitely makes it sound like it was your wife and child's thing, and you were only there to help. You weren't part of it.\n\n4. The fact that you didn't realize that you put the gifts in poop bags implies that you didn't know they were poop bags. Which implies you never walk the dog or pick up its poop. Which implies your wife does that too.\n\nSo it sounds like she does everything around the house and for the family, and you're just a part-time disengaged participant. My guess is that if you were planning the birthday party alongside her, and taking care of all the little problems along the way, she wouldn't have minded if using poop bags for the party bags was your way of working around the situation where you forgot to buy party bags. In fact, she might have laughed at your creativity. But it sounds like everything is always on her and you only do things if you're directly told.\n\nIf you didn't want to be an actual part of a family, you shouldn't have started one.\n\nEdit: So after 10 years on this site, this is far and away my most upvoted (and I assume downvoted) comment ever. There were a lot of responses, more negative than positive, so rather than reply individually, I'll explain a bit more here.\n\nFirst off, there were a lot of comments calling me a cunt, bitch, or worst of all, a Karen. One person said they could tell my gender just from my post. Someone else said that I have no idea what it's like to be a father. Well, I hate to break it to you guys, but I'm a dude. A father dude with 2 teenage daughters.\n\nI think one reason for the harshness of my reply is that I was just like OP when my kids were younger. In fact, I'm probably more like OP now than I care to admit, but I'm trying to be better. I was the sole breadwinner for the family, so I had a sense of entitlement that my wife should handle all the domestic stuff. To some extent, that was fair. I was at work, and she was at home raising the kids. It's something we agreed upon since I had better earning potential and we wanted our kids raised by an actual parent instead of a nanny. But I took that entitlement too far. I disengaged from the household stuff to a point where I missed out on being part of my family. Being a partner on the household stuff can be a pain to be sure, but it's part of being a family. I think my tone was intended to grab OP by the shoulders and shout, \"Pull your head out of your ass! You're missing out!\"\n\nThe idea of just \"helping\" with stuff like this reminds me a lot of when people say that fathers who are home alone with the kids are \"babysitting\". No, they're parenting. If you're just helping your wife execute this party, it's the equivalent of babysitting rather than parenting.\n\nOne last clarification on point #2, since that was the point that a lot of people who otherwise agreed with me disagreed with. It's really hard for a 6-year old to know what the most important thing is. All she knows is that she wants a party. She should not be setting priorities like a client or project manager. If you were running up against time constraints, you could say something like, \"Honey, we were hoping to do all of this stuff for your party, but you know what? We ran out of time! I still need to make party bags, put up streamers, and hang up balloons. I'll try to get them all done, but if I can't, which one of those things is most important to you?\"\n\nOP, I'm sure your wife doesn't expect you to be perfect. Mistakes happen. But you seriously give off a vibe of just doing what you're being told and not being an active participant.",
      "id": 2,
      "comments": [
        {
          "score": 1339,
          "content": "Whoa.   \n\n1.  Okay, he didn’t notice the spelling mistake at first.  Okay.   But *when it was pointed out*, he responded by *offering a solution*. \n\nHis wife’s solution was “I am going to abandon all party preparation and go back to the store and demand that *they* fix this.\n\nOP’s solution was “We can fix this ourselves, because it is not a huge mistake and it is easily repaired with a butter knife.”\n\n2.  His wife chose her solution, which left him with every element of preparation now to do alone, because she was no longer there.   So he asks his daughter, *the birthday girl*, what is most important *to her*.   This is an example of *putting her desires first*, which is *good parenting*.   He didn’t guess.  He didn’t assume he knew what she wanted.  He didn’t assume he knew better because she was a child.   He asked her, and gave her a voice.  \n\n3. This is maddening given the content of the post.   OP has done nothing but try to participate fully, and be told he’s doing it wrong.   \n\n4.  Seriously?   I have a dog.   Most of the poo bags I have are green or black.   If I saw bags like this, would not assume they were poo bags - particularly if they were not, as OP says, the usual colour of his dog’s poo bags.   *More importantly*, it actually doesn’t matter if they are or not - they’re clean, they’re pretty, and it’s a good stand-in if they don’t have anything else.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8620,
      "content": "Info - I know everyone is siding with you, but I need to play devil's advocate. How much of a contribution did you make to the party? Is it possible she's pissed because you were barely any help and then screwed up the two things you did do?",
      "id": 4,
      "comments": [
        {
          "score": 3748,
          "content": "This is definitely how I’m reading it. She may have overreacted but it seems entirely possible that she did so for a reason. Clearly she poured a lot of effort into wanting this party to be perfect and the dad seems to have a slight air of not giving a crap.",
          "id": 5,
          "comments": [
            {
              "score": 849,
              "content": "If it’s for a reason, it’s not an overreaction. The word “overreaction,” is a control tactic to stop people from complaining about you.",
              "id": 6,
              "comments": [
                {
                  "score": 591,
                  "content": "I feel like this is a load of BS. If you’re upset, sure, cry, it’s normal to react to things. When you start throwing things down on the ground that’s overreacting.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 428,
                      "content": "Yeah, the idea that “overreaction” is some oppressive term implies that any emotional reaction to any situation is justified, which is absurd.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 274,
                  "content": "If I wail for 30 minutes after stubbing my toe, that's an overreaction, but there was also a reason for it. The reason simply doesn't justify the reaction. That's what makes it an overreaction.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "What kind of bullshit is this. If someone cuts you off in traffic, sticking your finger up at them would be a reaction that might be commensurate. Shooting them is an overreaction, even though there was technically a “reason”",
                  "id": 10,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Not true! You can be mad at someone AND overreact. Learning to manage emotions is part of being an adult.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Lmao alright champ. You stepped on my shoe, so I'll kill your fucking dog in front of you. There's a reason, so it's not an overreaction!\n\nThere has to be some level of proportionality between the action and reaction. That's what the words \"overreaction\" and \"underreaction\" are for.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Except she didn’t kill his dog in front of him, she cried and expressed shame and guilt that her supposed life partner didn’t help at all and embarrassed her. Instead of acting sorry for embarrassing her, he complained about having to take his daughter to school for a while.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Wtf? So if somebody is called a mean name, and they beat the speaker within an inch of their life, that's not an overreaction? I'm just trying to manipulate them by saying it is?\n\nYou're a loon",
                  "id": 14,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "I think you’re overreacting about the word overreaction.",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "True. The guy yelling at his wife in the parket lot is just \"reacting\" in a perfectly healthy emotional way.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "While I don’t disagree, I do think the wife is being dramatic about the bags. It may be one of those things that isn’t really about the bags but everything else leading up to it. The bags were just the catalyst",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Exactly, this OP sounds like he is half assing & his wife is just tired of the \"clueless dad\" thing. She doesn't seem like she is upset now, she seems like she is upset the long term",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 124,
              "content": "I get the feeling the wife might be a bit of a perfectionist. Op appears to be laidback. I am a perfectionist and a planner, but I sometimes have no control over the situation so I have no choice but to deal with it and hope everything goes well.",
              "id": 19,
              "comments": [
                {
                  "score": 51,
                  "content": "Throwing a kid’s party at your own house is so stressful. You’re basically inviting a dozen strangers to bring their kids to your house and most people clean the house and yard because of that, plus the actual party planning, then you have to socialize with all these moms and it’s just a lot.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 5,
                      "content": "It's literally one of the worst things I've ever done socially. Three birthday parties and my wife and I decided we're done hosting. The next will be at someplace fun.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "It is very stressful. However, if the guests are happy, then I don’t really see a reason to complain much, even if it didn’t go the way I would have preferred. As a party planner, you have to put your guests happiness above all. I doubt anyone noticed that the goodies are in a poop bag. Especially if it doesn’t look like one.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Yeah I'm getting a lot of mental load vibes from his Mrs",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 598,
          "content": "If you read it, he picked up the cake and probably some other things at the same time. He was setting up for the party outside when she started berating him for not realizing they spelled the daughters name wrong so right there are two ways he’s involved. When he went inside to help finish in there he engaged the daughter and asked her input on what she thought was most important which shows he’s thinking of the actual bday girl and what she wants and not just everything being “perfect.” His wife completely made an ass of herself by going to the bedroom and crying bc he used the wrong bags. Then she made a further ass of herself by coming out and snatching away the box while he was passing things out. To top it all off, she’s drug it out for a week and is so worried that ppl will think badly of her that she won’t take the kid to school. Somehow this is all the dads fault for not thinking that a 6 year olds bday party needs to be Pinterest perfect or they’ll be outcasts?",
          "id": 24,
          "comments": [
            {
              "score": 1026,
              "content": "🙄 I did read it. I also couldn't help but note two comments his wife had made that day. \n\nFirstly the one about the cake \"since you've already screwed up\"\n\nAnd secondly with the party bags \"you've ruined all the hard work I put into the party\".\n\nI think the one thing we all agree on is that it's a massive overreaction. However those two comments make me think there's way more to this story than what OP has said. And the fact that all the help he said he gave (including his response to you) was just on the day. When we all know there's more to planning the party than showing up on the day and lending a hand. \n\nI get the feeling OPs wife did a mass part of the work for the party and then 2 of the things he did do on the day, he did wrong by his own admission. I don't think their fight is just about the bags.",
              "id": 25,
              "comments": [
                {
                  "score": 804,
                  "content": "It definitely looks to me as if he wrote it with careful curation to downplay any wrongdoing on his part. Smells like a validation post to me.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 122,
                      "content": "But honestly at the same time, the seemingly disproportionate reaction could also indicate she isn't entirely stable. It could go both ways.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "And yet he still types things like his response to misspelling his daughter's name is \"Yeah whatever.\" Who talks to their wife like that? Especially when there's a legitimate thing to be at least a little upset about?",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 55,
                  "content": "Okay. There is a massive problem with SOME men, who do not put mental energy into running a house. They go from mother to wife, and just imagine the wife will pick up where the mother left off. \nSure, theyll do what's asked. They'll pick up the cake. They'll put money towards bills. But the actual mental effort of running a house and a family, they leave to their wives (usually while their wife has a full time job and looks after the kid mainly - and I don't know if it is the case here if she has a job of not) \n\nDo they organise the house? What planning of the party did they actually do? Did they just do like they were told and \"helped out\" like a child - or did they put actual decision making and preparation into the party without being asked or told what to like an adult? \n\nThis is a really common problem. And I imagine this isn't the first time this dude has left his wife to organise everything - hence the overaction.\nPotentially, she's got two kids, one of them she didn't ask for, and she's fed up.\n\nEdit: example - my ex used to bang on about how modern he is because he helped me clean the house. But every time, without fail, we'd be cleaning and he'd repeatedly come up to me and ask me what to clean. Dude - just look at the house. What do you *think* needs cleaning? This is just one example of this kinda stuff, and partially the reason I'm not with him any more.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 33,
                      "content": "It's the \"I would have done it if you'd just asked me to do it!\" kind of person.\n\nBut maybe I wanted to be a partner, not a manager. It's not my job to constantly tell someone how to be an adult. I can remember the time my ex's car seized up because for a year and a half after we moved in together he hadn't gotten an oil change. He came home mad at me, because I'd never told him to get one. After all, his dad used to tell him when to get one.\n\nI \"solved\" that issue by taking on the \"mental load\" of his life. For over a decade I was mommy-wife. It's exhausting, and enabling, and leaving was the best thing I've ever done.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Emotional labour. I'm thinking that's really the big issue here and OP is fairly oblivious to it, hence his wife's reaction.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I willl add this she is not worried about the kids. The kids dont care about much as long as they have fun. Its the other moms that will ostracize her for any mistake. That why she say she cant show her face at school. Kids might not care about poop bags but the other moms will.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 137,
              "content": "I don’t think it’s about the party. Most people would be upset if their partner didn’t even bother to check the spelling on a cake before paying for it and bringing it home, let alone being so blasé about the misspelling after it was discovered. You don’t need a “Pinterest perfect party” to get the basics right.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "Isn’t it a BIT suspicious that OP did everything right and was being a perfect father and his wife was acting like someone in the middle of a panic attack for no reason? I only ask because my mom tells stories like this, where she’s the calm, rational person and everyone else is completely wrong, and I’ve learned to read between the lines over the years. \n\nIf everything OP said is the truth, the whole truth, and nothing but the truth, then I’m worried about his wife. She is not okay. Everyone is saying she overreacted - but why? Why is she so anxious and upset? Why is OP so dismissive of her emotions? Could be that she’s always like this (but I doubt he married her despite the obvious disdain for her reactions to things) or something’s going on in her life or in her head and it might be important to talk to her/eventually take her to a doctor. OP, if you don’t know already, you should figure it out. She might need your help right now.",
              "id": 34,
              "comments": [
                {
                  "score": 9,
                  "content": "Love your username btw",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "He’s the one saying that she’s crying because poop bags were used. She might be crying because she’s hurt by her husband’s minimal effort and disregard for things that are important to her. It might be an ongoing problem.\n\n\nAlso, him saying that she’s only crying because poop bags were used would be another sign of his lack of effort in the relationship.",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Not to mention society can judge women very harshly for these things. OP may never hear a peep, but others' can be cruel.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Oooo I still think mom is overreacting, but I relate to this perspective so much! The only fights my fiance and I ever get into are his little screw ups. Like, I'll be cooking and tell him \"when the timer goes off, can you turn the burner to low?\" And he'll turn it to high, then blame the stove for being hard to read. At first it was cute, but after 5 years he doesn't have the excuse of never being taught to cook or do basic chores anymore. He's just careless and it's frustrating that I can't rely on him for simple tasks. That feeling makes me madder than the screw up itself, and then I feel like a bitch for getting so mad over a little mistake.",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "He thinks this is about the dog poop bags. \n\nThis is not about the dog poop bags",
          "id": 39,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Global point: there IS NO right or wrong way to FEEL, but there definitely are appropriate/acceptable and inappropriate/unacceptable ways to behave. I get that a reaction may be unavoidable. But sticking with it and not processing the feeling behind it and not being open about it with your partner is unacceptable.",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "That’s my guess too. Otherwise, the poop bag thing would be funny. This sounds like the mom has Just. fucking. Had. It. Already.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5410,
      "content": "INFO: do you ever walk the dog? How do you not know what the poop bags look like?",
      "id": 42,
      "comments": [
        {
          "score": 5043,
          "content": "I do walk the dog and the bags are normally green.",
          "id": 43,
          "comments": [
            {
              "score": 2404,
              "content": "I'm going to say NTA since you had no way of knowing those were the poop bags. Hopefully your wife will chill out soon!",
              "id": 44,
              "comments": [
                {
                  "score": 657,
                  "content": "Upvoted all three, that is a solid INFO request and a solid REPLY.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "I would have given him additional creativity points if he knew they were poop bags and did it anyhow.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "this post is probably fake as fuck. theres no way if you walk your dog on the regular not know how poop bags come in. it doesnt matter if theyre not “normally green” but pink with hearts...poop bags come in tiny ass rolls to fit the holder and are typically the same shape. anybody who actually owns a dog knows what those are regardless of pattern/color.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Actually poop bags come in three formats -tiny rolls for the holders some people have, one big roll that you pull bags off of and bring with you, and flat packs. So we can't really assume they're as easily identifiable as you think.\n\nAnd before anyone comes along and says \"Well everyone just uses the small rolls in the dispensers\", you'd be surprised how many people want the big roll or the flat boxes. This is coming from the guy who sells the poop bags.",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "I have a friend who has a big dog who, as far as I know, doesn't use \"poop bags\" at all; he uses newspaper bags. I used to save bags for him when I had a newspaper subscription. Now I think he gets them from other friends. Don't assume everybody does it the same way.",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "TBF, he also didn't know how his daughter's named is spelled.",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Is there any difference between a plastic poop bags and a plastic treat bag?",
                  "id": 51,
                  "comments": [
                    {
                      "score": 6,
                      "content": "One has treats and the other is full of tricks.",
                      "id": 52,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I mean, if they’re rolled up perforated little bags made out of the same thin plastic that they all are idk how you’d mistake those for anything but poop bags",
                  "id": 53,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Does it actually matter tho? its plastic, and unless OP lives in China I highly doubt they would use a particularly toxic low quality kind of plastic for it. Also OP could have been thrown off by the heart design.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 341,
              "content": "But did the bags come packaged the same way? Like were they both the kind that come on a little roll the way you usually find poop bags?",
              "id": 55,
              "comments": [
                {
                  "score": 670,
                  "content": "No, part of the reason I didn't really think about it. They must have come in a box. I was in a hurry and my daughter was excited and pulling things out of the bags. She probably found the box and just tore it open. The bags were just sitting there with everything else. But I remember throwing out packaging from a bunch of things like the toys and boxes of different candy and stuff",
                  "id": 56,
                  "comments": [
                    {
                      "score": 218,
                      "content": "Info: I'm sorry but the box clearly said they were dog poop bags? How big were they? If they look normal then NT.A they could have been multipurpose. Does your wife react like this often?",
                      "id": 57,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Why should it matter? They're still just  fucking plastic bags you can put things in.",
                  "id": 58,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 173,
              "content": "You should add this info to your post",
              "id": 59,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "If I have green poop bags and a child’s birthday party coming up where I know there are gift bags to be handed out, and I find little pink bags with hearts, you better believe I’m gonna assume those are the gift bags. \n\nNot sure who’s more toxic, your wife or this sub. Yeesh. Sorry OP.",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Q: whats the difference between a party bag and a poop bag?\n\nA: just the contents",
              "id": 61,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Yeah when you said dog poop bags I immediately thought the green ones as those are the only color I've ever seen pop bags be... if they had little hearts on them that sounds about right for little girl birthday party gift bags",
              "id": 62,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Unless these were poop filled bags why does it matter. Kids certainly don't give a shit which box their candy filled plastic bag came out of",
          "id": 63,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4904,
      "content": "For something that's supposed to be for children, adults sure love to make it about them. The most important thing is that the child is happy and has fun, not how \"perfect\" it is or your image. I always hated birthday parties growing up because it was more for the adults than it was for the kids. I'd be trying to have fun but my mom would tell me not to do this or that because I was embarassing her. So NTA. Your child thought it was funny and as long as she enjoyed HER day, that's all that matters. And really, taking a cake back because they put an H at the end of the name? Should have just scraped it off and not been so harsh with you about it.",
      "id": 64,
      "comments": [
        {
          "score": 1223,
          "content": "I would have pointed out the H on the cake and told her, \"Look, we got you an H!\"  Even 6 yr olds have a sense of humor, and it's not  a bad thing to learn to not sweat the small stuff.",
          "id": 65,
          "comments": [
            {
              "score": 737,
              "content": "YES! And then \"Looks like the cake shop made a little mistake!\" And just removed it and moved on without a second thought. You know what that teaches kids? To not sweat the small stuff. You know what freaking out and taking it back does? Well... I'm sure you know. Also, what a Karen!\n\n\nLiterally screw the top comment in this thread, the mum is nuts.",
              "id": 66,
              "comments": [
                {
                  "score": 71,
                  "content": "This is the reply I was looking for.  Jesus Christ this community is holier than thou as all get out.  My gf is a pastry chef and has a lot of cakes that they decorate.  If someone brought in something with an extra letter and was freaking out she would ridicule that Karen.  They were not \"poop bags\" but plastic bags.  It's not a poop bag without poop in it.\n\nMom needs to call the F down. Like you said, way to show a kid that it's fine to make a giant scene out of small issues. Hoping to raise quite the drama queen.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 62,
                  "content": "Even if I was still in the store and noticed the h, I probably what have thought, eh, I’ll scrape it off at home.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 30,
                      "content": "I'd have them scrape it off at the store because they'd do a better job than me.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "YES. As a mom and chief party planner. Come on. This whole thread is stupid. OP is NTA. It's poop bags with a heart on it. It's a cake with an H. Scrape the H off and move on. Good lord.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 36,
                      "content": "but think of the poor children suffering at this party with a mispelled grocery store cake and the wrong plastic bags to take a bunch of candy and shit home in.  how will they ever recover from such a horrific event?  and what will the neighbors say!!!!?!?!?!?!",
                      "id": 71,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yes and people wonder why they end up with spoiled ungrateful children. It’s because of things like this...”everything needs to be just perfect for my little princess”",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Agreed couldn't believe the top comment even said YTA on top of that howany people agreed with it.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "That's what the store would do anyway, they're not making a whole new cake. Scrape of the h, smooth it out with some more white, done. Even if they'd put the entirely wrong name, this is what they'd do.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Exactly. The store would just scrape the H off. Why not just do it yourself at home.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Seriously! This guy is NTA.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Exactly what I was thinking! Plus, in 10 years the kid isn’t gonna remember silly shit like an extra letter on the cake. It could have been remembered positively as “remember when dad handed out poop bags”but sadly will now be deemed the birthday that mom had a breakdown and wouldn’t talk to dad. That sticks with a kid.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "My youngest brothers name is Viktor, for his first birthday the bakery spelled it Victor. My dad and step mom thought it was hilarious and took a little icing writing tube and put an x through the c and added a k at the top of his name, same thing the next year. For the last nine years now they purposefully spell it Victor and cross out the c and add a k as a joke, the kids don’t care and think it’s funny",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 246,
              "content": "LMAO! I probably woulda scraped off the H without a second thought and had to come up with a whole other present idea like a complete sucker!",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "“Every year you get one more letter Sarahjalsapuss.”",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Exactly. This mom was making mountains out of molehills. Her life must be exhausting!",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Literally scrape it off with a spoon and let the kid eat it, I know at 6 years old I would have been more than excited to get a sneak peek taste of my birthday cake.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 359,
          "content": "This! So, so much. Yes OP was a bit disengaged but the daughter was happy and had fun. OP’s wife sounds like a control freak and made the party about her. The other comments saying there must be something wrong in the marriage don’t seem to see that she made it about herself and her REPUTATION. it’s not about OP being disengaged, it’s about his wife being obsessed by appearances.",
          "id": 83,
          "comments": [
            {
              "score": 54,
              "content": "THIS. To not drive your daughter to school all week because of a few hiccups at a birthday party is beyond ridiculous. My daughter comes before my “reputation”, I wouldn’t miss our morning routine for anything.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Even then he doesn't necessarily seem disengaged, just....maybe there's this wild chance he didn't want to make everything into a huge deal for his child's birthday party?? It sounds more like an issue of communication on their feelings and expectations for this sort of thing, he's not an asshole for this in my book but if she was this upset about it all it's obvious they need to sit down and hash this out before another big event because if this was just down to her feeling bad about her reputation at her child's birthday party....yikes.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I don’t think he was disengaged, I think he was laid back. He was setting up stuff in the backyard, picking up the cake, and asked his daughter what she wanted to have ready for the party (and assembled the gift bags, which didn’t look like poop bags). He didn’t get stressed out about minor issues, which is a good quality, not a sign that he’s mentally checked out. As for his wife, I think she either overreacted or there’s some context that’s being left out. The daughter had a great time, which is the ultimate goal of a birthday party.",
              "id": 86,
              "comments": [
                {
                  "score": 6,
                  "content": "Even with more context she threw a fit DURING the kid's party and has been pouting and neglecting her normal parenting duties for a week over it. I can't imagine any extra info that would make that behavior excusable. I feel bad for the kid. Kid was happy with the party and mom ruined it for everyone by throwing a week long tantrum starting at the party. This birthday will be remembered for a very long time, and not in a good way.",
                  "id": 87,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "OP offered solutions, wife on the other hand seemed dead set on the day being ruined. For real, who clearly cared more about how Sara's day went? NTA.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I mean when you hear the name Sara, you are 99 out 100 times going to assume the traditional spelling \"Sarah\" this was both the Hebrew origin and used in biblical context. \"Sara\" is an modern streamline. if you name your child an unconventional spelling of a common name, you can't be that upset about spelling errors.\n\nI'm going to assume your name is Riley and not Ryleigh 100% of the time.",
          "id": 89,
          "comments": [
            {
              "score": 6,
              "content": "I have had my name spelled wrong so many times I just roll with it. Even spoken, if it sounds like my name, I'll probably answer to it!",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I’m so confused. I laughed at the post so hard water came out of my nose. Why isn’t everyone just laughing about this? \n\nHey guys I threw my daughter a bday party, AND I USED FOOKING POOP BAGS FOR THE PARTY FAVORS lol why does everything gotta be so tense. She’s 6. I really really don’t think she or anyone else cares.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "100% Agree\n\nSeeing the top comment saying he shouldn't have even started a family makes me want to unsub.",
          "id": 92,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "And the way the wife goes \"You already screwed up once with the cake\". Sorry but she blew that out of proportion, take off the H and dont make it into a conflict - its a cake.\n\nThen crying over the bags? Look I'm six right, and I dont care if the bags come from a box that says \"poo bags\" or from a funky party bag box. Theyre pink, they have hearts on them, the bags are full of candy. The kids are satisfied.\n\nPeople are having a go at this guy for asking his daughter which part was the most important as well. I completely disagree, I think thats exactly right. Its meant to be her party and you want her expectations to guide the thing, so she winds up happy and remembers having a good time when she's growing up.\n\nThen the mum is fucking sobbing in the bedroom over the gift bags, she doesnt want to show her face at school. Imagine how embarrassed YOU would be if you were the little girl. The mum's reaction spreads her own embarrassment out onto others, she's making the situation worse than if she had just let these things go and focused on giving the daughter a great day to remember.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I bet the bakery literally just scraped it off and handed her back the cake",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "The wife made her child‘s birthday party about her and her marriage.",
          "id": 95,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "This is exactly what I thought. He asked his child what the most important part was. Tht a good thing to ask. He helped put together the bags. Thats a good thing. He may have come off as not caring in the post but his daughter seems to think otherwise. I think mom was just too stressed out bout a 6 year olds party and broke.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2780,
      "content": "NTA. Your wife is being overly dramatic about this situation. Nobody is going to assume a bag is a dog poop bag unless it legitimately has a turd cartoon on it.",
      "id": 97,
      "comments": [
        {
          "score": 598,
          "content": "See that's the thing, my dog's crap bags are just solid blue, so you don't have to look at the poop. There is neither a picture of a dog deficating, or a ghostbuster style turd with a no symbol over it.\n\nLike, unless someone was buying our brand shit bags, there is no way to know it was designed for poop.\n\nI mean, I get that this is a huge deal to the wife, but it looks like it might have just been her. I'm not saying over dramatic, because clearly this made her sick level panic, but it would give me some concern that she freaked out this bad.",
          "id": 98,
          "comments": [
            {
              "score": 553,
              "content": "Why pay the extra $2 for the pink bags with hearts on them, if you're not going to use them in a pinch for THIS EXACT SITUATION?  \n\nOr was this like, \"You wasted all the pretty poop bags, now Buttercup's shit has to be picked up in an ugly green bag!\"",
              "id": 99,
              "comments": [
                {
                  "score": 303,
                  "content": "That is a highly interesting reversal. I don't think that's what happened, but it is my preferred version of the story.\n\n\"WATCHU MEAN YOU USED THE HEART BAGS FOR TOYS AND CANDY, THE DOG IS GOING TO DEVELOP A COMPLEX OVER THIS! I NEED TO GO CRY!\"",
                  "id": 100,
                  "comments": [
                    {
                      "score": 30,
                      "content": "If the dog needs therapy over this, it's on you!!",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Everyone's worried if the daughter had a good time, when the real heroes ask about the dog.  Now we need to break down this story into a numbered list of how the dog is slighted at every step.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 93,
                  "content": "I'm snickering like a child at your use of the phrase \"in a pinch\" for the poop bag situation. I'm so sorry. 😂",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 191,
          "content": "NTA. Honestly even if the bags had a poop emoji theme on them, it could be hard to tell. My daughter is almost six and a lot of her friends love poop emojis (golden poop emoji stuffed toys?!). One of them came to school on Halloween as a poop emoji last year. I don’t get it and I wouldn’t do it, but some kids love weird things. \n\nWhile he’s NTA on the bags, I kind of wonder about her extreme reaction and think that maybe there’s a bigger context other than she’s loony and was exhausted from the party. If we assume she’s not crazy, then I can’t help wondering about something others have said about how much of the emotional load she’s carrying for the household and feeling a lack of support for her priorities. \n\nIt’s easy to say her reaction was over the top, but I also can’t help wondering about what would make a not-crazy-person be this stressed about showing her face at school. Some PTAs are a very active social scene for moms, especially upper middle class SAHMs with full makeup and careful outfits for volunteering in the library. Some of them are very cliquey and mean and it could really make a difference in how the daughter is treated at school by the other kids. Failure to live up to a mean mom’s standards could mean no invitations to parties, no play dates, which could make school a pretty tough place for her kid. Those pariah kids become easy to pick on because outcast moms can’t get the bullies in trouble for bad behavior.",
          "id": 104,
          "comments": [
            {
              "score": 27,
              "content": "I do have to say that as a mother to a young child, and being around other young mothers that the birthday party is a HUGE to-do. For some reason we are pressured to make the party look fun, have the best gift bags, with the best cake, at the best location. If she is a SAHM then there is added pressure since her job is literally to take care of the household.\n\nFrom the way it sounds she also may be a type A person who likes to take charge. Chances are she has planned and tried to execute the whole thing and got overwhelmed by it. And if they live in an affluent area there is even more pressure.\n\nMy son goes to school where the good majority are *very* affluent, and the mom culture can be very cliquey and toxic. One small, bad move can put you in mom jail for a very long time. If the cake isnt good enough, or the theme is off brand, the party favors aren't top of the line, even if the food is store bought, catered, or home made. Is the party at a venue, park, or at the house? What kind of house is it, or how much did the venue cost? Was the house neat as can be or was there dust side pannels? This shit is seriously like the mom Olympics. \n\nI think dude is NTA, and mom is heavily overreacting, but it's because the culture is so toxic and can send a woman into social purgatory. They need some counseling to learn how to communicate better, and it sounds like she needs a therapist to deal with the stress she has on her plate.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Honestly... we need more info. \n\nBut I'm leaning towards a bit of ESH. \n\nMom should have kept her shit together til after the party and talked to op in private. \n\nOP should have been more observant and active from the get go to be more helpful (for realsies). \n\nAlso, people keep saying \"the kid said it was great\" \n\nPossibly... the kid saw the shitshow going on and said \"its great\" even when it wasn't because she didn't want to be in the middle of, or witness another fight?",
              "id": 106,
              "comments": [
                {
                  "score": 3,
                  "content": "I think you might be right.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Bruh, imagine being a grown adult with children and being on this high-school level shit.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Meanwhile a mommy blogger is making fun jokey poop bag party favors that kids love",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I don’t think she’s being overly dramatic, at least on purpose.   I think she’s plain depressed, possibly has anxiety, and needs help.   Said from someone who would know.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I wager that OP's wife has severe anxiety. The level of her reaction to everything is quite severe. The poor wife is in literal pain from the severe stress she is experiencing from her anxiety.\n\nOP, please try to convince your wife to go to a psychiatrist, and find a therapist. She doesn't have to keep experiencing this pain. It's possible for her to have a more peaceful life.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2149,
      "content": "YTA. I’m gonna guess. That’s what this sub is - strangers reading between the lines and making judgemental guesses. I doubt her anger is all JUST about the poo bags. You don’t care about the things that she cares about. You don’t take her efforts seriously. You undervalue the amount of work it takes to plan, organize, and execute parities. Your idea of “helping “ is completely half-assed by her standards. She probably puts a similarly high effort into her daily parenting tasks (like making sure your house and kids look presentable or making healthy, budget-friendly meals), and you may not see the many, careful, tiny decisions involved in that, or may think it’s all nonsense. So she can’t trust you to accomplish small tasks, because you will fuck it up and then convince a bunch of strangers to pat you on the back for even trying. Take this one event - the poo bags - and imagine your wife experiencing it in many different ways about many different things on a daily basis for as many years as you’ve been married. That’s what she’s mad about. She’s sick of your slack-ass shit. You didn’t notice that your daughter’s name was spelled wrong on her birthday cake. And when you found out, you didn’t think it mattered. You put party favors in dog poop bags. You don’t care and you’re unwilling to put forth equal effort.",
      "id": 112,
      "comments": [
        {
          "score": 2123,
          "content": "You know who else didn't care? The birthday girl. She thought it was great. Not that you care about her opinion, it's not like it's her day or anything",
          "id": 113,
          "comments": [
            {
              "score": 1319,
              "content": "[deleted]",
              "id": 114,
              "comments": [
                {
                  "score": 512,
                  "content": "100% of the people in this thread who think this is upsetting feel that way because they recognize that a relationship is not simply individual moments in complete isolation and a dipshit adding poop bags to a camels back can make that camel go cry in the bedroom.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 68,
                      "content": "After yelling and throwing the party bags on the ground in front of everyone and ruining the party? There's nothing that makes that ok",
                      "id": 116,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 41,
                      "content": "The bags were pink and had hearts, it’s a bag just like any other bag. Get over yourself. You and the mother should be tested for narcissism. This woman sounds legitimately insane to react like this over the cake, and then a bag....",
                      "id": 117,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "This subreddit isn't about trying to somehow analyze an entire relationship based on the contents of one based, were here to analyze THIS EVENT in particular. This is the type of stuff that's ruining this subreddit.",
                      "id": 118,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "When OP mentioned not wanting to show face at school, I was very confused as it seemed like his girl had no qualms with the party. Then I realized this was referring to the mother and that clearly this was a day about her",
                  "id": 119,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "And the wife’s opinion doesn’t matter? The fact she was crying alone in her room doesn’t matter? Not that you care about her opinion",
              "id": 120,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 678,
          "content": "Where did you pull that shit about \"healthy, budget friendly meals\" from?\n\nHoly assumptions Batman.",
          "id": 121,
          "comments": [
            {
              "score": 107,
              "content": "Well the mother does seem just like that type that needs for her life and family to be perfect instead of realising kids will grow up anyway and take far more damage from parents being unhappy with life.",
              "id": 122,
              "comments": [
                {
                  "score": 13,
                  "content": "Fixation on perfection is a damaging mindset.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 50,
              "content": "They're probably projecting from their personal life. Definitely pulled that out of their ass.",
              "id": 124,
              "comments": [
                {
                  "score": 19,
                  "content": "All I'm seeing in every single YTA post here is projection - and a bunch of people I am so glad I am not in a relationship with.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Agreed. This person has some serious marital issues. Probably.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "I know, man! The amount of overly-confident guesswork in this sub is fucking bizarre.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I'm pretty sure it was just an example",
              "id": 128,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "r/oddlyspecific",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I feel like his post is heavily sarcastic. It has to be right?",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I mean that was a stretch, for sure, but fights like these in a marriage or long term relationship rarely have much to do with the trigger for the fight and more to do with a history of behaviors similar to the trigger that illustrate a much larger problem. I mean, sure, there are some people who may blow a gasket over a specific thing. But typically these types of fights are about patterns of behavior over time and it’s safe to assume this is probably the case here, too.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 374,
          "content": ">That’s what this sub is - strangers reading between the lines and making judgemental guesses.\n\nUh, excuse me? Since when?\n\nJudgements should be made with only the information provided. Making half-baked assumptions after \"reading between the lines\" is how we ended up with the current top rated comment that is so obviously a woman projecting her own issues in her relationship on a situation where those projections make absolutely no sense.\n\nThis subreddit has been deteriorating real fast lately as a direct result of this \"read between the lines\" mentality, and it needs to stop.",
          "id": 132,
          "comments": [
            {
              "score": 55,
              "content": "Exactly dude. I like how from this one post a bunch of people decided to “read between the lines” and determine that OP is a lazy fuckface who doesn’t care about the wants or his wife and daughter. That’s ridiculous. He made 1 mistake, and we are all human and make mistakes. And the mistake he made honestly wasn’t even that bad, everyone was fine with the bags and no one seemed to care, they were clean and looked exactly like what party bags at a bday party for a 6 year old girl would look like. People are overreacting lmao and this wouldn’t be the response OP would get in the real world",
              "id": 133,
              "comments": [
                {
                  "score": 24,
                  "content": "Exactly. The daughter even had a laugh about the mistake after - so many overreactions and assumptions in this comment section.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Completely agree  \nEspecially with:\n\n>\" the current top rated comment that is so obviously a woman projecting  her own issues in her relationship on a situation where those  projections make absolutely no sense. \"",
              "id": 135,
              "comments": [
                {
                  "score": 33,
                  "content": "The fact that it's so upvoted leads me to believe there are a lot of unhappy marriages out there expressed via upvote. If any of you are reading this comment, giving someone gold won't fix your own relationship, sort your life out.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Ikr. And the amount of assumptions about OP here is unbelievable...",
                      "id": 137,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": ">Judgements should be made with only the information provided. Making half-baked assumptions after \"reading between the lines\" is how we ended up with the current top rated comment that is so obviously a woman projecting her own issues in her relationship on a situation where those projections make absolutely no sense.\n\nExactly, I was just reading another thread that was similar to this.  A commentator made a bunch of assumptions to make the guy look like an asshole.  \n\nTheir entire post was basically \"Yeah, but what if OP was an asshole?  Wouldn't that make him an asshole?\"\n\nWell, fucking DUH.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "[deleted]",
              "id": 139,
              "comments": [
                {
                  "score": 11,
                  "content": "I was once told on here that I should go no contact with my own elderly father because we were in a disagreement and I was expressing my frustrations. \n\nMost people here are so out of touch with the nuance of relationships that their only “solution” to a problem is to cut someone they love out of their life over a fixable issue. This is one of the worst places on the internet to ask for advice lol",
                  "id": 140,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Right? What the fuck? Sometimes, the manner in which a story is told makes it obvious that OP is leaving out things which they said to escalate an argument, or they are using subjective words to describe how the other person's words were unpleasant but their own were kind. In those cases, it's hard to read the words and not imagine that OP is modifying things to make themselves look better and the other person look worse.\n\nBut that isn't \"the point\" of the subreddit. The goal in any post should not be to read between the lines and invent facts which aren't told in order to justify calling someone an asshole. The point is to be an unbiased third party to hear out the events of an encounter and determine which person was in the wrong, if either. Ideally, there should be *no* reading between the lines.\n\nWhat the fuck crazy shit is that to say?",
              "id": 141,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 33,
          "content": "I read the top comment and the almost entire other thread created in response. My mom is BPD...and honestly this story sounded like something my dad could have told. Right down to the meltdown in another room because things aren’t 100% perfect, blaming everyone else, yanking presents from others, and the crappy treatment for a week after. Particularly the crappy treatment for a week after. \n\nAll this to say this story is highly interpretive. IF op is on an unhealthy relationship all these people making massive assumptions about what is going on behind the scenes are reinforcing the abuse if THAT scenario is true. \n\nThe responses to this post are probably the most dramatic assumptions I have read in a while in this subreddit.",
          "id": 142,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 31,
          "content": "a lot of projecting here",
          "id": 143,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "Fuck you’re so judgemental! Talk about bringing your own issues to a response...",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "I have to believe that you are trolling right now. You literally say that people read between lines here, but fucking try to analyse their whole marriage? \"You are unwillimg to put forth equal effort\" is the pinacle of talking out of your ass.",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "I would really really really love to know how OP mistaking pink bags with hearts on them that look like party bags for a 6 year old girl and were different from the usual poop bags they use for the dog for gift bags means he half-assed his contribution. Was he supposed to immediately know that they are dog poop bags, or go online and Google if they are dog poop bags? In now way does OP choosing the wrong bags (which were clean and were liked by the bday girl and her friends) make him a lazy half-assed person",
          "id": 146,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "This is way more than *reading between the lines and making judgmental guesses* lmao. Hooooly hell, you seem like a treat.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "It seems like your making a whole lot of assumptions there bub",
          "id": 148,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1472,
      "content": "LOL... wow.  NTA.  Little pink bags with hearts on them sound like they're perfect for a 6 year old girl's birthday party.\n\nThe way the wife's acting, one would think OP emptied and washed used bags from the trash.  She needs to grow up and move on.  It's not a big deal.  Certainly not \"can't show my face at the school for a week\"-level deal.",
      "id": 149,
      "comments": [
        {
          "score": 88,
          "content": "Yeah OP's wife needs some therapy... her reactions are not normal or healthy",
          "id": 150,
          "comments": [
            {
              "score": 21,
              "content": "Agreed!  That doesn’t make her a bad person, just means that she’s suffering from mental illness and need help.  We all need a little help sometimes!",
              "id": 151,
              "comments": [
                {
                  "score": 16,
                  "content": "[deleted]",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "From the look of the comments many other people do to. They are relating with the wife because they too blow things out of proportion and care waaaay to much what others think about them. That’s what this really comes down too. She and others think if it isn’t absolutely perfect then others are going to judge her as being a bad mom. Got news for her, people are going to judge you no matter what happens. Those people are the ones that are assholes, you don’t need that kind of stressful bullshit in your life.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Yeah these YTA comments are fucking insane. This sub is so bizarre sometimes. This is a really obvious NTA post, but people wanted to go on a witch hunt for some reason and say things like \"you shouldn't even be a father!\" WTF.",
          "id": 154,
          "comments": [
            {
              "score": 20,
              "content": "This is literally the weirdest, most dramatic thread I've ever seen. All over something utterly harmless. As someone with *actual* problems I'm honestly having a hard time even fathoming how a grown adult could blow such an inarguably trivial non-issue so out of proportion. Absolutely nothing in OPs story warrants the type of reaction she had, or the people in this thread grasping at straws to justify her behaviour. There's so much rampant speculation and projection it's actually deeply shocking. The amount of baseless judgement being passed  in this sub makes me feel like it attracts the very worst type of judgemental people. Like holy shit, some people clearly have no idea what it's like to have real problems if they are so embroiled by this laughable dog bag birthday party incident. Not trying to come across jaded but seriously..",
              "id": 155,
              "comments": [
                {
                  "score": 7,
                  "content": "I’ve been around enough parents and parties to know the OP’s wife and the people on this thread that are siding with her. They care so much about what others think of them and that everyone thinks they are the perfect mom. It’s a mental illness I’m going to bet. The people judging the husband are the people that think people are judging them over the tiniest stupid details.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 7,
                      "content": "[deleted]",
                      "id": 157,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Right, only because it's sold and marketed as cute dog poop bag, doesn't change the fact that it still a cute small plastic bag... I don't understand the drama here, only people who has a dog and uses the same dog poop bag may notice and think it's funny how they resemble or are they same bag, but nobody would think that this gift is packed in poop bag.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Right? The fact that there's an 8k+ YTA judgment as the top comment makes me concerned for the mental health of this sub. Wifey needs therapy, like come on",
          "id": 159,
          "comments": [
            {
              "score": 4,
              "content": "Ya I was blown away after reading that. This sub surprises me all the time but the amount of your the asshole judgements, the amount of upvotes they have and the amount of awards they have blew me away. It just proves there are tons of parents that relate with the OP’s wife caring way to much about what others think of them.\n\nIt’s good to care what others think to an extent, but the people at the absolute top of that list have to be the people living in that house with you. It doesn’t matter if people outside think you are perfect but your kids and husband think your an asshole.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I know!!! I can't believe that tirade of inanity has 9k upvotes, makes me feel bad for OP.  My downvote obviously didn't do much, but my god, that was an overreach and a half.  There was one response to that one from [u/CawSoHard/](https://www.reddit.com/user/CawSoHard/) that made a whole lot of sense.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "that r/unpopularopinion post was 100% right, this sub is heavily biased for women, and I'm sure it has a lot more women active than usual reddit ratio.",
              "id": 162,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "And six year olds don’t care about the goody bags, it’s what’s in them that counts. And really, by the time the little party guest gets home, half of what was in the goody bag gets left in mom’s car and gets thrown out.",
          "id": 163,
          "comments": [
            {
              "score": 10,
              "content": "And any year olds**\n\nYou see this A LOT know with people planning wedding welcome bags. No one gives a shit if your pink paper bag is slightly off color from the rest of your theme.",
              "id": 164,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "And making you late to work daily is a dick move. Can't show your face, I bet half the parents have no idea either, and the kids don't give a shit bag about how they're party favors were given to them. It will be torn up and in the trash by the time they make it home.",
          "id": 165,
          "comments": [
            {
              "score": 4,
              "content": "The \"can't show my face thing\" is really the icing on this first world problem cake.",
              "id": 166,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Agreed. NTA. Easy mistake to make, and OP was legit trying to help, from the sound of it, every step of the way. OP's wife is taking things way too far, meaning either she is really upset at something else entirely and they need to talk about it, or (more likely) she needs to grow the f up and OP needs to grow the f up as well and stand up for himself and talk about how he's being treated a little unfairly. It's called a partnership. She's avoiding responsibility, either because it really is too much, or because she's a butthead. Either way, those two have got some splainin' to do.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1011,
      "content": "NTA at all\n\nCome on, how could you be an asshole with zero intent in this scenario? Like you said, people wouldn't notice what kind of bags they were unless they contained actual dog shit.\n\nYour wife needs to get a grip or she's going to be in for a crappy life with no fun. Make sure nothing deeper is wrong",
      "id": 168,
      "comments": [
        {
          "score": 660,
          "content": "The wife isn't the only one that needs to get a grip. Look at all these comments, some going as far as telling him he shouldn't have started a family. Geeze.",
          "id": 169,
          "comments": [
            {
              "score": 266,
              "content": "> some going as far as telling him he shouldn't have started a family.\n\nTo be fair, with this woman, maybe he shouldn’t have. No matter who’s right and wrong they seem to have very different ideas about raising children.",
              "id": 170,
              "comments": [
                {
                  "score": 31,
                  "content": "Nah, imagine if the kid had two parents who were at the same level of controlling, perfectionist and only caring about other people's opinion rather than their child's happiness. Poor daughter. I say OP brings some balance to this.",
                  "id": 171,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I was actually talking about how parents with different parenting styles shouldn’t raise children together the other day. But you do have a point. Two crazy parents together is much worse than 1 one crazy and 1 laid back.",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "That was my big takeaway here as well. Reading this gave me flashbacks of my dad and stepmom. My dad was always a big picture guy who smoothed over the little hiccups as they arose while my stepmother would obsess over every detail, taking a huge amount of time to fix small issues because if it wasn't 300% perfect she basically had to start all over again. The same project assigned to both of them would take my dad about 3 hours and my stepmother a full day or two of preparation. It was mostly just from a difference in thinking. My father was always a lateral thinker, finding small ways to save lots of time without really affecting the end goal, while my stepmother was like the wife in this post \"cake is wrong? Store has to fix it. Special party bags HAVE to be purchased for this party and used in exactly this circumstance. ANY deviation from my plan at all ruins everything.\" It's not necessarily bad or wrong, but it's very hard to have these two types of people co-exist, one flexible and able to call audibles mid plan, and one with a rigid idea of how things need to happen.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Even if people did realise that these were poop bags, so what? They were clean, brand new poop bags. Not recycled ones. It's just a tiny plastic baggy ffs. It still contained gifts, not poop.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I love that you bring up intent. We judge ourselves by our intentions; others judge us by our actions. Still I'm going NTA. I don't the the wife is an asshole for getting upset but she is a bit of an ass for staying mad for a week.",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yeah exactly. She's being crazy, but it's possible that something else is wrong, in which case she should tell you. But it's not always easy to talk, so you should be real and offer to talk. Like, \"Hey, don't take this the wrong way. I feel like you've been treating me like an idiot and I'm not. Is there something that's really been bugging you, something in addition to my mistakes with the birthday party?\" If there is, talk about it, and then whether there is or not say \"Well, I didn't understand why you reacted so strongly and I think it was a bit much. Quite a bit much. Thanks for listening, and thanks for talking with me.\"\n\nAt least, that's how I see that going down, ideally. Gotta stand up for yourself as well as her.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 995,
      "content": "YTA - because you haven't yet realized that when the party details aren't perfect, or the house isn't clean, or the kids clothes are dirty and their hair isn't combed, nobody says that you are a bad dad.  But you can bet your ass that if someone noticed that things were less than, they think badly of your wife. While you're saying \"fine, whatever\" about the details, other people think your wife is a bad mother.",
      "id": 177,
      "comments": [
        {
          "score": 787,
          "content": "This is what I wish I could get my husband to understand. He tried to do all our wedding planning, and made a few tiny faux pases, which were promptly blamed on me. I couldn’t just “let him handle it” because the responsibility didn’t fall on him. When one cousin’s invitations were lost and had to be re- sent, I’m the one who got the cold shoulder and the suspicious glances. When our rehearsal dinner conflicted with another important event (neither of which I planned), some members of his family stopped speaking to me all together. Partly because I didn’t “care enough.” This was true: I did NOT want a big wedding, but I did end up planning about 50% of it and paying for all of it. That wasn’t enough to satisfy everyone. I had to do it all AND love it, despite begging to elope (he refused because his family would kill him, which is why we agreed he’d do the wedding planning, as I was working 2 jobs and really couldn’t take time off if I was going to be paying for the wedding). \n\nAnd when people come over and our home isn’t clean, it’s cute on him, but it’s unseemly for me. Women are messy and lazy; men are just busy doing more important things. So it isn’t exactly fair for him to tell me to just let it go and not worry what everyone thinks. It’s because they aren’t thinking it about him.",
          "id": 178,
          "comments": [
            {
              "score": 206,
              "content": "I understand what you mean! I explained it to my husband as that we now have a \"brand\", and more things reflect on both of us as a team. Which is why if he misses his family's birthdays, invites people round when it's messy, forgets to reply to invitations to dinner... It's reflected on both of us and makes people think I don't care. I'd like to think I'm overthinking it but you only need to \"miss\" a couple of events to realise people think we're both rude rather than he's disorganised!",
              "id": 179,
              "comments": [
                {
                  "score": 32,
                  "content": "This is actually a really good way of communicating this! It's really clear on the whole \"yes, if you slip up, I get blamed\" thing that does happen, but I think a lot of people have problem grasping before they're actually in that situation. And it's very positive, because it's saying, let's work as a team on protecting our brand, rather than just pointing out individual things. Like, I'm not in a long-term relationship, but I'm writing this in my diary as a LPT to keep for the future.  \n\nEDIT: this blew up overnight but let me clarify - I’m not saying some stranger or barely friend would get to make me feel bad about my relationship. If my boyfriend was being a flaky dumbass, I’d have noticed already and I’d be bringing it up regardless. If I was being a socially awkward ADHD person, which I am, I’d expect him to bring it up rather than letting Karen down the street snicker behind her hand at me. That’s the point of both of us watching our public image or whatever - I don’t have enough mental energy to do it for us both and I have anxiety anyway, so it’s about making sure we’re working as a team.   Also, for me at least, this is highly hypothetical - I haven’t even been in the same room as a guy I’d like to date in three years, mostly because my last relationship was with a narcissist who liked to make me look crazy in public. So yeah, I think the idea of actively not embarrassing each other is sweet.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "[deleted]",
                  "id": 181,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Brand is just a way to explain how they are connected.\n\nHere is the thing, it's pretty accurate.\n\nIf your husband never tells you about a family party and you miss it, it's noticed. If it happens a few times people talk about why you don't want to spend time with the family.\n\nIf your husband brings someone, especially from work, over and the house is not clean, it's noticed. \n\nIf you don't dress or behave properly at a spouse's work function not only is it noticed, but it can effect your family's long term wellbeing.\n\nWhat your spouse does, and fails to do has a direct impact on how people perceive you. Sometimes it has little or no impact on your life, other than social stress, other times it effects when you retire. If one spouse cares because they feel a larger impact, the other should make an effort.",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "When we were planning our wedding, my husband wanted it to be childfree. Because he had about 15 nephews and nieces and he said kids take over events and his siblings would enjoy the opportunity to have a grown up event. Guess who EVERYONE who wanted to bring their kid/s contacted. Even his friends' wives texted me, and these were women I'd met maybe twice, whereas their husbands had been friends with mine for over 20 years. And guess who got sent a very long, very upset text saying, amongst other things, \"I guess some people just don't like children\". \n\nTo his credit all his siblings loved having an excuse not to have their kids hanging off them (and now I have 2 I completely understand), so he wasn't wrong, he just didn't realise not everyone would feel like them. And he was very apologetic that I copped all of the hurt feelings. But I was and am still very salty that everyone assumes all wedding decisions are the bride's and so they get blamed for everything that goes wrong.",
              "id": 183,
              "comments": [
                {
                  "score": 5,
                  "content": "I hope every time you referred them over to him.",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "I went to a wedding recently and because I know the groom much better I texted him to ask for the dress code. He referred me to his fiancée. Tf?? How do you not know or care about the dress code to your own wedding?\n\nThe icing on top was she was finishing up her PhD before the wedding, but I guess that doesn’t matter.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Lmao everyone replying to you like \"nah, folks should just suck it up and be social pariahs so that their partners don't have to get their shit together.\"\n\nReally shows who's given up on getting their shit together and is mad that they might get called out on it for once.",
              "id": 186,
              "comments": [
                {
                  "score": 10,
                  "content": "It’s not everyone; it’s the men.\n\nEdit: although my husband was a victim too! He didn’t mess up that much; they were small oversights that he just didn’t know to watch for (the emotions of it all). He did a good job! But most decisions he tried to make, like the cake and flowers, they wanted to “ok it with me” first. They didn’t say it like that, but I usually got a confirmation call... But no one asked to confirm anything with him when I set it up, so that was weird. No one called and checked with him first. There’s a lot of sexism, and I don’t know why that makes men so uncomfortable to admit. I don’t “blame” my husband for anything— there’s nothing to blame anyone for. But the oversights still got blamed on me! Even subconsciously, even people who are still speaking to me, all the little things were judged against me and not him. Our wedding was low-budget and ok. Any compliments we got doubled or TRIPLED when people found out my husband was responsible for some detail and not me. The music was spectacular (I have connections to the industry) but it didn’t get as much buzz as the decorations my husband did with his friends. Which is fine. I loved the do-it-yourself-ness of our wedding. But any silent judgments were directed at me because I “let” him do it (I should have cared more about making it more formal), and any compliments were directed to him because wow what a big deal that a man can do wedding decor! But, like, of course he can! He’s very talented! It’s just funny. Our male friends cleaned up afterwards too. Men can do it! Geez.",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yeah my MIL blamed and continues to cast shade at me that my husband (her son) never mailed out the wedding thank you notes that I bought, addressed, and filled out by hand. We got married ten years ago 🙄",
              "id": 188,
              "comments": [
                {
                  "score": 3,
                  "content": "Hahahahaha.... yeah, sounds about right. I have to check up on mine for little stuff like that because HE’S never the one  who gets in trouble for this kind of stuff! He does try his best, but has the luxury of being a bit more absentminded than me.",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "[deleted]",
              "id": 190,
              "comments": [
                {
                  "score": 7,
                  "content": "Not just women, men too. People blame the 'woman of the house' for things like that all the time. Many commenters here will say that they don't and never have and have never seen it happen, and maybe that is true for them, but I honestly don't buy that. Chances are that it's so normalized they don't even notice it.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "God, this sub has really jumped the shark.\n\nNTA. By a mile. Dude doesn’t sweat the small stuff and the wife sweats, apparently, everything.\n\nWhat is more, she became aggressive, condescending, insulting, selfish (she hides as the guests left?!) and cruel by the end of the party. Your attitude seems to justify that.\n\nThe appropriate response to the problem of people thinking the wife is a bad mom if the house is untidy is to practice the art of not giving a fuck about the opinions of assholes, not flip out and make your spouse’s life hell.",
          "id": 192,
          "comments": [
            {
              "score": 21,
              "content": "Yeah, this is definitely my signal to unsubscribe from this place. Completely delusional.",
              "id": 193,
              "comments": [
                {
                  "score": 14,
                  "content": "It's an interesting read for me - I don't understand where some of these people find their friends",
                  "id": 194,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "[deleted]",
          "id": 195,
          "comments": [
            {
              "score": 31,
              "content": "If they're the sort of people who apply those standards, their opinions aren't worth considering anyway.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "> If OP half-assed all his “helping” (as he did with the cake!)\n\nHow is it half assing it with the cake? I see scrapping a letter a far more convenient and quick solution that go through all the fuss of getting a replacement cake.",
              "id": 197,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "As a parent, would you rather be fixated on the perfection of your DAUGHTER'S party or her happiness? The cake is easily fixed and didn't have to be spent more time on to be sent back to the store and instead the time should've went to organising the rest of the damn party. \n\n>While you're saying \"fine, whatever\" about the details, other people think your wife is a bad mother.\n\nHoly fuck this is so one sided. So it's only about the wife? What about OP? Wouldn't he be viewed badly as well? But before I even talk more about that, let me tell you- they wouldn't be viewed badly anyway! Would you really notice that the plastic baggies your son got candy from is a poop bag? And even if so- why does it matter? It's a damn plastic bag, it's not like it was pre-pooped in or anything. It's clean, it's presentable, it's plastic. If you as a parent are going to your son's friend's birthday party just to critique the parents and the perfection of the party then I just gotta say that I hope your children don't inherit from you because that is a disgusting attitude.",
          "id": 198,
          "comments": [
            {
              "score": 35,
              "content": "You clearly didn't read their post. \n\nMen and women are 100% viewed and judged differently.",
              "id": 199,
              "comments": [
                {
                  "score": 21,
                  "content": "And as a MOM you should care more about your own daughter than the judgement you get from others. In this case, the mom was just thinking about herself.",
                  "id": 200,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 35,
          "content": "There's such a massive difference between not noticing a name on a cake being off by one letter and letting your child be dirty and ungroomed",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Right, society places unrealistic and sexist demands on women. So, the example you want to set for your six year old girl is... You *have* to meet those demands, no matter how ridiculous or inconsequential they are, and if you *don't* you may as well shut yourself off and go cry, because it's a disaster at that point...?\n\nYeah, even the \"sexism\" angle doesn't justify her behaviour. Maybe it explains her anxieties a little bit, but it doesn't justify it at all.",
          "id": 202,
          "comments": [
            {
              "score": 11,
              "content": "This is the thing I'm struggling the most with with all these YTA answers explaining why the mother is so anxious to perform for her peers. \n\nIf the conversation was about men feeling like they can't disengage from toxic group dynamics at their place of work or in their friend group out of fear of ostracism, I imagine many of the \"YTA\" respondents here would be less than patient. They would explain that the temporary discomfort is necessary for both personal growth and societal change.\n\nMiddle-class white women who feel like they need to maintain an aura of domestic perfection and are resentful that men *don't* also need to take a risk and step back from the toxic pressure to fit in and compete. Even if it means discomfort and anxiety and a risk of losing the approval of peers still stick in the cycle of toxicity.",
              "id": 203,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "This is super sexist",
          "id": 204,
          "comments": [
            {
              "score": 16,
              "content": "It is super sexist the way mom's and dads are judged differently.",
              "id": 205,
              "comments": [
                {
                  "score": 12,
                  "content": "Uh... yes.",
                  "id": 206,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "He's an asshole because other people are sexist?",
          "id": 207,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "All I got out of your post is that it's supposedly okay for someone to have cripplingly low self-esteem caused by an incessant need to impress people around them with the fake appearance of a flawless life - just so that uppity mommies don't pretentiously snicker at them behind closed doors.\n\nFuck literally everything about that.",
          "id": 208,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "So... Essentially you're telling OP that not following sexist societal expectations is... Bad?",
          "id": 209,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 900,
      "content": "YTA because of how your reacted to literally everything that went on. Everything was \"who cares?\" Clearly, your wife does, and your lack of caring and shit attitude are probably more of what upset her. You didn't even notice they spelled your daughter's name wrong.",
      "id": 210,
      "comments": [
        {
          "score": 798,
          "content": "Y does the wife have to make it about her on her daughter's  birthday?",
          "id": 211,
          "comments": [
            {
              "score": 210,
              "content": "It's not about her. It's that she has a huge project: raise happy kids, including this sub project, throw a good party. \n\nAnd she got stuck on this group project with this guy. \n\nImagine if this was how he did his job. And then got fired. That's not the manager making it all about themselves. That's a shit employee getting fired.",
              "id": 212,
              "comments": [
                {
                  "score": 443,
                  "content": "She’s crying in the bedroom while guests are trying to leave! When he asks what was wrong she refused to tell him. All while guests were waiting. She made this about her. \n\nOP commented their dog bags are normally green. How does the wife not understand how the mistake was made?",
                  "id": 213,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 200,
                  "content": "> It's not about her. It's that she has a huge project: raise happy kids, including this sub project, throw a good party.\n\nwell mission accomplished then, there is no reason to be mad. The kid is happy and the party was a success. \n\nIn part due to the father spending quality time with his daughter preparing the gift bags and saying goodbye to everyone after his wife almost ruined the party by getting mad over a tiny detail and skipping the goodbyes.",
                  "id": 214,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "Nah it’s more like if a waiter brought out someone’s food on an appetizer plate instead of the main course plate so the chef goes into the freezer to cry about it and stops cooking everyone else’s food.",
                  "id": 215,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 30,
                  "content": "Sounds like she's the shitty one in the group project, though.  SHE's overreacting because her daughter wanted the poop bags as gift bags.  SHE's overreacting over a fucking H, just scrape it off.  The fact that she even demanded that he go all the way back to the store for a fucking H is ridiculous.\n\n&#x200B;\n\nThe party was fine, and I'm sure 99.9% of the parents that came had any idea that their gift bags were poop bags.  100% overreacting.\n\n&#x200B;\n\n\"I don't want to show my face at school anymore.\"  Good, then don't.",
                  "id": 216,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "Nope.\nIf the customer is happy and say you did a great job, nobody will fire you. It would be a shitty move from the chef if he fired him because he doesn't like it.",
                  "id": 217,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 27,
                  "content": "I hope you’re never a boss\n\nHe proposes functional solutions to problems and adapted to situations on the fly without panicking or turning into a wreck \n\nYet you would fire them? I’ll take all over your functional employees and you can keep the neurotic perfectionists for yourself",
                  "id": 218,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I'm referring not to how he acted on the day, but how dismissive he is of her point of view. \n\nShe thinks it was unacceptable. We don't know the ecosystem she lives in, but she might be correct--maybe some of the mothers are incredibly cruel, and there are downstream consequences of this (possibly socially for her daughter) that he hasn't considered. Evidently, she usually goes to the school frequently. It's possible that there was a different event AT the party that upset her. She might see the situation differently (and probably does, based on her totally different reaction), and it's possible that he actually was in the wrong. \n\nHowever, he hasn't even considered that possibility that he should take her feedback and worldview seriously, much less asked how to do better.",
                      "id": 219,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": ">It's not about her. \n\n\n>It's that *SHE* had a huge project. \n\n\n🤔",
                  "id": 220,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": ">  raise happy kids, including this sub project, throw a good party\n\nBy all accounts it was a terrific party. The daughter loved it, didn't care about the bags confusion and thought it hilarious, nobody in the school mentioned it...\n\nThe party was a success for all we know.",
                  "id": 221,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "How do you know he didnt help?",
                  "id": 222,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "And now the thing that the daughter will remember the most from this party is her mother ruining it. Good job.",
                  "id": 223,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 310,
          "content": "Why does improvising and not caring about details an asshole move, but putting so much care into random details that you flip out and put a damper on the party ok? I mean, at least ESH I could get",
          "id": 224,
          "comments": [
            {
              "score": 64,
              "content": "Like she legit took the box away and tossed it on the floor, presumably making someone not recieve one,\nOver a bag not being specifically correct.  I mean cmon, a bag isnt a poop bag until it has poop in it.i do not understand. Ifeel like karen wants to see the manager",
              "id": 225,
              "comments": [
                {
                  "score": 21,
                  "content": "Haha yea! I’ve made poop bags into a lot of other types of bags and other bags into poops bags. They are BAGS. If there is poop in a sandwich baggie BAM it’s a poop bag. If there are treats in a poop bag then BAM it’s a party bag. Magic.",
                  "id": 226,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "If the roles were reversed and the husband grabbed the box from the wife and threw it on the ground I'm sure the top comment would be how she needs to divorce this abusive monster at once. This sub is generally much harsher on males.",
                  "id": 227,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yup, and the comments would be *has he been violent before* and *you and your daughter are not safe around him*.",
                      "id": 228,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "why do find I find this comment so funny",
                  "id": 229,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "It’s a party for a child. There’s going to be mess and noise and chaos because they’re children. Making a big deal of it won’t help anything and will only stress you out. \n\nHonestly this is the reason we don’t do this nonsense for my siblings. We have cake and food at home with friends and family or we go out to a restaurant. There’s no plans except eating and having fun with loved ones.",
              "id": 230,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 221,
          "content": "You read \"who cares?\" As literally not caring. I read it as \"This isn't such a major issue\"",
          "id": 231,
          "comments": [
            {
              "score": 50,
              "content": "EXACTLY. Thank you. This could just as easily be, “hey, this isn’t that big of a deal and not worth getting worked up about. Let’s focus on our daughter having a good time”",
              "id": 232,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Exactly. Because none of the things in this story are major issues. It’s not that he *didn’t notice* that the bakery spelled his daughter’s name wrong as many comments in this thread like to say, it’s just that he had the practical and common-sense idea of just scraping the extra letter off instead of going back the the bakery and demanding they make him a new one for free. You can tell his wife is a “can I speak to your manager” type.",
              "id": 233,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "How does this make any sense? Just because someone else cares more about some complete nonsense everyone else is suppose to care? Is that your argument? You realise the daughter and guests also didnt care? It was only the wife.\n\nAre you telling me his wife only wanted the party to be perfect so she'd look good? Are you telling me shes vain and selfish?",
          "id": 234,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "If the wife was of sound mind she would not have cried and thrown a tantrum DURING the party.\n\nIt’s more likely that he never checked the cake than that he doesn’t know how to spell the name of his daughter.",
          "id": 235,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}