{
  "post content": "This is almost certainly not the first time such an AITA has been posted but I’m in the shit.\n\nI’m 24, female, work at a crappy store. I’m kind of a chucklefuck (I think that’s the technical term) and have a good rapport with all my coworkers. My manager (35F) and I in particular have a fun relationship where we rib at each other. Coworker who I’ll call Teddy is in his early 40s and male. Not even a boomer. He’s quiet, but we sometimes joke about things or discuss stuff, and I like him. He works hard.\n\nAbout three days ago there was a Bernie rally in our city. My manager went and talked about it in our work group chat. Teddy said something disparaging about the candidate. I’m not even particularly political person, but it struck me as funny that he would soapbox in the work groupchat to begin with, so I hit him with the “OK, boomer.” It was on the mind because of that awful twitter video that just went viral, you know the one. The conversation died after that.\n\nThe past two days he’s been even more quiet than usual, and VERY rude. My manager and I assumed he was having some troubles at home. But last night it dawned on me that he may have been upset by the text. My manager disagreed—EVERYONES heard that meme, she said, and we’re pretty sure he’s Gen X, anyways.\n\nWelp. He quite literally just walked in and accused me of disparaging his age and appearance. I apologized, said I know I can be flippant and promised I’ll tease him less, thanked him for being honest with me, etc. He’s still being very rude to me, ignoring us and speaking angrily and under his breath.\n\nI feel bad! Age is obviously a sensitive subject for him. But my manager and my friends basically just laughed it off and said it was fine. Our job sucks. I want this to be a nice place to work. I don’t want to be the insensitive bitch who makes fun of my older coworkers.\n\nTL;DR: “OK, boomer”ed a Gen X coworker who took it very personally. AITA?\n\nPS: this meme is now dead to me. :(",
  "id": 1,
  "comments": [
    {
      "score": 161,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 43,
          "content": "Bingo. Once politics is the subject you’re already dangerously close to the line. One small misstep and you’ve officially overstepped it.",
          "id": 3,
          "comments": [
            {
              "score": -37,
              "content": "The kicker is I can’t even vote I’m Canadian. LOL",
              "id": 4,
              "comments": [
                {
                  "score": 33,
                  "content": "So in addition to everything, you didn’t have a dog in this fight? Lmao! \n\nAnyway for future reference; the baby boomer generation is the children born after WWII, between approximately 1946 and 1964. GenX is 1964 to 1982. And millennials are 1982 to 2000. Roughly. Your coworker, being in his early 40’s, was born in the late 70s.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Millenials are 1981 to 1996",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -25,
                      "content": "Good to know. And yeah, I literally didn’t even care but made fun of him anyways! You know what that makes me? A braindead zoomer!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 78,
      "content": "YTA just because he’s seems shy and sensitive and you ran him over.  He’s probably having flashbacks of being the picked-on shy nerd from high school and you’re the cool kid.  Just bring him and include him in the fun and he’ll be fine.",
      "id": 8,
      "comments": [
        {
          "score": 25,
          "content": "Oh god you’re so right! I was that kid getting picked on too. I should know better. Thank you, very constructive reply.",
          "id": 9,
          "comments": [
            {
              "score": 4,
              "content": "You’re welcome!  It’s hard to hang with the young, cool kids (knowing you’re an old outcast). Then to get called out on it surely hit a huge nerve.   Nice of you to be so open to feedback. Good luck!",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 47,
      "content": "YTA.  Just because your job sucks doesn't mean you can take it out on a coworker.  Also, you manager is very bad at their job for bringing up politics in a work environment and for not shutting down your \"chucklefuck\" behavior long ago.",
      "id": 11,
      "comments": [
        {
          "score": -36,
          "content": "Maybe I should enter a nunnery",
          "id": 12,
          "comments": [
            {
              "score": 53,
              "content": "That attitude right there is the problem. I'm fluent in Sarcasm, but a lot of people aren't. Humor is *very* situational and if you don't know your audience, you're likely to hurt feelings.\n\nThe issue is that you don't know this guy because he rarely talks, and when he finally did, you shut him down with something that (to most people who are withdrawn) does *not* look like light-hearted teasing, but comes across as middle-school bully-ish.\n\nIt was rude. It hurt his feelings. No one is asking you to become a nun. Just be kinder to people.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Is your name Ophelia?",
              "id": 14,
              "comments": [
                {
                  "score": 0,
                  "content": "one of my favorite lines ever",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 38,
      "content": "YTA, you can’t just insult people because you disagree with them. \n\nYou can’t say “you’re too old to understand, you’re out of touch” and then say “just kidding” and then act like “what’s the big deal?”.",
      "id": 16,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 22,
      "content": "YTA your manager got up on the soapbox first. Talking politics at work or in a workchat is not really appropriate. Smart comments can also get you a free trip to HR.",
      "id": 17,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 17,
      "content": "YTA. You may have to reevaluate your assessment that you have a good rapport with all your coworkers",
      "id": 18,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 16,
      "content": "YTA- sounds like you might not have such a good friendship with your coworkers. Not to mention ok boomer is the most annoying meme of 2019. Played out. Ok boomer?",
      "id": 19,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 13,
      "content": "YTA\n\nIt is not appropriate to address people with racial, gender, and in this case ageist comments which unfortunately \"Ok Boomer\" has become.\n\nI would recommend you avoid topics relating to politics in general but if you cannot, to nip it in the bud if one or another party gets aggitated by the topic.\n\nAvoid topics relating to Race, Gender, Age, politics, abortion, gun rights, Nationality which are in my opinion the controversal topics.",
      "id": 20,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "YTA come on you describe him as the type that doesnt pay attention to memes and would have been bullied as a kid. plus eh this doenst have a place in the world place",
      "id": 21,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "Edited to NAH\n\nYou said something that offended a co-worker, and in your apology you promise to tease him *less*?",
      "id": 22,
      "comments": [
        {
          "score": -2,
          "content": "Ok LMAO I didn’t say “less” I said “I’ll stop teasing you.” Bad wording on my part.",
          "id": 23,
          "comments": [
            {
              "score": 4,
              "content": "Okay, that makes a difference, in this case, I'll say NAH based on the assumption that it wasn't \"unreasonable\" that friendly ribbing was okay.  Whether you are TA or not then depends on your relationship with this guy.",
              "id": 24,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}