{
  "post content": "My brother Terry is non-verbal and, according to his specialist, has the intellectual/mental capacity of a very young child. Terry can still be very difficult to look after. He will experience meltdowns if something makes him uncomfortable (such as a food texture he does not like) or will throw fits if he cannot have his way. Terry has broken holes in the walls during his meltdowns/fits and I am honestly afraid of him whenever he becomes destructive that way because he is larger/stronger than me.\n\nI had been parentified by the time I was about thirteen because my parents expected me to handle Terry’s needs whenever they were busy or needed a break (which was often.) I have been upfront with my parents that I still hold resentment towards them because of this, and that Terry should not have been my responsibility to the extent they made him. My parents insist their parenting was perfect and are unwilling to alter their viewpoint. I have told them that I am not going to be Terry’s caregiver and to not leave him with me.\n\nUnfortunately, my parents know where I live. Recently, my parents have begun ringing my doorbell, telling me to watch Terry, and then leaving before I can say anything back. Then I’d have to cancel my plans and wait on the porch with Terry until they came back. When they came back, I told them all four times to stop doing this, but was ignored every time. I was forced to call out of work for the most recent “drop-off” incident. I lost my temper with my mother when she came to pick Terry up and told her that if she or my father try to leave Terry with me even one more time, I will call Adult Protective Services and report Terry as abandoned.\n\nA few days later, my mother again dropped Terry off on my porch and took off. So I followed through with my word and called to report Terry as an abandoned disabled adult. I waited with him on the porch until a social worker came. My parents exploded on me, calling me a horrible daughter and sister. They said they were barely able to get Terry back and accused me of only caring about myself and wanting Terry to be neglected in a public group home. I snapped at them that Terry would probably be better off in a public group home because they’re the ones neglecting him for their own convenience. And that I’m not going to keep putting my life on pause for their own personal comfort anymore.\n\nNow people (mostly friends of my parents) who I barely even knew or remembered before, are bombarding me with messages calling me selfish. A few have approached me in public to tell me that I don’t give a shit about my brother and I’m ungrateful for all the sacrifices that my parents made for me and Terry. I’ve already changed my phone number. But it’s getting so bad that I am considering applying for a job transfer and moving. AITA and are their words toward me deserved?\n\nUpdate: Hello, everyone. I am not sure if anyone is still reading this post. But I wanted to give a brief update in case anyone is still interested. I applied for the job transfer and was approved. I will be completely moved to my new city in a few weeks. I have only told a few close friends, so they could help me move discretely. I have not told my parents that I am moving or my new address. And my friends know to either not tell them or give them an imaginary address. I wanted to thank everyone for your kind words and support. :)",
  "id": 1,
  "comments": [
    {
      "score": 11126,
      "content": "NTA.\n\nAnd if you can, move. Meanwhile, fi they accost you on the street just tell them you don't know them, don't know what they're talking about and leave. If they follow you threaten to call the cops due to harassment. They'll leave you alone. And go NC with your parents. So sorry for your brother, but that's on your parents for being abusive.",
      "id": 2,
      "comments": [
        {
          "score": 3201,
          "content": "And, by \"move\", ideally out of easy driving range.\n\nFor a lot of people, leaving their hometown is a big deal. However, there are a decent number of AITA issues for which it is an effective solution, so it's something worth considering.\n\nIf you're not around, it's a lot harder for abusive/entitled/etc family to do their worst. No, in a perfect world it should not be necessary, but this is a subreddit about assholes, so we know the world ain't perfect.",
          "id": 3,
          "comments": [
            {
              "score": 2011,
              "content": "Sounds like there are a lot of other people around who can take Terry. All those people harassing her.",
              "id": 4,
              "comments": [
                {
                  "score": 1502,
                  "content": "Yes, this. Make a form letter and copy paste it as a reply to all those people. \n\n\"Thank you for your concern regarding my family. We appreciate your help all the more now that I'm working full time and living on my own. I'm currently making a list of people for my parents to call when they need someone to watch my brother when I'm unavailable. Please let me know which days of the week work for you.\"\n\nETA NTA and thank you for the awards!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 128,
                      "content": "🏆",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 109,
                      "content": "I'm the one that you replied to and you are awesome for that perfect wording!! 100% yes that's exactly what it should say! In fact I give you an award",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "[removed]",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Love it.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I love this idea!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "This ⬆️",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This is perfect!!",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I wish I had gold award thing to give you. Bravo!!!!!",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Fabulous response.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 599,
                  "content": "Yeah, sounds like they have some free time on their hands, and they seem to care so much about Terry's welfare.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 149,
                  "content": "THIS.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 138,
                  "content": "This is your answer and response. Thanks for your concern I will let Mom and Dad know you support others taking care of Terry. They will call you to set up a drop off time at your house.  Put in a ring camera if you can to provide a recording if they decide to repeat their shenanigans. NTA but your parents are!",
                  "id": 17,
                  "comments": [
                    {
                      "score": 229,
                      "content": "Cross out the “they will call you”. Just say “thank you for your concern for my family. It’s been difficult now that I have a job and I can’t keep calling out of work every time my parents need someone to watch terry without any prior notice. I’m so happy to find out that you understand and are able to watch terry in such a situation, and I will send them your name so that they can drop him off at your place whenever I am busy and my parents decide they need a break. It warms my heart to see how many people care about terry and are willing to help out now that I have a job and can’t take him as often”. \nIf OP doesn’t get notice, and everyone is blaming her, then why should they get any notice?",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 60,
                      "content": "“They will call you to set up a drop off time at your house”.\n\nOr NOT! They’ll just show up! \n\nActually, seeing that they’ve already agreed this is reasonable, just tell them no need for the schedule. The parents will just show up. Since they’ve already agreed not taking this on at the parents whim is cruel and selfish, it should be no problem.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "This.\n\nOP, anytime anyone approaches you in public, tell them it sounds like they are volunteering to watch terry, thank them and immediately send a voice text in front of them to your parents telling your parents that (name) has volunteered to watch Terry next time they want to dump him and run without notice.\n\nFor the people who text you, respond with \"thank you for volunteering to watch Terry. I will let my parents know you are willing to do so and now I am blocking you because i'm not interested in your abuse.\"\n\nThen again text your parent that (name) is interested in watching terry.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 689,
          "content": "> And go NC with your parents\n\nThis is like restraining-order territory for me. The parents need to know that this is not an okay thing to be doing, it's putting a disabled person in real danger (what if OP just left their brother and went to work, and the brother wandered off?)",
          "id": 21,
          "comments": [
            {
              "score": 372,
              "content": "Or if the parents knew OP again would say \"no!\" and played ding dong ditch? If they care so much about Terry, they wouldn't leave him with a vehemently unwilling carer who is rightfully afraid of him.",
              "id": 22,
              "comments": [
                {
                  "score": 277,
                  "content": ">a vehemently unwilling carer who is rightfully afraid of him\n\nThis! OP says he gets destructive when he gets worked up and that his specialist has said that he has the mind of a young child. Assuming this is true, OP has every right to be afraid.\n\nChildren who have trouble managing their emotions might hit or headbutt out of frustration, and young children aren't good at judging their own strength. In this case, it could mean serious harm to OP if he were to lash out in that way.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 163,
                      "content": "that seems to be a big issue especially with mentally disabled men like this. they usually grow taller than their parents or female siblings and if the parents dont do a good job at controlling their diet they can get fairly large too. its one thing to get hit in the shin by a 80cm child but if thats a full grown adult whos taller than you and twice your weight its actually dangerous. if youre not equipped for that you cant be a caregiver for someone like him. op is rightfully scared.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "And who would be responsible for OP'S injuries? I sincerely doubt 🤷‍♂️ good ole mom and pop!",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 115,
              "content": "What if OP hadn’t been home when mom left him on their porch?",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 84,
              "content": "The nice thing about a restraining order in some places is that causing others to violate it - by encouraging street harassment- is considered a violation of the order.\n\nNTA",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "Restraining order also simply because they're forcing someone into likely termination for frequent job abandonment, cuz this would eventually get OP fired.",
              "id": 28,
              "comments": [
                {
                  "score": 11,
                  "content": "Which might be a feature, rather than a bug. No job means more free time to watch the brother.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": ">The parents need to know that this is not an okay thing to be doing\n\nOP already told her parents it's not ok and already told them to stop and mentions in her post how she also already told her parents how being forced to be brother's caretaker at a young age hurt her. What else can she say at this point?\n\nNTA, OP. I'm sorry for your situation.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "> it's putting a disabled person in real danger\n\nIt's putting both of them in danger.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "Or if OP wasn't there?",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 347,
          "content": "Tell the flying monkeys to put their money where their mouth is. Why don't THEY babysit Terry every time their parents need a break. See how fast they shut up. You don't patentify one child to take care of the other. THEY are the parents, you have no children, and they did abandon him. NTA",
          "id": 33,
          "comments": [
            {
              "score": 154,
              "content": "Exactly! I hate these kinds of people. They're the same ones who berate people who put a loved one in a nursing home yet don't lift a finger to help OR even visit when the person is out in a home!",
              "id": 34,
              "comments": [
                {
                  "score": 99,
                  "content": "Or criticize when you are tired of being a caretaker for your mother for over ten years and your brothers complain while doing nothing. My life.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Oh, me too!!",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Oh, I feel for you, this is horrible. I think there is a special circle in hell for those suckers.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Yeah.  So, a bit later today I'm off to visit a friend/former neighbour in the local psych ward.  Guy is 97.   In October, for complicated reasons, he end up homeless and living with his daughter in a motel.  Wife in a nursing home with dementia.\n\nWife dies at Christmas, daughter dies in January.   Somebody made the good call to have him admitted to psych, on a 3 month hold.\n\nWhich sucks, but -it's not because of his mental health, it's to keep him off the streets while they find him a spot in a nursing home.  Except that time is running out, and he may end up in a shelter.\n\nMyself and a friend have been visiting him a few times a week, buying stuff he needs, toiletries, clothing, whatever.\n\nHere's the thing -he has a fair amount of family in the city, who are ignoring all of this.  And he's not a mean or abusive man - he really is a good person.  Family just doesn't care.\n\nEverybody says how horrible the situation is, but nobody lifts a finger.\n\nSeriously - if you're reduced to having me as the best source of help in your life, you are well and truly fucked.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 3,
                      "content": "It's so kind of you to help him out!! He's lucky to have you.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "And then get furious that they were left out of the older person's will!",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "You missed an opportunity to say \"put their monkey where their mouth is\".",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "So right!",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "OP, I would talk to a lawyer about harassment charges and send your parents a letter from the lawyer. I would get security cameras. I would respond to anyone who calls and texts. \"This will be forward to my lawyer and the police for harassment charges.\"",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "This is the best strategy. If OP doesn’t engage these “well wishers”, then there would be no public drama.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "NTA. \n\nI’m sorry you were treated like this.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Just make sure to move far enough away that parents can't drive there and back in a day.  Long distance is your friend with parental relationships like this one and \"communities\" where they'll busybody you to death in support of negligent, selfish parents.  Bonus points if you can pick a place your parents would never move to in the future.\n\nOn another note, it's pretty awful how the parents are favoring their son over their daughter.  They literally do not care about her feelings or needs, just their own and their son.  It's pretty messed up.\n\n  \nDefinitely NTA.",
          "id": 46,
          "comments": [
            {
              "score": 14,
              "content": "Just to be clear, they are not favouring the son - they are favouring themselves. It's a lot cheaper and easier to force the care of their son onto their daughter than to source out a good care home/professional carers, and help their son with that transition. He is *not* safe staying with OP - if she is worried that he might accidentally injure her, he probably needs a second carer present. This is a dangerous and unsustainable situation for everyone involved",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I would argue they don't care about their son, either",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I wonder if these friends ever offer to babysit.",
          "id": 49,
          "comments": [
            {
              "score": 7,
              "content": "You already know that answer",
              "id": 50,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Agreed with going NC. I’ve had to call Adult Protective Services on a parent as well and it is extremely hard. I felt guilty over it, but it was for the best. You’re not the caregiver, and you never consented to watching him. The fact that you’ve had to disrupt your own job is too much. You telling them flat out that you would call was a warning they chose not to heed. I hope it all stops finally.",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Honestly this is the move right there.  Start calling the cops on the harassers.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3185,
      "content": "100% NTA. Dropping your disabled brother off on your porch and running off after ringing the doorbell is rediculous. What if you aren't home or can't come to the door? They are the ones putting him in danger, not you. If it's possible to move do so, you don't deserve to be harassed. Who knows what version of the story your parents are telling these people.",
      "id": 53,
      "comments": [
        {
          "score": 806,
          "content": "Exactly. And like, I don't know if Terry is a \"runner\" or not, but if he is he could absolutely be gone by the time OP answers the door.",
          "id": 54,
          "comments": [
            {
              "score": 793,
              "content": "Also, what about the fact OP has has to call out of work when they’ve done this. Basically, effecting OP’s quality of living & their finances. \n\nParents are completely selfish & don’t care about either of their children. \n\nNTA",
              "id": 55,
              "comments": [
                {
                  "score": 441,
                  "content": "That too, bet OP's parents would only care about OP losing her job because then they'd have an excuse to push her to be a full time caretaker to Terry. OP should move as far away as possible and get a PO box so they can't find her.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 78,
                      "content": "##THIS IS A GOOD IDEA!\n\n!update",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "I was thinking this as well. They are putting OP's job in danger. Horrible people.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Not only ridiculous but abusive",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -13,
          "content": ">rediculous\n\n\\*ridiculous",
          "id": 60,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1699,
      "content": "NTA. I am an in-home caregiver for two young adults with severe autism. It’s 100% unfair for them to have put that responsibility on you as a child and to continue their actions by randomly showing up on your doorstep as an adult. They clearly need to hire a caregiver themselves whether that’s someone they pay for out of pocket a few times a week, or someone who can work full-time through his state benefits. You are in NO way selfish and anyone who calls you that should be kicked out of your life. I can barely do what I do (I have been hit and hurt multiple times during meltdowns) and I have actual training and experience for it.",
      "id": 61,
      "comments": [
        {
          "score": 642,
          "content": "I had to quit my job of 14 years to stay home and be my adult daughter’s full time caregiver. She’s nonverbal also. My in-laws used to watch her but now they are in their 80’s. The abuse we take from her leaves bruises and whelps on us that hang around for weeks. We are all afraid of her but no one in our state would work with her after she graduated high school. Plus it has never crossed my mind to expect my two other children to take on the responsibility to care for her any amount of time. I know they love her and they treat her with respect and try to socialize with her. They have their entire lives ahead of them and it would be selfish of me to put any of this responsibility on them. The OP’s parents are 100% the assholes.",
          "id": 62,
          "comments": [
            {
              "score": 355,
              "content": "I don’t know the specifics of your situation but I’ve heard that a lot of dysfunctional autistic adults are much happier when placed in group homes, even if their families have the resources to take care of them.",
              "id": 63,
              "comments": [
                {
                  "score": 228,
                  "content": "My grandmother had a sister with development issues and she was much happier in a home than she was with her siblings. They would take turns caring for her so none of them always had her (after their parents passed). They finally got to the point they just couldn't do it anymore, between her health issues and theirs, and put her in a home with all of them pitching in to pay for it. She was always so happy when I went to visit her there, unlike when I saw her at her siblings homes.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 177,
                  "content": "I used to work in a residential school for children and young adults with severe autism, and every single one of them was happier there than they were at home.\n\nWe were able to give them the care, routine and regular therapy their parents couldn't - and the reason they couldn't is because it simply isn't possible to meet that level of need without giving up your life completely. All of the kids I worked with were looked after on *at least* a one-to-one basis, 24 hours a day. Some needed two or even three members of staff with them at all times, who swapped out regularly when their behaviours became particularly challenging.\n\nUnfortunately, the stigma of these residential places being 'dumping grounds' still exists. Parents often don't even consider residential care for their child until their marriage is about as ruined as their home, because they are terrified of being judged for 'giving up'. The reality is, most people who look down on these parents have absolutely zero concept of what severe autism looks like and will never fully understand unless they work in the industry or have a child/close relative with the condition.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "I know of a nonverbal I man who is also mentally a young child from my community who was put into a group home when his mom could no longer handle him. When she started needing the help of her older son with certain situations (he was the only one who was strong enough and able to calm the younger one) the family decided that the best thing for everyone was to put him in a group home. From what I’ve heard since then, he is doing well there.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Yep. I have an older cousin who had an intellectual disability and she loved the facility.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "We’ve tried that avenue with every group home that takes our insurance and/or Medicaid Waiver. The reason they wouldn’t take her is the main reason we need their help. She’s too violent and they can’t put the other patrons at risk of being hurt or worse. She went to a day program for three months and got discharged after a couple of stunts. I understand that the staff is trained for this kind of thing, but a defenseless person is a wheelchair is not.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "Try to get some help doing this. Get a real break as often as possible. It has to be a huge strain on your mental and physical health and you won’t be able to do it forever. Bruises and welts…. Yikes",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "You’re a wonderful mom 💖",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "You need to see if her insurance covers hamaspike or something similar. I have it and if my parents weren't my caregivers I could have nurses come help me with what I'm usually helped with",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "How you’re handling your children is admirable. Raising them to have their own lives but still love and respect their sister is the right path. \n\nIt breaks my heart you can’t get any support from the people who should.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "If you haven’t already heard of [Jessica Ronne](https://www.jessplusthemess.com/blog/), look her up. She has written some powerful books on living with adult children who need full time care. Her blog is raw and real, and helps people not feel so alone in what they are doing.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "What you said there, it never crossed my mind to expect your other children to help. I wish there were more people like you. I hope OP sees your reply.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "Absolutely NTA. My eldest has severe autism and is nonverbal. There is absolutely zero way we would ever expect her sister to become her carer. Caring for her is our responsibility as her parents. Making sure our younger kid is able to live her own life the way she chooses without being parentified is ALSO our responsibility",
          "id": 75,
          "comments": [
            {
              "score": 23,
              "content": "One of the families I work for has two older sons who are both away attending college, something they are able to do with full support. The other has an adult daughter who helps when needed, but it is her choice and she gets paid if it’s for an extended period of time. OP’s parents are way out of line and it makes me worry about the care they are (or were) providing",
              "id": 76,
              "comments": [
                {
                  "score": 4,
                  "content": "Yeah see that’s the way it should be. OP’s parents are dramatically failing at parenting and it doesn’t sound like it’s a new thing",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Exactly they can see if they're insurance covers hamaspike or something similar",
          "id": 78,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 912,
      "content": "I'm so happy for you and impressed that you developed a healthy sense of self and know what you are required to do and what you are entitled to as a human being. Watching your brother is a full-time job and the fact that your parents assume you can do it whenever they drop him off is so disrespectful. \n\nHere's my advice. Move. And don't let them know where you live. And pray for Terry if you pray, or visit Terry if he winds up in a home, and give what you can to him. And I commiserate with your early adulthood. For very different reasons I was also needing to be grown very young. It sucks. Your boundaries are reasonable. It is a sad situation. They are handling it, in their desperation, like monsters. NTA",
      "id": 79,
      "comments": [
        {
          "score": 64,
          "content": "Oooh,  this is good advice if OP can do it.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Dekebasswood, you are wise.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 547,
      "content": "NTA.\n\nYour parents wouldn't respect your boundaries,  They will now.\n\nYour parents wouldn't take proper care and arrange for proper respite care for Terry. They will now.\n\nAs for the peanut gallery, reply to every message that they are never to contact you again and if they do you will call the police for stalking. The screenshot the message so you have proof later. If they accost you in public, immediately ask them for $1,000 so you can create a respite care fund so Terry can get qualified safe care when your parents need a break. When they refuse, tell them then they need to shut the hell up about how your family takes care of your dangerous and unstable brother and never speak to you again until they pony up for his care.",
      "id": 82,
      "comments": [
        {
          "score": 59,
          "content": "This is the way.",
          "id": 83,
          "comments": [
            {
              "score": 233,
              "content": "You should ask anyone complaining how many times they have taken a shift supporting Terry.\n\nOh? None?\n\nWould they like to pay you for your lost wages when Terry gets dumped on you with no notice?\n\nNo?\n\nOr help you find a new job if you lose yours for calling out without notice? \n\nUnless they are HELPING, they can shut it.  Especially since they'vr only heard one side of the story.\n\nThere IS respite care available, with caregivers trained to support people who may become physical when upset.  It is often available in Their Own Home.  \n\nYour parents need to work with this social worker to find out what's available instead of dump-and-running on you.\n\nMove, and enjoy your life. You have done MORE than enough.\n\nGet a lawyer to contact them to let them know you will NOT be able to care for Terry later in life, and that they should start making arrangements for him NOW.  Copy it to the social worker.\n\nYou don't want any surprises where the State tracks you down to say that you've been assigned as his guardian, etc.",
              "id": 84,
              "comments": [
                {
                  "score": 73,
                  "content": "This, because they're very sneaky about \"just a couple days while we place him\" and then \"maybe a week or two, everywhere is full\" on to \"well it's just a couple more months\" and so on.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": ">Your parents wouldn't respect your boundaries, They will now.\n\nIt doesn’t seem like it, considering they’re having their friends harass OP.",
          "id": 86,
          "comments": [
            {
              "score": 6,
              "content": "I doubt they’ll take better care of Terry, either. However, that’s on them, not OP. \n\nOP is NTA, but the parents are.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Whenever you set a boundary with people like his parents they always over react in an effort to guilt /punish the person to get back in line and do what they’re told. OP has put up with this behavior for a long time. And in the past if she has balked at this before they may have used the same tactic with success. With that success it reinforced the behavior so they will definitely use it again. People hate change. It’s easier for them to send their flying monkeys to harass OP than find another solution. They’re attempting to guilt OP into doing what they want. This is very normal behavior for someone like this. OP needs to just stand firm and not give in. Better to not engage as well and it still might get worse before it gets better. Because if it worked last time then they may just ramp up the harassment in hopes that OP will give in. But eventually when they see OP is serious it will taper off/stop. But it will be very important that OP not let them win this. Thats not to say they still may give passive aggressive or guilt trip type remarks here and there but people like that can’t help themselves. You can modify some behavior but a tiger can’t change its stripes.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 264,
      "content": "NTA. I was an APS worker previously and you did the right thing. If you are in the US, they have special housing for the intellectually disabled where the accommodations are nicer than a traditional group home and he could go to a day program and have social interaction and do activities. Medicaid pays for it. It’s called the SCL waiver. Your parents need to look into it or risk losing him for good.",
      "id": 89,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 196,
      "content": "NTA. I'm really sorry that your parents don't see you as their child, but as a built-in carer for Terry. \n\nThe truth is that your parents are never going to protect you. They're never going to put you above Terry. You *must* protect yourself from your parents and their behaviour. Terry is *not your responsibility*. Anyone who tries to tell you that you are a bad person for refusing to give into your parents' entitlement is an AH. Your parents have to figure out how to manage Terry's care, and managing his care by dumping him at your door does *not* count. They deserve to have APS called on them because they are *neglecting* your brother.\n\nFor the future, because it will certainly only get worse as your parents get older, if your parents name you as Terry's carer you do *not* have to accept. They can not force you, while they are alive or after they die, to become Terry's carer.",
      "id": 90,
      "comments": [
        {
          "score": 56,
          "content": "> My parents insist their parenting was perfect and are unwilling to alter their viewpoint.\n\nYou forgot that the parents are perfect and can't be assigned any responsibility here. /s\n\nOtherwise this is the answer.",
          "id": 91,
          "comments": [
            {
              "score": 17,
              "content": "You're right. They clearly think they *continue* to be perfect parents because they take such *good* care of Terry. /s",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 138,
      "content": "NTA\n\nThe next time you move, it'd probably be best not to share your address with your family, as unfortunate as that is.\n\nYour parents (and anyone else coming out of the woodwork to support this nonsense) sound like excellent candidates to go no contact with.",
      "id": 93,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 114,
      "content": "NTA,  Your parents should have looked for a placement for Terry years ago.",
      "id": 94,
      "comments": [
        {
          "score": 29,
          "content": "Exactly his needs require more resources and skill set and his parents are exhausted. And truthfully it will become even harder as they age let alone pass away. Finding and securing a spot in a good facility is critical are now/",
          "id": 95,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 67,
      "content": "NTA. I would have done the same",
      "id": 96,
      "comments": [],
      "relation": "Support"
    }
  ]
}