{
  "post content": "Here are the reasons why I feel I might need to skip my sister's wedding ceremony.\n\nI had surgery in February for gastric sleeve and now have new guidelines to keep my body healthy. One of them is to drink water regularly to avoid dehydration especially if I'm outside in the heat. This is the main reason why I might need to skip out on part of my sister's wedding.\n\nThe ceremony will be outside in mid-afternoon near the end of July. Humidity in her state is high and the summers are blistering. At first, I figured I'll just bring a water bottle with me and sip on that so no problem, however, I went on a walk yesterday high 80's outside with clear skies. I was ten minutes into my walk when I started seeing lights and feeling light-headed. I drank some water and it helped enough so I could get home but I nearly blacked out before I made it inside. This scared me. If drinking water out on a relatively hot day where there is little humidity could cause such a reaction I'm not sure if I could handle sitting under a hot, wetter heat for my sister's wedding.\n\nI don't want to cause a scene at her ceremony if I faint or have to leave in the middle of it due to the heat. So if it's really as hot as it should be on her wedding day WIBTAS if I didn't attend the ceremony? I also want to clarify that I intend to let my sister know in advance and this is her second wedding, not her first.\n\n\\*\\*I also want to make it clear that I go on walks often, usually early morning or late evening so I'm not out during the hottest periods of the day but on the day I nearly passed out I was out earlier in the afternoon which will be the around the time the wedding ceremony is scheduled.\n\n\\*\\*Lastly there will be nothing shading the guests during the ceremony. It's out in the open on grassland with no trees nearby.\n\n&#x200B;\n\nEDIT- Thanks for the insight. I got some good points of view and thoughts on possible ways to not be an a\\*\\*hole in this situation. I'm gonna talk to my sister and hope some of your recommendations work out. ",
  "id": 1,
  "comments": [
    {
      "score": 17,
      "content": "NAH. Before you decide you absolutely can’t attend, discuss your concerns with your sister. There may be some accommodations that can be made for your health and safety. Don’t get too wound up about this until you’ve talked to your sister.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "NTA, but there are options - you can get frozen wraps  to go around your shoulders, portable fan, a hat, plenty of fluids from an esky fill of ice, and many many more  options. Take time to consider these before making a decision you may really regret.",
      "id": 3,
      "comments": [
        {
          "score": 4,
          "content": "Those are some really good ideas. The frozen wraps sound like they would do the trick with a bottle of water.",
          "id": 4,
          "comments": [
            {
              "score": 2,
              "content": "A really pretty parasol that matches your outfit works well. I suffer from overheating due to meds and this helps. I don’t know if you can get something similar but I also use kook n soothe gel. It doesn’t actually add to cooking but it does make you feel more comfortable.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "YTA if you just use this one time to judge it.  Go out SITTING, like you would be doing, on a comparable day, with plenty of water to drink (not just a little drink here and there), and judge off of that.  This could have been any number of things giving you the trouble.  It comes off like you're trying to make an excuse to not go.",
      "id": 6,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "NTA. U should just explain all u said here about your experience to her so she knows there's a reason. She'll understand.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH - communicate with her. I'm sure she'll realize that others will have similar issues. Maybe she'll even consider some ways to get some shade for the guests.\n\nBut- What in the world difference does it make that this is her second wedding not her first? Why would you even tell us that as though it should make a difference?",
      "id": 8,
      "comments": [
        {
          "score": 1,
          "content": "You have a good point. It being her second wedding shouldn't be a factor at all. I'm gonna talk to my sister about the real concerns and keep clear of mentioning its her second wedding. Thanks for keeping me making a a**hole comment.",
          "id": 9,
          "comments": [
            {
              "score": 1,
              "content": "No problem :)\n\nGood luck!!",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "Are you in the wedding party? Or be sitting as a guest? If you're sitting as a guest, I'd recommend bringing a large water bottle to keep yourself hydrated. Pick a light, breathable fabric. \nIf you're in the wedding party, I'd understand why you would not want to commit to standing in front of everyone...  but I would express your concerns with your sister and choose to sit as a guest. Have you asked your sister if its going to be a long ceremony? Some ceremonies can be 10 minutes, some can be an hour. \nI'd say NAH, but I think it may look bad if you aren't there and it ends up being a short ceremony.",
      "id": 11,
      "comments": [
        {
          "score": 1,
          "content": "Sorry I should of been more clear. I'm a guest. Thanks for your input about how it could be a short ceremony. I really would feel like an a**hole if I didn't attend the ceremony and it ended up being a short one. Thanks!",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. I think your reason is valid and maybe you can attend the reception instead. \n\nIf you'd like to still attend the wedding, have you tried a portable fan?",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHere are the reasons why I feel I might need to skip my sister's wedding ceremony.  \n\nI had surgery in February for gastric sleeve and now have new guidelines to keep my body healthy. One of them is to drink water regularly to avoid dehydration especially if I'm outside in the heat. This is the main reason why I might need to skip out on part of my sister's wedding. \n\n The ceremony will be outside in mid-afternoon near the end of July. Humidity in her state is high and the summers are blistering. At first, I figured I'll just bring a water bottle with me and sip on that so no problem, however, I went on a walk yesterday high 80's outside with clear skies. I was ten minutes into my walk when I started seeing lights and feeling light-headed. I drank some water and it helped enough so I could get home but I nearly blacked out before I made it inside. This scared me. If drinking water out on a relatively hot day where there is little humidity could cause such a reaction I'm not sure if I could handle sitting under a hot, wetter heat for my sister's wedding. \n\nI don't want to cause a scene at her ceremony if I faint or have to leave in the middle of it due to the heat. So if it's really as hot as it should be on her wedding day WIBTAS if I didn't attend the ceremony? I also want to clarify that I intend to let my sister know in advance and this is her second wedding, not her first. \n\n\\*\\*I also want to make it clear that I go on walks often, usually early morning or late evening so I'm not out during the hottest periods of the day but on the day I nearly passed out I was out earlier in the afternoon which will be the around the time the wedding ceremony is scheduled. \n\n\\*\\*Lastly there will be nothing shading the guests during the ceremony. It's out in the open on grassland with no trees nearby.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA, You are doing whats best for your health, your personal health is always more important. You also said you might cause a scene by fainting, so you not attending would be whats best for you and your sister. Its not your fault that you need to take care of yourself and your health",
      "id": 16,
      "comments": [],
      "relation": "Support"
    }
  ]
}