{
  "post content": " Me \\[33F\\] and my bf \\[32M\\] have been together 2 years. When we met he was living with his parents\\*, and I was new to the area with a 1-bed apartment. I work an office job, regular 9-6 + occasional weekends for deadlines. He’s a freelance arts teacher, part-time hours, and they can be at a different school every day. His salary's not 100% stable, but on average I make about 3x his wage. The rent on my place eats about a third of my salary.\n\nHe's such a sweet, creative guy and I fell for him from the first date - we're inseparable and he's been staying at my place 5 nights a week basically from the day we hooked up. 2 mornings a week he teaches at schools near his parents' place, and so those days he sleeps back with his folks otherwise he'd have to get up like an hour earlier if he stayed over with me. It sucks 'cos I want to go to sleep next to him every night, but nobody wants to get up at 5am, so I don't feel emotionally abandoned or anything by this.\n\nBut: in these 2 years he hasn't contributed a cent of rent. He contributes \"in kind\" a bit - cooks maybe a couple of meals a week (I can't cook, we dine out for the rest), does the washing up (though not very well, grr). Meanwhile, he pays rent to his parents for those 2 nights a week, whereas he's in my apartment 5 nights a week. So, the other day we had That Conversation: I said that I want us to live together officially, I want us to be a household, and that means him making reliable contributions. I don't need his money to make rent, but, I guess... I want his commitment, his investment? Idk if that makes sense. If we split the rent 50/50 that would be 1/2 of his salary going to rent, 1/6th of my salary going to rent.\n\nI thought this was entirely reasonable - romantic, even, we were finally going to have Our Home, not just My Home!\n\nWell. Nope. I got a lot of pushback. \"I'm so poor compared to you, it's not fair that you're asking for 50/50 when you make so much and I make so little\"; \"I'd still have to send money to my parents\\*, they're my parents, I can't just cut their income stream without warning\"; \"If I have to pay rent I'll have no savings or security!\"; \"If I do this, you'll pay for us whenever we go out to eat right? I won't be able to afford to go to restaurants or movies with you otherwise\"; \"You'd be lonely if I didn't come over, I’m doing you a favor\"\n\nI was astonished. I was crying by the end of the conversation. I don't feel like I'm asking for something unreasonable. I'm not asking him to start contributing to my saving-to-buy-a-house fund that I hope he'll live in with me one day, I'm just asking for an equal split of the month-by-month, fundamental price of keeping a roof over both our heads. AITA?\n\n\\*(As I get to the end it occurs to me that it might be relevant to specify that he's Asian, so the whole lives with parents beyond 18 / sends money to parents thing is sorta the default for him)",
  "id": 1,
  "comments": [
    {
      "score": 1130,
      "content": "ESH you for asking for half of his salary in rent. It’s totally fine that you want him to contribute but perhaps it would be more fair for you to pay something more like 2/3 and he pays 1/3\n\nHe obviously reacted too intensely. It doesn’t sound like he was willing to talk out options\n\nEdit: you should discuss all the options with him. If you guys want to move it together then it might make more sense to live closer to his job so his commute isn’t so bad.",
      "id": 2,
      "comments": [
        {
          "score": 677,
          "content": "She's been supporting a guy who only works 2 mornings a week and she sucks for asking him to pay his fair share? Why is it her responsibility to pay for this guys life? They're not married...",
          "id": 3,
          "comments": [
            {
              "score": 912,
              "content": "So i get what you’re saying but I view it more like this... she wants him to move into an apartment she selected, at a price she selected, in a part of town that she selected (and which is inconvenient for him). To afford half of this apartment in this inconvenient location, he’d half to put half of his income towards rent which is a bad financial move. I think it makes more sense to either split the rent based on what they can each comfortably afford or pick out a new place together that fits both of their budgets.",
              "id": 4,
              "comments": [
                {
                  "score": 322,
                  "content": "And 5/7 days means he's staying there about 70% of the time, so asking for a full 50% of rent is a little insane, especially because he helps out in other ways already. \n\nShe chose her apartment, and was okay with her rent amount before he came along. It's unfair to ask for half her rent be paid when he makes so little. Her best  option is to ask that he stay at her place less often so she doesn't feel taken advantage of, and let him stay with his parents more.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 172,
                      "content": "I think she’s saying he would officially move in, not just continue the 5/7 split. But the rest stands- the apartment is simply out of his budget. If she’d be willing to live in his budget she could expect him to pay half, but as it stands they should pay the rent proportionately.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": ">And 5/7 days means he's staying there about 70% of the time, so asking for a full 50% of rent is a little insane,\n\nespecially when you realize her place is already full of her shit.... is she planning on throwing away half her shit so he can move in all his shit? I sincerely doubt it.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Also, him paying anything would benefit OP. I don’t think he should live there rent free, but him paying 30% is still 30% OP doesn’t have to pay that she would otherwise.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 87,
                  "content": "Exactly this. You don't get to financially commit to something and then force someone else into paying it. If you want to live together and have him pay half the rent find an apartment where he can afford half the rent.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "> he’d half to put half of his income towards rent which is a bad financial move.\n\nI am moving out soon and just curious, how much of one's income should rent take up?",
                  "id": 10,
                  "comments": [
                    {
                      "score": 95,
                      "content": "One third is the general rule of thumb.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "That's a pretty simplistic way of looking at it, you should budget based on actual expenses and income.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Putting half your income towards rent isn't actually a lot if you live in a place like London (it's frickin' expensiveeee! We typically pay the greater portion of income in rent just a 1 or 2 bedroom flat!). But I agree with other aspects of what you're saying that OP chose the house. Maybe she should let her BF rent a place on his own, and then she move in and pay only half the rent then. I think I understand that she wants someone who is a bit more serious about earning income as well, so they can enjoy the finer things in life, rather than her working and resenting him putting his feet up and sending photos to her of that (if you read her other comments)\n\nEdit - just wanna add that they need some counselling and arbitration. They need to get this whole issue sorted out before they can move on in their relationship. I don't think it will necessarily be resolved by a Reddit AITA",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -7,
                  "content": "Which allows him to continue treating his SO like a parent. Remember, dude works *two mornings* a week. If you keep it proportional shes basically going to pay probably 95% of everything. Would you be okay with that?",
                  "id": 14,
                  "comments": [
                    {
                      "score": 37,
                      "content": "I saw that he teaches near his parents place 2 mornings a week. Aside from that, it says he works variable hours variable days. I don’t think I’d conclude that he only works 2 mornings per week",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "The most \"fair\" solution I have ever heard for super disparate incomes like this is that the lower earner sets their housing budget, and looks for places that are 2X that rate. If the higher earner finds those places unacceptable (bad neighborhood, too small, too run down) they have to pay the difference between that and where they want to live. This only works if the lower earner is being sincere and not low balling their budget. It also wouldn't work for OP unless she moved.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "Sorry if I was unclear - he doesn't ONLY work those mornings that he stays at his parents. He's usually got at least 1 class a day, but most of the time he can get there reasonably from my place. His actual salaried time maybe averages \\~3hr/day.",
              "id": 17,
              "comments": [
                {
                  "score": 109,
                  "content": "He's only working 15 hours a week. There's zero reason your SO shouldn't be working another job, or finding a different job. I worked more than this when I was in high school and college. Stop enabling this moocher.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Have you ever been a teacher? 15 hours in class for a college professor is totally standard, as you also have grading and writing examinations/lesson plans and office hours where you still work but it’s a lot more flexible. Teachers are salaried because they spend a lot of hours working that are hard to keep track of.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Dude is a TEACHER.   Teachers are on super short supply these days. He could easily get a full time teaching job almost anywhere he wants. \n\nThat’s utterly ridiculous",
                  "id": 20,
                  "comments": [
                    {
                      "score": 79,
                      "content": "That's very region-specific and definitely not true where I am. We have so many teachers, the vast majority of them are under-employed or working in other industries.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 47,
                      "content": "he's an ART teacher.... lmao. \n\nthe funding for arts and practical classes is a lot less than it was. a lot of schools don't even have arts/music programs anymore.... they don't do anything for the school you see.  there's no standardized art core testing so they don't get any funding from having kids pass tests in that class.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Dude's an art teacher. When you get a job as an art teacher, you keep it until you die. Those positions rarely open up. And If he teaches secondary, his art certificate doesn't allow him to teach other subjects. Not sure about elementary. But the way OP described it, it almost sounds like he's a sub which is a whole different thing.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "Basically he’s a leech. That’s the bigger picture here. *He’s happy to leech off you*.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Ya I'm surprised this isn't mentioned more. Having had an \"artist\" bf in the past, if he's not making enough to make ends meet, then he needs to be finding other work.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "that's not his fair share. \n\nand its not they went and got a bigger place just for the two of them.... if he wasn't there she would still live there. \n\nhe hasn't added any costs is my point.... expecting him to pay 1/2 his income to live in HER place is fucked up. \n\nunless she is going to get rid of half her shit so he can fill it up with his shit and actually live there its too unreasonable to even consider. \n\n>Why is it her responsibility to pay for this guys life? They're not married...\n\nIts not. but that doesn't mean she can bully him into living outside of his means. \n\nmen support their partners all the time. and don't bat an eyelid.... does that just mean women are more shallow because they won't? \n\nno but seriously. their options are she pays more than he does in rent (not out of line considering it is her place and full of all her shit already) OR they can move into a place WITHIN HIS MEANS. if she wants to split down the middle. \n\nbut she can't live luxuriously and bully him into losing his independence and being dependent on her for all incidental or emergency expenses while not being able to save anything.",
              "id": 26,
              "comments": [
                {
                  "score": 0,
                  "content": "Agree!",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -6,
                  "content": "So if I choose to work 5 hours a week I should only be responsible for what I can afford? Do me a favor and ask if any landlords are okay with this. Either that or your telling me its the GFs job to support someone who chooses to only work 15 hours a week...",
                  "id": 28,
                  "comments": [
                    {
                      "score": 8,
                      "content": "that's a lovely strawman you've made :)\n\n\n> Either that or your telling me its the GFs job to support someone who chooses to only work 15 hours a week...\n\nher job? its her choice. just like its every man's choice whether to support his partner or not. usually they do though... men don't really bat an eye at supporting their partner. its pretty much expected of them. \n\nthe fact that women see it as a huge injustice is so sad to me. \n\nis your love so shallow?",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "The way I read it he may be working daily, just not full time hrs and two of those days are at schools that are closer to his parent’s home. I could be wrong but she did mention he teaches at several different schools.",
              "id": 30,
              "comments": [
                {
                  "score": 38,
                  "content": "OP confirmed he works 15 hours a week. There's zero reason someone his age shouldn't be working more than this. He's just mooching off her, I worked more than this in HS and college.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 31,
                      "content": "> zero reason someone his age shouldn't be working more than this.\n\nLack of employment, job hours among other reasons. Am I a moocher for paying my SO less than half rent when I'm looking for a job full time for months?",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "If that’s 15 hours actually teaching in the classroom, he’s likely working a lot more than that in prep time outside the classroom.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "Because if the roles were reversed everyone would be telling the guy that he needs to pay more",
              "id": 34,
              "comments": [
                {
                  "score": 0,
                  "content": "Nah, that's a pretty sexist thing to say.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I’m not saying it isn’t. But there’s a bit of a double standard when it comes to relationships. If a guy made 6x what his gf made not a single person on reddit would be saying she should pay half",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 36,
          "content": "the options are she pays more in rent than he does.... or they live within his means instead of hers. \n\nthose are the only options.",
          "id": 37,
          "comments": [
            {
              "score": 1,
              "content": "They can’t move because the lease she signed has 20 more months.",
              "id": 38,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Why don't they get a cheaper place where they can both pay half?\n\nSounds to me like he is \\*required\\* to buy into her expensive lifestyle when he cannot afford it. \n\nPersonally, I'd say proportional contributions. The difference in salary is too large and if she wants to stay where she is, well, tough cookies.",
          "id": 39,
          "comments": [
            {
              "score": 2,
              "content": ">Why don't they get a cheaper place where they can both pay half?\n\nThis. This sounds fair. \n\nI wouldn't be going proportional. I'd be splitting things halfway so you're equally contributing, at a level that's fair.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "YTA. There’s such a large discrepancy in wages, would you consider splitting it proportionately? Like, you pay 2/3s and he pays 1/3? That’s what my husband and I did at the start and I think it makes it fairer, and as time has gone on and out income has become more balanced, I’ve started paying a bit more and he’s started paying a bit less! \n\nAlso remember - you’ve been thinking this out, and he only just heard about it when you started your discussion! So he probably felt a bit blindsided and unprepared. Why don’t you tell him you want to discuss it again next week, let the dust settle and then you can both prepare for the discussion?",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "One thing you could try is contributing a proportional amount, if you're contributing 1/3ish to rent, he could contribute 1/3 of his income to, if not the rent, then another regular expense that's shared, like groceries if he's the one that cooks, mainly. You could potentially save some $$$ on food, he contributes more, both financially and in terms of running the household.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -7,
          "content": "I'm sorry what? How is it her problem that he only works two days a week? Why the fuck should they move so the guy that works 2 days a week doesn't have to drive as far on the TWO DAYS that he works? They should either find a cheaper place where he can afford half the rent or the guy should get a full time job so that he can contribute to rent equally. Frankly it seems absurd to me that someone in their 30s is living with their parents and only works 2 days out of the week.\n\n\nShe could do him a favor like she has been for the last few years by covering a larger portion of his rent but unless you're doing a full shared finances thing between partners, which it doesn't seem like they're doing right now, both partners should contribute equally to rent. The dude definitely can work more than 2 days a week if he wants more financial stability.",
          "id": 43,
          "comments": [
            {
              "score": 3,
              "content": "She said he works most days but still only part time hours. I agree that his work situation isn’t ideal. I personally can’t see myself ever dating someone with the ambition level she describes. I think we’re moving into a whole other aita here though. I didn’t see anything in her post to suggest his work situation has decreased over the past few years. If she had an issue with his ambition level then I think that would have been brought up years ago. If she’s been completely fine with his work situation then that’s the base we’re working with. Given their work situations and incomes, I don’t think the plan she suggested is fair. If she wants him to suddenly change into an ambitious person then good luck to her. She might be perfectly fine with settling down with someone with his schedule though. Plenty of people prefer spouses with part time jobs since that can drastically reduce household/childcare stressors.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 607,
      "content": "YTA. I mean, giving up 1/2 his salary and 1/6 of yours for rent isn't really fair is it? I think it's only beneficial to a relationship if both partners can have some financial independence from eachother. What you're suggesting would basically cripple him and give you a lot of extra money. Just talk about what would be a fair contribution on his part, I would say 1/4 of rent (being 1/4 of his salary) would be reasonable too, since that is still quite an significant amount for him and would show dedication imo.",
      "id": 45,
      "comments": [
        {
          "score": 261,
          "content": "I agree with this. It is often recommended that couples split costs proportionally based on salary differences so that each individual is impacted equally. \n\nIf OP's rent is $1000/mo (just an example) and she makes 3x her partner's income, I'd think she should pay $750 and he should pay $250.",
          "id": 46,
          "comments": [
            {
              "score": 41,
              "content": "So my fiancé (at the time boyfriend) did something similar. He paid the rent because he made more and I paid the utilities and household needs (like food and paper goods)\n\nIt was because we wanted to live together and neither of us be resented for being a mooch. \n\nOP you are both the asshole and not the asshole\nNTA- for wanting your boyfriend to move in with you since he’s already there a lot ( I hope we all can agree on this)\n\nYTA- for not splitting costs proportionally based on income. \n\nHOWEVER I do question your boyfriend for not being excited about the idea that you want him to officially move in. He could have freaked out about the 50/50 split and then suggested other options if he really wanted to officially move in. It did seem by what you said though that he may be mooching because he feels by staying at your place he’s doing YOU a FAVOR. Now I’m really bad at heathy relationships but I’m pretty sure that’s not how healthy relationships work.",
              "id": 47,
              "comments": [
                {
                  "score": 4,
                  "content": "It heavily depends on how she framed it. From the sounds of it, this guy is already half moved in. If she simply sat him down and told him that she wants him to start giving her 50% of his salary and she'll contribute 16% of her own, then that's not exactly going to get a great reaction out of him. Especially when they're not getting a new place closer to his budget, or to his work.\n\nIf she wants to approach this from a the angle where they're both paying 50/50. Then she needs to be willing to move out of her current place into a smaller place closer to her bf's job so that he can afford it. She cant have everything her way if she wants to make things work with this guy.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -14,
              "content": ">If OP's rent is $1000/mo (just an example) and she makes 3x her partner's income, I'd think she should pay $750 and he should pay $250.\n\nI don't... that's OP's apartment... that she assumed financial responsibility for by herself and its full of all her shit. \n\nhow is he supposed to move in? is she going to get rid of half her shit? I doubt it.\n\nno. if she wants to split rent then they need to get a place that is actually theirs that they choose and move into together that they agree on the location of that they get to decorate together so it feels like it is their space equally. \n\nhaving to pay rent to go to someone else's place is always shitty.",
              "id": 49,
              "comments": [
                {
                  "score": 5,
                  "content": "ffs, are they supposed to live in a half empty apartment?\n\nThis guy is in his 30s, barely working, and still living with mommy & daddy. Dollars to donuts he doesn't have more than a computer and 2 duffles of clothing to his name.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 5,
                      "content": "lmao. \n\nand so because you assume he can't possibly have any belongings he should be bullied into living outside of his means? \n\nseriously? \n\nshe chose that apartment. she picked the location. she agreed to the price.... \n\nif she wants him to pay half the rent then her only choice is to live within his means. \n\nend of discussion.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I’m sorry, isn’t that how roommates work? I got a place, that I was renting. A friend fell on hard times, and I had the room, so she and her kid moved in with me. I should pay 100% of the rent because it’s technically MY place?",
                  "id": 52,
                  "comments": [
                    {
                      "score": 5,
                      "content": "This isn’t a roommate situation though this is a life partner situation. It’s a bit different",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "He only works 15 hours a week. That is not feasible. Generally I would agree with your statement but not in this case. The conversation should be, you pay 1/3 or 1/4 and work on increasing your hours. Then we will revisit the distribution when you are making progress in your career. I think he needs to be more realistic about where he is in life and start taking some real initiative. His defensive answers to her request \"you'll just be lonely without me\" doesn't really give me the impression that he is doing that...",
          "id": 54,
          "comments": [
            {
              "score": 83,
              "content": "Yeah, I see your point, but don't agree. Working part-time can be a lifestyle choice. He shouldn't have to work more just so he can afford to pay a hefty rent. They could also search for a cheaper place so they can both afford to pay rent 50/50, but OP apparently doesn't want to.",
              "id": 55,
              "comments": [
                {
                  "score": 47,
                  "content": "Thank god somebody said this. \n\nThere's a shift happening right now towards this being a lifestyle choice. The tiny house and vanlife movements, for instance. \n\nAnd he literally is sustaining himself. He lives with his parents. He's choosing to do that. It's OP that wants him to live with her and share the burden of crippling rent.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Is it really living with your parents when you're only there for 2 nights a week? \n\nClearly he wants to be with OP over his parents because he only stays with his parents when it's convenient for work.  \n\nHe wants her lifestyle, he just doesn't want to pay for her lifestyle.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "[deleted]",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "> And he literally is sustaining himself. \n\nNo, other's are sustaining him.\n\nYou can claim this is part of a movement to have a simpler lifestyle, but if that's the case, why does the boyfriend say he wouldn't be able to go to restaurants and movies, and to have savings?",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "1/3 of salary going to rent does seem rather high. I assume it is an after tax number. Agreed on them finding a place/situation that suits both of them not just defaulting to the place she has now.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "The lifestyle choice of living minimalistic part time etc is definitely becoming more prominent. But that's not what he is doing. He's living beyond his means on the crutch of his parents, and then would be doing the same on the crutch of her. \n\nThe part time life is about being free but that also means free of a lot of things most people take for granted as well. \n\nHis part time life is not sustainable past when his parents stop being able to support it.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I think it's reasonable for her to ask him to work more and contribute more to the household.  I'm not saying that working part-time can't be a viable lifestyle choice, but she has a say in that as well.  I don't think it's reasonable to jump immediately to 50/50 rent, though.\n\nHe also should have to move in just because she wants him to.  The current living split fits much better with his work schedule.\n\nI do agree with her that the current 2/7 at home 5/7 at her place but only paying rent at home should change.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": ">Working part-time can be a lifestyle choice.\n\nBut is it a realistic one with what he wants in his life? It sounds like he's enjoying the advantages of what his GF offers, and he's been living quite well for a couple of years now, at least, with her paying for rent, and who knows what else. If he wants to stay in this relationship or others, depending on the cost of living of where he lives, he'll have to work more hours or find someone who would be OK with him paying peanuts towards the cost of rent. What he's doing is not realistic and he obviously has other people, like his parents and his GF, covering for him in terms of money. He shouldn't be proud of the situation.",
                  "id": 63,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Agree but ESH for me cos the 'you'd be lonely otherwise, I'm doing you a favour' line he threw is kinda gross.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "A lot of posts seem to be suggesting that he needs to start paying his share. I wonder what the response would be if the genders were reversed (btw I hate this response normally). It does seem unfair where he has to move into her place and potentially pay more than he is comfortable with. Perhaps the answer is finding a place that both of them can afford. BTW OP YTA.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 253,
      "content": "ESH - You can’t expect 50/50 when he doesn’t live there every night. Since it’s a lot more of his salary, I think it’s reasonable that as a committed girlfriend you should be understanding and offer to pay for more of the rent. That being said, he should at least contribute some of it, and shouldn’t have pushed you to the point of crying over it.",
      "id": 66,
      "comments": [
        {
          "score": 67,
          "content": "I think you missed the point. She wanted him to move in with her.",
          "id": 67,
          "comments": [
            {
              "score": 79,
              "content": "so she thinks inviting someone to live outside their means is something they should be thankful for? \n\nI'm sorry but the answer to that is always no. when you move in as a couple you look for a place within your means. if you share funds then you pool your resources and have more leeway. \n\nif you want them to split the cost.... then you have to live within the means of the person with less... otherwise they will be crippled by being forced to live outside their means while their partner has tons and tons of extra cash....\n\n\nthat is completely disgusting. anyone who would ever ask their partner to financially cripple themselves so they can have a little extra cash in their pocket is a grade A *asshole*",
              "id": 68,
              "comments": [
                {
                  "score": 1,
                  "content": ">that is completely disgusting. anyone who would ever ask their partner to financially cripple themselves so they can have a little extra cash in their pocket is a grade A asshole\n\nThe BF clearly wants what the GF is offering but only had an issue with it when asked to pay more. They should definitely split the cost according to income, but there are some things the BF should offer to pay for, or make it a goal to make more money within a couple of years. Even if you split it by income, it doesn't make sense to only put a couple hundred dollars in for rent when your partner has already been supporting you for years and you continue to expect your parents and partner to put in the work and money for your lifestyle choices. Sounds more disgusting to me than figuring out a way to pay more towards the household or bills.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 0,
                      "content": "[removed]",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 228,
      "content": "[deleted]",
      "id": 71,
      "comments": [
        {
          "score": -24,
          "content": "The only thing in his bugdet appears to be mooching off OP and his parents. Maybe it is time he picks up a full time job",
          "id": 72,
          "comments": [
            {
              "score": 69,
              "content": "[deleted]",
              "id": 73,
              "comments": [
                {
                  "score": -37,
                  "content": "[deleted]",
                  "id": 74,
                  "comments": [
                    {
                      "score": 42,
                      "content": "I doubt he’s paying a prorated daily rent. Sounds like he pays rent to his parents but spends a lot of time at OPs.",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 146,
      "content": "NTA for wanting him to contribute rent, YTA (soft YTA) for insisting that the split be 50/50. Although this is the fair arrangement for roommates, you're more than that - you're partners, and it seems like you're anticipating a future together. At some point, a couple in a relationship becomes a unit, and expenses stop being shared down the middle, and start being shared according to each person's ability to pay. I can't figure out the math exactly from your post, but it sounds like based on your respective salaries, you should be contributing a lot more than 50%. Basically, work it out so that you're each contributing the same rough percentage of your salary towards rent.",
      "id": 76,
      "comments": [
        {
          "score": 133,
          "content": "I asked my parents for advice before Reddit and this is pretty much what they said.\n\nMy problem with it is that he's a freelancer. To an extent (the hard part is that I don't quite know to *what* extent), his working hours and therefore his take-home salary are his choice. If he took more hours, he'd have more salary.\n\nOn the one hand I don't wanna slavedrive him, on the other hand I get a little bit resentful when I'm up to my pits in filing at 2pm on a Wednesday afternoon and he sends me photos of his feet up in front of the TV saying \"Love you :X\".\n\nAnd I think that might be the bitchiest thing I've ever typed in my life, but there you go.",
          "id": 77,
          "comments": [
            {
              "score": 178,
              "content": "So, this is the man you theoretically love. Maybe this is how he prefers to live, and prefers the benefits of more free time to a high income. If that's not compatible with how you want your life to be, that's fine, break up with him. Don't ,however, try to strongarm him into being a different person by insisting he take on a massive expense he can't afford. Either find a new place together you can afford to split 50/50, ask him to contribute rent in an amount actually affordable for him, or cut him loose to find someone more compatible with him.",
              "id": 78,
              "comments": [
                {
                  "score": 8,
                  "content": "To soften this, I’d say that y’all can negotiate what a reasonable amount would actually be for contribution. Maybe he can work slightly more than he current does, say 5 to 10 more hours per week. but not full time, and contribute a proportional amount of money, but not an equal amount of money. Maybe he’d actually feel great about doing this. I’m sure right now he’s a little defensive because you sprung a plan on him that would take over half of his income and only 15% of your income, and I’m sure you feel frustrated because you’re pulling all of the weight, but there is likely a situation that could be set up where everyone feels respected and nobody feels dicked over",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "It's not bitchy to seek fairness. I think you might have jumped the gun on asking for 50 percent, but I see why you did it, and you probably see why that was a mistake (not wrong persay).\n\nNow that you've started the conversation, said you want to get a little more serious, and asked him to contribute toward a shared household-- and he's said no-- now you're stuck in a resentful place. Because what can you do? Ask him to stop coming over so much? You probably don't exactly want that. But you've said you *want* a change, he's said he *doesn't* want a change. Now it's on you to decide your next step.",
              "id": 80,
              "comments": [
                {
                  "score": -1,
                  "content": "he said he doesn't feel like signing half his paychecks over to her for no reason... not that he is against change.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Is he sending photos of his feet up at your place or at his parents? \n\nIf he’s staying at your place without you there and treating it like his own home then that’s fucked up.",
              "id": 82,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "Honestly, he sounds like a sponge. Doesn't work much, doesn't use the extra free time for household responsibilities (meaning you need to use your limited personal/couples time to do them), makes you cry when you try to dance around the subject of how much he's taking the piss, and doesn't make much money to boot.\n\n\nHe must be *really* good in bed.",
              "id": 83,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "I was in a similar situation with my husband, who does a lot of handy man type work that isn’t very stable. I never asked him to contribute half because it’s not proportionate. It can be really easy to get resentful and fall into a trap of tallying up how much you work versus them, etc which isn’t healthy. So I empathize with you about the watching TV comment. My husband has always taken on the majority of the housework, while I do most of the cooking. I would suggest an arrangement similar to that so you don’t feel taken advantage of and he still feels like he’s contributing to the household in other ways. Now we have a 2 week old daughter and he has chosen to be a stay at home parent, which works out well for everyone. There’s other ways to divide work and responsibility in a home besides money.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "It would irritate me incredibly to be in that position. Just make sure you have a serious thought about whether he is right for you if you are feeling that way.\nIt is reasonable to not pay 50/50 rent if he is your partner and you are considering a life with him. If you could not commit to someone who wants to work freelance indefinitely that's an important consideration. Also do you want kids in your future? What about saving to buy a house pr holidays or retirement. How would that work financially?",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I think you summed up your feelings quite right just now. Its easy to resent the one that earns less, especially if you think they could earn more. But relationships need a stronger foundation than money; which seems to a a very thought-consumming topic for you. Relationships are about figuring things out together. Not just about the money. If one day you are injured or sick and instead of bring money in, it costs money to keep you going... and money has been a driving force in your relationship... wouldn't be surprised if he noped out of the relationship. Don't do the same to him.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Why are you with him? Everything you type about this guy makes me think he is holding you back.",
              "id": 87,
              "comments": [
                {
                  "score": 13,
                  "content": "He has a wonderful personality, is relentlessly positive and supportive, speaks 4 languages, can paint, play like 5 instruments, he's better at yoga than I am, my parents love him. He's an extrovert and I'm an introvert so he's always bringing me out of my shell by taking me to parties, museums or art days he found out about. But he's never pushy about it; if I'm feeling like I just want to stay home and read a book instead he'll stay with me and never give me even a hint of paggro.\n\nBut on the other hand, try to get him to contribute anything other than emotional support - at which he scores 11/10, see above - and you're talking to a brick wall. Before we had this fight about rent I tried the whole \"OK, make contribution in kind by doing the chores\" thing (would have put it in the OP but got word-counted), and it was just DOA. He'd say he'd tidy up the place top to bottom, and then just... not. And I'd try and gently point this out, trying my hardest not to be a nagging bitch, and he'd apologise and give the countertops a once over, and then go back to watching TV, and that'd be it for the week until I'm forced to needle him about it again. I don't want to do it myself because I don't wanna steal his opportunity to contribute, but this just leads to both of us living in a sty.\n\nThe only thing he ever does in a timely manner is the dishes, but as previously mentioned, it ends up worse than if he'd left them for me because I'll get \"clean\" stuff down from the shelf when he's at his parents and there's dried-on stains that then take me five times longer to clean off.\n\nGod I sound like my mother, but it's so frustrating. How can someone be both perfect and infuriating at the same time!?",
                  "id": 88,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I suggest you ask him why he has not been able to follow through with his promises to clean, and only half-asses the dish washing.\n\nIts \\*possible\\* that its because he views the place as \"your place\" so doesn't deep down feel the urge to keep it clean.  If that is the case, then there is hope his behavior will change when he starts viewing the place as \"our place\" (which may require moving to a new place you both pick, by the way).\n\nBut it is far more likely he is either just lazy, has a much lower bar for what he considers \"clean\", or is used to his mommy doing all the cleaning up.  If any of that is the case, then it is unlikely he will change.  Certainly he won't change due to nagging from you...that kind of change only comes from intrinsic motivation (i.e. something inside him changes so that he cares).  \n\n\nSo just go into your future cohabitation with him with your eyes open...maybe he is so great in other areas that you can deal with his slobbiness.  But if its going to simmer until you explode...don't do it.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "It sounds like you're resentful of his value system in which he trades extra income for extra free time, whereas you value extra income over extra free time. It sounds like you are trying, in a roundabout and frankly underhand way, to get him to conform more closely to your value system. That is a shitty and kind of manipulative thing to do to a SO. I'm sure you like him a lot for his personality, but liking someone for their personality is not enough to build a future on. \n\nI'm not saying your value systems have to match up 100%, but if this sort of work vs free time ethic is a sort of thing you are not willing to compromise on, you are in for a resentful future with this person.\n\nI think it's fair that you want him to move in with you, but if that is what you want, you need to open with that, not this bullshit about \"you don't contribute to my household expenses\". Because a discussion about expenses is not going to be the romantic, heartfelt discussion about your future together that you apparently want. It is going to put him on the defensive, because you sound like you're accusing him of being a freeloader when he's not (he doesn't even officially live with you so why should he contribute to your rent) and also of being irresponsible with his money (which, again, he's not, he's living within his means, his means are just less than yours).\n\nWhat is it you want to talk about? \nIs it a discussion about moving in? Is it a discussion about how you resent his work ethic? Is it a discussion about how much money he is bringing in? \n\nYou need to figure out which of these discussions you actually want to have, because as you have previously been mixing all 3, of course you're fucking crying at the end of a conversation, if you see it as a discussion about a romantic step forward and he sees it as an attack on his financial situation.",
              "id": 90,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "NTA. By doing this, you found out were you both stand.\n\nThis guy sounds like a loser to me. Believe me, I'm an accountant, and anytime these dudes come in and their occupation has the word \"freelancer\" in it, I literally LOL; it just never gets old. \n\nI understand where you're coming from too. Chicks tell me that they love these guys because they're sweet, love hard, fight hard, are brutally honest, heart on their sleeve etc. etc.\n\nThe bottom line though, is that they refuse to conform with traditional societal norms, without actually knowing what they're doing. In the process, they end up accomplishing very little. \n\nIm glad you guys are having this discussion before moving in together. This sounds like a major deal breaker. You're looking for someone who can at least match your commitments in life, and people like that take finances more seriously.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 94,
      "content": "I'm going to say NAH. Half of someone's income on rent is a lot. The best thing to do is to come up with a compromise. Maybe ask him for 1/3 of his income for rent instead of half. Or maybe he can pick up some extra work. Working just 1 part time job when (I'm assuming) there isn't a disability or other reason he can't work more is kind of childish.",
      "id": 92,
      "comments": [
        {
          "score": 91,
          "content": "Some people, especially creative types, find the lowered income of part-time work worth it for the freedom it brings them otherwise. If that's not OK with OP, that's fine and they might not be compatible, but the idea that he's 'childish' for it is I think a nonsense hyper-capitalist idea.",
          "id": 93,
          "comments": [
            {
              "score": 42,
              "content": "I agree.  There are a lot of things to cover in this post. \n\n1) It's the \"do I work to live or live to work?\"-question. Part-time is a lifestyle choice, both me and my fiancé have chosen to do it (musicians) and we live together and make it work. I love my spare time! \n\n2) Maybe living with his parents still is a bit strange, at least to me, but according to his argument there's an element of his rent helping them out somehow plus a cultural side to it that I don't personally understand, but can accept as valid.\n\n3) That being said, him spending so much time at his gf's definitely means he needs to contribute, they just need to agree on what that means and he needs to be willing to compromise here. If not money, then maybe cleaning? Cooking more often than he already does?\n\n4) I think 50% of his income, if they moved in together, is too much when he earns 3x less than her. 1/3 would be more appropriate, I think. Or finding a cheaper place.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "You don't think it's childish for a man over 30 (which I am also) to work only part time and live with his parents part time and living with his gf most of the time for free?",
              "id": 95,
              "comments": [
                {
                  "score": 53,
                  "content": "OP specified that living with parents into adulthood is standard in his culture so no, not childish. He is paying them rent. I think it's fine for his girlfriend to ask him to pay rent, but not to the extend that it's half of his income. They can either find a new place together or contribute proportional to income.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "That could possibly work however I'd say he still needs to be contributing equally to the relationship.   If he's choosing to work a lot less, then that means he would need to be picking up the lions share of household chores.  OP says he does cooking/dishwashing but he'd probably should be adding the laundry/vacuuming to that list as well.",
              "id": 97,
              "comments": [
                {
                  "score": 11,
                  "content": "I agree, whoever has more time should contribute more to the household chores (not because they make less money, though).",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "if you don't work 95 hour weeks you're a lazy bum! \n\n/s",
              "id": 99,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": ">Half of someone's income on rent is a lot. The best thing to do is to come up with a compromise.\n\nThe compromise is start working a real job, not a part time, \"freelance art teacher\" job. People who want to make a career out of art, music, whatever, usually have jobs while they work towards that goal. He's just floating around on OP's dime.",
          "id": 100,
          "comments": [
            {
              "score": 20,
              "content": "Right, which is why I said\n\n>Working just 1 part time job when (I'm assuming) there isn't a disability or other reason he can't work more is kind of childish.",
              "id": 101,
              "comments": [
                {
                  "score": -5,
                  "content": "Sure, I agree with that, minus the \"kind of.\" I was just adding on, not strictly disagreeing. I don't think asking him for 1/3 of his income for rent is fair to OP, because he's not making squat. It's a compromise in the technical sense, not a true compromise. A true compromise is closer to equitable.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I mean, in fairness sounds like she's one the who wants him to move in. if his work schedule works for him, and he's not the one bringing it up, it's his problem. \n\nThen it just becomes a compatibility issue, I wouldn't deal with it personally.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "why is 'freelance art teacher' in quotes?  it's a real job.  do you think children shouldn't learn the arts?  are you upset because he's freelance or something?  what's the issue?",
              "id": 104,
              "comments": [
                {
                  "score": 1,
                  "content": "Part time freelance art teaching isn’t a real enough job when you’re trying to make a living while currently living off someone else, no",
                  "id": 105,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "nah she definitely was TA\n\nor maybe she can move somewhere within his means if she wants to live with him instead of expecting him to live outside of his means.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -14,
          "content": ">Half of someone's income on rent is a lot. The best thing to do is to come up with a compromise.\n\nThe compromise is start working a real job, not a part time, \"freelance art teacher\" job. People who want to make a career out of art, music, whatever, usually have jobs while they work towards that goal. He's just floating around on OP's dime.",
          "id": 107,
          "comments": [
            {
              "score": 14,
              "content": "They could also compromise by moving to an apartment that suits his income.  I don't think it's fair that OP gets to choose the place and price and expect him to be happy contributing 50%.  If he's not earning enough to pay 50% of rent anywhere local, that's a bigger conversation to have about his financial and career plans.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 79,
      "content": "YTA - I am in a similar situation. I make 5K after taxes, my SO makes 1.5K. I would NEVER presume he should pay half the rent. If he did, he would be left with $270/mo. Ridiculous. Until you are married, both your contributions should be proportionate to your salary. In my situation, I would be paying 77% of total housing costs, they would be liable for 23%. \n\nYou have to look at it this way; it was not his choice to rent out the apartment you live in. He might’ve wanted to live somewhere more affordable. When we look for apartments again in the future I expect my SO to contribute a maximum of 30% of their income (arbitrary recommended budget proportions you can find online dating back to an economic crisis). So for him I wouldn’t expect him to ever pay more than $450/mo towards housing (rent+utilities). We are moving states at the end of the year and my rent will go from $2260 to 1000-1600 depending on what we choose. Let’s say we go for a place that’s $1300 (my target).  That means he would only be putting forward $300 towards rent, I’d pay the other $1,000. If I wanted to go rent a place for $1900, which means per this analysis he would owe $560/mo (presuming $200 utilities) I would in no way make him shell out the extra $110 that exceeds his budget. It’s my choice to contribute more towards rent to afford something more. \n\nIt makes zero sense that because he moved in that you should suddenly get a massive cost break bringing you down to 17% of your income going towards rent and him 50%. HUD defines anything above 30% of your income towards rent as “cost-burdened” and anything 50%+ as “severely burdened”. \n\nYou’re asking you SO to be put into an extremely rough financial state while you live extremely comfortably. I would break up the relationship if my SO expected me to pay 50% when they make 3x more than I do.",
      "id": 109,
      "comments": [
        {
          "score": 29,
          "content": "> YTA - I am in a similar situation. I make 5K after taxes, my SO makes 1.5K. I would NEVER presume he should pay half the rent. If he did, he would be left with $270/mo. Ridiculous. Until you are married, both your contributions should be proportionate to your salary. In my situation, I would be paying 77% of total housing costs, they would be liable for 23%.\n\nI would totally agree with this **if** this guy actually worked full time. He doesn't. And he's been staying at her apartment 70% of the time for nearly 2 years rent-free.",
          "id": 110,
          "comments": [
            {
              "score": 16,
              "content": "He definitely needs to get a job to be full time first before they divide rent up proportionately. I totally agree. Otherwise it is freeloading. The fact that he stayed with her before hand at her place rent free, he has no liability towards back rent or paying more due to this factor as it wasn’t discussed prior. If she wanted to have him pay stuff back then, she should have brought it up. \n\nThey need to get a full time gig, she needs to understand that her apartment is too expensive for him and if she wants him to pay half, they need to move somewhere cheaper where he can (if he were to work full time).",
              "id": 111,
              "comments": [
                {
                  "score": 15,
                  "content": "Oh, I brought it up after like the first week. \"*You're staying over all the time haha I feel so close to you so fast it's like we live together already, you gonna pay half the rent sugarboy? XD*\"\n\nBut it's been less and less of a joke every time, and now I finally cracked and had a Super Serious Relationship Conversation about it. The conclusion being that I got guilt-tripped for earning more than him and I ended up crying and he ended up mad. :/",
                  "id": 112,
                  "comments": [
                    {
                      "score": 29,
                      "content": "I understand your concerns. You need to stand up to him or he will mooch off you forever. Tell him plain and simple:\n\n“I cannot have you here so often without contributing towards the expenses over here.” \n\nYou need to make sure you’re conveying how serious the issue is. But you also need to understand that he cannot afford your rent. If you won’t budge from a 50/50 split and expect him to cough up half the rent then you need to equally be willing to tell him he cannot come over as much anymore and move your relationship to his parents place / keep your place private.  If you want to have him move in with you, at his current pay, you have two option; make him pay proportionate contributions to your guy’s income, or move to a cheaper apartment. The three option you have for splitting 50/50 is; he saves nothing because he doesn’t make enough and he just lives with that fact (assuming he accepts it), he gets a second job/works full time (which you need to talk to him about doing anyway as it’s ridiculous he isn’t), or you guys are done as he refuses your ultimatum.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": ">The conclusion being that I got guilt-tripped for earning more than him and I ended up crying and he ended up mad. :/\n\nyou have such a skewed perspective of reality. \n\nyou asked him to financially cripple himself and give you half his income.... because you guys often stay at your place. \n\nthat is disgusting. and just so you can have a little extra spending money? you don't even need the money you just want him to have less?\n\n\ncorrect me if I'm wrong but if he didn't show up ever... your rent wouldn't change right? \n\nso why do you think you're entitled to have him pay for half your rent on your place that you picked out in the location you found that is full of all your stuff?",
                      "id": 114,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -1,
                      "content": "Are you telling him to sleep the night over and come over or is he doing it himself?\n\nIf it’s you, then why you complaining.",
                      "id": 115,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -2,
                  "content": ">Otherwise it is freeloading\n\nit would be if they got a place together and he wasn't contributing. \n\nbut he's not a freeloader for spending time at her place.... \n\nits her place. she picked it out. she accepted the price... he had no say in any of that so why should he be forced to give up half his income when she would be paying rent whether he came over or not?",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "i understand what you’re saying but sometimes people work part time as a lifestyle choice. one that he was already doing before his gf asked him to move in to her apartment and pay half of her rent. and people are calling him the leech? idk she seems a bit unfair to me. \n\npeople don’t call stay-at-home partners lazy or tell them to “get a job”. if both partners are comfortable and making enough money, i see no reason they both have to work full time. \n\nthat said, i don’t think it’s fair if he stays around so often that he doesn’t contribute at all to the rent. i feel like there are other ways the person who works less can “pay” towards rent. for example, he could contribute with a little money (in no way one half of the rent, mind you) and then do the majority of the housework. she says he cooks twice a week, maybe he could increase this to 4-5, along with doing other jobs around the house.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "> He doesn't. And he's been staying at her apartment 70% of the time for nearly 2 years rent-free.\n\nand does she get charged more on the nights hes there or would her rent be exactly the same if he didn't show up? \n\ndoes she not want him around? cause if my girlfriend charged me to go to her place... I wouldn't go... there's probably cheaper hookers you know?",
              "id": 118,
              "comments": [
                {
                  "score": 5,
                  "content": "This (in my opinion) is way beyond \"going to her place\". If he visited everyday that would be one thing. He literally stays there for 5/7 days so even legally (like the tax definition), he lives there. His parents would be paying the same on their mortgage whether he was there or not but he still pays them rent. The real solution is that they move to an apartment they agree on that he can afford to split or make a compromise on the division.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "That's kind of assuming full time art teaching is an option though. I'm a teacher and the market is so damn fixed. If there's no one hiring for your subject full time in your area you either work part time or move. Doesn't exactly sound like OP is down to move so they might kinda be stuck. \n\n\nMe and my SO moved for her work and she had to assume all living expenses until I was able to find a job in our new town. I could only find a part time tutoring job for a full year until something opened up. \n\n\nJust saying the education market can be rough, especially the arts, so it might not be as simple as you're making it out to be.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "> I would break up the relationship if my SO expected me to pay 50% when they make 3x more than I do.\n\nShit. I would break up if they asked. that's not a person I want to know.  \n\nyou want to have a discussion about contributing that's fine. but saying  \"you owe me half your income\" is a bit much.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -13,
          "content": "So if you had a roommate you'd be okay with keep expenses in proportion to your salary? I think not.",
          "id": 122,
          "comments": [
            {
              "score": 16,
              "content": "No roommates are different, I’m not invested in your future. \n\nLike I said, roommates it makes sense, but you’re in a relationship with someone. So what, when you marry you’re gonna keep expenses separate and you know what, I’m sorry you can’t go on vacation with me because you can’t afford to as you’ve spent 70% of your salary on half of my rent leaving you with only enough to pay for loans and your car. By the way we’ve been doing this for a year now and you owe me $250/mo for food so please let me know when you’ll pay me back the $3,000. \n\nTHATS ASININE!",
              "id": 123,
              "comments": [
                {
                  "score": -5,
                  "content": "Is it? Until you're married it's best to keep money matters separate because (as you can plainly see here) an imbalanced ratio of income puts unnecessary strain and creates issues in relationships. Why are you defending a grown man's choice to work 15 hours a week while living at home and mooch of his GF for everything else? I worked more than this guy when I was in high school. If you think it's okay to depend on other people for things you're unwilling to do for yourself, I'd argue you're the one being asinine.",
                  "id": 124,
                  "comments": [
                    {
                      "score": 13,
                      "content": "[removed]",
                      "id": 125,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "I agree that he should be working full time. The fact that a grown man isn’t working full time with no willingness to work more shows that he is taking advantage of both the girl and his parents. He’s 32, he will never retire and work until he dies at that rate which doesn’t bode well for a future with a couple that needs to support each other. \n\nI agree that you should keep money matters separate until you’re married. But to expect someone who cannot afford your lifestyle, to pay for said lifestyle is crazy. As I said in my response - they can find an apartment where he can afford half the rent (after he gets a full time gig). Make it more extreme. Let’s say I live in NYC, I pay 10K in rent because I have a really successful job as a lawyer at a big firm, you went to college and work full time but make 20% of the salary that I do. You’re saying you’d pay $5K/mo for the right to live with me as a couple??? It’s unreasonable at the income levels present in the argument. \n\nIf they were closer income like one made $60K and the other $75K I’d understand you might want to split rent, and they may be able to come to a decision there. But he’s making something like $15K/yr probably and she’s making $50K. Her rent costs a full year of salary for him right now. \n\nMove to a cheaper place where he can afford to be your roommate and pay 50/50 if that’s what she wants, or don’t let him move in.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 64,
      "content": "YTA for asking for half the rent unless you're putting him on the lease.  If you want him around you want him around if you don't he can go home.  Once you live together (instead of just spend all your time together) it's a different story.\n\n\"If we split the rent 50/50 that would be 1/2 of his salary going to rent, 1/6th of my salary going to rent.\n\nI thought this was entirely reasonable - romantic, even,\"\n\nI mean sure, nothing's more romantic to a guy than losing half their income at the whim of a woman who by her own admission doesn't need the money.  Maybe after you can take him to Burger King and then kick him in the balls.  It'll be a banner day.",
      "id": 127,
      "comments": [
        {
          "score": 15,
          "content": ">I mean sure, nothing's more romantic to a guy than losing half their income at the whim of a woman who by her own admission doesn't need the money. Maybe after you can take him to Burger King and then kick him in the balls. It'll be a banner day.\n\nI laughed. \n\nits amazing how her paying 30% of her income is completely unreasonable but him paying half is *romantic*\n\ngag.",
          "id": 128,
          "comments": [
            {
              "score": 2,
              "content": "Yeah this can't be real, right?",
              "id": 129,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 56,
      "content": "YTA, with a dash of E-S-H because your boyfriend whining about it was not a constructive response to a legitimate problem. You're not unreasonable for wanting/expecting him to contribute, but you went about it in the worst way. If you want him to pay half the rent, you should be making plans to move somewhere where half the rent is ≤30% of his income (general personal finance guideline for rent).\n\nOtherwise you can ask him about contributing to rent proportionally: 33/66, 70/30, whatever that looks like.\n\nI think it's unconscionable to expect your boyfriend to put himself in financial peril in order for you to get a break on rent that you don't need. You are asking him to live well beyond his means. Either downsize your lifestyle to fit within what he can comfortably afford, or foot more of the bill.",
      "id": 130,
      "comments": [
        {
          "score": 20,
          "content": "I think that the boyfriend's responses all (except the last which I think was him saying he's at her place because relationship, not because he'd otherwise be homeless) were completely sensible and in no way whining.",
          "id": 131,
          "comments": [
            {
              "score": 6,
              "content": ">(except the last which I think was him saying he's at her place because relationship, not because he'd otherwise be homeless) \n\nthat is sensible too though. \n\nlike if he had his own place by himself that he just wasn't staying at as much would she still expect him to pony up half? \n\nmore importantly. if they happened to stay at his place 5 nights a week.... would she pony up half his rent in addition to her own? \n\nno she fucking wouldn't. \n\nbecause that's what it means to invite someone over to your place. even if its a regular thing. its still your place and they're still just invited. you can kick them out whenever you want. and tell them to leave. they're not on the lease. they're trespassing now. \n\nso frankly I think its completely sensible to address the fact that they want to be together. but he doesn't need a place to stay...",
              "id": 132,
              "comments": [
                {
                  "score": 3,
                  "content": "The part that wasn't good was that he said he was doing her a favor because she'd be lonely otherwise. He may have put a jokey spin on that but it would be better to say he's there to spend time with her, not because he needs a place to crash.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": ">YTA, with a dash of E-S-H because your boyfriend whining about it was not a constructive response to a legitimate problem. \n\ndemanding half your partners income isn't a constructive start to addressing a legitimate problem either.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 43,
      "content": "INFO \n\nAre you open to moving to a cheaper place where your boyfriend can contribute equally and not have to pay 50% of his income to rent? \n\nIf yes - then great, move somewhere cheaper and no one is the asshole. \n\nIf no - I think you asked for something unreasonable. I would then say that you are kind of an asshole for making your boyfriend pay so much of his income to live with you in a place you chose and you aren't willing to do anything to make it easier for him. Not a huge asshole, but kind of one. \n\nYes, your boyfriend didn't respond well, especially the last one, but you asked for something huge from him. It's way bigger to ask that of him that if the roles were reversed due to your much larger income.",
      "id": 135,
      "comments": [
        {
          "score": 15,
          "content": ">Are you open to moving to a cheaper place where your boyfriend can contribute equally and not have to pay 50% of his income to rent?\n\nSure, I have no great attachment to this apartment or its moderately fancy trappings.  \nHowever, as a practical problem there's still 20 months on the lease.",
          "id": 136,
          "comments": [
            {
              "score": 57,
              "content": "20 months?!?!?!?! Where in the world do you find a 20 month + lease? \n\nThat is a problem then. \"Sure I have no problem moving out, but I'm legally bound for the **next almost 2 years**\". Can you find someone to take over the lease? Is that allowed?",
              "id": 137,
              "comments": [
                {
                  "score": 10,
                  "content": "Some places near me (California) let you sign a 24 month lease to lock in a rate if you fear the rent may rise. My first year at my place (nice apartment but actually an average price for the city I’m in) cost $2085/mo, when I resigned it went up $120 to $2205. Right now if I wanted to rent my exact apartment as a new tenant off the street it would go for $2450. Yes that’s right, it went up almost $400 in 16 months. It’s crazy stupid where I’m at and every day there are more and more people moving to this city. The reason the complex can charge so much is that they are small and are operating at a 98-99% occupancy rate. So they have about 2-3 apartments on the market. It’s a good idea if you plan to stay at your apartment for 2 years and you’re signing in when they run a deal. My friend who signed a 1-year lease on a deal just had her rent go up $200 on her when she resigned (9%).",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Oh and yes, most states they’re legally not allowed to force you to stay on that lease. Usually you have two options (sometimes one is not allowed) and that’s either you find someone to sign over your lease to so you’re no longer on it, or you can sublet which means you’re still on the original lease but you’re leasing it out as well to someone new. In the latter side you are still liable for damages if they can’t get it from the person you sublet to.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}