{
  "post content": "So i live in an apartment building, and we all have balconies.\nThe neighbors from downstairs have this dog, Kaya, who keeps barking in the balcony, right under my living room and bedroom. \n\nI used to communicate with the dude who lived there, but for the last couple of month he wasnt living there, just the lady, and she isnt very nice. Also, talking to the landlord lady didnt help, as she lives right above me and also hates this dog, but the dog owner lady isnt cooperative saying stuff like, \"its a dog! They bark\" \n\nAnyways, for the last month, i've been unemployed due to covid, so i am at home a lot more, and when its not raining, Kaya the dog regularly goes to the balcony and starts barking.\nI've started recording it bark during quiet hours (14:00-16:00 & 23:00+) but today, after she kept barking through these hours, i went to take a nap, and that damn dog woke me (again).\nSeeing as the downstairs neighbors weren't home (again, i tried going down, but there was nobody home, just the 2 dogs barking at the door). I got pissed, filled half a glass of water, and spilled it on that dog (who immediately ran back inside).\n\nAfter about an hour, they came back and they weren't happy, threats and swears were throne, but when that lady tried to complain to the land lady, she took my side.\n\nAfter that, the dog lady came over to lecture me how the water messed her living room (apparently, the wet dog went inside and did a little mess) and after threatening that she would hose our balcony and/or call the cops when we have people over, then telling a sob story of how the dogs are rescues and are like her children, she calmed down, gave me her number so that i could call/msg her when the dog is being annoying.\n\nAITA for throwing water on that dog? I kinda snapped, i dont wanna hurt the dog, its not his fault he wasnt trained and his owner sucks, i figured some water is a humane solution to this problem.\n\nWhat do you guys think?",
  "id": 1,
  "comments": [
    {
      "score": 51,
      "content": "ESH. \nShe needs to train her dog better.\nYou need to not take things out on a dog.",
      "id": 2,
      "comments": [
        {
          "score": -33,
          "content": "She wont train the dog... I've been living in this place for 3 years, but usually, i am at work, so its less of a headache",
          "id": 3,
          "comments": [
            {
              "score": 31,
              "content": "That's why Im going with ESH instead of the Y T A I wanted to go with\n\nI might swap to YTA anyways since in another comment you mentioned wanting to do negative reinforcemnt to a dog thats not even yours. Horrible on your part.",
              "id": 4,
              "comments": [
                {
                  "score": -28,
                  "content": "I dont \"want\" to do it, i want her to train her dog. And for the dog to stfu. \n\nAt some point, i got dog treats, to try and give it something to chew on, but i stopped pretty fast cause i realized it was giving it a reward for barking, so it would give it positive renforcement to continue barking.\n\nI cant do much here, bit the dog owner sucks...",
                  "id": 5,
                  "comments": [
                    {
                      "score": 16,
                      "content": "So first, you cemented the behavior by rewarding it with treats, basically teaching the dog to bark even more, a dog that is not even yours, and then you pour water over it because you don't like the very behavior you rewarded it for?\n\nYTA man, it's not your dog. It's not the dog's fault, dogs don't know any better. You had no business reinforcing barking behavior in your neighbors' dog, and even less business trying to teach them to stop the very behavior you helped solidify.\n\nYou've clearly got not idea what you're doing, and could easily ruin someone else's dog.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Don’t ever feed a dog that isn’t yours if you don’t have the owner’s permission! Dogs have allergies, weight issues and other issues that could be messed up by your choice of treats/food.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Stop doing anything to other peoples dogs. That’s not your dog. Use your words.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 34,
      "content": "NTA. It was water. Not acid. A splash of water doesn't harm dogs. They're not mogwai. People have been known to do REAL harm to a noisy/annoying dog. Plus in the end it seems it led to a middle ground/solution.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 30,
      "content": "Very gentle ESH. They’re massive asses, but the dog doesn’t know any better. I’d rather you have thrown water on the owners...",
      "id": 10,
      "comments": [
        {
          "score": -12,
          "content": "Its an option... They go sunbathing on their balcony.\n\nBut i think that i would get in trouble if i do that",
          "id": 11,
          "comments": [
            {
              "score": 4,
              "content": "True but inconsiderate dog owners like this are so frustrating.",
              "id": 12,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "sliiight everyone sucks?\n\nnevermind, NTA.\n\nshe should've kept the dog quiet, and you didnt hurt the dog. she only has herself to blame for not taking care of the dog, now her stuff is wet.",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 14,
      "content": "Yes, YTA, you did not spill the water, you deliberately poured it on the dog to scare it. \n\nYou are aware that dogs bark because of fear/stress/anxiety  etc? \n\nI was going to go with ESH originally but after reading your comment about the speaker and the high pitched sound I’m going with YTA Because you’re an arsehole who deliberately trying to hurt the dogs ears.",
      "id": 14,
      "comments": [
        {
          "score": -5,
          "content": "Its not my dog... I cant help it with stress/anxiety/boredom.\nThe problem is that the owners arent good dog owners (and frankly, rather shitty people)\nIts not like they neglect or abuse the dogs, so i cant call on that, but they have no intention of training the dog/ get a dog collar, the dogs are left alone in the apartment a lot and get rather short walks (i once saw her let the dog off the leash and just went home when it ran away from her)\n\nI am basically trying to implement stuff i read online that wouldnt hurt the dog, like high pitch noise, commands and now, water.",
          "id": 15,
          "comments": [
            {
              "score": 14,
              "content": "High pitched noises can cause anxiety in dogs so what do you mean \"not hurt it?\"",
              "id": 16,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Lmao where did you read that high pitched noises don’t hurt a dog. I’m calling bullshit, you don’t care about the dog or hurting it. Bet you feel great after making it even more miserable than it already is. Congrats, you bested an animal.",
              "id": 17,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "ESH .what you did was small and not a big deal but also wasn't helpful. I'm not sure what the solution here is but spraying the dog with water isn't gonna help and just escalate the situation. My advise is look through your lease and see if there is anyway you can force your landlord to take action .",
      "id": 18,
      "comments": [
        {
          "score": -10,
          "content": "You can train dogs with negative renforcement, if everytime it goes barking on the balcony, it gets splashed, it might learn to stop",
          "id": 19,
          "comments": [
            {
              "score": 8,
              "content": "That’s not negative reinforcement, that’s positive punishment. It may or may not be effective for extinguishing the behavior, but it’s unethical to implement it without the knowledge/consent of the dog owner.",
              "id": 20,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "YTA. It’s not the dog’s fault. Stop punishing him.",
      "id": 21,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "NTA. Some people train their pets with spray bottles, so I don't think the water hurt anything. Also, most apartments have rules about noise during certain hours. Why doesn't the landlady enforce the rules by threatening eviction?",
      "id": 22,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "YTA for taking it out on the dog who doesn’t know better, you poured water to scare it call animal control if it’s that bad just leave the dog alone",
      "id": 23,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "NTA - why is everyone acting like you injured this dog? If it was barking outside and it was raining it would also get wet. If the owner was walking it in rain or snow or if they bathed it, it would also get wet.\n\nIt’s water.",
      "id": 24,
      "comments": [
        {
          "score": 2,
          "content": "It’s just about simple respect for others. You’d get wet if you were outside too but it would be rude to pour half a glass of water on you.",
          "id": 25,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    }
  ]
}