{
  "post content": "Hello, I know the title comes off me having an impression that I am an a hole. But here’s some context\n\nBasically I’m at a new high school and transferred mid year. 2nd day here and I didn’t know when homecoming was. I was curious and wanted to get to know my classmates and come off as social\n\nThe girl in front of me is loud and I guess you can say annoying but it doesn’t bother me. But i asked her when homecoming was. Then said “nice, do you have a homecoming date?”. She then told me she was in disgust and tried shaming me in front of the class.\n\nI then told her “I would never go out with you, and I would never have a single thought that I would find you in that way, i was just asking and you always gotta be annoying for what”\n\nSo, am i an a hole? Sucks that now I have all her friends talking bad about me. Could care less tho",
  "id": 1,
  "comments": [
    {
      "score": 5,
      "content": "NAH. Just a miscommunication, you both handled it poorly but you're kids and will learn how to handle stuff like this better in the future. If you want some insight, here: girls and young women are romantically & sexually pursued to the point that they feel like prey instead of human beings sometimes. The less you know about someone, the worse their proposition seems because then it's clear it's only for superficial reasons. So, from her perspective, you are a stranger who made a pass at her when all she wanted was a friendly exchange. That's not what it was, but that's definitely how it sounded. A simple \"oh, I'm sorry, that's not what I meant\" would have sufficed on your end, for future reference.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I am an asshole because I came off rude. If you did read the post going to a new school where you know no one and now you came off as an asshole is even worse. Maybe I should’ve said something more kind\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHello, I know the title comes off me having an impression that I am an a hole. But here’s some context\n\nBasically I’m at a new high school and transferred mid year. 2nd day here and I didn’t know when homecoming was. I was curious and wanted to get to know my classmates and come off as social\n\nThe girl in front of me is loud and I guess you can say annoying but it doesn’t bother me. But i asked her when homecoming was. Then said “nice, do you have a homecoming date?”. She then told me she was in disgust and tried shaming me in front of the class.\n\nI then told her “I would never go out with you, and I would never have a single thought that I would find you in that way, i was just asking and you always gotta be annoying for what”\n\nSo, am i an a hole? Sucks that now I have all her friends talking bad about me. Could care less tho\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA\n\nYou asked a simple question. How hard was it for her to answer.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "ESH. She jumped to conclusions and was rude. You responded by being equally rude. It would’ve been easy to shut down her rudeness and not come off as a jerk by saying you didn’t mean to offend, but simply curious.",
      "id": 6,
      "comments": [],
      "relation": "No"
    }
  ]
}