{
  "post content": "My husbands family likes to drink. Every holiday includes multiple bottles of wine/cocktails. I hate drinking I have never drank my father was an alcoholic I think it’s childish if you can’t have fun without drinking.\n\nThis year I’m hosting Christmas for a change I decided since it’s at my house no alcohol allowed we are all getting older and it’s time to grow up.\n\nMy husbands sister called to ask what she could bring. She saw a recipe for a Christmas martini that she wanted to bring. I told her about my no alcohol rule. She didn’t say much but must have told the rest of the family. Some of them started texting me asking me if I was serious and saying that it is lame. But I’m not budging. \n\nNow it turns out my husbands sister is hosting an alternate gathering that almost everyone is choosing to go to instead. It’s so disrespectful all because they would have to spend one day sober. \n\nMy husband told me he talked to his sister and we are invited to her gathering and he said we should just go and stop causing issues but I won’t it’s so rude. \n\nNow husband is mad because I’m making him stay home and spend Christmas with me but it was my turn to host and I chose to have a no alcohol they could have dealt with it for one year.",
  "id": 1,
  "comments": [
    {
      "score": 63016,
      "content": "YTA and the Grinch who stole boozemas\n\nEdit: Thank you all for awards may you be blessed this boozemas",
      "id": 2,
      "comments": [
        {
          "score": 14780,
          "content": "> boozemas      \n     \nI got one for OP. mix two parts orange juice and instead of one part vodka, substitute with cranberry juice and bam, you got a non alcoholic Ebenezer Screwdriver",
          "id": 3,
          "comments": [
            {
              "score": 5341,
              "content": "OP is just dreaming of a teetotaler Christmas, just like the ones the quakers used to know.  Where there's no more vodka toniiiiiiight but may all your Christmases be dryyy.",
              "id": 4,
              "comments": [
                {
                  "score": 5240,
                  "content": "*I really can’t stay...*\n\nBut baby, it’s dry inside.\n\n*I’ve got to go ‘way.*\n\nBut baby, it’s dry inside.\n\n*This evening has been…*\n\nGlad I made you drop in.\n\n*…So very, uh, nice.*\n\nPut down that glass; forget the ice.\n\n*My mother must be having a toddy.*\n\nHer parenting’s always been shoddy.\n\n*My father must be pouring the punch.*\n\nForget him; have a bite of this lunch.\n\n*So please, can I pop in for a sec?*\n\nCome on, let’s sit out on the deck.\n\n*You realize you can’t keep me here.*\n\nNonsense, only children want beer.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3190,
                      "content": "I'm dreaming of a white russian     \n      \nedit: deck the halls with alcoholly",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 261,
                      "content": "We’re not coming they told her \n\nPa rum pum pum pum\n\nYour no alcohol Xmas is lame \n\nPa rum pum pum pum\n\nWe’ll go to the sisters\n\nPa rum pum pum pum\n\nWe want to get our jig on\n\nRum pum pum pum,\nRum pum pum pum.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "This has given me life today...",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "I pour these drinks for you ba rum ba bomp bomp  \nWith ice and lots of booze ba rum ba bomp bomp",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Last Christmas, they gave out the shots\nThe very next day, she poured them away\nThis year, the family wants beers\nThey'll drink them with someone special  \n\nSome bitters, and some wine\nThey'll keep their distance and won't bat an eye \nTell me lady? Do you recognize cheer \nWell, you don't drink booze, it doesn't surprise me \n\nHappy Christmas, they poured a glass and filled it\nscotch with some smoky notes, they tasted it \nNow she realizes what a fool she's been \nBut if she let them drink, she wouldn't be a fool again\n\nEdit- sorry for the weird format. Yay for mobile phones",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "I have no awards to give but this is beautiful 😂",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "This needs to be the single off your top 40 album titled Boosemas!",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "This whole thread is gold. I wish I could give you all awards. I’ll settle for the martini and other interesting recipes that were mentioned and drink to y’all’s health instead",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 362,
                  "content": "lol this belongs in the rock & roll alcohol of fame",
                  "id": 14,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Just wait til you hear all my Christmas songs about weed then ;)",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "(We 3 Kings 🎵)\nThis smug host says “No alcohol…” \nMust stay sober, makes their skin crawl…\nSo offended, partying’s ended…\nSomeone deck this ass-hall…\n\nOhhhhh… no hot toddies\nNo spiced wine\nTom and jerries \nBrew so fine….\nCan’t believe her guests would leave\nSo she posts here just to whine.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I am nondrinker daughter of an alcoholic. I just choose not to drink and don't judge others for their choice. Putting our experiences as an excuse to curtail other people's day is ridiculous. You have every right to want a alcohol free Xmas, everyone else has the right to an alcohol filled one",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Quakers drink alcohol, not sure why you called them out.",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Why the Quakers?  Plenty of Quakers drink.  But a Quaker Christmas is more likely to filled with recycled paper wrapping over socially conscious gifts.  Like toys made from reclaimed wood carved by fair-trade artisans.  And various charitable donations between the adults to Planned Parenthood, Human Rights Campaign, UNICEF, and Amnesty International.  \n\nThere might also be some gifts like hoodies that are nice and warm for wearing to protests, good markers for making signs, and a lovely selection of vegan sausages.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I appreciate that we’re coming to accept again that the Quakers are generally cool about most issues. Buncha radical decency",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Scroogedriver?",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Ebenezer Screwdriver is now going to be my signature mocktail. Thank you for this gem.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "All it needs is a little bit of club soda for the bubbles. Or you can add prosecco for an alcoholic version.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8860,
          "content": "Seriously. Both my sister's are recovering alcoholics and even they would never be so uptight.\n\nThen saying they \"have to grow up\" is just so fucking smug.",
          "id": 24,
          "comments": [
            {
              "score": 6542,
              "content": "That’s the line that got me. “I have decided we are all older so it’s time for everyone to grow up .. so head on over to our house for finger painting & hot cocoa cause we’re making Christmas all about ME!”",
              "id": 25,
              "comments": [
                {
                  "score": 2164,
                  "content": "Right? Like a defining Thanksgiving moment for me was when I was probably 17 and my cousin Matt gave me a beer and no one stopped him. *Which literally made me feel like an adult worthy of the freedom to make my own choices!*",
                  "id": 26,
                  "comments": [
                    {
                      "score": 954,
                      "content": "Same. My uncle, rest his soul he passed in August, used to make a GREAT homemade wine. We still have 3 jugs full but we can’t bear to drink it. \n\nI’ll never forget being 16 and getting a glass of wine",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Your comment reminded me of the first Thanksgiving beer I had too, that was a super fun year lol. I've always enjoyed the family get together, but that year was special. My cousins, aunts and myself joined together to sing a terrible rendition of that \"You Say He's Just a Friend\" song and it was amazing. XD",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1182,
                  "content": "[deleted]",
                  "id": 29,
                  "comments": [
                    {
                      "score": 266,
                      "content": "My mom's montra used to be \"just drink more wine\" whenever all the family was around",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 21,
                      "content": "Hanging out with the family sober? I got kicked out of a bar when I was 6 months old.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "Isn't that the truth lol.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "HEEEYmen!!!  Preach!",
                      "id": 33,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 25,
                  "content": "Hey, no need to insult hot cocoa here. It did nothing wrong.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Both of which sound like heaps of fun … after a few of those Christmas martinis!",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6018,
              "content": "I’ve seen different recovered alcoholics react a couple ways to alcohol after getting sober. Most get past it and say “I was the problem. I just can’t drink alcohol because I can’t restrain myself (or something similar)”.\n\nBut I’ve also seen some who come at it like “alcohol was the problem. Alcohol is poison. There is no healthy amount of drinking and no one should do it.” \n\nOP holds the latter view of alcohol. I’ll also say that blaming alcohol for trauma that you experienced (whether from your own alcoholism or someone else’s) is not a very secure or mature response to the trauma. To me that’s a sign that the person needs therapy.\n\nEdit: I know op isn’t an alcoholic, their dad is. I’m saying OP has the same thought process",
              "id": 36,
              "comments": [
                {
                  "score": 2059,
                  "content": "This needs to be the top comment from a advice/ this subreddit being helpful standpoint. OP, everyone understands if you do not want to drink, everyone can sympathize, and possibly empathize, with the trauma you experienced and the choices you’ve made for your life as a result, but you can’t inflict your ideals on everyone around you. Taking the “Your house. Your rules.” approach to hosting the holiday is certainly YOUR prerogative, but you can’t be surprised or upset when others want to celebrate differently elsewhere, and make plans to do so. Sorry, soft YTA.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 717,
                      "content": "I recently learned the term “dry drunk” for someone who is sober but not facing their addiction / behavior. Which is what’s happening here.\nOP, you may be worried that you could be secretly an alcoholic and that’s why you have assigned these terms to drinking and thinking in absolutes like “childish” and “bad.”\nYou also framed this pretty poorly to the group, “xmas is gonna be sober and boring and YOURE GONNA ENJOY IT” and people don’t take kindly to that. There are other ways you could have posed have a sober or reduced substance holiday that would have been easier for the group to take. YTA",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "The one situation in which I can appreciate OP's behavior is if the family includes alcoholics who get horrible at parties - mean drunk, etc.  In that case, I'd be even more happy to have them attend their own party because then I won't be exposed to their abuse.  \n\nHaving said that, OP can't get upset if she tries to push her rules on other people and in response they just don't show up.  That's what I'd do if I were one of her guests.  I'm not sure I'd throw a counter-party at the same time (is theirs at the same time?) - that's kinda mean - but I might throw my own party at a different time or date.\n\nSoft YTA from me.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "This this! Sorry op YTA",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 373,
                  "content": "Both can be true! The alcoholic can have self control issues, AND alcohol IS poison, just like most things in high enough doses.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 258,
                      "content": "Fair even water can kill your ass if you drink enough of it quickly enough.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Bingo.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": ">But I’ve also seen some who come at it like “alcohol was the problem. Alcohol is poison. There is no healthy amount of drinking and no one should do it.”\n\nI had an ex whose father was a problem drinker. He'd get hostile and violent when he was drunk. She saw this growing up and thought that the problem was the alcohol.\n\nOne time, we went to a NYE party and on the way home, she remarked that had been the first time she saw a house full of people drinking and there were no fights.\n\nWhat was normal for me was extraordinary for her. She associated alcohol consumption with hostility and violence. I would suspect that she still does but I don't know for sure, we haven't spoken in over 20 years.\n\nIf I wanted to unwind after work with two beers or a glass of wine, she'd start arguments with me about how alcohol was going to make us argue. That, along with a couple of other issues, explains why she's now my ex.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I'm commenting because I think this is a very thoughtful response, and I hope OP sees it. \n\nI feel for OP, because to her alcohol = unhappiness, and that's sad, and she possibly projects her issues with that onto her inlaws, who, it seems, have a 'alcohol = fun' perception.\n\nHopefully the in-laws don't berate her for not drinking, or try to jolly her into it. That is where they would be in the wrong.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 917,
              "content": "Recovering addict here. I’d never ask other responsible adults, family or not, to not partake. I’m responsible for my behavior and I’m not going to force others to accommodate.",
              "id": 46,
              "comments": [
                {
                  "score": 43,
                  "content": "Same here. My problem with alcohol was a problem allowed to happen by me. It may have been exacerbated or even encouraged by others, but still on me for not handling it correctly. My wife still drinks on occasion, our friends all still do too. I can’t imagine asking any of them to not when around me.\n\nI can’t tell if the OP’s issue is with her past or the people her family members become when they start drinking. Either way, the problem isn’t the alcohol.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Same. Alcoholism runs in my family and I have a serious aversion to drinking now. That said, I still like mixing drinks and stuff, and just because I'm not going to be drinking it, doesn't mean others shouldn't. If they had a habit of getting sloppy drunk and trashing the place, that'd be one thing, but even then I think I'd ban the offender, not the alcohol",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "Same.  Almost 14 years without drinking and I have never told my wife or friends they can't drink around me.  My alcoholism is MY problem, not theirs.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "And that is what recovery is.  You are responsible for you.  Congratulations!",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Also it is luck if the draw. We were born without the “stop” signal gene and I’ve come to terms with it. It’s something we are born with. No stigma. However, you don’t see people who are born hearing impaired  asking other people to plug their ears. More power to people who can drink in moderation! I can’t therefore I don’t but I enjoy the company of those who do (albeit with a tinge of jealousy sigh).",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Same, but I did eventually have to decide that I can’t have it in my house. I can deal with it at a bar, or at your house, but if I have a party and people bring it, they’ll leave some behind. The house will smell. There will be empties and half-full glasses. Too many triggers and temptations. I just can’t do it. People understand, we manage to have fun, and I cook up a storm.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 206,
              "content": "Being \"grown up\" means being able to handle temptation.  It must be really hard being brought up by an alcoholic who had to have alcohol to cope and can see why it leaves scars. But most people can handle alcohol and are drinking it because it is pleasant rather than to get hammered. \n\nI definitely not say that someone is not \"grown-up\" for enjoying a glass of beer or wine or a whisky. If worried,then nominate a bar person to restrict if someone getting seriously drunk to point of illness. And provide interesting alternatives - designated drivers will love you. But a party totally without alcohol smacks of host wanting control and next they'll be pulling out the forced party games.",
              "id": 53,
              "comments": [
                {
                  "score": 38,
                  "content": "My aunt would insist on no alcohol at her parties. So we would just sneak booze in 🤷‍♀️ She went to therapy for her issues (dad and sister both alcoholics) and now we can bring our own, leave it on the table, drink it in front of her, and she’s fine! Yay for therapy",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "You missed that the family drinks Martinis. This is not a falling down drunk on massive quantities of beer scenario. This OP gets YTA because it fits.",
                  "id": 55,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "This sort of mentality always drives me NUTS. my dad never drank in his life except half a single drink on accident at AGE 33. My mom more or less stopped drinking when they got married aside from an occasional cocktail or wine cooler. When my sister and I came home one Christmas, my mom had 2 Smirnoff ices and holy shit what an ordeal.\n\n\"Ohohoho we've got an alcoholic over here!\"\n\nAnd while my dad was clearly \"joking\" my mom sort of deflated and didn't finish her second drink. The \"grown up\" thing is being able to have a few drinks responsibly, choosing not to drink if you don't like it, or knowing you can't control yourself and electing to not participate. There's nothing grown up about forcing abstinence on others or depriving yourself of responsible pleasure when you don't have a self control issue. If you don't like drinking, don't drink, just enjoy time with loved ones.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "My aunt is recovering and has hosted Christmas and her rule is if you want to drink you bring it, and you leave with any leftovers.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Right, I'm in my recovery and I don't mind if people want to drink around me- though I have friends who cant take it, and instead of trying to control everyone else, they just remove themselves from the situation.  One of the things we learn in recovery is that we can only control ourselves and we have to accept what we cannot change in others.  Def chill OP, YTA.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "That's what got me. My family has never had alcohol at our gatherings, we're just not big drinkers. Of course it's possible to have fun without drinking, we do it every year, but it's not what this family has come to expect from Christmas, and that's ok. Her post is dripping with disrespect for the family. It's no wonder that they'd rather have their own gathering after that.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "And the \"can't spend one night w/o alcohol\" comment. It's like OP thinks they're all alcoholics. But it's Christmas.\n\nI hardly ever drink and I wouldn't go to no boose Xmas, because it's a rare occasion where I like getting a few drinks.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2962,
          "content": "I could definitely understand where OP was coming from if she was an alcoholic herself or if she was, say, only hosting for dinner and asked everyone nicely if they could not drink at her house but they were free to continue the evening elsewhere! (Especially if the family has a history of throwing up in other people’s houses or something particularly bad.)\n\nBut the way op writes, calling everyone childish and saying they need to grow up and trying to control everyone’s holidays is where it becomes no question that she’s TA.",
          "id": 61,
          "comments": [
            {
              "score": 773,
              "content": "Yeah that whole grow up thing made me laugh, like listen, drinking is 21+ in the US so you already have to be grown up to drink.  Not to mention forcing your lifestyle on everyone else for a day is pretty controlling.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 573,
              "content": "Or if the family has a history of getting drunk, engaging in fist fights, and smashing up furniture.\n\nBut it sounds like they're just being festive.\n\nYTA.\n\n*Edit: Also, I want that Christmas martini recipe!!*",
              "id": 63,
              "comments": [
                {
                  "score": 46,
                  "content": "Here's a link I found:\n\n[https://www.townandcountrymag.com/leisure/drinks/g2881/christmas-martinis/](https://www.townandcountrymag.com/leisure/drinks/g2881/christmas-martinis/)\n\nThey sound scrumptious",
                  "id": 64,
                  "comments": [
                    {
                      "score": 21,
                      "content": "ooooooh thank you so much! I am totally making that s'mores one. Please accept this Christmasy-looking award as a token of my appreciation!",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Snoop Noggy Nog is the best name for a cocktail i've heard in a while",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Yeah, you’d hope that if that was the case you wouldn’t offer to host them at all! At least, I wouldn’t invite people known to start fights to my house, I’d leave it to them to host!",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Here’s one of our favorites\n\nGinger Martini\n\nRim the glass with sugar + powdered ginger. A couple pieces of candied ginger in the glass. Half ginger beer (beer not ale - it’s spicer), half vodka\n\nHuge hit at Christmas parties.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Ok I don’t think this going the way she expected. People are actually getting ideas for tastier drinks.",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Why even have a family get together if there’s not going to be drinking and fist fighting?",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I used to work for a Mormon and our office holiday party was the absolute worst: no alcohol, but also if you wanted to eat at the party you had to pay $20 ahead of time for Bob Evans, of all catering options, and all the invitations every year went out of their way to say Christmas Party instead of Holiday Party. All of that added up together just made it the worst, but the no booze was truly the worst thing.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "it's like saying, \"for my Christmas party I'm forcing everyone to play Monopoly the entire evening. I think it's childish if you can't have fun playing monopoly.\" people can choose how they want to have fun, and you can't force them to enjoy something they don't want to do.",
              "id": 72,
              "comments": [
                {
                  "score": 12,
                  "content": "Listen I’m all for a night of sober board games, but I can not and will not have fun playing monopoly",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1606,
          "content": "Seriously, I would rather go to sister's party too. If they want to have a drink or two what's the problem OP? As long as they aren't getting sloppy and doing crazy stuff I don't see why it would matter to you so much. Stop trying to ruin everyone's fun. Doesn't mean you have to drink too. \nBut also, your husband isn't allowed to go to his sisters party because of your arbitrary rule? That's insane. Let him go have fun with his family.",
          "id": 74,
          "comments": [
            {
              "score": 747,
              "content": "She needs therapy to deal with her trauma of having an alcoholic father if other people drinking has this much of an impact on her.",
              "id": 75,
              "comments": [
                {
                  "score": 34,
                  "content": "Exactly.  My father was also an abusive alcoholic and I know the risks when I drink since addiction can be genetic.  But I do drink, not on the regular, but recognize that have a terrible day a glass of wine really does ease the tension in my shoulders. I’m also not playing my trauma on others, I went to therapy and dealt with that shit.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "She needs to grow up.",
                  "id": 77,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 613,
              "content": "Yep, sign me up for sister's party. I feel bad for the husband. YTA",
              "id": 78,
              "comments": [
                {
                  "score": 35,
                  "content": "Also, sounds like the only thing wife is hosting now is a pity party. Even without something else to go to, sign me out of that one...",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "I do too, he is stuck with a grown, pouting child, it seems. \n\nSee yall at sisters shindig!",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I'm 35 days sober from booze and I'd still rather go to the sister's party. OP is the AH",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 241,
              "content": "There you go. I haven't seen anything that says that the drinking is a problem other than the OP doesn't like it. I'll be honest, being sober when others aren't drinking sometimes isn't the best of times, but this is something that they've known about for a long time, afaict. It's not new. She knew about it when she married him, I'm sure. I can't believe that NOW she's decided it's an issue and, hey, you all need to grow up. They're called 'adult beverages'. Not 'Only until I grow up beverages'.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "It's not like drinking actually ruined Christmas. If OP told a story about how one Christmas, a bunch of people got really drunk and destroyed the tree, broke a bunch of stuff, etc, I might see where she's coming from. But she just doesn't like alcohol and is being a Grinch about it since she doesn't understand why everyone else would like some wine on Christmas. 'Multiple' bottles of wine and cocktails is concerning if there's two people drinking. If there's twelve people drinking, it's not.",
              "id": 83,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "Also, her line \"if they can't stay sober for one day\" Like presumably these are adults, who are sober most or almost all of their days and holidays are when they let loose/day drink/have fun that way.  Agreed, unless they are getting crazy, let them live",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Look, OP decided. That’s it. She decided what other adults can & can’t do. Why is everyone having an issue with that. I can’t wait to hear what we are allowed to wear to the Xmas party too!",
              "id": 85,
              "comments": [
                {
                  "score": 19,
                  "content": "Definitely don’t show up in your finest goth attire, that’ll get you cut from the family photo!",
                  "id": 86,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Recovering alcoholic here. I’d also rather go to the sister’s party and not drink there. 🤣",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I feel like the way the husband’s family drinks is key information here. Because if they typically drink way too much and get angry/loud/rude/etc then I could totally understand the rule. I also don’t think the rule is wrong, it’s their home and their party so they don’t have to serve alcohol. But SIL is also entitled to throw her own party if she wants to. \nI may be biased because I can sympathize with op, growing up with a parent who abuses alcohol makes the idea of drinking and even seeing others get drunk (especially men) kind of triggering. I simply don’t drink and don’t go to places where people get drunk and it’s fine for me. I also am of the belief that alcohol consumption should not be necessary for having fun, but that’s also something I don’t impose on others. \nI really think the validity of Op’s strictness and reaction to the separate party depends on how the family does with drinking. If it’s light and doesn’t get out of control…she may need to just accept that her husband wants to go and have fun with his family whether she wants to go or not",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 882,
          "content": "Yeah, big time.\n\nI barely drink myself, so if OP was feeling pressured to drink, I'd have some sympathy. But that's not what's going on here...\n\nOP, YTA. Alcohol being available at festive occasions is pretty standard, and it's not surprising that people want it.",
          "id": 89,
          "comments": [
            {
              "score": 431,
              "content": "Especially this year which has plumbed the depths of suck for many of us.",
              "id": 90,
              "comments": [
                {
                  "score": 114,
                  "content": "also I need a couple drinks just to deal with my family at christmas time... I couldn't imagine having to deal with them all stone cold sober lol",
                  "id": 91,
                  "comments": [
                    {
                      "score": 38,
                      "content": "The year weed became legal here, my family functions got a LOT more bearable",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": ">plumbed the depths of suck \n\nPure poetry.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "My husband and I don’t drink at all, we both had issues with it in our past and if I were to host a gathering in my home, even I wouldn’t stop anyone from bringing their drink of choice. I wouldn’t buy any and I’d ask people to please take it when they leave but I certainly wouldn’t prohibit it. Moderate enjoyment of alcohol is pretty standard in social settings (at least in the US) so of course people are going to be annoyed at someone making that decision for them.",
              "id": 94,
              "comments": [
                {
                  "score": 14,
                  "content": "This. My fiance and I only drink maybe 3 times a year and we don't get wasted, just buzzed. But, I'd never stop anyone from drinking at my house or party unless they're getting fall down drunk or starting fights drunk. \n\nI go to my in-laws side for parties all the time and just don't drink. They always want me to but I don't like getting drunk if I'm not home, it just doesn't feel right. Plus, I'm not drinking and driving. They respect my decision once I tell them I'm good because they understand where I'm coming from.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Weird. I’m a BIG drinker (less so now, but I still LOVE alcohol and mixing drinks). I can’t imagine trying to pressure someone into drinking that doesn’t like drinking. I keep fun loose leaf teas and stuff for mocktails around so everyone can have something fun — and if I hear someone saying any nonsense about pressuring someone to try something or “wasting alcohol”, it’s generally a one way ticket out of my house.\n\nAlcohol is meant to be *enjoyed*, and if someone doesn’t enjoy it or isn’t feeling it, pressuring them into having some anyway *defeats the purpose of drinking*.\n\nIdk. Maybe I’m sensitive because I used to abuse alcohol in an attempt to self medicate, so being at a place where alcohol is purely just a form of pleasure again is a big deal for me, but insisting someone drink who doesn’t want to drink has *always* just seemed insulting to me.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 729,
          "content": "Well it's obvious that she doesn't need alcohol because she's drunk on entitlement. OP thinks that she is entitled to having her \"turn\" to host Christmas when she doesn't want to do it the way everyone else does. They think that they are entitled to dictate the dietary choices of other people.OP you are not entitled to take up anyone else's time with your self righteous nonsense. You want to have a sober Christmas with other sober people? Find some sober friends. Making your husband celebrate with you will only make him resent you, don't know why you'd want to do that to yourself.\n\nYTA",
          "id": 97,
          "comments": [
            {
              "score": 13,
              "content": "plus she had no intention of letting the guests know ahead of time",
              "id": 98,
              "comments": [
                {
                  "score": 8,
                  "content": "I'm glad someone else noticed this. Apparently if one person hadn't called and mentioned the martini, then nobody would have known ahead of time.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yea feels bad that husband has to choose between staying home and family for Christmas. That’s a nope for me dog. YTA.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 93,
          "content": "Lmao I love this comment",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "Definitely. And I’m so surprised she thinks she can actually stop her husband from going. YTA in the biggest way lady. Stop trying to control everyone and worry about yourself",
          "id": 102,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "YTA\n\nI stopped reading at \"it's time to grow up\"\n\nGet off your high horse OP, I don't like to drink either, but I would never force that choice on anyone else, *especially* for Christmas.",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "Yeah OP just has to **wine** about how everyone is ditching her party. Now her husband can’t join his own family to get in the Christmas **Spirit**. YTA, and very controlling, OP!",
          "id": 104,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 20332,
      "content": "Kindly, YTA. I understand where you come from. But you need to understand where other people come from too.\n\nIt's not your wedding or your birthday : this celebration is not about you and your wants. It's a celebration to bring people together.\n\nMost people work hard all year and rarely get to see their family. When they do, they want to relax and celebrate. It sucks, but yes, alcohol is part of this. I get that you don't want to see people dead drunk in your house : but there is an healthy \"a couple of drinks\" in between.",
      "id": 105,
      "comments": [
        {
          "score": 3769,
          "content": "This is a good point. Christmas is not a time to uplift or celebrate one person. realizing this is an ironic sentence due to the origin of Christmas but anyway. OP is not supposed to be the centre of attention here",
          "id": 106,
          "comments": [
            {
              "score": 859,
              "content": "well not to the real origin from before Christianity took over",
              "id": 107,
              "comments": [
                {
                  "score": 708,
                  "content": "[deleted]",
                  "id": 108,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Christmas in England before Henry VIII was *incredibly* boozy.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 640,
              "content": "And I would like to add that Jesus was polite enough to offer his guests wine.",
              "id": 110,
              "comments": [
                {
                  "score": 198,
                  "content": "It was his first miracle even. Before healing the sick.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 45,
                      "content": "We need a Jesus teen years where he'd use miracles to get his friends alcohol",
                      "id": 112,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "Not even Jesus wanted to be sober at a wedding",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 154,
              "content": "Don't forget JC liked to have wine at the party.",
              "id": 114,
              "comments": [
                {
                  "score": 18,
                  "content": "Not only did he LIKE wine, but he turned a perfectly good nonalcoholic beverage into wine!",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 744,
          "content": "Agreed. I'm afraid YTA, OP. You're imposing your own beliefs onto others, and it's their decision if they don't want to abide by your rules and celebrate the holiday in the way that they prefer. Just because you don't drink alcohol and had a bad experience with an alcoholic father doesn't mean that everyone who likes to consume alcohol is \"childish\" (weird choice of words, OP). Even if you think it's rude, please don't ruin the holiday for your husband.",
          "id": 116,
          "comments": [
            {
              "score": 23,
              "content": "I’d just go anyway. My partner doesn’t get to order me to stay home at any time. Especially when they’re completely in the wrong.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 357,
          "content": "This is the best point.  I  grew up with an alcoholic parent.  I've gone to many celebrations and been the designated driver.  I would never tell other people what they can and cannot do.  The only exception is no smoking in my house. That stinks up the whole place.\n\nJust because someone enjoys a few drinks doesn't make them an alcoholic.  If you have more specific concerns about your husband's drinking habits you should address those with him in a private setting.",
          "id": 118,
          "comments": [
            {
              "score": 87,
              "content": "Yeah, one entire side of my family is/was legit alcoholics. This is probably just my life experience with alcoholics but the fact that the SIL called about making a Christmas themed drink makes me think they aren't really alcoholics. They might just enjoy drinking during the holidays. My alcoholic family did not make \"fun themed drinks\" for any holiday or celebration. Drinking was a means to an end. They drank what could get them drunk the fastest, if they didn't already show up trashed or several drinks in. I had one uncle who would have soda vs coffee in the mornings as their wake up drink. Except their soda was 90% rum. The alcohol that was at a celebration or brought to said celebration were really basic and what that particular alcoholic needed. \nI have a healthy relationship with alcohol. I don't have to drink and go stints not drinking but I do enjoy a themed cocktail at a Christmas event. As long as it's before 7pm because apparently when you get older, your body doesn't appreciate you drinking later at night. YTA OP.",
              "id": 119,
              "comments": [
                {
                  "score": 29,
                  "content": "This is so true. I have/had many alcoholic family members as well and for them it wasn’t about the fun side of alcohol, they weren’t sampling wines, they needed to drink, they couldn’t stop.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Exactly. I remember one year in college I wanted to make a flight of fun themed cocktails for Christmas Eve. I and my sibling were the only ones who partook. No one else cared.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I was waiting to see OP elaborate on how they’re in fact drunken assholes and idiots. Like they’re sure to break something and do a little light sexual harassment. In which case why should they have endure that? There are certain drunks I don’t mind/even enjoy being around and some where I would just as soon stay home. But OP never goes there as far as I can see.",
              "id": 122,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 137,
          "content": "Agree. While OP absolutely has the right to an alcohol free environment in her own home, other people also have the right to opt out of that event if they don’t like it. Where the YTA part comes in is when you want to force your preference on everyone else.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 119,
          "content": "I like this one, nice words",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "There are lots of ways to gracefully lessen alcohol consumption at a party: \n\n- serve pre-mixed cocktails instead of having open liquor \n- make drinks for guests rather than have them pour themselves \n- serve a delicious, appealing nonalcoholic alternative that guests will want to try\n- have a wide assortment of nonalcoholic alternatives on hand  \n- serve a lot of food with drinks the entire time  (including appetizers, even if you have a big dinner coming) \n- stop serving alcohol 1-2 hours before the party ends \n\nNONE of those involve shaming or controlling your guests. \n\nINFO: OP - Did you override your husband’s objections? Put down an ultimatum? Make a unilateral decision?",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "YTA.  Most adults don't drink very often. Therefore on these holidays when they actually get a few vacation days, they want to have some drinks and relax with friends and family.  You are confusing your history with peoples current actions.  My wife grew up under an alcoholic and felt the same way when we started dating.  Over time she came to understand that alcohol isn't the devil. Excess in anything is the problem.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14387,
      "content": "YTA for a variety of reasons. \n\n1. For unilaterally banning alcohol. It’s presumably your husbands house too so why didn’t you have a discussion with him?\n2. For getting mad that someone else decided to host Christmas after they found out you banned alcohol. An invitation is not a summons and you’re imposing rules a lot of people don’t want to follow on the holidays. \n3. From not allowing your husband to celebrate Christmas with his family. That’s not your decision to make. \n4. For your overall attitude around your ILs and drinking. Having a few drinks for the holidays is okay, it’s not a gross or nasty thing that we should judge.\n\nEdit: It did not occur to me until y’all started commenting that OP was intentionally not telling anyone (her husband included) that it was a dry party to intentionally trick them into coming. Add that as reason #5 YTA.",
      "id": 127,
      "comments": [
        {
          "score": 4741,
          "content": "For me it’s also the attitude that wanting to have a drink during a celebration is childish. It’s not a maturity thing to enjoy a drink",
          "id": 128,
          "comments": [
            {
              "score": 1840,
              "content": "OP made a few disparaging comments that make then sound like a nasty curmudgeon. I suspect they have their own trauma that has not been resolved.",
              "id": 129,
              "comments": [
                {
                  "score": 3923,
                  "content": "OP very clearly hasn't resolved the trauma around her alcoholic father.\n\nInstead she has decided to weaponize her trauma and decide that everyone who drinks is either immature or an alcoholic. Suddenly it's no longer her problem, it's everyone else's!",
                  "id": 130,
                  "comments": [
                    {
                      "score": 315,
                      "content": "This right here",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 99,
                      "content": "Agree it’s about her trauma, although I would respectfully add that I don’t think trying to control everyone & everything is a conscious (malicious) weaponizing that she decided to wield. It’s a coping mechanism that Adult Children of Alcoholics develop to try to bring order to the chaos they experienced. So controlling things becomes a need & without it they emotionally unravel. Its a psychological compulsion. Doesn’t make what she’s doing right, obviously. The result is the same — rejection. It’s tragic really. \n\nI hope OP gets some help for that before she permanently alienates her whole family and/or loses her marriage.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "[deleted]",
                      "id": 133,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "I grew up with an abusive alcoholic father, stepfather and various other relatives and I’m not a big fan of drunk people - ranging from them being a bit tedious to downright terrifying. I don’t drink often myself and I do find it frustrating when people need to get hammered all the time, so perhaps their drinking is problematic. \n\nNevertheless, I still wouldn’t host Christmas and ban alcohol - if the drinking bothered me that much I just wouldn’t host, so I could head off when everyone gets too shit faced.",
                      "id": 134,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "Curmudgeon.  Love that word lol",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Oh it's absolutely trauma-related, the seething anger and disdain/judgement is the big tip-off.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Right? I felt OP was asking if she's an asshole all while being an asshole directly at me",
                  "id": 137,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "And that may well be... but that doesn't mean it's OK for them to pawn that trauma off on everyone else around them.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 338,
              "content": "Yes! I'm not a heavy drinker by any means.  In fact the glass of wine I had with dinner last night (a frittata) was the first alcoholic drink I've had in about a month.  but not drinking at a random Sunday dinner with family is a lot different than not drinking at a major holiday.\n\nAlso, what about the family's culture?  I'm of Italian descent on one side of my family...wine is basically an expectation at a major dinner.  I presume that there are other cultures where alcohol is a part of celebrations.",
              "id": 139,
              "comments": [
                {
                  "score": 39,
                  "content": "OP would absolutely HATE going to countries like France and Italy. She’d be judging everyone lol",
                  "id": 140,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Fuck me if she lives in the UK. My grandparents always have wine out for the Sunday roast and it's uncommon for their not to be at least one alcoholic drink at a table",
                      "id": 141,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "We’re Italian, and my cousin (not Italian) is a sommelier. There will always be wine. Always.",
                  "id": 142,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 144,
              "content": "She's giving \"holier than thou\" vibes.",
              "id": 143,
              "comments": [
                {
                  "score": 31,
                  "content": "Exactly. The \"grow up\" comment confirmed that.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Honestly, I have never wanted a drink as much as I did after reading this post.",
                  "id": 145,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "I mean.. children literally are not allowed to drink.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Come on now, don't you know most people grow out of the drinking phase when they're like 10 or 11 years old?",
              "id": 147,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I'd argue that drinking responsibly is a mature behavior.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Some of them just taste good. My faves are perry and honey apple cider (not the alcohol-free kind) and I'm far from a drunk",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "If anything the OP sounds like the childish one for saying what is and isn't mature like it's fact. She's got a lot of therapy and growing up to do if she wants to stop being TA",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I agree 100% with that. That's like calling everyone fat for getting a bite of food when they're hungry. LOL. Op is such an unbelievable asshole. \n\nThe problem with OP is they'll likely attribute all the YTA's as everyone being good-for-nothing drunks all voting against them. In reality, this isn't all about the alcohol but rather about the controlling nature OP has and wanting everyone to adhere to THEIR views and making snide remarks and unfair judgment of others. Also for not including their husband in the decision-making.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 567,
          "content": " Number 3 is the biggest point for me. She's trying to force the whole family to be sober and then banning her husband from seeing his own family while she's acting like a prison warden\n\nEdit: not yelling anymore",
          "id": 152,
          "comments": [
            {
              "score": 38,
              "content": "#WHY ARE YOU YELLING??",
              "id": 153,
              "comments": [
                {
                  "score": 32,
                  "content": "Wow I dont even know how to yell on Reddit! Idk what I did wrong 😕",
                  "id": 154,
                  "comments": [
                    {
                      "score": 28,
                      "content": "You wrote `#3`, and the `#` denotes a heading, so it formats it that way. Write `\\#3` instead, and you'll get `#3` in the result.",
                      "id": 155,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "If I was married to that Grinch I'd go anyways. I'm sorry but no one is going to tell me  I can't spend a holiday with my family.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 389,
          "content": "It also sounds like the family didn't even know it was banned until SIL called OP to see what she could bring and was then told she wasn't allowed to bring her stuff for the martini, which makes the OP a major AH IMO if she couldn't have said something to everyone from the get go.",
          "id": 157,
          "comments": [
            {
              "score": 142,
              "content": "I would be pissed as heck if I went to a place and didn’t have the ability to opt out. It was definitely purposeful. While you don’t need alcohol to have fun/nor are hosts obligated to provide it, it should be a fully informed opt in to drink or to stay sober. Regardless of any situation, tricking people is a shitty thing to do.",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "I think that rankled me the most. Sounds like she was trying to sabotage the entire family and their Christmas plans. She knows her husbands family enjoys having alcohol for their Christmas get together. If SIL had not checked, and everyone just showed up with cocktail mixes, wine for dinner, or whatever beverage they might bring, what was she expecting the result to be?   \nWas she going to confiscate all the alcohol at the door and tell them \"no way you are bringing that in my house?\"   \nBy not letting everyone know the gathering would be alcohol free, thus giving them options, does she even realize what kind of scene she was getting ready to be the director (dictator) of? For some reason, I get the impression this might be exactly what she was planning on! Definitely TA",
              "id": 159,
              "comments": [
                {
                  "score": 18,
                  "content": "I bet you she knew this would be there reaction and thats why it was never stated, but like you said how the hell was she going to then proceed with her diabolical plan of \"no booze\" when they're already there without making an even bigger scene?",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "especially since she said she assumes that person told everyone, as if she didn’t want people to know there was no alcohol",
              "id": 161,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 341,
          "content": "Yes. Point number 4 really rubbed me the wrong way. OP is judgey",
          "id": 162,
          "comments": [
            {
              "score": 116,
              "content": "That's the part that screams that OP doesn't really recognize that she's letting her trauma run the show and rather than deal with her baggage, she wants to normalize it by judging everyone who isn't making her choices. The judgement around it would put me off this gathering way more than the actual banning of the alcohol.",
              "id": 163,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "“You can have fun without drinking” Is the most obnoxious thing. Sure, I can and I do all the time. But I can also have fun WITH drinking and I’m a grown ass man capable of deciding on my own whether alcohol will enhance my fun",
              "id": 164,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "Yep. Also nowhere has she indicated anyone attending these events is a recovering alcoholic or in the past there have been any issues with alcohol. Like, sure if Aunt Thelma keeps throwing up on your stairs and Cousin Billy gets so drunk he blacks out in your bathroom then it may be time to ban the liquor. But it sounds like this family has a couple drinks and enjoys themselves in a reasonable, healthy way.",
              "id": 165,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 253,
          "content": "> For unilaterally banning alcohol. It’s presumably your husbands house too so why didn’t you have a discussion with him?\n\nThis is the major issue, IMO.  She's allowed to feel whatever piety she wants about alcohol,  but not discussing this the other person who lives there is extraordinarily selfish and entitled.",
          "id": 166,
          "comments": [
            {
              "score": 13,
              "content": "The lack of conversation with her husband dovetails neatly with self-admittedly \"making\" her husband stay home with her.\n\nOutside of joking about \"making\" your partner watch a guilty pleasure movie or something, I can't imagine a healthy scenario where you find yourself \"making\" your partner do things or vice versa and it isn't the sign of a huge problem, imho",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "OP is TA. YTA. Your need for control and need to punish your husband’s family for their drinking habits is childish, as you put it. Stop being so sanctimonious, these people are *your* family too. Looks like it’s time for you to “grow up”.\n\nAlso heavily agree on points 3 and 4. \n\nEdit: rewording.",
          "id": 168,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "The whole \"time to grow up\" pisses me off, fuck off with your judgmental bullshit,  unless people are getting completely fucking hammered there is nothing wrong with a social drink in a special occasion. I hate people like OP who think their views are the only valid one in the universe.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "you forgot one:  \n5. for not mentioning this to any of the invitees until asked a direct question relating to it. This is the kind of thing you put on the invitation. What was OP gonna do, tell them all to leave their bottles on the front doorstep?",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "“An invitation is not a summons” is the best thing I’ve read today. I love it.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Good news is op will not ever be asked to host anything at her house.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11320,
      "content": "[deleted]",
      "id": 173,
      "comments": [
        {
          "score": 7255,
          "content": "OP sounds a lot like a control freak I dated when I was young and stupid.  If the girl saw anyone have more than one drink in a sitting, she would go off the rails screaming about how that person was an alcoholic and needed help.  She came was a very sheltered religious family.  OP sounds like they have a severely skewed view of reality.  Definitely YTA.",
          "id": 174,
          "comments": [
            {
              "score": 3021,
              "content": "OP's dad was an alcoholic, so her negative view of alcohol is most likely based on this fact and the assumption that his alcoholism fucked up some part of her life. INFO would here be interesting (not necessary tho, because irrelevant to the question).",
              "id": 175,
              "comments": [
                {
                  "score": 2120,
                  "content": "And my dad was horribly abusive, doesn’t mean every man I encounter I think is abusive.  Her trauma is no excuse to run all over her husband, at the very least.  If the family just has drinks, has a good time, and there’s not drama or fighting etc.  then she’s YTA.  Of course it’s totally within her rights to not want alcohol there(though doesn’t the husband at least get a vote?). But she also can’t clutch pearls and be offended when everyone else says “no thanks”.",
                  "id": 176,
                  "comments": [
                    {
                      "score": 735,
                      "content": "My mother was/is I guess, a pill popping addict. And I still take the medication I need daily. \n\nShe knows alcohol is a big part of their celebration and shouldn’t be surprised they don’t want to abide by her preferences. She doesn’t have to drink but they prefer to do so. It sounds like it’s mostly for holidays based on the info we have as well.",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 238,
                      "content": "Exactly. And considered she didn't specify a incident, it's just that she doesn't like drinking.",
                      "id": 178,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Agreed. I get the sense OP needs to work through some things. Being the child of an alcoholic can be traumatic and really fuck you up as an adult. But the solution isn’t controlling all the people around you because you couldn’t control your environment as a child. The solution is a lot of therapy and recognizing that drinks during a holiday does not make anyone your alcoholic father.",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1569,
                  "content": "My father was an alcoholic it destroyed my family gave me and my brother several mental health issues and he died at 59 because it absolutely destroyed his body. I was like OP during my early twenties super judgmental about alcohol if my partner had any whiskey and smelled of it I’d get physically ill but in my mid twenties I had a lot of therapy and learned that MY choice to not drink is MINE but I don’t get to control other people and that alcohol itself isn’t evil and most people can enjoy. After working through all that trauma I have a totally normal relationship with alcohol, I drink (in moderation) regularly my friends and family drink etc. using your past trauma to control everyone around you isn’t healthy coping. She is welcome to not drink and she is welcome to remove herself from situations that make her uncomfortable, she doesn’t get to dictate what everyone else is doing though.",
                  "id": 180,
                  "comments": [
                    {
                      "score": 204,
                      "content": "I think you hit the nail on the head. Not wanting it in her home seemed like a half ass attempt to remove herself from the situation.",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "My stepparent is teetotal due to family trauma around alcohol but they've never put pressure on anyone not to drink. Which is probably why we've ended up having alcohol-free Christmases naturally.\n\n(My parent and I drink, but we'd be the only ones so we just skip it at holiday meals at home unless there are guests who also drink)",
                      "id": 182,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "This is similar to what a relative who is a recovering alcoholic told me, the issue with drink is theirs and that there are deeper issues than the alcohol and that other people can enjoy alcohol just fine and it isnt the alcohol, but other problems. The booze is the symptom of issues, not the cause.",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "I don't begrudge OP as they likely have trauma around alcohol. An alcoholic parent will do that to you.\n\nHowever I do begrudge OP for being childish and not dealing with her trauma and expecting others to share it against their will.",
                  "id": 184,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "She needs Alanon (basically AA for the family members) or a very good therapist. Having an alcoholic parent/partner really messes with some people to the point that they need to control the lives of everyone so they don’t need to face another alcoholic. I personally never felt the need for alanon but I’ve gone to the meetings and it’s 99% “how to not stalk someone to make sure they’re not drinking” and “it’s okay for a nonalcoholic to drink”",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Yes! I also knew a girl like that. She'd get all upset while everyone else is having fun, and NO ONE is pressuring her to drink. I don't understand the problem.",
              "id": 186,
              "comments": [
                {
                  "score": 22,
                  "content": "It really boils down to a control thing.  If you watch people like that enough, you’ll start seeing it in other behaviors as well.  It really is as simple as “I don’t like this thing, I don’t want to do it or be around it, so neither can any of you.”",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2066,
          "content": "Yup. An invitation is not a summons. \n\nHey OP, you want to know a very good way to make people want to attend your optional celebratory event? Allow people to celebrate. Also, lose the holier than though attitude while your at it. You say drinking is “childish” and “we are all getting older and it’s time to grow up.” The irony is you sound like the childish one. This is not how mature people hosting events behave.\n\nOh, and I would say “your house your rules” but it isn’t just your house. Does your husband not get a say? Your behavior is cringe.\n\nYTA.",
          "id": 188,
          "comments": [
            {
              "score": 553,
              "content": "I agree. It would be one thing if OP said this family has a habit of getting absolutely trashed and ruining nice holidays but it sounds like they just like to drink to celebrate, not get belligerent. YTA",
              "id": 189,
              "comments": [
                {
                  "score": 478,
                  "content": "I mean someone who is looking at a Christmas martini recipe doesn't sound like someone who drinks gallons of beer and gets blackout drunk",
                  "id": 190,
                  "comments": [
                    {
                      "score": 105,
                      "content": "Hell, I want the sister's number to ask for the recipe – that sounds delightful and like it would be a big hit at my family's Christmas party.",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Depends on how cheap a date they are.",
                      "id": 192,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 414,
              "content": "For real. It's one thing if uncle eddie is getting absolutely sloshed every year and pukes in between the couch cushions.  \n\n\nIt's a whole other thing if it's just family enjoying time together, unwinding with a few drinks. Life is hard, there aren't that many things to celebrate. So what if they get a little loud/rowdy?  \n\n\nThen there's OP who wants to have a quiet, sober Christmas. Well congrats OP, YOUR childish behavior got you just that! You can spend Christmas sober and alone at home while everyone else is off having a jolly good time.  \n\n\nThis is coming from someone who's parents met at AA. Drinking isn't your thing, cool. If it's others and they enjoy it without being harmful/addicted, let them have their fun.\n\n&#x200B;\n\nYTA.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "I thought this too. Apparently it's childish to drink, but not childish to police what other people consume/enjoy, nor is it childish to throw a fit because people won't come to a party where you insult them and deny them their enjoyment. Go figure.",
              "id": 194,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": ">Does your husband not get a say?\n\nApparently no say about even what he wants to do outside the house even with his own family since she says herself she's MAKING him stay home. She is absolutely controlling him unfortunately.",
              "id": 195,
              "comments": [
                {
                  "score": 11,
                  "content": "And she’s going to ruin his relationship with his own family.",
                  "id": 196,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Indeed and it's really sad, I'm quite surprised many comments are glossing over controlling her husband and damaging his relationship with his family. That to me is even worse than just a temper tantrum about alcohol, this is going so much further.",
                      "id": 197,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1855,
          "content": "I'm 7 years sober. It's 100% within OP's rights to ban alcohol from her party.\n\nAnd it's 100% within everybody else's rights to not go to her party.\n\nMy wife and I throw parties all the time and there's always alcohol there. Because people like to drink alcohol at parties. My personal level of consumption (exactly zero these days) is irrelevant.",
          "id": 198,
          "comments": [
            {
              "score": 628,
              "content": "Congratulations on being 7 years sober!",
              "id": 199,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 281,
              "content": "Congrats on 7 years!\n\nMy spouse doesn't drink (10 years sober and now he can't drink due to his medications). I don't drink very often so I don't even keep wine in the house unless I'm making pasta sauce (and even then, I just pull a Julia Child and finish what's left in the bottle while the sauce simmers). When we have company, it's BYOB and everyone is cool with that. \n\nOP needs to work through her own issues with alcohol in the long run.",
              "id": 200,
              "comments": [
                {
                  "score": 23,
                  "content": "Yeah I don’t drink/never have due to medications, and my mom is allergic so I’ve never been around a drunk person still at 23. I think it would be fucking hilarious to see people drunk at holidays!\n\nThough if I ever had a wine rack it definitely would be used for yarn, especially the cubby type. Honestly I should just get one, can you imagine the storage??\n\nOP is depriving themselves of entertainment, really.",
                  "id": 201,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 261,
              "content": "If OP respectfully asked me to not drink at Christmas because they were working on sobriety,  and it would make their holiday difficult or painful,  I would absolutely show up with seltzer and not drink a thing. It would be out of respect and love.  \n\nBy contrast - OP just told her husband’s *entire family* that they’re immature drunks who are only *allowed* over if they “behave” to OP’s previously unmet standards. OP is driven by judgment and control, not respect. I would fuck off to Denny’s for dinner before I accepted an invite that came with a slap in the face.",
              "id": 202,
              "comments": [
                {
                  "score": 27,
                  "content": "Exactly this. My cousins and I go on a ski trip every year, where we usually all have several drinks, partially because it's a kid-free weekend and most of them have children. Well one of my cousins has faced his alcoholism and is now in recovery. I asked him if he would prefer that we not bring/drink alcohol last year (his first year in recovery) because it wasn't a big deal for us. He said that his alcoholism shouldn't change our weekend. Now, we all chose not to really drink much that weekend anyway, but if he had asked us to nix alcohol, we absolutely would have!\n\nNow, if someone on that trip said \"I am banning alcohol because you all need to grow up and drinking any alcohol is stupid\" I would show up with my six pack and continue to drink. We pay the same amount for the house and I'm an adult, get over yourself.",
                  "id": 203,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yeah exactly. Even if it was a stranger, “hey this person who is coming is in recovery, we’d really appreciate no alcohol” that’s cool. But op reminds me of some relatives I have. I decided not to attend one’s wedding in part because the lack of alcohol made it clear that their behavior that managed to be the primary buzzkill at a funeral would also be attending the wedding.",
                  "id": 204,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 28,
              "content": "Of course, it’s within her right to not have alcohol at her party. The part I’m struggling with understanding is why it’s important to her to host a party where people normally drink, and then ask them not to. I mean she could just host a non-drinking dinner party at her house and let Christmas be celebrated at somebody else’s house. And honestly, I bet everybody would be fine with that.",
              "id": 205,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "Excellent points! YTA op",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Also they was OP phrased some of that made it sound like the no alcohol was a surprise to the guests. \n\nI completely understand alcohol free events, especially if you've had bad experiences with alcoholism. But it's not a gotcha moment",
          "id": 207,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5358,
      "content": "YTA because you made an executive decision for everyone else and now you're pouting because they found a way around you. That type of behavior is childish as well. You can make rules for your home. You can choose to not drink and not like to be around drinking. Nobody else has to be forced to come in line with your expectations. They are allowed to do as they please, elsewhere.",
      "id": 208,
      "comments": [
        {
          "score": 900,
          "content": "Exactly! Op is horrifically judgemental and trying to ruin Christmas for everyone. I would absolutely party at sister in laws- she sounds much more welcoming!",
          "id": 209,
          "comments": [
            {
              "score": 713,
              "content": "The sister in law that was asked what food she was bringing and said “martinis?” That sister in law? Hell yea I’d go there first. Lol",
              "id": 210,
              "comments": [
                {
                  "score": 321,
                  "content": "Not just regular martinis, but CHRISTMAS martinis - yup, I'm with you, SIL first!!!",
                  "id": 211,
                  "comments": [
                    {
                      "score": 17,
                      "content": "So, you set the Gin next to a bottle of peppermint schnapps instead of a bottle of vermouth? introduce them, then throw the schnapps out and fill the glass with gin.",
                      "id": 212,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "SIL was like I'm having my own Christmas with black jack and hookers!",
              "id": 213,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 419,
          "content": "Yup… If Thanksgiving usually has ham or turkey and you plan a vegetarian Thanksgiving without telling anyone and also forbidding anyone from bringing any meat— it’s not like people need meat every day to survive, but if it’s a normal expectation for a celebratory gathering it’s an AH move to unilaterally change it and call everyone else immature and childish for celebrating the way they’re used to. If you agree to host an event that’s got certain expectations and decide to change it, you’d better communicate really well about it and really sell it, not try to spring it on people. (YTA)",
          "id": 214,
          "comments": [
            {
              "score": 30,
              "content": "My exact thoughts, but you expressed my thoughts way better. Love the Thanksgiving analogy.",
              "id": 215,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "But you should at least have spaghetti, or hamburgers, or pizza. Preferably all three, right?",
              "id": 216,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "We are having pimento cheese or NOTHING",
              "id": 217,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Can you imagine showing up at this party on Christmas day looking forward to being around family and unwinding and partaking of a Christmas cocktail only to find out there aren't any?",
              "id": 218,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "She shouldn't even be making rules in the home she shares with her husband without discussing it with her husband. She's imposing this rule on him as well.",
          "id": 219,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Also was OP just not going to tell people until they got there if someone hadn't asked about a drink they wanted to make? That's wild. It's a rule that wasn't even shared officially! YTA. OP doesn't have authority to decide how or where people celebrate the holiday.",
          "id": 220,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "From my reading, not only did she make a decision for everyone, she didn’t actually tell them. The SIL found out when she called to see what she could bring and mentioned a martini… then the OP decided to say something. The entire family also didn’t know, the SIL had to tell them.",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "OP acting like a spoiled toddler and then going \"is time to grow up\"... made my day",
          "id": 222,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4388,
      "content": "As a non-drinker who also saw my share of alcoholism, I totally understand where you are coming from.\n\nBut unless something very specific has happened that you can point to, or you established up front that you wanted to host alcohol-free gatherings, YTA for making such a major change to the rules and expecting his family to fall in line.   Christmas is not about you--it's about family, friendship, tradition, and celebrating together, and you chose to marry into a family in which alcohol is an integral part of their tradition.   And your childish and  \"it's time to grow up\" comments  are  judgmental and downright sanctimonious.\n\nI almost gave this an E S H because your husband wasn't fully supporting you, but it seems like you didn't actually discuss this rule change with him, and he does have a right to have input into something major like this.",
      "id": 223,
      "comments": [
        {
          "score": 1414,
          "content": ">or you established up front that you wanted to host alcohol-free gatherings\n\nThat's what got me, honestly. It sounds like she wasn't planning on saying anything and just magically expecting everyone to know? She only told the sister when sis specifically asked about bringing a cocktail. And none of the rest of the family knows. Your house, your rules is fine. But you have to actually let people know what those rules are.",
          "id": 224,
          "comments": [
            {
              "score": 470,
              "content": "I get the feeling she wouldn’t have said anything so she could confiscate whatever they brought. I’m surprised their even invited to Christmas.\n\nI wouldn’t want to be around someone so controlling or with a stick up their bum.\n\nEdits a word",
              "id": 225,
              "comments": [
                {
                  "score": 135,
                  "content": "Also so they had no where else to go for dinner.",
                  "id": 226,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Exactly.\n\nAnd I mean- I feel for OP. My dad was an alcoholic, I felt like I had no control over my life or environment growing up and essentially turned into a control freak until I learned that boundaries are what you create for yourself and not for others.\n\nSeems like OP is was trying to manipulate and control the entire evening but these are humans, not puppets.",
                      "id": 227,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 40,
                  "content": "I get that vibe from the post also. She would have her holier than tho moment scolding everyone who dares bring such childish things as alcohol into her gathering.",
                  "id": 228,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Yeah. And imagine how THAT would have gone over 'Seriously?! We aren't drinking today!!?! AT ALL!?! THE FUCK!!?!' Ugh. We'd have been getting an 'AITA for not letting anyone drink at my house on christmas?' post.",
                  "id": 229,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": ">But you have to actually let people know what those rules are.\n\nAnd, you have to realize that people being respectful of your rules may mean they don’t want to be in your house, lol. \n\nOP thinking it’s disrespectful that they are going somewhere else, I think the exact opposite and hubbies family actually seems to be handling this like mature adults who respect peoples boundaries would.",
              "id": 230,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "That right there. I'm an alcoholic I've been sober for 9 years but would never think to impose my restrictions on others. If they want to drink that's their prerogative and has nothing to do with me. \n\nIn my early days of sobriety when I didn't want to be around drinkers I simply wouldn't go to events where there was booze and wouldn't invite people over. \n\nThat said, there are times when you may want to say no. For example my mother in-law has a tendency to over drink, during our daughters birthday party she caused a scene that not only embarrassed her but embarrassed us in front of family and friends and even put our kids into a dangerous situation. It was so bad that my wife didn't talk to her for weeks. \n\nIn that situation we had to be very firm and told her that we still love her and want her in our children's lives however it needs to be without alcohol. That any gatherings with her going forward there would be no alcohol served and asked her not to bring her own.",
          "id": 231,
          "comments": [
            {
              "score": 8,
              "content": "And that is a very specific reason, OP gave no reason, and has not came back to give a reason, so I'm guessing she has none, so she's just an AH.",
              "id": 232,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "9 years? Congrats and good job.",
              "id": 233,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "It doesn't sound like she told anyone about her no alcohol rule and was expecting to just... enforce it out of nowhere. Even if she had talked to her husband about it, not telling people that was going to happen... Oof.",
          "id": 234,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Not only did she not discuss but it sounds like she made a declaration and when it blew up in her face she tried to make him be the bad guy and enforce a rule he didn't even have input on.",
          "id": 235,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3276,
      "content": "INFO:. Have any past christmases/events been absolutely ruined because of alcohol? \n\nBy that I mean violence, drama, puking on the floor, whatever? \n\nIf not, this is a pretty strange rule to implement with your husband's family. They have nothing to do with your father being an alcoholic. If my boyfriend told my mother she can't drink wine with her christmas supper I would find that weird as hell.\n\nYTA unless something truly awful happened previously due to alcohol that would explain this.",
      "id": 236,
      "comments": [
        {
          "score": 1236,
          "content": "I have a lot of family who *only* drink at Christmas. So even though they are teatotallers the rest of the year, they probably wouldn't want to attend OPs dinner.",
          "id": 237,
          "comments": [
            {
              "score": 693,
              "content": "That's how I am. I have 2-3 occasions per year where I'll have a few drinks at most. I wouldn't go to a gathering where the hostess judged me for imbibing 3 x per year and banned me from having a glass of wine with my sisters. Wtf does she think she is lol. Girl bye.",
              "id": 238,
              "comments": [
                {
                  "score": 247,
                  "content": ">I think it’s childish if you can’t have fun without drinking\n\nI don’t think I’d want to spend Christmas with her whether we were drinking or not.",
                  "id": 239,
                  "comments": [
                    {
                      "score": 105,
                      "content": "I hate that line so much, \"can't have fun without drinking\". I generally try to eat pretty healthy - most my meals consist of lean protein, veggies, and no or very low carbs, and water or another 0 calorie drink. If it's a holiday, or a party, or my vacation, I'm eating pizza and chips. I CAN have fun without junk food, but I'd be super bummed out if I showed up to a party and the snack was hummus and carrots and the main course was a salad. I love hummus and carrots and salad, but this isn't the time or place!\n\nSince I'm in the last month of my pregnancy, I know it's been at least 9 months since my last drink, and realistically it's been quite a bit longer than that, but I hosted Thanksgiving, made a pitcher of mocktails, and provided my guest with liquor options so they could turn it into a cocktail. That's being a good host. Provide healthy and junk food options. Provide alcoholic and non-alcoholic drinks. Let adults make their own decisions.",
                      "id": 240,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I almost never drink and I think I might want to drink at OPs gathering.",
                      "id": 241,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 183,
              "content": "Yeah, I basically only have a few drinks on holidays at this point. *Could* I go without? Yeah sure. But considering I choose to go without most of the rest of the time, it would be kind of obnoxious to accuse me of having a problem because I don't want to do that on the time I reserve specifically for having a few drinks.",
              "id": 242,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "That was my Mom. She would have a couple glasses of wine while her and my aunts would prepare dinner and have a great time. The rest of the year? Not a drop.",
              "id": 243,
              "comments": [
                {
                  "score": 8,
                  "content": "A few people in my family make random flavored liqueurs, or make their own wines. Xmas is when things get pulled out and everyone tries them. The rest of the year about half of us don’t drink, but the sampling is a fun tradition.",
                  "id": 244,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "This. I rarely drink. I had a glass of wine on Thanksgiving and before that I hadn't had a drink since September. But I make mulled wine for Christmas and we sip at it all day long (I even have this cute carafe with a tealight candle underneath to keep the wine warm). It's festive.",
              "id": 245,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yep. My friends and I go on a cabin trip every New Years where alcohol is a central part and we’ll sometimes do a summer cabin trip with drinking too. I never drink outside of that but if someone insisted on a sober cabin trip, we’d tell them they can be DD or not go if they have a problem with that.",
              "id": 246,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Same here, it's the only time I ever see my mom let loose and it was hilarious as shit. \"Who wrapped this, it's awful. Oh it's from me!\"",
              "id": 247,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I only drink on special occasions. The rare night out (once a year if that), Christmas. Maybe a glass on new year from Christmas’ left overs or a birthday. \n\nI’d definitely not be attending a Christmas without drinks if a Christmas with drinks was on the table.",
              "id": 248,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 310,
          "content": "Exactly. There's no real way to judge this one without more information. \n\nI have experienced 2 family members thay frankly cannot be tolerated when around alcohol. It ends with them so drunk and picking fights, sometimes physical, hurling insults, behaving bizarrely in front of kids, it's just not safe. \n\nIf thats what's happening a booze free holidays seems the only option. \n\nIf this is all paranoia from having an alcoholic father, that's a far different story.",
          "id": 249,
          "comments": [
            {
              "score": 264,
              "content": "I feel like these stories would have been told if they existed.",
              "id": 250,
              "comments": [
                {
                  "score": 105,
                  "content": "And OP wouldn't have simply referred to drinking as childish if there are way worse reasons for not liking social drinking.",
                  "id": 251,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "That's a good point",
                  "id": 252,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "They definitely would have. OP doesn't hold anything back (opens up about her father being an alcoholic and calls her in-laws childish all in the first paragraph!)\n\nBut even if there had been an incident, OP would still be the AH for: 1. Unilaterally deciding this Christmas would be dry, without even consulting her husband, whose house it also is; 2. Not telling anyone it was going to be dry in advance (again including her husband!) until someone explicitly asked; 3. Calling everyone else \"childish,\" \"disrespectful,\" and \"rude\" for choosing not to attend her event after this went down; and 4. Refusing to let her husband see his family for Christmas. YTA.",
                  "id": 253,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "If two people act like assholes, then you just don’t invite those two people. Nobody inciting violence gets a free pass to keep coming to my house and they aren’t ruining it for everyone else who can have a cocktail and not be an idiot.",
              "id": 254,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 119,
          "content": "This is important information.",
          "id": 255,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 108,
          "content": "I feel like if this was the case she definitely would have stated that, but yeah if that is the case then I can see more where she’s coming from.",
          "id": 256,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "Good point but I doubt anything has happened, OP just seems to have a strong personal dislike for alcohol and admitted she thinks it’s childish to drink to enjoy yourself. She even said “It’s time to grow up.” I think if anything has happened at holidays in the past she would have said so, and that would definitely be a good reason to consider and discuss banning alcohol - especially the puking thing; anytime someone can’t hold their liquor especially at damn Christmas and ruins other peoples’ time by getting sick, it’s time for that to go. But again, this seems like something OP would have, and definitely should have if applicable, mentioned.\n\nIt’s frankly not even clear that anyone gets drunk, OP mentioned multiple bottles of wine and cocktails. This is my family every Christmas, we have multiple bottles of wine and cocktails present, and no one’s ever drunk. Ever. My aunt and uncle always made a festive cocktail for everyone to enjoy - if they want to - every Christmas Eve, its something fun they do. Depending on how many family members there are, “multiple” bottles of wine may not even mean everyone is having a lot of it. I really think OP just hates alcohol and has some trauma around it.",
          "id": 257,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Agreed. It sounds like the one person who has alcohol problems isn't in the picture anymore. This is solely OP's ruined view of healthy consumption- while a valid reason to abstain, it's not reasonable to expect it of anyone else",
          "id": 258,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "And of course, there's no reply and not a single comment on the thread.",
          "id": 259,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "Right! I am not a drinker and never have been. No one in my family drinks and most of our social circle are also non-drinkers. But unless her husband and family are getting so sloshed that it ruins the event, she has no standing to unilaterally decide what grown people can/cannot consume. Now, if they are running into the Christmas tree and drunkenly screaming at each other I will be totally in her court. If not...she needs to unclench and lighten up. (And respect that her husband also owns and lives in her house as well. Not a fan that she decided this FOR him when it is in his own house...)",
          "id": 260,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1759,
      "content": "I was hovering between N A H and YTA, but I’m going to go with YTA.\n\nThe reason I’d say N A H is because you can set the rules at your house-they can choose not to attend because of it.\n\nHowever, I do think YTA because of your attitudes towards people who drink, your judgmental attitude, for shoving your husband in the middle, and for thinking everyone else is TA because they don’t want to make the same choices you do. You’re banning alcohol because you personally think it’s childish, you’re judging people who drink, and you’re surprised they don’t want to get together with you? Neither would I, and not because you’re not serving alcohol, but because of your snobby, holier-than-thou attitude. You think you’re better than them because you don’t drink-or at the very least, that’s the vibe you’re giving off.\n\nEDIT: to clarify the ruling is YTA.",
      "id": 261,
      "comments": [
        {
          "score": 309,
          "content": "yea OP must be fun at parties. I feel sorry for the husband. I hope she reads all the YTA verdicts as resounding booze",
          "id": 262,
          "comments": [
            {
              "score": 37,
              "content": "Going out on a limb and guessing that OP doesn't get invited to many parties.",
              "id": 263,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "> yea OP must be fun at parties.\n\nThe kind of person who doesn't get invited to a second party, for sure. Or rather, her husband gets invited places and people tell him he has a +1 out of politeness.",
              "id": 264,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "I’m offended that no one has yet acknowledged this pun!",
              "id": 265,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 156,
          "content": "She set the rules but didn't tell anyone until the SIL brought up a cute drink idea she wanted to do. SIL then had to tell everyone else that it was a dry party.",
          "id": 266,
          "comments": [
            {
              "score": 58,
              "content": "Yeah that blew my mind-I was picturing his family being heavy drinkers walking in toting bottles of hard liquor and 24 packs (not that I’d mind, sounds like a fun time to me) but like…a cute holiday cocktail? Good lord.",
              "id": 267,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "And! She seems mad that SIL told the family it was a dry celebration!\n\nEdit: I type too fast for my phone to catch it",
              "id": 268,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Then she got mad when the SiL told other people. Sounds like she wanted to tell everyone else after they got there.",
              "id": 269,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 28,
          "content": "It’s her husband’s house too. What if he makes an alcohol allowed rule?",
          "id": 270,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "You have to space out N A H or else your comment here is an automatic vote for that judgment since you put that first. If you believe op is YTA, maybe move that to the first spot and still space out N A H.\n\nBut yes OP is 100% YTA here.",
          "id": 271,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Agree with your YTA analysis, but would note to your first point that it is THEIR house.  And the decision to make this  Christmas a dry one was a unilateral decision.  She's the AH for that as well.",
          "id": 272,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "In fact, it's clear they are happy to get together with her, even if she is unwelcoming and judgemental, as they did extend their invite to her, it's just that they respect her decision not to have alcohol in her house, so have relocated to somewhere where they can drink!",
          "id": 273,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1352,
      "content": "You get a Dry Xmas, they get a Merry Xmas. Your husband unfortunately is stuck with you.",
      "id": 274,
      "comments": [
        {
          "score": 227,
          "content": "Yeah the husband being forced to not go is wild to me. I would never dream of telling my wife she can’t go to a family gathering because I don’t like what they do.",
          "id": 275,
          "comments": [
            {
              "score": 27,
              "content": "I would never dream of listening to my husband if he said I couldn't be with my family.  He'd be home alone",
              "id": 276,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "Not for long. I have a feeling he’ll be single next Christmas.",
          "id": 277,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1288,
      "content": "It sounds like you’re projecting your trauma onto everyone. YTA, go to therapy",
      "id": 278,
      "comments": [
        {
          "score": 167,
          "content": "This is what I was thinking! I grew up with an alcoholic father who definitely left me with enough trauma to fill a Suburban. I don’t particularly enjoy being around people who can’t drink without blacking out. But there is one time of year where my family drinks - Thanksgiving and Christmas. \n\nWe are spread all across the country, some overseas, and there is nothing like sharing a glass of Cranberry wine with my favorite cousins as we laugh at our uncles while they relive their glory days. No alcohol is not NEEDED for these gatherings to be fun. My mom doesn’t drink but does she project the trauma of being married to a mean drunk on everyone else? No, therapy and Adult Children of Alcoholics (ACA) meetings help.",
          "id": 279,
          "comments": [
            {
              "score": 8,
              "content": "I don’t have alcoholic related trauma and I don’t particularly enjoy being around people who can’t drink without blacking out. I think you’re pretty normal on that front, most of us are done with it before we graduate from college.",
              "id": 280,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "I don’t even drink and I think this is a bit much. Perhaps just spiked beverages if she’s so worried",
              "id": 281,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}