{
  "post content": "My son just graduated high-school and we were paying so he could go on a road trip with his friends. He was suppose to go Wednesday , my wife’s mother and father got in a car accident. They live in another state so we had to drive about 4 hours. My wife was a wreck and wasn’t in the position to drive since we her dad was critical. He pulled through luckily. \n\nWe have two other kids 11 and 7. We can’t leave them at home alone and we couldn’t find a sitter to watch them on such short notice, we even tried our neighbors but he couldn’t do it. So that left our 18 year old. He was pissed to put it mildly but did it. I told him we would make it up to him, and if he could ask if his friend could move it back a week. They couldn’t sadly. \n\nWe were gone for two days, he pulled though. My wife stayed and I headed back, I payed him for watching the kids and went to talk to him about getting him on the trip. It was suppose to be two weeks and they should just be a state over. He blows up about ruining his trip and there is no point going even though it should still 12 days of the trip. He called up a jerk and lock himself in his room. \n\nI need another opinion since this was emergency and he doesn’t seem to care his grandparents almost passed.\n \n\n\nEdit: Well he called his mom, let’s say it didn’t end well,  he did say basically said the same thing he said to me, wife had a breakdown on the phone with him, she sent him the injuries and pictures of grandpa/grandma. He finally came out of his room and told me he isn’t going to go on the trip and the plan tickets aren’t needed. \n\nTalked to my wife, never heard her that mad. Son confirmed what happened, he started yelling at her the moment the call started and she lost her shit when he called her selfish. On good news grandpa has some feeling back in his legs which was a huge concern \n\nFor people saying we didn’t have emergency plan we do, first my closest friend- vacation, main babysitter- not available, backup babysitter- not available, last resort grandparents- hospital.  We tried to find someone that why we even asked our neighbor which I have a good relationship with.\n\nThis will be my last update, had a conversation with my son about everything. Mom and him will have a conversation when she is calms down. His friends are not a state over, they are about two down at this point and going to Mexico. They are probably will get to the boarder tonight, they were suppose to be going to California . He had his passport and everything ready. This is a fucking mess.\n\nI haven’t informed my wife yet and will wait until she is calmer. I’ll leave off with I hope none of you ever have to deal with a situation like this and please remember your parents are human",
  "id": 1,
  "comments": [
    {
      "score": 12540,
      "content": "NAH - what a terrible situation for everyone involved.  however - if he is rejecting any potential resolutions to this, it's just because he's upset.  i'm sure he cares that his grandparents are ok, but he cares MORE about the trip, which given the circumstances, is somewhat understandable.\n\nEDIT: just read the update......sorry to say, but yelling at someone who is dealing with parents who have sustained significant injuries is NOT OK.  however disappointed the kid is, this is a hugely immature AH move.",
      "id": 2,
      "comments": [
        {
          "score": 5350,
          "content": "I do not understand the Y.T.A. votes at all. He's not being parentified, he's a young adult asked to help out in a one-off family emergency. Kids under 10 do not belong in a hospital, period. Even the 11 year old would be dicey, especially if they're cooped up in grandpa's room - you know, the grandpa who was literally dying. That's traumatic for adults, let alone children. \n\nIt sucks for the older boy, it really does. I can understand why he's hurt about it. But he will likely come around. It was a true emergency situation and OP did try to find another option. They tried not to f*ck him over, but sometimes circumstances don't allow that. They offered to try to \"fix\" it as best as they can by catching him up to his friends, but he's not ready to think about solutions because he's hurt, and that's okay. \n\nNAH - situation sucks for everyone. I'm sorry, OP.",
          "id": 3,
          "comments": [
            {
              "score": 2842,
              "content": "because this sub is just teens commenting with no life experience or these hyper individualistic people who don't think they owe anything to anyone and everyone should go no contact with their families if they are ever asked to sacrifice even one moment of their time to help their loved ones out of a bind. i agree it's NAH. son is just being immature because he is 18 and is therefore inherently immature. i think op's offer was fair. sometimes shit happens and you have to step up for your family.",
              "id": 4,
              "comments": [
                {
                  "score": 1098,
                  "content": "\n>because this sub is just teens commenting with no life experience \n\n\n I had never really thought of that, but now that you mention it, I can hear it in the responses. They're reacting the way the son is, like an immature teenager! When you're a kid, you think you'll never get to take another road trip again. You don't understand the gravity of emergency/near death situations because you think *you're* invincible. Finally, you don't want to take care of your siblings because, well, you're a bratty teenager who wants what they want when they want it.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 424,
                      "content": "They think somehow a person having an emotional breakdown can handle hospital paperwork alone. It's mental.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 312,
                      "content": "Yeah, I didn’t think about it either until one time I gave a rude reply to a comment trying to give some bad legal advice with something like “this advice sounds like it’s coming from someone who just took their first high school civics class” and the reply I got was “yeah I’m 16 so what? Doesn’t mean I don’t know how the world works”\n\nLol. So yeah…",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "What's infuriating is it's not like he even had to miss the whole trip, it was a few days and it sucks because he was obviously really looking forward to it, but now he's rejected the chance to join up for the remaining 12 days out of immaturity and spite.  This was a legit family emergency and one of those times where you need to step the fuck up.  OP must have insane self control because the tone of his post is so neutral, if I were in his position there's no way I would be able to hide my disappointment.  Son could have banked a ton of gratitude and respect from his parents.  When I think about my relationship with my parents some of the memories that stick out the most are those moments where I could tell that they felt they raised me to be a good person with good values.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "honestly to me it isn't even a young vs old thing. I just hope its people that don't have a good functioning family or sth that are voting like this. I can't fathom anyone at any age (except idk 0-10 year olds) could ever be so cruel to their parents in this situation.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "You ever waste time arguing with some redditor and end up checking their profile and it’s just posts from r/teenagers lol",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "> you think you'll never get to take another road trip again.\n\nWhich is probably true lol. I'm 37 and never had a single one, who has money like that? Once you start working and paying bills most of us don't get that option.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 177,
                  "content": "Don't forget the divorces, everyone whose spouse was inconsiderate or whose mother in law is over the top should immediately divorce their spouse.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 18,
                      "content": "[deleted]",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "Gah damn the snort I did when I read this is gonna be enough to get us through the shift, thank you holy shit I hope you have a great day,",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "And cut off a parent the moment there's a disagreement with them.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Totally.\n\nMarriage is work. It's not a fairy tale, and a lot of these literal kids break things off with a BF/GF at the first sign of difficulty. They don't even make it past the infatuation stage.\n\nLike, my wife has issues with my mom, as we parent differently than my parents did, and my mom gives passive aggressive advice about it. I completely understand where my wife coming from and I'm annoyed by it too, but my wife hasn't had decades of criticism like that, so it doesn't go in one ear and out the other like it does for me. It doesn't feel great to see her have to emotionally psych herself up for visits with my parents.\n\nBut we both acknowledge that a lot of it stems from the generational trauma my mom got from her parents. She's a saint compared to her mother (my mom's mother is the only living grandparent between my wife and I, and we didn't invite her to our wedding), but she still gave me a ton of baggage that I'm trying to work through and doing my damnedest to not pass on to our kids.\n\nAnd then we have a very icy relationship with one of my wife's sisters because of how much of an asshole her husband is. I'm not even going to dive into that, but suffice to say, marriage is hard, especially with close family and having kids. But it's also worth it. At least to me.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Gym up, delete your lawyer, hit the Facebook.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 280,
              "content": "NAH - I agree with you completely. The kid has a right to be upset, and teenagers are impulsive. If OP let's him calm down a bit and then asks him again if he wants to join his friends, I think he will accept.",
              "id": 18,
              "comments": [
                {
                  "score": 118,
                  "content": "I agree that OP should give it a little time and offer again. I remember that very black and white thinking when I was younger - that if something didn’t go exactly as I planned/wanted, it might as well not happen at all. He might also be grappling with feelings about his grandparents’ accident, maybe feeling selfish for being upset about missing the 2 days… I don’t know, but it’s easy for all those feelings to get tangled up and come out as anger. Hopefully the family can have a little downtime, start to process this very stressful event, and rally to get the son to where he needs to be to salvage the rest of his trip. NAH",
                  "id": 19,
                  "comments": [
                    {
                      "score": 98,
                      "content": "I think it's transference. He's upset about his grandparents and being in charge of two young kids and it's coming out as anger about the trip. Everyone in this thread is so quick to call everyone an AH, how about a little empathy? Everyone involved has had a shitty couple of days.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "It sounds like the trip is not actually what the son was advertised. The friends are supposed to be one state away and instead they are 2 states away and on their way to the Mexican border. Sounds like part of the frustration is that he has to reveal the real plan to his dad in order to catch up, and I am going to guess that the friends aren't willing to delay in any way to pick up . So he's also learning how much his friends value his company versus the plans made for Mexico.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Maybe it's just me but I can't tell with the wording in the update if the son's choice not to go was because he decided it was better to stay behind given the circumstances or because he has an all or nothing mindset about the trip and is feeling bitter. \n\nEither way, I agree that disappointment about his first big \"adult\" adventure with his friends was likely driving his initial reaction. And also, possibly being told he had to stay home and not being asked and allowed to make that choice for himself. It's not clear if he had a say in this or not. I can see him resenting not being treated like the adult he perceives himself to be and being allowed to choose to help his family on his own.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Also, at that age, you likely haven’t seen a lot of death of loved ones. You sort of have the mentality of “they’ll be fine” because they always have been, particularly when they’re grandparents who live far away and you likely don’t know all that well. You’ve never experienced the gut punching grief that accompanies the moment you’re told that they’re gone. At that age, the trip being cancelled is the worst possible outcome because death just isn’t something you’ve thought about too much.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 131,
              "content": "I think most people are rightfully pointing out that if this happened just a couple days later, son would not have been available either, and they would have needed a different plan.\n\nHonestly, I do know what would have happened in this situation in my family because it's happened before. My parents would have taken turns with the kids- one stays at the hospital, the other stays with the kids and they switch off. In my case, it was because my older sister's appendix suddenly burst on vacation. My parents were obviously not doing great (it fully burst and she was initially misdiagnosed, so she was in a bad physical state by the time she got to surgery) and the rest of us were too young to get how bad the situation was. But you do what you gotta do, and whatever parent was with us at the time at least pretended to keep it together. Entertaining young kids in a hotel room isn't easy either, but possible.\n\nI was also in charge of younger siblings after my mom's car accident while she was in the hospital, so I've been kinda in son's situation. It's actually worse if he is upset about the grandparents because a teenager is not as equipped to handle that stress as an adult is. You suck it up, but I remember us being ready to kill each other at a few different points.",
              "id": 24,
              "comments": [
                {
                  "score": 216,
                  "content": ">I think most people are rightfully pointing out that if this happened just a couple days later, son would not have been available either, and they would have needed a different plan.\n\nAnd if my grandma had wheels she'd be a bicycle.\n\nThe parents did the best they could with the resources available, and in this case, the older son was an available resource.\n\nIf the accident had happened later, when the son was not available, then they would have to use other resources.\n\nJudging them negatively for using the available resources because in another scenario they wouldn't have been available is not fair.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 122,
                  "content": "I've been the oldest kid in the situation. I had just graduated from college. I was at one of my best friend's graduation parties before he spent the summer in Europe and then joined the peace Corps for two years. My family went on vacation and I was going to meet them the next day. My dad had recently had surgery on his arm that shouldn't have been a problem but when they got there it started swelling rapidly. My mom called me and told me I needed to get there ASAP. (Also my grandfather had died suddenly a few months earlier after living with my family for 21+ years so everyone's anxiety was high af)\n\nMy sister and brother were old enough to be alone for a while and understand the situation. But I got that my parents needed me (I think the 4 years difference between 18 and 22 is paramount here, so I'm not blaming the 18 year old either). I told my friend the situation and he helped arrange rides home for the friends who'd been depending on me so I could get to my family faster and I drove four hours to the beach. \n\nEverything ended up OK and my dad didn't need to be admitted, but I understood at that point that I \\*was\\* my parents' emergency backup.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I think that's really the worst possible option though, especially if OP's wife was as distraught as he says (being totally unable to even drive, let alone do anything else). OP had to be at the hospital to do the paperwork. OP's wife was too distraught to watch the kids by herself. The kids would have had to go to the hospital. It would have been rather traumatic to them probably. \n\nIt's something they could have done if there'd been literally no other options, but thankfully there was one other option - the 18yo looking after them for 2 days.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I disagree.   The eldest son is potentially an AH.  I have 3 younger brothers.   I was never parentified, or used as childcare.  \n\nI also have a loving and supportive family.  If this happened when I was a teenager I wouldn't have hesitated to stay home and take care of my brothers.  Hell, I probably would have volunteered (based on the times I did volunteer when there weren't such dire emergencies).I don't think I would have been able to have fun on the trip knowing my grandparents were on deaths door.  And the fact that in the end I could catch up with my friends would be great. \n\nDo people really hate their family this much that in an emergency, a family emergency, they'd not want to pitch in at all?   \n\nSo unless there are other family issues (being otherwise unsupportive, or unloving, or an issue of favoritism, etc.) this kid is being incredibly selfish and the AH.  Were I their parent I'd be not only disappointed in them but disappointed in myself that this is apparently how I raised them.",
              "id": 28,
              "comments": [
                {
                  "score": 5,
                  "content": "As of the edit, the son is a total jackass for yelling at his mom; but before that, I wouldn't have called him selfish. Being upset a situation like that is pretty understandable.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Being upset or disappointed is not a problem.   It's natural.  Healthy even.  How you handle those emotions is what's important.   I know they are a teenager but 18 years old is old enough to understand what a family emergency is.  To have the empathy to understand their mother could lose a parent.  To know their siblings and parents need help. \n\nThey didn't think of their family.  They didn't even think of their injured grandparents.   They only thought of themselves.  To quote Homer Simpson \"I only care about M. E. My enjoyment.\"\n\nAnd then declaring the whole trip is ruined because they missed the first two days?  \n\nThat's the selfishness.   Being upset is completely understandable.  It would be strange if they weren't upset.  Acting out the way they did is what made them selfish.   You are not responsible for your feelings, you are responsible for your actions and how you manifest and deal with those feelings.  That's something you teach to toddlers.  This was a high school graduate.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "I work in an ICU and it irks me to no end when people bring small children to visit. If it’s an end of life situation—depending on the circumstances—I can understand it, but otherwise it’s completely inappropriate. Case in point, just the other day I had a visitor bring her two small children to visit a patient who was severely injured and hooked up to all sorts of lines/devices. The young boy with her immediately started sobbing and was terrified.",
              "id": 31,
              "comments": [
                {
                  "score": 7,
                  "content": "I'd imagine there's a big difference between a brief EOL visit and keeping two children in an ICU for two days.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Don't be reasonable, rational, or speak like a normal and functional adult, now. That's the number one rule of the sub. You shall not, under any circumstances, ever display maturity, community-oriented thinking, or make sense. It's unacceptable and will not be tolerated. \n\nAlso in the future be sure to add, \"NC,\" \"red flags,\" \"undeniable parentification,\" \"narccissist,\" \"manipulation,\" \"gaslighting,\" \"they're old and already lived life anyways,\" \"offer to pay,\" & \"expect nothing will change\" to your next AITA reply. It's compulsory and absolutely neccessary that you learn to speak the proper language of high-horse-out-of-touch-circlejerky-Internet-sociopathese before you start posting and commenting around here.",
              "id": 33,
              "comments": [
                {
                  "score": 10,
                  "content": "Oh you're right! Let me try...\n\nClearly the grandparents are T.A. because it's a red flag that they got into the car wreck in the first place. Anyway, it's basically parentification to expect your adult CHILD to raise their own CHILDREN! Clearly manipulative to choose this exact day to wreck their car, and get themselves admitted to the hospital (that's expensive - they're gaslighting their family out of an inheritance and they're narcissists for not kicking the bucket because they've lived part of their life already). Be sure to go NC while they're in the hospital because you can expect that nothing will change. XOXO :)\n\n/s for the autists like me out there.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "I completely agree. \n\nThe reasonable thing would be for the 18yo to understand that emergencies happen, you have to be gracious and pull your weight. In this case, that was helping out mom and watching the siblings. This is what adults have to deal w all the time- doing the right thing in uncomfortable situations. \n\nAlso the fact that OP had to say that he has backup babysitters… it’s not his fault. Lots of people don’t babysit bc they don’t like it, or also they’re unqualified, have pets kids are allergic to, etc. You can’t dump your kids with anyone over 18- lots of people don’t have lots of babysitting options. \n\nAs a parent, I couldn’t imagine having two younger kids crawling all over the hospital. It’s also ridiculous to assume dad would stay at in laws with the younger sibs. What if mom needs support at the hospital? What if fil needs food or any other run, while the mom and grandma are in a meeting with the doctors? What if both women wanted dad to drive them bc they’re both crying and emotional?\n\nI feel like a lot of people in this sub aren’t parents and don’t understand the nature of kids. Kids are so fickle, you could literally have the perfect environment (re: their snacks, their fave games) and they’ll randomly freak out. Especially if they’re cooped up in a hospital room and things get too boring. If something happened to loved one and my kid was throwing a tantrum, I would not mother her well at all.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "> Kids under 10 do not belong in a hospital, period. Even the 11 year old would be dicey, especially if they're cooped up in grandpa's room - you know, the grandpa who was literally dying. That's traumatic for adults, let alone children. \n\nThey don't? I would spend hours in the hospital at single-digit ages while my parents visited my grandparents, barely supervised, and nobody thought that was unusual.\n\n...and now I'm an adult that's afraid of hospitals. Maybe you're onto something.",
              "id": 36,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Yeah the YTA votes are baffling. Shit happens in life and sometimes it ruins your plans. And when your parents are in an accident and in serious condition, you have to do what you have to do. And you don't have time to do everything perfect. You have to make decisions and go. My mom's parents were in a car accident why I was a baby. They both died. As a result, my parents have no idea when I started walking, or said my first words, or a lot of those milestones that happen. My baby book is half empty. There aren't even a lot of baby pictures of me. My brother is 2 years older, and they have all that stuff on him. Do I resent my parents for that? Fuck no, it's not their fault. Shit happens. Sometimes really bad shit. The 18 year old should be grateful his grandparents survived. Mine didn't. I can understand him being disappointed, but he needs to focus on what's really important in life.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Reddit is full of teenagers who have no concept of needing to sacrifice your wants for the needs of others in an unforeseen circumstance.",
              "id": 38,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 295,
          "content": "I agree. NAH. Just an unfortunate event for all.\nI’m sure your son was really excited about finally graduating high school and going on an epic trip. So missing it sucks. But I would ask him again to meet his friends in a state. Offer to fly him business class maybe? It would be a couple states over, shouldn’t be too $$.",
          "id": 39,
          "comments": [
            {
              "score": 164,
              "content": "I mean, my parents were once literally waking out the door to go to Hawaii when they found out my granddad had a stroke.  They couldn't afford to replace the trip, but of course they dropped everything to go to be with granddad.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "They did offer to fly him. He declined.",
              "id": 41,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 182,
          "content": "I had the delightful opportunity to travel abroad with a high school group just after graduating, and it was absolutely amazing. Towards the end of this 10day trip (I believe day 6/7?) my grandma passed away. \n\nI think you are absolutely right in saying NAH. My dad traveled back to deal with the funeral, and while I had the opportunity to go back as well, I (probably selfishly) didn't want to. I was 18, my relationship with my grandma wasn't ideal, and I was devastated at the thought that I had to give up that chance and the rest of that trip for her. In retrospect though, I do wish I had gone. I think my dad needed support, and I felt like a terrible daughter for a long time following because I couldn't get out of my own head long enough to empathize with my dad having just lost a parent. It took me years to accept that I was still a child, and under that level of stress and confusion, I wasn't going to make the perfect decision. \n\nEverything about this situation sucks, but ultimately, each person reacted exactly as I would expect them to.",
          "id": 42,
          "comments": [
            {
              "score": 26,
              "content": "To be fair it might have been easier for your dad that you were not there at the time. Of course I don't know your family, but I was around 18 as well when my grandma passed. \n\nI was at some friends house but I got home as soon as possible (to be fair I was too distraught to remember how I got home exactly because it absolutely didn't matter at the time). I loved her a lot and I was absolutely devastated so I just wanted to cry my eyes out in the arms of my parents. While I was desperately looking for consultation I realised that my mom was bawling her eyes out as well, and I had to \"take my dad away\" from her, even though she might have needed him more, but she did everything she could to stop crying to be strong for me (and my younger siblings that came home not that long after me). \n\nAfter we all went to bed I heard her crying again and from that point on I felt so guilty for being so sad that my mom had to hide how hurt she was as well. \n\nIf it wasn't clear my point is that it might have been easier for your dad to cope and process his grief while you were gone because parents will often do everything they can to spare their children, including hiding their own feelings and needs even though they hurt like hell",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I appreciate you explaining this situation from the perspective of your younger self and adult self and how your view of the situation differed with time, the wisdom of age, and some reflection. \n\nI agree with NAH and for all the reasons you explained about your own situation.  It's a tough situation the first time you are faced with such a huge misfortune or loss as a newly minted adult and it's not surprising that you and OP's son would choose the big exciting adventure of a lifetime you both had been looking forward to. \n\nI get it and I think OP's son deserves some grace. I'm glad you can look back and give that grace to your teenage self as well.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Yeah, agree with this.  The son obviously recognized it was an emergency situation, that's why he listened and stayed back to care for his siblings despite how badly he wanted to leave. Honestly, good kid.\n\nHe's just frustrated and being so young probably still struggled to handle it well.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I certainly can remember being in that kind of  situation where it feels like everything is ruined even though it’s not and he can just go and enjoy the majority of his vacations still. He’s 18. I’m sure OP will work to make it up to him too",
          "id": 46,
          "comments": [
            {
              "score": 10,
              "content": "All around terrible situation with no winners but I feel like everyone is being too harsh on OP’s son. I remember being in a similar situation at his age, and thinking about how everything felt black and white.\n\nFor OP’s son, it’s a very defining part of his life that he’s been looking forward his entire life. He’s probably\nworked hard and is ecstatic to be graduating. It’s a big moment in his life is an understatement. He’s probably worked hard and he wants to celebrate with his high school friends before they go separate ways. He’s thinking about how proud he’s making his family. And all of this cumulated into this trip.\n\nAnd now all of a sudden, all of his plans come crashing down and he doesn’t know what to do. His parents are yelling at him that he has to watch his sibling, he has to explain to his friends why he can’t go, and now he has to deal with his family in distress. And even though he is an 18, he’s still a kid whose brain hasn’t even fully developed, and this is unfortunately his first time dealing with an “adult situation” that isn’t an easy choice or sacrifice in the slightest.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I agree that dad is NAH, but when I think about this kid's high school experience, I do have some sympathy for him. He basically had 2 years of high school that were somewhat normal and not wrecked by the pandemic. That's a lot of experiences that he missed out on. I'm not saying this justifies his reaction, but if you view this as one more thing that he's asked to miss out on, it makes a little more sense. \n\nBut, a flight to go meet up with your friends after missing two days seems pretty reasonable. I hope the kid figures out that he's ruining his own experience this time and can meet up with his friends before the trip is over.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "That is why he is a a kid, he gets ti immature.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5294,
      "content": "I'd say NAH.  In this kind of sudden and critical situation you didn't have time to explore any other options (although taking your younger children with you would have been the next best thing) and you also paid him for babysitting.  Your son is also not an AH for being really upset and angry about missing his trip. However, he's only got himself to blame for not going out to meet them for the rest of it after you offered to get him there.",
      "id": 50,
      "comments": [
        {
          "score": 2964,
          "content": "Yeah that was a classic teenager reaction, I don’t hold it against him (cuz uh, he’s a teenager) but he’ll look back on that and cringe. Talk about cutting off your nose to spite your face. \n\nHe lost two days of a two week trip, his dad is offering to get him out to where the trip is (!!) and he says no?  That part is officially on him. \n\nNow if I had reacted that way (can only speak for\nMyself) it would have been for some obscure embarrassing reason I didnt want to explain to my parents, like I had gotten it all set up that I would share the back seat with my crush and she would fall asleep with her head on my shoulder during the quiet overnight driving hours and she would discover she’s madly in love with me, and now that dad messed up the seating arrangements by <checks notes> having the grandparents get into a serious accident, my love life is RUINED. FOREVER. \n\nNot saying that’s what happened here, but if I personally had made a judgement call seemingly that petty and counterproductive to my own aims, there would have been some underlying (probably embarrassing, probably about a girl) reason for it.",
          "id": 51,
          "comments": [
            {
              "score": 525,
              "content": "I love this comment! It just brought me back to my youth and all of my unspoken plans/fantasies/never gonna happen scenarios. Of course OPs son will look back someday and cringe, like most of us do at our teenage temper tantrums. But for him, right here and now, it is the worst thing ever.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "I suspect the reaction after the two days from the kid was partially or wholly fuelled by the guilt trip the parents dropped on him. Of course he'll say no then.",
              "id": 53,
              "comments": [
                {
                  "score": 111,
                  "content": "He's the one who called his mom to yell at and insult her, responding with pics showing how serious the situation was is not a guilt trip, it's a dose of reality.",
                  "id": 54,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 40,
                  "content": "I mean... guilt has purpose. He should feel guilty for throwing a fit and selfishly thinking his feelings were more important than his injured mother's. People are forgetting he's a) an adult! And b) there were several people severely injured. This isn't a 'Dad said no' post! It's a 'adult who still lives at home and uses their parents money earns even MORE money during emergency and is still pissy about it' post. If you scream at an injured family member who's father is dying a guilt trip is your **nicest** consequence in my mind. Adults are supposed to land on their feet and roll with the punches of life, even if they're brand new at it. NAH but son is going to cringe at himself very very soon.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Cringing at things your teenage self did is pretty much a part of life for all of us.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Mom was sending him pics of the injuries lol",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": ">Now if I had reacted that way (can only speak for Myself) it would have been for some obscure embarrassing reason I didnt want to explain to my parents, like I had gotten it all set up that I would share the back seat with my crush and she would fall asleep with her head on my shoulder during the quiet overnight driving hours and she would discover she’s madly in love with me, and now that dad messed up the seating arrangements by <checks notes> having the grandparents get into a serious accident, my love life is RUINED. FOREVER.\n\nAccording to the final update, it seems the son lied about where the trip was taking place.  Him and his friends were actually going to cross the border into Mexico.  So yeah, makes sense how a two-day delay would ruin your entire trip if you don't want your parents knowing where you're actually going for some reason.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "This was written with such empathy. Thank you. There’s no assholes in this story, just a really bad situation and teenage emotions on display. I thought the same thing when I read that he now didn’t want to go for the rest of the trip. There’s a reason that is deeply personal and would likely make little logical sense to someone outside his head why he feels trapped in not going now. Hopefully he’s able to find his way through that, and hopefully he doesn’t cringe too hard when he looks back on how he treated his parents during a hard time.",
              "id": 59,
              "comments": [
                {
                  "score": 13,
                  "content": "Well I’m grateful that you think so, my first baby (a son) is on the way in a few months and I’m obviously very nervous about making sure I do right by him. \n\nTrying to meet them where they are and be understanding without being overly permissive….I dunno man, this “parenting” thing seems crazy lol.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 8,
                      "content": "With the perspective you’ve shown in your post I’m sure he’s in good hands.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "As the teen, I wouldn't have blown up at my parents, but would feel the same way about not wanting to 'mess up' my friends plans by meeting them later.\n\nUnless they have another person filling his seat in the car, I'd recommend the dad push harder for his son to meet up with the road trip.\nFor me, it would be a stressful couple days to meet up with everyone and figure out logistics, and I'd end up enjoying 10 days of the 12 day trip.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Reading between the lines in the update, it sounds like the kid lied about where they were going and didn't want OP to find out, so he had to miss the whole thing instead of coming clean. Why would he lie about going to Mexico? I'm not sure, but I think it's important that OP finds out.",
              "id": 63,
              "comments": [
                {
                  "score": 19,
                  "content": "Parents probably didn't ok a trip out of the country.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I think you're overlooking the fact that a trip like this is entirely about independence. Spreading your wings, making your own decisions, and having complete agency. The way OP handled this situation pretty much stripped his son of his agency. \n\nIf I were the kid, I don’t think I’d want to go on the trip anymore either. \n\nI don’t think anyone is the asshole here, but I think everyone needs to communicate better and OP needs to understand their son isn’t a de facto babysitter. Although every family dynamic is different I suppose.",
              "id": 65,
              "comments": [
                {
                  "score": 8,
                  "content": "Respectfully (partially) disagree. I agree that the upfront action of asking/demanding he stay home robbed his son of some agency. \n\nBut for real he offered a solution that was as good as possible given the circumstances. He gets his son there (remember, parents were paying anyways so if son is flying to catch up there’s no financial independence difference) and then dad peaces out and let’s him do his thing for 80% of the vacation, traveling in the same vehicles with his friends, returning with his friends. \n\nIt’s not a perfect solution but this isn’t black and white, it’s not “you give your teenager exactly what they want or else it’s nothing.”  I agree there would have been different upfront solutions but it’s not like the dad showed 0 respect or effort towards his sons autonomy here.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 7,
                      "content": "No I get that, I totally. I think OP did everything they could to fix the situation after the fact. \n\nI guess I just don’t think OP had any right passing their situation on their newly adult son, even if they were paying for the trip. I think they could have asked their son to stay and watch the other kids, but if the son said no they should have figured something else out. I guess I just think the responsibility of taking care of the two other children is on the parents completely here. \n\nLike I mentioned before, I don’t think anyone is the asshole here. Just growing pains between adolescence and adulthood I suppose. All your points are totally valid though.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "The edit says the friends on the trip were not as close as the son said they were, and they were actually planning on going to Mexico rather than California.",
              "id": 68,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Very thoughtful.  Teenage emotions are *tough*!",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "He's 18 and a grown man. I doubt much of this has anything to do with being technically a teenager. His grandparents are in the hospital and he still wants to go on his trip? Sus",
              "id": 70,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "INFO: I think this is a fair response, and I agree, but I also would like to know why they couldn’t just bring the two young ones along?",
          "id": 71,
          "comments": [
            {
              "score": 22,
              "content": "I wouldn't want to bring such young children to the hospital like that, not knowing what the grandparents looked like and what may happen while you're there. Maybe OP could have stayed at a hotel or wherever with them but the mom shouldn't have to deal with all of that without support either. \n\nIt's not like they asked him to stay home for a wedding or a party but because his grandparents almost died. Then he was paid and they offered to pay to get him to his friends. The parents seem to be trying to make it up to him as best they can. NTA",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Dragging two children to an ICU with their critical condition grandparents so that a third child doesn't miss two days of a vacation is not the superior parenting choice.",
              "id": 73,
              "comments": [
                {
                  "score": 8,
                  "content": "it's not poor parenting choice, one parent can stay with the kids while the other goes in to check on them and vise versa it's not that hard",
                  "id": 74,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "He also may be a bit nervous about going on a road trip right after his grandparents were seriously injured in a car crash but also wants to be with his friends. As he's 18 he probably doesn't have the ability to fully express that.",
          "id": 75,
          "comments": [
            {
              "score": 4,
              "content": "This is super important to keep in mind when dealing with kids/teenagers. They simply don’t have the life experience or understanding to express the way they feel in an appropriate manner. I had so many fights with my parents where I couldn’t explain what I was going through so my feelings were disregarded or ignored because I was “just a kid”. As an adult I can look back at those fights and say very precisely what was going through my head because I now have that understanding. \n\nObviously yelling at his mom about this wasn’t cool, but it’s not like he was intentionally being an asshole. He’s just having a hard time explaining himself.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Son is NAH for being angry, but is an AH for how he handled it with his parents.  Shit happens, this is some big shit, and his response, especially to his mom, is unwarranted for the situation.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3908,
      "content": "He’s a teenager. They don’t always think rationally. He’s disappointed that he missed an opportunity he was looking forward to. Which he no doubt believes it was his one & only opportunity to ever have fun. Sadly, he can’t get out of his own way to figure out how to put this back together. He has 2 options .... continue to pout or let you help him get what he wants. Not much more you can do. \n\nIt’s not about his lack of empathy. Grandpa’s fine so what could have happened is not really an issue now. It didn’t happen & now y’all need to figure out how to move forward.\n\nNAH\n\neta — adults would struggle with the same feelings if they had plans for a fun trip & a family emergency came up. Once that emergency is over. Most people would be disappointed they missed out on their plans. Your son is upset with his situation. It seems like a normal reaction to me. Don’t make it personal.\n\neta more — based on your edit... you’re trying real hard to make your son the ah here. I’m guessing to absolve yourself in this situation but .... that’s not cool in my book. Don’t throw your own kids under the bus. If your son is that selfish you should ask yourself why or how he got there. Kids don’t raise themselves. I’m a little disappointed that y’all chose to point your fingers at the 18 yr old that had no control over any of this & didn’t have the best reaction. Everyone is this story deserves a little grace. It appears that is not your goal.",
      "id": 78,
      "comments": [
        {
          "score": 608,
          "content": "Agreed. Also sometimes teens (and even adults) cannot grasp the gravity of a situation, and sometimes they have a one track mind (I.e the last trip before college with his buddies).  I get it , I was a teen once. OP isn’t really wrong either because it wasn’t like he abandoned the younger siblings to go on a vacation. It’s just a tough situation. \n\nNAH",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 234,
          "content": "He's allowed to be disappointed, upset, or even angry sure. Cancelling the whole trip because he's pouting, yea Teens can be dramatic. But Calling mom to tell her she's selfish for going when they DIDNT know the grandparents would be okay? 100% MAJOR AH move. He's 18. He's old enough to have some empathy for his family, especially his own mother. And he's old enough to know that that action was absolutely appalling. If I had a friend who said something like that to me, I would instantly cut all ties with them.",
          "id": 80,
          "comments": [
            {
              "score": 26,
              "content": "The kid lied about the whole trip, he was going to leave the country, not going a state over. It was all a lie, he lied to his parents.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "Grandpa is not fine.  He’s just maybe not paralyzed.  \n\nSon has an almost alarming lack of empathy for people he theoretically should love.",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "I agree with your take completely. \n\nIt’s hard as a teenager to see past the moment and I understand why he’s not acting at his best. It’s super disappointing. But it sounds like OP did the best he could in such a short and hectic time. \n\nI’ve had family emergencies get in the way of trips. I was supposed to go on an amazing, once in a lifetime trip where my fiancé was going to propose to me. Family emergency with a relative in the hospital. And you’re totally right. I, an adult, was so disappointed and down about it, but the suddenness of the family emergency was much more important. This is absolutely a lesson in how cruel life can be sometimes. There is no golden way out of it. \n\nSo all the people calling OP the AH for making their kid miss a “once in a lifetime” trip are really confusing me. They paid for it. I’m pretty sure they wanted their kid to have fun and enjoy graduation. \n\nThe only AH here is life.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Oh bullshit. He's 18 years old. If he doesn't have a handle on his emotions at this point god help him on the real-world.\n\nThat  kid is a grade A asshole in this situation.  Being disappointed,you might miss your trip is one thing. Lashing out at your mother during an incredibly  difficult time  is just cruel.\n\nQuit making up excuses for this  for his horrible behavior. Especially since his dad had been more than fair about the situation.",
          "id": 84,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "[deleted]",
          "id": 85,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "The son isn't the AH for his initial reaction; that's understandable. But, he's the AH for not taking his father up on the offer to join the trip late. This now-adult needs to seriously grow the fuck up. This isn't parentification or any other slippery-slope-to-abuse situation. It's a family emergency that sucks more for the grandparents than anyone else. The son needs to quit throwing a hissy-fit and go join his friends.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": ">Grandpa’s fine so what could have happened is not really an issue now.\n\nHe says the grandfather has some feeling back in his legs, that doesn't mean fine.",
          "id": 87,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "He didn’t miss out on plans. He missed out on 2 days of a two-week trip. His father offered to fly him the location for the remaining 12 days. The teenager is just being spiteful at this point.",
          "id": 88,
          "comments": [
            {
              "score": 11,
              "content": ">e didn’t miss out on plans. He missed out on 2 days of a two-week trip. His father offered to fly him the location for the remaining 12 days. The teenager is just being spiteful at this point.\n\nI think that a lot of people are missing that the reason the son didn't/couldn't accept his dads offer to fly him to his friends, is that they were lying about the destination.  The kids had told their parents they were going to California instead they were going to Mexico.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "\"grandpa's fine?\"",
          "id": 90,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2859,
      "content": "NTA- it was a legitimate family emergency and unavoidable. Sending on the trip two days late would be the best options and he needs to get over it.",
      "id": 91,
      "comments": [
        {
          "score": 1445,
          "content": "NTA. I don’t get the Y T A posts. The kid’s grandparents were in a serious accident and he still wanted to go on a trip? And what, celebrate as they potentially died? I don’t understand the lack of compassion from him or people commenting here. In times of stress family comes together and he did his part by watching the kids so the parents could deal with the situation.",
          "id": 92,
          "comments": [
            {
              "score": 759,
              "content": "The lack of compassion and empathy on this sub is so depressing sometimes.",
              "id": 93,
              "comments": [
                {
                  "score": 369,
                  "content": "[deleted]",
                  "id": 94,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Bingo.  NAH.  Emergencies happen.  I see a ton of “what would you have done if he’d already left”… well something else, but it would’ve been harder on the young kids who don’t understand what’s happening.\n\nSometimes your family needs help, and grandparent being near death does override having cool plans adjusted (not cancelled).  Hopefully will been a learning experience for his son and with some time and perspective he’ll realize it was the right choice.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "There are shitty maladjusted adults in here too who are on the YTA hate train.",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "I wouldn’t brush all teenagers with the same brush, I feel like people who lack empathy are overrepresented on this sub as well as being teenagers. My grandma died the day after my 15th birthday and I cancelled my bday plans because I’m not a weirdo and actually had feelings",
                      "id": 97,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Remember that we are in peak teenager hours on reddit because it's summer time and school is out.",
                      "id": 98,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "I see this sentiment a lot, but looking at the [subreddit user overlap](https://subredditstats.com/subreddit-user-overlaps/amitheasshole), it doesn’t really seem like there are that many teenagers here. Users here are 0.63x as likely to post on r/teenagers as the average user, so this place has less teenagers than Reddit as a whole.",
                      "id": 99,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Grandpa almost died and I have to miss 2 days of a 14 day trip 😢 my mom is an emotional wreck so I'm going to call her selfish 😏 then I'm going to whine and pout and not acknowledge anyone",
                  "id": 100,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Kids think parents asking them to do anything is a crime, yet people take to a website frequented by kids to ask questions like this. What do they expect?",
                  "id": 101,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 363,
              "content": "I believe the YTA posts are young teenagers who haven't had a taste of life.",
              "id": 102,
              "comments": [
                {
                  "score": 74,
                  "content": "I was thinking the same thing. Lot of kids and people who don’t have children making a lot of judgements over a situation they can’t even imagine - or are too young and immature to understand.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Literally I think it's people who have never dealt with an actual medical crisis before, probably because of their youth. \n\nI've seen people chastising OP for not having grandma watch the kids (she was also in the hospital), his wife for having a mental crisis while both of her parents were in the hospital with one nearly dying, both because it actually turned out to be completely fine (no it didn't), and OP again for not abandoning her to take the kids to the library to watch them (because someone pointed out that they might not be allowed in the waiting room/being there alone might be traumatizing).\n\nSomeone is dying and medical decisions have to be made, an exhausting and emotional process that might end in death. But clearly that road trip is more important.",
                  "id": 104,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 149,
              "content": "Me neither. I feel like this sub has recently been overrun by children or just generally irrational people. I would be upset at the circumstances, but it was a genuine emergency and his parents tried everything to avoid having him babysit. And having their younger children come with them likely would have been traumatic, as their grandparents were seriously injured and their mom was experiencing great mental distress. And he has 12 days of his 14 day trip left, which his dad clearly seems willing to get him to! It's just an unfortunate situation. The parents aren't AHs.",
              "id": 105,
              "comments": [
                {
                  "score": 9,
                  "content": "Schools out, they've got all the time in the world now!",
                  "id": 106,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "It's summer time. They are all out of school I guess.",
                  "id": 107,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "I just don't get it at all.  I wouldn't have gone anywhere with a grandparent in critical condition.  NTA at all.",
              "id": 108,
              "comments": [
                {
                  "score": 15,
                  "content": "I got downvoted into oblivion for saying this. Maybe I just had better grandparents than everyone else?",
                  "id": 109,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I'm getting down voted for saying I wouldn't leave my mom when she was distressed either. Maybe people here really don't like their parents.",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I think there is a big pushback against this idea of “parentification” where kids are essentially forced to become parents of younger siblings at the expense of having their own lives. The problem is this is not that. This is a kid who has a family being asked to simply play his role as part of that family in an all hands on deck emergency situation. But the people voting on this, like others have said, are likely teens or young people without kids. And they can’t tell the difference between parentification and simply having a responsibility to people close to you.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "The YTA posts are likely a also bunch of frustrated teenagers, like OP’s son.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Reddit is full of children.",
              "id": 113,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I would give up traveling if I could get my grandparents back",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 168,
          "content": "People with the \"not my problem\" attitude. Hope it works out for them.",
          "id": 115,
          "comments": [
            {
              "score": 92,
              "content": "The parents paid for the trip… if the son is a “not my problem” type of person, they didn’t need to pay for it.",
              "id": 116,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "The fact that the son is refusing to fly out to meet his friends makes me think either he has found out that his friends don’t care enough about him to pick him up (which could be the real source of his frustration which he’s taking out on his parents) or the trip they told their parents about isn’t the trip they’re really on and the son would have to tell his parents where his friends really are in order for them to get him a plane ticket.",
          "id": 117,
          "comments": [
            {
              "score": 9,
              "content": ">or the trip they told their parents about isn’t the trip they’re really on and the son would have to tell his parents where his friends really are in order for them to get him a plane ticket.\n\noooh, I hadn't even thought of that.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": ">or the trip they told their parents about isn’t the trip they’re really on and the son would have to tell his parents where his friends really are in order for them to get him a plane ticket.\n\nYou nailed it",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "As an older sibling, I can't imagine ditching my younger sibling during a family crisis. Plus the OP offered to make sure he gets to go on most of the trip.\n\nNTA",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1793,
      "content": "NTA and the people who constantly answer \"he's not your children's parents\" are exhausting and out touch with reality. He wasn't parenting, he was looking after them during an emergency! When something like that happens you are supposed to help your family. You are not an island, your interests and needs are not the only ones that count. OP and wife weren't on vacation, they had to drop everything to go spend time in a hospital where son's grandfather almost died. Needing to assist someone in such conditions trumps a stupid trip. Watching your brothers for that one time because your family is in a horrible situation trumps a trip. The level of selfishness in some comments is absurd.\n\nIf we need to reason like that, then OP and wife shouldn't pay for the trip given that son is an adult. They shouldn't drive him anywhere given that he's an adult. He shouldn't live with them given that he's an adult. Do you see how stupid all this sounds? \n\nIt was an emergency, he had to help. OP even offered to take him to the trip so that he wouldn't lose all of it but son refused. He could still go and spend 12 days with his friends, instead he chose to throw a fit and skip two whole weeks of vacation because he had to stay home for 2 days. Son can be upset, but he chose to be stupid about this. He should have accepted the lift.",
      "id": 121,
      "comments": [
        {
          "score": 636,
          "content": "Lol exactly. Asking an older child to watch younger child during an emergency is not parentification. People have truly lost their minds.",
          "id": 122,
          "comments": [
            {
              "score": 88,
              "content": "Almost insulting to folk who have had to deal with genuine parentification.",
              "id": 123,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Don't have kids if you can't take care of them!",
              "id": 124,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "but what if it wasn‘t the first time ? why didn‘t they took the kids with them ? or if it was during covid, why didnt one look after the kids while the other person was visiting them ?",
              "id": 125,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 460,
          "content": "People think the slightest inconvenience to a teenager is a mortal sin for some reason.",
          "id": 126,
          "comments": [
            {
              "score": 214,
              "content": "This sub has a lot of projecting. Yes there are families that abuse the generosity of their oldest child and turn them into a nanny with no life. There are families with abusive grandparents who maybe wouldn’t warrant sympathy from a grandchild.\n\nBut there are also normal family emergencies that happen at inconvenient times.",
              "id": 127,
              "comments": [
                {
                  "score": 44,
                  "content": "When in the real world: 18yr are legally punishable and in many countries can drink. \n\nWhen on reddit: 18 years old are SOOOO FRAGILEEEE uwu such hormonal experience makes them doing stupid stuff they are not liable poor cuties.",
                  "id": 128,
                  "comments": [
                    {
                      "score": 32,
                      "content": "There was a comment about how 18 year olds are still growing up and don't understand the concept of death and mortality. I don't understand thes people sometimes",
                      "id": 129,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "Oh definitely. It’s sad that there are families who abuse the generosity of their kid. As you mentioned though, normal families with unfortunate inconveniences do exist. Him missing the trip isn’t going to kill him, but the car crash could have killed his grandparents.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "I was absolutely the nanny as the oldest sibling and resentful about it, and it still looks like people are losing their minds as to what counts as parentification. It was an emergency!",
                  "id": 131,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Because as I have realized over the past... year or so..? Maybe a bit longer, this sub's mortality has shifted significantly. It's mainly teenagers at this point. So their viewpoint is that of the teenager in the story.\n\nThe one that always gets me the most was the story about a very poor family in a high COL area, and they had a younger teenaged son+daughter sharing a room in a 2bdrm apartment. The daughter said she wanted the brother to sleep in the living room because she was getting older and deserved her own room. Parents said no, share a room.\n\nIt was overwhelmingly YTA and with everyone saying the parents should actually sleep in the living room on a couch and give their bedroom to the daughter. It was usually justified because the children shouldn't suffer because the parents were negligent and couldn't stop having sex, get an abortion, be less poor, get a better job, get a bigger apartment, etc... It was just... You could tell the responses were not from folks that have ever had to pay their own way in life. I'm sad for the folks that come here and feel guilty when they shouldn't be due to this, or the other way around.",
                      "id": 132,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "It was a dark day when people on this sub learned the word \"parentification\"",
                  "id": 133,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Exactly & generally the ones who make their child a nanny don't have two babysitters or pay for their parentified child to go have fun with friends for two weeks.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "And then they are surprised when they meet entitled people who are unable to bend even for the slightest reason.",
              "id": 135,
              "comments": [
                {
                  "score": 14,
                  "content": "Exactly! They need to self reflect honestly. What happened to being there for family? :(",
                  "id": 136,
                  "comments": [
                    {
                      "score": 8,
                      "content": "[deleted]",
                      "id": 137,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "I feel like its teenagers throwing out Y/T/A vote. Throw a few buzzwords in like \"parentification\" and you sound like an adult.",
              "id": 138,
              "comments": [
                {
                  "score": 13,
                  "content": "The YTA votes do look like what teenagers would type lol. Hopefully when they’re older and mature they’ll understand the dad’s side. I feel like the word “parentification” is overused or misused for situations like this.",
                  "id": 139,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Reddit is full of teenagers who think being asked to contribute to their family in any way is child abuse. It’s honestly comical.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Right? I don’t particularly like kids and wouldn’t watch them for people on a regular basis. But if my aunt told me there was a family emergency and can I please watch my baby cousin, of COURSE I am going to say yes! Any person with decency would. \n\nThere is a difference between asking a kid to babysit on all the time vs an emergency!",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "I’m with you and I can’t believe I had to scroll down  this far to read this. I would argue that the son does have some family obligation to help in an emergency like this esp after the parents exhausted their options. In an emergency sometimes plan A, B, and C all fall through. And maybe the son babysitting is plan D. He’s an adult. It’s not like the trip was conditional when the parents planned it, this wasn’t a vacation for the parents, it was a life or death emergency. Family is there to help each other and while there’s limited details of their family we know some positive things like the parents care for the grandparents, the parents paid for their sons trip etc. \nDefinitely sucks for OPs son and his feelings shouldn’t be minimized. \nHowever, this is an important lesson in that sometimes in life disappointing things happen. He is entitled to be mad. But he has to learn to deal with disappointments and how to turn them into positive experiences too. OP should encourage the son to go on the trip now, 12 days is still a long time.",
          "id": 142,
          "comments": [
            {
              "score": 5,
              "content": "Exactly. 18yo being upset doesn't bother me, I threw similar fits for stupid reasons too. It's ok, he's disappointed, but he should jump at the offer OP made. Losing the whole trip would be a shame given that it is not necessary",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": ">\"he's not your children's parents\" are exhausting and out touch with reality\n\nwhat an odd way to phrase that particular point...",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1626,
      "content": "INFO: If your son had already left for the trip, what would you have done with your two kids?",
      "id": 145,
      "comments": [
        {
          "score": 528,
          "content": "Doesn't matter using this made up situation the emergency occurred before the kid left and he missed a whopping 2 days of the 14 and was given the option to join up for the road trip this is a one off emergency situation",
          "id": 146,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 415,
          "content": "If I were the kid, I'd drive right back in the middle of the trip to help family. My grandparents almost died. Wtf",
          "id": 147,
          "comments": [
            {
              "score": 32,
              "content": "100% this. This isn't just a NAH. This is a road trip the kid can still go on and is being a brat.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Right?! \nI LIKE my family. I would want to be there to see my grandparents, in case they fucking *died.* And failing that, I would want to be there for my mom and dad and/or my younger siblings who are doubtless upset and scared and alone themselves. They wouldn’t even have to ask.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "EXACTLY! The son must have zero concern for his grandparents and mother to act like this. In which case, either there is missing backstory or the young man is a first class asshole.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "The fact that they would have had to resort to an objectively shitty option with a decent likelihood of being traumatic for the kids and harder on the emotional parents does not mean they should choose that option when an alternative is available. \n\nWith no other option, I presume they would have brought the young kids along and then dad would have spent his time keeping track of them instead of helping his wife deal with her emotional stress and deal with his own emotions of \"this family member might be dead soon.\" And of course the stress the kids would then have in that situation. Or the kids wouldn't get the proper attention because everyone else has their own emotions.\n\nMy 10 year old daughter vividly remembers being in the waiting room when she was 6 and my dad died. We were going to visit him after a surgery and didn't know he was going to die, so she was there. She didn't see it, but the emotions of all of us in the waiting room are a stark memory for her, and meanwhile grandpa's in ICU, not dead yet, we're worried and trying to process, she's trying to figure out what's happening. Someone at the hospital gave her a stuffed unicorn. My mom's crying. I'm numb, in shock. My wife comes to get my daughter, and my wife is in tears. She's 6. She's seeing people who are her rock act in ways that are strange. She knows grandpa's not doing good, but doesn't know what that means. \n\nOP had no idea if grandpa was going to make it or not. Dad was in critical condition. What I just described, my own experience, was perfectly possible at the time. If you can protect your kids and allow yourself as a spouse to be there in one of the worst times for your partner, you do it. \n\nOr you prioritize a teenager not missing 1/7 of his road trip.",
          "id": 151,
          "comments": [
            {
              "score": 4,
              "content": "This tradeoff is the part the y.t.a. posts seem to not take into account. How is it better to bring two young children to the hospital to avoid the third much older kid missing two days of a long trip? That's more of an AH parenting move.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "What would they have done if a whale had eaten the grandparent?",
          "id": 153,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1427,
      "content": "Nta its shitty yes, but there are 12 days left?????  Can he not fly to where they are and go from there.",
      "id": 154,
      "comments": [
        {
          "score": 668,
          "content": "apparently OP has offered his son to fly him to wherever his friends are but the son is upset",
          "id": 155,
          "comments": [
            {
              "score": 858,
              "content": "The son is honestly being kinda stupid.  Does it suck he missed 2/3 days?  Yes, but he can literally do the rest of the trip!",
              "id": 156,
              "comments": [
                {
                  "score": 175,
                  "content": "I wondered that too. Yeah he missed the beginning, but he can still join up with his friends for most of it.",
                  "id": 157,
                  "comments": [
                    {
                      "score": 28,
                      "content": "There may be something about the first two days of the trip that the dad doesn't know, some exciting forbidden thing they were doing or something that he missed out on.",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "It's possible that his spot on the trip was replaced by someone else and joining up now would he a hassle for the entire group assuming they were all in one car.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 139,
                  "content": "I mean if his granddad had died would he be refusing to go to the funeral because of the trip?  That's messed up.",
                  "id": 160,
                  "comments": [
                    {
                      "score": 103,
                      "content": "Depends on their relationship.  I had a trip planned when my grandma died.  I went on the trip.  I didn't have a relationship with her.",
                      "id": 161,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "The son is upset he missed out on that adrenaline rush of the first day of the road trip, but he’ll regret not going by day 5 or 6.  He’s 18, he’ll learn to handle his emotions someday.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Which is why I have to go with NTA over N.A.H. Kid was definitely a *major* asshole to his mother who was afraid of losing both her parents at once, and showed little concern for those same people, his own grandparents. All the while, his own trip could have gone largely the same after those first two days. All the Y.T.A. answers are dumb as fuck.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "its probably part of being felt left out, like just being there he would feel how the dynamic changed once he joined up, all he has in his mind right now is how much he is gonna miss his youth, so I reckon he's not at a place to think rationally much less maturely",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It sounds like he didn't want to go because that would have meant telling his parents he lied about the intended destination.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Someone else pointed out that maybe the road trip is not going where OP thinks it is, and the son is pissed off because he has the choice of either missing the entire trip or his parents finding out that he lied to them about the destination / people / shenanigans involved.",
          "id": 166,
          "comments": [
            {
              "score": 8,
              "content": "Idk when you wrote this with regards to the post but as I'm reading it now, it looks like the son was planning on going down to mexico with his friends instead of just around the states and most certainly didn't tell his parents about it until they found out after",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Ahhhhhhh, i wonder!!",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "And let's not forget this was all paid for by his parents. They paid for this trip, they paid for his babysitting, they are willing to pay for a plane trip to meet up with his friends 2 days in. The kid has some growing up to do. If he actually worked and saved up his own money for all this, maybe he wouldn't be so quick to just trash everything that was handed to him to illustrate how pissed off he is about his being inconvenienced by his grandparents nearly dying.",
          "id": 169,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 883,
      "content": "WTF is up with all the YTA votes? It sounds like they did the best they could with a horrible situation. They looked for other sitters even including neighbors but no one was available. Taking the 2 kids with them would have made a horribly stressful situation even worse especially since the where at the hospital for around 48 hours. Mom was in no shape to help look after them considering she is probably thinking her dad might be dying. The 18 year old was the last option and was payed for it as well as them saying they will try to make it up to him. \n\nNAH - They did there best and the 18 year old is a loud to be upset but this was an emergency situation.",
      "id": 170,
      "comments": [
        {
          "score": 296,
          "content": "Reddit generally is against stopping anyone from having fun, whatever the situation, and for some reason hates the idea of duty towards one's family.",
          "id": 171,
          "comments": [
            {
              "score": 32,
              "content": "No. That's not it. They're generally against parents.",
              "id": 172,
              "comments": [
                {
                  "score": 39,
                  "content": "And against babies. \n\nBut not teens. They're very understanding of their peers.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "Because a lot of teenagers also lurk here who don't yet understand *nuance*. I immediately felt Dad was the AH until I read his post.\n\nA family emergency is a family emergency. It is pure selfishness on behalf of the young adult to put his fun over his family. Over his ***mother***.",
              "id": 174,
              "comments": [
                {
                  "score": 8,
                  "content": "And in his last update, OP says the truth came out…son and friends lied about where they were going. Some other people replying called it.",
                  "id": 175,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Ha! I KNEW they were off having forbidden fun. His over the top reaction is exactly the sort I used to have when something prevented MY forbidden fun.\n\n&#x200B;\n\nWhat I don't get is why they didn't just tell their parents they wanted to go to Cancun or wherever.",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 150,
          "content": "Reddit is full of people who don’t leave the house. There’s your answer.\n\nEdit: whoever sent me a redditcares message— thanks for proving my point, homebody. 💀",
          "id": 177,
          "comments": [
            {
              "score": 50,
              "content": "[deleted]",
              "id": 178,
              "comments": [
                {
                  "score": 27,
                  "content": "That’s hilarious and fucking depressing at the same time.",
                  "id": 179,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "I once had someone tell me that being grounded from electronics in response to failing multiple classes was actual child abuse. There are plenty here who think that children and adolescents experiencing slight discomfort is a reason to cut everyone out of their lives.",
                  "id": 180,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Also setting that bullshit aside the little asshole just graduated high-school. \n\nHope he doesn't think pouting for two weeks is the way you solve unexpected adversity, gonna be a rude fucking awakening.",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "There was a video of somebody fishing the other day and I swear to God there was a highly upvoted comment that said \"the only reason to go sit in a boat or sit in the woods is because you hate your family\"\n\nThat and everytime there's a video of somebody doing adventure sports the consensus is that it's dangerous and irresponsible because you could get hurt and you don't get anything out of it. \n\nIn short, and I know this term has been abused to the point of being meaningless, but reddit really needs to touch grass.",
                  "id": 182,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 11,
          "content": ">WTF is up with all the YTA votes?\n\nIt's kids, and people with the emotional maturity of kids.",
          "id": 183,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "For the record, the bot will interpret this as a Y TA vote unless you space out Y TA like I just did.",
          "id": 184,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "It's going to count your y.. t..a. And not your n.. a.. h. It's weird the way they do it.",
          "id": 185,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 648,
      "content": "What's there a reason you didn't take the younger kids with you? They're at ages where you don't have to keep your eye on them every single second, it shouldn't have been that much of a bother.",
      "id": 186,
      "comments": [
        {
          "score": 2371,
          "content": "It would have been an awful opinion for everyone especially since I was running around through most of it and wasn’t in the room for a good bit. Mom was having breakdowns and was not even fit to look after herself and grandpa and grandma were bad also. Grandpa was basically mangled\n \nMaybe the middle child could have handled it but definitely not our youngest, we didn’t leave that whole time, so basically 48 hours at a hospital",
          "id": 187,
          "comments": [
            {
              "score": 1039,
              "content": "That's a fair reason, NTA",
              "id": 188,
              "comments": [
                {
                  "score": 717,
                  "content": "I know that OP’s oldest was really looking forward to this trip but honestly. Unless OP is leaving out information, I don’t know what their oldest expected them to do. Seems pretty selfish to throw such a fit when their grandparents are in critical condition, and their siblings would be traumatized seeing them that way",
                  "id": 189,
                  "comments": [
                    {
                      "score": 431,
                      "content": "I think the kid is clearly TA because of how he's treating his friends, and I don't think it bodes well for the next few years of his life.  Can you imagine blowing off your friends for 12/14 days of the last great time you'll all get to hang out, because you'd rather sulk at your parents?  \n\n\nEDIT--- Orr... the road trip isn't actually one state away, and he doesn't want to be the one to let the parents in on what his buddies are actually doing.",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Especially since the parents looked for every other option besides their son until he was literally the only option",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Have you ever been inside an ICU?",
                  "id": 192,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 293,
              "content": "These were extenuating circumstances and you have the benefit of having an older child who is able to step in and help. People keep saying \"what if you only had younger kids\". Well, you don't. You have an 18 year old son who was just taught that family comes first, and sometimes family obligations are going to supersede previously scheduled fun plans. You are giving it so much thought so clearly this isn't something you do often, and you tried to not have to turn to him. This kid is not a third parent. This one time he was asked to step up at a really inconvenient time. For many years you will tell the story of how he was a man and stepped up and did his part for the family during a really horrific time. He'll not want to be 30 thinking about how he made his mom deal with his 2 younger siblings while her parents were possibly dying so he could have fun. He will hate you now, but he will be a better person, and that is your job. \n\n&#x200B;\n\nNTA.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "You made the best decision you could based on the timeframe you had to make the decision, information you had and resources available. Lots of people are saying you would have brought the younger kids with, but bringing the kids into an unknown situation when your wife didn't have the capacity to be a co-parent for multiple reasons is a terrible idea.\n\nKids are your priority, but in an emergency situation, that doesn't mean they never have to make personal sacrifices. Your son is becoming an adult and he needs to understand that sometimes you have to step-up for others in these types of situations.\n\nHe  easily could have joined his friends, but instead decided to punish you by punishing himself.",
              "id": 194,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "You're getting a lot of push back but remember that most of this sub is approximately 16 and has never actually experienced a hospital, an in-law relationship, or a difficult decision. It's entirely reasonable to expect your child to be a member of your family while you are experiencing a crisis. That's how family works.",
              "id": 195,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 572,
      "content": "NTA.. y’all people have no sense of family.. y’all are selfish people..",
      "id": 196,
      "comments": [
        {
          "score": 81,
          "content": "Truly",
          "id": 197,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 46,
          "content": "Yeah reading through the replies literally made my jaw drop god damn",
          "id": 198,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}