{
  "post content": "\n\nI used to have a german shepard named \"Willy\", but had to put him up for adoption because my future stepson is allergic to dogs so Willy had to be out of the house before my fiancee and her son moved in with me.\n\nNgl, I did feel like I'd given up on Willy, I've had him since he was small but I did thorough digging to find him the perfect home and the perfect family. I'd met up with the family and they embraced him right away, they seemed nice and all and agreed to keep in contact so I could learn about how willy's doing.\n\nThis took place in december, I got busy with the holidays then loads and loads of work and was only able to call the family to check on Willy last week. Anyways so while I was with them on the phone I heard a small girl yelling \"Rudy\" repeatedly, I asked who Rudy was and they casually said it was Willy but they gave him a new name. I was absolutely shocked I asked if they were being serious with me and they asked what's wrong. I absolutely lost it on them telling them that that dog already has a name that was given to him by his owner and they should respect that. Pluse all his legal papers are under the name Willy but I was surprised when they said they took care of that legally...like how... I told them they had no permission from to rename the dog point blank period. but they argued that willy is theirs now and I have no say, I told them they were dead wrong and demanded that they have some respect and stop confusing him and start calling him with his real name. They refused and we got into a huge fight on the phone and social media where they threatened to block me. I was so mad I took the argument to their place where they threatened to report me for \"harrasement\". I decided to take few days to let things settle down then I'd visit them again but my fiancee thinks I'm overstepping and should let the family decide this stuff without harrassing them which was an expected thing to hear from her since my stepson is the reason I had to let of my dog in the first place. She got offended but I told her that siding with strangers mistreating my dog did not paint her in good light though I started thinking she might be right.\n\nSo AITA?",
  "id": 1,
  "comments": [
    {
      "score": 49092,
      "content": "YTA. Rudy is their dog now. \n\nYou gave up any rights and control over *their* dog when you gave him up. \n\nYou may have just jeopardised any chance of having future contact with them regarding him, and I wouldn't blame them.",
      "id": 2,
      "comments": [
        {
          "score": 16025,
          "content": "This. YTA. You gave up your dog so you could move new people in. You ignored the dog you gave up for a month. Then you showed up at their house and harassed them online about THEIR dog’s name. You gave up any claim you had to that dog when you turned him over to his new family. Leave them alone, he’s not your dog anymore and that’s completely on you.",
          "id": 3,
          "comments": [
            {
              "score": 10217,
              "content": "Huge red flags for his fiancée too. What other nonsensical issues will he claim as his hill to die on. Dude is stalking the perfect family he found for his dog, talking about respect like the dog gives a shit.",
              "id": 4,
              "comments": [
                {
                  "score": 3008,
                  "content": "We called my dog \"the baby\" or \"baby boy\" for a while and he would come to his name or Baby lol. Heck just open a bag of snacks and I'm sure the dog will come no matter his name. \n\nI understand being upset that the dog that was your family got renamed, but this is ridiculously too far.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4358,
                      "content": "My dog will respond to Dingus.\n\nThat's not his name.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 444,
                      "content": "My dog’s “legal” name is Mocha. He answers to Mocha Bean, Beannie, Beannie-boy, Butthead, Moke-Moke, who’s a good boy, and what’s that in your mouth. As long as he thinks you are talking to him, he lopes over to get pets or the attention. \n\nAs most dogs will.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "All my cats end up with nicknames they respond to and when I call my wifes name they come running. 🤷‍♀️",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "All of my dogs have multiple nicknames. None of them have the original name they had when we adopted them. Dogs are smart, they figure it out. \n\nOne we called Baby a lot and now that we just had a baby, he’s very confused. But he’ll figure that out too.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "One of my dogs believes the word \"insecure\" is one of her names.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Yeah I felt so bad for the fiancée and her son when I got to the bit at the end:\n\n>my fiancee thinks I'm overstepping and should let the family decide this stuff without harrassing them which was an expected thing to hear from her since my stepson is the reason I had to let of my dog in the first place. She got offended but I told her that siding with strangers mistreating my dog did not paint her in good light\n\nHow is your fiancée asking you not to harass the dog's new owner over a name remotely related to her son being the reason you felt obligated to give the dog up? Isn't it more likely she just thinks you shouldn't harass people in general, nothing to do with her son or the dog? Similarly, how could you possibly spin these people renaming *their* newly adopted dog (read: not your dog) as mistreatment? And then you try to position that as a strike against your fiancées character, as if she supports the mistreatment of dogs, just because she's telling you to back off the name issue? \n\nTo a reasonable person, this all sounds like your fiancée is encouraging you to think logically at a time when you are letting your emotions get the better of you. You chose to give up your dog in the interest of your relationship with your fiancee and her son. That dog that was once yours now belongs to someone else, and his new life (including what they choose to call him) is none of your business. (Frankly, you were lucky they were kind enough to keep in touch and provide post-adoption updates at all; now you're just lucky they haven't taken out a restraining order.)\n\nMy point is, you've only managed to imagine the connections you've made here because of your own misdirected bitterness at the situation. Your fiancée is exactly right, and it's sad that you're so determined to make her the enemy in all this.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "YTA. \nThe dog will respond to whatever name his new family gives him. You have no say in this after giving him up. You said so yourself that they're the perfect family, so why are you so pressed now over a name change? The dog isn't being mistreated wtf.\n\nALSO huge AH move for blowing up on your fiancee and having the audacity to say it's basically her and her son's fault that you had to give your dog up. \n\nYou gave up your dog, end of story. Keep up that attitude and your own fiancee and stepson might give up on you.",
                  "id": 12,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 214,
              "content": "Well said, 👆🏼\nYTA major one! Just focus on your stepson and stop harassing them.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Poor dog. He thought you were his human. Guess you weren't ready for the responsibility of owning a dog. All Willy knows is that you don't want him. Let him be happy if you can't provide a home for him.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I'm not sure this dude should have a dog. Or a fiance. He thinks literal harassment is no big deal and that his reaction wasn't that bad. If this is him in public, who knows what he's like behind closed doors. He needs serious help asap. I hope they block him and press charges if he ever tries to contact them again and I hope his fiance leaves",
              "id": 15,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "100% this.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Right? The only good thing he did was being mindful for his stepsons allergies.\n\nPart me wants to joke about \"guess his fiance can't change her last name to his, she'll get confused and she already has a name\"",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It gives Hella \"toxic baby daddy\" vibes lol",
              "id": 18,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2325,
          "content": "He went to their friggin house!!!!!!!!!!! I would honestly get police involved and refuse any further contact with OP immediately at that point. OP, get this through your head: You. Do NOT. Have. A. Dog. You used to. Now you don’t. YTA.",
          "id": 19,
          "comments": [
            {
              "score": 715,
              "content": "I 100% would have called the police as soon as this lunatic showed up at my house yelling about what I named my dog. Also he says he plans to visit them again. He sounds unstable and I seriously hope Rudy's new family is seeking a restraining order. \n\nNewsflash to OP- adoptive parents can and do rename their children as well. Their bio parents, like him when he surrendered the dog, surrendered their rights when they gave the child up for adoption. The dog's new owners have all rights to him, including naming rights.",
              "id": 20,
              "comments": [
                {
                  "score": 13,
                  "content": "Seriously, OP is gonna go to jail over this. Over a DOG.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 124,
              "content": "Yeah, he's got \"TRO\" stamped all over those red flags that are waving.\n\nYTA.",
              "id": 22,
              "comments": [
                {
                  "score": 17,
                  "content": "Sorry what is TRO?",
                  "id": 23,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Temporary restraining order.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "A Traffic Regulation Order?\n\nI don't think the dog can drive. I know he was going on about legal documents with the name on, but I don't think a driving licence was one of them.",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "This so much. I'd have already said YTA already, but you crossed into legally dubious area when you went to their house. There's nothing else I can say that hasn't already been said, but you gave up all rights when you abandoned your dog.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "They should get a no contact, restraining order.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1977,
          "content": "“They took care of that legally… like *how*?”\n\nEasy, they called the vet and had the name changed. It’s not an amendment to the constitution, it’s a dog’s name. And it’s *their* dog now. You better apologize profusely OP, or you’re never going to see Rudy again.",
          "id": 28,
          "comments": [
            {
              "score": 512,
              "content": "It's absolutely that easy! ITA. You call the vet and you call the microchip provider and that's the dog's \"legal\" name. OP YTA. Stop taking out your feelings of failing Rudy on the people who can care for him. Re-homing a pet is sometimes the best choice for all and that's crystal clear in this case.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 495,
              "content": "Right? I’m screaming. When I adopted one dog, the shelter had named her “Darla”. Hard no. My recent adoptee was “Sasha”, and became “Rita”. Another had been “Buddy” and became “Rupert”. Most dogs get named in a shelter or by a rescue and never actually “know” their name. Some people rename dogs/cats, and some don’t. If I adopted an old dog who knew it’s name, I definitely wouldn’t change it, but nobody would get upset if I did. Often, if the animal seems to know their name, people will use something similar. But also, most people don’t actually call their animals their exact name. I only ever say “Rupert” to the vet. Otherwise, he is “Gooby”, “The Sploob”, “Sploobus” “The Notorious G-OO-B”, or “My Potato Son”. Obviously.\n\nEdited to add some Sploobus imagery [here](https://imgur.com/a/31NcxzO).",
              "id": 30,
              "comments": [
                {
                  "score": 169,
                  "content": "I hear this! I have a ‘Ruby’ who’s also ‘Rubert’, ‘Dubert’, ‘Dubertson’, ‘Doobs’, ‘Goobert’, and various combinations of the preceding- and those are just the ones based (however loosely) on her actual name. ‘Ruby’ all by itself tends to only come out when she’s being naughty or we’re introducing her to someone. \n\nWe also have a cat named ‘Pharaoh’, but we say that’s his government name because we NEVER call him that at home.  He’s ‘P’, ‘P-Ro’, ‘the Darkness’, or ‘Spice Mix’.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Haha the darkness I feel like I know your cat just through this name.  I both respect and fear them, as I am certain they would be satisfied with",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Our dogs name is Beauregard.\nHe is called Beau. Or Bo-Bo. Or Barky McBarkerson. Barkey McBarksalot. Sir. EXCUSE ME Sir, and OMG calm down.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "My daughter is Ruby and I call her Ruby-dooby-doo all the time 😆",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "My had  a dog named Snoopy. We called her Half A Dog because she seriously looked like a black lab cut off at the knees. 😀",
                  "id": 35,
                  "comments": [
                    {
                      "score": 6,
                      "content": "See, *this* is the quality content I come to Reddit for. 10/10",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I couldn’t even imagine.  I adopted a cat from a family and changed his name from Koju to Harvey. Kept in touch with the family and without any issues they would ask about Harvey.  \n\nIt never occurred to me that they would expect his name to stay the same when I got him.",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "My cat was named 'Bolleke' (which means 'little ball') because he's pretty fat, and I renamed him Kevin. He also responds to Blobman but I only call him that when he looks like he's melting into his cat bed again. The family who fostered him for a few months thought Kevin was a pretty weird name but they didn't really care, he's my cat now.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I love when pets have human names. I’d love to adopt a pet and name her “Susan” or “Barbara”.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I volunteer for a shelter, one of the fosters I work with lets her 4-H students name the kittens she takes in. One litter had superhero names, another was all named after Italian pastas. Shelter names are absolutely not meant to be permanent, lol.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 12,
                      "content": "We had a client at one vet hospital I worked at who made the mistake of letting his daughter name the new puppy. Enter “Princess”, full name “Princess Jasmine Ariel Cinderella Belle Sparkle Flower”. If you think for one second that I didn’t put both the full name and the shorter name on that animal’s record, you’re mistaken. Put more ink in the printer, because this is gonna be on every printed receipt and document, I swear it.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yeah, I adopted two slutty cats who were named “Byron” and “Tolstoy”. Like, yeah, these fat assholes are not classical poets, but cute theme.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "The shelter named my first dog, “Arugula.” I wasn’t keeping that name lol. OP, you’re the asshole. You’re angry at this family, but really, you’re angry at yourself for giving this dog up.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I understand not keeping the name “Arugula”, but also, I’m laughing really hard at that name. Really hard. One of the joys of naming shelter dogs is naming them things that stand out and/or are funny to the people who name them. You don’t have to keep calling the dog “Beefaroni” forever, but that dog will get a second look on a website or something with that name.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Okay, this is kind of cute. When my fiance and I adopted our cat as a kitten, it was his first time adopting a pet from a shelter, and he was convinced we had to keep her shelter name. I just let it happen so now she still has Cameron as her name on paper, but her real name is Chamie short for Chameleon because she blends into the floor and shadows.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yep to everything you said. I adopted a half-grown pup, a big boy who was incredibly sweet and gentle. I was so happy he didn't know his \"official\" name was Gunner and immediately changed it to something that suited his cuddlebug nature.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Years ago, I adopted a dog that the shelter had named \"Fatty\". You better believe I renamed him as soon as I got him home",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Exactly! My wife kept the shelter name for one of her cats because he seemed to like and respond to it. All the rest of our cats we renamed. Toyota became Wiress, Popcorn became Illyria, etc.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 171,
              "content": "That sentence also made me laugh. Wait until he finds out about microchips.",
              "id": 49,
              "comments": [
                {
                  "score": 74,
                  "content": "I hope the family changes the microchip info with the company. It needs to be updated if not.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 130,
              "content": "In my opinion, it's too late. If I had someone showing up at my house, screaming at me over what I named my dog? No contact ever again.",
              "id": 51,
              "comments": [
                {
                  "score": 7,
                  "content": "Same.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "If the dog is registered those are the legal documents then you just have to change microchip if he is and the vet just uses whatever name you give them so I’m assuming they had it all completed and they would need prev owners permission to get the microchip out of his name and it doesn’t specify if he had one if not. Let’s hope so I could see him trying to snatch the dog seems really irrationally to me out of the blue like this.",
              "id": 53,
              "comments": [
                {
                  "score": 19,
                  "content": "Yup, I worked the front desk at a vet hospital and frequently people would be like \"hey, we changed his name to Bob.\" And we're like cool, and type it in. It's not rocket science.",
                  "id": 54,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Wonder how he would react if he sold his car and the new owner modified it. “But *how* were they able to lift it and put on a new exhaust? It’s still MY CAR!”",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "In my county, you have to get a dog license if you own one. When you sign up, you can just tell them whatever name you like, and they'll put it down. They don't cross-check it with old vet records, as far as I'm aware.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yeah this isn't difficult at all. When we adopted a dog and changed his name, I registered him at our vet under the name we gave him, gave them his paperwork I had from the vet in Arkansas and the vet he saw in foster care under his old name and said \"this is his name now.\" No one was confused. People change rescue dogs' names all the time.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I love how he used the word \"legally\" like the family couldn't just call him whatever they want regardless of any vet papers, but yes easy enough to change that too.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Even with an apology, I wouldn’t let him have anything to do with the dog. He would be blocked on social media, my cell. And because he sounds like the type to try to take back the dog, I would have cameras outside. Plus the dog chipped (but that should be done anyway)",
              "id": 59,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 749,
          "content": "And from the sound of it, OP is absolutely harassing the new family. Let them be and move on.",
          "id": 60,
          "comments": [
            {
              "score": 569,
              "content": "Plus he had the audacity to put quote marks around the word harassment as if that wasn’t exactly what he was doing.",
              "id": 61,
              "comments": [
                {
                  "score": 251,
                  "content": "Exactly. He argues with them over social media AND the phone. Then he shows up at their place to argue with them in person. Now he’s planning to show up again until they cave to his demand. If that’s not harassment, what is it? Lol",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 307,
              "content": "What astounded me was that, not content with being given a short shrift on the phone, OP actually decided it would be a good idea to go to their freaking *house* to continue the row. \n\nJust...the absolute sheer neck of it. \n\nAnd they *still* think they're in the right. \n\nIncredible. As is the fact they aren't typing this from a police station.",
              "id": 63,
              "comments": [
                {
                  "score": 90,
                  "content": "Honestly, a call to the police would have been my first course of action if this guy showed up at my house.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Same. He sounds unhinged.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "When (not if) he's dumped he'll be round there trying to take it back",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I just can’t imagine wtf this guy thought he was accomplishing with this? Like if he showed up at their house to “show them how mad he was” they’d cave in and change his name back (or at least tell him they would) instead of calling the police to get this crazy dude off their lawn?",
                  "id": 67,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I feel so bad for this family but also for the stepson as you just *know* OP holds a huge resentment towards him for having the temerity to have an allergy to Rudy.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 494,
          "content": "YTA. You gave up the dog to his owners. They get to decide his name. You have majorly overstepped your place and I’m surprised they didn’t call the cops when you showed up at their house. \n\nBtw, I adopted my bosses dog. I changed her name as soon as she got home with me. And I still worked for that boss for another 2 years.\n\nEdit: spelling",
          "id": 69,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 484,
          "content": "Exactly this but I also feel bad for the finance cause it sounds like he’s already pulling the “ I gave my dog up for you!”card. I wonder how long that guilt trip will last. Every time she doesn’t do what he wants… I gave up Willy for you!…",
          "id": 70,
          "comments": [
            {
              "score": 248,
              "content": "*Rudy :)",
              "id": 71,
              "comments": [
                {
                  "score": 208,
                  "content": "It's very satisfying to me that nearly everyone who has commented on this thread has referred to Rudy by his current name.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Rudy deserves that respect",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Nice.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I think that was meant to be what OP would say...",
                  "id": 75,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "And will he treat the future stepson like shit? Since he has the allergies. \n\nI’m guessing yes.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "He could rename the new Step Son “Willy” if that makes him feel better !!",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I dare her to say \"Who's Willy? Oh, you mean RUDY.\" \n\nIronic how OP doesn't mind putting his dog through the upheaval of a strange new environment and unfamiliar family, but he draws the line at a different name, the one change the dog hasn't noticed over the last month.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 256,
          "content": "Rudy is a far better name than willy anyway. I'd also have renamed him",
          "id": 79,
          "comments": [
            {
              "score": 102,
              "content": "Lol willy has another meaning here in the USA. I would change it too",
              "id": 80,
              "comments": [
                {
                  "score": 28,
                  "content": "UK too. Also famously the name of an old lady's pug in one of two top soaps, who called him \"my little willy\" 🤣",
                  "id": 81,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 168,
          "content": "If it was me there’d be no “may have”, forget the screaming at them on the phone about the name (which might be enough by itself), he showed up at their house. This person from all appearances is extremely unstable and I wouldn’t want them anywhere near me or my family.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 134,
          "content": "Oh yeah, he won’t ever be seeing that dog again. Like the dog cares what it’s called, mistreated my arse.",
          "id": 83,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 90,
          "content": "Agreed. You gave up your rights to the dog when you gave him to the new family. I foster for a rescue and dogs are renamed often, they learn quickly and adapt well.",
          "id": 84,
          "comments": [
            {
              "score": 11,
              "content": "Exactly!  I adopted a dog from a rescue that didn't work out for his \"first\" owner. (a dog that sheds.... Imagine that....)\n\nHe had one name at the rescue, was renamed, and then I renamed him. 3 different names in a matter of weeks.  \n\nHe's adapted perfectly. He knows his name. Every now and then I'll call one of his old names, and it doesn't even phase him. He's my good boy and that's all that really matters.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14545,
      "content": "YTA. They don't need \"permission\" from you about anything to do with the dog that is THEIR dog now. And then you flipping out and getting aggressive with them? And accusing your fiancee of taking sides with strangers? I don't know how you typed all that without realizing how irrational it sounds.\n\nAnd renaming a dog is not \"mistreating\" the dog, get a grip.",
      "id": 86,
      "comments": [
        {
          "score": 3111,
          "content": "[deleted]",
          "id": 87,
          "comments": [
            {
              "score": 1694,
              "content": "My dog is like a toddler in that they only hear their actual name when we NEED her attention. It got to the point where I had to change her name at her daycamp since she goes because “Apollion Queen of Destruction” is a bit of a mouthful. Most of the time it’s Polly, Polly Pocket, Miss Pocket (if ya nasty), Bubby, Bubs, and when she is being a particular terror “Bubby Yaga”. Nicknames are a part of affection some times and a dog can damn well know if they WANT to answer to a name they will.\n\nEdit: Thanks for the upvotes and silver. I will add pet tax of Miss Pocket shortly.\n[Pet Tax](https://www.reddit.com/r/aww/comments/s5g8u3/apollion_queen_of_destruction_pet_tax/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
              "id": 88,
              "comments": [
                {
                  "score": 643,
                  "content": "Ngl Apollion Queen of Destruction is the absolute best dog name I've heard in my entire life and I really hope it's used in full in serious situations in public",
                  "id": 89,
                  "comments": [
                    {
                      "score": 417,
                      "content": "*at the vet*\n\nOwner: “I’m here to pick up my dog”\n\nVet: “name?”\n\nOwner: “Apollion Queen of Destruction”\n\nOther pet owner: “damn, I knew I should’ve given Fido a more original name”",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 112,
                      "content": "Haha thanks my boyfriend is endlessly creative and it started as an ironic joke nickname because she was so tiny and the shyest one of the litter. She was just starting the con.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "This name is great, but I'm also fond of Princess Monster Truck.\n\nhttps://imgur.com/a/Zyd6XC3",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I agree, and I had a sweet girl named Princess LadyBelle von BaconFace",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 155,
                  "content": "I'm a dog trainer and all of my training dogs get nicknames. I.e. Rolo is Rolito. Bailey is Bay Bay. And Charlie is Ubuhlubicus (no idea where that one came from).",
                  "id": 94,
                  "comments": [
                    {
                      "score": 92,
                      "content": "Bubby Yaga started on accident when she decided eating the wall was a thing she should do while her daddy and I were trying to watch the Witcher.",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 134,
                  "content": "My hound is called lettuce. So of course he also gets called Cabbage, snaggletooth, longdog, derphound, dumbo, stinky and blep",
                  "id": 96,
                  "comments": [
                    {
                      "score": 71,
                      "content": "I have a pup named Collette, who goes by Letty and occasionally Side Salad (because, lettuce). Dogs figure it out.",
                      "id": 97,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Omg lettuce… cabbage… I’m dying over here. Best names ever.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 78,
                  "content": "Bubby yaga lmaooooo that’s fantastic.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Upvote for Miss Pocket.  Lol",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I also enjoy giving pets ridiculously long names and then calling them a shorter version.  I keep all of their records in the paper packet the adoption center gave us and I'll look at them and think \"Who the heck is Princess?\"",
                  "id": 101,
                  "comments": [
                    {
                      "score": 6,
                      "content": "It’s a thing in my family and when he suggested a name like that it made my little heart do flips. My family pets were Ty (James Tiberius) Bella (Bellatrix Lilly) Coco (coco Chanel) and princess (Princess Leia). It just feels like another way to truly make them part of the family.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 233,
              "content": "A cat was kindly allowing me to use the house. \n\nI very seldomly used his baptism name to address His Highness...",
              "id": 103,
              "comments": [
                {
                  "score": 56,
                  "content": "Yeah. My Wanjinyou is more likely to be Sweet Boy, or Buddy, or Goddammit Why Are You Such A Dick?! and Mira Purrlan is Sweet Girl, or Mira-Mira-Mira, or Miramar, or Little Bird, or Little Ghost, or Little Gargoyle.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 10,
                      "content": "When I called his many names and titles, he always responded and always came to bless me with his presence.  \n\n\\- Sometimes 24 hrs after ...",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Oh my god I have a cat called why are you such a dick 🤣🤣🤣",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "My cat Greebo answers to that, but she also answers to things like General Greebus, Beebs, Beebus, Beebadabeeb, Beebas Los Beebus and other nonsense! 😹",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "The difference between the dog and cat comments on this one is cracking me up. \n\n“I call my dog all things, up to and including- what in the hell is in your mouth.”\n\n“I have the utmost fear and respect for my feline overlord and hope to appease them today without bloodshed.”\n\nIt’s awesome. And my dog Riley has selective hearing- and sometimes calling her Dog is the only way I can get her to pay attention to me when I’m not feeding her.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 209,
              "content": "Every pet I've ever owned has a series of evolving nicknames. They don't get \"confused.\" They don't care. They know there is a sound I make when I want them to come to me, and they respond to the tone of voice, not the syllables being uttered. When one of my dogs went deaf, his name became STOMP STOMP because he could feel the vibrations when we stomped on the floor\n\nDogs (and cats to some extent) can learn the names of things, but being non-language orientated creatures it's unlikely they think using those words. They just know it's a sound you make when you want them to do something and they've memorized the sound. You could use a flute instead of words.\n\n This person is acting like this non-verbal creature accepted \"Willy\" as its personal identity and cares about its name being respected.",
              "id": 109,
              "comments": [
                {
                  "score": 19,
                  "content": ">You could use a flute instead of words.\n\nThis brings to mind in *The Sound of Music* when Maria first shows up at the Von Trapp’s house and the Captain teaches her the different whistle signals for his kids. Her response is “they’re not animals!”",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 84,
              "content": "Don't lie, you rename your dog anytime someone figures out your password. Easier to rename the dog than change the password.",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "Right! My hubby's dogs always have three names, their legal name, their working name and their \"pet\" name. Working name let's her know it's time to be \"on\" pet name let's her know she can be a goof.",
              "id": 112,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Our cat is called Shadow but I often call him pud or pudding or numpty if he’s trying to eat out of the bin or greedy little bugger when he meows for food minutes after eating.",
              "id": 113,
              "comments": [
                {
                  "score": 6,
                  "content": "My dog is Alfie but he’s Alfie-pants (no idea why, that one came from the dog walker), Alfington (when he’s looking regal) Alfred (in formal settings) and just plain ‘puppy’ most of the time, even though he’s nearly 10. They know when you’re talking to (or about) them, even if they choose to ignore you…!",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "My kids have plenty of names for our cats. I will let them now know that this is abuse and it must be stopped.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I honestly hardly call my dog by his actual name. My dog's name is Seamus but I call him shay-moose, moose, the dude, shame-ers, goober, goobs, etc. Lol\nIn no way is he mistreated.",
              "id": 116,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Seriously. Got our ten pound terrorist from a rescue that found her on the side of the highway out in the country. God knows if she had an owner beforehand and what she might have been called, but the rescue named her Pocahontas. It was a terrible name for the kind of dog she is, so we shortened it to Pokie, which suits her a lot better. She has the nicknames Poke-a-dot, Bork-a-dot, Pokiemon, Teaspoon, and others, all of which she answers to. OP is an idiot if he thinks that constitutes mistreating a dog lol",
              "id": 117,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 443,
          "content": "YTA- LMAO good lord!!! Rudy is not your dog anymore, you have no say over him anymore. You lost any input into his life the moment YOU GAVE HIM UP! If anything you mistreated him by providing him a comfortable & stable home and then dumping him on strangers out of the blue—imagine the stress he went through losing his mate and routine without warning and having no idea what was going on. \n\nAlso, they chose a name thats sounds vaguely similar to Willy so he probably wasnt confused by the name change at all. When i rescued my dog her name was Kelly—-i have a family member named Kelly, and i personally dislike human names for pets and like more fun names—so i renamed her Kiwi. She had no issues adjusting to her new name.",
          "id": 118,
          "comments": [
            {
              "score": 80,
              "content": "As a Kelli (i not y) I appreciate the gesture. I adore dogs, but I don’t want you to picture a shi tzhu when we are introduced. \n\nIncidentally, OP is an ass for giving away the dog in the first place. The dog was there before the fiancée, that’s his house, too, and that would have been a total deal-breaker for me. Take allergy shots and live with my dog, or fuck right off into the sunset.",
              "id": 119,
              "comments": [
                {
                  "score": 108,
                  "content": "I agree that OP is the ass; however, as someone who has off the charts(yes, there is a metric for this) dog and cat allergies, it’s not always as simple as taking allergy shots. I’ve gone from fine to spending 3 days in the hospital over a cat. I will not visit anyone with pets if I’m having trouble with my asthma, and I’ve stopped in general with indoor pets in homes with carpets if I haven’t met the animal before on a good asthma day. Sorry not sorry, not about to risk my health and time to avoid hurt feelings and all of my friends understand that.\n\nObviously, I can’t speak to the severity of stepson’s allergy, but if OP had to get rid of the dog entirely, the allergy is probably severe.\n\nEta: OP is AH due to harassing new doggy owners, not for getting rid of dog.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 47,
                      "content": "As someone also allergic to cats and dogs (although not as severe as yours sounds), I would never be able to live with an animal, and I DO get allergy shots. And besides, it’s not always feasible for someone to get allergy shots. It takes time and money and not everyone has that ability. It’s unfair to call OP an asshole for finding his dog a new home to accommodate his stepson’s allergy. Although he is a major asshole for the name situation.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "i'm severely allergic to cats, I just don't get involved with anyone who loves cats.  I wouldn't dream of expecting someone to get rid of their pet for me, in fact I'd think a hell of a lot less of them if they were even willing to consider it.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I don’t think you should risk your health for other people but I think in a dating/marriage situation it’s a fairly large fundamental difference to have between a pet lover and a severely allergic person. It could and I would almost argue should be a deal breaker. Pets are living creatures and commitment you make when adopting them. I could meet my alleged soulmate tomorrow but if he needed me to get rid of my pets he’s not the one for me. I would never give them up but also wouldn’t expect someone else to suffer with them.\nOP is definitely TA but it sounds like he’s having a lot of regrets giving up his dog which is why he’s still trying to control the new owners.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "I've taken in dogs that lost their home due to allergies. Being rehomed isn't as problematic as ppl make it out to be. Being in a shelter for a time sounds really traumatic but being moved from one loving home to another works fine for all.   \n\n\nThe \"a dog is for life!!!\"-extremists also make it way more shameful for ppl to give up a dog and means that fewer will look for a good home \"publicly\" and instead will dump the dog quietly at a shelter or have it put down.   \n\n\nStop shaming ppl for life happening!   \n\n\nIt also means some dogs end up spending their entire life in a place that doesn't suit them. If the family dog turns out to be stressed with a busy life? Too bad, a dog is for life so no looking for a quiet home for this dog. If a couch potato breed turns out to think it's Usain Bolt and living with ppl that can't provide 4 hours of excercise a day? Too bad, we'll just crate it instead of getting it a home where it can run free all day. Or if an active breed lives a happy active life with an active owner and this owner becomes disabled and can no longer stimulate the dog? Too bad, a dog is for life!   \n\n\nIt's also so ironic when the \"a dog is for life!!!\"-ppl still end up divorced and have no issue letting their kids move back and forth every week.",
                  "id": 124,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I agree with you 100%",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Lets not frame giving up a pet as a bad thing. Too many people keep pets they shouldn't because they view giving them up as a bad thing, and thats just cruel to the animal. \n\nMy partner's partner had to rehome her new puppy due to allergies. It was tough but he needed more attention than she could give with how the allergies affected her (and allergies are not as simple to deal with as \"take some meds\". She cannot manage the side effects alongside her job, especially with working from home, where her pets are). Now he lives with us and he is a very happy dog who gets all the love he needs. I have a friend who recently moved in with her sister, and their cats don't get on to the point that she had to give her cat to dad, the poor thing was just miserable sharing a home with another cat.\n\nRehoming a pet is a difficult enough thing without shaming people. The pet needs to come first, and sometimes that means letting them go.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Rehoming an animal is often the kindest option. Please don't frame it as something bad.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 169,
          "content": "Rescue dogs get renamed all the time. It's not traumatic or confusing for them. They adjust.",
          "id": 128,
          "comments": [
            {
              "score": 21,
              "content": "dogs do not even conceive of names the way we apply them to the dog. it's just a verbal cue that you've trained them means \"pay attention to me\". it couldn't be any more confusing to them than being taught any other cue, like \"sit\" for instance.",
              "id": 129,
              "comments": [
                {
                  "score": 13,
                  "content": "Exactly! The dog doesn’t *identify* with its name. It’s just a word that had been trained to mean something like “look at me” or “this is your cue not the other dog’s”",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "In some cases it’s actually really helpful.  Dogs from abusive situations sometimes cower when they hear their name, so giving them a new one with positive associations can work well for them.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Exactly - we renamed our rescuer Curtis to be Otis. As mentioned above - taking care to make it sound similar enough.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "I think OP needs to see a therapist, they do not sound mentally stable",
          "id": 133,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 76,
          "content": "We adopted a dog named Cody. My 2 next door neighbors both had sons named Cody. It seemed pretty dumb to add a third \n\nWe renamed him Toby.",
          "id": 134,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "I recently learned that in the horse world it is bad luck to change a horse's name.  Horses move around much more than dogs but those in the horse world carry this superstition over to dogs as well.",
          "id": 135,
          "comments": [
            {
              "score": 23,
              "content": "I mean are they racing or fighting their dogs because if so I’m sure how bad luck from race horses would equal over to bad luck with home dogs.",
              "id": 136,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "That's...not really true. I'm a horse rancher, it's an old superstition that's mostly a joke in the horse world. The saying goes 'It's bad luck to change a horse's name...unless you don't like it or the name doesn't fit!'. While registered names are almost never changed -for a variety of practical reasons- barn names (the name the horse is called daily) get changed all the time.",
              "id": 137,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "OP legitimately sounds unhinged. It's probably not about the name. I wonder if he's regretting giving away his dog and having second thoughts that his relationship was worth it. This doesn't absolve him from acting absolutely deranged to this innocent family. He needs to either accept his decision and stop resenting his fiance and future stepson and acting out on strangers or he needs to leave this relationship if has realized they're incompatible. Either way, he needs to move on from Rudy. Rudy has a new family. You have no say in Rudy's life and you've acted so inappropriately, the family was wise to block contact.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "A lot of rescues recommend renaming a dog when taking them to a new home as a fresh start and their are plenty of dogs taken in without a name. It isn’t mistreatment or anywhere close that they’ve renamed him Rudy. The fact that you’ve gone to their house and social media on this makes you doubly asshole-ish YTA! Absolutely do not show up again and get your head straight your fiancé is not biased when they say you’re overstepping and should leave it alone or risk damaging your relationship with them and your stepson more.",
          "id": 139,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Honestly after reading that i couldn’t help but wonder how his partner is not reconsidering this relationship as OP clearly has anger and control issues that are not being dealt with.",
          "id": 140,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Yeah when I got my cat he was 5 and named Wodan, he is almost 10 now and named Loki, among about 20 nicknames that he will react to, as long as you’re consistent in tone animals really don’t give a rats ass about what you call them. The food and petting is much more important",
          "id": 141,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8077,
      "content": "YTA.  Leave these poor people the hell alone.\n\nGood grief.",
      "id": 142,
      "comments": [
        {
          "score": 3893,
          "content": "But how about all his legal papers? Now Rudy (Willy) will most likely have a hard time voting and won’t be able to register any vehicles he owns! /s\n\nYTA, leave that family alone",
          "id": 143,
          "comments": [
            {
              "score": 815,
              "content": "YTA. Rudy won’t start passing bad checks or commit voter fraud.",
              "id": 144,
              "comments": [
                {
                  "score": 337,
                  "content": "You don’t know Rudy, I’ve heard some things",
                  "id": 145,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 142,
                  "content": "I mean.... I wasn't gonna say anything, but word on the street is Rudy is mad shady.",
                  "id": 146,
                  "comments": [
                    {
                      "score": 16,
                      "content": "You could say he was a bit of a... maddog",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "We don’t talk about Rudy…",
                      "id": 148,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Wait till he tries to get a passport. It's going to suck proving his current legal name, especially if OP wants to show up at the passport office and cause trouble.",
                  "id": 149,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 294,
              "content": "[deleted]",
              "id": 150,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 156,
              "content": "thats what made me feel this has to be a joke somehow. like, it cant be a difficult process at all to switch the name of a dog yet he's acting like they just found the last digit of pi",
              "id": 151,
              "comments": [
                {
                  "score": 75,
                  "content": "My brother changed my cat’s name twice without our dad knowing. He just took the cat to the vet and said “yeah his name is Juan Bolsa now.” It’s not that hard to change their “legal” names",
                  "id": 152,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I literally took my hamster Sugar to the vet once... Next visit I say:\n\n\"I would like to introduce you all to MushMouse.\"\n\nHe was also known as The Hamster, The Rodent, The Rat, The Hamster Formerly Known as Sugar and SmashMouth.\n\nLegally he was Mushmouse.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "The only thing that would possibly be hard to change is if the dog had “full registration” with the AKC, but honestly, dog’s registration names are almost always disconnected from their pet names. (Ex: a competition/breeding dog might be registered as Felicity’s Blossom Garden, but they actually call her Daisy.)",
                  "id": 154,
                  "comments": [
                    {
                      "score": 49,
                      "content": "Yup, my horse's show name was \"Son of Dancing Sunset\" or some shit. I literally do not remember because I looked at his papers like once when he was signed over to me.\n\nHis barn name was Crow. He also responded to Puppy, Handsome, variations of Boo Radley, and Mr. Spooky Pants.",
                      "id": 155,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "It’s incredibly easy to change an animal’s “legal” name - what we call a “legal” name for animals is essentially just what the vet has them registered under. It has nothing to do with the government. The vet would most likely have automatically changed Rudy’s “legal last name” anyway, to match the name of his new family. Literally all they would have had to do was say “Oh, we call him Rudy” and the vet would change it.",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 62,
              "content": "Its ok, Rudy can register his previous name as an alias and he can enjoy keeping his voting rights, driving and scuba licenses.",
              "id": 157,
              "comments": [
                {
                  "score": 16,
                  "content": "Don't forget the boating, hunting, and fishing licenses! His Costco membership too!",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "How does OP think changing a dog's name is so difficult? Does he know that humans change their names all the time? Changing a dog's name is literally as simple as calling the dog by the name you want it to be known as, registering the dog with the vet under that name and licensing the dog with your town with that name.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Don’t even get me started on the dog trying to get a passport!",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I thought it was normal to decide the name of a new pet. Would I have to attend the birth of a pet to have any say its name?",
              "id": 161,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 603,
          "content": "Seriously! How is it at no point during your drive over to their house did you NOT stop to think, “maybe they did nothing wrong and I just miss my dog.”???\n\nLike, just have a good cry and then move on.",
          "id": 162,
          "comments": [
            {
              "score": 483,
              "content": "This is what happens when men don't understand that it's okay to feel things other than rage, lust, and occasional happiness (but in a masculine way). Rather than admitting that he's sad about giving up his pet, and maybe regrets the decision, he went to scream at some random people.",
              "id": 163,
              "comments": [
                {
                  "score": 71,
                  "content": "yep and i’d feel bad about it if men weren’t the only people i saw perpetuating this standard 🙃 when will they learn that it’s okay to not bully each other including ur children for having feelings",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "This is a complete lack of self awareness from OP.",
                  "id": 165,
                  "comments": [
                    {
                      "score": 36,
                      "content": "well yeah but do you see him express sadness or grief in a healthy manner? no, he internalizes it then blows up at the family who now controls visitation and information for/about his old dog lol. he uses anger about the name change to express his unexpressed/unresolved feelings about the entire change in my opinion",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Bold of you to assume that OP doesn't see this is a temporary custody arrangement. Willy's just living with this other family until OP can bring him back home again, possibly after haranguing his fiancee into giving up her kid or something.\n\nDollars to doughnuts he still considers Rudy HIS dog.  Sorry, OP, that is NOT how this works. YTA.",
              "id": 167,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": ">Good grief.\n\nIndeed!",
          "id": 168,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7793,
      "content": "You *went to their home* after already berating them on the phone and social media? Are you fucking serious dude? That’s insane. You sound like a crazy person. I’d be terrified of you if I were that family.\n\nYTA",
      "id": 169,
      "comments": [
        {
          "score": 1107,
          "content": "For real. Crossing so many boundaries. \n\nYTA OP.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1059,
          "content": "Putting \"hassasement\" in quotes really did it for me. YTA, you were absolutely harassing them by showing up at their house! Wow!",
          "id": 171,
          "comments": [
            {
              "score": 217,
              "content": "Yea I've seen and experienced both harassment and \"harassment\". This is the former.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 409,
          "content": "Sounds like a crazy AND jealous person! A little girl calling “Rudy!” over and over means that the dog is getting a lot of attention and having fun in his new home. Rudy was supposed to be still upset about being discarded by his former owner and I bet that’s the underlying issue.",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 366,
          "content": "The irony of all this is he gave up the dog to move in his fiancee but his reaction may very well mean he ends up with neither the dog nor the fiancee.",
          "id": 174,
          "comments": [
            {
              "score": 209,
              "content": "If the FIANCÉE  is wise,  she will recognize how much of a narcissitic bully he is to that family that  added  his dog he that  could not keep into  their great home, and pick up on those red flags and leave him.  Dude should look into psychiatric help and psychotherapy. His behavior towards the family involved is disturbing and not within normal limits. Jmo.",
              "id": 175,
              "comments": [
                {
                  "score": 184,
                  "content": "\"She got offended but I told her that siding with strangers mistreating my dog did not paint her in good light\"\n\nWtf?? Did not paint her in good light? Who talks about their partner in that way? What a self-righteous, moralistic prick. YTA. And fiancee: get the hell out of that relationship.",
                  "id": 176,
                  "comments": [
                    {
                      "score": 14,
                      "content": "My mind is blown that I had to scroll this far to see what he said to his fiancee be addressed. Of course what he did to the family justifies legal action on their part (that is, legal action beyond the arduous process of changing a dog's name), but to be so awful to her and imply this is all her son's fault for having an allergy when really it was his decision to pursue the relationship when clearly if it progressed he would have to re-home Rudy. I just hope this is fake because it's so awful all around.",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 73,
                  "content": "Honestly, I feel worried for the fiancée if/when she leaves him. Men who claim eternal ownership are extremely dangerous. If OP feels fully justified in harassing a poor family that adopted his dog, can you *imagine* what he’d do if a woman left him and tried to move on with her life?",
                  "id": 178,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Yes, she should seek help on how to safely get out of that situation.",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Don't forget the other irony, that this family adopted a breed useful for home defense from the guy they apparently need to defend themselves from.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "We can only hope this is the case for the fiance and her son's safety.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 84,
          "content": "YES. Sounds wild and scary",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "This. You got big issues man, you shouldn't have that dog, or that child in your house, imo.",
          "id": 183,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 63,
          "content": "Yeah. Jeez and I was worried about the crazy cat lady who I adopted a cat from that insisted I email her once a month to make sure the cat is doing well. If someone I adopt an animal from yells at me on the phone and then threatens and follows thru on coming to my house I'm getting the cops involved.\n\nYTA OP. and word of advice, stay far away.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I can only imagine how terrified the poor kids were to see this grown man yelling and screaming at their house..\n\nYTA OP and you seriously need therapy and I hope your fiancé is rethinking this marriage because this reaction is a MAJOR red flag..",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": ">I’d be terrified of you if I were that family.\n\n&#x200B;\n\nOp's fiance should be terrified too.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "right? good thing they have a dog to protect them against this lunatic",
          "id": 187,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5287,
      "content": "RUDY IS NOT YOUR DOG. Once you put it up for adoption the OWNERS have all rights to him and can change his name if he pleases. \n\nYTA and you know it",
      "id": 188,
      "comments": [
        {
          "score": 166,
          "content": "Dogs do not have an identity tied to a name. The only person who has attributed an identity to his old name is you.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "This is like selling a house and then getting pissed the new owners redecorated and repainted.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2757,
      "content": "[deleted]",
      "id": 191,
      "comments": [
        {
          "score": 622,
          "content": "The chances of you having any future contact with them and the dog are now zero. YTA, you gave up all rights when you re homed him.",
          "id": 192,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 263,
          "content": "Frankly OP should never have expected to continue contact. He clearly has not emotionally let go of this dog as no longer being his. He gave the dog to a new family not to a boarding kennel. OP seems to think he gets some coparenting relationship because he is the previous owner. Its really sad. Kinda glad he acted out early so the new family will cut contact and not have to send him updates for years.",
          "id": 193,
          "comments": [
            {
              "score": 59,
              "content": "Also, honestly, if he was so broken up about it he wanted continued contact, he should have talked to the perfect family he picked out about his wish for Rudy’s name not to be changed. \n\nI know people who have had to give up their children for adoption because they needed a more stable home, but they still want contact with their kid. Some adoptive parents are cool with that! You just have to sit down and talk about how you navigate the situation BEFORE they adopt the kid. Rather than not communicating and flipping out and harassing them, which obviously means a restraining order and not seeing the child at all.",
              "id": 194,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Also, my dog responds to a few names. I get it can be confusing to rename them, but they are smart. He’s got a formal name, a nickname, and many joking names (monster, sweetheart, etc) that he knows refers to him. The nickname is the one I use when I need him to pay attention, like if there’s another dog around or I drop chocolate on the floor and tell him to move away. But dogs aren’t stupid and they adapt quickly. So no abuse or mistreatment here in the slightest.",
          "id": 195,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1523,
      "content": "I can see why it might upset you but you are going about this all wrong which unfortunately makes YTA here\n\nThey have adopted the dog so they are right it is theirs now they may extend you the curtosy in some regards but it's perfectly within their right to rename willy if they want to\n\nTo berate them about it on social media and to even go as far as going their place to argue over it is way over the top and honestly you are putting yourself in a potentially legally challenging position\n\nI understand with stuff like it's hard to not get emotional over a close family pet no ones going to a call you out for that but as they've said they have adopted him now and hold the right to change his name if they so wish no matter how much an emotional connection you have\n\nI'm not too clear why you are under the impression they can't do this legally",
      "id": 196,
      "comments": [
        {
          "score": 52,
          "content": "[deleted]",
          "id": 197,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1425,
      "content": "Yta. As soon as he got rehomed, he became their dog. They can rename him if they like. You had no right to lose it on them, he is no longer your dog.",
      "id": 198,
      "comments": [
        {
          "score": 47,
          "content": "Also it's a dog, any dog owner as called their dog many names besides their name.\nI called my dog by her name, then sometimes \"señorita\" (I'm mexican) chingaderita, hija de su madre, nena.\nAnd guess what OP , she respond to every single one of them cus is not the name that she's familiar with, it's who is calling her, hell sometimes I just whistle and she comes running cus she knows who is calling her. I only called Ava when she's doing something she's not supposed to.",
          "id": 199,
          "comments": [
            {
              "score": 5,
              "content": "I call my dog recunchinflete. His name is capitan.",
              "id": 200,
              "comments": [
                {
                  "score": 10,
                  "content": "And I'm sure Everytime you called him that your dog still wags his tails and comes to you cus that's what dogs do, they come to whoever is calling them with a loving recognizable voice",
                  "id": 201,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I could literally call him chicken wing with a cute voice and hes gonna be like yeeeeeees",
                      "id": 202,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Imagine the family demands that he pays for vet bills going forward. That'll stop him for thinking it's still his dog. Seems like the dog dodged a bullet.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1068,
      "content": "YTA. You've rehomed the dog and he's therefore not your dog anymore. He may always be Willy to you, but he's not yours anymore and the new family has a right to change his name if they want to. They're actually being really kind allowing you to still be in touch and involved with the dog as they really don't have any obligation to be.\n\nBe grateful you still get to have interaction with him and get over the ego trip.",
      "id": 204,
      "comments": [
        {
          "score": 359,
          "content": "There is zero chance he will ever be able to see his (former) dog again after showing up at their house.  He is now officially an aggressive and unstable person, and they will probably call the police if he shows up again.",
          "id": 205,
          "comments": [
            {
              "score": 109,
              "content": "Especially if he’s yelling at their child? I’m 21, and even I feel threatened by OP. If I had a child and some grown man was yelling at my daughter on the phone, Imma block contact with that person",
              "id": 206,
              "comments": [
                {
                  "score": 9,
                  "content": "I was also disturbed by all of this springing from him overhearing a young girl call a name in the background...it is just really strange. Like how is it appropriate for him to question what someone in the background was saying, when all he was calling about was an update about the dog he gave away? The going to their house was just full-on intimidation. There is no way I would ever speak to him again.",
                  "id": 207,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Yup. I used to volunteer for a rehoming charity which had to bring in a no update policy. OP is a shining example of why.",
          "id": 208,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1018,
      "content": "YTA - they are not “mistreating my dog” because it isn’t your dog anymore.  You gave him up, live with that and move on. Leave these poor people alone.",
      "id": 209,
      "comments": [
        {
          "score": 420,
          "content": "Nor is renaming a dog mistreatment. What a ridiculous accusation from OP",
          "id": 210,
          "comments": [
            {
              "score": 241,
              "content": "Renaming a dog:🤬\n\nDitching your dog, who you’re supposed to view a family, and giving him to someone else: 🙂",
              "id": 211,
              "comments": [
                {
                  "score": 72,
                  "content": "Underrated comment.\nRehoming an animal is traumatic for them. I've called my cat 100 different names in the hundred days I've owned him, he never seems to mind.",
                  "id": 212,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 82,
              "content": "Right? Dogs get renamed all the time when they get adopted. And every dog I've ever known also responded to a bunch of nicknames and that clearly doesn't hurt the dog. OP is crazy.",
              "id": 213,
              "comments": [
                {
                  "score": 27,
                  "content": "Yeah, I come up with new nicknames for my dog every day that don't remotely sound like her name but she still responds to them. Rudy and Willy at least sound similar to a dog.",
                  "id": 214,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "\"that dog already has a name that was given to him by his owner and they should respect that.\"\n\nYes, and his owner named him \"Rudy\". You are not his owner anymore. You should respect that.",
          "id": 215,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Even if he had some kind of weird co-owner thing going on, changing the dog's call name/using a new nickname *is not mistreatment* and it's incredibly weird for this dude to act like it is.\n\nBut yeah, not only is not mistreatment to rename a dog, it's not his dog and he needs to leave these people alone and accept that his bizarre behavior has probably lost him all access to info about the dog.",
          "id": 216,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}