{
  "post content": "To provide some background, I am a petite female working as a language lector. I only teach people individually and try for my lessons to be fun. Each lesson is just me and the student (max 4) in my classroom for an  hour, which seems to work for everyone, and the results are  pretty good, but it is also the reason why I try to pick my clients  carefully - feeling a bit vulnerable all alone with them.\n\nSo  about half a year ago a lady contacted me about lessons for her two small kids (girls 7-9yo). At first everything was normal and fine, the kids were sweet and excited to learn. Until one of the girls started saying creepy stuff. She would draw a house and explain that \"there lives a cannibal who eats kids\" and go on in detail explaining how the man chopped somebody up and which part he is eating/cooking/grilling.\n\nThe first time, I was shocked and told her mum, but the mum just shook it off, but it keeps happening. As the lessons went, I found out that the kid's favorite movies  are gruesome horror movies, which she is capable to find online on her  own, and which she states \"are not scary to watch, they are so funny!\"\n\nProbably  the last drop was when we were playing with dolls, and this girl  arranged them all to lie on the floor of the dollhouse with one standing  in the middle and made me and her sister guess what has happened, we  tried \"she is reading a story to them\", \"they are playing a game\", etc.  nope! IN the end, she exclaimed excitedly \"NO! SHe has poisoned them All  because they were annoying!\"\n\nSince then  I have to explicitly ban murder/killing from every single game because her sister, who was originally visibly scared of it, started getting in on the \"fun\", and I am starting to feel that I have to cut my connection to this family ASAP.\n\nI am already creeped out by that kid, and cannot imagine spending time with her alone when she grows bigger. I  have already heard about her \"digging a hole to bury a classmate in,  because they are naughty\", and her own mother commented \"I am just waiting for somebody to disappear\" in a half-joking half-serious manner.\n\nSo,  AITA? Is this a normal kid behavior which will pass? Am I  overreacting? Am I a scaredy-cat? Or do I rightfully feel in potential danger? I have no idea how to break it to their mom, who is a very sweet person...\n\nEdit: I should probably add, that another thing which makes me back out is that I have seen the kid physically attack her mother a few times it pretty normal situations. The reaction was totally unexpected, 0 to 100 in a second. I don't want to get in such situation, because it could only end in trouble...\n\nEdit 2: I feel I need to defend myself here - I have NEVER scolded, criticised or shunned the kid, or any other. I have never given her a reason to feel bad, and would never do that. I treat all children as individuals and with respect, it is the reason why we have such good relationships. When I ban murder from the games, the kid laughs, because she takes it as an inside joke, not being criticised.",
  "id": 1,
  "comments": [
    {
      "score": 114,
      "content": "NAH - Definitely not the asshole here, as a freelance tutor you are entitled to choose your clients and who you get involved with on a variety of factors: your capacity to teach them, their own desire to learn, even their general vibe and whether it makes for a safe working environment for you. Consider however this is a little kid that probably just mimics things she watches online and is being creepy without realizing it. Small kids have no concept of social inhibition and I don't believe there is intentional evil in her behavior. As an educator, it is important for you to think also that if this kid keeps being segregated for its behavior and considered \"creepy\" even by adults then the situation will worsen, I believe you should have another, very open and honest conversation with the parents, sharing your thoughts, maybe suggesting they should not allow a little kid to uncontrollably surf the net. You can be a good influence for this child, you are however completely justified not to want to take up that role.",
      "id": 2,
      "comments": [
        {
          "score": 32,
          "content": "Thank you very much for your comment. I have tried that second serious talk, It was pretty terrifying. The mom now actively tries to keep the kids from watching the horror movies, but they keep finding a way around her. She seems relatively desperate herself, but turns it into a joke everytime... I have seen her confront them, pretty subtly, and the girl actually went and kicked her mother as a reaction!\n\nShe luckily does not seem to be shunned by anyone so far, otherwise I would be really worried for her...",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 76,
      "content": "[deleted]",
      "id": 4,
      "comments": [
        {
          "score": 14,
          "content": "Thank you",
          "id": 5,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "NTA - for not meshing with a particular kid and deciding it's best not to work with that kid.  But... it's possible the kids are not creepy serial killers in the making, they're just feeding off of and reacting to your actions.  In your first paragraph you state that you feel vulnerable simply being alone with students, so you're already on edge.  No idea how the cannibal thing first came up, but your reaction must have been severe enough to prompt the sister, who you state was originally scared by the comments, to join in with the comments.  \n\nIOW, it's possible your reactions and fear are - if not causing - at least contributing substantially to this.  This insight may not help for the current situation, but might help you avoid creating future problems with students.",
      "id": 6,
      "comments": [
        {
          "score": 2,
          "content": "Thank for your answer. To clarify, I normally feel very comfortable being alone with my students, my classroom is my favourite place to be TBH, I might have stated that misleadingly. I just like to know a bit about who I will be teaching before We start having lessons. \n\nThank you for that suggestion, though, I have thought that maybe it is her way of getting any kind of attention, and I am giving it to her... I might try just ignoring it, but when I do that, her sister and her start aggravating it really really bad. She seems to be doing the same at her school and other courses, so it is not only me.",
          "id": 7,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "NAH but this kid needs to speak to someone before she acts on these sayings or someone else is more offended than you by them. \nYour safety is super important and gut feelings are usually right. Yours is telling you to get out so you probably should.",
      "id": 8,
      "comments": [
        {
          "score": 1,
          "content": "That kid is a serial killer in the making, if noone intervenes",
          "id": 9,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "NAH, you don't have to work for anyone you don't want, but this is laughable. How does the kid treat the other kid and animals? Unless they are actually *doing* something, I would say its a huge over-reaction, scaredy-cat, but you are allowed to quit any job you want.",
      "id": 10,
      "comments": [
        {
          "score": 10,
          "content": "Probably. As for how she treats others, I have seen her physicaly attack her mother multiple times, going from happily smiling to screaming and kicking her shins in a second as a reaction to any reprimand or a normal request \"tie your shoe\". That is another thing which unnerved me, because I have no idea how I would/could react to that.",
          "id": 11,
          "comments": [
            {
              "score": 10,
              "content": "If this is the case then you're fear is very relevant and you're correct. If she turns like this on you, society hasn't given us good methods on handling these situations in the work place. The best option is to just not get in it.\n\nThere are other teachers out there.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NAH\nI'm gonna say though kids are creepy in general (I'm the oldest of 9). Neil Gaiman got the idea for Coraline from his daughter after she told a story about a girl whos whole family was replaced by look-a-likes who try to kill her so....yea kids are actually evil gnomes.",
      "id": 13,
      "comments": [
        {
          "score": 3,
          "content": "Seriously, they’re weird as shit. I used to work after school care and an otherwise really sweet and well-adjusted third grader gave me a picture he drew of a crucified ram with the caption “I killed a.... RAM!” \n\nTurns out it was a loading screen from a video game his brother was playing apparently, but the fact that the kid gave it to me with so much pride was creepy but hilarious. I kept it on my fridge for weeks.",
          "id": 14,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NAH some kids are weird, I’ve worked with a lot over the years. Definitely decide yourself whether or not to work with them. But also understand that some people are just built more morbid than others. Someone suggesting to call cps is ridiculous. Definitely talk to the mother as you leave about why your leaving and about proper boundaries for the kid in a classroom setting.",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NAH\n\nThere's some messed up shit going on there and you need to find that child some help. It's fine that you're scared and it's not your responsibility but I think you should. ASAP\n\nI don't think hiding yourself from he kid is going to fix her issues. And if they get worse, yours neither.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NAH, but you should like...really definitely try to talk to the mom about early warning signs for violent tendencies and low empathy, because that's the alarm bells that your descriptions are setting off. Some kids are just imaginative, but some are actually potentially dangerous and will learn to hide their socially unacceptable behavior and thoughts as they get older. It might be good to make a list of child psychologists who are able to deal with this sort of behavior and *strongly recommend* to her that she take her daughter(s) to work with them regularly. The mom sounds nice, but also sounds like the type of person to get walked all over rather than making sure her daughter understands that the things she's doing in her pretend play are *wrong*.\n\nBest case scenario even if the mom does seek therapy and help: the girl does grow out of it, or only needs a little extra intervention. Worst case scenario: she actually very desperately needs early intervention to develop cognitive morality or anything resembling empathy. This is not the kind of thing that her mother should gamble on.\n\nYou're definitely in the right for being reluctant to work with them. She sounds like exactly the type of kid who would turn the situation against you if she attacked you, e.g. injure herself and then claim you did it because she knows it's your word against hers and hers will probably take priority. That's an extremely dangerous situation to be in, and her sister is likely to be scared of her and back her up. *If* you want to continue working with them for a while before making a decision, it would be wise to change to a public venue, like a library, somewhere that there are witnesses around. You could also make it an ultimatum or tell the mom that you'll work with them again when she starts seeing a therapist regularly + progress has been made.\n\nSome resources:\n\n[An article about callous children](https://www.theatlantic.com/magazine/archive/2017/06/when-your-child-is-a-psychopath/524502/) \\-- the examples here may be rather extreme comparatively\n\n[Searchable listings of psychologists](https://www.psychologytoday.com/us/therapists) \\-- even if you can't find one who specializes in low empathy kids, any local therapist might be able to point you/the girl's mom toward more extensive resources\n\n[Inventory of Callous-Unemotional Traits](http://labs.uno.edu/developmental-psychopathology/ICU.html) \\-- this page is intended for researchers, but you, the mother, and the child filling out your respective versions of this to give to a therapist may prove helpful for diagnostic/therapy purposes",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited.***\n\n \n\nTo  provide some background, I am a pettite female working as a language  lector. I only teach people individually, and try for my lessons to be fun. Each lesson is just me and the student (max 4) in my classroom for an  hour, which seems to work for everyone, and the results are  pretty good, but it is also the reason why I try to pick my clients  carefully - feeling a bit vulnerable all alone with them.\n\nSo  about half a year ago a lady contacted me about lessons for her two  small kids (girls 7-9yo). At first everything was normal and fine, the  kids were sweet and excited to learn. Untill one of the girls started  saying creepy stuff. She would draw a house and explain that \"there  lives a cannibal who eats kids\" and go on in detail explaining how the  man chopped somebody up and which part he is eating/coking/grilling.\n\nThe  first time, I was shocked and told her mum, but the mum just shook it  off, but it keeps happening. As the lessons went, I found out that the kid's favourite movies  are gruesome horror movies, which she is capable to find online on her  own, and which she states \"are not scary to watch, they are so funny!\"\n\nProbably  the last drop was when we were playing with dolls, and this girl  arranged them all to lie on the floor of the dollhouse with one standing  in the middle, and made me and her sister guess what has happened, we  tried \"she is reading a story to them\", \"they are playing a game\", etc.  nope! IN the end she exclaimed excitedly \"NO! SHe has poisoned them All  because they were annyoing!\"\n\nSince then  I have to explicitly ban murder/killing from each single game because  her sister, who was originally visibly scared of it, started getting in on the \"fun\", and I am starting to feel  that I have to cut my connection to this family ASAP.\n\nI am already creeped out by that kid, and  cannot imagine spending time with her alone when she grows bigger. I  have already heard about her \"digging a hole to bury a classmate in,  because they are naughty\", and her own mother commented \"I am just  waiting for somebody to dissapear\" in a half-joking half-serious manner.\n\nSo,  AITA? Is this a normal kid behaviour which will pass? Am I  overreacting? Am I a scaredy-cat? Or do I rightfully feel in potential  danger? I have no idea how to break it to their mom, who is a very sweet  person...\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 18,
      "comments": [],
      "relation": "No"
    }
  ]
}