{
  "post content": "So my husband (39m) is friends and coworkers with both people. He’s kept the super awkward friendship with, we’ll call him frank (42m), by not talking about the situation. \n\nThe situation is frank hooked up with (40f) Marlene, and she ended up pregnant. Now he’s taken her to court to try and get out of child support. His side being that she told him she couldn’t get pregnant after he said he didn’t want kids. \n\nHusband has tried to stay neutral on both sides by not talking about it to either side. But at home it hurts him because we’ve been trying for a kid for 3 years and have been working through some fertility issues. And his friend gets someone pregnant like it’s nothing, and then wants nothing to do with it. So that really pisses me off. \n\nSo Frank ended up being at the same ballgame as us. Hubby said he wants us to come hang out. I said I wasn’t really interested in hanging out with a person like that. One thing led to another and we’re hanging out together. Ultimately after the game is over and we’re all b.s.ing, I end up calling him out for it being his responsibility as an adult. He ends the conversation by saying he has had to pay this whole time. I walked away but had to go back and defend my husband but he wants to hear none of that. Truth hurts. Then franks side piece gets involved and we have to leave before I get us kicked out. \nAith for even talking about it? Maybe different place different time but I had no intention of seeing him again. Also he brought it up because he said we’re all family, I said no, he asked why, I said you know why… the rest is history.\n\nEdit;\n\nY’all are right, ESH. I’m new to Reddit and had to look up what that means. But I love it cause it’s true.\n\nI never should have handled it the way I did. IATA for that. And I am taking a lot out on him for our infertility issues.\n\nShitty thing is, we were all friends before this. My husband worked with both of them. And my coworker is her sister. So we’ve all hung out together multiple times. The last time was actually at a baseball game(I see a theme here), When she was newly pregnant and he was still in it as a wanting to be the kids father. She was so excited because she mentioned then that she didn’t think she could get pregnant. So it was her understanding that she couldn’t. Wether is was medically confirmed or not I don’t know. I do know first hand it costs a lot of money to find out.\n\nBut I never got his side of the story until last night. He said that when they hooked up, both by mutual agreement, he wrapped it up the first few times. Then I guess things progressed and they didn’t want to use protection. He told her he didn’t want kids and she said she couldn’t have them. I don’t think either of them lied. I think they both believe their sides. I honestly don’t believe it was entrapment because that’s not the kind of person she is. But I guess there are crazier things.\n\nI’m the end its a lot messier than what my husband told me. That was one reason I wanted to talk to frank. But it sucks that it turned out the way it did because now their baby is the one who will suffer and needs support. He gave up his rights because he does not want to have to pay.\n\nFor those that said he should get out of it because he said before he didn’t want kids I get that point. But In the end there’s a kid now and while he can give up his rights and not have anything to do with the kid he still needs to be held accountable by financially supporting it. It sucks but it takes two to tango and is was his swimmers that resulted in a child, wanted or not. He wasn’t raped. And In the beginning he wanted to make it work. He was going to be the father. I’m not sure what changed.\n\nHTA for not being a freakin adult and taking responsibility financially. And acting like it’s no big deal. STA for even saying that, if she didn’t know for sure. HubbyITA for not having a conversation like this with Frank in the first place. And for putting me in that position when he knew I didn’t want to go.\n\nAnd ITA for letting it get to me and not being able to control myself. Frank brought it up because he asked why I didn’t want to hang out. I just hate the position this puts my husband in. Now he feels like he has to pick sides and it’s torn two friendships apart. And I made it even worse last night. And I think thing that hurts him is Frank acts like nothing happened and it’s no big deal and he doesn’t care about my husband feelings or situation at all. Stupid all around. And ESH. Thanks everyone",
  "id": 1,
  "comments": [
    {
      "score": 626,
      "content": "I'm gonna lean towards ESH. Whether the pregnant woman lied about her supposed infertility or not, the friend did get her pregnant and so he ought to step up to the plate. However, the situation is really none of your concern, regardless if you know about it, and honestly it sounds like some of your feelings are stemming from jealousy/resentment because of your own fertility issues and while I do sympathize with you on that, it's not the friends fault that you and your husband are having these difficulties. It wasn't your place to speak on the situation.",
      "id": 2,
      "comments": [
        {
          "score": 78,
          "content": "It doesn't help that there is *a lot* of misconceptions surrounding infertility. Lots of people are told that they are infertile and believe that it means it is impossible to get pregnant, conflating it with *sterility*. Both refer to a broad spectrum of conditions that can affect reproduction, but infertility usually describes being unable to conceive after a year of trying and/or being highly unlikely to conceive for any number of reasons. Plenty of people who've been told or diagnosed as infertile have gotten pregnant, even if it is not statistically common or difficult without medical intervention. Sterility means you cannot conceive, even with medical intervention.",
          "id": 3,
          "comments": [
            {
              "score": 26,
              "content": "I was told that I was completely infertile… 4 months before becoming pregnant with my 2nd child.",
              "id": 4,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I had two doctors tell me I'm infertile, then 7 years later I naturally conceived and my son is almost a year old.",
          "id": 5,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -119,
          "content": "So by that logic, if a guy says he has had vasectomy and then gets a girl pregnant, shouldn't be rape or a fraud either. YTA. You can't force a kid on someone.",
          "id": 6,
          "comments": [
            {
              "score": 121,
              "content": "You do realize it's still possible to get a woman pregnant even with a vasectomy, yes? It's rare but it does happen. And in the event this happened, the woman would still have control over her own reproductive rights (at least in the USA).\n\nAnd accidental, unwanted pregnancies happen literally ALL THE TIME so I don't see how this woman is an asshole when it seems like she genuinely thought she was infertile. And it's ridiculous to expect her to get rid of the child just because the father doesn't want it.",
              "id": 7,
              "comments": [
                {
                  "score": 31,
                  "content": "*at least in some states in the USA, I say as someone who lives in a state where a 10-year old rape victim was denied an abortion.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I do agree that the abortion bans some states have imposed are completely and utterly ridiculous, but unfortunately we'll have to save that conversation for a different thread.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "In SOME states women have body autonomy. In many, women have VERY little body autonomy now",
                  "id": 10,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Yeah, of which I'm painfully aware. And if they happen to live in a state in which the woman doesn't have body autonomy then in my opinion that only gives more reason as to why the father ought to step up to the plate, because the mother couldn't get rid of the child in question even if she'd wanted to (unless you count giving the child up for adoption but I personally believe that's a worse option than abortion given how shitty the foster care system is in this country).",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Yeah look up Antonio cromartie\n\nHe had 2 more kids after a vasectomy",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -17,
                  "content": "A lot of people don't know this but a vasectomy is a 2 surgery process. A lot of people get the first part done, but don't go back for the second confirmation surgery. If you don't go back for the second procedure, the snipped tubes can \"rehook.\" You go for the second to make sure they heal separated so they can't \"rehook\"\n\nHowever there are laws that deal with people lying prior to having sex. Not knowing about infertility or STDs/STIs is treated as lying, because the law places due diligence on you knowing your status. So if he asked it doesn't matter if she knew.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Vasectomy is not 2 surgeries. You do a sperm sample confirmation, but not 2 surgeries.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "Infertile does not mean sterile and she may not have realized that she could still get pregnant.",
              "id": 15,
              "comments": [
                {
                  "score": 7,
                  "content": "This happens a lot, especially when doctors just say in passing things like \"you can't have kids\" without providing full context. You see it all the time in \"I Didn't Know I Was Pregnant.\"",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "My boyfriend had a vasectomy and I refuse to stop taking birth control. That shit isn't 100%. Birth control isn't 100%. Condoms aren't 100%. Doctors aren't right 100% of the time. This is like 5th grade sex education stuff. If you really don't wanna have a baby, take every precaution possible, but also know that if you do have sex there's still always a chance someone ends up pregnant. Dude's a total dumbass if he thinks he can nut in anyone 100% risk free, wtf.\n\n(Probably OP you're still the AH for the public confrontation, sorry. I know it's hard to hold it in sometimes but this is an issue to be confronted in private or not at all. If I were you I would have just ignored the person completely, or left and gone home if he was bothering me. Also y'all should just not hang out with this dude, he seems like he sucks.)",
              "id": 17,
              "comments": [
                {
                  "score": -31,
                  "content": "I get what you are saying but doesn't that make the girl equally liable? How is it good to force a child on someone? What kind of resentment does it build? And is it any healthy? All of these big discussions about being Pro choice in America, but that doesn't save you guys from having childhood trauma and an abusive toxic relationship with your parents. I firmly believe if the girl said it's not a problem, the large part of the responsibility lies with her. Especially when she wants the kid. You want a kid but you can't depend on yourself to pay for the child. If I don't want it, i am ready to pay for the procedure. Deciding YOU want a child when your partner doesn't want it is peak weak human behaviour. It's not like they were in a relationship. It's not like he was exploiting her and is ready to fly at a moment's notice. They hooked up. I'm ready for the downvotes but this is how it is. \n\nAnd all of this considered OP is still TA. It's none of her business.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 11,
                      "content": "> I get what you are saying but doesn't that make the girl equally liable?\n\nYes, she is equally liable.  If he gets custody she will be ordered to pay child support.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Girl? We’re talking about a fully 40 year-old woman. Woman. *Woman.*",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "It would not be rape or fraud only if he has actually had a vasectomy and believed it worked. It's not a free pass to be like \"oh I had a vasectomy\" and lie about it.\n\nChances are this woman was under the impression she was infertile. Lots of women are infertile for whatever reason.",
              "id": 21,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "I've had a tubal ligation mate, you can bet that I still use condoms - not just because no method of contraception is 100% (no, not even a vasectomy or a tubal ligation!) but because STDs are still a thing.\n\nWhere was ole Frankie boys condom? Unless he wrapped it he's a complete idiot, frankly they both are. But in his case he's also trying to weasel out of his responsibilities too, not cool at all.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -120,
          "content": "So what we can just lie about fertility now? Give me a fucking break.",
          "id": 23,
          "comments": [
            {
              "score": 88,
              "content": "Lol ok obviously you lack reading comprehension skills because it's been stated MULTIPLE times that the pregnant woman in question most likely didn't lie. According to OP's comments it seems like she was genuinely under the impression that she couldn't have kids. A surprise pregnancy isn't a lie, as much as you try to claim it is.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -214,
          "content": "She raped him but he should step up?",
          "id": 25,
          "comments": [
            {
              "score": 105,
              "content": "Where does it say in this post that she raped him? It only says that she'd told him that she'd believed she was infertile, but according to the OP in both the original post and the comments it's implied or stated outright that the pregnant woman truly DID believe that she was infertile and the pregnancy was a surprise. If true, that isn't rape.",
              "id": 26,
              "comments": [
                {
                  "score": -213,
                  "content": "She said she couldn't have kids. She lied and they had sex he didn't consent to.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 80,
                      "content": "Again, based on what the OP said, it doesn't seem like the woman lied, it seems like a genuine surprise pregnancy. It seems that the friend (father of the baby) believes she lied, but according to OP that isn't the case. So no, it's not rape.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 47,
                      "content": "I was told I couldn't have kids by more than one doc throughout my life. I have 3 living, one stillborn, and had enough miscarriages that I stopped counting. She didn't necessarily lie.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Lying does not equal rape. Come on dude...",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -3,
                      "content": "Oh shit, that's rape? Link?",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": -4,
              "content": "I think the word your REALLY looking for here is baby trapped. He DID consent to the sex.",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 332,
      "content": "[deleted]",
      "id": 33,
      "comments": [
        {
          "score": 59,
          "content": "that’s what this all leads down to, she can’t have kids and this man was so easily able to have them. deal with your issues yourself instead of taking them out on others",
          "id": 34,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 105,
      "content": "> she told him she couldn’t get pregnant after he said he didn’t want kids.\n\nIf this is the truth, then she lied to him and baby trapped him. He didn't want the kid, he didn't think she could have kids, she has the kid and tries to take him to the cleaners for child support. You're letting your own fertility issues cloud your judgment about this situation, YTA.",
      "id": 35,
      "comments": [
        {
          "score": 352,
          "content": "If he didn't want kids, he should have used protection. That's the whole sentence. People should take responsibility for their own reproduction outcomes.",
          "id": 36,
          "comments": [
            {
              "score": 147,
              "content": "[deleted]",
              "id": 37,
              "comments": [
                {
                  "score": 19,
                  "content": "This. Loads of people have diagnosed fertility issues and end up with a miracle/oops. I won't say \"a high percentage\" but being the one in a million doesn't make you feel better when you don't want kids.\n\nWrap it up. Use spermicidal lube. Accept sticking it in a vagina comes with risks and take responsibility.",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "But that would have made sex *slightly* less enjoyable for him. She can deal with having an abortion or raising a child to make sex a little better for him. /s",
              "id": 39,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 75,
          "content": "If that is indeed the truth, I agree, that’s low. But that’s what he told me tonight. \nAs far as I understand from her, she didn’t think she could. She tried with three previous partners and never could. But I don’t think she ever got it confirmed either. Very messy situation. In the end though he took her to court.",
          "id": 40,
          "comments": [
            {
              "score": 146,
              "content": "It costs thousands of dollars to diagnose fertility concerns in the US, even with good insurance. It's not covered. She very well may have believed it was true.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Took her to court for what? It’s my understanding that the a person who wants child support lifted petitions the state, not the other parent.",
              "id": 42,
              "comments": [
                {
                  "score": -30,
                  "content": "probably to not have any rights to the kid. i personally feel like if we give women the choice to have the child or not, then men have the choice to not be in the child’s life ir not. \n\nif he made it clear from the beginning he didn’t want children then that’s is that. and as far as wrapping it up, condoms break. my mother was on BC and wore condoms when she got pregnant with me",
                  "id": 43,
                  "comments": [
                    {
                      "score": 72,
                      "content": "He didn't wear a condom that broke, he chose to put the birth control responsibility on his partner. He deserves this.",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": ">as far as wrapping it up, condoms break.\n\nThis is like the people that say wearing a seatbelt can actually kill you during crash. Yes, rarely. The vast majority of the times it saves your life. It really isn't an excuse.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "Exactly.\n\nYou can not want children, you can take every precaution (like BC and condoms), you can even think you're infertile due to your history or medical diagnosis - and kids can happen anyway. Whether it was the BC that failed, the condoms that failed, if something changed medically... in all cases the child is still both parents responsibility, accepted at the point of conception.\n\nIf a woman purposefully baby traps a man, or if a man rapes a woman, we get into muddier waters... but this isn't nearly so dramatic. Two adults hooked up and caused a surprise pregnancy despite their preconceptions, they're as responsible as two teenagers who whole-heartedly but mistakenly believed the \"pull out method was fool proof\".\n\nIf this man is so against taking responsibility for a child - he certainly could have taken more precaution - but it's no more his fault than it is hers.\n\nWomen do have the additional choice of ending a pregnancy - but that's because they have the additional task of bearing the child. It's a technical reality of the situation - but abortion still isn't a procedure that's recommended. Men and women have equal choice at the most critical stage - when they participate in sex that causes a pregnancy - and again it's why society puts the onus of responsibility on both parents at conception.\n\nIndividual circumstances vary - but I'd say the reality of most fathers being less effected physically and economically by parenthood is a technicality that helps balance it out - along with their tendency to be less attached to and more prone to abandoning their children (both planned and unplanned).",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "> i personally feel like if we give women the choice to have the child or not, then men have the choice to not be in the child’s life ir not.\n\nThe difference is that the choice whether to continue a pregnancy is the woman's right, but support is the *child's* right.  The child should not be deprived of its rights because the mother lied, IF she actually did lie.",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "We don’t actually give women a choice anymore, so",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "He's absolutely allowed to choose not to be in the childs life, he has that legal right. Not paying child support is an entirely different thing. \n\nHe had sex with someone knowing that she could get pregnant and that she has the right to choose if she keeps it. He made an informed decision, now he has a responsibility to pay child support.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Here’s the thing, if the state doesn’t do everything it can to pursue child support, the child, when they turn 18, can sue the state. \n\nSo, whether the child is wanted or not, both parents are obligated to contribute to the child’s well-being and must petition the state to be legally released from that obligation.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -8,
                      "content": "Don't know why you're getting downvoted. In a world of equality a woman's rights shouldn't supercede a men's. She has the right to choose to have that child or not. A man should have the right to be in that child's life or not. You can't just have it one way.\n\n'But he had sex with her and those are the consequences'. By this logic this applies to women too. So ban all abortions with exception for rape victims and medical reasons. Because it isn't fair that  only men have to live withe consequences of having unprotected sex.\n\nYou see what slippery slope this is? Nobody has the moral high ground here. \n\nYTA, OP, I'm sorry you're having infertility problems but that is coloring your view of the situation. They are both adults. She knew what he thought about having children and went ahead with it anyway. The responsibility is on her now.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Yes but what does any of that have to do with you?  You have no horse in that race.  Yta for inserting yourself into it based on your personal issues with fertility.  Whether or not he's an asshole isn't the question at hand",
              "id": 52,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Yeah, my mum wasn’t supposed to be able to get pregnant due to a multitude of factors - but hello! I also have a friend who fell pregnant with twin boys in spite of using the pill and condoms properly. Life will find a way, and that dude has a responsibility for the life he helped create. Dude should get a vasectomy if he’s so against having kids!",
              "id": 53,
              "comments": [
                {
                  "score": 7,
                  "content": "Am I your friend? Cause I also got pregnant with twins, despite pill and condoms (I joke that if I only used one form of protection it would have been a singleton)",
                  "id": 54,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Haha well if you’re not, you should be! I just peeped your profile and saw you’re active in the FFXIV community so we totally should be friends 😆 I just got to Endwalker!! So good, but idk how it can top Shadowbringers!",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -6,
              "content": "She could have aborted",
              "id": 56,
              "comments": [
                {
                  "score": 9,
                  "content": "In a case where both partners agreed to sex and agreed that they don't want kids:\n\nThe mother should be able to decide whether to abort the kid, give it up for adoption or keep it and the father should be able to terminate parental rights if she decides to keep it or be the 1st in line for adoption if she chooses that option.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 4,
                      "content": "You're gonna get down voted to oblivion for such dangerous talk!",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": -24,
              "content": "so technically based on that , the court process seems accurate. i would be po’d too if i was baby trapped. and it seems like yall were\nmainly po’d at the guy. if yall were really neutral, id understand . but emotions and struggles. yadda yadda. YTA.",
              "id": 59,
              "comments": [
                {
                  "score": 29,
                  "content": "EVERY time a guy do not wear\n any condom and/ or get snipped, he is leaving the desicion of him being a father or not to someone else.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Exactly. Both parties know that PIV sex causes pregnancy, period. It's mind-blowing that men think they can deliberately deposit gametes in the exact location where they need to be to swim up and meet the egg, and then somehow magically escape responsibility for the fact that those gametes DID swim up and meet the egg. It would be comical if it wasn't so sad.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "EVERY time a girl opens her legs without being on the pill and/or condom, she is leaving the decision of her being a mother or not on her ability to get an abortion",
                      "id": 62,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 38,
          "content": "[removed]",
          "id": 63,
          "comments": [
            {
              "score": 70,
              "content": "Right! As if he's not completely in control of where he ejaculated.",
              "id": 64,
              "comments": [
                {
                  "score": -25,
                  "content": "True, and if you do so under false pretense that's reproductive coercion, and still basically rape. Ultimately, it's up to the court.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 28,
                      "content": "People who believe they’re infertile can still sometimes and somehow get pregnant, it does happen. Happened to my mom with me, you don’t know that she lied.",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "He still had control over the situation by choosing to wear a condom or not.",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Since support is the child's right, the court isn't going to absolve him of the responsiblity to pay child support.  He can sue for custody, and if he wins, she'll be ordered to pay child support.",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -71,
                  "content": "He was raped, let's blame him.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 32,
                      "content": "He wasn't raped jfc. You're making the word mean useless if you use it for shitty things like this.",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "?",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "He still had control over the situation by choosing to wear a condom or not.",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -5,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 73,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 34,
          "content": "lol you are obviously are 12 and don't know how child support works/ or the human body. lots of women are told they can't have kids and then have unplanned miracle babies. but yes, she's trying to \"entrap\" this dead beat loser",
          "id": 74,
          "comments": [
            {
              "score": 36,
              "content": "I had a horribly traumatic miscarriage that resulted in uterine scarring, followed by a tubal pregnancy in my mid-late 20s.\n\nThe OB who took care of me following the tubal pregnancy told me I would never have kids because of the extent of the scarring. She’s an excellent doctor & I had no reason to question that. \n\nI used protection until I met my sons father (we both wanted children, thought I couldn’t have any, & made the choice to see what happened). \n\nThe OB who put my IUD in after my sons birth & another miscarriage that required a D&C to complete, when my son was 6 months old (I was on the patch) laughed because he used to work with impoverished women in Africa & said the scarring was “minimal” & wouldn’t actually impact my fertility. \n\nGuess I shouldn’t have trusted the first OB.",
              "id": 75,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "Not necessarily. I had 4 miscarriages and was told over and over(from 12-26) that I would NEVER be able to have kids eBay my reproductive system had to much damage to support a pregnancy. \n\nI now have a 5 year old birth control baby.",
          "id": 76,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "They are both adults in their 40's who presumably know how sex works. No one forced them to go raw. They chose to gamble and are equally responsible.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Do you have any idea how many times doctors have been wrong? My cousin was told by 4 doctors she would never be able to conceive let alone have a child. She was told that for 10 years. She is now the proud mother of 6.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Realize, just because you believe you can't get pregnant, you certainly can.  As a former pastor, I can assure you it happens a lot--for good and ill.  If you don't want kids, you do you part and use protection or don't have sex.  Otherwise it's the same as driving drunk and killing someone.  Or shooting guns in the air and a falling bullet kills someone.  There is no such thing as baby-trapping.  Only people who are sex and want to pretend the shouldn't have consequences.",
          "id": 79,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 78,
      "content": "ESH. YTA bc Frank isn't your friend and you should have kept your opinion to yourself. Your boyfriend is TA because he shouldn't make you hang out with people you don't want to. Frank is TA for busting inside of a woman with no intention of being a father, should pregnancy occur. \n\nI'm not going to say Marlene is the asshole bc I know people who \"couldn't have kids\" and then did. Miracles happen and you should toaster strudel, not twinkie, to avoid it.",
      "id": 80,
      "comments": [
        {
          "score": -60,
          "content": "Well if a woman can have an abortion, why cant a man terminate his parental rights?",
          "id": 81,
          "comments": [
            {
              "score": 46,
              "content": "Generally he can terminate his rights, but that usually doesn’t absolve him of paying child support unless he’s terminating so someone can adopt. Let’s face it the whole process of pregnancy is unfair- that’s why it works like this. If pregnancy was fair or equal “ie” a woman lays an egg, this would be a different situation.",
              "id": 82,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "[deleted]",
              "id": 83,
              "comments": [
                {
                  "score": -6,
                  "content": "And how do you hold women responsible if they get an abortion if the father didnt want one?\n\nIt sounds a bit crueler saying that.\n\nBut you could think of the man as a sperm donor.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 35,
                      "content": "It's simple. It's her body. It's her life at risk. Not the male. Men can control where the fuck they put their dicks, but at no point in their lives are they at risk of dying in childbirth or even before.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "[deleted]",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "In my state, if you don’t want a living, breathing miracle person on your property and you tell them to leave and they don’t, you can shoot them. And kill them. Just to protect your LAND. \n\nIf that person is INSIDE YOUR BODY, and cannot exist outside your body, you ought to have the right to terminate its life to protect yours. Otherwise we’re giving men rights we aren’t giving women. \n\nSorry you hate that but it’s true.",
                      "id": 87,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "[deleted]",
              "id": 88,
              "comments": [
                {
                  "score": -40,
                  "content": "Yeah, and the man wanted to terminate his rights? He’s not much different than a sperm donor.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Except he is very different than that.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Because once the human exists, it has both a mother and a father responsible for creating it.",
              "id": 91,
              "comments": [
                {
                  "score": 2,
                  "content": "Sure, and what if one didnt agree to kids?",
                  "id": 92,
                  "comments": [
                    {
                      "score": 8,
                      "content": "He did agree to kids. \n\nThe only method of not agreeing to kids is use of birth control. If she told him she can’t get pregnant and he never questioned that, then that’s one him.",
                      "id": 93,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -12,
              "content": "We are both going to get downvoted but I agree with you. A woman gets to decide whether or not she will be a parent. I think a man should get to decide whether or not he will be a parent as well. (and I am a woman myself before someone says it)\n\nWhile *no one* should ever be able to force anyone to have an abortion, I don't think it's right to force parenthood either. He informed the woman that he does not want a child, and probably informed her that he does not want to be involved with it as she got pregnant. She still decided to have the baby. That's her call, and she has a right to make it. But then I think he should have the right to not be involved.",
              "id": 94,
              "comments": [
                {
                  "score": 13,
                  "content": "It’s not the same. \n\nA woman can terminate a pregnancy to protect her life. The man’s life is never endangered by the pregnancy or child. Just his money. He should be responsible for paying for the life he created just like a woman would be responsible for paying for the life they created. It’s already fair that way.",
                  "id": 95,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 0,
                  "content": "He should go and get a vasectomy if he’s so hell bent on this. He chose to not use the condom.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 1,
                      "content": "He probably did want to use a condom but she informed him that he doesn't need to as she can't have kids. How else would the topic have come up? Doubt he asked if she's sterile lol.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 40,
      "content": "ESH. Infertility isn’t a smart method of birth control. I know so many people who’ve relied on infertility as birth control and most are parents to unplanned children. The fact that they reproduced has nothing to do with you. Just because you haven’t gotten something that you simply want doesn’t mean you get to lash out.",
      "id": 98,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 31,
      "content": "YTA. Experiencing fertility issues is hard, but that is not Frank‘s problem. Letting out your own frustrations on him was an AH move.",
      "id": 99,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 28,
      "content": "YTA. So everyone was having a nice evening until you decided to take out your own fertility issues on Frank.\n\nIs Frank married? Or is the woman you called his side piece his partner?",
      "id": 100,
      "comments": [
        {
          "score": -26,
          "content": "Yes\nAnd no it was the chick he was trying to get with that night.",
          "id": 101,
          "comments": [
            {
              "score": 9,
              "content": "You are soooooo jealous and bitter lol.",
              "id": 102,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 26,
      "content": "Info: had she, in fact, less to him about her ability to get pregnant? Are you saying he's lying about her lying? I'm confused",
      "id": 103,
      "comments": [
        {
          "score": 29,
          "content": "He told me tonight she said she couldn’t get pregnant. \nWhen she talked about it after the fact, when he was still in the picture, she was more in shock and excited because she was under the impression that she couldn’t because her and her three previous partners tried.",
          "id": 104,
          "comments": [
            {
              "score": 54,
              "content": "Then definitely YTA. Holy fuck.",
              "id": 105,
              "comments": [
                {
                  "score": 19,
                  "content": "For the record, the previous comment indicates she didn't lie.\n\nShe shared with OP the same information she shared with Frank, that she was under the impression she was infertile - she may not have included every excruciating detail - but this could include a medical opinion considering her reproductive history.\n\nSounds like two fertile adults who were honestly mistaken about the risk involved? You can still break a law you had a mistaken understanding of - our knowledge doesn't always reflect reality - and they both remain equally accountable for the reality of this conception.",
                  "id": 106,
                  "comments": [
                    {
                      "score": -2,
                      "content": "No; there's a difference between saying you're infertile and saying you can't get pregnant.",
                      "id": 107,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "So she didn’t even have medical confirmation and just assumed? Yeah bro, Frank’s still kind of stupid for thinking nothing would happen, cause there is ALWAYS a chance, but still, Marlene had sex with him under false pretenses.",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "YTA - unless the other woman is like your sister of something the entire situation is none of your damned business, your infertility and feelings about it are likewise not his concern. Quite frankly you shouldn’t set yourself up to be moral judge on anything but a social networking site like this one. Who made you the arbiter of moral and ethical decisions and who gave you the right to vent your spleen on someone else unasked for. Maybe just stay in your own lane and hope other people don’t judge you too harshly.  \n\n\nEdit: also people who say ‘you know why’ In response to questions about why something has happened / is happening are automatically a-holes.",
      "id": 109,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 11,
      "content": "YTA. You are mad at him not because he's a deadbeat, but because he has something you can't have, and doesn't value it. If he was lied to, that isn't okay. Sexial coercion is not alright. You and your husband need to make some decisions, without co--optong this situation.",
      "id": 110,
      "comments": [
        {
          "score": 1,
          "content": "I'm glad somebody has the brains to see it. I see way too many men getting victim-blamed after being lied to for sex and put in a position that they wouldn't have consented to if they knew.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}