{
  "post content": "Let's get this out of the way first, my husband and I are currently separated and we are getting divorced. I'm going to file in a week or two, and we've been living separately since I was 6 months pregnant. \n\nWhy you ask? A pretty common occurrence - He was having an affair with a woman and he gave me the ILYBINILWY talk after I caught him. No, he didn't confess. I was suspicious about his late night office hours and tracked him down at his office, only to find him missing. I waited for 3 hours, all alone, and then I saw them both arriving at the office. She was hanging on to him, they kissed inside his car. That's where I confronted both of them. She was crying, and he went on to console her saying it wasn't her fault. \n\n\nThat was 4 months ago, and I moved out of the house heavily pregnant. I moved to a friend's home he didn't know about, and for the next 4 months, I didn't have any contact with him. (My choice) \n\nI didn't inform him when I went into labor. My sister and best friend were there for me. I gave birth to my healthy baby boy and named him after my childhood sweetheart Daniel, my first love, who sadly passed away when he was 20 from leukemia. It was the most heartbreaking thing that ever happened to me. It affected really me bad. \n\nI lost 40 pounds in a month and had to be hospitalized. I still have a hole in my heart, a part of me was lost forever the day I lost him. It took immense therapy and counselling to cope with the grief. I met my husband 6 years later. He was the first guy I fell for after Daniel. We got married 2 years later and after 3 years of marriage, we got pregnant with our first child. \n\nI wanted to wait a few more years, but it was he who pushed for a baby. My husband's name is Phillipe and in his family , the firstborn sons are always named after their father, so we decided to name him Phil. \n\nHowever, after our separation I started experiencing Daniel's presence around me. I was a mess, but I saw dreams where Dan would talk to me and tell me that everything would be okay. \n\nHonestly, I feel like Dan's spirit has helped me heal and gave me strength to cope with the breakdown of my marriage. When my boy was born, I named him Daniel. His middle name was after my grandfather, and I gave him my last name. \n\nA month later, I contacted my husband and informed him that his son was born a month ago, and that I was going to file for divorce and to chalk out any visitation if he wanted. I had him blocked everywhere for a month. \n\nThe same day, I reactivated my Facebook and announced the birth of my son with his full name. \n\nMy husband called me up crying and furious, and told me that I had  no right to name HIS son after \" some dead guy I fucked \". His family thinks I'm the devil incarnate, and even my mom thinks I went too far. \n\nI'm losing my mind here. \n\nAITA?\n\n\n*******\n\n\nTo the people wondering, I'm not going to deny my husband a relationship with his son. We'll come to a custody or visitation plan once we get a court order. For now, he is free to visit his son whenever he wants. The rest would be his choice.\n\n\n**********\n\n\nTo people asking me if It was his choice to go no contact and whether he tried to contact or find me. No it wasn't his choice and he DID try to find me, but he was informed that I was safe and that I would reach out to him once I was ready. \n\nWhy did I stay away from him and didn't tell him about the baby for one month? \n\nMy emotions were a wreck and I didn't want to see him or talk to him. I was incredibly toxic to be around, going through hell mentally ,emotionally and physically. I didn't want anything to do with him. I also wanted the first month of my son's life to be a peaceful bonding experience for me and my son.\n\nWas it for my mental health? Yes. \n\nWas it selfish? Yes.\n\n************\n\nTo remind everyone, Daniel isn't just my dead ex, my former boyfriend, my old lover, my ex boyfriend. \n\nHis memory is the reason I pushed myself to eat healthy and be ALIVE to survive my pregnancy and give birth to my son. He is my spirit angel looking after me from heaven, and that's why I named my son after him. He was taken from me by fate, but he will always be there looking out for me and my baby. \n\n\n**edited**",
  "id": 1,
  "comments": [
    {
      "score": 20651,
      "content": "NTA. He cheated and left you while you were pregnant. Of course it's still his son, but giving your baby the name of the man who cheated on you (while you were carrying his son) is asking too much. Daniel is a lovely name and I'm sorry for your loss.",
      "id": 2,
      "comments": [
        {
          "score": 8089,
          "content": "Please don’t think you were selfish. You’re not. Your ex lost all rights to that silly name tradition when he cheated. His fault and his problem. Not yours. Congratulations on your baby boy!",
          "id": 3,
          "comments": [
            {
              "score": 6025,
              "content": "Plus Daniel is a much better name than Phil",
              "id": 4,
              "comments": [
                {
                  "score": 1093,
                  "content": "This 👆👆\n\nEdit: Holy crap my karma just exploded 0.0",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 530,
                  "content": "I have never known a Phillipe that went by Phil. Phillip yes.",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 398,
                  "content": "Yeah, fuck Phil, Daniel is way better \n\nSource: my name is Daniel",
                  "id": 7,
                  "comments": [
                    {
                      "score": 100,
                      "content": "Can confirm: while idk this Daniel, my husband's name is Daniel and he is pretty amazing.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 359,
                  "content": "Liams aren't usually too bad, but Phils are tough.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 219,
                      "content": "[I understood that reference!](https://m.youtube.com/watch?v=ENxbcvUXfnM)",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "NEVER been so proud to understand a reference in the wild.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "What about Philliams?",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 222,
                  "content": "Can confirm\nSource: am Daniel",
                  "id": 13,
                  "comments": [
                    {
                      "score": 46,
                      "content": "Can confirm Daniels are awesome: I am Iron Dan.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Agreed. Hehe That's my current bfs name and he is very kind, loving, and a sweetheart. I hope your child has the good qualities that name seems to carry. :)",
                  "id": 15,
                  "comments": [
                    {
                      "score": 7,
                      "content": "hey!!! my bf is a daniel too!! he is the sweetest thing on earth 🥺 daniels make for the best boyfriends!!",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I second that!!",
                  "id": 17,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Name checks out.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Lol. I have a brother named Daniel and a brother named Philip (Phil.) FWIW, I love them equally.",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "I’ve never even heard of a baby named Phil",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "HEEEEEYYY that's my name! Don't trash my name because some other dude is a dick!",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1051,
              "content": "And he can name the son he has with the woman he was fooling around with after him.",
              "id": 22,
              "comments": [
                {
                  "score": 344,
                  "content": "Unless he cheats on her once she’s pregnant! Maybe it will be a girl and she can name it after OP",
                  "id": 23,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Then he can name her phillipa",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 152,
                  "content": "Yes! This if he complains tell him this.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "Agreed!",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "NTA\n\nPiggybacking to say that maybe the new person he's fucking will give him a namesake, because you're under zero obligation to.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4530,
          "content": "Suggestion for your facebook page and relatives:\n\nI won't name my son after a cheater.  Naming is for honoring people with integrity only.",
          "id": 28,
          "comments": [
            {
              "score": 542,
              "content": "She won't name her son after a PHILanderer.",
              "id": 29,
              "comments": [
                {
                  "score": 90,
                  "content": "Plot twist: all of the men named Phil in his family were philanderer's except the first one.",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Nice!",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I want to upvote this 1000 times!",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 488,
              "content": "Oh I like this. Hint of petty with a whole Lotta truth!!",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 298,
              "content": "She doesn’t need to explain anything. Sometimes remaining silent is the most powerful answer of all. \n\nIt lets these people know that you don’t need to justify anything for approval.",
              "id": 34,
              "comments": [
                {
                  "score": 329,
                  "content": "That’s all well and good, but who knows what he’s been telling people in her absence? Does his family even know he cheated? Whatever he’s told them he’s most likely painted himself in the best possible light and OP in the worst. Maybe they’d take her side if they heard it.",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 177,
                  "content": "OP doesn't explain if her ex-husband's family is even aware of his cheating. I would think they'd only be exclusively on the ex's side if they were lied to by the ex and not given the full story. Family or not, decent people wouldn't care about losing naming rights, maybe even call him out for being the one in the wrong, but that's if they're aware. Right now, OP is an open target for harassment if she stays quiet.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 218,
              "content": "So much this.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Perfect",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "“When I hear Phil, I think philanderer, and I have better hopes for my son.”",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Absolutely. By naming her son Daniel, OP gave her son a Moral Compass facing magnetic north. His name gives him a chance to be a better man than his father and he’s not even a month old.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "That goes for first names and last names. He's already bounced on them both he doesn't get any name",
              "id": 41,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 595,
          "content": "He can name his son with his mistress after himself. NTA",
          "id": 42,
          "comments": [
            {
              "score": 14,
              "content": "My first thought.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Most underrated comment in this entire thread. Bless up.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yup",
              "id": 45,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 369,
          "content": "Absolutely this\n\nNTA- after the shit he put you through you had every right to do what you did. Just because you kept the baby away from him for a month doesn't really mean anything he cheated on you while you were pregnant & with everything else going on you needed the break after the birth. Why on God's green earth would his parents think you would name the child after the father that cheated on you is beyond me.\n\nMost definitely NTA- Congrats & good luck moving forward.\nAll the best to you & your baby Daniel. PS lot better name then Phil the cheater.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 263,
          "content": "To that I would add this: naming someone after someone else like that is meant to carry on a legacy. You are supposed to grow up to be as great as the one you we’re named after. With that in mind, good on you for not naming him after the father, with the implication therefore that he should follow his fathers footsteps in being a lying cheat. NTA",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "This right here.. having to loving say the name of the man who callously cheated on you is too much.  If Phil doesn't like it, he can sign away his rights and knock up his side piece.\n\nOP you may want to talk to someone to make sure you are legally covered.  You can't put it past your soon-to-be ex or his family to try and change it somehow.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Yup. He can give his name to the son with his lover.\n\nNTA.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I wish I could give this comment an award. Too poor so here’s an upvote. NTA! If Phillip loved you and cared about your son he would be fuc*** another woman while you were pregnant.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "NTA. Daniel is an awesome name lmao. Sorry for the loss!",
          "id": 51,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10813,
      "content": "I feel like the important part that a lot of people are missing here is that it's not just \"the name you agreed on\"... it's literally the name of the man who was banging his coworker while you were pregnant with his child. I mean, if you guys had agreed to call the kid Bobby or something, then yeah, maybe a little bit TA for not letting him know. But regardless of what type of dad he turns out to be, while this child was still being carried, he was an unbelievably shitty father and I can't believe anyone would think you're TA for not saddling this kid with his cheating dad's name. NTA so hard.  \n\n\nEdit: Thank you kind stranger, etc",
      "id": 52,
      "comments": [
        {
          "score": 4625,
          "content": "Considering how the last Philippe turned out, maybe it's good that the line stops with him.",
          "id": 53,
          "comments": [
            {
              "score": 751,
              "content": "Ooof. But yes",
              "id": 54,
              "comments": [
                {
                  "score": 197,
                  "content": "[removed]",
                  "id": 55,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Triple oof",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 260,
              "content": "Dayum. 100%. NTA. Fuck cheaters.",
              "id": 57,
              "comments": [
                {
                  "score": 162,
                  "content": "No, don't, that's how we got into this mess!",
                  "id": 58,
                  "comments": [
                    {
                      "score": 36,
                      "content": "Haha",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "The woman he was in that car with can try for a Philippe Jr., presuming Sr. doesn't bounce on her once precious name-bearer is in the oven.",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "I mean yeah, if you fuck around on your pregnant wife, you lose naming rights.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Besides the fact that how the father( Phillipe the umpteenth) behaved towards the mother, he lost the right to be “ honoured “ in the child’s name",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "*”... the last Philippe ...”*\n\nI don’t know why but I laughed out loud!",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "LMFAOOO",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 133,
          "content": "100% this",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "I have nothing to add. This was a perfect response.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Exactly, how do you explain to a kid that they're named after their father and not together? Like how is the kid going to feel when they grow up to be named after a man who cheated?",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "That and said cheating arsehole husband didn't care that OP wanted to wait for a kid, he forced her into getting pregnant, THEN cheated on her while she was pregnant with said child...",
          "id": 68,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4920,
      "content": "NTA. If he wanted naming rights, he shouldn't have screwed around on you while you were pregnant, holy shit!   Surely his family also has a tradition of not having affairs while your wife is carrying the firstborn son.",
      "id": 69,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4754,
      "content": "NTA, he lost any right to complain when he left you to fuck some other woman. His family traditions don't apply now that he's made it clear you aren't his family.",
      "id": 70,
      "comments": [
        {
          "score": 3198,
          "content": "Interesting that he wants OP to honor an agreement, when he couldn't honor his marriage vows.",
          "id": 71,
          "comments": [
            {
              "score": 445,
              "content": "Dead ass. Funny how it works that way!",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 165,
              "content": "Oh that’s a good one I hope OP sees this",
              "id": 73,
              "comments": [
                {
                  "score": 187,
                  "content": "I kind of can't believe he expected her to just stick to the plan like he didn't destroy their marriage. That was the plan when she thought she had a happy marriage and a faithful husband.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "🏅",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 224,
          "content": "He can name his next son with his next wife after himself",
          "id": 76,
          "comments": [
            {
              "score": 134,
              "content": "Spoiler alert: He cheats on her while she’s pregnant and she also chooses a different name.",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 174,
          "content": "Also the dude was consoling his mistress instead of his wife, can you believe this dude....",
          "id": 78,
          "comments": [
            {
              "score": 44,
              "content": "This! That was the part that made my head want to explode. Sooo NTA here.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "Traditionally, one rarely names one's child after its sperm donor. \n\nAt this point that is the tradition that applies here.",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "This!",
          "id": 81,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2425,
      "content": "NTA. Your soon-to-be ex cannot eat his cake and have it too. He can’t fuck another woman and have his firstborn with the wife he is discarding be named after him.",
      "id": 82,
      "comments": [
        {
          "score": 309,
          "content": "Thank you for actually getting this quote correct",
          "id": 83,
          "comments": [
            {
              "score": 174,
              "content": "To be honest it makes way more sense that way. Huh.",
              "id": 84,
              "comments": [
                {
                  "score": 56,
                  "content": "How's it normally said? Because it makes just as much sense as it always has to me: not at all, because you can't eat your cake if you don't have it.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 344,
                      "content": "It's normally said \"You can't have your cake and eat it too.\" That ordering makes it less clear, because most people will look at that and go \"But... Don't you have to have cake in order to eat it?\" but when presented as \"Eat your cake and have it too,\" it makes it more clear that you can't simultaneously enjoy eating your cake, and continue to have it exist in front of you afterwards. You can either eat it, or continue to have it there. But not both. \n\nOrder of operations is the best way I can describe that.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 75,
                      "content": "\"You can't eat your cake and have it to\" means that once you eat your cake then you no longer have any cake\n\n\"You can't have your cake and eat it to\" doesn't really make sense as a saying because you can have your cake then eat it (you still don't have any after you've eaten it, but you're not saying that if you say the phrase this way.",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I assume you’ve seen the Unabomber miniseries?",
              "id": 88,
              "comments": [
                {
                  "score": 2,
                  "content": "Ha! That was my first thought as well",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "He can get his mistress pregnant and name that child after him! Uggg",
          "id": 90,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1239,
      "content": "NTA he made his bed, he can lie in it.",
      "id": 91,
      "comments": [
        {
          "score": 254,
          "content": "Well technically hes prolly laying in his side h*es bed",
          "id": 92,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1023,
      "content": "NTA\n\nIt is an unfortunate imbalance in nature that in species like ours, the baby carrier really has to do the most work, experience the pain, and face the risks of having a child. While I agree that fathers' opinions matter, in the end this is your child that you grew in your body. Your ex can still be a father, if he wants, but for things like names and immediate after-birth decisions, that's 100% yours to control.\n\nPlus his name tradition is stupid and sexist anyway because it treats you as an incubator, not a person, and the child like an extension of the parents, not an individual. And that it's only for male children too. But that's for another thread.",
      "id": 93,
      "comments": [
        {
          "score": 301,
          "content": "Yes, so much this. I especially love how OP gave the baby her last name too. I think more single mothers need to do this. No more honoring shitty absent fathers.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 901,
      "content": "> He gave me the ILYBINILWY talk\n\nWhat in the blue fuck is an Ilybinwilly...?",
      "id": 95,
      "comments": [
        {
          "score": 1191,
          "content": "Welsh.",
          "id": 96,
          "comments": [
            {
              "score": 263,
              "content": "Not going to lie, I'm Welsh and I initially read that out phonetically like a Welsh word and was a bit confused haha.",
              "id": 97,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 133,
              "content": "Underrated comment.",
              "id": 98,
              "comments": [
                {
                  "score": 69,
                  "content": "Can you explain the joke I want to laugh too",
                  "id": 99,
                  "comments": [
                    {
                      "score": 90,
                      "content": "[Check out the name of this Welsh town](https://www.businessinsider.com/welsh-town-has-the-longest-name-in-europe-2015-9)",
                      "id": 100,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 55,
                      "content": "To English readers, Welsh words often have seemingly extra consonants and an over-use of the letter ‘y’. So, the joke is that ilybinilwy looks like it could be Welsh.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 104,
              "content": "I’m half welsh but don’t know the language and I actually believed this was a serious comment for a second there",
              "id": 102,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "I wish I could give you a medal 😂",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Awesome",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1092,
          "content": "' I love you but I'm not in love with you ' .",
          "id": 105,
          "comments": [
            {
              "score": 496,
              "content": "Ahhh gotcha.\n\nNTA btw, your husband can take a long walk off a short pier.",
              "id": 106,
              "comments": [
                {
                  "score": 13,
                  "content": "Yeah, jeeze",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 93,
              "content": "I usually woosh at these but for some reason I picked up on this one with context clues.",
              "id": 108,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 79,
              "content": "Why is it so hard for people to type out actual words???",
              "id": 109,
              "comments": [
                {
                  "score": 132,
                  "content": "Because ossaataektanmhloiis. Obviously.\n\nOnce someone sees an acronym they assume everything knows that acronyms no matter how long or indecipherable it seems.",
                  "id": 110,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 318,
          "content": "\\*I love you but I'm not in love with you.\\*  \n\n\n Code sentence for, \"I'm cheating and fell in lust with someone else.\"",
          "id": 111,
          "comments": [
            {
              "score": 91,
              "content": "but I'm still a good person, so you shouldn't be mad.",
              "id": 112,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 45,
          "content": "I love you but I'm not in love with you",
          "id": 113,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 36,
          "content": "Took me way too long to find this comment. I spent a good deal of time stuck on that part white reading",
          "id": 114,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 710,
      "content": "[deleted]",
      "id": 115,
      "comments": [
        {
          "score": 267,
          "content": "This should be top. I totally get why she didn't name the kid after her husband, and her assholery is somewhat justified by how awful it must have been to be cheated on. BUT she kept the dad away from the child and didn't even tell him that he was born! For a month!!! That's an asshole move for sure. Not to mention what others have said about how the dead boyfriend naming is going to affect the child and the relationship he'll have with his father.",
          "id": 116,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 249,
          "content": "The replies on this post actually shocked me. I really can't believe the amount of people justifying her actions, and how many people with different opinions are getting downvoted into oblivion. \n\nNo one is saying she's an asshole for not naming the baby after the father. No one is saying her husband's a good guy for cheating. No one is saying finding out your husband is cheating while pregnant isnt incredibly stressful. No one is even saying she needed to invite him into the hospital or say when she was in labor!\n\n\nDespite what her husband did, he is still the father of that child. Keeping the baby from him for an entire month is absolutely wrong. That is his kid too, even if he is a mega asshole for cheating.\n\nThe name thing as well, the father still deserved SOME input. It's totally fine if she refused to name the baby after him due to what happened, but he still deserved some choice. That is his kid too. He betrayed the relationship with OP, he didn't give up his rights as a parent.\n\nIn another comment OP says she doesn't plan on co-parenting but \"parallel parenting.\" I totally get OP is hurt. I've been cheated on. I am also a mother too. But that baby has two parents and OP cannot just decide that she rules everything involved with the child, and refusing to co-parent is only going to make that kid's life harder. OP has clearly already decided it's fine to weaponize this baby because she's hurt, and that's really not okay.",
          "id": 117,
          "comments": [
            {
              "score": 197,
              "content": "[deleted]",
              "id": 118,
              "comments": [
                {
                  "score": 59,
                  "content": "Yes I absolutely agree and I think this is being overlooked because her husband cheated. So people are justifying everything she has done because she has  been hurt. And while I absolutely feel for her the child ultimately has to come first.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 152,
          "content": "It's [parental alienation](https://en.m.wikipedia.org/wiki/Parental_alienation), and it is absolutely devastating to both the alienated parent and more importantly **it hurts the child.** All the comments saying she's not TA are just \"u go girl!\" style comments to say fuck the cheater. They miss the point that OP is weaponizing the child, which is pretty fucked up and will no doubt have long lasting negative effects on the child. \n\n/u/firstloveimmortal",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Thank you!  I’ve been downvoted other places for saying this. I get having a child is difficult physically and mentally and the OP had to deal with a lot. She also chose to keep her child from its other parent. This baby isn’t just hers and she doesn’t get to unilaterally make all the decisions. Her choices will only hurt her child.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "He fucked a co-worker and dipped on the family, that was going to cause conflict anyway. At least this way the name was someone she respected. \n\nI don't have a problem with her keeping the baby to herself for a month, she is a primary caregiver in an extremely fragile state post partum. The time will come to have him involved now isn't. Her mental health is a priority over and above his desires because she is the one doing all the work. What's she had to do to cope is fine.  He can't of been THAT disconnected if he saw her Facebook",
          "id": 122,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 510,
      "content": "NTA. If he wanted the baby named after him maybe he shouldn’t have cheated while you were pregnant. \n\nAlthough I am wondering why it was a month before you told him the baby was born? Had you not spoken at all since you found out he cheated? Did he not ask about your pregnancy at all during that time?",
      "id": 123,
      "comments": [
        {
          "score": 128,
          "content": "She blocked him, until a month after when she announced to everyone and him.",
          "id": 124,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 68,
          "content": "He was trying to find her, she was in hiding.",
          "id": 125,
          "comments": [
            {
              "score": 62,
              "content": "A lawyer probably would have helped, if he was interested in getting custody.",
              "id": 126,
              "comments": [
                {
                  "score": 35,
                  "content": "He didn't know where she was. She can't be served if he can't find her. Private investigators are expensive. \n\nMake no mistakes, I think the guy is an AH.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 56,
                      "content": "She hadn’t vanished. Her family knew where she was. It would have been very easy for him to get access to his child, in a legal manner, if he wanted it.",
                      "id": 128,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "I waited a month after the birth of my son before telling his father because he was abusive and I had gone into hiding to give birth. He had been trying to find me for several months, I had let him know that I was fine but not coming back (I literally escaped from him) and then had to have an early c section because he was stalking the hospital. Nurses were wonderful and lied for me when he called (while I was there). Long story short taking a month to recover before contacting asshat exes is totally fair.\n\nNTA OP, your actions are totally understandable",
          "id": 129,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}