{
  "post content": "So, during the quarantine my brother (33M) and his girlfriend Melanie (32F) were staying at home with us and that was fine, at first. I told them to sleep in my bedroom, since I have a double bed and he doesn't, and they accepted it. My brother doesn't have the bigger room because he left home years ago to live with his then girlfriend, so when he came back he got the smaller room. The problem started when they decided to STAY in my room like... forever. They stopped asking me if they could and slowly started moving their stuff. He said once jokingly that I had the room during the day and he had it during the night, but the thing is - THAT'S NOT EVEN TRUE!! My mom stayed in my room during the day because it was \"more quiet for her to work\" and I couldn't use my bedroom for literal MONTHS because every time I would say anything to my parents they quietly told me to suck it up and \"they're going to move out soon\". I couldn't even use my bathroom and had to move my stuff to the half bathroom downstairs. They eventually left and I got the room back. \n\nAfter the pandemic, I moved to another place country and started college there. My parents also moved and now they live in a coastal city to enjoy their retirement. I'm coming home for christmas and so is my brother, his now wife Melanie and their 18 month old baby, Annie. I love my brother and SIL, I love my niece even more, but when my brother started saying shit like \"don't settle into your room just yet\" and \"don't worry, we'll make good use of it\", I lost it. I was so mad, I screamed at him (we were on a facetime call) and melanie also got mad at me, saying that they NEEDED the room way more than I did, because of Annie. I said that if that was the problem Annie was welcome to sleep in my room with me but they can sleep separately for once and suck it up. My brother said I was being a selfish bitch and was going to sleep alone in a double bed while one of them would have to sleep in a mattress on the floor, and said I couldn't take care of Annie properly. I said \"Well I had to deal with you, an adult sized toddler who throws tantrums when he doesn't get his way, my whole life, so I think I'll be fine\". Both my brother and Melanie blocked me and they told my parents. My dad actually defended me and said that it isn't fair for them to take my room when I'm only staying for 2 weeks, but my mom said I was being a brat and it wouldn't kill me to lend my room for some days, since it's not like I'm living there.\n\nI feel bad for snapping at my brother but I also don't want to give up my room, the little time I have home I would like to spend there.\n\nAITA?\n\nEDIT: Sorry for the missing info, I'll try to clear this up: this is the house I grew up in, my parents moved but we are all going back for christmas with the family. \nMy room was never my brother's, I was trying to explain why he had the smaller room since he is the older brother. \nIf they took my room, I would be sleeping in the office, not another room. Grandma is staying and obviously she gets the other room, sorry for the confusion everyone.\n\nall that said, I do think I might have overreacted lol thank you for bringing some sense into me, I think that because my brother sometimes acts entitled it triggered something in me from last time they did that. I'll let them have the room for baby Annie.",
  "id": 1,
  "comments": [
    {
      "score": 52,
      "content": "Ugh, I so want to say not TA because I hate people like your brother and SIL who think couples get priority just by virtue of being couples. They are definitely being AHs.  If you were posting this during the middle of the pandemic when you had been kicked out of your room, I would say they were the only AHs here.\n\nThat said... \n\n>My brother doesn't have the bigger room because he left home years ago to live with his then girlfriend, so when he came back he got the smaller room.\n\nSimilarly, you have since moved away and so this is no longer your room to claim, either.  It's your parents' house and they can make the room assignments as they see fit. \n\nPersonally, I'd rather sleep in a smaller room alone than in a bigger room with my 18-mo. niece. That sounds like a surefire way to be assigned childcare responsibilities on top of everything else.\n\nESH.",
      "id": 2,
      "comments": [
        {
          "score": 14,
          "content": "I think I agree with you the most, you are very rational hahah",
          "id": 3,
          "comments": [
            {
              "score": 3,
              "content": "I think that is very rational but I would I would explain to both your brother and his wife is “when I originally let you stay in my room it wasn’t supposed to be for such a long time. And now you act entitled and with no appreciation and it hurts my feelings. The fact is it was my room and I like to stay in it sometimes and without even thinking about me or my feelings you decide that you needed more and then call me names about it instead of at least acknowledging that I might have some feelings or want to stay in there sometimes.”\n\n“I understand it works better and it’s not like I want you to be uncomfortable. And you know how much I love my niece, but as far as how you handled it and how entitled you were, that hurt me very deeply so I guess you need to decide now that you have what you need if you even care about what I feel.”",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16,
      "content": "Nta but your bother his wife and your mom is!\nMaking comments antagonizing a response just because you start a family doesn’t mean you get to impose on everyone else if it was such a big deal why not get a hotel room of their own and honestly why would you have people over when you have to force one child out of their space(I know your at collage I say your room because your father acknowledges it’s your room) it’s rude and inconsiderate maybe if he hadn’t made those comments it wouldn’t be such a big deal but he had to rub it in your face and be an AH about it",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "NTA.\n\nThese people are thankless and demanding and rude. Any one who reverts to calling someone a little bitch is never on the right side.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "I’m torn here. For one, you moved out so is it technically your room then? Sound alike you’re still mad that they took over your room the first, which I can understand. That was unnecessary at the time, but you didn’t do anything really about it either. You say you’re staying 2 weeks, how long are they staying? It would be maybe a little selfish to spilt the 3 of them apart imo. And I’d personally rather not have to be responsible for my 18 month old niece on my break from school, especially since she may get up through the night or not be as settle being that she’s in a different house then her own. But I think this all goes back to them just taking over you room the last time",
      "id": 7,
      "comments": [
        {
          "score": 3,
          "content": "they are staying for longer than I am, they plan on staying for 20 days",
          "id": 8,
          "comments": [
            {
              "score": 2,
              "content": "I’m curious if the dynamic of the whole situation. You’re parents moved since the last “room” incident, have you moved to the new house with them all that since you live somewhere else for college?",
              "id": 9,
              "comments": [
                {
                  "score": 1,
                  "content": "yes I have, we all moved to the coastal city but the house we're going for christmas break is the same one as the pandemic incident",
                  "id": 10,
                  "comments": [
                    {
                      "score": 1,
                      "content": "yes I have, we all moved to the coastal city but the house we're going for christmas break is the same one as the pandemic incident\n*all except my brother cause he married",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I don’t consider going to college to be moving out. That’s not a permanent residence away from home. You still come home for holidays and longer breaks, like summer. This may be partly cultural on my part, as where I live, most parents (if they have the room) keep their children’s rooms during college. If they’re planning to give a  larger room to a child still living full-time  at home, then belongings would be swapped and child who was only home 14-18 weeks of the year might get a smaller room.",
          "id": 12,
          "comments": [
            {
              "score": 3,
              "content": "same!! where I'm from its pretty common for parents to keep our rooms, idk if that is weird for other cultures I never thought of it hahah",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I’m genuinely curious how the dynamic works here. OP moved out to go to college and in the meantime her parents also moved to a new house. So the bedroom in question isn’t even really existent right now, but that’s why I asked.",
              "id": 14,
              "comments": [
                {
                  "score": 2,
                  "content": "With op, I’m assuming they took OP’s double bed and belongings with them and deposited them in some room in their new house. Then brother decided he, wife, and baby were going to stay in that room, which is not the room that has his childhood bed and belongings in it. \n\nI can’t speak for Op, but If you’d asked me in college I’d have said I moved out, but legally my permanent address was still my relatives and it is where I resided most holidays and summers. \n\nFor OP, is there a way your brother can upgrade to a double bed in his bedroom at your parents house? There are cheap platform beds on lots of online sites, and cheap mattresses as well. It might circumnavigate the issue. Or, and this wouldn’t be as ideal, what about agreeing to switch your and brother’s bed? It would mean you had a twin bed, but you’d get your bedroom and your stuff. \n\nOverall though, NTA.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I’d say that’s a pretty good compromise for the both of them. I wouldn’t want to give up my room necessarily but I also wouldn’t want to be caring for the niece either for the next 2 weeks if she doesn’t sleep through the night, or be the one putting her to be if needed or getting up in the morning with her if needed. It be better that she’s with her parents since she’s in a completely new environment then her own home",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "Need more info: it sounds like you don’t live with your parents anymore and they have moved out of your childhood home… are you fighting over a guest room in their new house? If so it’s up to your parents to say who gets the guest room.",
      "id": 17,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "[removed]",
      "id": 18,
      "comments": [
        {
          "score": 1,
          "content": "sorry I tried explaining in the edit, I hope I made myself more clear!",
          "id": 19,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "Once you moved away ( to a  different country no less ) the room became your parents. It’s their house and their money. Like your brother your going home for the holiday to visit. It seems like I’m that instance you should let them have the bedroom. I agree what happened during the pandemic was not well done by them. This is different. You both live away from home and you’re both going home for the holidays when that happens you just make due.",
      "id": 20,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA. Feel bad for what reason. Sometimes \"sucking it up\" eventually EXPLODES! I bet he now knows exactly how you feel though. Literally knows how you feel, besides \"your feelings\" have merit! PERIOD Enjoy that air mattress/floor/couch/cot whatever, and place the baby in between you.",
      "id": 21,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA\n\nIt was nice of you to offer your room in the first place and they took advantage of your kindness. Now they don't even ask you if it would be ok for you to switch rooms they just demand it? That is some real BS and I would react the same way as you did. Would be different if they actually asked you and accepted whatever your answer would've been",
      "id": 22,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "ESH\n\nThey suck for slowly taking over your room a few years ago and your parents also suck for just letting it happen.\n\nBut now you've both moved out and neither of you have a claim to either room, it's simply a matter of who needs what space and they clearly need the bigger room.",
      "id": 23,
      "comments": [],
      "relation": "No"
    }
  ]
}