{
  "post content": "Alright, buckle up because this is embarrassing and kinda gross.\n\nI (20F) live with 3 other people (22M, 23M, 21F). We’re not super close but we are all friendly and polite to one another. I’m going to school for a biology degree and I currently intern at a wildlife sanctuary. This means I come in contact with a bunch of sick and injured wild animals. I am very diligent about hygiene and preventative measures but shit happens to the best of us.\n\nTo make a long story short, I contracted a common type of parasitic worm due to my job. Super gross but not as big of a deal as you’d think. I went to my doctor, got prescribed meds to kill the worms, and in a few days I’ll be worm-free. No big deal, I’m not stressed over it. It’s a risk I accepted when I took my job and it poses no significant risk to my health.\n\nI did not tell my roommates because 1) I don’t think they need to know or are entitled to know my medical issues, 2) I made sure to quarantine to my room and avoid shared spaces as an extra precaution so there is almost no chance of cross-contamination. The only way you can spread this specific species in through feces so the risk is minimal, and I diligently wash my hands after using the bathroom, etc.\n\nWell, one of my roommates found my prescription bottle in the kitchen and looked up the medication name. She flipped her shit. She confronted me and told me that I need to disclose health issues like that with her and my other roommates, and that I’m “knowingly exposing them to disease” by not telling them.\n\nI get it, the thought of worms is gross, it isn’t fun to think about. But I don’t feel comfortable sharing my health issues with my roommates especially when there is basically no risk to them. They aren’t entitled to that information imo. \n\nTwo of my roommates think I’m a huge asshole and one is on my side (he’s also a biology major, similar field of study). Mostly I’m just kicking myself for accidentally leaving my meds in the kitchen.\n\nAITA here? Am I expected to tell my roommates about this kind of stuff?\n\nEDIT: My doctor was not concerned with me spreading it through my household, and it doesn’t require my roommates to be treated since the risk is so low. It isn’t pinworm.\n\nEDIT #2: I didn’t come here to argue about my hygiene, I know I am careful and thorough, and that wasn’t what I came here asking about. Also, you are spreading blatant misinformation about parasites. I can accept that I suck for not telling my roommates but stop making wild assumptions and calling me a gross unhygienic person :/",
  "id": 1,
  "comments": [
    {
      "score": 1441,
      "content": "ESH. If there was any risk to them, you were obligated to inform them. Your roommate sucks for snooping.",
      "id": 2,
      "comments": [
        {
          "score": 311,
          "content": "This - the snooping part bothered me the most. There’s nothing they the roommates would’ve done or could’ve done differently HAD they known. I’m dealing with my own similar problem and people are on a need to know basis.",
          "id": 3,
          "comments": [
            {
              "score": 190,
              "content": "NTA.  OP, I'm pretty sure I know what you have, and to spread it you literally have to ingest feces.  You are definitely not the AH here, but you should be more careful with your meds.  And no, you are not obligated to share your medical history with your roommates, at least I wouldn't unless I had something highly contagious which this isn't.",
              "id": 4,
              "comments": [
                {
                  "score": 92,
                  "content": "Do you think OP ingested feces to get it?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 203,
                      "content": "Not to be gross but yes, I must have ingested feces to catch it. My job entails examining animal feces to monitor their health and cleaning up feces. My roommates don’t use my bathroom and aren’t around my poop",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 50,
                      "content": "You get worms one of two ways; ill-prepared meat that has larvae in it, or.. Well.. Eating/drinking something contaminated with feces..\n\nOP could have ingested feces from either failing to wash properly, or a coworker failing to was properly, then touching something that was either ingested or used to hold something ingested. \n\nSo, yeah. OP might have ingested feces to get the parasite. It doesn't mean they were chowing down on a turd log, but it does mean someone, somewhere didn't follow protocols correctly. Given it's students, it's not entirely unlikely.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 55,
                  "content": "So I got worms once and the entire household had to take the medication. Parasites are highly contagious",
                  "id": 8,
                  "comments": [
                    {
                      "score": 48,
                      "content": "It depends on the kind of worms that you had.  Not all parasites are spread the same way.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": "She didn't snoop. The bottle was in the communal kitchen. She just Googled what it was for. Snoopong generally requires secrech and illicitness.",
          "id": 10,
          "comments": [
            {
              "score": 46,
              "content": "She left the meds in the kitchen, but the roommate had to google it to know what it was. I kinda feel like looking up someone’s medication would fall under snooping. It’s a weird thing to do.",
              "id": 11,
              "comments": [
                {
                  "score": 54,
                  "content": "It's not a weird thing to do while there's a worldwide major mini-pandemic involving a potentially deadly disease going on. It's also not such a weird thing to do when you're living with someone. And the roommate ended up being vindicated. OP was keeping an important medical and infectious issue hidden from her roommates becsuse she was embarassed and endangering them all.\n\nOP also likely lied to her doctor or chose to not heed the doctor's warnings. When ypu have worms, **everyone in the household** has to take the medicine because worms are highly infectious. OP also is very unlikely to have her own private bathroom and thus they all share the bathroom(s).\n\nOP is a a massive asshole.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Lmao, sorry, no. Googling someone’s medication is still weird, and rude, even if you’re someone’s roommate. Regardless of whether OP was right or wrong in this instance, Googling medication like that is not cool.\n\nOP has clearly said that her doctor was not worried about transmission to her roommates, and that she does, in fact, have her own bathroom. Not everyone has to take the medication, depending on the type of worm. These aren’t pinworms.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "Also the ease by which worms spread depends a lot on the worms. A lot of these parasites require specific hosts to complete their lifecycle and lay eggs. It is not always the case that everyone needed to be taking that medication depending on the species that OP was infected with.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "My doctor was not concerned and the type of parasite I have doesn’t warrant treating the entire household. I have a private bathroom. \n\nWild assumptions",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -9,
                      "content": "Major mini pandemic? You mean the coronavirus that has always been around? The virus that so common that it’s listed on every Clorox and disinfectant bottle? Don’t be so paranoid.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "Unless she thought maybe it'd help her figure out who's it was so she could give it to them?",
                  "id": 17,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Because the name on the bottle wasn't a giveaway?",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -1,
                  "content": "there's plenty of legit reasons for doing that. Like wondering if your roommate has some sort of infectious condition they haven't mentioned.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Nah, can’t agree. How far does that entitlement go? Could they go into her private bathroom and Google whatever they find there? If they’re really worried? I realize she left it in a public space, but snooping into someone’s medical stuff isn’t cool. If there’s a real risk of infection it should be disclosed, yes, but having a roommate doesn’t mean you get NO medical privacy.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -8,
              "content": "Roommate was probably looking it up to see if it could be abused and if so...mayyyybe a few could come up missing?",
              "id": 21,
              "comments": [
                {
                  "score": 11,
                  "content": "Or maybe she wanted to know if OPnwas a druggie? Why assume the worst of people?",
                  "id": 22,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Because there is no damn good reason to start looking up people's medications? It's infinging on their privacy.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 24,
          "content": "On one hand, you're right. On the other hand, the only way there's risk to roommate is if they're playing with other people's poop, in which case, they got bigger issues. I vote NTA.",
          "id": 24,
          "comments": [
            {
              "score": 102,
              "content": "Naw, all it takes it OP not washing her hands after she takes a shit and the  handling food or food containers that other people will eat from. Now she has exposed other people.",
              "id": 25,
              "comments": [
                {
                  "score": -4,
                  "content": "Yeah thats realy what's hapening  here. OP is not washing hands after taking a shit /s",
                  "id": 26,
                  "comments": [
                    {
                      "score": 17,
                      "content": "She didn't wash her hands after handling poop at work. Because that's how this happens. Frcal to oral. At work, where yo uh are supposed to by hypervigilant about hygiene. I work in the field. This isn't something that can \"just happen\". This takes gross negligence on someone's part.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "Or OP isn't appropriately washing their hands after the bathroom and then goes in the kitchen (where the meds were) touching surfaces and such. Since OP had to ingest some fecal matter to get the worms to begin with, there was a breakdown in hygiene at work. Not much of a stretch to think there would be problems at home.",
              "id": 28,
              "comments": [
                {
                  "score": 7,
                  "content": "Yep!",
                  "id": 29,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Love the name",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "Or the breakdown of hygiene happened with a colleague who then proceeded to accidentally infest half the workplace.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "She has her own bathroom. As long as she was being super careful with hand hygiene until the infection cleared, there's really no risk here given that the transmission route is fecal-oral.",
          "id": 32,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -5,
          "content": "> If there was any risk to them, you were obligated to inform them.\n\nUnless they are sneaking into OP's room to give them an enema, so they can bathe in the shit-water that comes out, there's no real threat of cross-contamination given OP's preventative measures.\n\nIf they are doing that.. I think OP's worms are the least of the problems here?",
          "id": 33,
          "comments": [
            {
              "score": 5,
              "content": "Except we are one that OP is lax on preventative measures or she wouldn't have caught them in the first place.",
              "id": 34,
              "comments": [
                {
                  "score": -2,
                  "content": "An unfounded accusation, as for all you know it was her coworker that didn't take the proper preventative measures and inadvertently infected OP.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 0,
                      "content": "If a coworker did something wrong, it shouldn't matter because OP should have followed procedures like disinfecting equipment before and after using it. And it's not an unfounded accusation when OP admitted that animals get diarrhea all over them sometimes and they sometimes don't follow safety protocols because they take too long.",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 512,
      "content": "YTA.\n\nYou say you didn't warn them because the risk is low, *but that wasn't your call to make.* They have the right to choose what risks they're exposed to, and they may not agree with your risk assessment.  Had they known, they may have chosen to sleep elsewhere until the matter resolved.\n\nYou accepted the risk of infection when you started your job. They did not accept any such risk, even to a lower degree, by becoming your roommates! \n\nIf you didn't want to share your medical details, you would have informed them without being explicit. If you told them you have a health issue which can only be spread though direct contamination and you were taking X precautions, you'd be in the clear. \n\nI don't blame your roommates for being pissed. They're probably wondering what other illnesses you're willing to lie about and expose them too...",
      "id": 37,
      "comments": [
        {
          "score": 23,
          "content": "Fair enough. I am kinda upset that my roommate decided to Google my medication though :/ \n\nIf it was highly contagious I would notify my roommates, but the risk is pretty much zero as long as they’re not drinking my toilet water. However I do see where you’re coming from, next time I’ll just tell them I’m sick but won’t give the details of the issue.\n\nThanks!",
          "id": 38,
          "comments": [
            {
              "score": 150,
              "content": "> Fair enough. I am kinda upset that my roommate decided to Google my medication though :/\n\nI get that. When I first read your post, I thought that may have crossed a line too. But at the same time...would you be upset if one of them had simply recognized the prescription? Probably not.\n\nSince someone knowing what a prescription is for seems like a risk one accepts when leaving their meds in a non-private space, I decided it isn't asshole behaviour. \n\nNote: it may, however, still cross a line for you. If so, it would be reasonable to talk to your roommates about it bothering you while resolving the illness issue.",
              "id": 39,
              "comments": [
                {
                  "score": 27,
                  "content": "Thank you! I’ll definitely handle this differently next time around, I can understand why they are upset",
                  "id": 40,
                  "comments": [
                    {
                      "score": 9,
                      "content": "You're welcome. And good luck with your meds, hopefully you'll be worm-free soon!",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "If the risk is really “almost nil” how did you get it?\n\nCan you see how they aren’t going to believe that claim because you became infected?",
              "id": 42,
              "comments": [
                {
                  "score": 23,
                  "content": "Because I work with poop every single day lol",
                  "id": 43,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -8,
                  "content": "You get It by getting into contact with shit\n\nLiteral shit, not like \"general shit\"\n\nOP probably didnt wash hands that well and invested an egg, or the parasites got in through the skin, also a possibility\n\nSo unless roommates are going down on that toilet (in which case they have worse things to worry about) or using poop as play-doh the Risk is null",
                  "id": 44,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Why would the roommates need to use poop as playdough or go down on the toilet when all OP did (in your opinion) was not wash their hands very well? Surely if OP continues not washing their hands very well the roommates are exposed to potential ingestion given that OP is touching stuff where their food is.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "The issue is that once you get parasite eggs for example under your nails, you can easily also cross contaminate food and other items, so it's not strictly always only fecal-oral (poop to mouth).",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "When humans get threadworm, everyone in the household is supposed to take the medication, and wash all bedding and towels, and ensure no sharing of these things happen.\n\nWhile what you have may be a different type of parasite, you should have told them so they could take measures to ensure they wouldn't catch it. YTA for acting like their health isn't a big deal, when you share a space with others, it's common courtesy to inform them of any risks to their health.",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "> Fair enough. I am kinda upset that my roommate decided to Google my medication though :/ \n\nYou would be correct to be upset if they went through your room to google your medications. Googling something open in the common room, be it medication or food, is not exactly a breach in privacy as you left it out yourself (and they couldn't know if by accident or on purpose to drop a hint).",
              "id": 48,
              "comments": [
                {
                  "score": 1,
                  "content": "Excuse me while I just go Googling all of my mother's private medications now, just because she keeps them in the kitchen.",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Well, if one of them gets worms you know who's been drinking your toilet water.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Wait I can't drink your toilet water?",
              "id": 51,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Actually there are many risks of contamination with a disease like this. I’m sure you didn’t get it by drinking toilet water.. yes, I understand you handle feces in your work and that’s how you were infected, but there’s still many ways that your roommates could catch it, i.e: you not washing your hands properly, them using your bathroom, etc.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -1,
              "content": "No I can't agree here - not fair enough OP. \n\n\" They're probably wondering what other illnesses you're willing to lie about and expose them too... \"\n\nToo bad for them...it's not up to you to disclose every infection you have to the people you live with. What if you have HIV, or even some much less significant infection - it is not up to you to tell people you live with every health detail so lng as you can mange the risk.\n\nWhich I am sure you were doing very diligently.\n\nPeople wigging out about  the medicine box being in the kitchen Its a box not a fucking anthrax weapon. Its not like you been going to the toilet then rubbing your hands all over the box then leaving it in the kitchen before washing your hands.\n\nSuddenly everyone's the expert on disease control. \n\nFFS, NTA.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -13,
          "content": "[deleted]",
          "id": 54,
          "comments": [
            {
              "score": 37,
              "content": "Nope! Your assumption is based on OP's risk assessment...but I don't agree with that assessment.\n\nFirst, the simple fact that OP contracted this parasite shows that OP's hygiene is questionable. After all, the only way OP could have worms is if she ingested animal fecal matter...which most likely occurred as a result of poor hand washing after handling the poo. Whether she doesn't wash long enough or doesn't scrub under her nails, OP has shown that her hygiene precautions aren't as reliable as she considers them to be.\n\nSecond, OP is making assumptions about roommates hygiene. All it would take is one of them touching a dirty item (doorknob, light switch, flusher) and not washing their hands. Perhaps the main washroom is occupied and one person desperately needs to pee, so s/he uses OP's bathroom in an emergency. And since OP hasn't warned them...the roommates won't be careful about washing up. \n\nSo, regardless of OP's claims that the roommates could never possibly be exposed, the chances of exposure are not that insignificant. I maintain that OP was TA for not dislosing *any* information, not even a warning which keeps the details private as I indicated in my last paragraph.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "yee ha I totally agree. what everyone else in the house is sure they are disease free? they discolse to the world when they got somethig needing ttreatment? they need to grow up.",
              "id": 56,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 298,
      "content": "Im gonna say NTA. If it was something you could pass onto them easily, sure you should disclose that so they know to take extra precautions. But you say this is hard to pass on, and easy to fix. Based on that, I agree you arent required to tell your housemates.\n\n\n\nYour roomie that looked up your medicine is an asshole imo. Why tf does she need to do that? If its out, leave it alone and inform the owner. What she did is nosey af and therefore an asshole move.",
      "id": 57,
      "comments": [
        {
          "score": 122,
          "content": "Agreed. If this were lice or the Coronavirus, sure. But this is basically the equivalent of \"I have cold sores but as long as I do my due diligence, keep my hands clean, and don't rub my face all over the couch while it's active they'll be fine\".\n\nIf OP had been taking dumps on the couch or farting on peoples' heads then fine, get upset. But that's not the case.",
          "id": 58,
          "comments": [
            {
              "score": 79,
              "content": "Or if OP takes a shit, doesn't wash her hands, and makes food for everyone, she has exposed everyone. \n\nHer hygiene is suspect. I don't dare what she says. I've been doing the same kind of work for 20years. This isn't something that can happen. Unless you don't wash your hands or have good hygiene at work",
              "id": 59,
              "comments": [
                {
                  "score": 26,
                  "content": "I’m not cooking them food or even touching shared surfaces or items\n\nI’m sorry, what am I supposed to do when an animal poops on me because it’s scared? Or if dirt from an enclosure is infected during a routine cleaning, and I have no clue? Do these situations prove I am unhygienic?\n\nI’m cool with being called the asshole, but to paint me as some gross weirdo because I caught a VERY COMMON parasite is kinda presumptuous and rude. I AM very careful with my hygiene at work and at home. This is exactly why I wanted to keep it to myself, because people like you tend to demonize those who contract it",
                  "id": 60,
                  "comments": [
                    {
                      "score": 3,
                      "content": "How does getting pooped give you the parasite. I'm pooped frequently. I don't get it in my mouth. Ate you eating the dirt? \n\nI work in thus field. I know how this works. It is not common to get worms from our patients. And if it isnwherenyoh worm, then your policies need changed and you are doing stuff way wrong.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Is it not also possible that someone else with poor hygiene saw an open bag of gummy bears that OP was munching on and shoved their hand in without even asking?",
                  "id": 62,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Not to make a stretch here, but I work in a lab where animal faeces are handled and I keep my food locked up in my locker because I don't want to risk that very scenario. \n\nNever mind I have to lock my food up anyway because lab techs are notorious for being food thieves. Especially those on night shift.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "You mean herpes lol?",
              "id": 64,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "> Your roomie that looked up your medicine is an asshole imo. Why tf does she need to do that?\n\nWhen you live with a biologist who brings his work home in him, it becomes a thing!",
          "id": 65,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 175,
      "content": "Woah her googling your medication name like it’s her fucking business is weird af",
      "id": 66,
      "comments": [
        {
          "score": 26,
          "content": "OTOH, what if she had just recognized it as something she gave to her horse for worms? Would you still have the same reaction?",
          "id": 67,
          "comments": [
            {
              "score": 3,
              "content": "I think it's different when you take the step of actively searching for the information. I'd be weirded out as hell if somebody decided to google my prescriptions. It's different if they just happen to know.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 141,
      "content": "Yta - if they can catch it they need to know.\nDefinitely think if you were upfront and chill about it they would have been as well \nIt’s the fact that you didn’t tell them that is making this into a bigger thing",
      "id": 69,
      "comments": [
        {
          "score": 94,
          "content": "[deleted]",
          "id": 70,
          "comments": [
            {
              "score": 2,
              "content": "Because what asshole looks up someone else's medication.",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -3,
              "content": "People who expect roommates to not be nosy assholes when they accidentally forget their meds in the kitchen?",
              "id": 72,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -4,
              "content": ">ETA: Who leaves a medication in the kitchen and expects to keep it a secret?\n\nNormal people. Who leaves their medication in their living space and expects other people to google it? Do you have no one that respects privacy in your life?",
              "id": 73,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 113,
      "content": "Info: if there’s absolutely no risk to them since it’s passed through feces, then how did you get it? Doesn’t the fact that you got it while practicing careful hygiene prove that there’s some risk no matter what measures are taken?",
      "id": 74,
      "comments": [
        {
          "score": 59,
          "content": "I'm assuming because it's part of OP's job to literally handle feces. Somehow I doubt OP is inviting the housemates into the bathroom to play with their shit.",
          "id": 75,
          "comments": [
            {
              "score": 33,
              "content": "[removed]",
              "id": 76,
              "comments": [
                {
                  "score": 10,
                  "content": "Who washes feces off their hands in the kitchen? That's what the bathroom is for.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 28,
                      "content": "They're saying what if OP doesn't wash her hands diligently enough and touches something in the communal area afterwards. Like sure maybe she washes her hands for a full minute in the bathroom, but maybe she does her laundry and there's some trace feces on her underwear and would OP think to wash her hands after that? Or does she touch communal surfaces before she washes her hands next?",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Well what are the roommates gonna do about it regardless?",
                  "id": 79,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "Yes, I am around and work with animal feces. It’s my job to clean up and examine feces to monitor the health of the animals. Unless they’re touching my poop or butthole the risk is pretty much zero.",
              "id": 80,
              "comments": [
                {
                  "score": 66,
                  "content": "What about if you accidentally touch poop particles on your anus, then your hand flushes the toilet, turns on the taps, etc., then roommate goes in and takes a pee, flushes, doesn’t wash, contracts parasite... their fault for not washing their hands, or your fault for not making sure everyone is being diligent while you’re walking around with parasites?",
                  "id": 81,
                  "comments": [
                    {
                      "score": 7,
                      "content": "It has to be a pretty significant amount of feces, not just particles\n\nI have my own bathroom, no one else uses mine\n\nI am not using shared items or appliances at this time",
                      "id": 82,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -13,
                      "content": "Their fault\n\nAnything you contract by not washing your hands is your own damn fault\n\nBathroom is dirty by itself, parasites or not",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 50,
                  "content": "\n...Do you use the bathroom? The shower? The washer/dryer unit? The kitchen? Door knobs? They are definitely being exposed, and without being warned arent using their own ppe and best hygiene practices to stay safe.\n\nEdit: mfer YOU caught the parasite because of your lack of care, how can your room mates trust you not to be bringing it home with you all day every day.\n\nThey should be on meds too tbh, and definitely need to be advised of your infectious parasite situation. If it could only affect you, you'd be fine. That is not the case. yta",
                  "id": 84,
                  "comments": [
                    {
                      "score": -9,
                      "content": "This makes my head hurt.  One, who the heck is getting so much shit on their hands that they are afraid they are afraid people will contaminate them everywhere in the house. Y’all need to learn how to wipe because I’ve never gotten crap on my hands, that is what toilet paper is for.  Two, the dryer will most likely kill and parasite contamination with the clothes, but she already said she isn’t using them so it’s a moot point anyway.\nThe true takeaway is reading these comments and realizing how many people in here obviously don’t know how to wipe properly to where they have to worry in their day to day life.  It’s really sad.",
                      "id": 85,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "Curious, did you talk to your dr about the risk to your roommates?",
                  "id": 86,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yes, he said the risk is slim to none, did not seem concerned with me transmitting it",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "But then how did you get it? Did you touch your face without washing your hands after touching animal feces? I feel like it’s not common even for someone in your field to contract worms from their animals.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 7,
                      "content": "It’s not common. And the way OP is dismissing it like “I play with poop lol” is actually kind of scary. Many people have worked in this field for years and never gotten worms because they practice good hygiene and proper safety precautions. I’m not sure OP does, especially since they’re being so flippant about catching something that could be passed to others.",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Could’ve been infected dirt in an enclosure. My coworkers may have practiced poor hygiene and given it to me. Animals literally shit on me when handled. There’s a lot of possibilities but it doesn’t mean I have poor hygiene",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Shit OP might’ve gotten it from just eating at a restaurant. Cook goes potty, gets eggs on the hands, doesn’t wash the hands, goes back to the kitchen, makes food sans gloves, hello parasite.",
          "id": 91,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 98,
      "content": "ESH\n\n\"Hey everyone, I have a potentially transmutable / contractable condition from working at _____. For privacy, I'm not going to disclose the details, but for your safety, please ensure that you follow these extra tips ________ and I will be taking the following precautions (using a bleach spray bottle / disinfectant whatever in / around the toilet after use etc.)\"\n\nHowever you say it, it's important that you communicate a notice about something that *could* potentially be dangerous to someone's health.\n\nShe sucks for snooping.",
      "id": 92,
      "comments": [
        {
          "score": 24,
          "content": "I like this! That way I don’t have to share the details but still give them a heads up. Don’t know why I didn’t think of that.\n\nThank you for the input.",
          "id": 93,
          "comments": [
            {
              "score": 25,
              "content": "Personally, if this was said to me I would freak. I would 100% press until you told me exactly what the condition was and exactly what, where and how it can be transmitted. If it’s something not seriously dangerous and I’m likely not going to contract it I’d rather not know. But telling me half the situation and refusing to tell me what it is? That just seems like you are trying to hide something actually dangerous. If it’s not actually dangerous, I’m of the opinion that it’s your personal issue and your roommates are not entitled to know your private medical issues.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 77,
      "content": "Fellow bio major here, and you are NTA. They're not entitled to your medical information, especially considering that worms are pretty hard to pass from person to person when you're taking precautions- which clearly you were. Now, if you weren't taking precautions, weren't medicating yourself, were putting your roommates in harms way knowingly, then yea, you'd be TA. But in this situation, you're definitely not. Your roommate who snooped and then called you out, however, is an asshole.",
      "id": 95,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 76,
      "content": "YTA\n\nSure the risk is minimal but didnt stop you caughting it in the first place.",
      "id": 96,
      "comments": [
        {
          "score": 1,
          "content": "I work directly with animal poop, cleaning it and examining it to keep tabs on the health of the animals. The only way they would be at risk is if they are coming into contact with my poop",
          "id": 97,
          "comments": [
            {
              "score": 38,
              "content": "Do you not share a bathroom/bathrooms?",
              "id": 98,
              "comments": [
                {
                  "score": -8,
                  "content": "She said in her original post and in several responses that she has her own bathroom.\n\nNTA. Your roommates are being dramatic.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I find it highly unlikely a house with 4 bedrooms has a bathroom for each bedroom or, in the more likelt scenario or there being 2 shared ones,that the roommates would yield one of 2 bathrooms to OP's use only.\n\nAlso, OP was clearly negligent enough to ger the worms to begin with. Who's to say OP won't be negligent enough to not clean her hands and herself deligiently enough to not spread it to the others by way of doorknons, couches or whatever?",
                      "id": 100,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Your room mates have a right to know, you are disrespectful not telling them.",
              "id": 101,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "But not everyone in your field gets it. What did you do wrong to get it?",
              "id": 102,
              "comments": [
                {
                  "score": -1,
                  "content": "Maybe a colleague didn't wash THEIR hands, has poor boundary recognition skills, and stuck their hands directly in OP's bag of pretzels.",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Catching*",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 44,
      "content": "YTA. They deserve to know to watch for symptoms and get treated if they need. You could have been professional and upfront. \nYou failed this one.",
      "id": 105,
      "comments": [],
      "relation": "Attack"
    }
  ]
}