{
  "post content": "I (15f) share a bathroom with my sister (18f). Until about a year ago we shared a bathroom with our parents, but we moved so now they have their own bathroom. \n\nWhen our parents shared the bathroom too my sister cleaned up after herself, but since it's only us sharing it she stopped. Hair all over the shower, wet towels and dirty clothes on the floor, shit stains in the toilet, whenever she trims her bangs the sink is covered with hair she just leaves there, and more. I have to clean the bathroom before I can shower in the morning. The grossest thing is when she leaves underwear with used pads on the floor. \n\nI've tried everything I can think of. Talking to our parents, talking to her, making a cleaning schedule, cleaning up after her, or not cleaning up and just letting her live in that filth. Nothing has worked, I've been stuck cleaning up after her for a year (at least if I want a clean bathroom myself). \n\nI warned her once that if she didn't clean up her used pads on the bathroom floor I'd put them somewhere everyone could see. Well it happened again, so I hung her underwear (with the pad) on the door handle of the bathroom on a day my sister's boyfriend was coming over. I don't know what happened, but my sister is extremely pissed. My parents aren't happy either and told me to just talk to them next time. (I did, very often. Never worked.)\n\nI feel bad about involving her boyfriend in this, but I couldn't think of anything else to do. I'm assuming I was an asshole, but the bathroom was clean this morning. \n\nAITA?\n\nSidenote: My sister does keep her bedroom clean, and she had no problem cleaning the bathroom when we shared it with our parents.\n\nEdit: I'm 15, my sister is 18. I didn't think it mattered but some people mentioned it in the comments: I hung her panties (with the pad) on the door handle by the leg hole, I didn't stick a dirty pad directly on the door. That would be gross.\n\nINFO: I used to put anything I could move in her room, I've even put it on her bed or desk a few times. It hasn't worked.",
  "id": 1,
  "comments": [
    {
      "score": 6893,
      "content": "NTA\n\nThe important thing is that you\n\n* explained what the unaccepted behavior was\n* made it clear what the consequences would be.\n\nShe did the shitty thing, you did exactly what you warned her you would do.\n\nGiven that nothing else was worked, you are good.\n\nStand up to your parents and explain to them that if they are not willing to correct this behavior, you have no choice but to take matters in your own hands. They'll probably still be angry at you, but stay calm and keep on pressing the point, that it is not fair that you have to live with this mess.",
      "id": 2,
      "comments": [
        {
          "score": 1662,
          "content": "Can I emphasize the **stay calm** part? Nothing will be gained if you lose your temper, they’ll consider you the immature one.",
          "id": 3,
          "comments": [
            {
              "score": 445,
              "content": "This right here. Once you lose your cool, you lose the fight.",
              "id": 4,
              "comments": [
                {
                  "score": 223,
                  "content": "Underrated comment. I have so much experience with losing my shit cuz I'm the type that holds it all in until i explode, but I've learned that people don't take me seriously when I'm so irate that i can't even listen. It's ok to show anger and frustration, just not in a way that's making people afraid or uneasy. Intimidation is not the way to go lol",
                  "id": 5,
                  "comments": [
                    {
                      "score": 55,
                      "content": "Stay completely calm as you shiv them both. Sit across from them as they freak out and tell them they're being immature. Nothing will tell them not to fuck with you like that.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "As someone raised by lawyers, I endorse this message. \n\nA shrug and \"she left it out, I just relocated her biological waste\" is a pretty air tight argument.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Ive had the same issue, I’m still working on it but I think I’m doing a much better job of not losing my temper. The key for me was once I figured out that it was a learned behavior of my volatile upbringing, (whoever is the most intimidating wins) i was able to address it because I didn’t want to be this way for the rest of my life. \n\nAlso I’ve found that arguments or disagreements are more productive when you aren’t trying to “win.” It’s also difficult to regulate your anger when you hold it in so addressing concerns earlier has also helped considerably.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "A fellow \"bottler\" I see!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "I use to do this too and at some point I just stopped exploding and started listening. This pissed off someone I was debating with. They thought I was being rude. I was so thrown off. This dude was so used to yelled that when I was calm he got mad? You’re comment just mad me think of this and I had to share. Have a great day!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "So much this - I used to think of it as the \"alien-in-the-room\" moment. I've only done it a couple of times but it's the frozen disbelief that will appear on their faces, like an alien just appeared in the room. No matter how justified you feel in that sort of anger, the second you lose it you will lose the argument as the other party disengages and will not discuss. End of argument and nobody will listen to you.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Stay calm and keep the focus where it should be.. your sisters conduct",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "depends how irate you get. i know its a 3 year difference but on a primate level, while not mature, and possibly not good for long term mental health...physical violence would solve this right quick.\n\nthe issue is that now, for whatever reason, she's not respecting any consequences of being dirty... if she knew every time, win or lose, there would be a fight from the moment go when her panties were found on the floor...first or second fight it would kick in subconsciously that it's not worth it and she'd avoid the fight.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "easier said than done. some parents are stuck to their old ways and won’t want to communicate, so it’s difficult and if you had MY PARENTS well, you would understand.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Which is asked pretty much from a 15 year old  if  their parents aren't able to solve basic conflicts.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -49,
              "content": "She IS the immature one. She’s 15.",
              "id": 16,
              "comments": [
                {
                  "score": 65,
                  "content": "Her actions say otherwise",
                  "id": 17,
                  "comments": [
                    {
                      "score": 30,
                      "content": "What I’m saying is, she’s allowed to act immature because she is 15. Her sister is 18 and is legally an adult. What her sister is doing is something I’d think would be done by an immature younger sister but it’s being done by an immature older sister.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Age is not maturity",
                  "id": 19,
                  "comments": [
                    {
                      "score": 2,
                      "content": "40, can confirm.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "Exactly!!",
          "id": 21,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Honestly so true. Maybe you're a tiny bit of an asshole OP, but if you've exhausted your other options its not like she, or anyone can blame you. Plus you warned her, so its on her at that point. And we all need that one friend / family member that will be a little bit of an asshole and won't put up with bullshit. I can be a little bit of a vindictive asshole, but if I were you I would definitely double down on your promise. If you feel bad about this and fold, then I have no clue what other options you would have to solve your problem. If you feel bad or feel the need to say sorry, you can, but I would do it something like 'sorry that I made you upset, but I warned you and I am also warning you again that I won't hesitate to do it again. Please clean up after yourself, its disgusting'. Firm, but still an apology regardless. And definitely try to motivate your parents by referencing your efforts and how you are at the end of your rope.",
          "id": 22,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "I'm not sure if I agree that being clear on consequences justifies the consequences.\n\nFor the record, that same description describes blackmailing; doesn't make it justified at all.",
          "id": 23,
          "comments": [
            {
              "score": 53,
              "content": "You bring up a valid point but I think in this case it is acceptable. It's not as if OP was making an unreasonable request.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "That's true, but I think the difference is blackmailing usually involves forcing the other party to cross a legal and/or moral boundary, which is not the case in this scenario. IMHO, OP was entirely justified in this case.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Agree! \n\nI feel that her actions of hanging it on the door handle was extremely reasonable and showed the grossness of it. She didn’t throw a bunch of them on the floor or her sister bed, she didn’t ruin or throw away said underwear, and she didn’t make it worse (adding extra fake blood), nor did she hide it somewhere in the sisters room to prove a point.",
          "id": 26,
          "comments": [
            {
              "score": 1,
              "content": "I would have just kept them, binning the pads cus' I wouldn't want somebody's old pads laying around. She can get her pants back when she decides she wants to keep them.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "even as a kid I was rather talented at pissing people off more by that lol",
          "id": 28,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "The only reason I would vote NTA here is because of the two things you listed. Had she not done those, she would no doubt be TA. It’s so so so important to outline exceptions, confront the problem in a professional manner, then explain the consequences. Now threats of consequences with no follow through isn’t going to be taken seriously. Not following through would have made it a threat and not a consequence.",
          "id": 29,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "If she does it again just throw the underwater away too so soon she’ll just run out",
          "id": 30,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Too often the person exposing the behaviour gets accused of being at fault when it’s the person’s behaviour that is unacceptable. Some people prefer to allow bad stuff to happen to keep the peace. You took action to address her bad behaviour after she refused to.. this is of her making not yours",
          "id": 31,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "YTA but a somewhat justified one. Does no one remember the meta post from the mods a few weeks ago? Putting your sisters dirty pad on the wall when her boyfriend comes over is an asshole move. I get that she was at her wits end, that’s why I said it was somewhat justified. But it’s still an asshole thing to do.",
          "id": 32,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2876,
      "content": "NTA - Your sister is disgusting. Can you ask your parents to be able to use their bathroom for a month so they can see the state she will let it get to bu herself?",
      "id": 33,
      "comments": [
        {
          "score": 1465,
          "content": "I've tried, they politely declined. And they've seen how gross she can make it.",
          "id": 34,
          "comments": [
            {
              "score": 881,
              "content": "Try throwing any underwear she leaves straight into the bin outside? Act dumb if she asks",
              "id": 35,
              "comments": [
                {
                  "score": 696,
                  "content": "Or just on her bed, her desk, her floor - whatever that works. That sister is disgusting and I would never in a billion years leave something like that in the open.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 272,
                      "content": "Put the pad face down on her pillow...\n\n(no, I'd never do this...)",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 62,
                      "content": "Yep, she values her bedroom being clean? For a week, consistently and calmly escort anything she's ' accidentally' seemed to left in the bathroom that doesn't belong there to her bedroom. Her pillow. Her phone. Not so that anything gets damaged, but so they get as dirty as she treats a comkunal space.\n\nThat's such an infuriating and selfish behaviour.  I dislike when people cannot respect a basic level of clean in communal spaces. Blech!",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "Or just toss it all in the hallway, including the clothes of hers you use to clean up the hair. Keep kicking it all into the hallways. Make it your parents problem and make them step up. Nothing will gross your parents out more than leaving dirty bloody underwear in the hallway",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "This is what I would do.  Just open her bedroom door and hoik it in there. Let it land wherever.\n\n  I lived with my brother when we were in our early 20s. My brother would cook greasy shit all the time and not clean up. When I would go to use kitchen stuff it would be filthy. I kept threatening to throw it in his room. One day I went to use the grill.  It was full of lamb grease. So hoiked it into his room. Landed on his bed. He never left it dirty again.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -7,
                      "content": "A teen girl's underwear left unattended?  Used sanitary napkins strewn about? I'll be right over",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 250,
                  "content": "Yeah, FWIW, I once had a roommate who was an awful slob. She also didn't spend much time in the apartment (was with her boyfriend most of the time). She'd basically come in, make a mess and leave - like I'm talking greasy, mold dishes in the sink, spoiled food, etc.\n\nWe talked to her, we begged her, we tried everything and it didn't matter. Finally, we got so fed up, we took all her crap from around the house (dirty clothes, spoiled food, dirty moldy dishes, etc.) and put all of it in her bed and pulled her quilt on top of it. We closed the door to her room and just left it. She didn't come back home for about three days and it was in May, so the weather was pretty warm. You can imagine the smell. IIRC, she ended up actually just throwing out the clothes that were in the mix because they were that gross.\n\nShe was PISSED - but we all felt not one ounce of remorse. We gave her ever chance in the world and she didn't take one of them. She moved out about a month later, but didn't make another mess during that time. Buh-bye.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 30,
                      "content": "LOL I love this",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "Go get your karma in r/badroommates with this story",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I tried this  with my stepson. All he does is chuck it from the bed to the floor and leave it there instead.",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": ">Try throwing any underwear she leaves straight into the bin outside? Act dumb if she asks\n\nOr better yet, onto their parents bed. Maybe then the parents will pull their heads out of their asses and deal with an 18 year old who won't clean up after herself and makes her 15 year old sister do it.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Lol or start leaving it in your parents bathroom. Take her mess and put it in their bathroom. Or just outside the bathroom. Explain that you don’t want to be the only one living in her mess. \n\nOr maybe call a family meeting. Not as funny but could work.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 253,
              "content": "Honestly start putting the dirty underwear in your parents bathroom. Leaving USED pads not just out but IN her underwear??? What is wrong with your sister?",
              "id": 48,
              "comments": [
                {
                  "score": 61,
                  "content": "I lived in a group house for a couple of months with a girl who did this :( my boyfriend and I shared a bathroom with her and she’d leave bloody pads in dirty underwear on the floor, I nearly stepped on them a couple of times. I also had to stop her (unfriendly and aggressive) dog from eating them on multiple occasions. \n\nLiving with her was a nightmare. When we moved in, I noticed the tub wouldn’t drain at all, so I put on some heavy duty dish gloves, dug around in the drain, and pulled a 7” long, 1” wide, completely solid hairball out (she had long, thick brown hair - I had a black pixie at the time and my boyfriend has short dirty blond hair, so it was obvious who the culprit was. Her reaction? “Oh, I had no idea the tub wasn’t draining” - I guess standing in 5” of stagnant water while showering didn’t strike her as unusual at all). \n\nShe also made DIY body scrubs with coffee grounds and honey and never cleaned up after herself, so the entire shower would be splattered with a sticky, grainy, dark brown mess that looked like explosive diarrhea. Whenever she shaved, she’d leave leg hair and pubes all over the tub. \n\nShe’d use our plates, then leave them in the kitchen sink in several inches of black/brown water - I had to show her how to use a garbage disposal because she didn’t know how (we were both 26 at the time). \n\nIt was all really strange because I’ve known her since middle school and she never struck me as particularly unhygienic or gross. There really are people out there like OP’s sister and my former housemate, as horrifying as it may be to imagine ... and even worse to live through.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Oh, I see you’ve met my ex BF Caroline.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "I’m picturing Stan’s older sister from Southpark.",
                  "id": 51,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 72,
              "content": "[deleted]",
              "id": 52,
              "comments": [
                {
                  "score": 35,
                  "content": "So am I.  I am gagging at the very thought. sorry, it's completely low class gutter trash move, and that their parents are pissed at OP infuriates me. How can they not see how disgusting and how absolutely rotten the sister is being.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 24,
                      "content": "The smell of pennies mixed with a sharp synthetic “floral scent” won’t leave my nostrils after this thread. I wanna thank puberty for how pungent that particular sense memory is after all this time & would like to further like to add that I hate it. \n\nSorry for the additional gags & I apologize for adding another sensory dimension to the reading of this thread.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I had a housemate like this (just commented about it, actually) and I don’t think it was a power move - I think it was just a truly shocking level of laziness.",
                  "id": 55,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Hell, Once, I got my clean laundry out and dropped a pair of underwear and my roommates saw and I was mortified! Leaving DIRTY, BLOODY pads and underwear would literally make me die of embarrassment",
                  "id": 56,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "I often Reddit while on the toilet, before I shower.\n\nUnderwear goes on the floor, pad still on.\n\nThe idea is to remove it before hopping in the shower, so I don’t have to wash my hands repeatedly or touch my phone with dirty hands.\n\nI have forgotten it a couple of times. Thankfully, my boyfriend is awesome enough to just politely remind me, and I go take care of it immediately.\n\nSo it CAN be innocent. But it doesn’t sound like it, in OP’s case.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 61,
              "content": "If they don’t want to share with her, neither should you!\n\nThey know how bad she is, yet they don’t want to teach her that she needs to get it together?! Instead you’re in trouble. Totally unfair.  Is there any way you could just avoid her mess? Can you have a shower in your parents bathroom and do everything else in the kitchen?",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "[deleted]",
              "id": 59,
              "comments": [
                {
                  "score": 17,
                  "content": "I agree. Get a box or a laundry basket and every time she does something disgusting like that, throw it in the box in her room. After a while, it will begin to stink. When it stinks bad enough, she’ll do something about it. Or not, be sure to put your used latex gloves in there as well. You don’t need to be touching that shit.",
                  "id": 60,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "I seriously would want to take a crap in her bed after all this...",
                  "id": 61,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "Spam them with disgusting bathroom pictures until they relent",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Your problem was that you asked. Just do it, see how they like being imposed lol.",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Move all her grossness into their bathroom one day.",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Keep doing the until she gets the message. Put the the nasty underwear in her purse just before she goes out. Put them under her pillow. Put them anywhere that will be gross/embarrassing if she or anyone else were to find them. Eventually, she might get the message.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Put her pads in their bathroom next time then.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Giving the messy person the reward of her personal private bathroom seems unproductive.",
          "id": 67,
          "comments": [
            {
              "score": 3,
              "content": "It is, but when the messy person won't listen to anything, and the parents won't escalate punishments, it's at least a reprieve for the non messy child.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "Truly gross and no dignity",
          "id": 69,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1206,
      "content": "[deleted]",
      "id": 70,
      "comments": [
        {
          "score": 603,
          "content": "Worst part is she cleaned it for years when sharing the bathroom with our parents, so she knows she should.",
          "id": 71,
          "comments": [
            {
              "score": 242,
              "content": "[deleted]",
              "id": 72,
              "comments": [
                {
                  "score": 1,
                  "content": "She was taking a shit too!",
                  "id": 73,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 93,
              "content": "She’s gonna have a bad time when she moves out and is living with people she doesn’t know and isn’t related to. Unless this is just an “I can do whatever because it’s my sister” thing, any college or apartment roommates are gonna flip when they get a load of her bathroom habits. Honestly you’re doing your sister’s future self a favor because if she keeps this up, her roommates are gonna be here in a year asking the exact same question. Or she’s gonna get an embarrassing talking-to on basic fucking hygiene from her dorm RA. \n\nNTA.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Are you sure that your parents weren't cleaning after her back then without your knowledge?",
              "id": 75,
              "comments": [
                {
                  "score": 53,
                  "content": "Yup.",
                  "id": 76,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "She knows that if she doesn't, then you will. \n\nI would start putting it all in her bed and just saying 'well I didn't want to chuck it away'\n\nNext step is to start chucking all the pants away too when you clean, and if she still doesn't get it, start re-arranging the stuff in there so she can't find anything. That might prompt her to start doing it herself because it's too much hastle when you clean it. \n\n\nYou've tried nice, what else can you do? NTA",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Op I'm sorry you're going through that. My sister is the same way and it drives me nuts!! Problem is she's 27!",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Is it possible that she didn't clean up after herself, but rather your parents did it for her instead?",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "no that is not accurate.\n\nshe knows that if there are consequences to not cleaning, she should clean...\n\n...as you have found out, the amicable agreement path doesn't work with her unless there are some teeth behind it.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "The parents are the worst for making her deal with that bathroom.  And for being mad at you when you are at the end of your rope.  Have you asked them what it is they are going to do now, since they said you should come to them?",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "The first time I saw a used pad on the floor I would’ve thrown that either at her door or on her bed... without warning.\n\nThat’s a biohazard and in my opinion, is way worse than a shit stain in the toilet.\n\nBut, I completely understand your shit stain comment.",
          "id": 82,
          "comments": [
            {
              "score": 2,
              "content": "It's objectively more of a bio hazard because a shit stain in the toilet is in a controlled environment DESIGNATED for the disposal of that kind of waste, therefore it's fine. So used pads on the floor is worse due to the fact that blood, and other forms of bodily waste that is discarded during a period is left exposed to an environment where bacteria tends to end up, and so it becomes a breeding ground. It puts the sister at risk of getting sick because she has to clean it up",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 776,
      "content": "NTA. \n\nTo make your family realise how dire this is, create a family group chat, and EVERY TIME something is disgusting in the bathroom, click a picture and put it on the family chat, \n\nSoon she will start cleaning.",
      "id": 84,
      "comments": [
        {
          "score": 375,
          "content": "Don't forget to add the the boyfriend to the group chat as well ;)",
          "id": 85,
          "comments": [
            {
              "score": 82,
              "content": "Oh fuck, this is gold. I don't know why I never thought of this.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "I really should do this with my flatmates",
          "id": 87,
          "comments": [
            {
              "score": 77,
              "content": "I did this for a year... the tension that builds throughout a lease from this level of passive aggression just isn’t worth it. Be direct, or plan your exit.",
              "id": 88,
              "comments": [
                {
                  "score": -2,
                  "content": "[deleted]",
                  "id": 89,
                  "comments": [
                    {
                      "score": 11,
                      "content": "No dude. Sometimes you have roommates that just dont clean their shit. If you dont mention it, their shit will never be cleaned, and you all will live in a sty, or you become their maid. Just dont be an arse about it, and you wont lose friends.",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "There's a word for this kind of behaviour. Doormat.",
                      "id": 91,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "if you want to stay friends with them, don't do it. my roommates and I did it and it caused everyone to get defensive and shitty, it's better to just ask them to do it (one on one, not in a group chat where they could get embarrassed)",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "I would not be unopposed to snapping pix of the bathroom when it's dirty and posting to social media. And tagging her. \"Sister, clean your shit.\" Nothing like good ol' public humiliation to cure bad behavior.",
          "id": 93,
          "comments": [
            {
              "score": 15,
              "content": "i don't really agree for a family dispute and something on the more private side like this thread, but your comment reminded me of a recent tweet\n\nhttps://twitter.com/Nadeshot/status/1178875729850748929",
              "id": 94,
              "comments": [
                {
                  "score": 0,
                  "content": "I'd look at that but I don't have Twitter.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Pretty sure you're allowed to look at it without having an account??",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "This is good. Very good. <Machiavelli has entered the family chat. >",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "This is a little nicer than my first instinct - if she finds the bathroom trashed by her sis, livestream that shit straight to facebook.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "You can also post it on Facebook, not necessarily tagging her, but that might get people outside your family talking, and that would embarrass her and hopefully your parents too... See how they like that",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Underrated advice.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 420,
      "content": "NTA. I’m not bothered that her boyfriend saw it and she was embarrassed.  She should be embarrassed! Not by her period but that she won’t clean up after herself. Actions have consequences and this one is pretty mild.",
      "id": 101,
      "comments": [
        {
          "score": 118,
          "content": "This! It’s like...she shouldn’t be embarrassed about pooping, but she definitely should be embarrassed by taking a shit on the floor. What on earth is going on here?",
          "id": 102,
          "comments": [
            {
              "score": 48,
              "content": "I mean, personally I'd be at least slightly embarrassed if I forgot to flush a turd.",
              "id": 103,
              "comments": [
                {
                  "score": 6,
                  "content": "In the middle of the night when I get up, I always use the bathroom and typically forget if I flushed because I forgot one time since I was half asleep. Now I usually get in bed and then panic and go check, only to find out that I got back out of bed for no reason, lol.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 374,
      "content": "Hahahah I’m inclined to say NTA on this one. You know where she could put them so her boyfriend wouldn’t see? The trash.",
      "id": 105,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 182,
      "content": "NTA. \n\nI almost threw up at the whole pad thing. That is absolutely disgusting. No one wants to see that, let alone smell it. \n\nI would have done the same exact thing. Take matters into your own hands. \n\nDoes she suffer from depression? I would wallow in my own self filth for days when I went through a tumultuous depression bout. If she doesn’t and is just a lazy piece of shit, continue humiliating her.",
      "id": 106,
      "comments": [
        {
          "score": 60,
          "content": "It seems beyond that. Your own filth is one thing, to make others live in it is a special kind of disgusting asshole. Hopefully her boyfriend was disgusted and walked! People like this are beyond asshole.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I feel like even depression doesn’t make sense with the pad thing. If she weren’t showering that could be depression, and depression could maybe explain not brushing the toilet too. But it’s literally the same amount of energy used to put the pad in the trash can next to the toilet, which would be substantially better even if she still left the panties on the floor.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "People with depression usually don't clean at all. It could be an out of sight out of mind issue but more likely she doesn't give a shit about leaving a mess for her sister.",
          "id": 109,
          "comments": [
            {
              "score": 8,
              "content": "[deleted]",
              "id": 110,
              "comments": [
                {
                  "score": 2,
                  "content": "Absolutely, depression affects everyone differently.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Hearing this makes me question I ever had depression despite being told I had it as a teen. I still wasn't a disgusting pig because I couldn't stand messes.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "It sounds more like she's attempting to dominate her brother. As a depressed person, I'm very familiar with the feeling of shame, and I doubt she'd be this brazen about it if she felt any semblance of shame.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 103,
      "content": "A lot of people saying that the OP shouldn't have done this, and yet offer no other reasonable ideas.",
      "id": 114,
      "comments": [
        {
          "score": 25,
          "content": "Precisely. Their only reasonable course of action is to continue to ignore the situation and just accept it. Personally I don’t think she went hard enough. I think my reaction would be to dump all that mess into the parent’s bathroom. They don’t want to deal with it? Well, now they have to.",
          "id": 115,
          "comments": [
            {
              "score": 12,
              "content": "That would've been catastrophic. She might've been grounded for a long time.",
              "id": 116,
              "comments": [
                {
                  "score": 9,
                  "content": "I don’t doubt it. That’s why I would have continued to do it ad infinitum until the parents connected the occurrence with the other sister’s actions. What’s easier? Simply speaking to the sister, or putting locks on their doors to prevent the mess transfer?",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "She could have left it out in the open but just not on something that is unavoidable to anyone wanting to use that door",
              "id": 118,
              "comments": [
                {
                  "score": 5,
                  "content": "That's just my sister and me though. My parents have their own bathroom, and her boyfriend always goes to the bathroom downstairs.",
                  "id": 119,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "If this was the first time, I feel like it would be justifiable to say he's wrong. However, this is a reoccurring thing and I'm totally on OP's side here.",
          "id": 120,
          "comments": [
            {
              "score": 3,
              "content": "Absolutely agreed.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I don’t think the OP shouldn’t have done what she did but personally I would’ve opted for throwing the dirty clothes/underwear she leaves on the floor either in the dumpster (and telling her afterwords so she can go retrieve them) or dumping everything on her bed/desk and annoying/inconveniencing her so she starts cleaning up after herself  rather than embarrassing her.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 93,
      "content": "ESH of course you’re an AH for doing this but your sister is the bigger AH for treating you like her maid for the last year. I’m unimpressed with your parents reaction tbh as you tried to get their support. Sometimes you need to be a bit of an AH to get your point across and this is exactly how I taught my daughter to deal with issues - reason, escalate, then (reasonable) consequences.",
      "id": 123,
      "comments": [
        {
          "score": 42,
          "content": "Why is OP an AH? She's just giving the mess back to the person who made it. I have thrown my husband's dirty clothes back in his room when he doesn't put them in the basket.  Years ago I threw my brother's dirty dishes in his room. If you want to live in filth. Keep it in your own space.",
          "id": 124,
          "comments": [
            {
              "score": 5,
              "content": "Putting it on the dirt handle is kinda punishing the boyfriend. He might not mind it but used pads are pretty gross",
              "id": 125,
              "comments": [
                {
                  "score": 14,
                  "content": "I get what you're saying.  But what else could OP have done. From her post and her comments, it seems like she exhausted every reasonable option.  If embarrassing her for her actions in front of the one person whose opinion she cares about is the only way;  then so be it. The sister obviously knows how disgusting it is to leave dirty pads around.  Otherwise she wouldn't be embarrassed.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I don't think she's wrong for doing it and tbh it's a pretty funny way to get back at her sister. I just think its a bit unfair to the bf,  but hopefully the sister learns so it won't happen again.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "What Mortem001 said and what you said. Sometimes you need to be a bit of an AH to get your point across - and making innocent parties suffer is kind of an AH thing to do. IMHO though, OP is a justified AH.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Nah they're not TA, you're not an a hole every time you stop letting people walk over you like that, you're the A hole when that's your first reaction to the situation.",
          "id": 129,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 74,
      "content": "NTA, you gave her fair warning and didn't pull anything that over the top, and besides, people need to clean up after themselves. Everyone's guilty to a degree when it comes to being unclean, but lines must be drawn somewhere and people must be reminded.",
      "id": 130,
      "comments": [],
      "relation": "Support"
    }
  ]
}