{
  "post content": "My brother after 5 years of university moved back with us until he begins his military duty, so he is staying here for 4 months. He is living in the same room as I do. But this is my last year of high school, that means much time on studying...His sleeping schedule is terrible. He sleeps multiple times the day and not sleeping at night. He sleeps at least 4 hours at the \"no-sleep-time zone\". The problem is that I am studying at the same room and I can't get the job done in a dark room and with someone snoring like crazy (he is snoring waaaaay too much). Most times I end up in the dinning table which isn't the most comfortable place to study, I am far from everything I need and the table is next to the kitchen that can easily provide with a variety of unpleasant sounds (people cooking, drinking water etc).  Both me and my parents had argued with my brother for this thing. Am I The A-hole?",
  "id": 1,
  "comments": [
    {
      "score": 8,
      "content": "NAH. Your brother needs to sleep, but you also have things you need to do. Is there any other space you can use in the time that he's staying with you?",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "Well, except the dinning table. No there aren't other choices. But yeah I might live with that..",
          "id": 3,
          "comments": [
            {
              "score": 1,
              "content": "This might be a bit drastic, but what about a friend or relative you could stay with for while your brother is there?",
              "id": 4,
              "comments": [
                {
                  "score": -1,
                  "content": "What? Why should the high schooler move when the deadbeat adult is the problem?",
                  "id": 5,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "INFO: does he have a job?",
      "id": 6,
      "comments": [
        {
          "score": 3,
          "content": "He can't have a job. All the contracts are either 6 months or 12 months and he has to join the army in 4 months. He is looking for something part time but yeah, don't really need it!",
          "id": 7,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "Okay so if he’s not doing anything, he’s the asshole, you’re NTA - he needs to respect your space.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH He is going through something and needs to find a different space to sleep. Laundry room? Large closet? Heated garage? You should not have to follow  a unconventional/unreasonable sleep schedule.",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NAH He’s on a different schedule to you, it’s okay for him to live his life; maybe this is a good opportunity for you to practice your communication and negotiating skills to come up with a solution which works for both of you. If he’s ignoring your needs and requests, just turn the light on/open the blinds in your room when you need to study and see how quickly he changes his schedule.",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "You’re looking for validation. \n\nOf course you don’t have to study around his schedule. \n\nYour parents suck for putting you in this situation and bro sucks for not sleeping on the couch if he can’t maintain regular hours. \n\nIf you can’t study, study in your parents’ room, the library, or the backyard until he leaves. \n\nIf you can study with music on, ask parents to split the cost of noise canceling headphones with bro.  And he should buy a sleep mask so you can have the light on.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy brother after 5 years of university moved back with us until he begins his military duty, so he is staying here for 4 months. He is living in the same room as I do. But this is my last year of high school, that means much time on studying...His sleeping schedule is terrible. He sleeps multiple times the day and not sleeping at night. He sleeps at least 4 hours at the \"no-sleep-time zone\". The problem is that I am studying at the same room and I can't get the job done in a dark room and with someone snoring like crazy (he is snoring waaaaay too much). Most times I end up in the dinning table which isn't the most comfortable place to study, I am far from everything I need and the table is next to the kitchen that can easily provide with a variety of unpleasant sounds (people cooking, drinking water etc).  Both me and my parents had argued with my brother for this thing. Am I The A-hole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Your brother may have a sleep dysfunction that could benefit from medical care (e.g., a CPAP machine). How that would work out in the army, though, is more than I can say.",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": -1,
      "content": "NTA - he’s a grown ass man with nothing but downtime. You’re in school and actually needing to do work. Maybe he should find a job that doesn’t involve murdering people over oil so that you can actually succeed in school.",
      "id": 15,
      "comments": [
        {
          "score": 1,
          "content": "You’re a fucking idiot",
          "id": 16,
          "comments": [
            {
              "score": 0,
              "content": "At least I’m not a murderer",
              "id": 17,
              "comments": [
                {
                  "score": 0,
                  "content": "Ya just ignorant to the fact that without the military the simple little things you enjoy like being a goof on reddit would be taken away from you.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Not sure how my freedom got all the way over in Iran’s oil fields but okay",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    }
  ]
}