{
  "post content": "I f(20) and husband m(22) have been getting in a lot of fights. I am currently 38 weeks pregnant and I have rules for when the baby comes. No kissing, and no pictures of the baby posted online. I also wanted to not have visitors for the first two weeks, which was denied because \" its not fair for everyone else\". My husband had a talk with mil and fil and a huge dispute happen. My mil was not happy with the no kissing rule because she said \"She loves having babies on her chest and kissing them\". My husband tried to enforce the rule but she was very upset. He came to me and told me to allow her to kiss the baby on the head and I said no kissing a new born because of disses and germs. He told me I need to make a compromise and give that up to make his mom happy. I don't want to because people can't simply understand that kissing a newborn in dangerous. He tried doing a lot of math and statistics to show me it's not a big deal and how unlikely the baby is to get sick. He told me I am being absurd and controlling, and since other people will follow my other rules, then I should allow his mom and grandma to kiss the baby. To which I said no still, and it's not negotiable because they can all wait. Then I exploded when he told me that he invited them to come up 2 hours after the baby was born. Because according to him  that is all I need to recover. I don't want people there right away because I will be in pain, bleeding, and still dirty in a gown. Not to mention that there will be people coming in to look at my private parts often after giving birth. I feel like the hospital should be my safe space to recover and bond with the baby and that the decision to invite people when I am ready is up to me, not to him. He said that it is his baby too, and it's not all about me. His mom is also very pushy and manipulative to the point where she told him that she wouldn't come meet the baby if she could not kiss it. She has also made comments that attacked me about my body size and the babies size. She has also claimed the baby as \"My baby\". She is just notorious for not following rules and doing whatever she wants.So am I the a-hole for not wanting people there right away and kissing my baby?\n\nUpdate: \n\nI talked to my husband today when we where heading for our final growth ultrasound since I have gestational diabetes. He told me that he stood firm with his parents and that they will not be kissing the baby. But he still thinks I should surprise his mom by allowing her one kiss in the back of the babies head. To which I still said no because they can wait till she gets her vaccines, since none of then will be vaccinated. I clarified that people can come meet the baby right away, but first I have to be okay from delivering He said he will wait till I am ready and that we won't have people there for long. Which makes me feel much better because I been having horrible experience throughtout my pregnancy, at the hospital. I just know I will be in some much pain after this, and I want to feel good before entertaining people. When he told me about the discusión he had he made it sound like he backed out of what he had both previously agreed on. But he did not. I also have agreed to let him have people over, with the one condition that I will not be taking care of his guest. And if I want the baby back for feeding or to sleep they need to give me the baby and respect the fact that we will be tired. He assured he will take care of his guest, and the house, and the boundaries. Today he asked me how he can help me feel less stressed out. I told him he could help me clean and get ready for the baby. He just left for lowes to build the baby a changing table attachment for the crib. He also agreed to not let people make more rule comments about my size and the babies size, or in general he said he will call out any rule comments towards me. As I have heard many through this pregnacy like \"you are too small\", \"you are starving the baby\", \"You don't look pregnant\". Just pretty much comments that where attacking me since they had \"big healthy babies\". My baby is supper healthy but she won't be 10 pounds as my family only has 6 to 8 pound babies. But I am glad he won't let people, keep making me feel bad. Or be rule to me. I think all that was needed was some time and more talking.\n\nUpdate 2: \n\nThank you all for the advise. I think that my husband was just upset and scared when he said those things. We where both upset, and ge felt like I was trying to leave his family out of out our babies life and dictate all the rules, without him having a say. Which I get is not fair of me because he is right that once that baby is out we are both going to have to be together and make decision for a little person. Which I was not trying to do. I am a high risk pregnancy and a lot can go wrong with me and the baby. I dont know how weak we will both come out of this experinece.However he now understands that I will be vulnerable and that after I give birth it is about my recovery and time together as a new family. I also talked to my mom and she thinks that I just just need to lay back and let people come to the hospital to meet baby right away because they are excited. However she said to not let them stay for long periods of time and take away that bonding time because that is selfish and rude of them. Because it's not about them, but they have the right to meet the baby right away since they are the babies family. My MIL is still not happy and has called many people to complain about how she should be able whatever she wants. Some people have told her it's not her child and to just respect the rules. To which she just hangs up. My husband I think started to see that this kinda absurd of people because they feel entittled to our child. So he said that if people don't follow the rules he will take the baby and kick them out. I also added this to my birth plan, and plan to have  a nurse supervise the visitors when they come in for more support. It's hospital policy that only 2 people can come up at a time  so that makes me feel much better. Since there is a smaller chance I will attacked and ambushed by the people in his family that dont agree with me. I can compromise to having people go in meet the baby and let us rest, heal, and bond. Right now me and husband have both agreed that I just need to stay calm, and relax as I have been having some complications from the stress of this whole situation. For those saying I knew what I was getting my self into. I knew how bad it was with his the other grandchild, but his mom was nice to me until I got pregnant, and she became judgmental and territorial of the baby inside of me. We had also planed to not have kids but unplaned pregnancies are a thing. They also had talked many times about how they apologized to the my husbands brothers wife for trying to hold and kiss the baby while they where sick and how they knew better now. But it's clear now that they have still not learned, and that it was an empty apology to the other DIL. I think I will be going into labor soon, as I have had a lot of signs in the past 2 days. I am just patiently waiting, and I trust my husband to be by my side and protect us.  He is not abusive, and we have been together for about 6 years now. We have never had this issue before and it's mainly because I had never been previously attacked or made feel bad by his mom until I got pregnant. Not to mention, she does not engage in the rude behavior around her son. For example after our baby shower she got me alone before she left and told me \"take care of MY BABY\", she made sure he was not around.",
  "id": 1,
  "comments": [
    {
      "score": 3912,
      "content": "oh god OP, NTA, and put your foot down **hard** on this one. This is literally the life of your child. Head on over to /r/JUSTNOMIL , you'll be in good company there.\n\n\nHe's trying to make you cave because he knows his mom won't and you're the path of least resistance, since you actually have empathy and aren't a raging narcissist. My words to him in response to the statistics would be \"You'd rather risk your baby becoming a damn statistic than say no to mommy? YOU'RE 22 YEARS OLD, YOU'RE MARRIED AND YOU'RE ABOUT TO BE A FATHER. GROW THE FUCK UP.\"\n\nDon't forget that you as the mother do have the right and the ability to kick anyone you want, including him, out of the hospital room during and after labor. You can tell the nurses who is and isn't allowed, and they will physically remove any unwanted visitors from the room. **Again, this is your baby's life.\n**",
      "id": 2,
      "comments": [
        {
          "score": 1415,
          "content": "I told him that he would rather meet his moms emotional wants rather than keep her from those small chances of being sick and potentially dying. I called his mom selfish, and he said I was selfish too because the no visitors for the first day at hospital. He said I was making it about me just like she was with kissing the baby. He told me that he could leave and go live with his parents. If I just wanted to be alone and have this baby all to myself. He told me good luck getting to the hospital by myself. But I don't want him gone because I don't want to do this alone.",
          "id": 3,
          "comments": [
            {
              "score": 1700,
              "content": "Are you on good terms with your family? Because if you have family who is not emotionally abusive, then you might consider staying with them for a while. \nIf not, do you have any friends in the area who could help you? Or even not in the area, any close friends who might be willing to take you in?\n\nIf whoever can help you is out-of-state, this is actually an ideal solution because it's going to make it much harder for him to get custody.\n\nI do see a custody battle in your future, because at the moment you're married to an unrepentant momma's boy and random reddit commenters  have more concern for your baby's health than the baby's own father, 🤮🤮🤮.",
              "id": 4,
              "comments": [
                {
                  "score": 1296,
                  "content": "He is an abuser.  If she doesn't do what he wants, including doing something that medical professionals recommend for newborns' safety, he threatens to leave and take away all her support network, knowing she cannot.\n\nHe legitimately would rather abuse his wife and risk his baby's safety to placate his mommy.  He's s selfish AH and so is his trash mother.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 450,
                      "content": "Don't forget he said 2hrs is all the time she need to recover.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 67,
                      "content": "I’m so worried about this poor woman right now :(",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 50,
                      "content": "I would gladly volunteer to drive OP to her mother's home to make sure she is surrounded by the support she needs.\n\nOtherwise, she is headed towards a very stressful delivery and postpartum with this AH and his mother.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -6,
                      "content": "Everything isn’t abuse. He’s being manipulated like he has his entire life.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 361,
                  "content": "Yes, please try and stay with someone else. He isn't just a mommas boy, he simply doesn't care about you. And this is bad for you and the kid. Get away a far as you can, this man will be no help.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 147,
                      "content": "He and his mommy are using you as an incubator for HER new baby. Run far, run fast, before the birth.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "I don't think he even likes her. I'm so sorry, but he probably thinks OP is just an incubator. Wth.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I don't think he even likes her. I'm so sorry, but he probably thinks OP is just an incubator. Wth.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 82,
                  "content": "Move if you have to, to be with someone who does care. \nBoth my kids had a 2 week rule. Guess what I said? See you in 2 weeks. They had rules about vaccinations. ( I  already had them, but would have gotten more.) Social media rules? Sure. Both of my kids let me spend time whenever I want now, because they know I follow their boundaries.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Our friends just had a baby, and although they haven't vocalized any rules, I'm not even comfortable going to meet baby when I haven't had my flu shot this season and they're not even a few weeks old. Babies keep - she won't spoil if I don't see her right away.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "In my family/friend group, it's typical to visit new babies at the hospital or right after they come home (everyone's fully vaccinated, washes hands, no kissing, keeps visits under 30 minutes, etc). I can imagine myself feeling disappointed if someone didn't want to do this, but I can't imagine myself arguing about it with the parents!",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 253,
              "content": ">But I don't want him gone because I don't want to do this alone.\n\nI'm so sorry... but it will probably be easier to do it alone than to do it with a husband like this. You know he's bad news.",
              "id": 17,
              "comments": [
                {
                  "score": 78,
                  "content": "100% the hospital staff would be better than this guy. But I hope OP has family she trusts or one or two very close friends she can rely on instead.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 84,
                      "content": "Right? Tell the L and D nurse why you're alone, you'll have the most supportive care ever. Those nurses are tough as nails and protective.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Yes, this is true. I banned my husband from every birth after the first (he was worse than useless) and had wonderful support from the nurses.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I've been the support friend for a couple of laboring mothers, and hospital staff has mostly been awesome about that.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "OB nurses tend to be a bit protective of their charges. Pitbulls in scrubs is what I called mine",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 243,
              "content": "Ask him, if he just shat out a baseball, would he want to have some  time to recover and rest and deal with the pain and mess, or would he want your mother visiting right away, while he’s exhausted and in pain and covered in the mess that comes from that kind of massive effort.\n\nYou’re not being selfish, his mother is.  Her want to meet the baby while you and the baby are both recovering from birth are more important to him than you getting a chance to clean up and rest and get any needed medical treatment after one of the most physically demanding things the human body can do.",
              "id": 23,
              "comments": [
                {
                  "score": 202,
                  "content": "When my first child was born, I had family there within 20 minutes.  Too much family.  Two hours later they were still there, and even though I was feeling pretty good physically, I was TIRED.  I wanted to go to sleep, and these people wouldn't go away.  If it had just been my family, I could have asked them to go home, but it was my in-laws, and at that point, I wasn't comfortable telling them to essentially go away.\n\nFor the second birth (twins), I laid down rules.  First, no one could come for at least a few hours, as DH and I needed some time to just look at the babies, and say 'wow, look what we did'.  Secondly, our son was to be the first to see the babies ahead of anyone else.\n\nI had only a couple of people there the first day, and they weren't there until we were ready for them.  It made it so much easier on me.  Take my encouragement to set boundaries.  I wish I'd done so the first time.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 55,
                      "content": "When my little sister was born, my dad and I were the only people to visit them in the hospital.  Both sets of grandparents lived within an hour’s drive, so they had the theoretical ability to come, but everyone had the sense to wait until after the new baby had come home and gotten settled to visit.  I don’t think my parents had to argue with anyone about it, either.  As I recall, they gave a bit of time for my parents to get settled at home, too, but I don’t remember how long that was, because I was not yet 4 years old.  But I do remember that it was special that I got to go see my mom (who I cared a whole lot more about than the theoretical newcomer) and that it was just for us - my parents, me, and the new baby.  I didn’t get to come until the morning after my sister had been born, either; my mom’s parents had me overnight so my parents could have some time to themselves immediately after the birth.  Whenever I hear about new mothers being flooded with unwanted visitors right after birth, I reflect back on what I remember of my sister being born and wonder why it isn’t obvious to people to let the new little nuclear family be together for a bit before everyone goes gaga over the new arrival.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "When my first was born it was a revolving door of family members and I was constantly exhausted. When I had my second it was my husband for the birth, my MIL + Mom + older daughter at different times 30 hours AFTER the baby was born. NTA op.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "This sounds awful, I'm sorry. I'm pregnant with our second and the only people who will be welcome in the hospital are my husband and son. Everyone else can wait and idgaf",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "In my family, there is always a battalion of family members in the waiting room as soon as someone goes into labor. Out of love, but still, it's a lot. I gave birth during covid, so only my partner was allowed in the hospital. It was so nice not having to worry about entertaining other people or having privacy for medical things or while trying to nurse for the first time or wondering when they would leave and I could hold my own baby or sleep. I would honestly recommend not having visitors while in the hospital.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I'm sure you meant basketball!",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 159,
              "content": "A supportive, loving husband would not say this. Have someone on deck to be your super person in labor in case he throws a fit and isn’t helpful. Also, keep your foot down on this. If you give in on this, you’ll never be able to set another boundary with them again. Please note he’s putting his mom before your and your baby’s well being :(",
              "id": 30,
              "comments": [
                {
                  "score": 37,
                  "content": "My husband agreed with my rule that his folks couldn't come for 6 weeks. His mom is overbearing, and their visits involved cooking and entertaining ( they came from 2 states away, and that's what they expected). He let my mom come because he knew she would HELP.\n\nMy husband said You're the one going through this, you do what you are comfortable with.  When he told his mom, he said this isnwhatbhe decided.  He didn't throw me under the bus.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 137,
              "content": "Tell the nurses when you deliver that you don't want anyone besides your husband in the room.  When you move to postpartum with the baby, tell the nurses there too.  They will make sure you don't have people you don't want there.",
              "id": 32,
              "comments": [
                {
                  "score": 61,
                  "content": "☝️This. You are the patient. Your partner is not. The patient gets to decide if there are visitors and the nurses are happy to be the bad guys and keep everyone away.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "Nah, he doesn’t need to be there either if he’s not going to be supportive.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 5,
                      "content": "That's up to OP.  I'd also support her picking a different support person or hiring a doula or going it alone or whatever else she decides.  I just wanted to make sure she knew that she should proactively tell the hospital staff to keep others out so she doesn't have to deal with the drama of MIL sneaking into the room.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Exactly!",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -6,
                      "content": "Birth of his child > he should be there. Kick his ass out after.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Yep. Let them know they are to let no one come up without YOUR express consent.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 118,
              "content": "Girl, these are alllll red flags. He lacks emotional maturity and is trying to manipulate you. \n\nI had a baby as a single mom by choice and it’s the best thing ever. No one bossing me around, no one forcing my baby to do unsafe things, etc. \n\nYou can do it without him.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 108,
              "content": "Honey, you are worse than alone right now- you are being mistreated. You don't deserve to be treated that way ever, but to treat you the way they are when you need the most support and respect is the absolute opposite of love. They are attacking you because you are in a vulnerable position- physically and emotionally and they are exploiting it- but you can protect yourself from them. What they are doing is extremely wrong and sadly, it is not very original. The hospital and the laws are designed explicitly to protect you in this situation.\n\nYou are not the same as his mother, he is trying to make it equal in order to ignore that it **is your right to decide** about *your infant*. She has no right. **He** has no right. The first few months after birth it is most important for you and your baby to stay close to *you*, to learn how to feed and bond- it is a medical fact. Anyone & everyone around you should be fighting for you to do that, not fighting with you to interfere with what is healthy. Hospitals will also confirm that kissing babies is not safe. You are correct and they are trying to make you feel crazy. You aren't.\n\nYou are the mother of your child and it is **not selfish** to protect your newborn.\n\nHe just threatened to leave you. He will make that threat any time you dont give in to whatever he or his mother wants. Do you want to raise your child under that threat? Don't just let him, *make him* go live with his parents.",
              "id": 40,
              "comments": [
                {
                  "score": 67,
                  "content": ">He just threatened to leave you. He will make that threat any time you dont give in to whatever he or his mother wants.\n\nThat's actually the most disturbing part of a pretty disturbing post.  Husband puts his mother's obsession with kissing the baby (creepy) over the actual health of his own child.  WOW and so ironic that he accuses OP of making it about her when, in fact, it's his mother who is making it all about herself over the baby.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 11,
                      "content": "This! OP is not making it about her; she's making it about the health and safety of her baby. \nMIL is the one making it all about herself. But the first defense of narcissists is accusing everyone else of being selfish for setting reasonable boundaries.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "Want some anecdotal evidence? We just spent 36 hours in the hospital because my newborn got a COLD. Thanks, big brother toddler plague carrier!  We were lucky too. Rhinovirus was the least of things that could have caused his fever. He's doing great but it was scary. One of the scary things it could have been was herpes, which you get from kissing! So yeah, your rules are good. And yeah, don't have people visit in the hospital. Much better to wait until you get home.",
              "id": 43,
              "comments": [
                {
                  "score": 12,
                  "content": "That must have been really scary. Hope your baby is doing better now.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 22,
                      "content": "It really was. Fevers in newborns can be deadly. He was lucky and it was just rhinovirus and was better in 36 hours but you can't know that until they do all the tests. He's happy as a clam now and back to normal.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "Omg, the delivery IS about you because you are the one who is giving birth! Your husband has one job - to shut up and do what you ask him to. He is being a very huge abusive asshole to you and does not give a shit about the baby, judging by the \"getting to the hospital\" comments. Do you have any family who could support you? It is time to reach out and ask for help.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "NTA\nWow what an AH is your husband. He's manipulating you into doing what he and your MIL wants.\nI'm so sorry he's saying these things to you. You DON'T say those things to your (pregnant) wife. I understand you don't want to do this alone. But if you'll let him have his way now, who knows what will come up in the future. And if someone has the guts to manipulate you right before you're having this baby I'm worried about what is coming. He needs to step up and be there for you. You've been carrying this baby for almost 9 months and are going in labor so you have a say in who can be there and not. And you said to your husband you don't want visitors the first 2 weeks and he went behind your back and said to your IL's they can come after 2 hours? Thats not up to him!",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "“Don’t forget that you as the mother […] during and after labor.”\n\nThats really all that matters. Its astonishing how many soon to be mothers/fathers post pretty much the same as in the post in here. Sadly many people don’t seem to understand that the parents have the final word when it comes to boundaries with their newborn. (And those boundaries are far from unreasonable.)\n\nOP, please please please get them to respect your boundaries. Do not let them stress you out even more, you’ll have to deal with enough PP stuff. Good luck to you and your new family :)",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": ">He's trying to make you cave because he knows his mom won't and you're the path of least resistance, since you actually have empathy and aren't a raging narcissist. \n\nTHIS EXACTLY\n\nOP, show your spineless hubby that yours is made out of thungsten when it's about protecting your baby. \n\nAnd either MIL complies to the rules or she can see the baby via ZOOM.\n\nNTA",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "NTA. Tell the hospital staff that no one except for your husband is allowed in the room unless you say otherwise. Your concerns are not unwarranted. YOu do not kiss a newborn unless you are the mother. You do not allow people around your child you do not feel safe with or respected by. Keep your boundaries. Reinforce them with the hospital staff. You are going to be a wonderful mother.",
          "id": 50,
          "comments": [
            {
              "score": 2,
              "content": "Yes, her Mamma Bear nature is starting to wake up.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Let the hospital staff know ahead of time that no one is allowed in your room except you, the baby, and your husband. No visitors. No exceptions. Even if your husband personally escorts them into the hospital. \nNurses on the L&D floor are experts at handling overbearing MILs. They'll keep her out. \nAnd if she somehow manages to sneak in with another group, press the call button and have her escorted out immediately. Do not reward her by letting her hold the baby, or even see him properly. \nMy dad desperately wanted to see his grandchild ASAP after I gave birth. My mom is sane, however, and told him if he even tried to see me before the following afternoon (let me sleep, eat, shower, and deal with all the medical checks in the morning) he would be sleeping on the couch for a month.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 593,
      "content": "NTA.  Your boundaries here are very reasonable.  As far as the hospital, as the patient you can set limits on who is allowed to visit and the hospital will enforce them.  If you tell them that his family can’t come, and that you expect them to try anyway, they’ll keep watch over your room and bounce people on your “do not allow” list.  If your husband and his family can’t be trusted to respect your desire to rest, recover, and bond with the baby, ask the hospital to help you, because they will.\n\nSure, it’s his baby too, which is why he’s allowed.  It’s not his mom’s baby or his grandma’s baby, so they need to wait until *both* you and he are ready to have visitors.  He doesn’t get to override you like that.\n\nIt’ll be harder to fight him about people kissing the baby, because you won’t have the hospital staff ready to defend you, but you’re right there, too.  Only the people the baby lives with should be kissing them during its first month of life.  RSV is a mild cold for most adults, but it can be hospitalization or death for a newborn.  Why does your husband care more about his mommy’s delicate fee-fees than he does his baby’s health, maybe even its life?",
      "id": 53,
      "comments": [
        {
          "score": 318,
          "content": "Also there was a story on tifu last week of a lady who didn't know she had a cold sore and she kissed her baby's head and it literally infected her baby via her scalp.  That shit is deadly to a newborn and the vast majority of people have no idea they have it and probably have had it since they were a kid. \n\nNo kissing, die on this hill op.",
          "id": 54,
          "comments": [
            {
              "score": 101,
              "content": "Death of infant article linked. [Babies straight up die.](https://nypost.com/2018/10/25/mom-claims-newborn-contracted-fatal-herpes-virus-from-kiss/amp/)\n\nEight days old. Infected within 12 hours of birth. Attacked her spinal cord and lungs.\n\n70% of adults have HSV, and some may never have had an outbreak.\n\nDo *not* kiss little newborn babies! It's such a simple thing. Even if you have never had a single known cold sore outbreak, you can still be an active carrier for HSV and infect others. Babies have such underdeveloped systems they cannot handle the infection your body manages without a single symptom.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "I read that. It was heartbreaking.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Thats so sad. A few years ago when my nephew was like a a few weeks old he got pink eye and the only thing they could think that would cause it was from him being around so many people and giving kisses and being all in his face that it transferred that way since he wasn't old enough to touch anything that was infected. Until then i never realized how easy it is for newborns to catch stuff.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I think I read the same story. But he knew he had a cold sore (found out in the comments). He just didn't think it would cause an issue on the top of her head.",
              "id": 58,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": ">Only the people the baby lives with should be kissing them during its first month of life.\n\nNot even them! \n\n70% of adults have HSV, but for many it's non-genital. My understanding is that, in addition to c-section babies, it's possible that someone with HSV can give birth vaginally but not infect their child during childbirth...and then later infect them with kisses.\n\nWhat this means is that even parents shouldn't kiss their child's hands, face, or head during the first month! Everyone I know will kiss their baby's tiny feet or just try to not kiss at all at first.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "To be clear, even her husband isn’t “allowed” at the hospital if OP, the patient, says no.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 390,
      "content": "You know you don't have to have your husband there either right? Take someone who gives a shit about you and leave him home with his mammy.  NTA",
      "id": 61,
      "comments": [
        {
          "score": 35,
          "content": "You can tell the hospital and nursing staff that certain people cannot see you. They will handle the fireworks if she tries to get in. Bless them.",
          "id": 62,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 297,
      "content": "NTA\n\nYour husband should not ask you to compromise so that his mother is happy. Your husband has a duty and an obligation to ask HIS mother to make compromises so that his wife, who has just given BIRTH, is tired and discovering motherhood, is less stressed.\n\nYou need to have a serious discussion with your husband. The most important thing is not other people's feelings or whether it's \"fair\", the most important thing is your well-being. Before being the baby's room, the hospital room is YOUR room as a patient recovering from CHILDBIRTH. Your husband didn't give birth and should be your support when you're tired and at the end of your rope, not your enemy. If he isn't planning in respecting your requests, talk to the nurses and forbid visits.\n\nAnd by the way, kissing a newborn is extremely dangerous and can land him in hospital. Ever heard of RSV ? You should send a link to your husband and let him meditate, he's putting his mother's whims before his baby's health and life.",
      "id": 63,
      "comments": [
        {
          "score": 234,
          "content": "I already told him my reasons, to which he said a kiss on the back of the head is not a big deal. I have told him about RSV and my cousins baby are getting nearly dying, and yet he still believes one kiss when they come to the hospital is not a big deal. His grandma also has a compromised immune system, and if we allow his mom one kiss, they will both expect more.",
          "id": 64,
          "comments": [
            {
              "score": 175,
              "content": "He doesn't even have to agree. If he sees that it bothers you so much, it should be enough for him to stop arguing. I have to admit I'm a bit worried about what's going to happen next, because your husband doesn't support you in your decisions when you're at your most vulnerable, and I have a feeling he might give in to your MIL's wildest desires.\n\nIt's not going to be easy, but hang in there. Don't allow any kisses. Don't allow any visitors. Get help from your family if they're around. Talk to the nurses about your concerns.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 103,
              "content": "Its not just RSV, the amount of people with herpes of the face who don't know it's in the saliva is staggering, often we can contract it as a child and never have signs of ever having it. But it can be passed on so easily and can kill a new born.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "[Babies have died from kisses.](https://nypost.com/2018/10/25/mom-claims-newborn-contracted-fatal-herpes-virus-from-kiss/amp/)\n\nIt's not just the outbreak of flu, RSV and COVID. It's HSV which kills babies literally every year because either A) people don't know or B) they didn't listen.\n\nYou MIL will at this point absolutely lie and say she won't and show up and do it anyway.\n\nThere is no world where her wants and entitlement outweigh your child's safety and this is 100% the hill to die on. Is there a large chance your baby is harmed by a kiss? No. There isn't. Is there any harm to your baby from no kisses? No. So why take the route with any risk of harm when the other path is completely zero risk?\n\nYou take the zero risk path.\n\nIf you have friends or family in the area who will back you up, get with them. You do not need people who will try to break down your smart decision-making post-partum. You want someone in that room who when your husband inevitably asks, 'seriously just let my mom...' tells him to shut the fuck up. This isn't about his mom. This isn't about what keeps the peace. This is the health and safety of an hours old baby and the recovery of a person who just birthed an entire human. Get an advocate for you for when you are tired, exhausted, overwhelmed, anxious, on drugs, asleep, etc. Keep that person close.\n\nYour husband is siding with his mother and is threatening abandonment during the end stages of your pregnancy. That is so far outside acceptable behavior.\n\nThere is zero reason to trust he won't try to pressure you in the hospital or allow his mother in. Tell your nurses to ban her from the hospital room and make sure your MIL doesn't see baby at all. Those are reasonable rules based on medical advice and you know it. She will absolutely lie and kiss baby and there's no reason to trust her adhering to rules. Not right now.\n\nYou are making solid choices. Do not doubt that. Husband needs to check his ego and evaluate if he wants to be a husband and father or stay attached to his mother's skirts.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "I would have mandatory MASKING for everyone who touches my baby for the first month ***at least***.  Covid, RSV, colds, flu germs are everywhere right now.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "https://reddit.com/r/tifu/s/nonObEpXqv",
              "id": 69,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "also make sure that everyone is vaccinated with TDAP so your baby will be protected from whooping cough.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Given that grandma-to-be talked about loving to kiss babies on their cheeks, she wouldn't stop at the back of the head.   He wants you to accept her lie and then she will take as much as she can grab in both hands.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "NTA. You and I both know it won't be just one kiss. Also, if anyone has the herpes virus/coldsore, it can absolutely kill your baby since their immune systems aren't developed yet.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 253,
      "content": "NTA.\nIt's sucks that he cares more about his mother's feelings than the safety and wellbeing of you and your baby. \nYou should be focusing on your upcoming birth, preparing to welcome your baby, not being stressed about people crossing your valid boundaries. \nYour mother in law sounds insufferable and manipulative.",
      "id": 73,
      "comments": [
        {
          "score": 235,
          "content": "I literally don't want to go into labor now and just keep the baby inside. I am so stressed because I don't feel supported or like people care about what I need. I have not been able to sleep for the past few days. I'm just thinking about how I might have zero support after the baby is here. I don't feel safe giving birth without feeling supported.",
          "id": 74,
          "comments": [
            {
              "score": 328,
              "content": "OP, tell the nurses at the hospital \"no visitors period.\" Let them know it's very serious. They are there to support you. Maternity wards are heavily locked down. No one can just wander in. Heck I wanted my MIL there for the birth, she was on the list, and they still asked me if I was sure before allowing her in.",
              "id": 75,
              "comments": [
                {
                  "score": 45,
                  "content": "this, theyre so kind and supportive.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yes! I was going to comment something similar. I don’t know for a fact but I’m pretty sure that if you tell the nurses or the doctors that you don’t want anyone in there they’ll listen to you because at the end of the day you are the patient not your husband.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "This. If your husband won’t respect your boundaries, make sure the hospital will. IMO any and all boundaries a pregnant person establishes surrounding their pregnancy / birth process are valid. Nobody else’s vote matters, quite frankly. \n\nVery sorry about your experience, hopefully things resolve in a way you’re comfortable with - good luck with the birth!",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 96,
              "content": "I’m sorry but ur husband seems like a massive dick. He can’t even stand up or support you during pregnancy and labor?? When ur at ur most vulnerable and when u have a small baby coming along the way :(",
              "id": 79,
              "comments": [
                {
                  "score": 2,
                  "content": "I'm a man but I believe most men \n/husbands would just be ignorant to the stresses of labor, especially for their first child.\n\nLike we know it's painful but many think once the baby is born then that's it, everything for the woman is instantly back to normal.\n\nOPs husband might not mean to be an asshole, he might just be very uninformed.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Speak up for yourself. Inform the hospital staff that you do not feel safe at home or with husband’s family. Good luck.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "OP please share these feelings and your situation with your doctor. There are support services for you but you won’t get them unless you let your doctor and nurses know you need help and why. Do not be embarrassed or feel ashamed. I promise you, they won’t judge and they’ve seen it all.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Tell the nurses and staff that no one else is allowed in. They will enforce it",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "What about your family? Can you go stay with them straight from the hospital?",
              "id": 84,
              "comments": [
                {
                  "score": -9,
                  "content": "Hell no she can’t go stay with your family! Why on earth would you suggest that? Are you trying to kill this baby? Her mother is likely to kiss or worse want to hold that baby! We need to all chip in and rent a sterile bank vault and then weld the door shut for 18 years so that no dirty person will ever come into contact with this helpless child.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I meant OP's family not her in-laws",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 144,
      "content": "When men shit out watermelons for the same duration as their wife giving birth, then they can have a say in how long before visitors and the rest.  It amazes me that people think birthing a human is like an afternoon stroll.  NTA.",
      "id": 87,
      "comments": [
        {
          "score": 19,
          "content": "Seriously though. Maybe she should make him watch a video of another woman giving birth and then ask him if he still thinks 2 hours is enough time to recoup afterwards. Either way though it shouldn’t have to come to that. He just just respect what his wife is asking for, which is really not much. Shame on MIL for even assuming she would be okay coming 2 hours after the baby was born, she fucking had kids herself.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 135,
      "content": "NTA\n\nI don't know what statistics he's cherry-picking, but pretty much every major medical outlet tells you not to let anyone kiss your child for 2-3 months. There are a multitude of reasons for this that all have to do with potential illnesses. Your child's health is more important than their feelings. Repeat this to them over and over.",
      "id": 89,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 75,
      "content": "NTA. You need to talk to the hospital and nurses about who can be in your room post delivery. Tell the nurses that any family members are not to be let in!! Most nurses will have your back on this because they understand what it’s like. This is your choice and your BF clearly doesn’t understand what it’s like to give birth. This is your choice and yours alone. Good luck!!",
      "id": 90,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 59,
      "content": "NTA- you’re the one giving birth. While you’re in the hospital, when you get there, tell the nurses you don’t want any visitors except who you want to be allowed in. If you’re in the US, they check IDs before you’re allowed to go on the maternity floor. Tell your husband if he’s not gonna respect your boundaries, then when you’re discharged, you won’t be going home with him. You’ll be going home with your mother. Send him a video of babies with RSV. It is very real and can be very deadly. You also should tell him that people that are going to be visiting the baby need to have a current T dap shot. Yes, it is his baby too, but it’s his job to put you and the baby first and deal  with his family. If he refuses to, then, as a mama, you can put your baby safety first. If he cannot respect your boundaries, that were put in place to protect your kiddo, then he can come visit you as much as he wants to at your mothers house. That will give you a safe place to recover. It’s OK to have boundaries, and that’s your mother instinct kicking in. Listen to that. You really do need to put your foot down now, or it will get worse and you will be over run with his family. I would have a serious discussion with him that it’s time to put you and the baby as his priority and stand up to his mom. Your baby is a real life person, not a toy. What she wants, simply doesn’t matter. You owe her nothing.",
      "id": 91,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 59,
      "content": "> \" its not fair for everyone else\"\n\nFairness is irrelevant when it comes to giving birth, and recovery. There are only 2 people who matter at this time: Mom and baby. This is not a game, and a newborn isn't some cake that should be distributed evenly.\n\nNTA.",
      "id": 92,
      "comments": [],
      "relation": "Support"
    }
  ]
}