{
  "post content": "Husband responded to a video of a woman revealing excitedly (to her husband) that she was pregnant and the man looking DEFEATED. \n\nI said ‘damn then he should have stayed off her’ \n\nhusband said ‘well we don’t know what she did’.\n\nI said ‘well that’s a revolting response to a video I thought we’d both find funny’\n\n\nHe’s mad I said revolting, I’m mad, who is the asshole or do we both suck?\n\n\nEdit: I may be the asshole because I thought his insinuation was random and unnecessary to the video when the husband contributed to the pregnancy risk.",
  "id": 1,
  "comments": [
    {
      "score": 173,
      "content": "Eh. Apparently you thought it was really funny that this guy was having a child he didn't want, so... I don't think either of you come off particularly well. ESH",
      "id": 2,
      "comments": [
        {
          "score": 42,
          "content": "Not entirely sure how OP thought they were going to come off looking good 😂",
          "id": 3,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 138,
      "content": "Why would a man being upset at a pregnancy announcement be funny, anyway?  Sounds like a shit situation to be in. And yeah, plenty of women sabotage their birth control.  And sometimes birth control fails. Your reaction is pretty revolting to me...  \n\nYour \"joke\"wasn't funny.  Congratulations, you played yourself.  YTA",
      "id": 4,
      "comments": [
        {
          "score": 42,
          "content": "This. I have an ex-friend who used to constantly make jokes about hiding one of our friends birth control or tampering with it so she’d get pregnant because my ex-friend thought it would just be the best thing ever to have a baby around. To make it worse, we were like 17 when she tried that.",
          "id": 5,
          "comments": [
            {
              "score": 28,
              "content": "I’m glad that person is an ex-friend.",
              "id": 6,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -20,
          "content": "Are you paying attention? HE made the joke about sabotage, not her, and she has every right to feel disgusted. Make sure you know what you're talking about before jumping down her throat.",
          "id": 7,
          "comments": [
            {
              "score": 7,
              "content": "The irony of you saying other people don’t pay attention...",
              "id": 8,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Yes, that's what I said.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 74,
      "content": "Are you not aware that you also made an insinuation with your \" ‘damn then he should have stayed off her’ comment? YTA",
      "id": 10,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 57,
      "content": "YTA for laughing at a pregnancy that one of the parents doesn’t want. That’s a shitty situation for the kid to be in. That’s tragic, not funny.\n\nAnd women absolutely lie about birth control usage to have more children when their partner doesn’t want more kids, so your husband was right- you really have no idea if this was a situation where the woman straight up lied to her partner about BC. Reproductive coercion happens to both men and women.\n\nThanks for the r/arethestraightsok material though.",
      "id": 11,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 36,
      "content": "why are you upset over such a minor interaction. he's right. you don't know their situation. i don't know what you wanted him to say. sorry he didn't find it funny i guess?",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 36,
      "content": "YTA - I don’t think his comment was in any way “revolting”. I sort of think you laughing at someone with an unwanted pregnancy is a bit revolting.",
      "id": 13,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 28,
      "content": "YTA\n\nThere was nothing incorrect or inappropriate about your husband’s response. In fact, I’d say his was far more appropriate than yours. Presumably, you don’t know anything about the couple. Maybe he just found out that she had been cheating on him. Maybe she’s abusive. Again, you don’t know, which is exactly what your husband said.",
      "id": 14,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 25,
      "content": "YTA why would you think that’s a funny video? It sounds sad more than anything else? And putting the entire blame for an unwanted pregnancy on the guy is what’s revolting here.",
      "id": 15,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 20,
      "content": "YTA. Your husband didn’t say anything wrong. You watched a video with a guy being sad he was a father, your husband is right - there IS a chance she did something untoward. I don’t even know why you’re loser at him.",
      "id": 16,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 16,
      "content": "YTA A video of a guy not being enthusiastic that he's going to be a dad is funny. But your husband making a comment (I guess that she tampered with birth control?) is \"REVOLTING\"? Where's the logic?",
      "id": 17,
      "comments": [],
      "relation": "Attack"
    }
  ]
}