{
  "post content": "I (M26) am a second generation French immigrant to the US. I speak French and most of my family lives in France, so I try to make a trip back to France once or twice a year.\n\nI have been dating an American girl (F24) for two years now. My girlfriend does not speak French at all. The actual events in question happened this winter.\n\nI usually go to France around Christmas time. The most recent Christmas, my girlfriend wanted to come with me. I said sure as she had never been to France before and we'd been dating almost two years so it seemed reasonable. \n\nMy family comes from the South West, but I also have family in Paris so we stopped in Paris first. My gf wanted to eat at a fancy French restaurant while we were there, something with Michelin stars. Expensive, but not really a problem since I make pretty good money.\n\nWe made a reservation for a good restaurant, not the best but still good. We had to make it months in advance because it's a restaurant that's high in demand. As a very upscale restaurant, there was also a dress code and things like that.\n\nWe showed up and everything was fine at first. They took our coats, we sat down, the restaurant was beautiful, etc. The waiter then gave us our menu. I had to do all the communication as my gf doesn't speak French.\n\nI was showing my gf something on my menu and she noticed that mine had prices and hers didn't. I had completely forgotten about this tradition because it's just not common at all in the US.\n\nShe asked me why mine had prices but not hers. I explained to her that it was just a tradition in many upscale French restaurants. She called it sexist and said it was ridiculous. I told her that it's just the way it is in these kinds of places, and that we shouldn't have come here if she was upset by this.\n\nShe wanted me to ask for a menu with prices for her. I refused because we already had the prices and I didn't want to make a scene. She demanded that I confront a waiter about it or she would walk out. I called her bluff and she ended up staying, but didn't talk to me for the whole meal, which was delicious by the way.\n\nWe've been back home for several months but she keeps bringing it up. I'm honestly considering ending the relationship over this because she will not stop talking about. She keeps accusing me of being sexist (I'm not) and has been making ridiculous comparisons.\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 26697,
      "content": "YTA - All you had to do was say \"Sir, my companion would appreciate a menu that includes the price list.\" It seems unlikely this would have caused a scene. He's a waiter responsible for customer service. It may be tradition, but I highly doubt it's restaurant policy to refuse to share their prices with their female clientele.",
      "id": 2,
      "comments": [
        {
          "score": 14876,
          "content": "Im confused as to why she couldn't ask for the menu herself..... did she think that was a mans job?\n\nEdit: She cant speak french, I read poorly. I am an ass",
          "id": 3,
          "comments": [
            {
              "score": 14256,
              "content": "probably because she doesn’t speak french",
              "id": 4,
              "comments": [
                {
                  "score": 3627,
                  "content": "This cracked me up for some reason. Thanks!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 55,
                      "content": "Read it in Roger from American Dad's voice.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1703,
                  "content": "I feel like most upscale restaurants in Paris would have English speaking waiters, but I could be wrong.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 2178,
                      "content": "Why would they speak English? It's a French restaurant in France. Do you think most upscale American restaurants have waiters that speak French?",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "I have no idea. OP just said in the post that he was the one doing all the communicating with the waiter because he speaks french and she doesn’t",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Even though I speak French well enough, every Michelin starred restaurant in Paris I’ve ever been to will speak English with you.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "It’s a Micheline restaurant, waiters should be able to speak English there.",
                  "id": 11,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "But it doesn’t mean the any of the waiters can’t speak English. It’s not 50s anymore. Young French people can often speak English.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I don't understand this argument. Every waiter (and anyone who deals with tourists) MUST speak English in Poland or he wouldn't get this job. Why would it be different in France?",
                  "id": 13,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Can't read the menu either tho.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 272,
              "content": "I bet no one told you yet, but she cant speak french",
              "id": 15,
              "comments": [
                {
                  "score": 23,
                  "content": "Its a Michelin star restaurant in paris... they definetly spoke english and probably had staff that spoke a dozen different other languages if necessary.  people travel from all over the world for fine dining in paris.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Oh no i was just making a joke since like 10 people decided to tell them the gf didnt speak french",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 156,
              "content": "It's Paris and in a fancy restaurant no less, there should be a waiter that knows how to speak English. I've been to France several times, majority of restaurants in Paris will have people who can speak English. If they were in a small town, it would have been understandable.",
              "id": 18,
              "comments": [
                {
                  "score": 21,
                  "content": "Many people in France speak English but many don’t like to to American or English tourists until they try to speak French first. Like they’ll pretend they don’t speak English lol. But at a fine dining establishment I would expect waiters would speak English right away to a tourist if they speak it.",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": ">.\n\nShe may not have realized that, though.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "OP mentioned that his girlfriend doesn’t speak French, and that’s probably why she asked him to instead of asking herself.",
              "id": 21,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "I’ll bet a million dollars that at a Michelin restaurant, the waiter speaks enough English to get a menu.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "It doesn’t matter. Almost all waiters and waitresses speak English in Michelin starred restaurants \n\n(At least in my experience)",
              "id": 23,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "To be fair, if they're an upscale restaurant in Paris, they speak English too.\n\nEdit: grammar because I guess I dont speak English",
              "id": 24,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "I worked in Europe a few years ago, and every restaurant I ate at had English speaking wait staff. OP is bullshitting us.",
              "id": 25,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "No, this is a fair question. High end restaurants in Paris 100% have waiters who speak English.\n\nHell, everyone in Paris speaks English.",
              "id": 26,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "C’mon every upscale Paris restaurant has English speaking waiters.",
              "id": 27,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2387,
          "content": "I agree with you. I imagine that the reason she was so upset and kept bringing it up was because of the way the conversation went. If OP agreed with her that the tradition was sexist, he should have said so and sympathized. But many times, people feel that if there's a problem, they should start thinking about solutions (totally reasonable) and they skip past the part where they just listen, discuss, and sympathize about the problem. So OP heard her talk about the menu and said, \"Well, what should I do - ask for a different menu?\" instead of something like, \"Oh, I've never thought of it like that. You're right, it is sexist that they assume all men will pay. What an awful tradition!\" OP your girlfriend may have felt dismissed and belittled by the way you talked to her about this. Probably the best thing you can do now is listen to her, empathize with her point of view, and talk to her about your points of common ground.",
          "id": 28,
          "comments": [
            {
              "score": 1615,
              "content": "Just to clarify, the tradition is for only the person paying to receive the prices. Since OP was the one most likely paying (A native taking a non-native to dinner and also a man taking a woman on a date), he received the menu with the prices. If one were to take a business client to dinner, they also would receive a no-price menu. The idea is that the person being treated to dinner shouldn't worry about price, and just pick what they would like.\n\nI do agree with everything you said though.",
              "id": 29,
              "comments": [
                {
                  "score": 586,
                  "content": "But how do they know who is paying?  Like how can they tell who is being treated? Do they ask beforehand?",
                  "id": 30,
                  "comments": [
                    {
                      "score": 803,
                      "content": "Whomever made the reservation/asked for a table. Also, it could be that the server is a bit sexist and just assumes the guy will be paying. If it's ambiguous, it could be nobody gets a blind menu.\n\nIn this specific scenario I assume OP got the priced menu because he spoke the native language, and the girlfriend did not.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "I mean, in the US, they virtually always put the check down in front of a guy on a date. Same tradition, just a little more subtle.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "That’s why it’s sexist.  They assume the man is paying.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "This is absolutely not true, I am a French speaker and my bf is not, I've taken him to a fancy restaurant that I had reserved and I did all the talking when there and still got the menu without prices. We quite enjoyed making a dramatic exchange of the menus. I have also taken my French team (20 people) out to dinner, again I made the reservation and clearly lead the group into the restaurant, and was one of the few not to be given prices.. but I still got the bill as they knew I was paying lol. I am super annoyed at this tradition, but my female French colleagues think that it's hilarious I'd even be bothered.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "I'm not sure that's true. In the US, it's called a ladies' menu and is by default given to the women, because \"traditionally\" it's expected he'll pay.",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 684,
              "content": "[deleted]",
              "id": 36,
              "comments": [
                {
                  "score": 298,
                  "content": "He could have also literally just swapped menus with her. This whole thing is definitely about his reaction and potentially large concerns it sparked about his opinions about gender roles, etc, than about the actual situation.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 36,
                      "content": "I KNOW! Why didn't they just switch menus?  Girlfriend says \"I want a menu with prices,\" OP says \"here, have mine,\" problem solved.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "That was my first thought. Just switch & all of this could've been solved quickly. Unless she couldn't understand a custom, that happens in the US as well depending on the restaurant. I've only been to three like that & all were very expensive, but there are some in the US too. I really don't see the huge issue in all of this. Also if I were dating someone that spoke another language I would try to learn at least some, at least enough to order food. I took French in highschool a gazillion years ago but I can still read enough I could figure out a menu & if I was unsure of how to pronounce it, just point to what I want. This whole experience is something I would've laughed at or had fun with, not complain about it for months.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Yeah, it's not even a difficult solution to the problem! I agree, I would be upset if he didn't listen and consider my point of view, AND I would be upset if he didn't just ask for another menu.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Yeah to me, I would want my partner to have my back. Sounds like he just said well that's the tradition suck it up and get over it. You could say that about a lot of terrible traditions in history and nothing would ever change if that was everyone's attitude. A simple oh right that is sexist, lemme ask for a new menu real quick would have probably changed the entire evening. I also doubt girlfriend is still upset about the menu now as how her boyfriend reacted to a situation like that by telling her to just get over it.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "...and even if they're assuming men will pay, it's still handy for the person who isn't paying to see the prices, so they can be considerate of their partner's budget.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yes THIS EXACTLY THIS!!!  But instead what OP said was along the lines of “oh ho ho I never really thought about it because it’s no big deal and you’re silly to care that the restaurant automatically assumed I’m the one in charge here!”",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1611,
          "content": "Why didnt he give her the menu with the prices and he just look at the one without prices? But also, who really cares? Seriously this is petty af",
          "id": 44,
          "comments": [
            {
              "score": 354,
              "content": "I dont think she would accept that. She wasnt looking for a solution, she already knew the prices",
              "id": 45,
              "comments": [
                {
                  "score": 437,
                  "content": "She didnt want a solution she wanted her BF to defend her against a perceived slight.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 308,
                      "content": "An actual slight, not just \"perceived\".",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "Like Meegan from Key and Peele",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 840,
          "content": "It's not like there's no feminists in France either, not by a longshot. She wouldn't be some American imposing the foreign concept of \"gender equality\" on an unsuspecting populace.",
          "id": 49,
          "comments": [
            {
              "score": 563,
              "content": "It's not like Simone de Beauvoir was French or anything",
              "id": 50,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "Yeah and I've eaten in lots of restaurants in Paris and never encountered this \"tradition\". I did, however, see a chef come out and shout about how menstruating women needed to leave because his mayonnaise was not emulsifying. He was then shouted at by a number of angry Parisian women. I also saw hundreds of screaming arguments between staff and customers basically everywhere. It's weird not to cause a scene in Paris.",
              "id": 51,
              "comments": [
                {
                  "score": 21,
                  "content": "If you're in Paris and don't see something hilariously theatrical did you even really go?",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Well, now I finally understand why I can never get my mayonnaise to emulsify! It's been an aggravation for years",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Honestly, they probably already assume that Americans are annoying anyway, so asking for another menu wouldn't even be shocking to them in any way.",
              "id": 54,
              "comments": [
                {
                  "score": 17,
                  "content": "If you say you're American you usually get a tepid response.\n\nIn my experience, saying I'm from California, or specifically San Francisco, almost always gets a very positive response. For some reason I've found that a lot of French people absolutely love San Francisco.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 13,
                      "content": "It’s the bread.",
                      "id": 56,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 739,
          "content": "it is very much not going to cause a scene. especially at a high end place where service things like that are meant to be seamless. \nthey'll apologize and get her the standard menu.",
          "id": 57,
          "comments": [
            {
              "score": 323,
              "content": "> She demanded that I confront a waiter about it or she would walk out.\n\nThis is how a scene brews",
              "id": 58,
              "comments": [
                {
                  "score": 631,
                  "content": "No, this is how change is effected. If enough female customers get pissed about the menus, you bet your ass they're making some changes to their outdated traditions.\n\n&#x200B;\n\nedit: if you think that complaining about outdated/sexist traditions is \"forcing American culture on French people,\" please go to France (when possible) and realize that they do in fact have feminism in France.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 342,
                      "content": "I would ask for one with prices on, on principle. But I would be polite about it and do so myself. If it’s a Michelin starred restaurant in Paris they speak English.",
                      "id": 60,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I’m curious—did she want him to simply ask the waiter for a menu with prices or did she legit want him to bitch the poor guy out for “sexist policy”?",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 196,
          "content": "Garçon, ma petite fille voudrais un menu avec les prix, s’il vous plait!\n\nDisclaimer: have not spoken le francais since getting a solid B in university French over a decade ago\n\nEdit: according to google translate, I definitely meant petite amie",
          "id": 62,
          "comments": [
            {
              "score": 419,
              "content": "not sure she'd appreciate being called a little girl lmao",
              "id": 63,
              "comments": [
                {
                  "score": 224,
                  "content": "Literally his little girl as in my daughter",
                  "id": 64,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "Also, you shouldn’t be using garçon to address a waiter or so my French teacher told me years ago 🤷‍♂️",
              "id": 65,
              "comments": [
                {
                  "score": 10,
                  "content": "[deleted]",
                  "id": 66,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "\"Petite fille\" is a little/young daughter (or granddaughter) . Petite amie is girlfriend, although most people say \"copine\" (or \"copain\" for boyfriend).",
              "id": 67,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "[deleted]",
              "id": 68,
              "comments": [
                {
                  "score": 5,
                  "content": "I like \"ma belle amie\", it's a little less infantilizing.",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "[deleted]",
              "id": 70,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "\"He's a waiter responsible for customer service\" - oh boy, wait till you get to meet a Parisian waiter lol.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "This. Whether I’m paying for a meal or not, I’d prefer to know the prices before I order. I’d be asking for a menu too (or asking OP to ask if he’s the only one who speaks the language)",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I agree but I'm not sure I agree that it should brought up consistantly for months.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14367,
      "content": "\" I told her that we shouldn't have come here if she was upset by this\" how was she supposed to know?",
      "id": 74,
      "comments": [
        {
          "score": 6823,
          "content": "Especially since OP himself forgot it was even a thing.",
          "id": 75,
          "comments": [
            {
              "score": 4971,
              "content": "It's easy to forget sexist traditions are a thing if they don't impact you. OP claims to not be sexist but the fact that he thinks sexisim is okay because of tradition undermines his point considerably.",
              "id": 76,
              "comments": [
                {
                  "score": 875,
                  "content": "But it does impact him. The sexist traditions places the default burden of payment on the male. That is absolutely an impact on him.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 712,
                      "content": "True, I referred to the sexist culture more generally. It absolutely impacts men too, but because it devalues women overvalues men, it doesn't make men feel bad as often (still happens but not constantly like for women). It's like you had two people in a class and one got a higher mark than they deserved and the other one got lower. The latter one would be more likely to notice the unfairness, care about it and feel bad about it while the other one might just assume they did better than they though, be less interested to check it over and keep thinking the grading was fair.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "It doesn't impact him in a condescending way. I think that's the real point here.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Only kinda. He said its expensive but OK because he earns a lot. He always intended to pay.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I think a lot of men are ‘theoretical feminists’. In that they like the idea of equality and equity but don’t want to have to deal with any of it.",
                  "id": 81,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "This isn't even a sexist thing, the menu with price goes to whoever makes the reservation. OP made the reservation.",
                  "id": 82,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Especially when OP was disagreeing with her instead of communicating",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 89,
          "content": "Like I'm French and I don't even know about that \"\"\"tradition\"\"\"",
          "id": 84,
          "comments": [
            {
              "score": 31,
              "content": "The comments make it sound like it isnt one. Its tradition the person paid gets the price menu. OP just assumed the place was sexist, was fine with it, told his gf it was sexist and then explained that anyone who has a problem with there sexist policies should leave.\n\nFuck op might as well have said everyone who speaks french around them is taking shit about his gf and then tells her it's not a big deal when she gets upset. OP is TA for sure.",
              "id": 85,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "I get the feeling that calling it a tradition is a bad translation. This is 100% a sales tactic to get the person with no prices to spend more. \n\nI Took my parents to the fanciest place in my small city and found that they were extremely uncomfortable because of the prices even after ordering the cheapest thing on the menu.\n\nThe same thing happened to me when my in-laws took my wife and I to dinner one time, I felt uncomfortable with the prices and ordered the cheapest thing and was still uncomfortable about it.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "This is what got me! It's not like he told her before they went, \"okay, by the way, high-scale restaurants in France usually don't give women menus with the prices,\" and she said it was fine, then demanded a new menu when they got there. She (rightly so) pointed out a sexist tradition that she hadn't known anything about, and OP was too scared to upset his waiter by asking for a new menu.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "\"If you want to know the prices we shouldn't have come here\". We Jez op couldn't have been more condescending.",
          "id": 88,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9528,
      "content": "YTA she felt discriminated and you did not support her. And failed her as a partner. Tradition does not make misogyny ok. These restaurants should adapt themselves to modern society. Not the other way around.",
      "id": 89,
      "comments": [
        {
          "score": 3117,
          "content": "This, but i also feel like its just unfair on *both* sides. Expecting men to pay, and expecting women cant or won't pay.",
          "id": 90,
          "comments": [
            {
              "score": 3793,
              "content": "Most sexism is like that. It hurts everyone.",
              "id": 91,
              "comments": [
                {
                  "score": 1708,
                  "content": "There was a post I believe yesterday about a woman getting upset because her inlaws family would make the women wait until the men were done eating. And literally the food would be cold by the time they sat down. \n\nI'm not sure how that tradition hurt any of the men.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 1406,
                      "content": "I mean men who actually like their partners/sisters/female friends might miss getting to have a celebratory meal with them. I hate going somewhere with a man and then getting split-up from him because the women and men are expected to hang out separately. I think a lot of sexism that doesn't have an obvious negative impact on men, his negative for them in this way. If you assume women are actually valuable and desirable people to have in your life, all traditions that prevent women from equal participation prevent men from having as close or meaningful of a connection to have of the population. I guess I just like to think of myself as worthwhile company, whom the men at the table would miss if I wasn't there--and I think I am.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I think they also complained that some of the nice things they wanted were also gone by the time she could pick what she wanted. \n\nThen the rest of the family were pissed that she questioned it.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "If they wanted to learn how to cook or were unprepared to feed themselves when they moved out into the real world. Only the women cooked.",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "Yoo I dated this dude briefly who came from a super old-fashioned background and they did the same thing apparently and I was like FUCK.",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "That part of it surely benefited the men.  They got to eat hot food and I bet they were waited on hand and foot.  \n\nBut they are hurt by the other expectations that come along with that.  Machismo and male standing are often the \"measure of a man\" in cultures like that.  God forbid you're an artist, or gay, or your wife makes more money, etc., etc..  \n\nThey also tend to be the types of cultures that punish boys for showing feelings and then grow men who have no idea how to deal with the feelings they have in a healthy way.  \n\nEveryone loses with sexism.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I know guys who were raised with similar traditions and they can't figure out why none of their relationships last very long. That seems like a negative effect, especially when you consider how much divorce costs.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I wouldn't want to eat knowing my female friends and family were just not getting food.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 114,
                  "content": "I would say pretty much all sexism is like that",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Haha yes when we were dating my parents took my now husband and I out for a really nice meal. They gave the menu with prices just to my husband (and later the bill!) and he was so embarrassed - we were just starting out and didn’t have money for big meals (especially given my siblings were all there) it was definitely my parents treat - but they are a bit older so clearly decided my husband was the man for the job. Literally offended everyone in one go. Moral of the story: PUT PRICES ON ALL THE GOD DAMN MENUS.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "It stems from women literally not being able to work and have money of their own at all, therefore being unable to be financially independent. So I would say rather than expecting men to pay, the old ass tradition of “only men have access to money” plays a bigger role.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Even if the woman wasn’t going to pay, she should still have the prices. I mean, if a friend or partner was treating me to dinner, I’d be so anxious if I didn’t see how much I was costing them.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yeah this would give me a TON of anxiety. If somebody else is paying for me, not only was I taught to always order the cheapest possible thing, but I also have run into issues with men who can't even pay for that or are angry about having to. I much prefer to pay for myself.\n\nThat said.... I would have just asked him to see the other menu, which is what I do when there is only one drinks or specials menu. Sometimes in China there's only one picture menu. We make due.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 731,
          "content": "\"Tradition\" is basically saying: \"We do this for no real reason that I can think of so I'll just call it tradition and hope people don't notice\".",
          "id": 105,
          "comments": [
            {
              "score": 397,
              "content": "just because OP doesn't know the reason doesn't mean that no one else does.  It's a host's menu, the person who is paying and made the reservation gets the menu with prices as to not embarrass/pressure them or their guests with price concerns.  It's not that common in the US but some restaurants will do them for parties if you ask.",
              "id": 106,
              "comments": [
                {
                  "score": 243,
                  "content": "[deleted]",
                  "id": 107,
                  "comments": [
                    {
                      "score": 99,
                      "content": "yes of course (but in this case we knew he was the person who made the reservation), and I think OP was the asshole for not just asking for another menu. And I noted my experience is US based",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "It strains credulity imo for the waiter to assume that the person who made the reservation and speaks the native language would not be paying when their companion cannot understand the language. Irrespective of genders.",
                      "id": 109,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "It can be read as sexist, and anybody who gets upset and thinks the restaurant should instantly change is being imperialist and unreasonable.  \n\n\nMy company hosts a dinner at a nice restraunt each year. Our menus have no prices on it for anybody... it does makes sense the host maybe is the only person to see prices. Though sexist to always assume it's the man.",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "He probably made the reservation though. He's also the one speaking French.\n\nIn this scenario, he's obviously the one paying.",
                      "id": 111,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 39,
                  "content": "Not that common anywhere I've been, I've never seen any place do that(also, not from the US by the way). More to the point, if your only defence for something is \"it's tradition\" just own up to your ignorance and add \"and I don't know why it's done\". \"Tradition\" is not an explanation, it's a poor attempt at an excuse.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 15,
                      "content": "The person you're replying to didn't say it was common. In fact, they even said it was not common in the US.",
                      "id": 113,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Googling, that is a variant of the no-price menu tradition, but the \"Ladies' menu\" is a real thing, not something OP misinterpreted.  In the U.S., [the tradition was killed by \\[ETA: the shaming that accompanied\\] a court case](https://www.atlasobscura.com/articles/ladies-menus-no-prices-lawsuit).",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Exactly this - I've been places before with a \"guest menu\" (for example a lot of member's clubs do this), the person who made the reservation is assumed to be the \"host\" (kind of) and only they get prices, regardless of their companions' gender(s)",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 338,
              "content": "\"Tradition is peer pressure from dead people.\"",
              "id": 116,
              "comments": [
                {
                  "score": 19,
                  "content": "I might steal that for later!",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "All this talk about tradition makes me want to rewatch Fiddler on the roof.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 272,
          "content": "We can't know what they would have done if she made the reservation but in general, the menu with pricing is supposed to be giving to the host (the person who made the reservation) regardless of gender. So 2 guys, only the one of them gets the menu with the prices, 10 people only the one who made the reservation gets prices. \n\nWhile this appears to be a gender issue it's very possible it isn't and they gave the menu to the person's whose name the reservation is in. note it the no price menu did use to be called the \"ladies\" menu because there was a time when women didn't pay for dates but even in that time frame, the host would be given the priced menu (eg if you were taking clients to dinner, women taking all her grandkids to lunch etc)",
          "id": 119,
          "comments": [
            {
              "score": 118,
              "content": "In this case it was clearly about gender. I can tell you this from my many experiences of dining in France.",
              "id": 120,
              "comments": [
                {
                  "score": 22,
                  "content": "I've been to plenty restaurants in France and it's always given to the person who makes the reservation. My gf usually books and gets the menu with prices.",
                  "id": 121,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "It *could* not be about it, but it probably was.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "That’s what I was wondering, what happens if two people of the same gender eat together, or a larger family.",
              "id": 123,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "I've read that these typically are 'Host's Menus', and the person who makes the reservation gets the menu with the prices.",
          "id": 124,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7018,
      "content": "[removed]",
      "id": 125,
      "comments": [
        {
          "score": 2737,
          "content": "Agreed, YTA. Waiters/Waitresses couldn’t give a crap about getting a new menu.\n\n*source: not a waitress/waiter.*",
          "id": 126,
          "comments": [
            {
              "score": 1559,
              "content": "I was a waitress for +3 years, and I agree. I couldn't care less.\n\nP.S.: YTA",
              "id": 127,
              "comments": [
                {
                  "score": 886,
                  "content": "And above all the restaurant is in *Paris*, where loads and loads of tourists come every year from many different cultural backgrounds, and places like restaurants *have* to accommodate everyone. No one would bat an eye.\n\nSource : am Parisian",
                  "id": 128,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Nice tower, nerd! /s",
                      "id": 129,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Exactly what I was thinking, plus it’s an upscale fancy restaurant, they are used to accommodating people, that’s literally part of the reason why it is so upscale!",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1474,
          "content": "This. He was more concerned about how the server would feel than his girlfriend.",
          "id": 131,
          "comments": [
            {
              "score": 427,
              "content": "Yep. I’m sure him and the waiter will be VERY happy together",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 201,
              "content": "[deleted]",
              "id": 133,
              "comments": [
                {
                  "score": 21,
                  "content": "He didn't want *her* to make a scene and embarrass him. You're absolutely right.",
                  "id": 134,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "This. Honestly the gf might not have ordered differently with a priced menu, but its a small gesture to accommodate her. I dont think the gf really a shit rules of dining, but does probably care that her bf dismissed her bc a waiter might care????",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1046,
          "content": ">And jesus christ what was left out of the story that it got removed originally for violence?\n\nNothing interesting, just a nonsense analogy.",
          "id": 136,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 961,
          "content": "She smacked him over the head with the menu and asked him how much his menu said that cost.",
          "id": 137,
          "comments": [
            {
              "score": 354,
              "content": "Now that's funny rofl.\n\nAs long as it happened after she asked him to ask for a new menu.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "HAHAHAHAHA brilliant.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 491,
          "content": "[deleted]",
          "id": 140,
          "comments": [
            {
              "score": 327,
              "content": "That was my thought. Avoid the scene and make the girlfriend happy by just swapping menus. He said the prices weren't an issue anyway.",
              "id": 141,
              "comments": [
                {
                  "score": 667,
                  "content": "It's the sexist policy she had a problem with. Not the fact that she didn't know the price",
                  "id": 142,
                  "comments": [
                    {
                      "score": 26,
                      "content": "No, it's her boyfriend's *reaction* to the sexist policy. \"Yeah that's total bullshit, here take mine\" would  have solved the situation.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Completely understand that, but isn’t it kind of a dick move to visit another culture and then demand they adhere to your culture? She sounds like the kind of person who would show massive amounts of PDA in Thailand because she thinks she should be able to show affection to her partner everywhere and then get mad when she gets called out for it.\n\nI’m going with ESH because he could’ve shared his menu or politely asked for another, and she could have taken into consideration that there are cultural differences and learned a few basic phrases in French before she went. Fucking Americans, and I am one...",
                      "id": 144,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "now i don’t disagree that it’s an outdated sexist based tradition. but i don’t see this as something worth holding onto as long as she has. BUT he also should’ve just asked for a menu with prices, like there’s literally no issue with that. he should also recognize what her feelings were as a result of this, i feel like he’s being ignorant of that. but that being said, they were both being dramatic and i feel it is an ESH situation.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 481,
          "content": "Posing a possibility: did OP’s girlfriend simply want OP to ask for another menu with prices, or did she want him to berate the waiter for working in such a sexist restaurant?",
          "id": 146,
          "comments": [
            {
              "score": 312,
              "content": "I think you're on to something. It very much sounds like the purpose of the girlfriend asking for a priced menu was to make a scene, not because she was in any way inconvenienced.",
              "id": 147,
              "comments": [
                {
                  "score": 260,
                  "content": "That's what it sounds like. \"She demanded I confront the waiter.\" You gotta pick your battles. If she wanted him to say, \"I can't believe how sexist you are!\" nothing is going to happen. If it's anything like America the manager will come over and apologize and assure her no offense was intended, and everyone would go to the back and roll their eyes at this tourist demanding they change things for her. \n\nI was a waiter for years, this is exactly how it would have gone in every place I've ever worked.",
                  "id": 148,
                  "comments": [
                    {
                      "score": 114,
                      "content": "Agreed. The thing for me is that it's not her country. Hey, if she's in America and she wants to wage war against an American restaurant, I can see that. But she's in a foreign country, and I feel like it's not kosher to be the tourist lecturing people in their own country about their culture, not unless you've been seriously afflicted by it.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 54,
                      "content": "French restaurants and service is nothing like America. They would have ignored her or told them to leave. When me and my wife went to Paris we went to Michelin starred restaurant and the attitude seemed to be more you should be happy to be there rather than they are happy to have you.",
                      "id": 150,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 29,
                      "content": "The thing about the wording is that a lot of times on this subreddit, it is skewed in OP's favor. She may have wanted him to cause a scene, but I find it much more likely that he considers \"confronting the waiter\" simply asking for a different menu.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "In Paris she'd just be another boorish American. Tacky. Very tacky.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 240,
          "content": "Naw, it was before that.  He became TA right about here:\n\n>She called it sexist and said it was ridiculous. I told her that it's just the way it is in these kinds of places, and that we shouldn't have come here if she was upset by this.\n\nProper response: \"Yeah, you're right.  It's an old tradition they probably shouldn't be doing anymore.\"  Followed by asking for a proper menu.",
          "id": 153,
          "comments": [
            {
              "score": 12,
              "content": "Lol, no way, he was TA way before that!! \"my girlfriend wanted to come with me. I said sure as she had never been to France before and we'd been dating almost two years so it seemed reasonable\" he clearly couldn't care less about the girl he's been dating for two years... He didn't invite her, she asked to come and he couldn't think of a reason to say no! WTF... totally TA he SHOULD break up with her over this, it sounds like it would be doing her a huge favor, lol.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 188,
          "content": "You don’t understand—the waiter could have given him a side-eye for it \n\n*The Horror*",
          "id": 155,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 132,
          "content": "TBF, customer service in other countries, especially in France, especially in Paris in France, is not nearly the same as in the US.\n\nI don't think that the restaurant would have kicked them out or anything but I wouldn't be surprised if the Waiter laughed at his request.",
          "id": 156,
          "comments": [
            {
              "score": 41,
              "content": "He's allowed to laugh. And then he better get my god damned marked menu.",
              "id": 157,
              "comments": [
                {
                  "score": 30,
                  "content": "I don't disagree. I was just trying to point out that it is likely to cause a lot more of a social awkward scene going against the grain at a high end restaurant in Paris, than it would in say New York, by probably a large degree.",
                  "id": 158,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I don't doubt it. In New York servers work for tips.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Why? What could you possibly do to that the waiter, besides complain?",
                  "id": 160,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "That's because we pay our waiters, so they don't have to treat you like a royal in hopes that you might deem them worthy of being able to pay their rent.   \nBut it being different doesn't mean our waiters would mockingly laugh at a person's request.",
              "id": 161,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "At a high-end restaurant? lol no they wouldn't, you're talking out of your arse.",
              "id": 162,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "Have you been to a high end restaurant in Paris? Cause I feel like you pulled all of this out of your ass and you've never even been to France let alone a high end restaurant. Definitely not my experience in the places I've been to. High end restaurants sell an experience and bad wait staff would ruin their business real fast.",
              "id": 163,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "They probably wouldn't laugh at him in a Michelin starred restaurant.",
              "id": 164,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I live in a country that pays it's customer service staff a livable wage and at a high end restaurant you would not be laughed at for that request. Also have eaten at non-high end and high end restaurants in Paris and don't think that the request would be laughed at either.",
              "id": 165,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "And that he is willing to break up a two-year relationship just because she \"keeps bringing it up\", really mature. OP, YTA.",
          "id": 166,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6883,
      "content": "INFO: what happens if two women go out to eat at this restaurant?",
      "id": 167,
      "comments": [
        {
          "score": 9854,
          "content": "Hopefully no prices on either menu and the meal is free.",
          "id": 168,
          "comments": [
            {
              "score": 2326,
              "content": "Hah, if only! What if two men go to dinner there, do they pay double???",
              "id": 169,
              "comments": [
                {
                  "score": 4774,
                  "content": "They have to pay for the two women eating at another table",
                  "id": 170,
                  "comments": [
                    {
                      "score": 1009,
                      "content": "Username checks out",
                      "id": 171,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "lesbians win again",
                      "id": 172,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "Gonna have to try that. “Those two guys over there are paying”",
                      "id": 173,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Heh you made me laugh out loud.",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Then it’s double plus good and another blow to the patriarchy!",
                  "id": 175,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "They have to fight and the winner gets the menu. Helps you really work up an appetite.",
                  "id": 176,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 167,
              "content": "THAT's why every woman wants to go to Paris ;) For the food!",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Well, guess I'm moving to France!",
              "id": 178,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "That's a oui bit off I'm afraid.",
              "id": 179,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2055,
          "content": "Someone answered in one of the comments. The menu with prices is actually given to the host or whoever's name is on the reservation. So it's not exactly a ladies menu. If 2 girls went or 2 guys went or even if it was a group, it would be given to whoever made the reservation and everyone else would have the menu without the price.",
          "id": 180,
          "comments": [
            {
              "score": 1276,
              "content": "Agree.  This practice is customary in high end restaurants, even in the US.  I've seen it in NYC, Boston, Minneapolis, and Seattle.  As a feminist myself, I never saw this as sexist, but rather an attempt by the restaurant to increase likelihood the guest diner to order something expensive and not be intimidated by the prices.  I see the practice as more predatory than sexist\n\nEdit: maybe I was wrong\nhttps://nypost.com/2019/10/23/peruvian-restaurant-fined-for-sexist-ladies-menu/",
              "id": 181,
              "comments": [
                {
                  "score": 452,
                  "content": "I think both sides are right, it’s definitely a practice with sexist roots, but likely sticks around as a money grab. What guy wants this conversation on a romantic date... \n“Oooh I think I’ll get the duck”\n“Um, that ones a little expensive, is there anything else you were looking at?” \n“Oh sure, umm how much is the steak?”\n“It’s less, that one would be fine.”\n“Hmm... I’m kind of in the mood for something lighter though, what’s the price like on the lobster?” \n“Worse than the steak”\n“Anything else that’s not too expensive you think I’d like?”\n“Ummm... how about the prawns”\n“Sure, I’ll just get that.”\n\nAwkward AF, so instead he’d prob just say yes to the duck and she’d be oblivious to the financial hit she just accidentally caused him.",
                  "id": 182,
                  "comments": [
                    {
                      "score": 427,
                      "content": "To be fair, you shouldn’t be bringing a date to a restaurant, if their entrees could cause you a “financial hit”.",
                      "id": 183,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "My caveat to that is if I can afford to make reservations at a Michelin rated restaurant months in advance, price really doesn’t matter anymore.",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "You don’t go to that sort of restaurant if you can’t pay.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "> I see the practice as more predatory than sexist\n\nI imagine you could see it that way if you're caught off-guard having never been to this restaurant before, but on the other hand I could see it also being a perk for someone who has been to this restaurant before and wants to impress whomever they bring without them worrying too much about how much of the host's money they're spending. There have been times where I go out with my girlfriend because either she or I want to treat the other to a fancy dinner, and the one among us being treated always feels the need to be reassured that we can order whatever we want without worrying too much about the fact that the entrée is $60 or the drink alone is $15. I feel like it would be easier to just go somewhere where we know that the person not paying won't be exposed to any of that information whatsoever, so their decisions can be made entirely on what sounds good to them rather than whether choosing their second option would save $12.",
                  "id": 186,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Just out of curiosity, which place in Boston does this?\n\nI'm always looking for ways to troll my partner and an overly traditional place might do it. We went to the fancy steak place around Valentine's day, and I tried to get him to taste/approve the wine when they brought it over.",
                  "id": 187,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I think it towas Mistral, but back in  early 2000. Don't know if they still have those menus. My husband and I still laugh about that night.  They did this whole 'temove the silver food cover' thing will yelling VOILA!  then valet made fun of my husband's car because it had bird poop on windshield",
                      "id": 188,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Where in Boston have you seen it?",
                  "id": 189,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 225,
              "content": "This has never happened to me at high end restaurants I go to with one female friend (I am female also). We both got prices. I'm sure it's possible I have never been to these specific restaurants where this happens but I've been to a reasonable number of high end/michelin starred restaurants, in Paris and otherwise. It's not a hosts menu, it's for the gentleman on a date.",
              "id": 190,
              "comments": [
                {
                  "score": 87,
                  "content": "It’s never happened to me in Paris either, when I go with my husband to michelin starred restaurants we have both always gotten the same menu.",
                  "id": 191,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I thought it happened to me a few times, but then realized it was Prix Fixe and the only price that mattered was at the very top.",
                  "id": 192,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "If it were two women how would they know which one's name was on the reservation?",
              "id": 193,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": ">The menu with prices is actually given to the host or whoever's name is on the reservation \n\nNot necessarily the rule. I'm French and even when it's my girlfriend who books, it's me who has the menu with the prices",
              "id": 194,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Me and my wife went to a place like this in Paris and she got the money menu either because it was under her name or because she speaks French and did all the talking",
              "id": 195,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "So everyone talking about sexism is wrong? That's what I had figured. I'd say this post is NAH",
              "id": 196,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 657,
          "content": "This type of menu is called a \"host's menu\". Whomever made the reservation will receive this menu, regardless of if they're male or female. The point is to let your guest whom you invited to dinner pick the meal they enjoy, rather than worrying about the politics of cost.\n\nSo the answer, I guess, is whomever made the reservation and/or is the primary spokesperson.",
          "id": 197,
          "comments": [
            {
              "score": 278,
              "content": "Googling, that is a variant of the no-price menu tradition, but the \"Ladies' menu\" is a real thing, not something OP misinterpreted.",
              "id": 198,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 96,
          "content": "[deleted]",
          "id": 199,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 86,
          "content": "I think they only do this if they assume you're on a date, I think if a large group of people goes out to eat they will give everyone the menu with prices. Of course two women could be on a date (also two men) but I guess in that case they would want to play it save and give both parties a menu with prices",
          "id": 200,
          "comments": [
            {
              "score": 17,
              "content": "It depends on the type of group. If it's a large business dinner, then the boss (who made the reservation) pays/gets the host menu. If it's a family, then the head of the family gets it, etc. \n\nFor a group of friends they hand out prices to everyone",
              "id": 201,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "The point applies to any situation. You don't want someone intentionally picking the most expensive thing or being so anxious that they intentionally pick the cheapest. Someone doesn't host an top-tier restaurant party without being able to afford their own guests.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 38,
          "content": "I have eaten at Alain Ducasse in Paris with my wife (OP, is this the restaurant you ate at? Just curious!) where they have this tradition. We’re both women. She’s more masculine presenting/androgynous (wore a suit) and I’m very, very femme. I checked in for the reservation and when we were seated, the server approached me by name and offered me the “host’s menu” with prices. They offer this menu to the ladies traditionally, but it’s become something they give to the host (whoever the reservation is made under/is paying). It’s steeped in sexist tradition I suppose but I wasn’t offended by it. \n\nI’m going to go with ESH. You were being stubborn by not accommodating a perfectly reasonable request (the server doesn’t care what menu you have as long as you’re paying). You could have asked for a menu with prices for her, or switched with her. She acted childish by ignoring you for the entire meal and not just asking for a menu herself. I guarantee a Michelin Star restaurant in Paris of all places has employees that speak at least some English.",
          "id": 203,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 35,
          "content": "They get surprised by the bill?",
          "id": 204,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 34,
          "content": "What's supposed to happen and we don't know it didn't cause OP made the reservation, the host gets the menu with prices.  Whoever's name the reservation is in. I can't promise that would have happened(in theory they may have handed the man the host menu even though the reservations was in the womens name) but as a woman, I've had US restaurants do host menus and they have always given me the priced menu/or no prices (because I made the menu for the party in advance an already knew the prices)",
          "id": 205,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "I've seen this in the UK and my partner, who's a chef, explained it. The menu with prices is usually given to the person who made the reservation as they are the 'host' of the table. It's not actually about gender (not sure if this is different in France) - so if a female made the booking and visits the restaurant with a male partner, the female would be given the price list. It does come from tradition, as the 'host' would usually pay the entire meal.\n\nOP may want to check French Michelin star etiquette as their arguement could have been completely avoided if the menu price list is given to whoever the host/reservation maker is.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "This is a very good question.",
          "id": 207,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5267,
      "content": "YTA. She’s a bloody adult, she can see the cost of the food she’s ordering, even if you are paying for it. It really bothers people to not know the cost of things, and she probably wanted to know so she didn’t order like a $1000 dish or something. Oh, and it *is* misogynistic. Just because it’s “tradition” doesn’t mean it’s good or okay. The reason they give men the prices menu is because way back when, women didn’t have money of their own and were assumed dependent on a man. Continuing that “tradition” today just perpetuates the notion that women have to be supported by a man. \n\nIt’s not a tradition. It’s just a remnant of patriarchal misogyny. Would you call it a “tradition” for a country to not allow women to vote or have jobs, or be doctors or lawyers or engineers, or would you just say it’s sexist? \n\n“Tradition” isn’t a free pass for dickish behavior.",
      "id": 208,
      "comments": [
        {
          "score": 1337,
          "content": "It's not exactly because of this. The reasoning behind this is : if you're not paying and know the prices you'll end up not enjoying the meal as much because you're either self conscious about the price or think that more expensive meals would have been better. It is sexist to assume that the man is the one paying but in a work dinner only the chief would have had the prices even if said chief is a woman.",
          "id": 209,
          "comments": [
            {
              "score": 1067,
              "content": "Another commenter in this thread said that this tradition at fancy restaurants in France only occurs to the person who made the reservations. That supposedly if you even went with a group of guys, only the person who made the reservation would be getting the marked menu.",
              "id": 210,
              "comments": [
                {
                  "score": 936,
                  "content": "I don't understand why everyone is overlooking this host vs guest distinction among parties. It's not sexist at all, and honestly OP should include that very critical detail in case everyone honestly is just unaware. \n\nThe GF's sexism argument could only be applied to the waiter's assumption that OP, not her, was the host. But...  the reservation was under his name, he spoke for them both since she doesn't know French, and he is the one paying, so the waiter had zero reason to think otherwise.",
                  "id": 211,
                  "comments": [
                    {
                      "score": 492,
                      "content": "It doesn't really matter to the judgement though. What happened was that the GF felt it was sexist, neither knew it wasn't and instead of trying to make her more comfortable by  making a simple request he brushed her off.",
                      "id": 212,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I'd still say it's YTA, because the girlfriend has no way of knowing that, so it's not a surprise that she'd think its sexist, as there are many americans who still believe that men should be entirely in charge of their finances for their wives/girlfriends. All he had to do was calmly explain to her the root of the tradition. Instead he acted as though she was being a brat just because she wanted him to stand up for her when she believed she was being treated unfairly. \n\nHe could've told her the actual root of the tradition if he knew it, or he could've politely asked the waiter for another menu with the prices for her, he didnt have to act like she had to just put up with what she thought was blatant sexism.",
                      "id": 213,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Why didn’t OP just tell her it was because he made the reservation rather than letting her assume it was because he was a man?",
                      "id": 214,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Let's be honest here, sexism is totally at play here. That's why when the waiter gives the bill, he sets it in front of my boyfriend, and even when I'm paying they give the change back to him.\n\nI also went to such a restaurant. I made the reservation, it was in my name, and surprise surprise, I didn't get the menu with the prices, even though I was the one paying. And fyi, the couple next to us, two women, got each a menu with prices.\n\nSo yeah, those kind of traditions are rooted in sexism. It doesn't mean that the waiter or the restaurant are jerks, but it also doesn't mean those are outdated beliefs that can't be challenged, for example by asking a menu with prices for the lady.",
                      "id": 215,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "When my husband and I went to France, they gave me a menu without prices EVERY SINGLE TIME, regardless of who’s name the reservation was under or if we didn’t even have a reservation. Neither of us speaks French. How would they know who was the “host” in such circumstances? Clearly they assumed that the man was paying every time.",
                      "id": 216,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 162,
              "content": "Maybe they just gave him the menu because he made the reservation?  You can't really assume it's because he's a man.  What if the party is only women?",
              "id": 217,
              "comments": [
                {
                  "score": 183,
                  "content": "[deleted]",
                  "id": 218,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 147,
                  "content": "Let's be real, 95% of the time it's just handed to the man because it's expected for him to pay.",
                  "id": 219,
                  "comments": [
                    {
                      "score": 81,
                      "content": "You're 'being real' about practices at upscale French restaurants because you've worked at them and are familiar with them? Or are you just guessing about the reasons behind traditions of a culture different from your own based on what you know of your own culture?",
                      "id": 220,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "> because he made the reservation\n\n\nYou think they asked who made the reservation? Or assumed he did. Are you ever asked which of you made the reservation if you walk in as a couple?\n\n\n\nYes if it's a bigger party they don't do this. Or if it's 2 women and 2 men. But if it's a hetero couple they'll always give it to the man unless specifically asked otherwise (which they obviously don't mind). \n\n\nSo yea it's still sexist.",
                  "id": 221,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "This is interesting and does make some sense. However, based on his title noting that it's a sexist practice and his description, it doesn't sound like he's aware of this either.",
              "id": 222,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I think it’s possible that the restaurant wasn’t being sexist or TAH, but the guy was. The restaurant may have very well given a “host” menu to the person who made the reservation rather than a “ladies” menu to the woman. If it was indeed the former, this whole situation could have been avoided by simply asking for a second priced menu and there would have been no issue and OP is TAH for creating a needless conflict because he refused to ask a simple question. \n\nIf it was the latter and OP legitimately believed that asking for a second priced menu would cause a stir and wanted to avoid that, I think the least OP could have done is offered to leave with his GF. When someone vocalizes that they believe they are being discriminated against, they should not be pressured into staying in the uncomfortable situation. From OP’s post, it sounded like he was hostile to the idea of his GF walking out, which makes him TAH here. As someone who hates confrontation, I get the reluctance to make a scene about a menu, but he should have found a different way to have his GF’s back and walked out in solidarity with her rather than taking the stance that this is what it is and she just needs to deal with it.",
              "id": 223,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3391,
      "content": "YTA. Not a major one and the scales are tippy here, but the fact that you told her \"we shouldn't have come here then\" when she didn't know is what really frustrates me. She literally had no warning and it wasn't until she was already in the place that she was confronted with a sexist tradition. \n\nWho was actually paying genuinely doesn't matter because regardless of anything she was still exposed to an environment where she was given no agency based on assumptions about her gender. People in the comments say she \"still had access via your menu,\" but it is moderately demeaning to have to lean over your boyfriend's shoulder like a little kid to get a look at what something costs. \n\nIt wasn't unreasonable for her to ask and I highly doubt it would've made a scene if you politely called the waiter over and asked them, you just didn't want to deal with the discomfort of going against the grain for six seconds in order to help your girlfriend not feel like she was being treated like less of an adult and less a human being. Even someone who's not paying has plenty of legitimate reasons to need to be able to look at prices. \n\nShe keeps bringing it up because she trusted you to have her back and you didn't.",
      "id": 224,
      "comments": [
        {
          "score": 1227,
          "content": "His post just sounds so dismissive. This probably would have been forgotten if he had commiserated with her, left when she wanted, or just gave her his menu. That’s the main issue, that’s why she’s upset, not because of the menu but about OP reacted",
          "id": 225,
          "comments": [
            {
              "score": 335,
              "content": "The whole post is so dismissive of her, like she wants to come to France with you for Christmas “seems reasonable” after 2 years and wanting to go to a fancy restaurant “not really a problem”. Is OP always this lacking in enthusiasm for spending time with his gf? If I was showing my SO my home country I would be wanting to show them the best of everything, not acting like they were a drag on my whole trip",
              "id": 226,
              "comments": [
                {
                  "score": 72,
                  "content": "Absolutely. He says he is not sexist. I beg to differ.",
                  "id": 227,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 61,
                  "content": "I do think that everyone is shitty here, but she wouldn't be acting this way if not for his own reaction. \n\nOP is just looking for an excuse to break up with her if THIS is the breaking point.",
                  "id": 228,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Yes, was just left feeling OP was TA became of how he wrote his post..  “I had to do all the communicating.”",
                  "id": 229,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Right? If my girlfriend wanted to see the prices menu I literally woulda gave her mine and tools her... like what the fug lol. It's obvious something else is going on",
              "id": 230,
              "comments": [
                {
                  "score": 14,
                  "content": "Yea, like he could have just switched menus and be like I get it, it's okay here's mine.  Especially since he's like  money is whatever. \n\nI'm willing to bet their little discussion about the menus  and silent treatment was noticed by others bc people notice these things.",
                  "id": 231,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "And he wants to break up with her because she talks about it often. I think he just needs to talk to her and address it and apologize",
              "id": 232,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I wonder if it's just an ESL thing but the way the author writes sounds weirdly sociopathic or, at least very abnormal. I would almost guess it was a 4channer writing it, because it has that kind of flippant, detached, unnecessarily self-aggrandizing tone that \"anon\" writers tend to use. It's really offputting, and combined with his actual description of what's going on, paints a hihgly unpleasant picture of OP, assuming he's even real.",
              "id": 233,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "Agreed 100%. I can *kind of* understand not being comfortable with asking for a new menu. \n\nBut the way he acted about it was very YTA. He could have at least agreed that it was sexist/messed up, or not given her shit for her very valid feelings.",
          "id": 234,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I mean the waiters literally takes their coats and all, they're literally serving them so there's no reason for them to refuse anything that's already given at the restaurant, it's not like the menu didn't exist or wasn't something from their restaurant he just needed to go back a few meters to get it and come back.\nEven at a non fancy restaurant I asked for more peanuts and they came back with a little cup of grinded peanuts even tho they didn't give those with my meal, they're there to serve and they're often doing more for tips (at least that's how it is here).",
          "id": 235,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "The line that bothers me most is, \"I called her bluff and she ended up staying.\"\n\n&#x200B;\n\nOP glosses over that, but whenever I try to imagine what he means by calling her bluff I think of her taking a stance on their relationship only to be dismissed. As if she was a kid throwing a tantrum. I really dislike the usage of bluff there.",
          "id": 236,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2586,
      "content": ". It’s not actually a sexist tradition; the menu with prices goes to the person who made the reservation as that person is the one hosting the others. Had you made a reservation for a group, you would have been the only one with the prices too; irrelevant of gender of the other people present. Your girl overreacted based on an uninformed assumption... \n\nHave to say though; you should have just asked the waiter for a menu with the prices for your girl, you are paying through the nose and the waiter would have happily brought her one. Why not do something simple to keep your girl happy? \n\nI’m saying ESH. \n\nBTW - Was this La tour d’argent?\n\nEdit. Thanks for the awards - my first. Also; I’d like to say that while my experience in the industry is that this was a host menu, I am completely accepting that experiences may vary. Sexism is painfully real and is harmful to not just women but society as a whole. We all have our part to play in challenging harmful societal norms and if a menu is your chosen vector for that, then I support you entirely.",
      "id": 237,
      "comments": [
        {
          "score": 2439,
          "content": ">It’s not actually a sexist tradition; the menu with prices goes to the person who made the reservation as that person is the one hosting the others. Had you made a reservation for a group, you would have been the only one with the prices too; irrelevant of gender of the other people present.\n\nHere's the thing... I've been to Paris. I ate in at least 2 upscale restaurants while there (edit: that implemented this policy). I made ALL of the reservations because I am the planner in the relationship. And my husband was given the menu with the prices at both locations. \n\nI mean, It's fully possible that both restaurants made errors and that it's just a crazy coincidence, but since it happened at both places, I'm less inclined to believe that's true. The only source I have been able to find that this \"tradition\" is \"give the price menu to the person who made the reservation\" is in this thread. \n\nSo, I guess what I'm asking is, are you sure?",
          "id": 238,
          "comments": [
            {
              "score": 400,
              "content": "It's probably a little of both.  The menu with the prices is meant for the \"host\" who made the reservations and the **policy** is to give it to the reservation holder.  In **practice** the restaurant staff doesn't look at the name on the reservation (or maybe they only have a last name on the reservation book, and the couple share the same last name) and just gives it to the man because of their personal \\[sexist\\] assumptions.  \n\nI'm curious since I've never heard of this tradition and you have some experience with it, were both reservations under your first and last name?  And if so, is your first name traditionally known to be a female name?  Meaning if the restaurant staff looked at the reservation name would they absolutely know you were the one who made it?",
              "id": 239,
              "comments": [
                {
                  "score": 337,
                  "content": "My first name is both feminine and French, so definitely wouldn't have caused confusion. If I remember correctly, I made reservations online, so would have put both first and last, but it was a couple of years ago, so I can't say for sure.",
                  "id": 240,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Interesting, thanks for sharing your experience.  I learned something new today!  The policy makes sense (though personally I could never enjoy a meal someone else was paying for without being able to control the cost), but definitely leaves the door open to reveal inherent sexism in practice when restaurant staff make assumptions about who is paying.",
                      "id": 241,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Yeah, I don’t know what this guy is on about, the priced menu is given to the man 90% of the time.",
              "id": 242,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 33,
              "content": "[deleted]",
              "id": 243,
              "comments": [
                {
                  "score": 6,
                  "content": "Thank you! This was a very eloquent way to make the point I was fumbling around for.",
                  "id": 244,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "This is really interesting! My boyfriend and I went to a very upscale restaurant in Paris when we were there last summer. I speak French and made all the reservations; he doesn’t speak any French so I ordered for him. We noticed that his menu had prices and mine didn’t, but didn’t actually think about it as much because we’d looked up the menu before and already knew what we were going to order.",
              "id": 245,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 498,
          "content": "> Your girl overreacted based on an uninformed assumption...\n\nWas it her uninformed assumption, or his? \nOp said they explained, but what did they explain?\n\n>I explained to her that it was just a tradition in many upscale French restaurants.",
          "id": 246,
          "comments": [
            {
              "score": 349,
              "content": "Yeah, that's the thing. From the sounds of it OP told her that women dont get menu prices and men do. The reality of the tradition doesnt make a difference, only what OP and his GF thought it was",
              "id": 247,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": ">or his?\n\nThis I think, if he had properly explained it then she would have no reason to think it's sexist",
              "id": 248,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 18,
          "content": "“Uninformed assumption?” No...literally if anyone is uninformed it’s OP! He’s FROM France! So, what’s his excuse lol\n\nYTA",
          "id": 249,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "OP does not mention this as the reason only he got the prices, so it seems as if he doesn't know this and therefore was not able to explain it to his gf. Both were under the assumption he was given the menu because of a sexist \"tradition\".\n\nShe asked him to back her up and show some support towards her, and he gave a bs reason to decline. He gets a YTA from me.",
          "id": 250,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "> the menu with prices goes to the person who made the reservation\n\n\nIn groups, yes. With couples they don't ask who made the reservation and it pretty much always goes to the dude.",
          "id": 251,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Yeah I'm not sure about that reservation thing.\n\nI once went to a restaurant like that with my parents and my younger siblings. I can't say that for sure but I'm pretty sure my mom makes the reservation since she's always the one to do that.\n\nAnd even if she didn't, how do you explain the fact that my younger brother (who was 12 at the time) got a menu with prices while I (F13) didn't.",
          "id": 252,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2103,
      "content": "[deleted]",
      "id": 253,
      "comments": [
        {
          "score": 983,
          "content": "Yeah. Especially ridiculous to get outraged about their culture without even knowing enough French to ask for a god damn menu.",
          "id": 254,
          "comments": [
            {
              "score": 634,
              "content": "especially at a bloody Michelin star(s) place, where atmosphere and tradition are half the point.",
              "id": 255,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 282,
              "content": "I think we know all we need to know about his gf from the fact that she hasn't even learned enough French to place an order after two years of dating a French person. I don't even know why she wanted a menu other than to cause a scene. Not like she'd be able to read it anyway.",
              "id": 256,
              "comments": [
                {
                  "score": 82,
                  "content": "That actually makes me wonder if her menu was in English. Most restaurants do have an English version. Perhaps the English version just didn't have prices on it. Trap tourists in expensive meals or whatever.",
                  "id": 257,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 703,
          "content": "Hi, I’m French. Asking for prices or for an other menu is not what I’ll call an American atmosphere. I wouldn’t call it American at all.",
          "id": 258,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 629,
          "content": "I disagree. I'm French and I find it  really shocking this kind of things still exist. I would've asked for a menu with the prices as well. \n\nHowever, I also think she could have just asked herself (in English). Waiters, especially in Paris, almost always speak and understand English.",
          "id": 259,
          "comments": [
            {
              "score": 8,
              "content": "This comment should be way higher",
              "id": 260,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 440,
          "content": "I’m sure she expected her boyfriend to fill her in. People are allowed to travel lol. All she did was want a menu with prices. He’s the one who thought that was the biggest deal.",
          "id": 261,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 40,
          "content": "I'm baffled that this is the first NTA here. I think people really do go looking for outrage and this scenario is the dumbest thing to be outraged about.",
          "id": 262,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "Absence of sexism is not an \"American atmosphere\"... This a nothing to do with French culture, it's a pure patriarchal tradition that you will find in a lot of upscale restaurant in the world.",
          "id": 263,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "I don't agree with that, I'm french and this tradition is very rare nowadays. It's completely accepted to ask for a menu with prices and to find it sexist, most french people do and most restaurants in France have stopped this tradition.",
          "id": 264,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "Am I glad to see this. I’m late to the thread and have been going through the long line of judgements and being boggled by all the hate. \n \nNTA.",
          "id": 265,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "If I ever dated a man who could take me to a Michelin restaurant and was ok with me ordering anything and genuinely wanted to treat me, I would say Thank You and enjoy my meal. I’m so annoyed about all this stuff, making a point and for what, as if someone owns you cause they do something nice. It’s not always about women’s subjugation. I’m just gonna have to pour a glass of wine to wind down.",
          "id": 266,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1202,
      "content": "NAH. She's right, it *is* sexist. It may not be a very big deal, but you can at least acknowledge that this tradition has sexist roots. However, I can also see why you wouldn't want to make a scene, especially if you were the one paying anyway.",
      "id": 267,
      "comments": [
        {
          "score": 1455,
          "content": "“Hi, could we please get another menu with the prices on it? Thank you”\n\nWow. What a scene.",
          "id": 268,
          "comments": [
            {
              "score": 611,
              "content": "Maybe \"scene\" is the wrong word - more like he wanted to avoided the social awkwardness of it. As an introvert I get it.",
              "id": 269,
              "comments": [
                {
                  "score": 571,
                  "content": "As a former waiter, and one with the appropriate training for a fancy ass restaurant at that - it's not awkward. Nobody cares. They'll get you the other menu, and then forget about it.",
                  "id": 270,
                  "comments": [
                    {
                      "score": 259,
                      "content": "Seriously, you have so many other things to keep track of and pay attention to, I can't imagine giving two shits about a table asking for a different menu.",
                      "id": 271,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "Maybe not awkward for you.",
                      "id": 272,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "iT's NoT aWkWaRd!\n\nYou're not the awkward party, genius",
                      "id": 273,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 211,
                  "content": "[deleted]",
                  "id": 274,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 140,
                  "content": "How is that any more awkward than asking for a refill on your drink, or a dessert menu or something? Asking waiters for things is a normal component of the restaurant experience.",
                  "id": 275,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "I get it as well but in this situation it's just one of those things that you should do",
                  "id": 276,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Welp, now he gets to enjoy the awkwardness of a romantic partner that no longer trusts he will have her back on small issues.",
                  "id": 277,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I think this is a distinctly American perspective. There’s all sorts of weird etiquette and snobbishness at high end restaurants in France. The dining culture is just completely different there in many ways. I can understand a native French person not wanting to rock the boat so to speak at a nice restaurant in their home country.",
              "id": 278,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 309,
          "content": "high end place: there wouldn't be a scene because part of the experience is the seamlessness \n\n\"the lady would like a menu with the prices\" \"of course, right away\"",
          "id": 279,
          "comments": [
            {
              "score": 153,
              "content": "That's true about the seamlessness. I've never eaten at a Michelin star restaurant but I once ate at a fancy restaurant with amazing service.\n\nIt was both incredibly attentive while totally unobtrusive. Like the waiters would just appear out of nowhere with exactly what you need at exactly the right moment. But, they don't want to disrupt your dinner conversation, so they discreetly hand it to you or set it on the table and disappear.\n\nLike for this scenario I would expect a waiter to overhear the conversation and immediately bring over a menu with prices and quietly hand it over without disrupting the conversation. Then in the menu their would be a hand calligraphied note apologizing for the patriarchy.",
              "id": 280,
              "comments": [
                {
                  "score": 12,
                  "content": "I would love if that note could be attached to most things.",
                  "id": 281,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": "If it wasn't a big deal then he should have just asked for a new menu. The fact that he couldn't ask for one, means that this is a big deal to OP and he probably has some sexist beliefs he hasn't examined.",
          "id": 282,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "Well, some people could feel bad if they accidentally order something way too expensive at other person's cost. Even if the restaurant was post, surely they were different ranges of prizes",
          "id": 283,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}