{
  "post content": "I have chronic migraines and its something I've dealt with my whole life. I've had to constantly work to prevent them. It sucks. I used to think that my girlfriend of 6 months was sympathetic to my issue, but, after this past weekend, I'm not sure. We were just hanging out, and then a headache hit, so, I'm down for the count and my vision is shot for the time being. She gets off the couch and decides to grab a snack.\n\n&#x200B;\n\nAfter a few minutes of complete silence, almost as if I'm bothering her, she tells me to just \" toughen up and power through it\", so that we could get back to our night. I was pretty pissed off by that comment and told her that I don't need medical advice from someone whose doctor just told her at an appointment that she's obese. \n\nShe thought it was a low blow. I told her I thought her telling me to toughen up was a low blow and added that, maybe instead of snapping at me, she could've helped me get rid of the pain. She's now trying to, amongst her friends, make me out to be a fat shamer. This type of fighting isn't us and I want us to get back to normal.\n\n&#x200B;\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 163,
      "content": "ESH\n\nHer weight is irrelevant and she was cruel and dismissive of your pain.\n\nHonestly, what is \"back to normal\" for you two? Because the migraines aren't going to disappear, her friends are probably convinced you're a bad guy and now you know that she thinks you need to just suck it up when you don't feel well.",
      "id": 2,
      "comments": [
        {
          "score": -59,
          "content": "Not fighting, not low-blowing.",
          "id": 3,
          "comments": [
            {
              "score": 33,
              "content": "Right, but now you know what she's thinking about your ability to deal with things. And she thinks she knows what you're thinking about her body. The toothpaste is out of the tube, there's no just going back to \"normal\". Doesn't mean you're doomed. Couples argue, they say things they shouldn't and, hopefully, they work it out and move forward.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "How old are both of you?",
              "id": 5,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Why are you dating someone you find so ugly and fat?",
              "id": 6,
              "comments": [
                {
                  "score": 6,
                  "content": "He never said that?",
                  "id": 7,
                  "comments": [
                    {
                      "score": 2,
                      "content": "They really just exposed their own line of thinking is Fat=Ugly lmao",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 73,
      "content": "ESH\n\nShe's clearly never had a migraine.  At lot of people just think it's a \"bad headache \". My migraines used to be so bad at times that I couldn't pick up my head or keep my eyes open. \n\nYour comment crossed a line though.  I completely understand that the amount of pain you were in probably resulted in you lashing out.  That still shouldn't be an excuse for saying something like that.",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 34,
      "content": "ESH. Your gf should have been more sympathetic to your pain but she’s right- the comment about her doctor saying she’s obese IS a low blow- you completely ceded the moral high ground as soon as it came out of your mouth.",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 25,
      "content": "ESH. Her for dismissing your medical issues, and you for using her weight to shame her.",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "ESH\n\nBoth of you delivered low blows, she said something bad, you said something bad and I don’t think any was justified. I wish you the best in going back to how you guys are usually but both exchanges just set off red flag alarms",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "ESH\n\nYour GF dismissed your medical condition and implied it was a matter of choice.   That's an AH move for anyone.\n\nYou attacked her with sensitive information she shared with you (assuming you weren't in the doc room).  That's an AH move for any partner.\n\nIgnore the comments about fat shaming, I have a feeling it was more about wanting to hurt her,  rather than something specific about her weight. \n\nYou should both step back and consider why you would WANT to PURPOSELY hurt your partner,  because that's what you both set out to do.",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "ESH.  But she’s the bigger AH here.  I know this isn’t an advice sub but…RUN!  Your migraines aren’t going away and her level of empathy isn’t going to increase.",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "NTA. Imagine if you'd given her the same exact line over a bad period.",
      "id": 15,
      "comments": [
        {
          "score": -5,
          "content": "Right, but the real equivalence would be if he had told her to toughen up over a bad period and then she said \"yeah well your dick is small\". You're just gonna ignore the way he chose to clap back at her?",
          "id": 16,
          "comments": [
            {
              "score": 2,
              "content": "That's not the equivalance AT ALL - the doctor has told the gf she is obese, i.e. it's come from a medical perspective and has potential impacts on her overall health. I'm not a man, so I can't guarantee this, but I would still like to say with a fair degree of certainty that a dr would not tell him 'his dick was small' as a medical diagnosis. His whole point is that he's not interested in taking medical advice from someone who currently is possibly making unhealthy choices for themselves.",
              "id": 17,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -24,
              "content": "Migraine are serious pains. Periods are a monthly occurance, and nothing new. And yes I am a woman who has periods.",
              "id": 18,
              "comments": [
                {
                  "score": 12,
                  "content": "That doesn’t actually qualify to speak about every woman’s experience. Women who have gyno disorders can have significant pain that makes the ‘monthly occurrence’ debilitating.",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "It's like crazy how much I'm not interested in trying to arbitrate which thing is worse or more pitiable.. my point was that they both said something shitty.",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "As someone who gets both migraines and periods, I’m glad your periods clearly don’t bother you like the intense pain I get from mine.",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "ESH. I also have chronic migraines so I totally understand how hard this is for you. Your partner sucks for not being supportive but you suck for calling out her weight. You used her weight to punish her, that's fat shaming.",
      "id": 22,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "ESH. Literally what did her weight have to do with anything? It seems like you do have a problem with her weight since that was the “low blow” you decided to throw at her. Obviously she was in the wrong but so are you",
      "id": 23,
      "comments": [],
      "relation": "No"
    }
  ]
}