{
  "post content": "My ex and I are split up.  Our older son lives with him and younger with me.  We are both not high income but he somehow landed a wife who makes 4x our income and they often go out of the country on nice vacations which I guess he has been sharing with the kids.\n\nThe kids want their passports now thanks to his brainwashing. I initially said yes because him and my son caught me off guard and started asking me if it was okay one day.  Then I had time to think about it and realized how bad things are in the world right now and I don’t feel like it’s worth the risk and danger having the kids so far away from me and out of the country with their dad and stepmom.  They also need my consent per our custody agreement to go out of the country anyway, and at this point I’d never say yes.\n\nSo today when my ex asked me if X date was okay for the passport appointment I asked where he is even going to be taking the kids, to which he told me “he didn’t know yet, they just want to get the ball rolling because it takes 3 months just to get the passport and they haven’t planned anything specific yet” which I find sketchy.\n\nSo I told him and the kids no, that he needs my consent to take them anywhere because of how bad the world is right now and I’d never agree so passports are pointless.  My younger son got upset and my ex got angry also and kept repeating “are you just never going to allow them to go anywhere then?” I never said that, just not right now.\n\nSo my ex is texting me now saying I’m an asshole and I’m “robbing my kids of experiences” except I never have gone out of the country and don’t have a passport and I am fine, so I don’t really buy it.  Like does a 7 year old and a 14 year old really need to experience japan or england or whatever, they can go when they are 18 and probably appreciate it more then. Other than some initial disappointment my kids haven’t even mentioned it to me again so I have a feeling they don’t really care and it’s more their dad influencing them.\n\nSo AITA?",
  "id": 1,
  "comments": [
    {
      "score": 22231,
      "content": "YTA.\n\n\"The kids want the passports now thanks to his brainwashing.\"\n\nThis isn't about the rest of the world being unsafe and dangerous (which it isn't). This is about you being jealous he married someone who makes more money than you and can introduce your kids to new experiences without you. Stop being selfish.",
      "id": 2,
      "comments": [
        {
          "score": 6109,
          "content": "That comment gave away OP's true motivation.",
          "id": 3,
          "comments": [
            {
              "score": 3679,
              "content": "[removed]",
              "id": 4,
              "comments": [
                {
                  "score": 1231,
                  "content": "Yes! I’m from Mexico so you know how many times I’ve heard from my husband’s family to be careful when we visit my parents and I’m like look within!!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 186,
                      "content": "Eh, Mexico is pretty dangerous is certain parts. Typically the cartels leave vacationers alone. especially Americans, but some do perform kidnap/ransom jobs.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "I'd consider it safer to travel to Mexico than several states including Florida (mainly Florida lol) so many Americans are still deluded into thinking 'murica is the best and everywhere else is straight up hell",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "America, born and bred, and I can't agree more.  Most (if not all) typical vacation spots abroad are safer than nearly anywhere in the United States.\n\nHere, it's the unpredictability which makes it so incredibly fucked.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 248,
                  "content": "I knew the op is an asshole just buy the title. I grew up in a similar situation and yeah ,if op wants her kids to see her as a trash person then she is on the right path",
                  "id": 9,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I read the title and was expecting to see that the ex has family overseas and there was a bitter custody battle or something. \n\nDenying passports because you don't want your kids to benefit from things you didn't have? Fuck that shit -- YTA.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "I actually assumed the opposite from the title, although OP is definitely TA based on the post. There are cases with kids in split custody where one parent will take the kids out of the country (maybe back to a home country where relatives live) and then never come back. Which is kidnapping, but once they’re out of the country it’s extremely difficult to ever get your kids back.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 243,
                  "content": "She used Japan as an example and all I've ever heard is how safe and clean Japan is compared to the US. OP is delusional.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 145,
                      "content": "Japan is literally in the top 10 list of safest countries in the world (according to the Global Peace Index). The USA isn’t even in the top 100.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "How is Japan an example of 'everything going wrong in the world'?!  You drop your wallet in the street, and someone will chase you down to give it back to you. I've even heard of people leaving tips and the waitress running after them to give it back, thinking they've forgotten their money. \n\nYou've gotta be looking hard to find any *real* danger in Japan.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "The US is *WILDLY* unsafe. Like, if OP is from America then they are laughably ignorant.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "I’ve been to Japan - it’s literally one of the safest places in the world",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "She is certainly ignorant.",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "I went to a few places in Japan and I’ve never felt so safe. Even out drinking, if a couple of dudes started talking to me, they’d chat for a few minutes then just say “ok, goodnight!”. I was shocked to be honest (in a good way) and it was so refreshing.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 229,
                  "content": "Right? OP, your kids are a lot more likely to get shot in their own school right here in the US than they are in whatever country wealthy people like to travel to. Most of the rest of the world is horrified by our gun violence rates, and rightly so. I've seen a lot more talk of people from Europe and Asia not wanting to come to the US because they think WE aren't a safe place, and I can't tell them they're completely wrong.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 116,
                      "content": "I live in the UK and I would definitely feel more uneasy walking around some parts of the USA due to the gun licensing laws. I know people can and do get shot here but it’s nowhere near the percentage per population as the USA.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I’m in New Zealand and am a mother of teens, I totally agree, the USA is not what I would consider safe. The random gun violence is pretty scary and definitely seems unsafe. \nI have travelled to England, Japan and the USA and right now USA loses in the safety aspect for me out of those 3 countries.\n\nOP motivation looks like insecurity& jealousy that the kids will see her as the less desirable option if they get to experience different countries paid by step mom.\n\nYTA OP.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 190,
                  "content": "She even went so far as to say “I’ve never been any of these places and I don’t have a passport and I’m fine” \n\nLike wtf lady, at least pretend you aren’t a resentful shit bag.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Yeah, if grossly and willfully ignorant can be considered \"fine.\"",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 132,
                  "content": "Currently in the Maldives on holiday and it’s fab and feels so much safer than the US mind u we are from the UK so the whole gun thing is scary to us. Love the trips we have made to the US though but many many places are just as if not more safe",
                  "id": 24,
                  "comments": [
                    {
                      "score": 105,
                      "content": "NGL, I love wandering around London knowing the odds heavily favor not getting shot.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 36,
                      "content": "From what I've researched Maldives are safe as long as you stay within your resort and appear to be straight. It isn't that the country is necessarily violent, but the government is authoritarian and same-sex relationships are illegal",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Come to the west coast.  Washington, Oregon and California have been solidly Blue (Democrat) for decades and the mountains, the ocean, lakes and rivers are beautiful places to vacay.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 115,
                  "content": "Yeah, like does she let her kids go to school?  Because there are plenty of shootings there.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 105,
                      "content": "Yeah, I’d be more concerned sending my kid to school in the US than I would galavanting around Europe.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "More dangerous for children to go to school in the USA. A shooting just about every week",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 68,
                  "content": "Yup, shes delusional if she thinks her actions wont be what drives the kids away",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "Right? I spent a lot of time in Australia.  It’s so much safer than the US, I can’t even.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Even with all the giant spiders and other poisonous things lol? Jk I love to travel and Australia is definitely on  the list of places my husband and I want to see.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "Best possible random place imo. Under the sea, baby!",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 374,
              "content": "The motivation was always manipulation. As if safety is a valid reason when the only 2 countries she mentioned are substantially safer than the US",
              "id": 35,
              "comments": [
                {
                  "score": 202,
                  "content": "That’s what I noticed too. Yeah every country has violence but assuming OP is American she’s really complaining about England and Japan? Jfc it’s not like he’s taking them to Afghanistan. 100% because of jealousy. YTA OP",
                  "id": 36,
                  "comments": [
                    {
                      "score": 82,
                      "content": "Yeah, Japan, the country where it’s really hard to get a gun and you can’t get assault weapons\n\nAnd the culture is very polite",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 111,
                  "content": "Right!!! OP Jealous much?! Your excuses are half baked and not based on reality at all. Do you realize that the US is the only country in the world where children and adults die from mass gun violence? Why would you deny your kids the opportunity to travel and see the world? Allow me to give you a bit of advice: actions have consequences and denying your kids this opportunity will most definitely make them resent you. Choose wisely.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Also, getting a passport to be able to travel isn’t sketchy.   A lot of people just maintain one versus getting one for a specific trip.\n\nIf OP had said a single word that suggested she fears parental kidnapping, I’d be willing to listen.  But husband is a tourist, not a native of another country, and one of the sons lives primarily with him.  OP doesn’t want her kids to get nicer things from stepmom and wants to stick it to her ex - even when doing so deprives her kids of fabulous opportunities.  She sounds classist against wealth.",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "And the whole “he somehow landed a wife who makes 4x more than they did.” Smacks of jealousy. She seems like she is afraid that they’ll favor him and new wife because they would be taking them to other countries. And I’m sorry but just because OP has never been out of the country and is just fine, doesn’t mean that she couldn’t have been more enriched and be more than just fine by having more life experiences.",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": ">I never have gone out of the country and don’t have a passport and I am fine\n\nand this comment.\n\nOP is going to alienate her kids simply because of jealousy",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Yep, one line and I immediately knew her intentions and position.",
              "id": 42,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Honestly even without it \"because of how bad the world is\" is such a meaningless statement that it gives it away on its own. It's not like we're talking about a trip to Ukraine here, they're not going to be in any more danger of 'bad' in England or Japan.\n\nAnd the whole \"I didn't get those things and i turned out okay\" is major red flags. As a parent myself i feel confident saying that the idea is to want MORE for your kids than you got yourself, whether you turned out fine without or not.",
              "id": 43,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "And the fact that she led with the ex and her money. YTA, OP. You're punishing your kids, not your ex. And \"the world\" is a big place, with many much safer countries than the United States of gun-totin', school-shooting America.",
              "id": 44,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "The whole post gave away OP’s true motivation, that one was just saying the quiet part out loud.",
              "id": 45,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 989,
          "content": "Not only this, but OP found it \"sketchy\" that they needed to apply now to get passports in the future? That's how passports work, and as someone who had to get a passport in adulthood, it's sooo difficult and roundabout to get one that it's actually beneficial to have one as a kid.\n\nOP YTA",
          "id": 46,
          "comments": [
            {
              "score": 489,
              "content": "[removed]",
              "id": 47,
              "comments": [
                {
                  "score": 354,
                  "content": "Absolutely this. \"who wants to go to Japan or England\" well, that would a LOT of people because you know the edge of the world doesn't suddenly pop up the second you cross the border of good ol' YOU-ESS-AY. The jealousy is breath-taking and the whole \"I'd never say yes\" just reinforces the pathetic insecurity and envy OP has. YTA. And kiss your relationship with your kids goodbye the second they're able to cut you out of their life.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 113,
                      "content": "Japan literally has a Disneyland. Also, all the cities (and a lot of other things) have cute mascots. Japan is super child friendly.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 79,
                      "content": "And if she is using danger to deny a trip to Japan, she is really showing her hand about how much it is not about that.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "I’d love to be able to travel abroad more. It’s not in my budget RN and I accept that, but that doesn’t mean it wouldn’t be an incredible experience.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Time for Dad to revisit family court, I think.",
                      "id": 52,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I'm not even a huge fan of travelling but if a step parent offered a free trip sign me up!! What a great way to learn about other people's ways of life. When me and my sister visited Europe we both learned a lot about how different it was to home, and in my case I got to meet my grandmother's family and learn about my family. Not something that everyone gets, ESPECIALLY when both parents wouldn't normally be able to afford it",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "She’s one of those parents who never wants her kids to do better, have experiences, etc.  You know the ones.  The ones that cut you down if you go to college, travel, do anything other than sit at home and piss and moan.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Probably. Not too refined, I think.",
                  "id": 55,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Murica!",
                  "id": 56,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 149,
              "content": "You mean, there's not a passport machine at the airport where I can just stick in $120 and get it right before I leave the country? /s\n\nOP YTA",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 102,
              "content": "I just signed up for a trip to Costa Rica next summer, first time out of the country!  I have a passport appointment next week.   I'm probably jumping the gun a bit, but the current estimate is 10-13 weeks and you never know with bureaucracy when there's going to be a delay or snafu.  I'd rather have it in hand than end up stressing at the last minute.  \nAlso, our family went to Hawaii when I was 7 and I have tons of great memories of that trip.  It's not like the kids are infants where they're not going to remember.  Assuming the father isn't planning on taking them to an active war zone or something, it will be a great experience for them.",
              "id": 58,
              "comments": [
                {
                  "score": 74,
                  "content": "You’re not jumping the gun at all. You’re planning ahead while it’s fresh in your mind. That’s smart.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yeah, it's smart to do it ahead of time. I definitely know people who ran into stressful situations or had to cancel trips because they forgot to renew their passport until shortly before the trip.\n\nAs a sidenote, I hope you enjoy Costa Rica next year! It's one of my favorite countries I've been to.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "You aren't jumping the gun when you have a trip abroad planned. OP is an AH but it's not because she doesn't see why they need a passport when they aren't even planning a trip yet",
                  "id": 61,
                  "comments": [
                    {
                      "score": 6,
                      "content": "You need to book international flights months in advance for good prices. And it’s taking months to get a passport these days. It’s probably better to be proactive and get a passport if there’s even a thought of international travel. However that possibility that her kids get to go internationally travel with their dad and step mother is making the OP upset, so she is the YTA.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "I just got my first passport. Was almost exactly 13 weeks. One thing to keep in mind - your birth certificate might come in the mail after your passport does. I got my PP first and was convinced I'd accidentally thrown away my and my daughters BCs. Just something to keep in mind :)",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Very smart to organise it well in advance. If you ever doubt how many people don’t do this, just visit r/travel in like April/May of next year and see all the people that have a week to go and don’t have their passport yet.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Just got back from Costa Rica. Solid first choice, it's very much another country and culture but it's also fairly safe and less headaches than many of the other countries and islands in the area.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "My travel agent often finds last minute deals to resorts. Sometimes travel isn’t planned months in advance. I hope he takes her back to court.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "Also nice to get the application in so you CAN start selecting a destination. The dad’s plan is far more mature than someone who has to scramble last minute because we booked a great deal next week.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Yeah I just picked up the applications for myself, hubby and son. I also don’t have a specific plan. I just want to get the ball rolling in case I see a great travel deal.",
              "id": 68,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "To add to that… you usually need a passport number to even book flights out of the country. It ask for the number when you purchase tickets",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Facts. My friends and I are planning a big trip in 2025, and they've all said it was a pain to get a new passport, whereas my renewal was just fill out a form and mail it, a check, and my old passport.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Renewing your passport is 1000x easier than applying for a new one. You can even do it entirely online now with a picture from your phone!",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 464,
          "content": "[deleted]",
          "id": 72,
          "comments": [
            {
              "score": 121,
              "content": "I bet they’re starting to realise their mom is a bitter jealous AH ruining things for them but of course it’s not OP’s fault it’s ‘brainwashing’ by the dad.",
              "id": 73,
              "comments": [
                {
                  "score": 55,
                  "content": "I think you mean the younger one is starting to realize. Notice how the older one who can make his own decisions does not live with her?\n\nHonestly, I'd rather lose my kids than have them be apart. Older one recognized mom for who she is. That's the only reason I can think of for separating the kids.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Thats a very good point, I didn’t notice that the older one has chosen to live with Dad. Very telling.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Which is why they haven’t said anything to her. They know she’ll berate them and make them feel guilty for wanting to go with their dad.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "“How to ruin relationships with your kids in one easy step.”  The kids will never forgive OP.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "I don't know what you're talking about. Most people hate the idea of going new places and having fun new experiences. Clearly, the only reason the kids would want that is brainwashing. They'd never naturally be excited about it otherwise.\n\n/s in case that's not clear",
              "id": 78,
              "comments": [
                {
                  "score": 6,
                  "content": "\"No, Dad, how dare you take me to look upon the Eiffel Tower and famous museums and eat delicious pastries? What a horrible beast you can be!\"",
                  "id": 79,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Also I love their reasoning of “I don’t have a passport and I’m fine, so I don’t really buy it” - implying that it just simply couldn’t be possible that there could be worthwhile experiences out there that they haven’t experienced",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "On the right wing of idiot USA, education is considered brainwashing.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 289,
          "content": "YTA, you're just jealous that your kids might get to experience things that you won't.\n\nThe world isn't an unsafe and dangerous place. Educate yourself.",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 261,
          "content": "My children’s father fought me on taking the kids out of state to Disney World. I had to take him to court for it and when we got there he looked like an idiot. The only reason he was saying no was to spite me but he was at least smart enough to not admit that that in court so all his BS reasons made him look stupid. Even his lawyer was appalled and everyone shamed him. He then tried to agree but it was too late. The judge let him know that I am allowed to take them on vacations. I just had to give x amount of time for notice, where we were staying, etc. \n\nOP - YTA and a jealous one. Him not having a destination yet but wanting to get the ball rolling is not *sketchy*, it’s practical. And you don’t own your children, you are not the end all be all of deciding where they can go. Your ex can take you to court and force the vacations. You better be careful bcuz at this point he might take you for custody. Sounds like his SO can help him pay for a really good lawyer. You’re only hurting your children with your jealousy. They are old enough to know you’re the only thing standing in the way of them and world traveling and they may not be bringing it up, as you say, but this will hurt your relationship with them. Unless they’re trying to take the kids to North Korea or the Ukraine, you’re just going to look like the jealous, bitter ex (which you are) and it’s not going to go well for you. At this point they might tell the court they want to be with dad. Get it together.\n\nEdited to add : I hope the kids father does take you to court for the sake of the kids.\n\nThanks for the award!!",
          "id": 83,
          "comments": [
            {
              "score": 12,
              "content": "Absolutely spot on comment and extra points for using your own relevant example to highlight how ridiculously petty and childish OP is being.",
              "id": 84,
              "comments": [
                {
                  "score": 22,
                  "content": "Thank you. I’ll never forget when i said he won’t let me take them to Disney World and his lawyer stopped and looked at him and said ‘you won’t let them go to Disney World?!’  Besides his lawyer, the Judge, me & my lawyer were all looking at him. You could hear a pin drop. He looked so uncomfortable. \n\nWhen we did our custody arrangement I didn’t think to include vacation time. Then again, never thought he would stoop to that level of petty. The Judge fixed that on the spot. We were both allowed to take the kids on up to 2 vacations a year, regardless of who’s ‘time’ or weekend it was. We just had to give each other proper notice, details, etc. Of course, he’s like OP and has never taken them anywhere. I’ve taken them to Florida & Maryland several times and Puerto Rico. A Caribbean cruise planned for next year and I promised my daughter a European vacation to the destination of her choice when she graduates high school in 2 years.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Good on you for being a great parent and also for having the personal courage to stand up to him. Most of these people operate on pure bluff and when called on their bullshit (when people realise they have no actual power), they have nothing else to offer. Unlike OP, my crystal ball predicts that you will have a far better relationship with your adult children than your ex will.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I was also surprised when I read the ages; by the way OP was talking I thought the kids would be toddlers or something, not a 14 year old and 7 year old. AND the older son lives with dad. OP is oozing jealousy.",
              "id": 87,
              "comments": [
                {
                  "score": 3,
                  "content": "I missed that part. Not surprised. The younger one will be out as soon as he can if mom doesn’t get it together.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "My ex husband tried to block me from taking our kids to the other side of the state we live in, to the hometown we both grew up in, where both of our families still live, to attend the funeral of their half sister (my child) who was stillborn. His reason? The funeral was being held on his custody day (because that is when the church and funeral home were available and you can really only wait so long) and he was not permitted to attend. \n\nSo on top of delivering a stillborn baby at 37 weeks pregnant, having to explain such a horrible thing to my kids who were 7 and 8 and had been excited for their baby sister to be born, and having to attend to all the details of her death while postpartum, I also had to attend an emergency custody hearing. Luckily the judge allowed them to attend.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 243,
          "content": "Right. She sounds very small-minded and bitter. Maybe if she had travelled some, she would be more open-minded. Instead it's \"I done never travelled and I'm just fine!\" Yikes.",
          "id": 90,
          "comments": [
            {
              "score": 68,
              "content": "That exactly what I was thinking. Traveling does wonders at opening minds.",
              "id": 91,
              "comments": [
                {
                  "score": 59,
                  "content": "Who wants educated kids? They might start thinkin’ above their station!",
                  "id": 92,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I wasn’t even thinking about the kids traveling…I was thinking maybe if OP had traveled, she wouldn’t be so closed-minded and would recognize its value.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 187,
          "content": "Her entire post reeks of 'HOW DARE HE BE ABLE TO DO THINGS IN NOT. HE SHOULD BE SUFFERING AND I SHOULD BE THE ONLY ONE GIVING MY KIDS NICE THINGS'\n\nseriously op... YTA in a serious way",
          "id": 94,
          "comments": [
            {
              "score": 27,
              "content": "Yes. Like, why not be grateful that the kids get to travel, and not have to pay for it? Also, not having to watch said kids on a vacation, because they have *safe* adults with them (who pay for all of it, if someone missed that little detail).\n\nLike, why?",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 119,
          "content": "OP is stunted and fears everything she doesn't understand (even \"england\"), so why isn't that good enough for her children? /s",
          "id": 96,
          "comments": [
            {
              "score": 4,
              "content": "At England right now and omg it's a struggle every day to survive, just about managed to drink my coffee this morning, sat down and listening to morning radio, they're on about wheelie bins, please send help",
              "id": 97,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 113,
          "content": "Prediction: OP will delete this post - if not her account - within the next 24 hours.",
          "id": 98,
          "comments": [
            {
              "score": 3,
              "content": "We saying from time of post or your comment?\n\nEither way we have 13 or 17 hours left",
              "id": 99,
              "comments": [
                {
                  "score": 5,
                  "content": "From time of post.  And fwiw, I genuinely hope I'm wrong, and that she does the right thing for her sons.",
                  "id": 100,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 111,
          "content": "OP: Have fun with kids that resent you because you couldn't help being petty.\n\nI'm a mother, my kids have had passports since they were 2, they are now 11 and 7.  We go lots of places with them and the enrichment they get from seeing and being in other countries and cultures is immeasurable.  The US has plenty of places that much more dangerous than England and Japan.  OP just doesn't want them to go with their step mom, she should be thankful they want to take them.",
          "id": 101,
          "comments": [
            {
              "score": 5,
              "content": "Right?!  No offense to Chicago, but it’s tougher than most places I’ve been abroad lol.  My 9yo has built so much confidence through travel.  Last summer it felt perfectly safe letting him walk down to a cafe in Rome and pick out breakfast pastries for the fam and bring it back.  And he was so proud of himself!  His navigation skills are great because of travel, and he’s kind and willing to try new things.  Travel is great for kids!  Even if they don’t remember much, they’ll remember the feelings and the lessons.",
              "id": 102,
              "comments": [
                {
                  "score": 5,
                  "content": "My parents are divorced and they hate each other yet they never prevented me from going overseas with the other.  My father allowed me to go to Europe with my mom and step-dad, my mom allowed me to go to South America with my father.  The only times I didn't go was when I chose not to.  All that travel made me who I am today.  \n\nOnce we rented a cottage in the countryside of England and it was wonderful.  We gave the kids money and let them go shopping at our villages market day.  They made friends with british kids they met, they got to see beautiful places.  They've been to a few places in the Caribbean and Canada, to us it's part of their education.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 5,
                      "content": "You see a lot of people dealing with ex partners with OP’s sentiment in the travel sub and forums.  It’s so unnecessary.  It really just hurts the kids.  Honestly I’d have more empathy for OP if she was just worried about losing both her kids at once and only wanted dad taking one kid at a time or something.  But this?  No, shove down your jealousy, or journal, send the kids, listen to their adventures, and make them feel special.  It’s not a competition and OP can still do fun things with them within their budget.  Like, my kids are super privileged and been a lot of places, but y’know what they always talk about to others who ask about their summer?  Hotel breakfast buffets.  For $100 OP can have the joy of the youngest going somewhere bougie and expensive and then “upstaging it” with a night at a days inn with a pool and a breakfast buffet.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6460,
      "content": "YTA. There's no brainwashing going on. Travel is a good thing. It sounds like you are using this as an excuse to punish your ex and weaponizing custody is gross. \n\nAnd, yes! Experiencing these things before they turn 18 is a good thing. While you may enjoy your limited life, limiting your children's is not good for their development.",
      "id": 105,
      "comments": [
        {
          "score": 782,
          "content": "Exactly. Why don’t you let them experience it? Is it because you know they’ll come back and tell you how much they loved it and how much fun they had? It’s okay to be jealous, but not to the point where you punish your kids because of it. I can’t imagine being that petty. Also, not sure if you’re aware of this, but if you’re in the US, our country has been deemed by other countries as one of the most dangerous places to visit currently. There are warnings for travelers entering the US, so I’m pretty sure they’ll be fine in other countries. \n\n\nAlso, if your husband is “brainwashing” them by wanting to let them experience other cultures and countries, what would you call it when their mother refuses to let them leave to do so just because she hasn’t been able to? Not allowing your kids to experience anything outside of the same thing they always have sounds way more like brainwashing to me…\n\n\nBut I’ll let OP dig her own grave and act shocked when her children resent her for it. All you’re doing is making sure your kids grow closer to their dad and new step mom.",
          "id": 106,
          "comments": [
            {
              "score": 594,
              "content": "Imagine being in the US and claiming places like England and Japan are unsafe...",
              "id": 107,
              "comments": [
                {
                  "score": 272,
                  "content": "Yup, Japan is a country where they let their kids take the train to school by themselves at 5 because there’s a ridiculously low crime rate so no-one worries. In US, adults gotta be careful where they walk in case they step into a bad neighbourhood.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 75,
                      "content": "Shit, in America you have to identify exits in theaters and grocery stores because a mass shooting can break out at any time.\n\nMy 4 year old’s classroom has active shooter drills. THAT is America. OP is so ignorant, she really needs to get out more, but I don’t want her being one of “those” tourists that make me want to pretend I’m Canadian, eh.",
                      "id": 109,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 37,
                      "content": "follow cough saw zephyr party mighty boast versed merciful command\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 119,
                  "content": "Tokyo Japan is the NUMBER 1 SAFEST city in the world. Just checked. It's still top. I'd go back ANY damn day.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I'm dying to go back again one day.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "it's also just a lot of damn fun to explore.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "Or even Canada.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 5,
                      "content": "well stay out of western Canada right now.... we're kind of on fire :(",
                      "id": 115,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "I have a feeling OP may be drinking the Faux “News” koolaid, or be in a community where that’s the primary social vibe.",
                  "id": 116,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "god forbid... Iceland!  (well their beer prices are unsafe)",
                  "id": 117,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 348,
          "content": "There are plenty of situations where it would be appropriate to deny consent for a passport. \n\nCustody battle is volatile and the other parent is angry? Check.\n\nOther parent comes from a culture where young arranged marriages are normal and daughter is 16? Check. \n\nOther parent is generally untrustworthy and immature, with proven poor judgment? Check. \n\nThis is not that.",
          "id": 118,
          "comments": [
            {
              "score": 211,
              "content": "Yeah. Looking at the title I thought maybe this was a situation where she worried the ex would kidnap the kids to another country or something. But no. Just mad they might...go on vacation. The horror.",
              "id": 119,
              "comments": [
                {
                  "score": 9,
                  "content": "and to crazy out law countries like England and Japan",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "Just my thoughts! I thought this was about a worried parent realising there might be a risk of an underage arranged marriage but this is just denying children great experiences.",
              "id": 121,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 11,
              "content": ">Other parent is generally untrustworthy and immature, with proven poor judgment? \n\nMom certainly doesn't appear too mature or mentally stable in this post.",
              "id": 122,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 103,
          "content": "Their is brainwashing, op is brainwashed into thinking outside of their country is unsafe",
          "id": 123,
          "comments": [
            {
              "score": 54,
              "content": "Which is hilarious considering how many places in the US I would never set foot even if you paid me. Are there dangerous places in every country? Obviously, but that doesn’t mean that it applies to the entire country",
              "id": 124,
              "comments": [
                {
                  "score": 12,
                  "content": "I feel like the worst part of New Zealand is still better than the worst part of the US.\n\nLike, I ran around downtown Detroit in the 90s. Bring it...",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 92,
          "content": "Not only that this word \"brainwashing\" is absolutely code for \"im a racist xenophobic AH who don't want my kids learning other cultures.\"",
          "id": 126,
          "comments": [
            {
              "score": 14,
              "content": "\"I've never been out of the country and I'm fine.\"  Yeah, no you're not.",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "And it almost sounds like she's a Trumper and the ex-husband is not",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Or, I'm angry at my ex and am upset he can offer them something I can't/won't.",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "The only brainwashing is OP trying to convince his kids that the rest of the world is dangerous.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I never went on holiday when I was younger but I do believe it helps build confidence which in itself is beneficial to this person's children. Confidence to navigate a foreign country, speak to different people, experience other cultures. \n\nOntop of that OP, what's so wrong with England? (British here!). And I'd love a dream holiday to Japan! I very much doubt their father plans on taking them to Ukraine, Iran or Syria, where they may face potential issues. (I'm sure all beautiful countries, but unfortunately experiencing civil unrest or war).",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Exactly. I traveled a ton before turning 18 and those were some of the best and most educational experiences of my life. I got to see museums, history, culture, in a way that is far more meaningful than common core history classes.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "My parents took me to Europe for the first time when I was 6. It was a defining experience for me. It got me interested in foreign languages and cultures from a young age. I am now trilingual and speak 3 other languages at an intermediate or pre-intermediate level. YTA, OP, big time. You absolutely ARE robbing them of experiences and opportunities. Don't take your resentment of your ex out on your kids!",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Part of the reason she makes so little money and can provide so little for her children is because she’s ignorant and not worldly.\n\nSad she wants to do this to her children that have a chance at a better life.\n\nYTA big time.",
          "id": 134,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "Exactly, and she said she never went away and she's fine, but clearly not since she's so jealous of her ex that she won't let him take their kids on a fun vacation. \n\nBesides, it's probably more dangerous going to an American school nowadays than going to a foreign country. I also doubt the dad is taking them anywhere dangerous. It's probably like London or Paris and they'll stay in nice hotels.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4004,
      "content": "YTA\n\nYou have no valid reason for stopping your kids from having passports.\n\nIt screams jealousy.\n\nYour children won’t forget this.",
      "id": 136,
      "comments": [
        {
          "score": 1046,
          "content": "I love the TRUE argument that it takes 3 months (or longer) to have a passport without having set plans but what’s important is OP has never needed to travel so why should her kids? LMAO.",
          "id": 137,
          "comments": [
            {
              "score": 532,
              "content": "Right? It’s not sketchy, that’s HOW IT WORKS. And why plan something to risk the passports not being there in time?",
              "id": 138,
              "comments": [
                {
                  "score": 57,
                  "content": "Thats exactly what I said in my comment as well!   \nsmh, OP is just not in touch with reality. Too high up in the clouds of jealousy.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "In my opinion not wanting your children to have a passport is sketchy. It’s good to have government ID of any form. It’s not like they’re able to get drivers licenses",
                  "id": 140,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 113,
              "content": "I forgot to renew my passport on time and had to go through the new process recently and it's incredibly annoying. Takes much longer than when I got my original passport in the middle aughts. I still haven't gotten my passport and it's been a few months.",
              "id": 141,
              "comments": [
                {
                  "score": 35,
                  "content": "Exactly. Tried renewing online & still in the queue waiting. Six months so far. \nPlanning ahead is practical and a necessity.",
                  "id": 142,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Where did you find to renew online? I tried going to the US gov website and it wants me to fill out a form and mail it in.",
                      "id": 143,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "My MiL waited 3 months for hers earlier this year and it didn't come, a week before her trip she called the District manager for our Congressional rep, she sent it to their passport team, as it's such a big issue, Congressional reps have teams to deal with expediting passports now.",
                  "id": 144,
                  "comments": [
                    {
                      "score": 3,
                      "content": "We had the same experience. We were taking our daughters friend with us on a cruise so she went in  March to get a passport. By middle of July it still was pending and we were only a little over a week away from traveling. Took her grandfather’s friend who is a Congressman to intervene before she got it 3 days before the trip. It’s ridiculous how long it takes now to get a passport.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 48,
              "content": "Right? its SO MUCH better to have it and not need it than to need it and not have it.",
              "id": 146,
              "comments": [
                {
                  "score": 3,
                  "content": "It’s also a super handy form of government ID since it’s both photo ID and proof of citizenship.",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I left a comment about that too. So hilariously close minded, and honestly reeks of jealousy",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 146,
          "content": "Exactly, she's not worried about abduction, her seems to be offering to pay, and she seems unaware that much of the western world view the USA as an unsafe place right now due to gun violence, racial violence and the recent law changes as we don't have anything like that.\n\nShe's coming across as trying to be difficult, ignorant of the rest of the world and I think she feels insecure that both boys might end up living with their father. I'm pretty sure he can and will take her to court and win over this.",
          "id": 149,
          "comments": [
            {
              "score": 67,
              "content": "At the beginning, I was expecting something related to abduction, and it's only holidays abroad.",
              "id": 150,
              "comments": [
                {
                  "score": 3,
                  "content": "Hoenstly I expected her to say he loved vacationing in the Sudan, Myanmar, or Yemen or something. Like, actually dangerous places. If they are from the US, this is especcially ludicrous, as the kids would actually be safer in places like Japan or western europe than in their own schools...",
                  "id": 151,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "No brainwashing could do worse to her kids opinion of her than her current pettiness, hurting the kids over her upset feelings regarding the divorce.",
          "id": 152,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "[Your Children will remember this]",
          "id": 153,
          "comments": [
            {
              "score": 3,
              "content": "Thanks, made me laugh! I just got done replaying a Telltale Game!",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Last line again for the people in the back! People need to stop messing around with their kids' emotions and mentalities over petty ass bullshit like this.",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "yeah especially the older kid. this is just petty and going to make the kids bitter towards her. no wonder the kid stays with the dad.",
          "id": 156,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2768,
      "content": "I’m going out on a limb here and guessing you’re an American….and YTA.\n\nPlenty of places are actually much safer than the US. You’re depriving your children of amazing experiences because of either spite, jealousy, or who knows what. You need to act like an adult and rise above whatever petty issues you’re having here, and let your children live.",
      "id": 157,
      "comments": [
        {
          "score": 843,
          "content": "I just asked something similar.  If she's American does she even let her kids outside?",
          "id": 158,
          "comments": [
            {
              "score": 1194,
              "content": "Or go to school?",
              "id": 159,
              "comments": [
                {
                  "score": 627,
                  "content": "Hell, if they got an appointment now, odds are they wouldn't receive their passports before the first active shooter drill of the school year.",
                  "id": 160,
                  "comments": [
                    {
                      "score": 140,
                      "content": "I’m ashamed that I laughed at this comment. But truthfully, you’re totally correct.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Painful truth, and I gallows-laughed.",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": ">odds are they wouldn't receive their passports before the first active shooter ~~drill~~ of the school year\n\nFTFY",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "To be fair, their odds of getting hurt at school are pretty good these days.",
                  "id": 164,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "In America we can’t let our kids outside someone will call cps cause we’re not helicoptering. School isn’t safe either cause of school shootings. Idk I’d leave the USA but my husband wants to stay.",
              "id": 165,
              "comments": [
                {
                  "score": 14,
                  "content": "This is so sad to read",
                  "id": 166,
                  "comments": [
                    {
                      "score": 9,
                      "content": "We got tons of kids in my neighborhood but I never see any of them outside",
                      "id": 167,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 52,
              "content": "Someone in my city just died sitting in their house because a stray bullet came through their wall. They aren't even totally safe inside here",
              "id": 168,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 216,
          "content": "Yes, especially England (or Europe in general) or Japan are very safe. I don't think the father will take the children to a land with an civil war.",
          "id": 169,
          "comments": [
            {
              "score": 114,
              "content": "Right exactly! The countries she named are arguably safer than many areas in the US. Not like he’s planning on vacationing in Ukraine.",
              "id": 170,
              "comments": [
                {
                  "score": 45,
                  "content": "And she can vote against a trip. So if ex chose a really dangerous country she could stop travel plans anyway. But only within the not that safe US because that's all she knows, jeez.",
                  "id": 171,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Japan or *gasp* England! /S",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "As long as you avoid soccer matches ;)\n\nYes, they are generally very safe countries :)",
              "id": 173,
              "comments": [
                {
                  "score": 6,
                  "content": "Football.",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 195,
          "content": ">**Plenty** of places are actually much safer than the US.\n\n78.5% of the world, in fact. So - not just Plenty --> **Most**!\n\n128 of 163 countries in the world are SAFER than the USA as of 2022 according to \"[World Population Review](https://worldpopulationreview.com/country-rankings/safest-countries-in-the-world)\"",
          "id": 175,
          "comments": [
            {
              "score": 52,
              "content": "Thanks for this info! As an American, this data is not surprising.",
              "id": 176,
              "comments": [
                {
                  "score": 5,
                  "content": ">Thanks for this info! \n\nYou're welcome.\n\n>As an American, this data is not surprising.\n\nUnfortunately.",
                  "id": 177,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 103,
          "content": "I'm American and I've heard it's a stereotype that most Americans don't even have passports. And honestly, I think it's true. I've traveled, have my passport (and renewed it even!) But a good chunk of people I know don't have one. \n\nI love travelling and I wish we could've done it a lot more when I was younger. It's good to learn about other cultures and places and cultivate those sorts of experiences. \n\nOP, YTA. Just because you hate your ex doesn't mean you need to take it out on your kids. They want this experience, you being a jerk about it is just going to push them away from you. Enjoy your misery.",
          "id": 178,
          "comments": [
            {
              "score": 52,
              "content": "A lot of people don’t have passports in America because they don’t travel outside their country. It can be very expensive to fly outside the US. Flights to Flights to England are $800-$1200 alone. Travel is such a rewarding experience, but also still very much a privilege. Traveling across states on a plane can cost hundreds of dollars itself, let alone overseas.",
              "id": 179,
              "comments": [
                {
                  "score": 43,
                  "content": "THIS. I'm in my 30s and have never had a passport because I simply cannot afford it. Me and my husband still hope to save up and be able to travel overseas one day, but the reality is that many Americans can't even afford to go on a more local vacation or even get the time off work to do so. OP should be grateful that their children are being offered such a privilege.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I never had a passport until I got a job working for a multinational company and needed to get one for a business trip to Europe.   My family couldn't afford to travel outside the US and Canada when I was a kid - in those days you only needed a birth certificate to cross the border.    \n\nPlus, the US is a big place; there are a lot of travel options that don't require a passport.   Most folks only get a passport if they have a need to do so.",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "I’m an American as well and I totally agree with this! My mom had this attitude growing up, and so I pretty much stayed in a little bubble as a kid. Finally as an adult, I’ve been able to travel and I’m so unbelievably grateful for that privilege. I wish I had that opportunity as a child!",
              "id": 182,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I didn’t have a passport until I was an adult. My parents couldn’t afford expensive trips here let alone overseas. I’m sure they wish they could have! They love to travel and are trying to hit as many national parks as possible. I can’t imagine not wanting your kid to have the joy of traveling and experiencing new things!",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Surprise, surprise: travelling abroad is expensive and a privilege for most US families. Doesn't make sense to go through all the bureaucracy of getting a passport if you can't even use it because of money.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I’m sure that a lot of people can’t afford it (which is entirely valid). However, as a fellow American, I know that _plenty_ of people have the mindset of “America is #1, why the fuck would I ever want to go to some foreign country”, and it’s just sad",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It’s absolutely true. Most of the ones who can afford it can’t get the time off to leave the country. Most other people are just too poor to spend thousands on flights and food for a week.",
              "id": 186,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I have a relative with a Nigerian ex and a young daughter, who has significantly more legitimate concerns about allowing her passport renewal. This ain't it.",
          "id": 187,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "She probably just watches propaganda and thinks the moment her kids step off the plane they would get trafficked.",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1414,
      "content": "Yta.  Majorly.  You're denying the kids valuable opportunities because you're pretty and jealous.  This false concern for \"the world is awful\" is a game.",
      "id": 189,
      "comments": [
        {
          "score": 142,
          "content": "[removed]",
          "id": 190,
          "comments": [
            {
              "score": 8,
              "content": "Ay, she's single now ok?  Let that commenter shoot their shot 😂",
              "id": 191,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "OP indeed sounds so bitter lmaooo",
          "id": 192,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "I feel bad for the younger child that still lives with OP. No wonder the 14 yo lives with the dad.",
          "id": 193,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "So much this. What a selfish mom to deny her children the opportunity to see the world and essentially think “I never went out of the country so they shouldn’t either.”\n\nTravel is an amazing way to open your kids’ eyes to new people, cultures, experiences, landscapes, architecture, etc. How can you deny them this? SMH",
          "id": 194,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 966,
      "content": "YTA big time - you are deliberately depriving your children of what could be amazing experiences out of your own jealousy and insular thinking. \n\nit’s choices like that which will lead to you never seeing your sons once they have the choice to leave and having nothing to do with you.",
      "id": 195,
      "comments": [
        {
          "score": 213,
          "content": "Every word of this. \n\nJust because you don't see the value of international travel and also can't afford it does not mean your children should be robbed of these kinds of beneficial experiences. 7 and 14 are plenty old enough to enjoy and value these experiences.\n\nIf you live in the US, your kids are facing much more dangerous situations day to day anyway. If you have your way, they will grow up ignorant about life in the rest in the world.\n\nYour ex and kids are calling you an asshole because they see through your little farce. This isn't about your kids. You're just jealous. \n\nYTA and this is absolutely horrific parenting.",
          "id": 196,
          "comments": [
            {
              "score": 79,
              "content": "Yep, there have been more mass shootings in the US this year (over 400) than there have been **days of the year.** But OP’s children are going to be endangered by flying to nice vacation destinations. Yikes!",
              "id": 197,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My family started travelling when my kids were 3 and 6. And they remember a lot of it! \n\nNot to mention how enriching it is!",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "A healthy and happy mom would be thrilled that there's a stepmom in the picture who seemingly cares about them and wants to take them on adventures. What a great opportunity for her sons. OP seems like she'd rather have a horrible stepmom in the picture that treats her kids poorly so she can be the \"better one.\"",
          "id": 199,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "That was my thought. Tears down the road, she will be back on here posting about why her children won’t let her meet her grandchildren. It’s because you deprived them of amazing travels because you wanted to be an AH",
          "id": 200,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 912,
      "content": "YTA \n\nDid you not get a clear enough answer when you [posted this](https://www.reddit.com/r/TwoHotTakes/comments/15v6ycb/aita_for_not_allowing_my_kids_to_get_passports/) in r/TwoHotTakes 11 hours ago?\n\nAs I posted there in response to you saying \"[It’s not safe right now](https://www.reddit.com/r/TwoHotTakes/comments/15v6ycb/comment/jwtpetr/?utm_source=reddit&utm_medium=web2x&context=3)\" as your main justification to not allow them to travel - it's safer to travel to most of the world than to spend time in the USA.\n\nThe USA is ranked 129 out of 163 - that means 78.5% of the world (128/163) is SAFER than the USA to visit. (Ranking as of 2022 according to \"[World Population Review](https://worldpopulationreview.com/country-rankings/safest-countries-in-the-world)\")",
      "id": 201,
      "comments": [
        {
          "score": 267,
          "content": "This is the irony of her post. \n\nIf someone wanted to take my children to a different country I’d have mixed feelings too. Her choosing to not permit it is a valid choice as long as it’s made for the right reasons. The world being ‘unsafe’ and her ex and his new partner ‘brainwashing’ her children are not the right reasons. YTA OP.",
          "id": 202,
          "comments": [
            {
              "score": 101,
              "content": "Yeah, I've read enough of these posts that I assumed she was worried the ex was going to take the kids and not come back or something, but that's not even one of her concerns. All her concerns are dumb. It's just jealousy.",
              "id": 203,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": ">If someone wanted to take my children to a different country I’d have mixed feelings too. Her choosing to not permit it is a valid choice as long as it’s made for the right reasons.\n\nQuite agreed!\n\n>The world being ‘unsafe’ and her ex and his new partner ‘brainwashing’ her children are not the right reasons.\n\nThere are valid concerns - the biggest is if there are multiple citizenships, the kids are visiting relatives, and there is a risk of parental abduction... that is not the case here.",
              "id": 204,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "I knew I saw this last night. I just couldn’t remember where. Yeah, she’s under the delusion that if she posts this pathetic story In enough forums, she’ll get the response, attention, and indignation she’s craving.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Oh wow I knew US had gotten bad but that’s so low. OP is a total AH making shit up to hide her jealousy.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "And it was pretty unanimous there as well. OP is TA.",
          "id": 207,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "She didn't get the answer she wanted. That's why she posted it here. She sounds like a typical MAGA idiot.\n\nShe's gonna ignore the thousands and thousands of people saying she's in the wrong, because people like her always do. I hope I'm wrong about that.",
          "id": 208,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "She definitely didn't get the response she hoped for. This post (OP not you) is just ignorant",
          "id": 209,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 560,
      "content": "YTA how is he brainwashing them?",
      "id": 210,
      "comments": [
        {
          "score": 287,
          "content": "By letting them know there is a world out there that is exciting and fun beyond their mother’s front porch.",
          "id": 211,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "She is jelly and let’s all wish them a shitty cake day",
          "id": 212,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 428,
      "content": "YTA. Your ex loves your children and wouldn’t put them in harm’s way. I live in the United States and was worried about my adult daughter traveling to another country. She told me the country she was traveling to was one of the 20 safest while the US was the 129th. Yet I feel safe going about my life.\n\nTravel enriches children and you are denying them a valuable opportunity. I sense you are acting out of jealousy rather than a sense of duty to your children.",
      "id": 213,
      "comments": [
        {
          "score": 22,
          "content": "Yup, this! The US has some worrying social stats and gun violence, school shootings, people dying from not being able to afford their meds or bankruptcy from medical debt are nearly exclusively a US problem among developed countries. Not that it never happens in other countries but the frequency and lack of political motivation to actually address these things is truly frightening",
          "id": 214,
          "comments": [
            {
              "score": 9,
              "content": "I’m a teacher, and we happened to have had a “armed intruder” drill (love that name—talk about playing it down!) a week or so before my daughter and I had this conversation. She asked if I really thought they were having armed intruder drills in Croatia. She made her point.",
              "id": 215,
              "comments": [
                {
                  "score": 6,
                  "content": "Yeah, that's pretty sobering. But hey, at least you got thoughts and prayers.",
                  "id": 216,
                  "comments": [
                    {
                      "score": 4,
                      "content": "lol!",
                      "id": 217,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Croatia is amazing! Glad your daughter was able to go!! Super beautiful country with cheap prices too. Hope she had a great time.",
                  "id": 218,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 335,
      "content": "[removed]",
      "id": 219,
      "comments": [
        {
          "score": 76,
          "content": "Agree. My family did this shit too. “The world is so crazy…” and “anything could happen.”so I didn’t get to go in any trips abroad with my class. \nI missed out on so much as a teen due to their doomsday and bitter narratives. \nYes, the world sucks. \nYes, anything can happen.\nThose things can happen here too.\n\nHe still needs consent to go out of country. There is no harm in getting passports. Provided he isn’t taking the kids to a war torn country and your kids phones have international calling and internet enabled… let them go! Listen to their stories and look at the pics when they get back. \nBury your insecurities and bitterness. Get over your jealousy. Stop being an overpowering and overprotective parent or you will have very angry kids down the road.",
          "id": 220,
          "comments": [
            {
              "score": 6,
              "content": "I didn't get to do stuff like this growing up because my family didn't have the money. Sucks, but understandable. But the ex's family is willing to pay for it! From everything OP has shared, it sounds like they're reasonably responsible adults who care for the kids & aren't going to traffic them somewhere or anything. It's a net win for the kids' well-being. I don't deny that it sucks for OP to try to measure up in terms of vacations, but it's *good for the kids* to let them go.",
              "id": 221,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "And at this moment, it will very likely take longer than 3 months.",
          "id": 222,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "That’s a terrible assumption to make thinking she had the kids to trap them. You’re going too far with this.",
          "id": 223,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}