{
  "post content": "Throwaway for obvious reasons. \n\nI (41M) and my friend Dave (34M - not real name) both play fiddle in an Appalachian folk band (don't ask.) Recently after a few post-gig beers we got into a heated debate about my favourite band, The Mountain Goats. Dave considers nearly all non-classical /jazz /folk/fusion music to be trash. I was arguing that while their early work is pretty straightforward and doesn't take much skill to play, in recent years the music has become relatively harmonically complex, with lots of jazzy, extended piano chords and use of controlled dissonance to compliment the lyrics, and that he'd probably like it if he gave it a chance. He kept saying they write storybook music for children, which annoyed me. \n\nThis was maybe a little petty of me, but eventually I snapped and suggested that if you compared TMG to someone like Phillip Glass, who is a worthy 'artist' but a simplistic musician, you might even say that John Danielle is the more talented performer, and that Dave was buying into a lot of corporate classical elitism that the labels encourage to hike up prices. \n\nDave lost it, questioned my judgement and said I wasn't even a good violin player, which, as I've decided nearly all my spare time and money to my musical hobbies for over twenty years, irked me. There's a code of conduct among musicians and he broke it, insulting a band mate's skill is a line you don't cross. I stormed off and drove home angry, he tried to call me up to apologise but I haven't returned his calls yet. I'm supposed to be attending his son's christening next weekend but I'm still mad so I've decided gonna stay home and listen to Tallahassee instead. \n\nMy wife thinks I should be the bigger man, but I'm still too upset with him. AITA? \n\nTl;dr - my friend is also a folk violin player and insulted my violin abilities because I told him The Mountain Goats are more harmonically inventive than Philip Glass",
  "id": 1,
  "comments": [
    {
      "score": 70,
      "content": "ESH,\n\nare you in your 40s or 14? Both should be the bigger man this is a weird fight for people your age dude",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 52,
      "content": "ESH. I sincerely hope that this is a shitpost and not a true story of two men behaving like they're five years old because they can't handle having different tastes in music. If this is true, you should both frankly be embarrassed and put this childish nonsense in the past where it belongs.",
      "id": 3,
      "comments": [
        {
          "score": -14,
          "content": "I can handle having different tastes. My wife likes Eminem ffs. But he didn't have to insult my abilities as a musician. Like I said, that is something ALL musicians take seriously.",
          "id": 4,
          "comments": [
            {
              "score": 33,
              "content": "Your were already overreacting before he said that. Which is why you both suck.",
              "id": 5,
              "comments": [
                {
                  "score": 6,
                  "content": "Fair enough thanks for your input",
                  "id": 6,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -2,
              "content": "Again, a reasonable statement on OP's part that's being downvoted all to hell. This subreddit is wonk.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 19,
      "content": "NTA - but I agree with your wife, if you value this friendship, don't play the tit-for-tat game. He was wrong, and it sounds like he knows it if he was calling to apologize. Let him apologize and move past this like adults. \n\nUnless you don't care for this person and are just looking for an excuse to be done with him, then by all means, carry on.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 15,
      "content": "ESH - he may have gone too far, but you went nuclear. \n\nAccept his apology and realize that you guys were probably more drunk than you think you were.",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 14,
      "content": "ESH.  That he invited you to his son's christening tells me that you are a friend that matters in his life.  So is this really how this friendship ends? With a petty fight after a few beers you are both too old to have had?  Because unless you are ending this friendship, you need to go to the christening of his child.  He has tried to apologize, and now it's time to accept that apology.  You can still be angry but you need to start moving forward.  Because if you do continue this friendship, you will regret not going to the christening.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "> There's a code of conduct among musicians and he broke it, insulting a band mate's skill is a line you don't cross\n\nSeriously?\n\n🤣😂🤣😂😂😂😂🤣😂🤣😂\n\nCan't wait to tell all my band member friends that one. They WILL be surprised...\n\n🤣😂🙄🤣😂😂😂🤣😂🤣🤣🤣",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": ">I stormed off and drove home angry,\n\nYTA, you DUI.",
      "id": 12,
      "comments": [
        {
          "score": -19,
          "content": "everybody does where I live, it's fine.",
          "id": 13,
          "comments": [
            {
              "score": 5,
              "content": "Well then ESH (here being where you live)",
              "id": 14,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "it absolutely is not fine, sorry you live in a place where there are so many drunk drivers",
              "id": 15,
              "comments": [
                {
                  "score": -1,
                  "content": "Well what would YOU have done? Paid ten quid for a cab? It's an Appalacian folk band, not Pink Floyd.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 2,
                      "content": "yes, that is literally exactly what I would have done. or had a designated driver. or not drunk alcohol, knowing that I had to drive.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Idiot",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "there is area where beating their spouse is somethign everyone do, would you say it's fine to beat their spouse, there ?",
              "id": 19,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "ESH. He’s an ass, but he’s trying to apologize, and you’re being a baby by blocking him out. At least talk to him about it before deciding to skip out on something like this.",
      "id": 20,
      "comments": [
        {
          "score": -2,
          "content": "He's the one being a baby. But thanks.l, appreciate the advice. Starting to look like I should give him a call huh.",
          "id": 21,
          "comments": [
            {
              "score": 8,
              "content": "\"I'm not being a baby, he's being a baby!\" Says the biggest baby ever.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "ESH - y’all sound like you’re in middle school. This is ridiculous.",
      "id": 23,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NTA, but your wife is probably right, unless your friendship with Dave is actually over. If you're planning to stay bandmates with him, you're going to have to get along. I don't really understand why Dave \"plays fiddle in an Appalachian folk band\" if he \"considers nearly all non-classical /jazz /folk/fusion music to be trash.\" He sounds like a jerk. But he did have a few beers in him, so maybe he loses his inhibitions and says stuff he doesn't really mean.\n\nMake him listen to someone like Chris Thile whose music requires a lot of technical skill. And unless he's prepared to apologise for saying you weren't a good violin player, which was not cool regardless of how good you actually are, I'd think about going your separate ways professionally.",
      "id": 24,
      "comments": [
        {
          "score": 1,
          "content": "Sorry if unclear, I meant he considers stuff like pop/rock/adult contempary to be trash - he likes things that are either really technical or super authentic. Its a hobby rather than a job, not much money in this game sadly. In all honesty he probably is a better player than me but it's just supposed to be for fun. The other guys in the band are pissed at BOTH of us for some reason.",
          "id": 25,
          "comments": [
            {
              "score": 16,
              "content": "Probably because you are BOTH being middle school drama and that sucks for them.",
              "id": 26,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}