{
  "post content": "For context I F(22) have two vehicles at the moment, a 2015 coupe and a motorcycle. I got my car back in 2020 when I bought it from my grandparents via a loan I took out in my name. Ever since I got my car, it was kind of an understanding that my mom F(43) may ask to use it once in a while. She already has three vehicles of her own. A truck, a coupe, and a motorcycle are all either in the front of the house or in the garage. It doesn't bother me a lot since my car isn't a newer model and it is my first car so mistakes have been made. Well, my loan will be paid off on the car next fall, and I am looking to get an SUV. My reasons are that by next fall both of our dogs will be 70lbs+ so it will be nice with how much we take them to the dog park, living in the northern midwest, it will be amazing to have in winter for the ice/snow. Here is where I think I might be the a-hole. My mom has helped me with the loan at some point. I told her since she uses my car just as much as I do, whether it is to take care of the dogs, just drive it daily, or take it across the country for a road trip with her friend. Then I want her to put money towards it.\n\nI told her the other day that come fall when I get my SUV, I want to sell the 2015 coupe so that I don't have three vehicles in my name, being a college student, I definitely can't afford that amount of Insurance payments. Getting a loan for my new vehicle won't be hard since the coupe will be paid off and I am being reasonable by looking for something that would be a similar monthly payment as what I have now. My mother practically snapped at me mid-sentence claiming that I can't sell it since she put money into it and that she will pay the insurance on it instead of me. After she finished her outburst, I tried to rationalize to her the fact that she already has three vehicles of her own.  She would not budge on the fact of keeping my coupe. I looked at her and told her that if she wants to keep my coupe then she needs to sell her 2006 coupe. We really don't need the six vehicles between the two of us....AITA for giving the ultimatum?",
  "id": 1,
  "comments": [
    {
      "score": 6,
      "content": "NTA. \n\nIf she wants the car, she can purchase it from you (you can give her a discount to reflect the money she put into it). Alternatively, you could return a portion of her contributions to the car when you sell it to someone else. \n\nYou should not worry about how many vehicles she owns - if she wants to buy the 2015 and keep the 2006 (and her other vehicles), that's all up to her as long as she's covering the expenses.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "How much do you pay towards rent, food and utilities? Cause if you don't, stop it with the ultimatums. Either get your own place or start helping her if you don't. She has helped you with that car and you probably wouldn't have it if it wasn't for her.",
      "id": 3,
      "comments": [
        {
          "score": 2,
          "content": "All in all, I pay close to 800 monthly to her, which includes rent and our phone bill. The loan is only in my name. I purposely bought the car at a certain price so I had no co-signers on it. Other than the gas she uses and the 1,000 I asked her to pay me for taking across the country on a road trip that is what she has contributed so far.",
          "id": 4,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "Yta so when it's up to maintenance and the loan you demanded she contribute but when it's selling, she gets no input.  You blurred the lines between who owned what and are now super shocked she's pissed.\n\nYou know what will help with costs and insurance? Selling the motocycle.",
      "id": 5,
      "comments": [
        {
          "score": 1,
          "content": "Anything besides the gas she has used while driving has been covered by me, my reasoning behind asking the 1,000 on the loan is because she took the car on a 3,000 mile trip, to her destination and back, and anything happened to my car on that trip her 1,000 would have been put towards my insurance deductable for repairs.",
          "id": 6,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "I don’t see why half this information is here. It’s your car; sell it if you want. If your mother wants to keep it, sell it to her. It’s none of your concern how many cars she has or how old they are. \n\nEdit: changed verdict. I re-read your question. You asked if you were an AH for giving your mom an ultimatum & ‘making’ her give up her old car. In those questions, YTA.  It’s not up to you how many cars she owns.",
      "id": 7,
      "comments": [
        {
          "score": 1,
          "content": "The reason I bring up the amount of vehicles/cars she has is because my grandparents live with us as well. Having her cars as well as their 3 cars, my car has sat outside 90% I have owned it. Only time it has been inside a garage or shelter on the property is when a SERIOUS storm is approaching (blizzard/tornado).",
          "id": 8,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "This is where the 'fun' of mixing money and family happens!\n\nIt's your car so you clearly have the right to sell it if you wish. If your mother contributing significantly to the loan payments, you could pay her back with a portion of the sale price of the vehicle. \n\nI don't really understand the whole situation of having so many vehicles though.",
      "id": 9,
      "comments": [
        {
          "score": 1,
          "content": "The situation with vehicles is and how many is the fact of my grandparents have moved into my moms house recently which between them and my mother there is a total of 7 vehicles. Not including individual farm equipment.",
          "id": 10,
          "comments": [
            {
              "score": 1,
              "content": "So it's two vehicles per person...?\n\nJust feels like they should be able to, within that 2/person, come up with a couple such that they don't need to borrow yours.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Going against my mothers approval \nMaking her give up something of hers to inorder to keep something we dont need\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "UPDATE\n\nSo I would like to clarify somethings that I saw brought up in the comments. Yes I do pay rent to my mother for a grand total of 800 which is the average rate for my area for a 1bedroom apartment plus the phone bill which has both of our phones on it. \n\nAnd for the number of vehicles, she has I want to add some details. Within the past 2 years, my mother has let my grandparents move in. Between her and them the total of vehicles is 7, not including the farm equipment. Before they moved in my mother was reluctant to let me park my car in any of the shelters we have much less the garage, unless there was a SERIOUS storm. I am talking about blizzards or tornadoes kind of serious. But she has made the effort to find space for their vehicles and equipment to be parked inside a shelter year-round.",
      "id": 13,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "UPDATE 2\n\nAlso someone mentioned the 1,000 dollars I asked towards the loan for the car, at the time I asked for the loan, she asked to take my car across the country for a road trip with her best friend so they wouldn't have fly or rent out in the state they drove to. The trip to the destination, there and back without including the driving around different nearby, is a total of 3,000 miles. If for some reason she got into an accident while on the trip. I would have taken that thousand out of the loan and put it towards my insurance deductible for repairs.",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor context I F(22) have two vehicles at the moment, a 2015 coupe and a motorcycle. I got my car back in 2020 when I bought it from my grandparents via a loan I took out in my name. Ever since I got my car, it was kind of an understanding that my mom F(43) may ask to use it once in a while. She already has three vehicles of her own. A truck, a coupe, and a motorcycle are all either in the front of the house or in the garage. It doesn't bother me a lot since my car isn't a newer model and it is my first car so mistakes have been made. Well, my loan will be paid off on the car next fall, and I am looking to get an SUV. My reasons are that by next fall both of our dogs will be 70lbs+ so it will be nice with how much we take them to the dog park, living in the northern midwest, it will be amazing to have in winter for the ice/snow. Here is where I think I might be the a-hole. My mom has helped me with the loan at some point. I told her since she uses my car just as much as I do, whether it is to take care of the dogs, just drive it daily, or take it across the country for a road trip with her friend. Then I want her to put money towards it.\n\nI told her the other day that come fall when I get my SUV, I want to sell the 2015 coupe so that I don't have three vehicles in my name, being a college student, I definitely can't afford that amount of Insurance payments. Getting a loan for my new vehicle won't be hard since the coupe will be paid off and I am being reasonable by looking for something that would be a similar monthly payment as what I have now. My mother practically snapped at me mid-sentence claiming that I can't sell it since she put money into it and that she will pay the insurance on it instead of me. After she finished her outburst, I tried to rationalize to her the fact that she already has three vehicles of her own.  She would not budge on the fact of keeping my coupe. I looked at her and told her that if she wants to keep my coupe then she needs to sell her 2006 coupe. We really don't need the six vehicles between the two of us....AITA for giving the ultimatum?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "NTA. It's your car, in your name, registered to you. There's no need to ask for permission. You were just informing her. As far as her using the vehicle, she had her own that she could have used. She chose to use yours so that costs come with that, like gas. She should think of it as a rental lol. Also, selling your car would help with your down payment for a new vehicle.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    }
  ]
}