{
  "post content": "I (33F) am married to John (35M). Together we have a daughter (3F) and are currently expecting our second child together. We both also have a child from previous relationships: I have Liam (8M) from my previous marriage, and my husband has Ava (10F).\n\nI make Sunday lunch for my family every week. On Friday, Liam asked if I could make stuffing without onions this week. Liam doesn't normally eat stuffing. He tried it a few times, decided he wasn't a fan, and that was it. He tried it with his dad the weekend before (we have 50/50 custody, so our weekends vary) and liked it. I agreed, and on Sunday made my son his own stuffing without onions. It's no big deal, after all, and I'm happy to make separate portions of anything if it means my children eat more.\n\nThis is where the problem starts. We sit at the dining table and John points out that Liam has stuffing on his plate. Liam tells him that I made him stuffing without onions, because he likes it without the onions. Immediately, I noticed Ava's mood sour, and when I pressed her, she asked why I didn't make her stuffing without onions when she'd asked about it months ago. Now, I'd understand where she was coming from if she'd actually asked but I had no clue what she was talking about. I said as much, and she told me that she'd brought it up with John, who said he'd talk to me. John never spoke to me about it, and told Ava that it was 'too much work' for me to take out the onions just for her.\n\nJohn said he didn't tell me because he thought it'd be too hard on me, wanted to make things easier, thought I'd only say no anyway. He even said that it didn't make sense to make a separate portion for just one person. He said it was stupid that I'd even done it for Liam. He said the kids should learn to either make do with onions or not have stuffing at all, because not everything in life is going to go their way. I called him an idiot. I then went to the kitchen and got the rest of the onion-less stuffing for Ava to try.\n\nLater that evening, Ava went back to her mother's and told her what happened, which caused an argument between her and John (and they're not on good terms anyway). John has been angry with me since. He says it's my fault Ava (and her mother) is mad at him. He says I should've just left the 'd\\*mn stuffing' alone, that I'm just spoiling my son by giving into him like that. There's been some name-calling, but I'd rather not repeat what he said.\n\nLiam must have told Mike what happened, too, because he's told me that he thinks John is overreacting. John's mother and older sister think I'm an a-hole, but his brother has told me to just ignore him. My parents are also on my side, because they used to make separate portions for me when I was a child if I didn't like a specific ingredient. My sister told me to post on here to see if the majority think I'm in the wrong or not. So, I dread to ask, am I the a-hole for making a separate portion of stuffing to suit my son's taste?\n\nA long-winded update: https://www.reddit.com/user/throwawaymom\\_12/comments/13q22um/update\\_aita\\_for\\_making\\_a\\_separate\\_portion\\_of/?utm\\_source=share&utm\\_medium=web2x&context=3",
  "id": 1,
  "comments": [
    {
      "score": 6838,
      "content": "Omg NTA and I can see why your husband's first marriage didn't work out. He's cruel.\n\nYour child is 8 not 18. If it wasn't too much trouble to make him something he would prefer to eat why wouldn't you do that for him?? \n\nSounds like your family doesn't like onions, maybe no more onions? 😆\n\nFor real though- John's reaction to you _feeding YOUR child_ is horrendous. If it were me I'd be concerned about what nonsense he's saying to your children when you're not around.",
      "id": 2,
      "comments": [
        {
          "score": 2899,
          "content": "I hadn't thought about that. Liam hasn't mentioned anything, but I'll have to have a talk with him just in case. I'll ask his father if he's said anything about John, too. Thank you!",
          "id": 3,
          "comments": [
            {
              "score": 799,
              "content": "[removed]",
              "id": 4,
              "comments": [
                {
                  "score": 139,
                  "content": "I have that reaction to venison. Just venison. The smell of it raw makes me gag, the smell of it cooking literally makes me vomit. \n\nYou have my sympathies.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 65,
                      "content": "Ham/spam and other tinned pork meats makes me sick n gives me migraines.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 29,
                      "content": "All red meat smells/tastes like liver to me.. Sorry you even have a partial aversion.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "The smell of beef liver makes my stomach turn! I've never tried it because I felt sick getting anywhere near something that smelled like hot blood. There are some other things, but that's the biggest one that's just smell.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I have that reaction to venison too. No idea why but the smell of it in any state makes my stomach turn",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "To be fair, Venison smells rancid AF until it's browned all the way. I love it once it's cooked 🤣",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "I liked venison just fine until my father field-dressed his deer in the twilight one year. Bits of grass, gravel, leaves in the meat just left me done.  After the first roast, mother quietly dumped the rest of it a little each week on trash day until it was gone.  Thank heaven dad was on the road 3 - 4 days a week and didn't notice it never showed up on the table again!",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Raw pork. It smells rotten to me.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Venison is tricky - it has that gamey smell that can be off-putting. I prefer it in some sort of sausage or stick form. That shit is delish. :)",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "for me its chicken. i can have some forms of it but for the most part...icky!!!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "I make a joke with my wife regarding the spelling of discussed and disgust. Something along the lines of \"we discussed it with disgust. It was a disgusting discussion.\"",
                  "id": 15,
                  "comments": [
                    {
                      "score": 56,
                      "content": "There's a similar lyric from Hamilton - \"Burr, you disgust me.\" \"Ah, so you've discussed me.\"",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 51,
                  "content": "Yeah my son only eats breaded/battered chicken/turkey/fish. So thats what I cook him. I don't like fish and get very bored of eating the various forms of breaded chicken there is so sometimes I am having to make 2 different meals. Sure its a pain but I'm jst glad that he's eating and thats the most important thing. I don't understand why some adults are so against children eating food they like. Like the child is eating why cause a issue where there doesn't need to be one.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 10,
                      "content": "I live with a grown man who has textural issues with a lot of food. I love to cook and will eat pretty much anything. I FREQUENTLY cook 2 different entrees for us because I want him to eat well and I LOVE HIM. He doesn’t demand, he does try to eat challenging foods, so I’m happy to work with his limitations. Point is, I do that for an adult. I wouldn’t even hesitate to do that for a kid. To be, meal times are about family and friends coming together. It’s a time to connect. So I want everyone to feel included and seen, as long as it’s not being abused. And to me, making a big pan of regular stuffing and a small pan for the kids without onions is no big deal and makes them feel like they matter to their family. OP is obviously NTA, but that husband sure is!",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 35,
                  "content": "[removed]",
                  "id": 19,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Bad bot",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 21,
                  "content": "If it comes up in the future, it's \"disgust\" not \"discussed\" just so you know. \\*Unless Taste and Texture are talking shit about you around the dinner table, in which case fuck those guys anyway",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "I am also a Texan. I was a picky eater. When my daughter turned out to also be picky I was fine with indulging her. I knew it was something she would grow out of. On thing that she dud really like was chicken fajitas. Every Thanksgiving I would be sure to have some tortillas. I would shred the turkey,  add some cheese, add avocado & lettuce from the salad and voila chicken fajitas. People said then that I was spoiling her. I didn't care what they said. She now eats a wide variety of things.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Hell yeah, chicken fajitas.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "White breast chicken, turkey and for that matter fish is ALL meat.  So basically you don't like 'red' meat or pork.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 3,
                      "content": "True it is meat.. Good job!",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "FYI \"discussed\" and \"disgust\" mean very different things.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Indeed.. Didn't even notice it lol",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 726,
              "content": "Good for you, mom. Please also let Ava know you'll support her food preferences, too!",
              "id": 28,
              "comments": [
                {
                  "score": 1024,
                  "content": "I definitely will. I'm in charge of pick up this week, so it'll definitely be addressed before I head home. I'll be stopping at Mike's place to talk with him and Liam about John, and then I'll talk with Ava and her mom when I pick her up. There have been a lot of helpful comments and I've realised I need to talk to John's ex, too, to see if this is behaviour that he exhibited when they were married",
                  "id": 29,
                  "comments": [
                    {
                      "score": 495,
                      "content": "The children are lucky to have you looking out for their best interests. \n\nI truly hope it goes well and this is just some weird hang up he has (a lot of people get weird about food), and that he's otherwise good to all of you, and you two can work this out. This is hard -- Best wishes to you.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Also tell Ava that she doesn't need to go through her dad for things like that, and that she is welcome to talk to directly. Also check with Ava mum how she would like you to handle \"girl stuff\" so that you are all on the same page when that time comes because that is definitely something that needs to be the same in both households and isn't exactly easy to discuss with \"dads\" (I know, been there teenage daughter raised by a single dad).",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "The thing that gets me is this whole thing started because of *his* assumptions. Like you said, you would have done it for Ava had you known. How is she reacting to this? Does she understand that point?\n\n>I need to talk to John's ex, too, to see if this is behaviour that he exhibited when they were married\n\nIf it's not too personal - can you keep us updated on this? 👀 ^(I'm sorry I'm so messy)",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 163,
              "content": "Also, John didn't tell Ava 'No' about you making stuffing without inions for her. He said that you said \"No\" after he asked you. He lied to his daughter so you would be the bad guy in the situation.\n\n>He says it's my fault Ava (and her mother) is mad at him.\n\nIt is not your fault that he got caught out in a lie that you had no knowledge of.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "NTA. My cousin is the only vegetarian in the family and whenever there is a family gathering we all cook 2 separate meals, one for him without any kind of meat and one for everyone else, and my cousin is 60!!",
              "id": 34,
              "comments": [
                {
                  "score": 16,
                  "content": "My daughter and her BF have different likes and dislikes to my husband and I, so when we have them over I make sure that there are options not only for them but for their soon-to-be 1 year old to try. BF and baby have some texture issues, expected of a kid but easily accommodated for an adult. Why are people so unwilling to make meals enjoyable for everyone they want to feed?",
                  "id": 35,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I should add: We cook exactly the same food for my cousin but without the meat. We all know it and it is no problem at all. We want him to enjoy being in the festivities with us without sacrificing his beliefs.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "This. I was a picky eater as a young kid, and still am a bit but barely anymore, and my mom made seperate stuff for me whenever we were having something I didn't like. Something quick and easy, stuff I could make on my own. Salmon for them, cheese quesadillas and tomato soup for me. Thankfully I branched out and people were very accepting about it before I did, but it pisses me off that there are some people who just can't wrap their empty heads around the fact that some people have different food preferences.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I agree with you! \n\nWe need to do something similar because my youngest sister and her twin boys have terrible reactions to milk products, and my middle sisters husband and daughters are severely gluten intolerant. So whenever we all get together, we always make alternate versions of whatever dishes are being made that night. It was kind of difficult at first but it's basically second nature now 😊",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "NTA by a long shot. I suggest reexamine your relationship with him as well, he shouldn't be hurling insults over something so minor and if this is a regular thing. Set a better example for the kids so they don't accept such behavior. Also, he just threw you under the bus too. Red flag.",
              "id": 39,
              "comments": [
                {
                  "score": 2,
                  "content": "Yeah, he needs his head examined. Sounds like from the whole throwing-you-under-the-bus thing that there could be some manipulation of you and the kids coming up from other stuff I've heard, so keep an eye out.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "The problem here isn’t you, Liam or onions.  The problem here is that John needs someone or something to blame for his getting caught lying to his daughter.\n\nDoes John always look for a scapegoat when he’s done something dishonest?  \n\nNTA.",
              "id": 41,
              "comments": [
                {
                  "score": 6,
                  "content": "Agree,John’s totally the problem.The idea that the kids can’t make food modifications because “not everything is going to go their way all the time is utterly ridiculous” and not the way to make them learn that lesson.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "John is a complete asshole. I have major sensory/texture issues that prevent me from enjoying food. It isn’t the taste, it’s the texture. The first obnoxious thing was pointing out that Liam was trying something new. That makes me shut down, I hate anyone pointing out what’s on my plate because everyone has always made me feel weird about what I put there and when I was younger it was a quick way to make sure I didn’t continue to introduce the new food to my diet. There was also no way you could have been an asshole because you weren’t armed with the proper information that would have helped you accommodate his child’s needs. Feeding kids can be tricky enough so listening to them and figuring out compromises is important, and him dismissing her needs without even approaching the topic with you is unfair to you and her both. It takes a lot of work for me to break out of my safe foods and it’s not as bad as I was at Liam’s age, but if my mom didn’t work with me and forced me to eat things I didn’t want, it would have kept long standing mental blocks in place. NTA.",
              "id": 43,
              "comments": [
                {
                  "score": 8,
                  "content": "Exactly.\n\nI hate it when people point out that I am eating something “new” without understanding the accommodations that may have occurred for me to even try to eat it. It also draws unnecessary attention.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I was once brought to tears over all dressed pizza. The toppings were under the cheese so I couldn’t easily pick things out and even if I could the taste of the stuff would still be there and even if I could get past both of those, it’s rude and instead I sat there staring at it and cried. That was at 22. I know it’s ridiculous to cry over pizza but I was so hungry and couldn’t bring myself to eat it.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My brother and I are both very particular eaters. Sensory/texture/etc. All through our childhood our aunt and older cousins would make a big deal about the limited food on our plates at holidays. Then one of the cousins has a daughter that is 100x worse than we are. Then every holiday she has a special meal made just for her, no comment made (while they are still commenting on what my brother and I are eating). Drove me crazy.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "NTA but all the insults are really concerning - It's STUPID to do something and you're an idiot.  Then there is more name calling.  I get the impression that things are more messed up here and I would say fighting over something this is revealing that relationship has more problem than stuffing.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "My grandma always made a separate batch of stuffing just for my dad without onions until she couldn’t cook anymore (when he was mid 50s). She was the best grandma and mom. You are a good mom.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "This is a wonderful take away and im really glad you care enough to do this.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 407,
          "content": "He's super in the wrong, but let's not mistake this: he isn't mad that she's feeding her child, he's mad that he fucked up and is making it about her feeding her child to shift blame, which is honestly worse. \n\nHe's the one who never asked OP, and once he got called out on it and it caused problems, his reaction is \"this never would've happened if you didn't spoil your son!\" Instead of \"yeah, I messed up and didn't realize you'd be fine with it, that's on me.\"",
          "id": 50,
          "comments": [
            {
              "score": 133,
              "content": "Actually shifting blame twice, the first time by telling his daughter that OP thought it too much effort without discussing it with OP. John is the AH",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "And why the hell couldn't HE MAKE the onion-less stuffing for HIS daughter? Why was it a 'pass the buck' to OP? I know why, of course; it's because OP is female so she must do all the cooking.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I don't think John is mad that he fucked up, he’s mad because OP is undermining his attempt to be dictatorial.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "parents who don’t address food preferences early on can fuck up their kids’ nutrition for life, which is something that if he’s a good dad, he’ll be willing to learn more about. if he digs in his heels i’d be really concerned about all of the kids involved",
              "id": 54,
              "comments": [
                {
                  "score": 2,
                  "content": ">which is something that if he’s a good dad\n\nBut he obviously isn't. And OP mentioned in the comments that he could be giving Liam a hard time when she isn't there, which I don't doubt considering what we already know about this... guy, I guess I have to call him. She did mention that she'd talk to Liam and her ex-husband though. I feel bad for everyone except dumbass John, they all deserve better.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 160,
          "content": "Seriously, if both kids don't want onions just make the whole thing without onions and if the husband says anything just tell him that it's too much work and it's stupid to make special stuffing just for one person, and you don't want to spoil him by always giving him what he wants. NTA",
          "id": 56,
          "comments": [
            {
              "score": 15,
              "content": "Hilarious! But then his mother and older sister would think OP is the ah even more 😄",
              "id": 57,
              "comments": [
                {
                  "score": 3,
                  "content": "Sometimes you're the justified AH.  Like OP would be if she did this.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "We already know he’s lied to Ava about something OP said at least once. I would be concerned about this as well.",
          "id": 59,
          "comments": [
            {
              "score": 95,
              "content": "I would talk to Ava too, to see if there's anything else she's asked for that he has denied.\n\nEdit to add: thank you for the award!",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 93,
          "content": "Agree, it's a definite red flag; he seems to have anger issues.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "I honestly can't imagine this family dynamic, when a simple meal turns into Stuffinggate.",
          "id": 62,
          "comments": [
            {
              "score": 36,
              "content": "And EVERYONE knows and has an opinion!",
              "id": 63,
              "comments": [
                {
                  "score": 13,
                  "content": "This was also next level for me! WHY does the whole family need to be involved in a pretty standard family discussion on how to avoid picky eaters?",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "once you take the onion out there is even pi[e]!",
                  "id": 65,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It makes sense OP brought Reddit into it because why not at this point? I hope they also involve the neighbors. Like just throw a neighborhood BBQ and ask them to vote.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": ">Your child is 8 not 18. If it wasn't too much trouble to make him something he would prefer to eat why wouldn't you do that for him?? \n\nFor real. Like, I'm not a short order cook and this ain't a diner, so usually dinner is an, \"eat it or starve,\" situation. \n\nBut honestly if you have the time/energy/ability then yeah, why not? Most parents *enjoy* doing nice things for their kids, and we have to say no all the time so getting to say yes is a joy.\n\n(Don't come at me, this is mostly a joke, lol - dinner is usually an, \"eat it or make something yourself, and within some semi rigid parameters to ensure you get a healthy well rounded meal,\" but that's not as pithy.)",
          "id": 67,
          "comments": [
            {
              "score": 51,
              "content": "Childhood is a blip, and life can be cruel and difficult. Getting to say yes and making them happy is one of the best things about being a parent. These little accommodations won’t turn your kid into an entitled monster. Bringing a child joy through these small “I see you” moments of connection and kindness creates empathy and a family culture of care.",
              "id": 68,
              "comments": [
                {
                  "score": 2,
                  "content": "This is a good parenting philosophy.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Credit where credit’s due- I arrived at it by asking myself what my parents would’ve done, and doing the opposite.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "There's a difference between \"eat it or starve / make your own dinner\" when someone shows up at the table and says they won't eat ANYTHING, and *asking beforehand* if an ingredient can be excluded.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "It’s not THAT hard. I have a kid that refuses to eat CHEESE! It’s tough because my husband and I love cheese. We like to find new ones to try. I’ve made goat cheese several times. We honestly don’t understand how we made him. \n\nEven so, we order him a cheeseless pizza on pizza night. He gets a small dish of cheeseless lasagna when we have that. If a meal is topped with cheese, we leave a quarter of the dish un-topped. When we have broccoli with cheese, he has it with salt and pepper. It really isn’t a big deal.",
              "id": 72,
              "comments": [
                {
                  "score": 9,
                  "content": "There's still hope; I hated cheese as a kid and love it now (except bleu cheese. I can't deal with that.)",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I was that kid, lol. My mom, like you guys, would leave a small portion without cheese. And ham and cheese sandwiches would become just ham sandwiches.\n\nI do eat cheese these days!",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I wish I’d had you as my mom… I grew up not liking cheese (by which I meant cheddar, American, and Swiss—the only kinds my family ate), squash, and liver, and my parents, grandparents, and aunts tried constantly to “fool” me into eating them. \n\nAs a result, I didn’t even try pizza until I was in high school (cheese is cheese, right) or other cheeses until I was in college. (Liver and most squashes are still off my menu, though.)",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "Even if they are 18, if it’s not that much extra work why not make food the way your kid likes? Aren’t you supposed to, like, enjoy doing little extra nice things for your kids? My mom always keeps dairy free coffee ice cream in the freezer for my husband. She keeps peas out of my favorite things. I make special portions of food with no onions for my dad. The whole point of feeding people is for them to enjoy it. Obviously kids need to try new foods but little man’s tried it several times and just doesn’t like onions, a very common food for people to not like.",
          "id": 76,
          "comments": [
            {
              "score": 12,
              "content": "Exactly! My kids are adults. One doesn't like Chinese food, one doesn't like certain Italian foods. They both live at home but aren't always around. When I make dinner, I think about what one likes and the other doesn't, depending on who will be eating. And sometimes I just cook for myself based on what I want, and they are welcome to get their own if they don't like it. OP is a great parent and NTA.",
              "id": 77,
              "comments": [
                {
                  "score": 2,
                  "content": "My son is not a fan either. I microwave a small portion and add it to my own meal if I want it. It’s not hard to make minor accommodations",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "You're so right! Hell, at my house, we sometimes have like, 3 dishes in a meal, because there's a few things someone doesn't like or someone really wants something in particular. We can save what's left for leftovers and if it makes people you love happy without much work, it's just, an easy choice??",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "[deleted]",
          "id": 80,
          "comments": [
            {
              "score": 2,
              "content": ">From now on, stuffing for everyonedoes not contain onions.\n\nWatch John flip out. \"WHAT?! THE ONIONS WERE MY FAVORITE PART! HOW COULD YOU DO THIS TO ME?!",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Also, they could be allergic. Just because your lips don't swell and you don't have hives doesn't mean your not. My parents keep trying to feed me mushrooms as a kid. The smell made me dry heave. As an adult, I finally ate mushroom sauce pizza, and had to take immodium to settle my stomach twice. Turns out I'm allergic to Mushrooms!",
          "id": 82,
          "comments": [
            {
              "score": 3,
              "content": "This.  It took me 27 years to get across to my family that I was allergic to onions.  Little kids don't have the knowledge of why a certain food makes then sick, just that it does.  (Also some food allergies don't show in a skin test.)",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1447,
      "content": "Uh NTA, next time, make him stuffing with shit he hates in it and make him eat it to see how it feels. Good on ya for accommodating your son. And now you know your daughter also doesn’t want onions. John needs better communication skills specially if y’all have kids.",
      "id": 84,
      "comments": [
        {
          "score": 831,
          "content": "I'll admit, I'm definitely tempted. Sunday is only two days away, after all...",
          "id": 85,
          "comments": [
            {
              "score": 240,
              "content": "Do it 🤣🤣🤣 AND when you go out to eat dont let him make orders and dont ask what to make at home- HE WILL EAT ONLY WHAT YOU LET HIM EAT- dont like it? Stay hungry....\nAnd sorry but i would never want to have kids with someone like that .... you need to make sure that they eat and if you need to take out onions for that do it.....",
              "id": 86,
              "comments": [
                {
                  "score": 2,
                  "content": "Or put hot sauce in his morning coffee.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 158,
              "content": "Alternatively, you could only make the onion free version.",
              "id": 88,
              "comments": [
                {
                  "score": 130,
                  "content": "This is definitely a good softer option lol. There’d be a sound, non-confrontational argument for it (“well, both kids prefer it with no onions, so instead of making two separate versions, I figured it’d be easier and better for everyone if I just made one”). And if he gets mad about it, there’s no universe in which his frustration will be reasonable, because he himself said that not everything in life goes your way, so if he doesn’t like it without onions, he can either deal with that or not have any.\n\n(To be clear, I think the whole “you’ll learn to like it or you won’t have any” attitude is shitty, but if he believes it then he should be able to lead by example and follow his own rules.)",
                  "id": 89,
                  "comments": [
                    {
                      "score": 22,
                      "content": "When he cooks, maybe he can make the rules?",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "This made me lol I imagined her serving them onion free stuffing and him a raw onion all chopped up",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 84,
              "content": "As someone who was always a 'picky' eater and forced to eat foods I hated, only to discover I had IBS and most of the foods I was picky about were actually making me ill, I have very strong opinions on this stuff. I have found, even as a 54 year old adult, that there are people out there that still give me shit for not eating onions, or think it's weird, or that I just need to try it their way. I think some people are just literally incapable of understanding food issues, texture issues, or diet issues, and I find in many cases, those people lack empathy in general. Food for thought - but I won't make you eat it.",
              "id": 92,
              "comments": [
                {
                  "score": 35,
                  "content": "I learned in 6th grade about the various worms associated with pork. Especially undercooked pork. the video we watched sickened me so bad I could just never see pork the same way. \n\nI never complained if it was served, I just skipped it and didn’t eat it, but my ex husband would hound me nonstop and make it a huge deal if he noticed I didn’t eat it at a dinner. \n\nHe would say things like “you’re not even Muslim, I could respect your opinion on it if it were at least religious but you just think it’s *gross*” I hated having to justify why I didn’t want to eat something. It’s no one else’s business",
                  "id": 93,
                  "comments": [
                    {
                      "score": 2,
                      "content": "You may have sullied my view on pork lol",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I also have IBS. The last time I had an onion ring (just one, and it was really small!) I spent the next several hours lying on the bathroom floor regretting my decisions.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Onions and garlic are one of my triggers too! OPs husband would hate us lol",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Honestly this is fairly common apparently according to the allergist. My son refused to eat any baked goods. He is allergic to eggs. \n\nMy daughter said chocolate made her stomach hurt she's got full blown celiac disease and in hindsight most chocolate isn't gluten free unless you specifically look out for ones that are. \n\nI sometimes feel guilty because what if it wasn't just candy, cakes and ice cream my kids hated would I have pushed them to keep eating? Now I never ever push food on anyone",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I am the same age - a grown ass adult - and I am heartily sick of getting shit on for my eating habits. I don't like it. ok? That should be enough. I don't have health issues, I just don't like a lot of stuff. I will try anything, but I won't eat it if I don't like it so STFU about it, ok?",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Saaaaame.  My mom didn't have a very diverse menu and didn't cook often anyway.  I love my grandma's cooking but i always had stomach problems.  I was a pretty picky eater as a kid.  Turns out, IBS here too, and i have issues with onions.  The older i get, the more miserable i am if i accidentally eat something with onions.  My family puts onions in EVERYTHING.   \n\nAlso, i'm very open about whether there's foods i'll eat but i don't prefer or if it's something i just CAN'T eat... i'm in my 40's, can we stop trying to hide onions in things and saying they aren't in there?",
                  "id": 99,
                  "comments": [
                    {
                      "score": 2,
                      "content": "OMG yes - they lying about what is in food - my ma STILL does this.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I was super fussy about onions as a child, I was never forced to eat them but my family didn't understand why I couldn't just pick them out. I remember as an adult talking to a friend about onions and saying I liked them cooked but I couldn't handle the burning sensation when they were raw. My friend was very, very confused. \n\nTurns out, onions aren't supposed to burn and blister your mouth when you eat them and I have something called Oral Allergy Syndrome. I just thought I was a wimp!",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "That’s the funny thing.  As adults we get to decide not to eat things we don’t like, even though I like more stuff now than when I was a kid.  There are times to force kids to try things but continuing it for no reason is foolish.  If I’m able to make an alternative that’s not completely difficult then why not.  Because your right it’s more about putting good food in the kid then fighting about crap.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "If you’re not bothered about having onions in the stuffing yourself, I’d just make it without onions. And I’d make exactly as much food as you and the kids will eat and tell your husband that not everything will go his way in life and he’ll just have to deal with it.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I agree.  He does need better communication and OP should not have been fussed at.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 960,
      "content": "NTA. Your husband is just mad he got caught lying to his daughter about talking to you... which probably has more to do with HIM not wanting to deal with it, than not wanting you to have extra work.\n\nNormally I wouldn't assign an extra assumption of poor behavior, but I feel like a guilty conscience is often the cause of an overreaction like this. He knows he's being a shitty communicator.",
      "id": 105,
      "comments": [
        {
          "score": 55,
          "content": "This 100%. It’s the same reaction as the posts we see where one person just tells the truth about something that happened and another person becomes irrationally angry because it makes them look bad. OP didn’t do anything wrong. Her husband just wanted to be able to hide his poor behavior (lying to his child) and OP inadvertently brought out it into the open.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 564,
      "content": "NTA, sounds like you would have done the same for Ava (or anyone else) if she had asked you directly. Your husband was trying to look after you, but his final reaction makes him TA.",
      "id": 107,
      "comments": [
        {
          "score": 611,
          "content": "I definitely would have if I'd known! I'm doing my best to treat Ava as I would my biological children. I don't want her to feel left out in our home.",
          "id": 108,
          "comments": [
            {
              "score": 127,
              "content": "You are such a good mom. NTA at all",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "I would make Ava and your son stuffing without onions on Sunday.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "I wonder what else he is speaking to them “on your behalf” and not telling you…",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "My son hated onions, too. And mushrooms. But the flavor is soooooo good. When he was little, I just chopped them so finely that he couldn't even find them. \n\nWhen he was in high school he wanted to learn to cook, so we made the recipes together - and that's when he found out that the flavors of food he loved (stuffing, chili, chicken soup, etc) had onions and mushrooms in them all along, we both laughed. Now he eats everything and is becoming an adventurous cook.\n\nnote: I never lied about the ingredients - when he first asked, I just said, \"do you see any mushrooms or onions?\" and he didn't ask again. \n\nNTA",
              "id": 112,
              "comments": [
                {
                  "score": 4,
                  "content": "When I was a kid, I didn't like onions, but liked the flavor of onions in stews etc. I would always insist on dicing the onions incredibly finely, so I couldn't tell that they were there. These days, I'll happily add extra onions to everything.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Your taste buds change as you get older too. Little kids have more tastebuds and are pretty much super tasters. When you grow older and 'get used' to certain food, it's possible that the don't even really taste the same to you as they did when you were a kid as your tasting senses are different. I hated mushrooms as a kid, and raw tomato, and eggplant. I like them all now (except peppermint, which I still loathe). I remember when the different colours of M&Ms had different flavours. Not now though lol.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "NTA - your husband got made to look bad by his own actions and is trying to deflect the blame to you. \n\nSide note: you should definitely make a larger onion free stuffing this Sunday, for both kids to share.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 179,
          "content": "I’m sorry, but I’m not convinced he was trying to look after OP. He just couldn’t be bothered and thinks kids should just suck it up. And then he blamed OP. What a stellar father and husband!",
          "id": 116,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "Maybe it's good to realize that just omitting or adding one ingredient is much less work than cooking an alternative meal  My wife often does that if there are guests with diet restrictions, or even to make a standard dish extra spicy for herself or others. This way you can please people extra without much additional work.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I don't think he was looking after OP. I agree with ka-ka-ka-katie who says it was about husband not wanting to bother. And then projecting because he was caught lying about talking to OP.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 377,
      "content": "NTA. Your husband is though. For first telling his daughter he'd do something and intentionally not do it. He caused this entire thing. He should have talked about it with you before deciding to tell her that you said it would be too much work. It's his lies that caused this mess.",
      "id": 119,
      "comments": [
        {
          "score": 101,
          "content": "I'm pretty sure he forgot and when his daughter asked him again reminding him of her request he lied. What an Ah. NTA op",
          "id": 120,
          "comments": [
            {
              "score": 73,
              "content": "Which is worse? Lying to his daughter intentionally or forgetting to do something and lying about it to shift the blame?\n\nI'd say intentionally lying and I'd also think based on his reaction thats exactly what he did.",
              "id": 121,
              "comments": [
                {
                  "score": 19,
                  "content": "Like would it be that bad to say, I’m sorry Ava I thought I told op but might have mistaken. Op do you have anymore for Ava? Like simple easy and not even admitting true fault just forgot.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This whole situation is just a series of deflections by OP's husband. I'd find it hard to trust him going forward.",
                  "id": 123,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Both are equally as bad because the latter becomes the first. In the first version he intentionally lies from the beginning and in the latter he also lies intentionally.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "And he threw OP under the bus, which makes him an extra AH in my books because step parent relationships are already challenging enough. \n\nNTA.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Great lesson for the kids on why lying is wrong and how it hurts people's feelings.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Agreed. NTA and husband is also TA for assuming what OP would think, feel and say about a situation without ever taking with her!",
          "id": 127,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 321,
      "content": "OP is NTA and a caring parent.  Now John on the other hand...\n\nI know this is story is just a snapshot of your life, but OP ask yourself if this behaviot of name calling and shaming is a one-off event or a pattern.  If it's the latter, do yourself and Liam a favor and sincerely reevaluate this relationship.",
      "id": 128,
      "comments": [
        {
          "score": 164,
          "content": "He has always had a habit of calling names when he's angry, but he never used to get angry all that often",
          "id": 129,
          "comments": [
            {
              "score": 249,
              "content": "[deleted]",
              "id": 130,
              "comments": [
                {
                  "score": 77,
                  "content": "I didn't see it as an excuse. Just an explanation.\n\nIt is worrying though. \"Never used to\"? So what changed?",
                  "id": 131,
                  "comments": [
                    {
                      "score": 141,
                      "content": "OP said in another comment he's been angrier since she fell pregnant with their second child together. \n\nWhich is, you know, concerning.",
                      "id": 132,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 43,
                      "content": "Tired of the facade and can finally let loose his real personality of being a petulant child! \n\nIn all of reality if someone wan to change and improve themselves then it’s time to go to a therapist. Stop avoiding emotions in yourself, stop running from guilt and blame, own your shit, go to a therapist.",
                      "id": 133,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 28,
                      "content": "She's pregnant again, and therefore locked down. He no longer have to be on his best behaviour. Abuse is going to escalate, I guarantee it.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "She’s mentioned in a comment he’s been quick to get angry these past few months ever since they found out she’s pregnant with the second child",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "Who is excusing anything? Relevant information is relevant, even if it doesn't support your desired judgement. And in this case, I wouldn't say that it supports or opposes any judgement about the husband, it more explains why she put up with it in the first place.\n\nHe's always been shitty when he's angry, he just used to not get angry very often.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 2,
                      "content": "[deleted]",
                      "id": 137,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 96,
              "content": "https://ia800108.us.archive.org/30/items/LundyWhyDoesHeDoThat/Lundy_Why-does-he-do-that.pdf\n\nThis is a link to a free pdf version of a great book called “ Why does he do that?”. Op, I would check it out.",
              "id": 138,
              "comments": [
                {
                  "score": 73,
                  "content": "Thank you! I'll definitely check it out!",
                  "id": 139,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Good. Please please do. \nAlso, name-calling is a form of emotional abuse (“contempt”)and is one of the best predictors of eventual divorce (in 3-7 years). Cannot find the article that has the years statistic, but here is a start: https://www.cnbc.com/amp/2023/03/03/no-1-thing-that-destroys-relationships-say-psychology-researchers-who-studied-couples-for-50-years.html",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "Omg OP that’s is not okay! You should never have to tolerate name-calling by your partner- the man who vowed to love and respect you!! Please reconsider this marriage",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Obviously I don’t know your relationship, but it shouldn’t be the norm for your partner to call you names when he gets angry. He needs to learn to manage his anger in a healthier way instead of resorting to insulting slinging",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Big red flag here. Previously, he didn't allow himself to display anger as often.\n\nThat doesn't mean he wasn't angry. He made an effort to hide it better.\n\nClassic abuser behavior. As you get more acclimated to being abused, he gives himself permission to treat you worse.",
              "id": 143,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "... I think you should talk to his ex-wofe about why the relationship ended.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "NTA.  \n\n**It's baffling to me that he would be mad that you would do something nice for his daughter** ***simply because it makes her happy.*** He needs to step back and remember he's supposed to be an adult, admit he messed up and not double and triple down. I feel like after hanging out around AITA so much there's a huge population of blended families who would pat you on the back for doing something nice for their kid.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I recently read something on Reddit that resonated with me and also helped me understand why the disagreements I have with my partner have never become large issues and certainly not what I’d call a fight. \n\nTwo adults who respect and love each other do not name call in an argument. “I was mad” is not a reason to curse at the person you care about. You can say you’re frustrated with the situation, you can be upset, but name calling is always off the table. When you are upset with him can you imagine calling him an asshole? If you did would you later regret it? It’s deeply hurtful to label a person you love with a shitty term just because of a disagreement. Disagreements can be solved, but the words you threw at the other person will always be out there. \n\nI wish I could find the comment I read because it was put very nicely.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "He's more comfortable now that your locked in with a child.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "That is an extremely red flag. The fact that he jumps to insults when he’s angry means he doesn’t know any healthy ways to work through that anger, so all he can do is blame the anger on someone else. That’s not a recipe for a healthy family, and he needs a come-to-Jesus talk IMMEDIATELY so he can start working with a professional to sort out his anger issues.",
              "id": 148,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 165,
      "content": "NTA. But, onions in the stuffing are the least of your problems. If you SO is calling you names and telling you how to treat your son -you have bigger issues to address.",
      "id": 149,
      "comments": [
        {
          "score": 8,
          "content": "Yeah. It's such a petty, stupid thing to start an argument over. Maybe you think it's too much trouble to do through to make a separate batch of stuffing without onions, but if your partner wants to do it, just let them. Who cares???",
          "id": 150,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 151,
      "content": "NTA. John’a reaction is pretty telling though. His need to control what is served and the flow of information, and to denigrate you personally as well as your child rearing skills is alarming to say the least. But perhaps he is right and it is too much trouble.  Since half of the diners at the table don’t like onions you should only make stuffing without onions from now on.",
      "id": 151,
      "comments": [
        {
          "score": 130,
          "content": "I think I might make it without onions this Sunday, since we'll have both kids by the time dinner's served.",
          "id": 152,
          "comments": [
            {
              "score": 82,
              "content": "I too customize my stuffing for the the kids, hubby and me.  I put the individual servings and bake them in a muffin tin or tins and mark the tin with whats missing from the stuffig with washable marker.  That way eeryone has their \"own\" serving.\n\nNTA and I have to say if my husband called me names and overeacted about this type of issue, his serving would be liberally sprinkled with ghost peppers.",
              "id": 153,
              "comments": [
                {
                  "score": 26,
                  "content": "Oh.. a “stuffin muffin”\nBrilliant!",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yes I got the stuffing muffins idea from Martha Stewart. Is it normal in your family to have stuffing? I always thought it was a thanksgiving treat like turkey. Never occurred to me to make it any other time.",
                  "id": 155,
                  "comments": [
                    {
                      "score": 4,
                      "content": "despite the fact I customize it, everyone loves it so I make it probably 3 or 4 times a year outside of holidays.  \n\nI also make pineapple stuffing in muffin tins, lasagan cups (texas size muffin tins), Mac & Cheese, egg \"muffins\"  It started Kids  and their friends loved it when they were younger and it made it easier to keep of track of the customization  (alas, i am the picky one that I am generally customizing for)",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You can also make some caramelized onions separate from everything else and serve them as a topping. My boyfriend does this frequently and they're pretty delicious.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "I'm still trying to figure out why he found it necessary to comment on the stuffing on Liam's plate. Could be totally innocent,  just a little surprised but it felt nitpicky and somehow aggressive *before* I finished reading and learned how John acted.",
          "id": 158,
          "comments": [
            {
              "score": 10,
              "content": "agreed. that felt a little weird to me too",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 132,
      "content": "NTA - how were you supposed to know your husband told a white lie to ava about the stuffing? he should've owned up to the problem he created and been honest with her, and you, about it when you were at the table.   \n  \nsmall things like this turning into big arguments is a sign that communication isn't great and that there are likely other issues that are *actually* causing tension. it's wild that the ex wife, your MIL, SIL, and BIL, your sister, and parents are all involved over stuffing that was made without onions.",
      "id": 160,
      "comments": [
        {
          "score": 155,
          "content": "This is definitely one of the most bizarre arguments I've ever had. I really don't know why it became a big thing, to the point that I had to explain to my own parents that the reason my husband didn't visit them with me was because he was mad that I made stuffing without onions for my son",
          "id": 161,
          "comments": [
            {
              "score": 121,
              "content": "Your replies make me think you need to sit down and seriously analyse the behaviour of your husband both towards you and all of the children. I would also be talking to your son incase there is things happening in the background.\nI would even be looking into just why his last marriage ended as i have a feeling it was a HIM problem.\n\n\nHe is acting more immature than a child by lying and then having a tantrum when caught lying. This incident may be over the small issue of onions  but if you don't get on top of it soon this will be a regular issue and his anger will increase.",
              "id": 162,
              "comments": [
                {
                  "score": 25,
                  "content": "This comment nails it. And just to add: if what he said to you is so bad that you don't want to repeat it here on Reddit, then onions are not the issue here.",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "I imagine that was one of those moments when your brain went blue screen for a moment,  trying to figure how this sentence became necessary. Like a game of MadLibs went sideways. \n\nUsually when we say something that requires a \"Wait, wtf did I just say\" then \"Fml for making me speak that absurd sentence \", it's someone under 10 that made us say it. (One of my favorites was when I had to tell a young friend \"Don't bonk your brother with the mango!\"",
              "id": 164,
              "comments": [
                {
                  "score": 13,
                  "content": "One I said to my nephew when he was a toddler has become engraved in my brain: \"Don't put oatmeal in your diaper.\"",
                  "id": 165,
                  "comments": [
                    {
                      "score": 5,
                      "content": "“Why is there a domino in your diaper?” \n\n“Stop licking the dog!” \n\n“Please get your finger out of your brother’s nose.”",
                      "id": 166,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "My best one from my daycare days was “please don’t lick the table legs.”",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Wait, so in addition to all the awfulness in your post this carried on and he refused to be a grown up and visit your parents as scheduled?!?\n\n\nYikes on bikes, these are all very bad signs.",
              "id": 168,
              "comments": [
                {
                  "score": 14,
                  "content": "Yea. He's escalating this argument to crazy levels.",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Gaslighting. They did something wrong but need to find a way to frame it as your fault, not theirs.",
              "id": 170,
              "comments": [
                {
                  "score": 14,
                  "content": "He's not gaslighting. Gaslighting is when you get someone to question their own perceptions of reality. \n\nHe's simply arguing that he's right and she's in the wrong.",
                  "id": 171,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "He was so upset he skipped having dinner with your folks? He's a stubborn child!",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "After your comment about his behavior since your pregnancy, I feel like there are big underlying issues that are being expressed during minor issues. As in - it’s not the onions, that’s just the issue where the negative feelings are coming out. \n\nAre you in couples therapy and if no, is that something you could pursue? \n\nAlso NTA for the record.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "I disagree that it was a white lie though.  He lied twice to his daughter and shifted the blame for his no onto OP. The real question is how often he’s doing that and secretly making her the bad guy.",
          "id": 174,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 86,
      "content": "NTA. From now on just make all the stuffing without onions to make it \"easier on you\" and then when he complains about not having onions tell him not everything in life is going to go his way.",
      "id": 175,
      "comments": [
        {
          "score": 3,
          "content": "Underrated comment is underrated",
          "id": 176,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}