{
  "post content": "so i live in a small apartment with 3 other young college students. we all agreed to share kitchen things like pots and pans. the rule usually is that u need to wash ur things within 24 hours (we mark our dirty dishes so we can keep track of which belongs to who). if someone really needs that pan while its still dirty, they can either ask the person to quickly clean it, or just do it themselves if the person cant right now. \n\nso, i recently joined a meal kit service. i cook 4 times a week and i always start at 5pm, usually finishing around 6pm. all of my roommates eat much later in the evening at sporadic times. except the other day, one roommate Sally (fake name) was going to have friends over and cook for them. i told her she can have the kitchen after 6. she says she NEEDS the big pan (the only big pan, one i bought) so could i please wash it right after i cook? i said sure. \n\ni actually finish cooking at 5:40. the big pan was still hot. since i had 20 minutes until the agreed time, i decided i wanted to eat first before cleaning the pan, i was starving and wanted to enjoy my warm food. the minute i sat down, Sally got pissed. she asked if i would clean the pan before i ate. i said no, we agreed on 6 so i have time to eat before i clean it. she says no we agreed i would start cooking right after u, come clean it NOW. i say no, i dont want my food to get cold and have to put freshly cooked food in the microwave, and that i will clean it right after i finish eating, itll only take me ten minutes. sally says itll only take a minute to clean, ur food wont get cold. i say yes it will, food gets cold really fast. she growls under her breath and snaps saying that fine she will just clean it then. but once she throws the pan into the sink, she says to other roommate Becca that im making her so angry she doesnt want to do this angry, tells Becca to come to her room so they can smoke to calm down. \n\nafter she leaves... yes, my food had gone cold from a minute of arguing. anyway, i finish eating ten minutes later, shes still in her room. i clean the pan as agreed. she doesnt come out for another twenty minutes. now, a few days later, Sally is acting extremely cold to me, ignoring me completely. \n\ni dont think im TA because we agreed on 6pm, i have a right to eat first, i dont have to rush to her command. its MY pan technically, if she really needs it all of the time then she should buy her own big pan, or just suck it up and wash it.\n\nbut im wondering if i might be TA because she was \"in a rush\" to cook (which doesnt make sense because she smoked for like half an hour) and was extremely stressed from school. it wouldve only taken me a minute to clean it and maybe i was being mean to say no and prioritize eating. we did agree that she would cook right after me. \n\nso, AITA? (also idk how to handle the tension in the apartment now lol)",
  "id": 1,
  "comments": [
    {
      "score": 78,
      "content": "ESH.\n\nY’all are petty and immature AF.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 62,
      "content": "ESH. “We Mark our dirty dishes so we can keep track of which belongs to who”.  You sound like petty middle school children, grow up. Your room mate could just wash the pot if it were so important to her, and you could have offered to help her cook or clean to prepare for her guests, but all I hear is petty bickering. This isn’t how it’s supposed to work. Move in with people you care about so it doesn’t have to be so tit for tat.",
      "id": 3,
      "comments": [
        {
          "score": 52,
          "content": "[deleted]",
          "id": 4,
          "comments": [
            {
              "score": 5,
              "content": "To be fair, most of the time, the other roommates don't eat until later, so it's not an issue. This time, it sounds like 6 would have worked for Sally, and she agreed to it. In fact, it sounds like she didn't start until 6:20.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -4,
              "content": "[deleted]",
              "id": 6,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 54,
      "content": "I must admit I haven’t read the whole thing.\n\nI’m just surprised one can write so much based on not washing a cooking pan",
      "id": 7,
      "comments": [
        {
          "score": 33,
          "content": "Tbf there was a lot included about whether or not food cools quickly on a plate or not.",
          "id": 8,
          "comments": [
            {
              "score": 9,
              "content": "It probably could have taken her less time to resolve this rather than to post it on Reddit lmao",
              "id": 9,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 35,
      "content": "Your food was cold after one minute of arguing? ESH. You both are being drama llamas over a five minute task",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 17,
      "content": "ESH\n\nYou’re both being petty as hell. What food besides eggs (and even those) cools down in one minute? It wouldn’t have even taken that to wash the pan, but you decided to eat first. Your food would not have gone cold in thirty seconds. \n\nYour friend could have just washed the pan her damn self if she knew it wouldn’t take long—if I needed the pan at a certain time I’d have made sure it was clean either way rather than rely on someone else to do it. And she handled it like a complete child.\n\nYou’re both wrong here.",
      "id": 11,
      "comments": [
        {
          "score": 2,
          "content": "Plus washing pans immediately is the best way to get them clean.",
          "id": 12,
          "comments": [
            {
              "score": 7,
              "content": "Except washing hot pans can cause them to warp",
              "id": 13,
              "comments": [
                {
                  "score": 3,
                  "content": "Not if you use hot water.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "ESH. She overreacted but cleaning the pan wouldn't have made your food go cold, and you agreed to wash right away.",
      "id": 15,
      "comments": [
        {
          "score": -11,
          "content": "Your food starts to get cold the second its no longer being cooked.",
          "id": 16,
          "comments": [
            {
              "score": 5,
              "content": "Not noticeably. You're being dramatic and petty AF",
              "id": 17,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Washing a pan takes less than 2 minutes.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "NTA, though I wonder how thorough your cooking is if your food is so cold after a \"minute\" of arguing.",
      "id": 19,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NTA, if you agreed on 6 then she can wait til 6. Sounds like she’s just taking other stress out on you.",
      "id": 20,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "Nta. You don’t clean the pan when it is still hot. Of course you want to eat your food first! If she needed it that second then she could have cleaned it. This should have ended right when you said “I will clean it as soon as I finish eating.”",
      "id": 21,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA. Nobody finishes cooking their meal and stops to wash their pans before eating. You can clean what you can as you go and finish the rest after the meal, or save it all for after the meal. If she needs it so badly earlier than that, she can clean it herself.",
      "id": 22,
      "comments": [
        {
          "score": 2,
          "content": "I do. Plate your food put it in a warm oven and your dishes are so easy to clean before everything dries up",
          "id": 23,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I do, tbh... It doesn’t take more than a couple of moments.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}