{
  "post content": "It's my 40th in a month and I've been hard core watching you tube clips about this particular pellet smoker and my wife's seen a few and even commented positively about a couple of them. Now yesterday I sent her a txt with a picture of the exact brand and model that I was after and a picture of the only place in town that sells them. Also info about how's there a 2 week order time if she did want to buy one.\nSide note- if your heard of or read the book about peoples love languages.. well mine is gifts and my wife's is not.\nNow that night I get home and sit at the table talking to my wife about our days and then she brings up the grill. She thinks it's completely unreasonable for me to ask for a present that expensive. She points out that we already have a good bbq. I agree but point out the difference. One can smoke meat the other can cook meat.\nShe hasn't put any money aside for anything at all so is frustrated at me for asking for such a gift and that anything else she might get can only be disappointing from here on. I point out that I'm a pretty simple guy and only have so many hobbies and that we currently live a pretty simple life although we both work and could live more generously. The conversation comes to an end with the definite feeling that I am being an a hole for asking.\n\nAmithearsehole?\n\nEdit. $2000 Australian dollars so that's closer to $1000 American... if that's helps at all of even makes a difference. Thanks to all who have commented as well. I was reading them all out to my wife and we were laughing and nodding and shaking at all the comments haha. Thanks again.",
  "id": 1,
  "comments": [
    {
      "score": 21,
      "content": "I don't know you lost me at \"love language\" and $2,000 pellet smoker. It seems excessive.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 14,
      "content": "You can love getting gifts and have it as a *love language* but it's not supposed to be value. Love language of gifts/acts of service isn't necessarily about value but about thought. \n\n\"I bought you this pen with the nudie lady when you flip it upside down on it, because I saw it and thought you'd find it hilarious\"\n\n\"Here's flowers for no reason but I love you\" \n\nYou're NAH for asking but YWBTA if you get shitty about not getting a 2k gift.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "NAH\nEdit to change from Y T A to N A H. You're not an AH for asking but you would be if you pressed the matter. \nMentioning what your love language is makes it seem like you're trying to imply that your wife isn't willing to show you the affection you want. You may be a \"simple\" guy but $2000 is quite expensive unless you guys have previously agreed upon a budget for gifting. Maybe your wife is trying to find you something else at a more reasonable price?",
      "id": 4,
      "comments": [
        {
          "score": 3,
          "content": "I'm a simple guy, I just need this one two thousand dollar thing!",
          "id": 5,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "Seems like a pretty extravagant ask. She stated she didn't have money put aside for something that expensive and your proceeded to tell her why you should get it regardless. If you were a woman we'd see the word golddigger getting thrown around. YTA. Now she will have to make a choice between spending money she doesn't have, or feeling like she disappointed you. You are going to be 40, man. About time you grow out of making birthday requests that sound like demands.",
      "id": 6,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "Info: Are you you willing to spend $2000 for her next birthday gift?",
      "id": 7,
      "comments": [
        {
          "score": 1,
          "content": "Also INFO: What % of your monthly income as a couple do those $2000 mean? Cos for some people that may be pocket change and for others it may be huge.",
          "id": 8,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "Info: Are you you willing to spend $2000 for her next birthday gift?",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "YTA, this would not be a gift out of love, this is just giving her a shopping list.",
      "id": 10,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "ESH   I get it. It's a milestone birthday you want to memorialize it. It also sounds like you and your wife view gifts differently. Is it unfair to ask for this gift? No but it is unfair to ask for an expensive gift a month before your birthday if your monthly disposable income is less than 4K a month. It's customary to give enough lead time for an expensive gift so your spouse has time to save. Another tactic we used to take in our family is the person would get money towards an expensive gift. Leaving the burden to save on the person who wants the expensive gift. You and your wife need to communicate with each other about the ground rules for gift giving so this doesn't happen again or worse.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA for asking but that does sound expensive. I love smoking myself but I spent way less on a Bradley and I love it",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I asked my wife for a birthday present that cost another of money. \nBecause I asked for it and my wife thinks it's alot of money to spend she thinks I am an arsehole for just asking for one, she thinks I should ask for a more reasonable gift even though we are both working and have the means to buy it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post. [To learn more about the test click here](https://www.reddit.com/r/AmItheAsshole/comments/tio99u/so_we_decided_to_fuck_with_the_sub_again)*",
      "id": 13,
      "comments": [],
      "relation": "No"
    }
  ]
}