{
  "post content": "For context: I (21M) was just invited tonight to a cousin's (56 F) birthday party to take place in a restaurant at my city. She's actually my mom's cousin and that's why she is that much older.\n\nI was not originally invited because of the size of the venue, but the location changed and now I am invited to go.\n\nIt is important to notice that my cousin has this conception of \"kids\" to anyone who is younger than 30 years old aproximately, so I would be considered a kid on her party even though I do drink, dance and share with others that are not actually my age but family still.\n\nNow, I was invited to go to the party but, as my mom said, there is a little \"condition\" in case I go. It would be that \"if any other guest who is older than me comes, and does not have a seat, I must give them my seat at the table and spend the night standing\". It is important to notice that the party includes dinner, so I would have to, most likely, stand while everyone is eating and chatting.\n\nThe reason for this whole issue is that my cousin only booked for 50 seats, but will have more than 50 guests, and me being a last time guest, would have to be under those conditions.\n\nThe first thing I tols my mom when she told me that, was that I wasn't going, but she might need some help to keep an eye on my dad for some out of context circumstances related to medical issues that doesn't allow him to fluently comunicate. \n\nAfter listening to that I said that I would think about going, but that if I had to spend the night standing because of someone else wanting my seat, I would be leaving in the spot, calling a taxi and going back home without saying a word to anyone.\n\nMy mom said that it would be rude to do it, and disrespectful, and in case I'm thinking on doing that, I shouldn't go\n\nMy question is, would I be the A hole if I did that? Or should I simply not go",
  "id": 1,
  "comments": [
    {
      "score": 8484,
      "content": "NTA - Dude, don't go. It's not your fault your cousin can't count and over invited. When you extend and invite to someone and they attend, YOU are THEIR guest. Therefore etiquette demands THEY ensure YOUR comfort. \n\nIt's monumentally disrespectful to force a guest to stand against a wall with a plate of food while watching everyone else have a lovely dinner. I would personally feel so uncomfortable if I saw this situation unfold and would seriously call out the host. It's one thing to voluntarily give up your sheet, it's another to force someone to give up their seat because in your mind a younger adult is still a child.\n\nAlso, it sounds like your mom only wants you there so she can fob your dad off on you while she parties the night away.",
      "id": 2,
      "comments": [
        {
          "score": 3005,
          "content": "If she's booked 50 seats, does that imply there will only be 50 meals, so op might have to stand there watching others eat?",
          "id": 3,
          "comments": [
            {
              "score": 977,
              "content": "Exactly!! No way would I go under those circumstances!",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 205,
              "content": "Might be a buffet.",
              "id": 5,
              "comments": [
                {
                  "score": 732,
                  "content": "I would think the venue wouldn't be too pleased about this. I hope they do a head count and charge her for the extra plates.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 580,
                      "content": "Exactly this. If the party was set for 50 people, venues get pretty ticked if there’s more. They planned for 50, there’s table settings for 50. If there’s servers, they planned out how many they’d need based on 50 people. If it’s catered, they planned food for 50 people. Allowing more to come is just inconsiderate.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I'm sure they would find another chair.  But with those conditions, why go?",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "It sounds like the cousin is trying to pull a fast one. I do catering, and when it's a buffet, they think they can just keep adding people, like there is endless food. I had an event where it's was supposed to be for 30 people, but it was almost double. There was only tables and chairs and table settings for 30 people. I usually have extra, but it's just enough for my staff to eat too, i don't make double, it might be 5 extra portions. I had a discussion with the host, who was so clueless why this was an issue. I always have a contract that he signed. I had food prepped at the kitchen for the event that was booked for the next day that I had to use, and I charged the host, and made him pay cash before one thing hit the table.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "Who the hell can stand and eat their whole dinner at a restaurant? Better all be bite sized, but where do you put your extra plate and your drink…? Yikes.",
                  "id": 10,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "I can totally see if it’s a buffet that OP would have to eat after all the elders and potentially get blamed if there’s not enough food",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Former caterer here; we absolutely count the # of guests in buffet situations. There is no “not eating” or “eating less”.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I’ve only been a part of one event where the caterer and seats were from the same company and that’s because it was all from the venue, so I don’t really know the commonalities of the industry. Do clients have to have the amount of food match the number of chairs when they put in a catering order? Particularly when the catering isn’t through the venue itself? Like, could OP’s cousin order food for 75 from the caterers even if she only asked for 50 chairs from the venue or rental company?",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Might be that they expect lots of no-shows. Unpopular people of that age rely on family to fill the seats.  That's when you know ~~you~~ they failed at human connection.",
                  "id": 14,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 96,
              "content": "And if it's not 50 meals, that means the kitchen is going to have a bunch more orders than expected all coming in at the same time and it'll end with them being slammed and everyone's food being delayed. Not to mention the poor wait staff trying to keep up with the extra numbers.",
              "id": 15,
              "comments": [
                {
                  "score": 64,
                  "content": "And the poor waitstaff trying to keep up with people playing musical chairs.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 9,
                      "content": "My family gatherings are buffet-style, serve yourself, for exactly this reason. Nobody wants to stay where they've been sitting. Well, that, and we're not exactly rich.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Last time I went to an event like this, my chicken was raw because they were slammed. Personally, I would skip.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Oh God, that's awful",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "That was the impression I got too. Mom wants you to stay and babysit dad, SHE should buy you a meal and arrange for you to have a seat by dad....or you leave.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "If OP has to give up their seat and meal...does thar mean they get a refund on the Edit: bday gift*\n\nUsually my the rule of thumb is the wedding gift should be valued enough  to cover the meal cost, plus how close you are to the bride/groom.\n (OP wasnt originally invited...I guess $0 plus $0)",
              "id": 21,
              "comments": [
                {
                  "score": 9,
                  "content": "It’s a birthday.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 5,
                      "content": "ROFL. Oops...my mind automatically went to the most \"important party\", cause this drama...for a bday party.\nOr maybe  I've been reading to many wedding posts on AITA.\n\nNow it's even more ridiculous.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "I should definitely get a refund for the wedding I went to where they ran out of food and finally fed us KFC five minutes before the cake was cut. That marriage didn't last a year fwiw",
                  "id": 24,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "My mind also boggles at a 56 year old who has a birthday party with over 50 people.",
              "id": 25,
              "comments": [
                {
                  "score": 7,
                  "content": "For my 50th Birthday, 76 people showed-up!😳😊( My sister and best friend said they invited a total of 62 people -which included them and myself. A few people brought a \"guest\" and some last minute \"from out of town\" guests found out about it and asked if they could come too). It was a blast and the \"Bar/Grill\" loved it, as the place was reserved by us exclusively for the party and everyone ordered a Lot of drinks and quite a bit of food and tipped very well (thank God!) and the \"extra\"14 people, helped make the Bar have a fantastic night of money making! With all.that said, the poi t being, that for a \"Milestone Birthday\", it *isn't* that surprising that someone a bit *older* would have  a larger Birthday party. (Though it was and will be the last one I ever have of that size again!)",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I remember attending a \"business dinner\" once where around 100 guests responded they would attend, but the host only asked for catering for 80. She was banking on people declining. It was a terrible night for everyone as the food wasn't great and there also weren't enough plates!",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Good observation.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 196,
          "content": "Yeah, I’d decline to go entirely. Honestly, if I hosted a big party like that and miscalculated, I’d be the one standing.\n\nYou could offer to watch your dad at home or be available to pick him up. But your mom seems to be using you a bit, no offense. With issues like that, a party may not be the best place for him.",
          "id": 29,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "Reading between the lines I actually think that what may have happened here is cousin didn't invite OP, OP's mom *asked* cousin to invite OP *because* she wanted help with her husband, cousin agreed under duress with conditions, mom tried to keep that from OP. Could be wrong, but it makes way more sense than cousin inviting OP despite thinking she might not have room. Clearly she *can* count, because she's the one who set the condition.",
          "id": 30,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "Bet you OP wasn’t really invited just added in at the last minute cause their mom needed assistance with their dad. \n\nAlso OP is you see this anyone that invites more people then the venue has capacity for are royal AHs.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "This!! I would just not go!!\n\nEdit - NTA",
          "id": 32,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Cousin can obviously count, which is why they told mom that OP might have to stand.  It's completely disrespectful to do that as a host. It seems like maybe mom spoke with cousin to see if OP could come because of the dad issues and cousin doesn't really care if OP is there or not.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "So if someone who was 25 shows up, will he have to give up his seat. Nope, I wouldn't go.",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "[removed]",
          "id": 35,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "preach it!!!!!!",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "No one is taking my sheet!",
          "id": 37,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1527,
      "content": "NTA. \n\nThey can't invite you to a party last minute and then expect you to give up your seat for the ENTIRE night. You're not the host. It's not your duty or obligation to ensure everyone's comfort. If the hosts are expecting more than 50 guests, they should book more than 50 seats.",
      "id": 38,
      "comments": [
        {
          "score": 297,
          "content": "Something tells me that not everyone invited will show up.  They're not just tacky, they're disliked.",
          "id": 39,
          "comments": [
            {
              "score": 47,
              "content": "Who are disliked? The hosts?",
              "id": 40,
              "comments": [
                {
                  "score": 197,
                  "content": "Yes.  They invited many more people than they could accommodate, knowing full well that most wouldn't show up.  They're both tacky and disliked.  That's pretty sad.  And OP is only called in to be a carer for his dad?  Triple ouch.  Who wants to be at that party?\n\nEdit: Telling people they'd have to stand?  Stand where?  What sort of bullshit is that? The birthday person is in their 50s and they want an audience?",
                  "id": 41,
                  "comments": [
                    {
                      "score": 70,
                      "content": "ROFL, I've never heard of anyone doing this.\nThat sounds like the idiotic airlines that oversell tickets because they expect people to not show up.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "You're probably right. Maybe the reason they even invited extra people was so that they could feel good that \"everyone\" came and all seats were occupied.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "Yeah this is a hugely tacky way to feel like you have people at your birthday: Just actually invite the “B-list” but make them stand in case many of the “A-list” actually show up.  Incredibly entitled, and lacking respect for guests.  The cousin is on a huge power trip with a very fragile ego.",
              "id": 44,
              "comments": [
                {
                  "score": 6,
                  "content": "I don’t think the cousin invited him at all. I think the mother pressed the cousin because she wants OP to babysit the dad.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh!  This is very much a possibility",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Is someone there decreeing who may sit and who must stand?",
                  "id": 47,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "You're onto something. Cousin is counting on people like OP to back out without them losing face. She can claim to have invited them and they opted out, so it is not on her. Of course, few people get into the logistics of her rude conditions and why OP and others wouldn't care for those. Also, she gets to bitch about 'kids these days not respecting their elders' when she re-tells this story.\n\nNTA if OP skips this one. Either OP is treated as a proper guest with seating and food, or mom can make other arrangements to care for dad, or mom and dad can skip the event since their care-provider/son is not being accommodated for the event.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "It would be slightly more in AH territory--but not much--to go and dramatically leave.  Drop the rope, let it go.  Save everyone including OP the hassle.",
          "id": 49,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 639,
      "content": "NTA.  Don’t go at all.  Those are ridiculous conditions that you have to agree to.",
      "id": 50,
      "comments": [
        {
          "score": 45,
          "content": "Exactly. NTA.",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -5,
          "content": "The question is whether he's TAH if he goes and leaves.  I think the answer to that is yes.  That's why he should not go unless he he can guarantee he won't be humiliated by made to stand.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 422,
      "content": "NTA It's rude to have these conditions. You would be reacting to rudeness.\n\nThe only reason I would go would be to help out with your dad -- but in those circumstances I would have the cousin make you an exception to the \"give up your seat\" rule as you'd be there to aid your father. If your cousin can't agree to that, don't go as your cousin would be being doubly rude. Then if you get any flak for not going you could straight up tell people that you were going to go to help your dad but your cousin wouldn't agree to guaranteeing you a seat beside your dad to allow you to do that. Let the blowback fall on your cousin where it belongs.",
      "id": 53,
      "comments": [
        {
          "score": 98,
          "content": "Exactly this. If you are meant to be your dad’s unpaid carer and also not be able to sit beside him, that is bullshit. \n\nEither you’re his carer so you need to be guaranteed a sit beside him to most effectively care for him, or you’re not and you do t have to go.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "I don’t understand why OP’s mom isn’t just offering her seat if she’s the one asking OP to go to help her out. To me that’s the obvious solution here, and if I were asking someone to come to an event to help me out and I knew there might not be a seat for that person, I would immediately be saying “you can have my seat.”",
          "id": 55,
          "comments": [
            {
              "score": 7,
              "content": "To be fair, OP's mother said that if OP showed up and then left not telling anyone, that would be rude and they should just not show up. It's just out of this word, dimension and whatever ruder to make your guests stand while others are having nice dinner party.\n\nOP should listen to the mom and not show up.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 225,
      "content": "NTA\n\nIf you are invited as family, you are expected to have a seat at the table",
      "id": 57,
      "comments": [
        {
          "score": 106,
          "content": "Sounds like mom wants him to act as unpaid help and not the family he is. She can't have it both ways.Also seems like mom wants to look more affluent than she is - if 50 guests is what you can afford, you only invite 50 people. NTA, don't go.",
          "id": 58,
          "comments": [
            {
              "score": 39,
              "content": "It’s not mom’s party, she is also a guest",
              "id": 59,
              "comments": [
                {
                  "score": 24,
                  "content": "Oh, gosh, then I REALLY wouldn't go.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 156,
      "content": "nta. it is rude (disrespectful, even) to expect you to stand while others sit, and given this condition i think it’s fair to view this invitation as insincere and just not go. mom can ask a guest who is not expected to stand all night to help her keep an eye on dad, or they, too, can stay home. keep in mind it’s better not to go than leave in the middle.\n\neta: if anyone asks you about it just say you were told there wasn’t a seat for you.",
      "id": 61,
      "comments": [
        {
          "score": 30,
          "content": "I would very loudly say “ I was invited but our host didn’t make accommodations for me to sit and be comfortable, like the rest of the guests “",
          "id": 62,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 106,
      "content": "NTA. She booked for 50 people, invited more than 50 people. You won't just be standing there, you won't have any food.\nEither she implements a first come first served principle, or she cuts back on the guests.\n\nMy advice, just don't go. If your mom needs help with our dad, your mom needs to make it clear to her cousin you guys are a package deal, you all sit or none of you will attend.",
      "id": 63,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 92,
      "content": "NTA\n\nShouldn't the host give up their seat in that situation?\n\nDoes your aunt-cousin have any etiquette at all? I swear these older people need to learn some manners.\n\nJust don't go.",
      "id": 64,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 71,
      "content": "NTA. If I were in your place, I wouldn't go. This scenario sounds like you are kind of tolerated to be there, but are definitely less than a person. As soon as a \"true\" guest wants your seat, you need to relinquish your comfort immediately, because clearly your needs are not important.\n\nNope. I'd have more self-worth and dignity than those people have basic human decency. Do whatever feels right, OP, but this devaluing setup does not feel right to me.\n\nYou know the saying \"You teach people how to treat you\"? If you go along with this bullsh\\*, you are teaching your family that it is ok to treat you like that. They will learn this lesson and do it again.",
      "id": 65,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 57,
      "content": "Surely the restaurant would not allow a customer to stand and eat?\n\nIf there are 50 guests, I assume the cousin has booked the whole venue?",
      "id": 66,
      "comments": [
        {
          "score": 44,
          "content": "This.\n\nWhat's the format of this party?\n\nLike is it a sit down dinner? - then don't go.\n\nIf it's a whole booked venue with some sort of buffet set up and people are up and down, mingling, getting food, getting drinks and dancing & there are 53 invitees with 50 chairs dotted around, then don't be an idiot, go and enjoy yourself.",
          "id": 67,
          "comments": [
            {
              "score": 2,
              "content": "It sounds like a building that can be rented when not being used. The local VFW and UAW building where I live can be rented for parties. It's just one big room. You get long fold up tables and metal chairs for an hour or two. Then you have a buffet style caterer set up for food but buy quantity instead of single plates. There's also hotels with banquet halls that have the same deal.",
              "id": 68,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -5,
              "content": "I cannot believe it took me this long to find this comment. \n\nOf course some people won’t show up. \n\nAnd honestly the victim complex on here is pretty astounding- you are of sound body and have the vigour of youth yes? \n\nIt’s one thing if it is STRICTLY a sit down dinner, but speaking as a person who has worked service for a decade- no party of fifty people sits down in their spots and doesn’t get up and mingle and walk around and stuff. Doesn’t happen.\n\nI have to assume there will be older folks, some of whom may be less mobile, etc etc, stop acting like an entitled little shit and be willing to give up your spot if needed, Jesus like are you really not gonna survive if you have to stand a bit? Are you getting your food and drinks paid for? Have a little respect for your elders. \n\nIf you don’t want to go don’t go but if this is the hill you want to die on yes, yta.",
              "id": 69,
              "comments": [
                {
                  "score": 3,
                  "content": "Nah, even if it's a buffet the host needs to provide enough seating to allow all guests to sit down and eat simultaneously should they choose to do so. It's incredibly disrespectful to say \"at first I didn't want you to come, but now I do provided you're willing to hover around waiting for someone else to get up and move so you can sit down while you eat - which also means you're getting nowhere near the food until the guests I actually wanted have picked it clean, unless you want to eat while leaning against a wall with nobody to talk to (unless there are other filler guests in the same position)\". \n\nBirthday girl sounds like she cares a lot more about having a full room than about who actually fills it. OP is NTA for not wanting to be a background artist drafted in to complete her mental image of what the party should look like.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I'm starting to wonder if the people commanded to stand are allowed to eat at all.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -9,
          "content": "Restaurants add seats to tables all the time. Help your mother with your father. Get over it.",
          "id": 72,
          "comments": [
            {
              "score": 8,
              "content": "If this were a situation where a seat could be added at any time, why would they be expected to give up a seat for a different guest? Why not just have the restaurant bring another seat for the new guest? Doesn’t change the disrespectful expectations for how OP should handle the night, once again, as a guest.",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}