{
  "post content": "\n\nhey guys! So, a bit of context I (M32) have been with my wife (F30) for 3 years. she comes from a country where women get to keep their maiden name after marriage which was fine with me though as someone who comes from the south my family pushed for my wife to take my last name but she ended up keeping hers which made my family somewhat unhappy saying it was disrespectful of her to keep her maiden name but thankfully they got over it and things got better and we reconciled later.\n\n\nnow this \"last name\" issue has been brought up again when my wife and I found out we were expecting a baby boy.\nI sat with my wife down and told her that my son is going to get my last name and explained so that there's no confusion but she disagreed and said no and came up with a compromise which was that our son gets both our last names but I declined explaining how awkward and confusing and just complicated that would be. not too mention the middle name so that would be a long name but she said I should consider since my last name will still be there but I said no and told her we'll just have to go with what most families here do and is going by the father's last name. she threw a fit calling me selfish and accused me of treating her as if she as a mother gets less or no say but I reminded her that she got to keep her maiden name and so we're even. she then argued that I was mixing two things that are unrelated and was holding the fact she got to keep her maiden over her head though it was her right to do that same with deciding what surname our son will have. I said I was sorry but I can not accept this compromise especially with how my family will react and told her she should just go with the flow and agree on my son having my last name. she got upset and refused to talk to me after that calling me selfish and a dictator and a \"minion\" for my family even though I'm just looking out for our son's best intetest and keeping them in mind.\n\nI just think she's being deliberately stubborn here. but I'm not sure. Aita?\n\n\nEDIT Jesus, whoah guys..there is just way too many responses here man and I won't be able to respond to all of them BUT I've got a couple of things to say and I'm adding them here for everyone to see.\n\n\nONE - Just to be perfectly clear here I did NOT have an issue with my wife keeping her last name. in fact I encouraged her to stick to it after my family started giving us grief about it.\n\nAnd TWO - The main reason I was initially against using both names is the fact that our son might end up having a very long name as a full name.that's it. I have nothing against my wife's last name. I respect it I respect her family (they seem sane and levelheaded) and I appreciate them a lot. but as two blended families with two different backgrounds we kinda...we tend to disagree sometimes.",
  "id": 1,
  "comments": [
    {
      "score": 38342,
      "content": "> I sat with my wife down and told her that my son is going to get my last name \n\nThat's as far as one has to read to decide YTA. The rest of it just makes it worse.",
      "id": 2,
      "comments": [
        {
          "score": 13496,
          "content": "YTA, the decision has to be mutual. It seems unilateral and it doesn't reflect your mutual wants and needs. It reads as you decided for both of you – you set a fact and she has to comply. You think you can veto her because you're a man.\n\nShe didn't have to change her surname to yours and it doesn't mean that she has to name her kids after you. You didn't do her a favor by allowing her to keep her last name. She would have done that regardless of your objection and thoughts on the matter, and even in spite of them.\n\nIt sounds surreal at this point. Your wife sounds agitated and you have to think if this is a hill you want to die on. It's more than a simple dissent, it can lead to a major argument if it's not addressed properly.\n\n>she threw a fit calling me selfish and accused me of treating her as if she as a mother gets less or no say but I reminded her that she got to keep her maiden name and so we're even.\n\nIt speaks for itself at this point. Someone disagreeing with you doesn't mean that they throw a fit. You're victimizing yourself. You're the calm and logical side of this equation and she's unreasonable, crude and overstepping boundaries.",
          "id": 3,
          "comments": [
            {
              "score": 8541,
              "content": "I find it interesting how he uses language that paints himself as sensible, logical and \"the decision maker\". But speaks about her as if she's unstable and ridiculous.\n\nHe's the worst and she can do better.",
              "id": 4,
              "comments": [
                {
                  "score": 6205,
                  "content": "Can we also talk about the fact that, realistically, he has NO power in this situation? Mom decides who is in the delivery room, and who has access to the birth certificate when it is being filled out. \n\nShe gets to decide at the end of the day, and if this pisses her off so much that he isn't allowed in the hospital while she gives birth, than he will lose any say in the name whatsoever (and honestly, I kinda hope she does that at this point). She is able to tell hospital staff to not to let him near her and that she is the only one who can fill out the birth certificate, and they will follow her request.\n\nGo apologize and actually try to discuss/negotiate with your wife. This is not something you go tit-for-tat with. Her name has nothing to do with your son's. Either you both agree on this, or she gets to decide on her own. You need to get that through your head... and please for the love of god get off your pretentious high horse, because the \"better than thou\" attitude towards her was dripping from this entire post.\n\nYTA",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2348,
                      "content": "Yeah. If she realizes that this guy is a controlling asshole and leaves, there’s a chance that he’s not even gonna know until the kid has been born and the birth certificate has been filed. She could just give the kid only her last name at that point.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "She should insist the child has her name only.\n\nWhen he carries a pregnancy to term and births a child then he can insist. Till then he can shut the hell up.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "This is the best part imo. He can “decide” all he likes and he’s still at her mercy. Literally nothing her can do except place nice and hope she compromises. I hope his wife realizes this and lays down the law. \n\nYTA OP. In case you needed one more vote in that direction to help you understand the scale of your assholery.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "100%! I would kick him out of the delivery room and not even let him sign the birth certificate if i saw this post or heard those words coming out of his mouth!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "He doesn't even get access to the hospital at all if she decides she doesn't want him there.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "She even came up with a compromise. If OP doesn't like the compromise he should come up with something himself instead of shooting her wishes down without second thought.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Right! When my husband and I were coming up with names for our children, he kept saying \"I don't know, I have to let it marinate\". I then reminded him that the hospital only NEEDS my signature on the paperwork, so get on board or I'll choose 🤣. We agreed on names after that. This happened each time we had a child. The hospital still only asked me and had me approve everything. \n\nI say all that to say, YTA. You're her partner, not her master. You get no say, zero say, not a dang bit of say in what she legally calls herself and quite frankly, you don't have the final word on what y'all's child is named. \n\nI suggest some counseling for both of you to get on the same page as well as an apology to her from you for treating her like she was/is less than you.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3317,
                  "content": "He's the second person I've seen on this sub in recent days under the impression that as long as you're being calm - you sit someone down to explain, you calmly explain, you use logic with your nice, inside voice - you can't possibly be an asshole! Assholes are the ones who yell and scream and throw things! \n\nLet me calmly explain something:\n\nYou can be calm, and still be an asshole. You can sit someone down and explain your unilateral decision, and calmly veto their proposed compromise, and still be an asshole. You can be quiet and rational and level-headed, and still be an asshole. These things aren't mutually exclusive. On the flipside, there are cases where the person raising their voice is totally justified in doing so, because something you said or did was shitty and it would be next to impossible to keep a level head in that situation. The tone of your voice, the delivery of your message, they can matter in many conflicts, but those things alone do not determine whether you're the asshole.\n\nHope that helps!",
                  "id": 13,
                  "comments": [
                    {
                      "score": 955,
                      "content": ">You can be calm, and still be an asshole.\n\nGaslighting 101 actually.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 298,
                      "content": "I hope you don't mind I save this as a screenshot because God damn do so many abusive men do this. Emotion doesn't make your point less valid, and lack of emotion doesn't validate it. You can be nice, but not kind, and kind, but not nice. 🤷🏻‍♀️",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 57,
                      "content": "This needs to be a PSA for anyone posting on this sub!",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "If anything it made him more of an asshole since he’s definitely gonna spin this to people saying “NO but I was calm and loving while she was screaming” If anything telling someone calmly how they have no power and it’s your way or the highway is manipulating them into thinking they have to agree because you’ve been so considerate by not yelling",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Can we get this pinned at the top of the sub?",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "You need many more awards for this. Signed, a person who yelled at someone after they deeply insulted me multiple times and yet is now “the bad guy” for raising my voice.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "From a lyric:\n\"An angry man is man with principals; an angry woman, she's just hysterical.\"\n\n. \n\nEdit: YTA. Lots of people got long names so that's not a problem. But if that's your worry, then skip the middle name. A middle name to me is very unnecessary nowadays anyway.",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Definitely. And if you're calmly being the asshole it makes perfect sense for the other person to start getting upset you're being like this and not budging.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 808,
                  "content": "Maybe I'm getting too tin-foil-hatty but I think wife/her family is Hispanic and he's just engaging in some good old-fashioned racial stereotyping. The standard of women keeping their last names/children having both parents' last names combined with the fact that he called the wife's family \"seemingly sane and level-headed\" really just gave off the whole \"fiery Latin people be crazy\" vibe to me.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 437,
                      "content": "As someone who is Hispanic and whose white in-laws tried to pull this same exact thing (husband sets them straight, it’s fine), this is exactly what I think is happening.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 313,
                      "content": "Huum… I saw it as his Southern family is NOT sane & level-headed… based on the information that they thought it was THEIR business to decide HER last name. As a Texan… sanity is not in big supply in Southern families, but the lack of sanity just isn’t that unusual so it seems NORMAL.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 155,
                      "content": "Yeah, that's what I thought too. And yes, Hispanic names can run long, but so what? Hundreds of millions of people have names in that tradition and they do just fine.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I 100% assumed he 90 day fianced her, fully lied about what to expect in the US, lied about basically all of the things the losers on that show try to brag about and bring a woman who left her family to live in a tin can in a trailer park while promising them ritzy Manhattan (or whatever their closest metropolitan city is) accommodations.  Zero chance this dude has even tried to learn her native language and looks down on her as lesser than.\n\nDollars to donuts this dude is going to ban his wife from speaking Spanish to their child.\n\nOP is a huge AH",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Yes, that's where I went, too.  Ugh.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "That's where my brain went, too.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 455,
                  "content": ">He's the worst and she can do better.\n\nEven if she really was unstable, she would still deserve better than a misogynistic control freak.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 380,
                      "content": "Being around a misogynist control freak can also be a major *cause* of being unstable.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "So many red flags with this, it’s crazy. I love how he says she “got” to keep her last name as if he was some benevolent lord who “allowed” her the absolutely crazy decision to determine her own name and identity. She can have whatever name she damn well pleases without his permission or approval. It’s also very unhealthy to be keeping score in a marriage (“so we’re even”). She should make sure she puts a hyphenated name on that birth certificate. That said, if I were her, and my husband “sat me down” to tell me what we are naming the child I am carrying and going to birth, I would be gone so fast he’d only have to worry about his own name and signing it on the divorce papers.\n\nOP is the biggest asshole.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 29,
                      "content": "Yeah the whole “MY son” is going to get “MY last name…” was enough. Even if he’d said “our son” I might have let it be. But instead, YTA",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Misogynistic, xenophobic control freak.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 243,
                  "content": "My controlling, cheating ex-husband used to paint himself as sensible and logical and the decision maker. Turns out it's massive male insecurity, men can't handle the idea of women being on the same footing, and so they do what they can to undermine and control them.\n\nMy ex also insisted that I change my last name because he bought me a ring and my giving up my name was MY price. \n\nOP I hope you can understand how fucked up that is, what my ex said! And if you can see that, then I hope you understand that you saying you LET your wife keep a part of her identity is just as fucked up. \n\nYTA.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Yup, both my niece and nephew have a first name, 2 middle names, and both parents’ last names hyphenated. It’s actually becoming the norm to do this",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 132,
                  "content": "It's hilarious to me that he thinks of himself as logical, because is argument is just that four names is too many words. What's wrong OP, you can remember three words in a row but not four? Four is too many words? Anyone who can do basic math can remember four words in sequence.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Yeah don’t tell him I’ve got five! He’s totally gonna freak out 🙄",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Hopping on to this comment to totally agree. It's only one more word, ffs!\n\nIn reality, out in the normal wider world; nobody is going to address his child using the middle name. \n\nIt would be, for example:\n\nMr Jack Rhys-Jones.\n\nNot:\n\nMr Jack David Rhys-Jones.\n\nAnd, it's actually pretty common for people to hyphenate two family names. \n\nOP sounds like the hysterical one who's throwing a fit here, not his wife!\n\nOP needs to live in the real world, and wise up. His wife is doing all the really hard work by going through 40 weeks of pregnancy, and the pain of labour and childbirth. \n\nGiven how sexist and controlling OP sounds; I suspect that she will also end up doing the vast majority of the childcare, housework, cooking and probably going to work as well, while OP insists that he needs to sit down and relax after work because he has a \"proper\" job.\n\nI feel like even if you only take into account that OP's wife is also this child's parent, along with the difficulty of pregnancy and birth; he is absolutely insane if he thinks that he can lay down the law to her about this.\n\nHonestly, I kind of hope that she leaves him now!",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "It's because none of his arguments are logical.  None of them are based in reason or rationality or logic - they're all emotional.\n\nBut they're emotional stated in a calm voice, which is something that some people (usually men) mistake for being factual/logical/reasonable, even when it isn't. It reinforces their stereotype that men are logical/women are emotional, when in fact (often) both are emotional as hell, just one side doesn't get heard until they raise their voice.\n\nTo the OP, YTA.  So, so much the AH.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Yeah that is one thing that really pisses me off when someone posts here and so obviously is trying to make themselves look better. OP didn't even do a very good job of it. It is, frankly, insulting that he thinks we are stupid enough to buy into his bullshit.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Also keeps talking about how she/ women where she’s from “get to keep” their maiden name. Like how generous",
                  "id": 41,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "Yep. OP needs to ask himself how he would react if his wife \"sat him down and told him\" what was going to happen. Would he accept that? I doubt it. So why should she?     \n\nBTW, I'm British and have a first name, a middle name and a double barrelled surname, with two last names. Not my parents but going back several generations. What's the problem? I like my name.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 12,
                      "content": "In my head, your surname is now Cholmondeley-Worcestershire. I hope you like it.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2283,
              "content": "[deleted]",
              "id": 44,
              "comments": [
                {
                  "score": 1673,
                  "content": "I like how he kept saying that she “got to keep” her last name. As if she needed permission and he graciously allowed it.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 584,
                      "content": "I'm assuming he \"got to keep\" his last name when they married. So they're \"even\" if he didn't take her name.\n\nI had a ridiculously long name due to the stereotypical southern double first name and the two last names. Aside from being a complete pain in the ass to learn to spell all of it and fill out my name on scantron type tests as a kid, it hasn't really affected it me. When I got married the first time, I opted to take my then husband's name, as it was shorter and easier for people to spell. Kind of wished I'd stuck with the long one I was born with after discovering having an apostrophe is worse because you never know when you'll run into a poorly escaped form.",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "Exactly this! Like a favor or something.\nWhere I am  (southern Europe) we always keep our name (nor called maiden name because it is just your name) and now kids sometimes get their mother's name first.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "this. it was obvious he was TA at: \n\n\"she comes from a country where women get to keep their maiden name...\"\n\n1) the US **is** one of those countries, wtf\n\n2) when can we as a society stop labeling a woman's birth name with an adjective that suggests it's contingent on virginity?\n\n3) if OP's main problem with 2 names is that it's \"awkward and confusing,\" rather than \"sexism!\" then give the kid only the mom's name.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Exactly! Was there at any point any discussion that he would ‘have’ to take *her* last name? No? Then he ‘got to keep’ his last name as much as she kept hers, so that was a moot point to begin with.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "But they’re “even” /s\n\nToo bad she’s having a kid with this guy.",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1561,
              "content": "But, but, but... OP *allowed* his wife to keep her maiden name.  So they're even now!",
              "id": 51,
              "comments": [
                {
                  "score": 704,
                  "content": ">But, but, but... OP allowed his wife to keep her maiden name.  So they're even now!\n\nHey, technically, they were even at the time of the marriage : OP kept his name, OP's wife kept her name. Perfectly even.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 259,
                      "content": "This is exactly what I came to say. They BOTH did what they wanted with their own personal last names after marriage. THAT'S when they were even. It's not like if the wife changed her last name now, then she'd have sole naming rights over the kid's last name!",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "This is valid.  Love it for them.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "and for OP who is going in his head but women take their husband's names, not the other way.\n\nSure, in most western cultures, that's the norm. But someone who used to work at my company took his wife's name when they got married. It was important to her and his family so that's what he did.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Uh oh… I (F) kept my name and my husband (M) took it, too.  So… did he “let” me keep mine or did I “let” him use it?  Unsure who owes whom now, and also unclear on exactly how many cows this transaction was worth.  Please advise.\n\nETA:  /s, in case it wasn’t clear!  This dude is ridiculous.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "The updates to this are even worse. He can't see the issue here and is entitled to what only he wants and how he wants it. \n\nYta OP.",
                  "id": 57,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1420,
              "content": "Also no, you were already even: YOU got to keep your own last name. \nShe never asked you to change YOUR name to hers, and never held it over your head that she \"let\" you keep your own name (and its link to identity, family etc).\n\nSee how silly that sounds? \n\nGiven the kid both names IS being even. You giving the kid only YOUR name is not even nor equal. Just because it is culturally accepted doesn't mean it's just or fair.",
              "id": 58,
              "comments": [
                {
                  "score": 447,
                  "content": "They still weren't even, she had to deal with his family being butthurt about her maintaining her identity and culture. Lord it makes me so angry.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Oof, yes. And the fact that they family found her disrespectful for it? The close-minded stubbornness is being shouted from the rooftops and—considering OP is still afraid of his family’s response to his son having a hyphenated name—he doesn’t even see it as a problem.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "But that’s not how they do it in sensible logic land! These ‘crazy’ cultures where women get a voice about their own names and their children really need to get with the program /s.",
                  "id": 61,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "I just want to reiterate that him taking her name WAS an option.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 605,
              "content": "So she “got” to keep her name and as punishment she doesn’t get to give her child her name? That sounds very much like someone who is mad that she didn’t change her name, despite his disingenuous edits.",
              "id": 63,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 439,
              "content": "Have you SEEN his edit ? He's trying to say he encouraged her to keep her last name but is also using it as points against her with their child's last name. \n\nEither he resents her for keeping her last name, which means he lied about it in the post and to her.\n\nOr\n\nHe encouraged her to keep her last name, like he said, but wants to use any excuse he can think of to strong-arm her into his decision. \n\nHe can't have it both ways. \n\nOP YTA and yall should've had this conversation before deciding to have a kid, especially knowing her keeping her last name was important to her. Why is your culture more important than hers when the child comes from both ?",
              "id": 64,
              "comments": [
                {
                  "score": 21,
                  "content": "You said EXACTLY what I was thinking, so here: have a reward.\n\nAlso, OP: major ass. You say one thing, do another. In some cultures having 2 last names is very normal. In some cultures, having long names is very normal. Even if it hadn't been, you are trying to force someone into agreeing with your decision. What if the roles had been reversed and she would try to force her last name onto you/your child? Would you not be \"throwing a fit\"? You basically already are simply because she won't roll over and let you have this. Instead, she tries to compromise, as many women tend to do. If I were her, and you kept up what you were doing, I would quit compromising and just name the kid whatever I wanted. Because if you don't want to compromise, why should she?\nAt the end of the day, she is carrying your kid. You don't have to walk around with a big belly and give up on certain things to keep your kid safe, she does. And even if she didn't have to: you're both in this relationship. You should be equals, yet here you are behaving like your say is more important and valid than hers.\n\nIf I were you, I'd think long and hard about your next actions, because if I were your wife, I would see your controlling and manipulative behaviour as abusive and toxic and would consider leaving you, as the likelihood is that it will only go down hill from this point out.\n\nYTA, OP. You and your family. Your family shouldn't have any say in this, because it's not their marriage or their child. It is that of your wife, so she's the one who should have a say. If you can't see that, if you can't love her enough to treat her as your equal, then do her and your child a favour and tell her straight up, so she can decide for herself if that's the type of relationship she wants to be in.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "He seems to have more of an issue with what his family will think rather than just focusing on what his wife and him want and think.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 145,
              "content": "She \"got to\" keep her maiden name, which is her culture, what a prince.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "She \"got to\" keep her last name really irks me. She didn't really get anything by keeping her last name. she just didn't have to give up her whole identity in order to marry him.. and yet he thinks this is a wonderful give he was gracious enough to give her.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "If the two parents can't come to a mutual agreement and someone has to trump the other, the person gestating and delivering the baby beats a cultural norm.",
              "id": 69,
              "comments": [
                {
                  "score": 7,
                  "content": "Especially because it's a norm is *her* culture.  OP is being horrendous.",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "YTA and your wife should only put her surname down, you getting to have your name there was you being even not you removing hers. \n\nAlso how are you “even” her keeping her own name was not a thin you conceded on, it was her own autonomy, and her giving her son her name as well is not something you get to bargain on or demand that she adhere to your standards on. As someone who had a hyphenated last name sure it was a thing that confused some systems sometimes but it was also not that big a deal and it’s part of who I am. If anything it will be good your son doesn’t have a boring name that blends. Also who tf cares about name size?",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2937,
          "content": ">where women get to keep their maiden name \n\nThat was good, but  THIS is where he bites it for me: \"...where women ***get*** to keep their maiden name ...\"\n\n YTA, OP. Misogynistic Massive AH.",
          "id": 72,
          "comments": [
            {
              "score": 1054,
              "content": "> but I declined explaining how awkward and confusing and just complicated that would be\n\nAnd this, my sister's kids last names are hyphenated. It's not that confusing and fairly common here.",
              "id": 73,
              "comments": [
                {
                  "score": 449,
                  "content": "here in my country I would dare to say that literally EVERYONE has two last names and no ones complains about it being complicated lol myself I have first + middle and two last names from both my parents",
                  "id": 74,
                  "comments": [
                    {
                      "score": 279,
                      "content": "I was about to say my ex was Latino and he had 4 names as they keep the mothers and fathers name to honor both parents equally. I honestly thought that was amazing and would have totally followed that tradition if we had stayed together",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Lol. I was thinking how I have two middle names and it really isn’t a big deal. The last time it was in any way an issue was when I had to decide what three initials I could choose to have Tumi stitch onto my backpack tag since it maxed out at 3. I just skipped my last initial and did my first 3. Lol. Literally the most minor of problems.",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "That is a whole other component that ticked me off. Him and his family really tried to make her shun her culture.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I have a question. When 2 people with 2 hyphenated surnames marry do their kids have 4 surnames? Or do you drop some and if so how do you decide what to drop? If you decide to keep the grandfathers and drop the grandmothers its pretty much the same only one generation removed.",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Same in Chile! You always have TWO last names, and if only one parent signs the birth certificate, you have that parent’s last name twice. Usually here the people has two names (sometimes more) and two last names.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 840,
              "content": "In addition, he mentions he’s “from the south”, which likely means he’s from the USA; you know, a country where women “get” to keep their maiden names if they wish.\n\nI guess it’s hard to see when OP’s head is so far up his ass that “allowing” her to keep her identity doesn’t make them even, but yea - vote for YTA.",
              "id": 80,
              "comments": [
                {
                  "score": 259,
                  "content": "Hyphenated surnames is more of a Latino thing. OP is probably from the South of US and white. He probably mentions it as a way to say , I am not racist, I married a latina.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 116,
                      "content": "I just chuckled out loud - you’re so right. I was reading this out loud to my husband (who “got” to keep his name after the wedding) and thought this exact sentiment was very Ellis island of him. \n\nBetter keep those last names short and simple so I can fit in with my neighbors. /s SMH\n\nEdited to add /s",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "British person with hyphenated last name here. Many rather posh and upper class people here have hyphenated last names. Jacob Rees-Mogg for example.",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Or she's from Quebec where women keep their name by law. If you want your husband's name you have to fill out paperwork post-wedding.",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "You can also keep your given name or hyphenate in the Netherlands. I just got married and would have to fill out paperwork to have my name changed to my husband’s, and since that was never my plan, I’m keeping my given name for the time being. I might hyphenate in the future, but I haven’t made a decision yet.",
                      "id": 85,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 334,
              "content": "Fun fact! I am from the same country as OP and also “get” to keep my maiden name when I get married next year! What a jerk.",
              "id": 86,
              "comments": [
                {
                  "score": 119,
                  "content": "Fun fact - I’m from the US “south” just like the OP…and women “get” to keep their maiden names here too! Who’da thunk?",
                  "id": 87,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Also from the South, and I hyphenated when I married. A couple of family members asked about it, and I told them to pound sand.",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 25,
                  "content": "I'm from that same country. \"Getting\" to keep my name is going to be a requirement for me when I get married.\n\nMy last name starts with the letter \"A\". No way I'm giving that up!",
                  "id": 89,
                  "comments": [
                    {
                      "score": 12,
                      "content": "As someone with a last name from the butt end of the alphabet, I support this choice",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "My two last names were definitely the cause of all the difficulties I’ve had in life. /s",
                  "id": 91,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Seriously I'm debating on keeping my maiden name just for vanity reasons, and my bf is cool with that. A possible compromise is make the babies middle name the mom's maiden name, but that practice isn't common outside of specific cultures.",
                  "id": 92,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 130,
              "content": "That was literally the moment I knew how the rest of this would go. I said “wow” outloud.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Yeah, that part reads as though women are objects, his wife is his property",
              "id": 94,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I saw the \"get\" there and knew the rest was going to be a mess. The hell.",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1571,
          "content": "Yeah it's hard to get past that.\n\n>I sat her down...\n\nLike she was a child.\n\n>...and told her...\n\nBecause when you're making decisions as parents about your children there is no room for requests or discussion; only demands and ultimatums.\n\n>...that my son...\n\nStatistically and biologically speaking, it's far more accurate and certain to say it's *her* son.\n\n>...was going to have my last name.\n\nBuddy I know that you've probably got some fucked-up notions about what it is to be a man and how you should treat \"your woman\" but c'mon; as the soon-to-be father of a son you've got to be better than this. For his sake.\n\nYTA. If this is really important to you, ditch the Alpha bravado \"tellin' mah woman\" bullshit and explain with your words to your wife why it is important for you.",
          "id": 96,
          "comments": [
            {
              "score": 232,
              "content": "Would OP be this adamant if the baby was a girl",
              "id": 97,
              "comments": [
                {
                  "score": 27,
                  "content": "I had this thought too. My mom's father offered them a bunch of money to give my brother his last name instead of my dad's (which they declined, he was awful and they have dignity) but curiously did not make the same offer when it came to me. His logic, of course, was \"passing on the family name\", but my mom's maiden name is a pretty common one, and as far as I am aware everyone with my own last name is directly related to me, so that's both stupid and insulting. Also, my brother doesn't have kids. Also, like, who cares in any way about any of it?????",
                  "id": 98,
                  "comments": [
                    {
                      "score": 9,
                      "content": "My dad said once that, ideally, my brother should have only sons to pass the surname and I(f) should have only daughters because they are cuter. 🤯",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Yeah I got those vibes too. It's a boy, it must take after the father. Super patriarchal vibes with this one. Makes sense his wife is not originally from the US or is Latina, and there's such a condescension when he's talking about her and her family.\n\nSuch such such an asshole.\n\nOP YTA",
                  "id": 100,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 26,
              "content": ">Buddy I know that you've probably got some fucked-up notions about what it is to be a man and how you should treat \"your woman\"\n\nHe's a man from the South with what I'll politely call old-fashioned values. He's DEFINITELY got some fucked-up notions about what it is to be a man. And, for that matter, what it is to be a woman.\n\nSource: grew up in the South.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1071,
          "content": "Can’t wait until your wife sits you down and tells you that you are *going* to get a divorce and you “get” to be an ex-husband. Only a matter of time before she decides to take out the trash.",
          "id": 102,
          "comments": [
            {
              "score": 20,
              "content": "At least he’ll get to keep his name after the divorce.",
              "id": 103,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Bahahaaaa! I wish I had an award for you!",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 922,
          "content": "Correction... as soon as he said \"she comes from a place where women GET to keep their last name... as if that is a privilege afforded to women in that country. That is when I knew YTA here... and it got worst as I read on... ugh",
          "id": 105,
          "comments": [
            {
              "score": 20,
              "content": "Yup! Haha. She “gets” to keep her name and I stopped reading and scrolled right to all the YTA comments. You’re a AT, op. In many ways.",
              "id": 106,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Yeah that implies in the US they don't \"get\" to keep their last names and he's doing her a favor. When in the us you get to keep it if you want to as well.",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 542,
          "content": "For me it was the twice mentioned “got to keep her maiden name”. Yes, thank you so very kindly much, for giving me permission to keep my own name. That’s so awfully generous of you. Let me bow and deflect to your generosity and repay you every way I can from now.",
          "id": 108,
          "comments": [
            {
              "score": 32,
              "content": "The phrasing is so fucking weird.\n\nHe says his wife “got” to keep her last name, so he acknowledges that keeping one’s birth name is a good thing (we don’t say someone “gets” to do something bad). \n\nYet he still approaches it as if it would be preferable for her to have taken his name, like that is the proper order of things. Women shouldn’t have the privilege of “getting” to keep their own fucking name, and if they do they should consider it a gift. But still a gift that most women shouldn’t be given? That she only gets because she’s foreign? I don’t get the logic.",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Ah, but we know he doesn't begrudge her keeping her last name because he said so. He only accidentally repeatedly showed us that he resents it.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 432,
          "content": "I know, who is he to dictate what surname the child gets? If anything, she should be the one deciding since she's carried that child for nine months. Double barreled or her name.",
          "id": 111,
          "comments": [
            {
              "score": 218,
              "content": "THIS. She is sacrificing her body for 9 months, while all OP had to do was dump his seed in her. Ofc she should be able to decide which name the baby is going to get. And women should also be able to keep their own name. And why didn't OP get her name or something to have the same names? We live in 2021, the men shouldn't be seen as the last name carrier. I have my mom's last name, as well as one of my friends, and it isn't seen as weird or something.",
              "id": 112,
              "comments": [
                {
                  "score": 16,
                  "content": "9 months? The bodily sacrifice is indefinite. I've given birth twice and there are at least six body parts that will *never* be the same again!",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "WE live in 2021. But apparently OP and his family live in 1951. I hope OP's wife gets back to our time very soon.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 356,
          "content": "You made it further than me! The minute I read that OP’s family called his wife DISRESPECTFUL for keeping her name, I knew the story was doomed. \n\nI also like ‘I reminded her she got to keep her maiden name, so we’re even’ as if OP was doing her a favor by not forcing her to take his name. \n\nI think there are valid arguments to not hyphen your kids names. Maybe you’re worried about them being bullied? Maybe your concerned about the sound of it. OP provided enough context for us to know his biggest argument is his masculinity. And for that. YTA.",
          "id": 115,
          "comments": [
            {
              "score": 20,
              "content": "Or, he doesn't want his kid having a Latin last name, making him a xenophobic asshole by erasing half the kid's ethnicity",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 227,
          "content": "\"my\" son, not even \"our\". OPs wife seems to be an incubator and nothing else. I didn't see the slightest amount of affection in this whole horrible mysoginous pamphlet. Massive AH",
          "id": 117,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 179,
          "content": "I got as far as him saying she \"got to\" keep her last name.",
          "id": 118,
          "comments": [
            {
              "score": 6,
              "content": "For me it was “I told her my son was going to get my last name”…Oh! You TOLD her, did you?",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17452,
      "content": "YTA and you're also a liar. You're not looking out for your son's best interests. You're looking out for your own. You're just afraid of your family.\n\nWho's more important: your family or your wife?",
      "id": 120,
      "comments": [
        {
          "score": 7796,
          "content": "But he oh so generously “allowed” his wife to keep her name she’s had for her entire life! /s/",
          "id": 121,
          "comments": [
            {
              "score": 2891,
              "content": "My favorite part was when he said that *she* was the one throwing a fit.  This guy is delusional.\n\nHow soon do you think this has happened after they found out about the baby?",
              "id": 122,
              "comments": [
                {
                  "score": 681,
                  "content": "She should have told him she can't talk to him if he's being so emotional",
                  "id": 123,
                  "comments": [
                    {
                      "score": 311,
                      "content": "Men can be so testerical when their hormones are high!",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Bahahaaa! That's awesome. I wish I had thought of it. Also, I love your Daria avatar pic! Never seen one like that before. Very cool!",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Oh you *know* he wouldn’t have had this issue if they were having a girl. He’s right back in the 1940’s where a man’s balls are going to shrivel up if he doesn’t have an alpha cub to carry on his name and perfect DNA.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "If it was an issue when they got married, he's been having this argument in his head since then. Instead of bringing it up at the time of all of the family conflict with the marriage, he waited until she was knocked up and vulnerable to his control.",
                  "id": 127,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "She was incredibly chill and just stood her ground until he pushed, and pushed, and pushed and she finally couldn't take it anymore. How utterly patronising!",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 685,
              "content": "Right?!\n\nShe \"got\" to keep her last name. \n\nHe bestowed upon her his generous and infallible patience, and permitted her to retain her given name, despite how irrational her request was. Now she returns his previous blessing with nothing but female nonsense and hysteria, thinking *his* son should bear her inferior and pointless last name! \n\n^ OP's thought process apparently",
              "id": 129,
              "comments": [
                {
                  "score": 362,
                  "content": "I also picked up on the „issue came up again after we found out we were expecting a baby boy“. So if it were a girl it wouldn’t matter to OP? Maybe I read it wrong but his sentence rubs me the wrong way.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 242,
                      "content": "Well if they were having a girl it wouldn't matter, since her *real* surname will be the one her future husband bestows upon her! /s",
                      "id": 131,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "I wondered about that",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "It really does!!! He needs to marry his family and leave this poor lady to be happy with someone who loves ALL of her.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 680,
              "content": "[removed]",
              "id": 134,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 219,
              "content": "Yeah I caught his wording there \"allowed\"",
              "id": 135,
              "comments": [
                {
                  "score": 30,
                  "content": "Wow, thanks kind sir, for allowing me to continue to have the name ive had since before we met.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "He reminds me of a guy whose wife I represented in a divorce. He represented himself and asked the judge to make her change her last name back to her maiden name. The judge declined, as it was her nnow and she didn't have to change it if she doesn't want to. So be stated arguing with the judge (bad idea) about how it was HIS name and he let her USE it and how HERITAGE and blah blah blah.  Luckily for OP, his wife has spared him this particular embarrassment during the inevitable divorce....",
                  "id": 137,
                  "comments": [
                    {
                      "score": 10,
                      "content": "If I was that wife I would have kept it out of pure spite",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Sure he allowed it because he's 'from the south' that's where women still become the property of their men when they marry. He was already very generous to allow her to keep her name which made him a weakling in his families eyes. /s",
              "id": 139,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "The way he writes that she \"got\" to keep her last name is making me so annoyed. Like it's some sort of privilege or something he's allowed instead of a choice SHE made!",
              "id": 140,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 214,
          "content": "I agree.\n\nGrow some balls, OP.",
          "id": 141,
          "comments": [
            {
              "score": 19,
              "content": "Ironically, I bet that’s what his family says to him.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "If he thinks that the child will have a too long name, they should give him the mother’s surname and renounce to the father’s since he is the one with the problem.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "it's telling that he doesn't see his wife & new child as his family",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "OP needs to realize that his wife and future child ARE his family now. The out-dated desires of their extended family come secondary. \nOP YTA a hyphenated last name is a perfect solution, perfectly common, and won’t negatively impact your son’s life at all.\n\nSincerely,\nsomeone with a hyphenated last name",
          "id": 145,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12404,
      "content": "YTA\n\nYou don't get to make this decision unilaterally.\n\nYou say it is important your child only have one last name.\n\nYour wife considers it important that the child have her last name.\n\nThe obvious compromise is that the child gets one last name (your preference) and that it is her last name (her preference.)  That is a win-win.\n\nOtherwise, it's obvious that you're lying when you say it is important to you that your child has one last name, what you really care about is the patriarchal, misogynistic norm that a child have the father's last name.\n\nAnd her keeping her own name is an entirely separate issue from what you name the child.  It's her name - it was important to her that she keep that which is her own.  Again, if it was important to you that you share a last name, you could have changed yours.\n\nEither two names, because each of you want your own name for the child, or one name, which is hers, because you consider having only one name important.\n\nETA:\n\nThis: \n\n>The main reason I was initially against using both names is the fact that our son might end up having a very long name as a full name that's it.\n\ndoesn't help your cause.\n\nYou're worried about a long name?  That's your worry, not hers, she doesn't mind a long name.  She does mind having her name excluded.\n\nSame compromise applies.  If a too-long name matters to you, and including her name matters to her, use just her name.  You get what you want, a short name, she gets what she wants, her name for the child.  Win-win, again.\n\nYou can choose one name, hers, or a long/double name.  You don't get to arbitrarily exclude ***her*** name because ***you***, and only you, are the one having an issue with a long or double name.",
      "id": 146,
      "comments": [
        {
          "score": 2709,
          "content": "I too am from a country where the woman keeps their last name. It’s not that I love my husband less in fact I’m proud of myself for meeting someone who is so amazing, I rock. First, it’s the name I grew up with, I absolutely love my father and want to keep his name, the name fits me so well and honestly....I don’t want to have an American last name only because I don’t want to go to an interview and have the person shocked that I’m brown (my first name is common in America) and give me the look (I hate that look and maybe someone out there knows what I’m talking about). More importantly I’m lazy.\n\nNow if I do have a kid (sending it to the universe cause I’m having issues but that unrelated) I would love for my kid to have two last names. I’m the last of my line and it’s my heritage. Also cause I f—-ng want to. But maybe the OP should consider that children who are first generation immigrants and especially if their half (ie half American/half Russian) lose some of that cultural tie. For example, I’m bilingual but English is my first language...sure I can speak my secondary language but I’m awful. It’s a reality, and maybe his wife wants her child to have some tie to her motherland. I mean let’s face it he’s going to be American and the probability he’ll say y’all is higher than him being culturally connected to her country",
          "id": 147,
          "comments": [
            {
              "score": 1163,
              "content": "I also think it's laughable that he (and his family) think that she was the one being disrespectful for keeping her name. So apparently she should erase her heritage because his is more important?\n\nMy SO uses his mother's maiden name day to day, I double barrelled with that name and my existing last name. Do what you want with your name no one really cares and if they do? Fuck 'em!",
              "id": 148,
              "comments": [
                {
                  "score": 31,
                  "content": "I wanted my son to have my last name and my SO wanted him to have his last name so he just has a longer name. If my SO TOLD me the baby was having his name I would definitely only give him my name!!! Hate this for the wife!",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "My SO has his mother’s first husband (he’s never even met the guy, but his mom still had that name when she had him, but she later change her name back to her maiden name, but didn’t change his) last name, and he’s always wanted to change it to his mom’s maiden name, but he’s lazy. When we had our son, we were in the awkward position of giving the child my last name (which I am keeping), or his last name (which he feels no connection to and didn’t want to pass down), or his mother’s maiden name (which none of us actually have). We chose his mother’s maiden name. 🤷🏻‍♀️ We have 3 last names still, which is admittedly confusing to people, but whatever.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 255,
              "content": "You don’t even need any of those reasons to keep your name. It’s just your name. No man in the history of time has ever had to give a reason for why he is not changing his name when he gets married.",
              "id": 151,
              "comments": [
                {
                  "score": 33,
                  "content": "Great response!!! I’m learning I don’t have to give reasons for my choices.  I agree",
                  "id": 152,
                  "comments": [
                    {
                      "score": 8,
                      "content": "💜",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "“No” or “I don’t want to” is a great reply. And “why would I dignify that with a response?”\n\nOr when I was a deputy mayor and one councillor decided to throw a tantrum about my lack for name change: “you will call me Cr Milliganimal UNLESS AND UNTIL I TELL YOU OTHERWISE. Now - SIT”\n\nAnd he did.",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "No kidding. I knew a guy who THE DAY BEFORE THE WEDDING told his now-wife basically “my childhood sucked. My dad was an alcoholic who beat us and our mom. Your parents are awesome, and I want to use your last name. That okay?” She was shocked, and said everything to do with the wedding will still have your name, because we’ve already paid for printing, but yeah. So now they both have her last name.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I hope that you do have a child. Sending you all the positive energy I have. I'm sure you'll be a great mom when the time comes!!! 🍀❤️",
              "id": 156,
              "comments": [
                {
                  "score": 8,
                  "content": "Thank you so much. I’m in tears. You made my day.",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Also kept my last name. It's unique. (Like, even on fb there are cca. 100 people with said surname.) If I didn't I'd be the equivalent of the 1000+th Mrs. Smith.\n\nFor this reason, any future kiddos will get both surnames.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I have a friend who, legitimately, was named Michael Hunt. He took his wife's name.",
              "id": 159,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": ">I don’t want to have an American last name only because I don’t want to go to an interview and have the person shocked that I’m brown\n\nMy partner and I are struggling with the same thing. If he takes my name he'll sound SUPER Irish (and people will be surprised he's Latino), and I can't take his name unless I'm fluent in Spanish lol (plus I want to keep my name).",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "While not from  anywhere other than California,  I kept my last name for 2 reasons: I like my name and also the only grandchild to give my last name to my daughter.  She has both of her parents names and hasn't had a problem with it.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 963,
          "content": "Woop! There it is...",
          "id": 162,
          "comments": [
            {
              "score": 9,
              "content": "Boom Shaka Laka",
              "id": 163,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "This needs to be right at the top!",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "OP, take a long look at this and examine your motives. You're not being honest with yourself here.\n\nIf it was disrespectful of her not to take your last name, doesn't the same apply to you since you didn't take hers? Your family is doing tradition for tradition's sake, and you're massively letting your wife down by not standing up to them, especially given the sexist implications.\n\nYou didn't \"allow\" her to keep the name she has a right to so much as back down from making a request that was unreasonable to begin with. So no, you wouldn't be \"even\" giving your child your last name alone.\n\nShe's offered a compromise. You have not.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "[deleted]",
          "id": 166,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Not to mention that he also wanted the child to have a middle name. If you are worried about length then maybe remove that instead?",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Or the kid can have HER last name and his last name as a middle name. Great! Kid has his last name in there somewhere and no overly long name.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9662,
      "content": "YTA\n\nLook, Henry VIII, she didn't 'get' to keep anything.  She is a grown woman who chose to keep her name instead of bow down to your ego.  Get over yourself.  She is your equal, your partner and wife, not your subject.  Your son is not an extension of that ego.  He is a separate human.\n\nYour family has no say in any of this.  They, and you, need to grow up.",
      "id": 169,
      "comments": [
        {
          "score": 1355,
          "content": "this. i find it ridiculous that a man of his big age cares so much about the opinion of his family, apparently more so than the opinion of his wife and mother of his future child.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 616,
          "content": "I chuckled at Henry VIII",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 452,
          "content": "this!! also what's wrong with having two last names? i do and I like to be able to keep both. the argument of it being \"confusing\" just shows how backwards he is. hope he lands in 2021 sometime soon.",
          "id": 172,
          "comments": [
            {
              "score": 291,
              "content": "Bro, the entire country of Portugal has two or more last names. I believe in Spain too. We get both our parents' surnames",
              "id": 173,
              "comments": [
                {
                  "score": 133,
                  "content": "Most Latin American countries do this as well, but gasp! The king of the house wants his heir to only have one last name bc God forbids he has more than one, white sounding last name.",
                  "id": 174,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 67,
                  "content": "Brazil here, and same. I told my mom I wished I had her last name as well a bunch of times. \n\nWhy does a child need a name AND a middle name? Just give him a name and two last names...",
                  "id": 175,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 47,
                  "content": "Portuguese here and I kept both my last names (mums maiden and dads) and added my husbands. So three surnames in total. My daughters both have the same surnames as me. My Australian husband never had an issue with this. OP is a major asshole",
                  "id": 176,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Im portuguese too and I have FOUR last names (only 1 first name, thank God). I have 2 from my mum, 1 from my dad and added my husbands when we got married. \n\nAnd the reason I added his name was actually because I knew that when we got children, they would get his last name as theirs, and I wanted to share my kids name.\n\nSo, now our son has 4 last names, just like me. Three from me and one from my husband. Our last names are exactly the same and I love it.",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Out of curiosity, which names are kept when two people with two last names each have a child?",
                  "id": 178,
                  "comments": [
                    {
                      "score": 20,
                      "content": "You choose. My mom gave me her first last name and my dad his second",
                      "id": 179,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "Here in PR we get one from each parent, whichever one is first from each parent. Usually the dad's first last name then mom's first last name.",
                      "id": 180,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 263,
          "content": "I’m going to start calling sexist creeps Henry VIII",
          "id": 181,
          "comments": [
            {
              "score": 13,
              "content": "Nah.  They may like it to much, and say you are calling them a king.",
              "id": 182,
              "comments": [
                {
                  "score": 8,
                  "content": "I mean, Karen used to be a normal name too...",
                  "id": 183,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 185,
          "content": ">Look, Henry VIII, \n\nLOL.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 106,
          "content": "God, OP is such a misogynist. He “allowed” her, she “got” to, he “told her”. And then also:\n\n>I reminded her that she got to keep her maiden name and so we're even.\n\n“Even”? Like OP gave up his right to her having his last name so now she has to repay him for that sacrifice? What part of you both keeping your own names after marriage is “uneven” for you to now have to get “even”, OP? You’re already even, since it’s not like you changed your name to hers. Why do you phrase this whole conflict as if you allowed her to go above your authority so now she has to repay you by deferring to that authority? You have no authority, you’re supposed to be equals.",
          "id": 185,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 51,
          "content": "*Sir Thomas More has entered the chat*",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I don’t think I’ve ever been sadder I don’t have an award to give. 🏅",
          "id": 187,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Exactly. He didn't \"allow\" her to do anything because it's not his decision. He gets no say on what her own name is.",
          "id": 188,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7172,
      "content": "YTA  \nI'm from the South as well.   \nQuit using it as an excuse.  \nQuit using your family as an excuse.  \nYou didn't do her a favor by allowing her to keep her fucking name.  \nAnd you aren't looking out for your son's best interest. Just yours.  \nYour kid's life will be the same with or without your last name.  \nGrow up and quit this sexism.  \nDisrespectful my ass.  \n It is disrespectful to think it is disrespectful someone doesn't give up their last name they have had for their whole ass life for your silly last name.  \nAnd there is no even here. You gave the sperm. She makes the whole ass baby.  \nAnd what did you expect from someone who wants to keep their last name after marriage would say when they have a kid?\n\nEdit: Oh my goodness. These awards and upvotes. Y'all are too kind!! Thank you! Always nice to get this support while calling someone an asshole.",
      "id": 189,
      "comments": [
        {
          "score": 2536,
          "content": "I’m from the South too. \n\nFunny how every third girl can have two first names but no boy can have two last names. \n\nWhere’s the confusion again?",
          "id": 190,
          "comments": [
            {
              "score": 377,
              "content": "That is such a funny observation. Seriously dying over here.",
              "id": 191,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 277,
              "content": "hell half the dudes have 2 names too, just ask jim bob or billy bob or bobby joe.",
              "id": 192,
              "comments": [
                {
                  "score": 59,
                  "content": "Ask my son, Tommy Ray",
                  "id": 193,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Or Billy Ray Cyrus",
                      "id": 194,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "Don't forget Larry Joe, Lou Larry, or Billy John!",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "Well if that ain’t the damn truth.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I’m from the south too and my partner accepted that either my son got both of our last names or just mine. Our son now has a long name.",
              "id": 197,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Fr, southerners love to give girls two first names.",
              "id": 198,
              "comments": [
                {
                  "score": 12,
                  "content": "Even more so when it’s a “family name”.",
                  "id": 199,
                  "comments": [
                    {
                      "score": 15,
                      "content": "And then slap a big ole’ cheer bow on her head.",
                      "id": 200,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "I’m a girl from the South who has two first names! \n\nOP is 100% TA, and clearly lacking in self-awareness.",
              "id": 201,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 521,
          "content": "I was gonna type a response but you already nailed it! I hate the “but my family” excuses…guess who is also your family and the one directly impacted by this decision? Your wife & kid! This dude isn’t looking out for his son, he’s looking out for his fragile ego and everything else is noise/distraction/excuses.",
          "id": 202,
          "comments": [
            {
              "score": 12,
              "content": "I dated a Southern guy (well, Kentucky). When he learned I'd be keeping my name if it worked out, he whined, \"I'm just afraid my friends will think I'm whipped if my wife keeps her name!\"\n\nSo put your \"friends\" in their place and defend your wife??\n\nParagons of masculinity, those Southern guys.",
              "id": 203,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "He’s also a grown ass man looking to please his mommy and daddy.",
              "id": 204,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 165,
          "content": "I agree 100%! Like “I let you keep your last name, so now we are even”? Does he own her? Acting like he did her a favour as if it wasn’t already her own decision. \n\nWhere I live you can actually choose for your child to not have a last name. So maybe that would be a compromise on their part lol.",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": "You said it better, and more politely, than I would have.",
          "id": 206,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 42,
          "content": "Say it! I hate when people use where they're from as an excuse for their behavior.",
          "id": 207,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Glad someone stated the most glaring thing here: she’s the one CARRYING and BIRTHING the fucking child.",
          "id": 208,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "I’d just like to point out that if OP’s wife is from Europe there may be legal issues having to do with her and her children’s surname \n\nFor example, my wife has dual French and Spanish citizenship. After we got married and she registered our marriage in France and Spain, she legally was allowed to hyphenate in France but had to keep her maiden name in Spain. Those countries, and Europe, have whats called a “family book.” The family book registration is what allows your future children to gain citizenship to those countries. \n\nSo if I forced the issue of surname on my wife, my children would have to jump through a hell fire of legal battles to gain the citizenship that they have a right to. \n\nFor the record, my wife wants our soon to be child to only have my surname, partially because she doesn’t like her surname, and partially because as long as we registered her under her surname in the family book our kids came have any surname to still maintain that legal and cultural connection",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Exactly. I’m from the South as well. Decided when I was still in the single digits of age that Iike my last name and I want to keep it. Literally no one has given me grief about it, aside from like 2 people I dated (it’s now something I use to rule people out). \n\nBeing from the South doesn’t make you a sexist asshole, there are *so* many people down here that are extremely progressive and accepting. \n\nYou make yourself an asshole.",
          "id": 210,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "It's also ironic since last names are either made up or combined from two family names anyway.\n\nBlending, meshing, and combing two names while isn't well known, it's still pretty common and popular.\n\nDon't know why OP is lying or delusional about the excuses he's making.\n\nHe does realize that if he ever had daughters and ONLY daughters then his family name would've died out.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2856,
      "content": "YTA. Why is it a privilege for her to \"get to keep\" her maiden name? It's her name. And her child will also be her child. Frankly, if she chooses to let you add your last name you should be grateful, considering what a misogynistic ass you're being.",
      "id": 212,
      "comments": [
        {
          "score": 29,
          "content": "YTA. You’re more afraid of a spanking from your parents than loosing the respect of your wife.  Grow a pair of balls and tell mommy and daddy that this is 2021 and things change.",
          "id": 213,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2680,
      "content": "[removed]",
      "id": 214,
      "comments": [
        {
          "score": 1007,
          "content": "I'm from 'the south'. I'm woman. I did not change my name when I got married. My husband cares more about me than my last name. We discussed last names when we had kids. I wish you could email a smack to someone.",
          "id": 215,
          "comments": [
            {
              "score": 191,
              "content": "Me too. Southern and kept my last name. It wasn't even a discussion between me and my husband. Because we aren't living in the 1950s.",
              "id": 216,
              "comments": [
                {
                  "score": 7,
                  "content": "I was born & raised in the southwest. My husband was born & raised in the deep, deep, south where women always take their husband’s last name. There was absolutely no “you need to take my last name” conversation when we got married, it was completely up to me. I changed it because my maiden name is a very biblical name & I got tired of people not only mispronouncing my first name but also my last name. \n\nPeople shouldn’t just assume one spouse is going to take the other spouses last name when they get married just because of their genitals.",
                  "id": 217,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "Same live in the south kept my name cuz we didn’t wanna do paperwork",
              "id": 218,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 89,
              "content": "\"I wish you could email a smack to someone \"! I know Reddit doesn't like emoji, but 🤣",
              "id": 219,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 81,
              "content": "Currently pregnant, happily married, in Texas. Add a smack from me please.",
              "id": 220,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 36,
              "content": "I would love to doordash him a Big SmacK from SmackDonalds.\n\nEDIT: Thank you for my first award!!  Glad I made you laugh, anonymous table slapping award giver!!",
              "id": 221,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "That should totally be a thing.\n\n*Ding dong*\n\n*door opens*\n\n*the sound of an open palm slapping the face*\n\n\n\"have a nice day sir. Don't forget to rate our timeliness and slap-delivery. Goodbye\"",
              "id": 222,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "exactly. Also southern, TWO of my friends just had a babies with two last names. Who tf cares.",
              "id": 223,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Now I’ll admit I’m from Aus, not the US or the South, but my partner has a double barrel surname and I’m paying good money to change my surname to my mums maiden name (I have no connection to my father or that side of the family after I went no contact with him at 13). We’ve already agreed when we get married I keep the name I’ve paid good money to have. With kids we haven’t discussed it too much at length, but since he has a double barrel surname I’m happy if they take his surname and either pick the middle name, or they get two middle names and one of those is my surname. He likes the idea of that too. The power of compromise works great. I think this guy needs to learn that tho 🙄",
              "id": 224,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 371,
          "content": "When he talked about the baby it was \"my son\", when she talked about him it was \"our son\".\n\nMate you gotta change your tune because if she starts saying \"her son\" then you're screwed. She isn't asking you if it's okay your baby has both of your surnames, she's letting you have your name in there because she can very easily tell the hospital not to let you sign the birth cirtificiate, or even just have the baby somewhere else, and then your son will only have her name- which I'm sure you would see as a tragedy. She isn't your incubator on stand by. \n\nOh and if you often make decisions for her, then you're a terrible husband. Get married to a man if you can't see your wife as an equal in your relationship.",
          "id": 225,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 139,
          "content": "And he said he wasn’t mad she kept her maiden name yet he holds it over her head in an argument to get his way???? Very concerning, I’m not saying he’s abusive but that’s an example of abusive behavior, she had every right to keep her name there’s nothing to be “even” about. OP check your sexism",
          "id": 226,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "The funniest part is that if mom gets pissed off enough, he won't even get to be there when the birth certificate is filled out. It's not even a 'compromise' in the sense that if his wife doesn't agree she can veto him and name the kid whatever she wants! He should apologize if he wants his last name anywhere on that paper.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I wish I had the spare change to give you one million gold awards",
          "id": 228,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1981,
      "content": "[removed]",
      "id": 229,
      "comments": [
        {
          "score": 625,
          "content": "I'm honestly hoping at this point after how he treated her, TELLING her what the last name would be and pretending like he did her a favor by letting her keep her last name, that his wild entitlement gets his last name a no-show on that birth cert. Can't believe some men actually think like this.\n\nThe audacity",
          "id": 230,
          "comments": [
            {
              "score": 99,
              "content": "I wouldn’t have a problem with his name showing up…. Perhaps it could be the middle name!\n\nOtherwise, yeah, OP doesn’t realize he just accidently showed his wife exactly how he’s going to handle every parenting choice when they disagree… and she’s taking notes and thinking long and hard about her options right now.",
              "id": 231,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "He's like oh I had no problem with her keeping her name, I encouraged it etc but then is also like 'we'll give the kid my name so we're even' like I'm getting mixed messages dude",
              "id": 232,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 278,
          "content": "It seems fair that the person carrying the baby gets to pick the name.",
          "id": 233,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 84,
          "content": "Both my kids have mine and hubby’s last names and me and hubby are just his name (my choice). When my eldest daughter got married, she retained her two surnames instead of her husbands one surname, but often calls herself by all three surnames!  Everybody is fine with everything.",
          "id": 234,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "When I got married, I chose to hyphenate because I thought it sounded pretty and interesting. Now we're having a baby, it's my husband who really wants our children to have both and he's decided he's going to hyphenate as well.",
          "id": 235,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1977,
      "content": "INFO: You say you’re looking out for your son’s best interest in your last line, but you didn’t actually mention anything about that in your post.   How is this in your son’s best interest?\n\nThe only reasons you list are that you’re afraid of your parents, too lazy to have to write a long name on your child’s forms, and that it’s traditional in the area where you grew up.\n\nSo, now tell us why it’s in your kid’s best interest to have only your last name.",
      "id": 236,
      "comments": [
        {
          "score": 473,
          "content": "If the wife is European there can be legal consequences for her or the children’s citizenships to that country by changing their name. My wife has dual French and Spanish citizenship. She was able to hyphenate for France but has to keep her maiden name for Spain. For the record, our children will have my surname but they can because she registered her maiden name and our marriage in what those countries call a “family book.” Her changing her maiden name to only mine screws that whole process up for our kids",
          "id": 237,
          "comments": [
            {
              "score": 251,
              "content": "I was also thinking about citizenship issues. My bf is Portuguese and there they have to officially have both of their parents’ names",
              "id": 238,
              "comments": [
                {
                  "score": 174,
                  "content": "Yeah exactly, OP is TA for both being controlling and also being ignorant. I’ll never understand why people can’t just have a freaking conversation before they “put their foot down.” I’ll be honest, when my wife told me she couldn’t take my surname I was a little disappointed, not enough to make a big deal out of it but a little nonetheless, but then she explained it to me and I was 100% on board. I always wanted our future kids to have a legal and cultural connection to both of their parents homelands and if this makes it easier for them to have that connection to their mother’s homeland, then that’s what I want. \n\nNow we’re expecting our first in just a few more months and we’re figuring out a multilingual schedule to speaking to our baby so they always will be fluent in English, Spanish, and French.",
                  "id": 239,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "In Brazil and Portugal they actually had to make laws to limit the number of names you could give your child. My American father asked my Cuban/Portuguese mother to limit it to two middle names for each child. I always loved saying my full name as a kid because any little American friends would get wide-eyed. I only have five names with the double last, I had friends back home with more.",
                  "id": 240,
                  "comments": [
                    {
                      "score": 7,
                      "content": "My middle school best friend had seven names.  It was literally the first thing she’d tell people about herself upon meeting them. \n\nI have four and I’ve never needed to use the middle two on any paperwork",
                      "id": 241,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 321,
          "content": "Curious if he'd throw this much of a fit if they were having a daughter.",
          "id": 242,
          "comments": [
            {
              "score": 248,
              "content": "He specifically mentioned that this kicked off when they found out that they’re having a boy, so somehow I get the feeling he believes he has more ownership than she does because of that.",
              "id": 243,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 83,
              "content": "This was my question, but I don’t think we need him to answer- it’s no. For the same reason he thinks he can ‘sit his wife down’ to explain their child’s name.",
              "id": 244,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I have a feeling it's more about the name not being American enough...",
              "id": 245,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "As someone who had a daughter and gave her my last name they would not. A son though is expected to have my husband's last name.   I hope the wife holds her ground. OP's family would take every opportunity to rub that the son's last name is the family name and not hers. They might even start pressuring her to now charge her last name so it matches son's.",
              "id": 246,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 21,
          "content": "Also, how often will they even need to write his middle name? I have two middle names and I *rarely* use them on paperwork because I have a unique first name. \n\nHow aggressively average is this child’s name going to be?",
          "id": 247,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "He is just a **** who wants to keep his family happy.",
          "id": 248,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1772,
      "content": ">she disagreed and said no and came up with a compromise which was that our son gets both our last names but I declined explaining how awkward and confusing and just complicated that would be\n\nIf having two last names is the sort of thing that causes an intellectual hurdle for you, you probably shouldn't be having children.",
      "id": 249,
      "comments": [
        {
          "score": 202,
          "content": "The way this made me laugh!!! Yep, thank you lol",
          "id": 250,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "👏",
          "id": 251,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "that made me laugh. i have a middle name and two last name, one from my country and one from my other culture. granted it’s common where i’m from but like, OP is being so dramatic",
          "id": 252,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}