{
  "post content": "My son \"Jordan\" is 27. His stepmom \"Natalie\" came into his life when he was 16. His mom had passed away when he was 13. Jordan never really considered Natalie as his his mom. He refused to let her get close and shut down every attempt to have a close relationship. He even moved in with his aunt months after Natalie and I got married.\n\nAs years went by, they started reconciling and seeing each other more often. He invited us to his wedding which took place days ago.\n\nWe got there and the atmesphere was great, Until later when I found out that Jordan had denied Natalie a mother-son dance and instead chose his aunt to dance with him. Natalie told me this minutes later and I couldn't help feel irritated and quite upset. I decided to get up and leave and we both left. I got calls from my family after they saw me leave. And Jordan called later and I told him why I did it. He got mad and said it was his wedding and that his aunt is basically a mother to him and said that Natalie shouldn't expect \"special treatment\". I said it's not special treatmrnt but a tradition. Besides that he hurt her feelings for no reason other than for the sake of being malicious. He got offended and accused me of ruining his day and causing a scene.\n\nNow the family sided with him and said I shouldn't have left nomatter what.",
  "id": 1,
  "comments": [
    {
      "score": 57806,
      "content": "YTA. Your wife has never been his mother and he has every right to not have a mother/son dance with her. I strongly suspect this isn't the first time you've chosen your wife over your son and is probably why he moved in with his aunt. \n\nIf you want any kind of relationship with your son going forward, I very much recommend both you and your wife apologise for throwing a tantrum at his wedding.",
      "id": 2,
      "comments": [
        {
          "score": 21495,
          "content": "For OP's son to have moved out after only a few months, I have a feeling the reason is because OP and his wife were trying to force him to accept the stepmom as his \"mom\" right from the start. And after all that happened, OP's son invites them both to his wedding, and OP has the audacity to demand a mother/son dance? Then they leave when they don't get their way? Wow, there goes any chance of them mending their relationship.\n\nYTA",
          "id": 3,
          "comments": [
            {
              "score": 6562,
              "content": "Sounds plausible.  I've heard similar stories on here. The OP is keeping suspiciously quiet about why his son doesn't like OPs wife.\n\nAs it stands, she's not OPs son's mother, she didn't raise him and he doesn't like her.  Yet OP and his wife expect her to be given the mother son dance.  The sheer entitlement of it is astounding.",
              "id": 4,
              "comments": [
                {
                  "score": 5763,
                  "content": "Yeah, when he said the son was 16 when Natalie came into the picture, it was immediately YTA...\n\nmy husband's father died when he was 11, he met his mother's now husband when he was 15, they lived in the same house till he went to college...\n\nthey have a great relationship, they go fishing together, step-dad helps us with home repair projects, all those sorts of things.  But that took years to develop, which means it didn't really happen till my husband was an adult.  His step-father has always been supportive and just there, but he didn't try to be a new dad, just a caring adult in his life.\n\nMy husband's sister was 7 when their father died, and 11 when step-dad came into the picture.  Step-dad did more \"parenting\" with her, and they had some tense teenager moments when she yelled and rebelled against him enforcing house rules...  but they are also closer because he did do those \"dad\" things for her.  \n\nBut even with them having a closer relationship earlier, she still refers to him by his name, and at her wedding she had her Mom and step-dad walk her down the aisle together, because it didn't seem right leaving her mother out of that tradition.\n\nStep-dad was pleasantly pleased to have been included too, and would have been totally fine with her just having her mother do it alone...  but he can be a bit traditional in some ways and I think my SIL knew how much it would mean to him, and does genuinely care about making him happy, and making sure he knows how important he is to her.\n\nI think 11 or 12 is about the oldest a kid can be when a step parent enters the picture, to still have time to form a real \"parental\" bond.  Any later than that and there's just not enough time before they leave home...  that doesn't mean a really caring relationship can't still form in time, but it will never quite feel parental because you were never a helpless child dependent upon them.  So it just ends up feeling different.\n\nOP is the AH for not being able to see that as a fact, and not take it personally.\n\nThe fact that all that other stuff happened, the son moving out, etc, and OP STILL can't figure out that his son and wife are never going to have a mother/son relationship is insane...  how deep is the hole OP stuck his head into?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1218,
                      "content": "My stepmom and dad started dating when I was 6 and got married when I was 12. She’s still her first name.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 247,
                      "content": "Honestly, I would say the youngest you can expect without fail, a child accepting a stranger as definitely mum or dad is like 2, and only if the actual parent is absent/dead.\n\nIf they have actual memories of their parent at all, they might never accept someone else as being 'mum' or 'dad' or a 'parent', even if that person was awful, they may have complex feelings about it and not want to replace them still.\n\nAnd when the person is literally 16, it is rare that they will accept another parental figure. You can't expect they will. They still can, but, it isn't very likely at that age as they are usually somewhat independent even if they can still need some guidance and comfort at times.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 178,
                      "content": "[deleted]",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "A perfect example of doing things the right way.  I can only imagine how difficult it is to be step-parent but jumping and making demands will not go the way you want it to.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "This is about right. I was 11 when my stepfather came into my life. As a teenager I made it really hard for him. I've made the \"you're not my dad\" comment many times.\n\nIt wasn't until I grew up and had a child that I started calling him \"my father\" to others. He is the most wonderful grandfather and best friend to my daughter.\n\nI (my brother and brother too) call him by his first name. Our biological father was \"daddy\", our stepfather is our father, he was there for all the \"father things\".\n\nThese things cannot be forced. Certainly not with a 16 year old.\nAnd probably because of this action by OP, it will never work out again between son and stepmother.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "This. When I was 11 my step dad came into the picture. I hated him, cursed him out multiple times, disrespected him for coming into our lives and making my mom “boring.” \n\nOne day, I noticed he was taking a long time to come home from work and I wondered what was taking him so long. It got to the point where I couldn’t shut up about it and eventually asked my mom, “where is ‘step dad’ ?“ \n\nThat’s when she giggled and asked me if I missed him and I felt embarrassed and went to my room. \n\nEver since then, we have a father/daughter day, we go out to eat and he’s my best friend who I speak to about my now husband and everything that happens in my life. \n\nLike a real father-daughter. Despite my brothers and I disrespecting him, he’s still here and loves us as if we were his own.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Very deep. It is a VERY deep hole. It’s the kind of hole we all set out to dig in our backyards growing up. Only difference is he ACTUALLY kept digging",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "This is what happens when stepparents play the long game. \n\nThank you for providing a good example of how to do it.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1081,
                  "content": "Not only did she not raise him, she ran him out of their house and because of her relationship with his dad, he didn't have a relationship with either of them from when he was 16 (when she came into his life) until he was an adult. I am not sure on what level mother is, but 2 years of not being in his life is the same as her not existing to him for the 16 prior.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 223,
                      "content": "This happened in my family. When my dad's first wife (not my mom, I came earlier) died tragically of cancer when he was 48, within 2 years he brought home a 23yo to be the \"stepmom\" to his two grief-stricken teenage kids. I realize it's ultimately his fault because he's their dad, but this woman (who was the only non-traumatized person in the situation) systematically pushed my brother and sister out of the picture so she could have her own nuclear family with him and the two kids they ultimately have.   \n\n\nHe wonders why he doesn't hear from us older kids very often.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 93,
                      "content": "[removed]",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 27,
                      "content": "And if his mom died when he was 12, it's likely is Aunt (probably his mother's sister) tried to step in and be a mother figure for him.  She wouldn't have felt like an interloper, and would have had memories of her sister at the ages he was. (Your mom went through a klutzy stage at 13 as well, don't worry, you'll grow out of it.)  And shared grief can cause a lot of bonds.\n\nHis Aunt might have been far more like a mother to him even if he hadn't disliked his dad's wife.  If I get married I'll probably ask my mom's best friend to act as mother of the bride, not my dad's new wife.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 586,
                  "content": "Right?! And also, they arrived to the reception just expecting this dance would happen, and left when they found out it wouldn't. Every other post I've read about a mother/son or father/daughter dance, they had talked about and made a plan for who would be doing the dance months before the wedding. So either this post is fake, or OP is so out of the loop of his son's life that he had no idea what the plans were and just expected to wing it? Or maybe there is a 3rd option, that he had been talking to the son about wanting the stepmother to have a mother/son dance, and the son refused, so they showed up at the wedding hoping they could guilt him into it? Idk, but like the fact that he did all this drama at the wedding instead of having a conversation with the son before the actual event and resolving this ahead of time makes OP extra the AH.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 144,
                      "content": "Exactly. OP could have dealt with this in any other manner. As you say, he could easily have asked ahead of time or , not having done that and his wife being upset, they could have put thei big boy pants on and sucked it up at the wedding.  If he and his wife wanted to have their little hissy fit, they could have kept it until a later date after the wedding had been and gone.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "OP knew if he broached the subject before the wedding, they'd end up uninvited. In his shoes, I'd be feeling lucky to be there at all, let alone expecting an actual part in the wedding.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "To be fair, I had a mother-son dance with my mom at my wedding without ever discussing it, because it didn't occur to us that it could not be a thing.\n\nBut yeah, in such cases, there definitely should have been a discussion if that were to happen.\n\nOh, and OP, YTA.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "Yup. Unrealistic expectation given the background between son and wife/ Super rude to ask for the honor, especially on the day of, when there is no basis for it. And childish to leave the wedding because request was denied. \n\nYou can tell OP doesn't listen to the son. Son told OP the reasons why no dance, and OP is making up other reasons so he can try to justify his feelings and actions. Probably been going on a long time and part, if not all, the reason why sone moved to aunt's.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Exactly she came into the son’s life when he was practically an adult. And he moved out soon after. Just because they got to a place where they could be friendly to each other does mean his  wife was entitled to anything, other than maybe an invite, which she got. I wonder if the aunt is the mom’s sister. I if so the aunt not only let him move in, and became like a mom, she could also be a connection to his mom. OP is ATA. How could he do that to his son, and taint his wedding day like that. Good luck every having any part in your son’s life from here on out, Hope that  AH move to sided with his entitled wife was worth losing his son.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "\"please validate that my son is a bad person for not doing what I want him to do on his wedding day despite the fact he doesn't like my wife\"",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "\"For no other reason then to be malicious\" bruh his dad is an absolute ass. His son had the mother son dance with his aunt who he said felt like the mother figure over his stepmom. No malice in it, just the raw truth you can't temper tantrum into a mother son dance. Their reaction is a big ass tell as to why the kid didn't do a mother son dance with steptyrant",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I’ve even had to have the conversation with people that my Dad’s wife isn’t even my step-mom. She’s done literally 0 parenting of me in any way. \n\nHer kids tried to call me their brother at the wedding, and some extended family got all teary eyed saying “aw you’ve got a step-mom now.”\n\nNah. Not even a little",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "For real, OP and his wife suck.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I always hope that, like, OP is actually the son making sure his dad is an asshole...\n\nBecause when people write about themselves, they paint it in the best way possible to make themselves look good.\n\nIf you tell your own side of the story like this and it paints you so clearly as an asshole, a neutral telling would paint you as like a superduperultramega asshole.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 604,
              "content": "[removed]",
              "id": 29,
              "comments": [
                {
                  "score": 29,
                  "content": "I truly think this OP thinks he doesn’t have a mother because his passed away. He truly seems that out of touch.",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 25,
                  "content": "It is almost like Dad has the attitude of her is your new mommy, forget the old one.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 444,
              "content": "You can't force your son to replace his mom with a woman you picked out.\n\nYTA\n\nYou may have just locked that door forever.   Apologize and grow up, learn that just because you see something one way doesn't mean everyone must.",
              "id": 32,
              "comments": [
                {
                  "score": 30,
                  "content": "Yeah, say goodbye to seeing your grandkids!",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 431,
              "content": "I believe there is more OP is not telling us. Must have been more than just uncomfortable for the son to leave his dad to live with another relative. OP says after the years they started reconciling. Really sounds like there was an event or events that led to these issues. Sadly the son likely never felt supported and OP just proved the son right.",
              "id": 34,
              "comments": [
                {
                  "score": 179,
                  "content": "Yeah, there's definitely more to this story and I'm really curious about what incidents led to his son moving out. I'm sure it wasn't just minor disagreements amongst them.\n\nBut I doubt OP is going to share specifics, because I'm confident they'd only make him (and his wife) look worse.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 71,
                      "content": "It's kind of telling that OP mentions Natalie and Jordan were reconciling and getting on better. He never addresses HIS relationship with his son. Did this reconciliation include him? Were they still in contact while Jordan wanted nothing to do with Natalie? Who pushed the \"replacement mother\" agenda?",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 67,
                  "content": "I bet he will only comment to someone who says he was justified in leaving. This post will be deleted soon as well.\n\nA kid doesn't just leave. Dad probably ignored him for new wife. New wife probably demanded a place of mother. House was probably stripped of all evidence real mom ever existed.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 16,
                      "content": "You’re absolutely right, a kid doesn’t just leave and Aunts don’t just let their nieces/nephews live with them for no reason either, also OP and wife were clearly ok with this arrangement as they didn’t demand him back nor call the authorities….then again I don’t know how old he was when OP and wife got married, son could have already turned 18.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Definitely. It’s saying a lot when an OP in this forum naturally will downplay the bad parts and is still seen as the asshole. \n\nLeaving in a huff is immature, and he’s supposed to be the father.",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "I’m a step-mom who came into my step-kids’ lives when they were older like this. I absolutely try to support them and I care about all of them, but it’s asinine to think you’re their “mom.” Especially after just a few months. Especially after their biological parent has passed away. I also highly suspect there was a lot of undue pressure on the son and if they had left well enough alone, he might have felt more inclined to have the dance, but it was always fine that he didn’t have one.",
              "id": 40,
              "comments": [
                {
                  "score": 19,
                  "content": "Yeah, trying to force any sort of parental role is literally the worst way to handle a situation like this. And for the son to have moved out after only a few months, that really says a lot. \n\nIt makes me wonder if OP and his wife were just the types to try to act like his new stepmom was supposed to immediately replace his deceased mom. Because how bad do things have to be for a teenager to only last a few months before fleeing to a relative's house and then cutting contact?",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "OP dosnt understand he cant replace his sons mom with his new wife when the son's 16, but his aunt who has been in his life his whole life and who went through the grief at the same time as him is the nearest he can get.",
              "id": 42,
              "comments": [
                {
                  "score": 17,
                  "content": "Yeah, I'm really glad that OP's son had his aunt there when he needed her. And it absolutely makes sense that she ended up getting the son/mother dance. I'm sure they had a good bond while he was growing up with his mom, and then she's the one who stepped up for him when he left his home.\n\nStill baffled OP thought his wife, whom his son had no real bond with, was supposed to be the one who got to have the son/mother dance.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I hope op would see this. This is exactly what is happening to my family except my sister and I are adults. I am okay my dad is remarried but his new wife isn't my mom. He can't just marry another woman and force me to treat her as mom.\n\nIn fact, it is a bit insulting to my memory of my mother. She isn't replacable. I can't help thinking my father has replace my mother with his new wife.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "My thoughts exactly. OP, you acknowledge that Jordan never saw Natalie as his mom - to the point where he moved out soon after your wedding. And yet, you EXPECTED she would be chosen for the mother-son dance.\nHis mom died when he was 13. He absolutely remembers her. His aunt took on the maternal role in his life, not Natalie, thus his aunt is the one who earned the privilege of standing in for his mom. As you call her “his aunt”, I’m going to assume she’s his mom’s sister and not yours. Maybe he also wanted the person standing in for his mom to be someone who was close to her.\nWhatever his reasons, it was his wedding and feels he was closer to his aunt. You need to respect his views on his life if you hope for any future relationship.\nYTA.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "OP for sure, I had the same thought. But I wonder if Natalie was at least understanding. It says that she only told OP there would be no mother-son dance minutes before the dance was to happen, which makes me think she knew he would be pissed and she didn’t want him to miss the wedding. \n\nOf course…. It could also mean that she told him then knowing he’d be pissed and insist they walk out, causing a scene…",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "My mother chastised me for not trying to be buddy-buddy with her boyfriend after A WEEK of him moving in, me having met him that same day he showed up (long story). I left as soon as humanly possible. She claims I tried to force her to choose between her boyfriend and her daughter. I am now low-contact with her.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1639,
          "content": "Op answered his own question “Jordan never really considered Natalie his mom” … so no need for a mother son dance. \n\nYTA- trying to force this will only make it worse. I can only imagine you tried to force Natalie into his dead mothers role when he was 16 and that contributed to him  moving out.\n\nYou can’t force people together. You and Natalie both need to accept that Jordan accepts Natalie in his life but not as a mother figure before he no longer has either of you in his life",
          "id": 48,
          "comments": [
            {
              "score": 146,
              "content": "Right? Would be curious if after all of this history, does Natalie really consider OP’s adult child a son?!  I mean it’s totally irrelevant, because if OP’s son says no dance, then there is NO dance. \n\nBut my guess is Natalie likely doesn’t consider Jordan a son and they get some sick kicks out of continuing to push a deep relationship that OP and Natalie both know will NEVER happen. Especially after this BS. \n\nOP - the wedding wasn’t about you and Natalie anyway. Disgusting behavior from you both.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "This. He moved in with his aunt, who has known him his entire life. He had that bittersweet dance with his aunt, who he went to when he obviously didn’t feel he had a home with you anymore. Sounds like he lost both parents through your choices. And on a hugely significant day for him, you let him down. \n\nYTA.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "He MIGHT have accepted her into his life.  Given this tantrum, that ship may have sailed.  They pitched a childish tantrum on one of the most important days of his life",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "This is on point! YTA",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 901,
          "content": "[removed]",
          "id": 53,
          "comments": [
            {
              "score": 321,
              "content": "It’s not “tradition” to have a dance between the mother and groom at all.\n\nThe father-daughter dance is post WW2 and the mother-son dance came much later.\n\nThere’s a good chance OP didn’t have a special dance with his mother and an even greater chance his father didn’t have a dance with *his* mother.\n\nHe went out of his way to ruin his relationship with his son for a “tradition” that’s not much older than personal computers.\n\nEdit for judgement: YTA",
              "id": 54,
              "comments": [
                {
                  "score": 125,
                  "content": "I once heard “traditions are just peer pressure from dead people” and I can’t think of it any other way now.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Also once that you scratch the surface, 90% of \"traditions\" are very recent inventions (even more for weddings).",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I literally never heard of a Mother and Son dance before today 😂",
                  "id": 57,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I think it’s a distinctly American thing, I’m pretty sure it’s never become a thing in the UK at least.",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "My brother danced with our mom at his wedding. I’m Canadian. Mother/son dances are a thing.\n\nEta: Not that OP’s son should have had to dance with OP’s wife!  He is TA.",
                      "id": 59,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 101,
              "content": "[deleted]",
              "id": 60,
              "comments": [
                {
                  "score": 30,
                  "content": "There's also the tradition of not throwing a fit over a manufactured slight and not making someone else's wedding all about you, which tradition OP seems to have totally missed when he was learning the traditions.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Plenty of people don't even do the tradition! Weddings can be different based on the different preferences of the people involved, and that's fine! OP did not even have to take this as a rejection of his wife - simply a lack of preference to have this tradition.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 880,
          "content": ">Jordan never really considered Natalie as his his mom\n\nIt's literally right there, but OP expects his wife to have the mother and son dance?\n\n> I said it's not special treatmrnt but a tradition. \n\nTo have a dance with someone you dislike, at your own wedding day?  That's a new tradition to me.",
          "id": 63,
          "comments": [
            {
              "score": 437,
              "content": "Technically he did follow tradition either way. He danced with the person he saw as the motherly figure in his life since he didn’t have the option to dance with his actual mother.",
              "id": 64,
              "comments": [
                {
                  "score": 60,
                  "content": "That tradition I get and love.  I don't get the idea of a forced relationship, where the groom *has* to dance with someone who he doesn't see as his mother.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Oh I very much agree. I’m just saying that the father can’t even use the tradition excuse here. The son did the dance with the person he most views in that light.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "Also, the person who probably was closest to his mother and closer to him through his childhood.\n\nAnd I have to wonder how fast dad started dating after his mother's death. He was already married in three years",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Exactly. It’s a *mother*-son dance.  The person who fulfills the role of “mother”, and the groom. I have 3 stepsons whom I met when they were 9 (twins) and 11.  They’re all young adults now. I love them and they like me just fine but I would *never* try to force my way into the “mom” role with them. I foresee a wedding for one of them soon and I am bowing out gracefully to the sidelines unless I’m asked specifically to do something.  If that includes a “stepmom and son” dance I’d be honored but do  i expect it? Hell, no. (Their mom is still alive btw so double hell no).",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Yep.. OP doesn’t specify but I wonder if his aunt is his mothers sister. She would have been a bigger connection to his mother and likely grieved with and supported him from the age of 13 when is mother died. Not 16 when the stepmom turned up.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "THIS! Hey OP it's extremely selfish to force this on your son especially when you mentioned that HE MOVED OUT TO LIVE WITH HIS AUNT a few months after Natalie was married to you. And your son is right, it's his wedding, he's allowed to be selfish on his own wedding day. He can dance with whoever he wants to and reject whoever he wants to. YTA and I won't be surprised if your son goes no contact with you after this.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Am I the only one who thinks it's weird that this would have come as a shock to OP and his wife *on the day of the wedding?* Wouldn't you explicitly know if you were going to be included in the wedding in this way well before hand, and not having been explicitly told you're going to be having a mother-son dance would have communicated that you will *not* be having a mother-son dance?",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 802,
          "content": "[deleted]",
          "id": 72,
          "comments": [
            {
              "score": 338,
              "content": "Step mom started it when she went crying to OP.",
              "id": 73,
              "comments": [
                {
                  "score": 201,
                  "content": "I mean, wouldn’t that have been pre-arranged anyway? Don’t the bridal party generally discuss ahead of time if there are going to be special dances? Sometimes there’s even rehearsal. This shouldn’t even have been a surprise if they hadn’t heard in advance one was scheduled.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 44,
                      "content": "For real! Song selection, style of dance, and so much more goes into it.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "There absolutely are, especially when one parent is deceased. \n\nFor my uncle's wedding, his older sister gave a speech in their late father's place, including all the advice she got from dad on her wedding day (not a dry eye in the whole room, let me tell you).\n\nFor my aunt's recent wedding the groom's uncle stepped in as his deceased father during some games, that are played traditionaly at midnight at Polish weddings. Uncle has been a parental figure, since groom's dad passed young.\n\nThose can be beautiful gestures and symbolic recognition of other parental figures during weddings, but they have to come from the person who lost their parent and discussed beforehand.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Notice how the OP said he and his wife were \"invited to the wedding,\" not part of the wedding party.\n\nOP just ASSumed that his wife would automatically be the one to dance with his son just because she's married to the OP.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Yes - my son and I had a conversation about music, timing (Rainbow Connection was what he picked) and made it clear that even though the DJ put down parents' toast, they weren't planning on doing that part.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Wow, this just made me realize the level of involvement OP has in his sons life if the mother son dance thing surprised him. It sounds like OP isn't an active dad at all, and probably never was.",
                      "id": 79,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "Yes but prearranged does not mean everyone in attendance knows. The aunt probably knew she’d be dancing in the mother/son dance, but I’d guess when the deejay announced time for that dance, SM bustled over and realized that wasn’t how it was going? Since the dad and SM were only guests they wouldn’t be privy to who’s dancing when, though you’d think being adults they’d know neither was meant to be involved if they hadn’t been asked.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Was she crying? This was minutes after it happened, but it sounded like Stepmom mentioned it in passing and Dad who clearly wasn't paying attention or he would have noticed his son dancing with Aunt. OP is the one who seems to care. Of course she would leave with him when he got butthurt, he's her ride",
                  "id": 81,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 325,
          "content": "If I was the son I would think real long and hard if I would even want to repair this relationship after OP’s tantrum over his wife’s poor feelings getting hurt.  I will give a clue on what in store for the son in the future…. If he has kids, she must be called “grandma” and treated as such. They will get overly involved with the kids as “grandma” needs special time with them to bond (I’m going to assume stepmom doesn’t have kids of her own). She needs to be front and center at all major milestones citing her place as the matriarch of the family. If the aunt or MIL gets to see the kids more, expect another tantrum about how it isn’t fair as she is just as much a “grandma” as they are. \n\nIn other words, the son is in for a lifetime of overstepping by OP and the wife in order to preserves her precious feelings.  Personally I would nope out of the whole relationship.",
          "id": 82,
          "comments": [
            {
              "score": 44,
              "content": "this sounded more like it was OP pushing the fight to me, but the kid left home at 16 they don't do that without a reason. She might be the problem but I have a feeling OP was more offended by this then his wife was.\n\nand I got that read off of what OP said happened I have a feeling if we hear his sons side he doesn't come off as neutral asshole but more like full on asshole. TYA OP.",
              "id": 83,
              "comments": [
                {
                  "score": 19,
                  "content": "Oh I agree he is the one pushing it.  Everything I said above could be coming from OP and not the stepmom.  He is the one who could demand all that on her behalf. Although I do believe she is complicit as she was the one assuming they would dance and then had to tell him she wasn’t.  Unless he lead her to believe that, which is entirely possible.  However, if that was the case, as Natalie I would be so pissed at OP to put me in that position and would not have left and told him to calm down at the wedding.  I think she is right along for this ride.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 181,
          "content": "There's a saying in my country that says \"a man is only a father when he is with the mother\" because man will forget their children when they are not with their mother, but will adopt their stepchildren as their own, because they are now dating the stepmother. YTA",
          "id": 85,
          "comments": [
            {
              "score": 28,
              "content": "That sounds very apt in this case, there may not be step-children but OPs son clearly doesn't matter to him as long as his wife is happy.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "The first Christmas I had when my dad had gotten a new girlfriend I ended up feeling really emotionally abandoned.  And I felt bad about that, since I was jealous of the little kids he was playing grandpa with.  A thirtysomething shouldn't feel jealous of little kids.  But he was also the only family I had left within a 10 hour drive, and I felt replaced.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "This is one of the realist things I have read on here. My own father who I live with doesn't treat me the same since he had kids with his new wife. I'm just good at providing free childcare for them. That's 100% the only reason why they allow me to live with them.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "Not even just for throwing a fit at the wedding. It’s the entitlement OP and his wife have. His mom isn’t just, living in a new state, he can’t just call her and talk whenever, she *died* and OP and wife is acting like it’s no big deal. Dude, your kid wasn’t 6 when she passed, he was 16. You can’t just bring someone new in & force your kids to call them mom. Expecting him to do it without question is absurd. Frankly, I think you and your wife ruined whatever relationship you had with your son. Thank goodness he has the rest of his family to back him since his dad won’t.",
          "id": 89,
          "comments": [
            {
              "score": 18,
              "content": "The entitlement from both of them is incredible. You can't just replace a parent with a new one, like someone getting their child a new puppy.  There seems to be no self awareness on the part of the OP or his wife.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I have learned a lot from this sub.  \n\n\n1. Never have a wedding.\n2. I am 100% glad I never had kids.\n3. I can let got of my impostor syndrome, thinking \"maybe I'm a fake adult, I'm not very good at it!\" This is because it seems like most people are not really good at it, and probably most of us are internally screaming and thinking \"fuck... FUCK... I don't know what the fuck to do\" a good chunk of the time.\n4. Humans are why humanity cannot have nice things.",
          "id": 91,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "Such as pushing another woman on him as his new mother from before they got married for example? Just reading the title gave me the bad feeling of why OP left and after seeing that his son moved out in a matter of month after OP got remarried only puts the cherry on top of pile of crap OP pulled at the wedding\n\nLike his son said, his wedding and his choice. OP gets no right to insist his second wife gets the dance and to leave in a way that everyone noticed was nothing more than an attempt to take attention away from the bride and groom. \n\nYTA. Grow up and act like an adult OP. If your son has anything to do with you after this, consider yourself very lucky after this stunt",
          "id": 92,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14620,
      "content": "YTA\n\nShe was NEVER a mother figure to your son…in fact, he showed you EXACTLY how he felt about her when he MOVED OUT once you moved her into his home. \n\nHe was kind enough to invite you and your wife to his wedding…but your wife had ZERO right to demand to be treated, in ANY capacity, as the mother of the groom. \n\nShe is not a replacement mother to him and your attempts to force that issue will cost you your son, if he hasn’t already reached that point with your terrible behavior at his wedding. \n\nThankfully, he had his aunt, who genuinely loves and cares for him and was willing to support him when you decided that your new wife was more important to you than your son.",
      "id": 93,
      "comments": [
        {
          "score": 3989,
          "content": "What makes him an even bigger AH is:\n\n>Besides that he hurt her feelings for no reason other than for the sake of being malicious. \n\nOP's son was honoring his aunt who took him in as a teenager and all the OP can think was that he was being \"malicious\"? OP doesn't deserve to be included in any future life events for his son and his family if he is going to act like an entitled, selfish AH.\n\nOP and wife need to get over themselves!",
          "id": 94,
          "comments": [
            {
              "score": 963,
              "content": "OP has main character syndrome",
              "id": 95,
              "comments": [
                {
                  "score": 264,
                  "content": "Really true. The audacity of thinking this decision had anything to do with OP's wife at all.",
                  "id": 96,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 253,
              "content": "That killed me too. Really shows where OP's head is. Anyone who thinks someone's wedding decisions are meant to be malicious and not just a personal choice for how they want their special day to go, is a narcissistic idiot.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 170,
              "content": "OP really glazed over that his 16yo son effectively fled his house. It isn’t normal for a 16yo to voluntarily move out like that and I feel like there’s a lot here we aren’t being told",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "An aunt who may have been his mother's sister. That would have made her his mother's blood stand in, in addition to honoring her role in his life after he fled his father and father's new wife.",
              "id": 99,
              "comments": [
                {
                  "score": 13,
                  "content": "I'd say like 99% mother's sister. It's not OP's sister or he would have said that.",
                  "id": 100,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "This was the worst part. What was malicious? He didn’t do it to hurt anyone, he danced with his mother figure.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "This. OP has completely lost the plot",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "This!! Is it just me or is it being glazed over that she asked for a mother son dance. She was denied meaning she probably asked for one. She knows damn well she's not even lived with him to be a step mom role let alone get a mom role. She didn't raise him at all. She needs to humble her damn self. Also why is dad okay with picking step mom over son??? My kid would not be leaving to live with an aunt. Kids come first",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "That’s where I felt the AH title fit the most. Father feeling like the stepmom deserved the dance more shows extreme entitlement. The son wasn’t showing malice at all. Since the relationship was just beginning to develop before the wedding, he probably would have danced with stepmom too, but not in place of aunt. It wasn’t about OP and his wife!!!",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Seriously. OP was the only person being malicious - purposefully causing a scene at his son's wedding, over a perceived slight. It's insane that he thinks otherwise.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1154,
          "content": "So true! I think it showed a lot of maturity that the son has been trying to have a better relationship with his stepmom and he invited both of them. That's awesome! Now with the way dad and stepmom have acted, this relationship will never be close. It's unfortunate. Thankfully he has his aunt!",
          "id": 106,
          "comments": [
            {
              "score": 399,
              "content": "It sounds like Jordan has respected his father’s choices…too bad that OP can’t show Jordan the same amount of consideration and respect.",
              "id": 107,
              "comments": [
                {
                  "score": 134,
                  "content": "Absolutely. It's wild to me the dad and stepmom blew up the relationship with his son over this.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I'm giving a lot of credit to his mom and then his aunt for raising a man who was willing and able to take the lead to develop a better relationship with his father's wife. That's extraordinary considering dad sounds like an AH and the young man suffered quite a bit of loss (mom, effectively dad who chose wife over son, and then his childhood home) in his formative years.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 200,
          "content": "Exactly!\n\nThe entitlement of these two is off charts! Like, OP himself knows that he doesn't see his wife that way and even years after that he keeps pushing it. \n\nFeels like he tried his son to just accept the fact that now he has a new mommy, but thankfully the son had a place to go. Disgusting from both OP and wife.\n\nWhy the hell would she ask for a mother-son dance when he is NOT her son? \n\nYTA",
          "id": 110,
          "comments": [
            {
              "score": 11,
              "content": "We don't even know Natalie cares! For all we know, OP just went \"Why aren't you doing a mother-son dance with Son\" and Natalie calmly went \"Oh, he's doing one with Auntie\" and OP just saddled up and went off to tilt at a windmill.",
              "id": 111,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Not to mention, he moved out of the house a few months after their wedding, he first MET her when he was 16... Kind of sounds like they married when he was 17 plus, and he moved out the second he legally became an adult. Which makes this whole story even more ridiculous! The son was even older than the first read of the story would imply!",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8176,
      "content": "Wow.  YTA.  Way to make your son's wedding all about you and your wife.  You already said that he never considered her his mom, so why in the hell did you expect him to invite her to do something that is traditionally for mothers and sons?  For all intents and purposes, his aunt is a hell of a lot more of a mother to him than your wife.  You are selfish, entitled people.  Disgusting, and you should be ashamed.",
      "id": 113,
      "comments": [
        {
          "score": 1286,
          "content": "Welp, any progress that his son and wife made in developing any shred of relationship has been flushed down the drain.  OPs relationship with his son will never recover what it was. He LEFT his own sons wedding.  Jesus Christ. If he thought shunning his son at his wedding was ok, it makes me wonder how many times he has done it in the past…. Thank goodness his son has a loving family outside of this horrid parent.",
          "id": 114,
          "comments": [
            {
              "score": 355,
              "content": "It's absolutely heartbreaking to think about OP's son, how mature he was inviting his dad and step mom, giving them another chance.  This was a major.decision. He gave them the chance to make it right after so many wrongs. Instead , they pile on another.. OP and his wife are major AHs.",
              "id": 115,
              "comments": [
                {
                  "score": 83,
                  "content": "YTA, and totally agree.  Things had to have been pretty bad for the kid to have moved in with his aunt, and he was making a big effort with the invitation to the wedding.  This affirms his judgement in moving out as a teen that getting away from OP and wife was the healthier choice.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "The dad alone saying they were “invited” is automatically odd. It sounds so impersonal and unnatural. I understand everyone gets invited to a wedding, but this sounds like they were an option instead of how parents are typically at their child’s wedding by default",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "At least now he knows and never has to wonder",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "This will not end well for the dad. What a classless act to walk out on his son's wedding. Good luck mending that relationship.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I know right, The audacity of some people.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yeah I really wonder just how much son kept putting his best foot forward and OP kept screwing it up. I am certain this is not the first instance, but one of MANY. OP and stepmom are probably the same type of people who talk about how terrible it is for their kids to cut their parents out. I wonder why???",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 91,
          "content": "Which just made me think about how difficult OP's entitlement and his wife's behavior is going to be when Grandchildren enter the picture.\n\nOP, don't you DARE try to force him to have his children call Natalie Grandma or any other honorific. You truly destroyed any chance of that with your drama at his wedding. You've behaved like a petulant child who didn't get the wish bone at Thanksgiving. You made the decision to walk out of your son's wedding reception because he didn't honor your wife as his Mother? She's your wife - she has NEVER been his mother and you two likely just destroyed any future possibility of her being perceived as a Grandmother given you two just proved to him and his wife that you do not respect their boundaries or choices.",
          "id": 122,
          "comments": [
            {
              "score": 33,
              "content": "I doubt they will even be in the picture.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4071,
      "content": "YTA\n\nI find it so hard to believe you’re so surprised. This woman hasn’t been mom to him. It’s his wedding too. \n\nIt’s not tradition to dance with your stepmother.",
      "id": 124,
      "comments": [
        {
          "score": 526,
          "content": "It's his wedding. End of sentence. Not too. The wedding is the bride and groom's, if you don't like the decisions they make about their own wedding... Shut the fuck up. You ignore the things you don't like because you're there to support your son, on his and his wife's day. The step-mother should graciously accept an offer to dance if given, if not, she should not be asking for one or be upset when one doesn't come. This is something that can easily be talked about before the wedding day.",
          "id": 125,
          "comments": [
            {
              "score": 121,
              "content": "I think they meant that, in addition to the first point (that the wife was never his mom), it was also his wedding (as a second point). I think the \"too\" is meant to convey the second point, rather than them implying than it being OP and his wife's wedding in any way.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 370,
          "content": ">It's his wedding\n\nWedding dances aren't spontaneous. People who will be involved are notified in advance and sometimes there's even dance practice. \n\nThe fact that this guy just *assumed* his wife would be given this honor without any notification from the wedding party shows his entitled attitude and lack of understanding of his own child. \n\nNot only was he a rude guest, he did real damage to his child and their relationship.",
          "id": 127,
          "comments": [
            {
              "score": 103,
              "content": "Oh snap great point! Did they think he’d call her down like she was on the price is right??",
              "id": 128,
              "comments": [
                {
                  "score": 15,
                  "content": "Best comment - \"come on down\"!",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "I was looking for someone to say this. When done right, these wedding day decisions are planned way ahead. OP is acting willfully oblivious.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "True. OP must know how weddings work, having had two of them..",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yes, our DJ wanted specific song choices and needed to know how we wanted the special dances announced.  My husband's mother died when he was a young adult and he chose to have a groom's dance with his sister rather than foregoing it completely.   We made all of those arrangements well in advance.\n\nHis father's partner was a lovely woman who had zero expectations of being included in FIL's kids' life events beyond attending with him, due to the fact that they were in their 20s when she came into their lives.   There were no assumptions and both she and FIL allowed his adult children to determine how involved she would be, especially once grandchildren started to arrive.   My husband asked her to light a special candle with my mother before our wedding ceremony, and she was very touched by the gesture.\n\nSadly she also died about 7 years later.  We and our daughter were named among her survivors in her obituary, and my husband was a pallbearer at her funeral.   He genuinely cared for and loved her by then, but she was not his stepmother.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Another reason why it shouldn’t have been a surprise is that nobody talked about doing it in advance. Presumably stepmom and son would’ve had discussions about it before the wedding. Yet they didn’t. That should’ve been enough notice that it wasn’t a part of the plan.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3082,
      "content": "Extremely huge YTA\n\nA 16 year old is not going to form a new mother relationship. He oughtnto be respectful and civil to your wife but that is the end of his obligation.\n\nYou are a complete ass for walking out of his wedding",
      "id": 134,
      "comments": [
        {
          "score": 404,
          "content": "This.    I was 15 when my dad and my stepmom got together.    I genuinely like her, she’s a nice lady, I enjoy her company at family get togethers, but she never raised me, so I don’t view her as a mother figure.     I think it’s pretty normal when people weren’t children when the stepparents came into their lives not to view them as a parental figure.",
          "id": 135,
          "comments": [
            {
              "score": 32,
              "content": "my dad and stepmom got married when i was 16. i love her, she’s great and has become somewhat of a mother figure over the years, but she’s not going to ever be my mom and she knows that. i even made a joke at their wedding rehearsal about how i wasn’t going to call her mom, and we both laughed about it. it’s ridiculous for an adult to expect a teenager, especially an older teenager who’s almost an adult themselves, to accept them as a parental figure when a pre-existing parental figure was present in their life for so long. i feel so bad for op’s son, nobody deserves to have a stepmom like that",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "And now the big story from his WEDDING DAY is his father and stepmother stealing all the attention and concern over this. Even if they never speak again, his son has to have this memory associated with his wedding. It’s fucked up.",
          "id": 137,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "I lost my mother when I was 14 and had a stepmother since 17.\nIt took 10 years, and while I don’t see her as my mom, she definitely is a motherly figure to me that I genuinely like spending time with and who I call for advice on life.\nShould I have kids, she‘d fully be their grandmother if she wanted to.",
          "id": 138,
          "comments": [
            {
              "score": 24,
              "content": "If step parents don't push to be considered a parental figure, it's easier for that to develop over time. I bet OP and step mom pushed from the start for this kid to consider his step mom his mom and he was tired of them ignoring his boundaries.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "As a Stepmother myself, I just want my kid to be happy. I do my best and I know my place. I would never come between my step daughters relationships, and I wouldn't fathom making her feel guilty or upset. I love the kiddo. \n\nFor fucks sake OP, YTA. \n\nAlso, I had a wicked stepmother from hell, and my dad always took her side no matter what fucked up things she did to me, and well guess what, I went no contact with them and we haven't spoken for 7 years. They have no idea why at all, and think I'm selfish and ungrateful. \n\nOP always go with your sons side.",
          "id": 140,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2842,
      "content": "YTA - It’s called the mother-son dance not the father’s wife-son dance",
      "id": 141,
      "comments": [
        {
          "score": 799,
          "content": "And the aunt, if it was mom's sister, is the closest thing. Plus he lived with her. Poor kids obviously didn't like the marriage situation since he left. Dad just moved on and doesn't appreciate his sons feelings about any of this. Also this stuff should have been discussed during planning, not surprising the groom on his wedding day with this ridiculous expectation.",
          "id": 142,
          "comments": [
            {
              "score": 211,
              "content": "Exactly this. His aunt is as close as he can get to his mother. No doubt he was thinking about her the whole day and the dance itself would have been highly emotional. To 'make a scene' by walking out is only going to heighten this. It was an act of breath-taking insensitivity and selfishness. In my opinion, it's unforgiveable. YTA.",
              "id": 143,
              "comments": [
                {
                  "score": 30,
                  "content": "Well said. Not only that but to call him days later to complain and say he broke with tradition is yet another step over the line. I feel horribly for the groom.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "This. Who blindsides someone with something this emotionally charged and selfish, the day of a very emotional event? I don't know what kind of Hallmark movie this woman lives in, but I hope to never see it.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2339,
      "content": "YTA\n\nYou made your son's wedding about your wife. Congrats on destroying your relationship with your son for *tradition*.",
      "id": 146,
      "comments": [
        {
          "score": 1057,
          "content": "Tradition is just peer pressure from dead people anyway.",
          "id": 147,
          "comments": [
            {
              "score": 73,
              "content": "Really love this statement.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Fuck wedding traditions.\n\nWe raised our kids to be skeptical of traditions for these very reasons. Our son got married last year, and he and his then-bride were very interested in doing what caused the least amount of stress for them and others and in doing what was actually meaningful to them and their families (and my wife and I fully supported that). \n\nHis now-wife's upbringing is complicated: her parents were in an arranged marriage at age 13 (yes, in the US, very conservative Christians), later divorced, mom came out as gay, dad has a lot of personal problems now.\n\nHer dad initially said he would attend, and the plan was for him and her mother to walk their daughter down the aisle together. So, we were already planning to depart from \"father giving away his daughter\" tradition. Due to his personal issues, he flaked (which was not a surprise, unfortunately). Her mother was very nervous about walking her daughter down the aisle by herself. So, what did we do? My wife and I walked our son down the aisle, mom walked her daughter down the aisle. It was beautiful, meaningful and avoided stress.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "I mean, even the tradition is \"mother and son\" dance, not \"*whoever-your-dad-is-married-to-at-that-time* and son\" dance.",
          "id": 150,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "Dancing with someone your parent married when you were nearly an adult isn't even a tradition",
          "id": 151,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "Especially because it is not traditional to dance with a step mom",
          "id": 152,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1537,
      "content": "She didn't raise him for the majority of his childhood - his mother was there for that.\n\nIt's reasonable that even if he likes her, he does not see her as his mother because he remembers and misses his mother.\n\nThe fact that you remarried does not make your new wife his mother and if he didn't want to dance with her, he didn't have to \n\nYTA",
      "id": 153,
      "comments": [
        {
          "score": 537,
          "content": "She didn't raise him at all. He moved out after the dad and her got married. She's just his dad's wife to him at this point.",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I bet he either refers to her by her first name, or \"my dad's wife\" and not his stepmother.",
          "id": 155,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1360,
      "content": "YTA. Natalie is just your wife. She is not your son's mother. It's not a \"tradition\"  for your son to dance with someone whom he does not consider his mother.  Don't force your personal decisions on someone, especially when it is his wedding day.\n\nAlso, don't count on seeing any future grandkids very often, if this is your attitude. You made it clear you value your latest wife more than your son.",
      "id": 156,
      "comments": [
        {
          "score": 86,
          "content": "Yes! Dad’s wife is sooooo not the same as Mother of the Groom!!!",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "Even if it was a tradition, traditions aren’t mandatory. You can decide which traditions you wish to uphold.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "And I hope he doesn’t force his grandkids to accept her as their grandma too. I guarantee you that the son will not be letting her be grandma.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1044,
      "content": "16 is *WAY* too old to expect a kid to treat a new step-mom like a second mother lol, yeah yta",
      "id": 160,
      "comments": [
        {
          "score": 228,
          "content": "Any age this shouldn't be expected!",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "Honestly, at any age it's the child's choice whether they see their step parent as a second parent. IMO.",
          "id": 162,
          "comments": [
            {
              "score": 12,
              "content": "Yeah for sure, I guess I didn't make that clear enough. Regardless of age, it may never happen. But if it *is* going to happen, I assume the chances are higher the younger the kid is.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}