{
  "post content": "\nMy wife (27) and I (27) have a 4 year old son, we've been having an incredibly busy work schedule of the last 2 years and family's been doing a great job helping out with our son.\n\nwe usually have members of my inlaws take our son whenever we have a work trip or a shift coming up. from my wife's mom to her sister to her dad except for my 31 year old brother in law (wife's brother). He's made it clear he is just not interested in spending time with his nephew, keeps saying that the reason for that is that he's actually \"child free\". for so many emergencies he has turned me and my wife away when we begged him to watch our son  and he didn't even budge or apologize for his attitude.\n\n\nit all came to head a couple of days ago, I had a work meeting while my wife was out of town and my inlaws were attending a wedding so no one was free to watch my son except for my BIL. I showed up to his place and told him I was desperate for help and needed him to just watch my son for 2 hours. he refused, even suggested I take him with me to work but that's not a good suggestion. I begged him and he just said no. I had enough I confronted him and asked why? does he not like his nephew and he threw that \"no it's just that I'm child free\" excuse which made me lose it. I told him to just stop because it's cringe of him to keep saying that and use it as an excuse to be unsupportive of me and his sister and cold towards his nephew. I told him he should really do better and stop being so negative but he got mad and said I had no right to disrespect his lifestyle/choices but it's the attitude that gets me. we had a exchange of words where he said my son isn't his responsibility whatsoever then I left.\n\n\nhe complained to my inlaws and they \"called me out\" for disrespecting their son and treating him like that. They insisted that he's not responsible for my son and I shouldn't expect so much from him then guilt him about it. they wanted me to apologize and my wife said I should but he was about as helpful and supportive as a rock so, I decided I will take my time before I consider apologizing.\n\n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 44916,
      "content": "YTA\n\nFor fucks sake, how entitled are you? Your. BIL has been clear about who he is and what he won’t due, but because that’s not convenient to you, you feel you can disrespect you. \n\nThis is a failure of your organization. How can you guys not have a sitter? I am a single dad and never ended up in your situation, because I planned for it.",
      "id": 2,
      "comments": [
        {
          "score": 18567,
          "content": "I bet they don't have any paid sitters on their roster.\n\n I mean, how on earth could you NOT want to spend 8 hours with a fussy toddler and changing diapers? For free? Because they're just sooooooo cute!",
          "id": 3,
          "comments": [
            {
              "score": 19507,
              "content": "Right? Who wouldn't want to provide free babysitting 24/7 when the toddler is this cute? Who??? /s\n\nYTA. I don't care about the childfree thing, OP. What he said isn't the problem, because he doesn't need an excuse to not babysit someone's child. He's your kid and your responsibility. Even if you have emergencies, is it so hard to pay for a sitter?\n\nThe entitlement and irresponsibility here is jaw-dropping.\n\n* You are not arranging proper childcare for your son, although it's shockingly easy.\n* You are not planning for emergencies.\n* You are forcing someone who is a) unpaid, b) unwilling, and c) unhappy to babysit your son, without consideration to their needs and wants.\n* You are taking others' free work for granted.\n* You are disrespecting people who gave you tremendous favors.\n* You are blaming others for your lack of planning.\n* You are disrespecting a reasonable boundary that was expressed multiple times.",
              "id": 4,
              "comments": [
                {
                  "score": 5152,
                  "content": "that’s what good aunts and uncles do, ESPECIALLY ones who don’t have their own kids, because they have so much free time to just sit around. why wouldn’t they want to spend it with their siblings toddlers, for free? /s\n\nsidenote: as someone who gets paid to hang with toddlers, and doesn’t have my own children, toddlers are cool. would not kick it w/ them without compensation. compensation mandatory.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2035,
                      "content": "I like kids ok (I don't want any of my own though) I don't care who comes to my home unannounced, they ain't getting in.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 660,
                      "content": "I have a toddler. Get paid to teach 5th graders. I still don’t want to babysit other peoples kids because that shit is hella overstimulating for me. It’s not the same as a classroom/school environment",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 168,
                      "content": "1000% I worked with kids for about 10 years, first as a camp counselor then swim instructor. I have no plans of having kids or taking care of kids without compensation.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 96,
                      "content": "What gets me too is I wouldn’t WANT someone who doesn’t want to watch my kid to watch mine! I don’t have kids but I would never have someone who isn’t happy to care for my snake to care for her while I’m gone and that’s WAY easier and less time-consuming than taking care of a whole-ass toddler. It’s super irresponsible to give care of a kid you’re in charge of to someone who’s less-than-enthusiastic about it, especially without compensation.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "My sister in law has a bunch of kids, she *loves* them and has trouble understanding that maybe not everybody else likes her kids as much as she. She also knows that I love kids, and that I love her kids specifically, and love spending time with them.\n\nShe has also never *ever* asked me to babysit because she and her husband had to work. You know why? Because they *planned how to deal with childcare* before they had them. So this problem just doesn't come up.\n\nYTA OP.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 28,
                      "content": "I like well behaved kids and I love my nieces. I have no kids of my own. I have no problem with kids who aren't little jerks. That said, I'd straight up close the door in someone's face if they didn't respect me saying no to watching their kid or took advantage of me agreeing one time and expecting me to be available last minute all the time, with or without pay. I'd happily help out in an unexpected emergency or occasionally watch kiddos with advanced notice and proper compensation (for any kids other than my best friend's son or my nieces, I'd do it for free.) Thankfully no one asks but I know if they did and I declined they'd respect it. \n\n\nThat said, I watched my 4 and 2 year old nieces last week for only AN HOUR and it took me days to recover.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "My kid was a toddler once. \n\nCompensation would’ve been nice.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "We have 3 older teenagers and 1 toddler. Hell no I won’t watch someone else’s kid, I have enough thank you. IF the teens watch Hurricane Toddler, they are compensated very nicely. Toddlers are like little drunk adults with limited language skills. \n\nPlus, who wants someone that doesn’t want to watch kids to watch their kid?? That’s so weird to me…",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "I love my niece to death and she's so sweet with my son. I still charge to watch her.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Heck, my sisters are amazing aunts and I still pay them whenever they babysit for me (which is rare, I have daycare and a teenager next door who always wants babysitting jobs). \n\nAnd this wasn't like a life or death emergency.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2118,
                  "content": "At first I thought it was annoying how BIL kept mentioning being child free, but tbh it’s more like “I made the conscious choice not to have to parent children because I don’t want to. You have no right to force me to parent children.”  YTA",
                  "id": 16,
                  "comments": [
                    {
                      "score": 1024,
                      "content": "I really wonder if BIL keeps bringing up being child free because no other reasons have worked.  I’m getting the feeling OP would not respect “I don’t want to” or “I have plans” so BIL’s simplified his response down to “I don’t want to be with kids”… which of course OP still ignores.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 405,
                      "content": "Exactly. I'm also child free. I'm not good with kids. Never held a baby. The only kids I liked were my two best friends' little sisters when I was a kid. But that's it pretty much. If someone chooses to not have them, they might not want to be around them let alone responsible for them.\n\nYTA massively OP",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 258,
                      "content": "[deleted]",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 41,
                      "content": "Yeah and how he won't help out during \"emergencies.\" At first when I read that I'm thinking emergency = wife broke her leg gotta go to the ER or parents are sick/got hurt, etc. And I'm like yeah, that's kinda crappy.\n\nThen it becomes \"I had a last minute work meeting and don't have a backup sitter even though I knew parents and wife would be out of town\" = emergency and I was on BILs side. \n\nIf your kid is around and you're\" working from home\" 90% of the time you aren't working. Before the big C I worked places that had WFH. And parents either had a nanny come to the house or took their kids to daycare. So if this was the case, OP should have signed up for PTO that day if he didn't have someone to watch the kid. \n\nAlso, in my company, people have been a lot more understanding to how life is now. We had a VP of a fortune 500 company do an All Hands with his dog losing its mind and he's like \"Uh, sorry.\" I've also seen lots of kids on laps during Zoom calls. Now, not every company has been as good as mine about it. And our leadership 5 years ago would probably have been jerks about it. But I think overall most places are more understanding, so by NO MEANS was this an emergency.\n\nAnd finally... BIL is probably so hands off bc he doesn't want to get abused watching this kid all the time. It isn't the kid, it's the parents.\n\nEnd rant haha.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "Lol right, if I was constantly being asked to babysit for free with little notice I would be making it it clear on the regular, too.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I think BIL is noping the F out of the whole situation. He might love kids and have 10 of his own someday but no way does he want to be on-call childcare for these chaotic-failure-to-plan-and-it’s-everyone-else’s-problem-parents. I have a feeling if these parents didn’t have a car or roof over their heads, he would be a “carfree” or “spare bedroom free” person too.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Yeah I thought the same thing too, it’s your child your responsibility. It sucks but respect peoples boundary no matter how silly they sound to you",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 999,
                  "content": "> Even if you have emergencies, is it so hard to pay for a sitter?\n\nIt sounds like they are constantly having \"emergencies.\" If they know their work schedule is hectic, they should have a plan in place for when both of them are busy. That's a completely normal thing to anticipate when you're a parenting team where both people work. The fact that they have no contingency plan for if they both have work obligations is ridiculous.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 328,
                      "content": "Some people have different definitions of the word \"emergency\".\n\nFor my SIL, it meant that someone drank the last Diet Coke in the fridge before she could.  For my mom, it meant a body part was hanging on by a thread.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 80,
                      "content": "It sounded like he knew their schedules (a trip and a meeting) however he  is so entitled he thought he could just call anyone of the unpaid relatives last minute to watch their child. \n\nI’m not clear on why all of the relatives are on board with this and why they don’t have some structured childcare plan in place. And to show up at his BIL with their baby is appalling. I’m leaning toward this is a regular occurrence.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 42,
                      "content": "Exactly what I got from his language too. They know what they’re doing, they’re taking advantage of people. It’s literal work taking care of a kid. It’s not someone else’s kid. Pay the person who’s doing the work.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "I KNOW !!! like what’s the definition of emergency? Normal regular work meeting??? LOL \nWhen my son was rushed into surgery I got and paid a teenager close by to look after his sister because I don’t mooch off of relatives. YTA .",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "Oh they have a contingency plan: someone else will do it for free!",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "Yup. The only type of “emergency” where it would be reasonable to expect this BIL to watch their kid is one that put his sister in the hospital.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Yeah, having a meeting while your wife is on a trip and your in-laws are otherwise occupied is not an emergency; it's an inconvenience. *Emergencies are life and death. That's what makes them emergencies.*",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "I think the phrase you're looking for is;\n\n\"A failure to plan on your part does not constitute an emergency on mine.\"",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 324,
                  "content": "And on top of that: trying to subject their *child* to the care of someone who doesn't want to babysit, which isn't fair or respectful to the child either - even little kids pick up on being an unwanted presence.\n\nEdit: definitely YTA to OP.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Right?! Why would you want someone to watch your child if they are so adamantly against it? I’m child-free by choice and I would watch my niblings, but that’s my choice as well. He has the choice not to!",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "This is a great answer. I have never minded watching my sister's children. My sister would do anything for me and I for her. Our mother on the other hand is a NO-GO. She made it clear that didn't want us and especially didn't want to watch my sisters kids. During a holiday when all the family was gathered I overheard a conversation between one of the children and \"Nana\" that went something like. The four year old was going on about Dora the Explorer or some awesome show she watched recently and her Nana turned to her and said \"What could you possibly have to say that I would have any interest in?\"  Child cries we tell her \"Sorry baby Nanas mean\" Do not leave your children with people who don't like them. YTA",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "I wouldn't consider work meetings \"emergencies.\"",
                  "id": 36,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "All this, plus a total disregard for the child’s unhappiness at being dumped with someone who doesn’t want to take care of him.\n\nI’m NOT suggesting that BIL would abuse or neglect the child in any way.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Also he just shows up randomly at his BILs house desperate for someone to watch him right at that time? I agree with all of your bullet points, but unless someone is literally dying, I think just popping in and needing him to watch his child then and there adds to how ridiculous this is.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 508,
              "content": "I mean he's 4 so not a toddler and very unlikely to be in diapers 🤣 but other than that I completely agree. Just put the boy in preschool like any other normal parent, it does their development so much good anyway. Why would OP even want someone who is actively avoiding his son babysitting? That's a recipe for disaster a d shitty fucking parenting",
              "id": 39,
              "comments": [
                {
                  "score": 317,
                  "content": "I wouldn't be surprised if be was in diapers. He seems to be tossed around like a hot potato, and things like potty training etc require a lot of repetition and stability. I don't think the family is taking a  collective effort to teach the same skills to the kid over the same period of time. For the sake of the child I hope I'm wrong.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "Not a toddler, a freaking preschooler. He's had 4years to figure out a regular care system for this kid and unless he's medically fragile the kid should be in preschool. If the grandparents are the regular sitters, there should be a plan in place when they are unavailable, like a paid backup sitter or NOT one of the parents being out of town.",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "If that 4 year old is still in diapers, they have bigger problems than free babysitting.",
              "id": 42,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "The problem with using family as child care is that the family is always doing this labor for free.\n\nI did this every day for almost 2 years with 2 nephews when I was out of work on disability. I got nothing out of it and was quickly swept under the rug and pretty much disowned when I had fucking surgery that left me unable to lift for several months. People that use family like this literally do not care about their family unless it's convenient for them.\n\nOP- YTA",
              "id": 43,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "*Looking for nanny. Must have a bachelors degree, have good references, be available on-call basis. 80 hours a week minimum*\n\n*Need to be team player. Must able to do laundry, cook and clean*\n\n\n*Pay: $8.25/hr*",
              "id": 44,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Yup! My SIL is in the same predicament, struggling to find someone everyday, for 11 hours with expectation of doing it for free. She’s like, “ but she’s your niece!” OP is TA.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2505,
          "content": "Plus how many '''''emergencies''''' is OP having?! It's not an emergency unless someone is unsafe or hurt. Get a baby sitter, stop expecting your bil who has said no time and time again to do a huge favour for you.",
          "id": 46,
          "comments": [
            {
              "score": 3968,
              "content": "A planned work meeting isn’t an emergency, it’s a failure to plan",
              "id": 47,
              "comments": [
                {
                  "score": 1229,
                  "content": "Did he say he just turned up at this BIL's house with the toddler in tow calling a planned work meeting an emergency?",
                  "id": 48,
                  "comments": [
                    {
                      "score": 433,
                      "content": "Pretty much, he didn’t say that exact time was an emergency, but he said BIL wouldn’t help in so many “emergencies” and said he had told BIL he was desperate for help, so that makes me think he considers this an emergency.\n\nDude need to find babysitters and plan ahead. He knew his wife would be out of town and knew his in-laws would be at a wedding… like there are people who work full time as nannies and babysitters, I used to, many friends of the parents I worked for would hire me as a babysitter outside of my nannying time. If the kids were friends and the parents needed someone they would ask me and the people I worked for if they could set up a play date and they would pay me for watching their kid on top of the kids I nannied.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Methinks OP was intending to use this “last minute” angle to force BIL into agreeing. BIL couldn’t possibly turn down an “emergency” with no time to spare.",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 21,
                  "content": "This.  An emergency would be his wife has a burst appendix and has to get to the ER immediately, not a freaking planned event.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Exactly, and I can't be sure, but I would wager that in an actual emergency the brother-in-law would help. The brother-in-law's just refusing to be a free nanny for people who have jobs and refuse to hire child care. Apparently this comes up a lot, which makes sense, because they have jobs and no paid childcare.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 667,
              "content": "Yes, it seems to me that trips, weddings, and work meetings are scheduled things and not emergencies.  \n\nMy husband once asked my brother on very short notice to watch our kids because he was taking me to the hospital in the evening with a gallbladder infection. That was an emergency. Every other childcare we had was prescheduled and the kids were in daycare.",
              "id": 53,
              "comments": [
                {
                  "score": 39,
                  "content": ">My husband once asked my brother on very short notice to watch our kids because he was taking me to the hospital in the evening with a gallbladder infection. That was an emergency. Every other childcare we had was prescheduled and the kids were in daycare.\n\nThis! \n\nIf OP was confronted by something like this (aka a real emergency), sure the BIL would be an A H for not helping if he was home just because he is childfree. \n\nBut work / meetings / weddings / etc. are planned events! Get a babysitter or decent childcare and for the love of God, don't just dump your kid with someone who wasn't informed in advance!",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I was expecting another kid or something needed frequent trips to the hospital. Not a vacation and a work meeting.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "That was the main thought flashing through my head reading this post. Then I got to the part where he was \"desperate\" because everyone involved that usually watches the child...all had planned events known about well in advance. OP said this is an emergency? Literally about as opposite of an emergency as you can get because emergencies don't include long planning periods.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1757,
          "content": "My big thing is what 27 year old man calls someone cringe to their face as an insult lol",
          "id": 57,
          "comments": [
            {
              "score": 406,
              "content": "[removed]",
              "id": 58,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 37,
              "content": "I expect to hear the word 'cringe' from a 14 year old, not an adult. \n\nGet off Tik Tok and read a book OP.",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "The word cringe being used as an insult made me hate that word.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 379,
          "content": "So much this. Their description of emergency is most people’s anticipated. The flakiness and entitlement are dripping from the entire OP.",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 222,
          "content": "OP expects family to redo their schedules so he doesn’t have to pay for a babysitter.  He’s not only unorganized, he’s cheap.  If you need the entire family to raise your kid, you shouldn’t have one.",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 74,
          "content": "[deleted]",
          "id": 63,
          "comments": [
            {
              "score": 13,
              "content": "Apparently many more. Good on the BIL for shutting OP down. YTA for sure.",
              "id": 64,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 40,
          "content": "From all working parents, single or otherwise - thank you for this response, so well stated.\n\nOP is YTA for sure",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "So YTA.  You chose to have a child--it's your responsibility to provide for it.  It's not your relatives' responsibility.  Good on them if they WANT to do it, but they certainly are not obligated to do so.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Seriously... \"we've had a busy schedule for 2 years\" somehow they don't have a sitter...After 2 years... bloody leeches",
          "id": 67,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "Seriously. My brother loves our nieces but would never be asked to watch them because he’s never volunteered to and has said he wouldn’t know what to do. I’m child free but would watch them in a heartbeat but we’re very different people and our brother respects that. Why would OP want someone who has said they don’t want to watch their child be responsible for their child anyway? They’d rather risk their child being taken care of poorly than pay someone.",
          "id": 68,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18867,
      "content": "YTA - Family ≠ free childcare.\n\nThe entitlement here - because you had a child, your WHOLE FAMILY has to look after him, whether they want to or not?! What?\n\nPay for some childcare, damnit.",
      "id": 69,
      "comments": [
        {
          "score": 5811,
          "content": "Note: it’s only his wife’s family that OP is expecting to provide free child care at the drop of a hat. OP doesn’t seem to even ask his own family. So I guess it’s ok to use his in law family as doormats but not his own.",
          "id": 70,
          "comments": [
            {
              "score": 2382,
              "content": "Oh I didn’t even notice this. This guy is a massive asshole.",
              "id": 71,
              "comments": [
                {
                  "score": 1857,
                  "content": "What’s nuts is him (and even some people in the comment section) shaming BIL for not being comfortable around kids. I’m sure all of his family is aware of this, as he makes it very clear. It doesn’t mean he doesn’t love his nephew. It means he’s uncomfortable watching a child on his own. I love my nieces and nephews but the idea of being the only person responsible for a child’s well-being stresses me out. My family is aware I’m not a kid person and don’t push me to babysit. Doesn’t mean I don’t snuggle and play with them when I see them!",
                  "id": 72,
                  "comments": [
                    {
                      "score": 298,
                      "content": "exactly!! i am fully supportive of my friends having kids and do my best to love them and their kids. but i have made it extremely clear i do not feel comfortable babysitting. and they respect that! perhaps BIL could’ve better stated his boundaries (“i don’t want to watch your kid because i do not feel comfortable, please stop asking me”) but it’s definitely on OP for not arranging proper care for his own child.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "BIL's reasons for not wanting to watch the kids are irrelevant, he said no, end of discussion.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 274,
                  "content": "If you read his comments you'll see the in-laws had offered to babysit when needed and they're available. If both parties are fine with it, it isn't shitty to have family babysit. The issue is he went to the BIL, who had never agreed to babysit. They should have a contingency plan if the othet family members that are willing to watch the child are busy.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 297,
                      "content": "Yes but he can’t then assume that the parents in law are going to be available with no notice every single time.  He and his wife need to have a contingency in place.\n\nBecause having a work meeting isn’t an emergency if you did the tiniest bit of planning.\n\nAnd I have no problem with family looking after kids. Great if everyone is on board, but just because someone is related to you doesn’t mean they OWE you childcare, which is how the OP seems to view it.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 164,
              "content": "In fairness to OP, while I agree he is TA, you don't know that he hasn't moved country or city away from his family, or maybe doesn't have one.",
              "id": 77,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I fully agree. The entitlement and manipulation is strong with OP. Just because someone doesn't want to be forced into being free childcare doesnt mean that they dont care about or don't love the child in question. They just don't want to babysit. That is 100% their right and choice. \n\nOP's inlaws and spouse were right. The BIL owes OP NOTHING. And, if OP isnt careful, the rest of the family may get tired of always being used as free childcare. \n\nOP needs to find and pay for qualified and consistant childcare for their child instead of always making demands and trying to manipulate friends and family. It gets tiring after a while.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8984,
      "content": "YTA. \n\nwhy is everyone raising your child except you and your wife…?\n\nAlso? No one even needs a reason to not watch YOUR kid. He shouldn’t have even opened the door. \n\nYour kid is YOUR. KID.",
      "id": 79,
      "comments": [
        {
          "score": 1212,
          "content": "OP says in a response that they had a babysitter, but the in-laws kept taking the kid regardless. So they let the babysitter go, but they will definitely hire one now “no matter what they say.”\n\nAm I really reading into this, or does it seem like raising this kid is really an team event? I’m all for “it takes a village” and my niece and nephew have their own bedrooms at my parents house. But my mom and dad have no say in matters to this degree. \n\nMaybe it’s time for a Reddit break. Gotta gain some perspective.\n\nETA- OP is the AH, absolutely. This is more me extrapolating from some of their responses into being curious about other issues.",
          "id": 80,
          "comments": [
            {
              "score": 748,
              "content": "No, OP is just making excuses. Funny how he didn't listen when his in-laws backed his BIL",
              "id": 81,
              "comments": [
                {
                  "score": 143,
                  "content": "Truly, this. OP was getting away with no child care expenses and didn't plan on what happens when the in-laws are unavailable. So he's not properly planning around their cost-saving in-laws. \n\nOn the other hand, OP doesn't ever actually have to help out BIL if BIL ever asks for help.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I wouldn’t be the least bit surprise if OP leans really soon that the rest of the in-laws aren’t okay with the current arrangement, either. I can see offering the free childcare, but somehow I doubt they meant “no need to schedule or check with us first — just assume it’s cool and drop him off a a moment’s notice!”",
                  "id": 83,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 386,
          "content": "The entitlement of thinking someone else is being the jerk because they repeatedly warn you they’re not interested in watching your kid. Not everyone has to be interested in children. Showing up on his doorstep when you already know he won’t be interested and trying to force it. OP YTA",
          "id": 84,
          "comments": [
            {
              "score": 20,
              "content": "Also, why would they want someone who has no interest in their child babysitting?\n\n\"You don't like kids? Here's mine, have fun!\"",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8955,
      "content": "[deleted]",
      "id": 86,
      "comments": [
        {
          "score": 1645,
          "content": "I’d watch the communal stray pet!",
          "id": 87,
          "comments": [
            {
              "score": 676,
              "content": "They're a lot more fun than babies...",
              "id": 88,
              "comments": [
                {
                  "score": 47,
                  "content": "God I'm a mom and I'd far rather watch the communal pet than someone else's kids.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 31,
                      "content": "I’d rather watch a cobra than someone’s baby.",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "I’ll take second shift.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Hell, I'd adopt a communal stray pet. Come here, son. I hereby name you Sigimund.",
              "id": 92,
              "comments": [
                {
                  "score": 13,
                  "content": "We can split custody and share holidays",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 959,
          "content": "Seriously, I was thinking, short of someone in the family having a really serious illness (which I'm sure OP would have mentioned for sympathy points if it was the case), how many 'serious emergencies' can you *have* in four years? Or were they, perhaps, *not* serious, completely unavoidable emergencies where it was also completely impossible to bring the child, but were in fact repeated fatigues by OP and his wife to do any amount of planning, and wherever that came back to bite them, they just pawned the kid off on the nearest family member?\n\nYou're a parent, OP. *Plan better*.",
          "id": 94,
          "comments": [
            {
              "score": 538,
              "content": "OP is giving me \"a lack of planning on your part does not constitute an emergency on mine\" vibes, tbh",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 39,
              "content": "This was a work meeting not an emergency. An emergency is someone going to the ER or someone dying. Or them getting very sick all of a sudden. For work? Figure it out, that's not an emergency.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Right!\n\nAn emergency happens when all your plans fail or no reasonable amount of planning could have predicted the situation. Not something totally normal that you just didn't plan for happens.\n\nA failure to plan on OPs part does not equal an emergency for OPs family. \n\nSound like he's worn down their generosity.\n\nI respect childfree people. And if they really can't deal with a kid I'd rather know because you dint want a kid in that situation. It is rare, but there are times when OP could have been right. But that time is almost exclusive to a situation where the BIL is capable of managing a kid and is regularily get favors from OP and others family but doesn't want to do anything in return. In which case its a taking from the community but not giving back thing. Which is not the case here.\n\nI suspect if OP didn't have emergencies so god damn always, BIL might have been available for the maybe 2 legit emergencies iver 4 years when others weren't. \n\nBIL is smart for not \"breaking the seal\" and letting the kid in. Because that sets a precedent that would make OP insufferable to argue with.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 679,
          "content": "[deleted]",
          "id": 98,
          "comments": [
            {
              "score": 13,
              "content": "I know right? They nailed the comparison. That’s exactly how OP seems to be managing their childcare. lol",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 551,
          "content": "> If you are having countless emergencies, you are likely planning poorly or should at least figure out multiple babysitting options\n\nDefinitely.\n\nWife was on a trip, which is obviously planned in advance. Family was at a wedding, also planned well in advance. So even if the meeting itself was not planned in advance, if OP has a job where meetings can be scheduled last minute, a responsible parent could anticipate that they should have childcare lined up in the event they need to attend a meeting while their spouse and family are not available.\n\nIf you can't anticipate that very obvious situation, then of course you're going to be having constant \"emergencies\" because you don't think more than two minutes into the future.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Or OP doesn't really know what a true emergency is..",
          "id": 101,
          "comments": [
            {
              "score": 44,
              "content": "The true emergency was the family we alienated along the way.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 44,
          "content": "The way he talks about his kid. \n\nYTA \n\nThis is just plain weird. Why would you want a person to watch your CHILD after they repeatedly told you no? I have kids and there are very few people on this planet I trust with them. I certainly wouldn't ever want to leave them with someone that specifically told me no several times. Why are you creating so much instability in this kids life that you are routinely dumping them on who ever is around? That could end very badly. \n\nWhen I worked I went to these places called \"day care centers\". You can go to them, interview them, many are licensed and fully background check the employees and can provide a high level of care for your child. You can also hire babysitters. There are many resources where you can find child care and background check potential care givers. \n\nDon't question why your BIL doesn't want to watch your kid. Maybe he just doesn't like kids, maybe he doesn't like your kid, maybe he doesn't feel responsible enough to care for a whole human being, maybe he just dropped some Molly. Only he knows, it's none of your business. Hire a babysitter.",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "Hahaha thank you for the comment that the child is \"not a communal stray pet.\" That's gold. I'm *actually* laughing out loud.",
          "id": 104,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "> It is YOUR baby, not a communal stray pet.\n\nPrecisely - it's one thing to have a big emergency and need help. It's another to have a pre-planned meeting and know about it far in advance and wait until right before to ask someone. Childfree or not, I don't know many people who'd babysit with no notice for something that is not an emergency.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I’m really glad the YTA rating seems to be the consensus here. As I was reading the post it was clear to me that OP was TA but I’ve seen posts like this concerning children that go the other way.\n\nOP is trying to use his brother in law as free child care and trying to make him feel bad for just not wanting to. The BIL does not need a reason to not want to be a babysitter. Notice how OP never mentions payment or offer of compensation in any way. He just expects his BIL to be a free babysitter.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7652,
      "content": "What? Just:\n\n- Why do you keep having 'emergencies'? \n- How are work meetings 'emergencies' and not 'things that you knew about days in advance'?\n- Why have you not organised actual daily childcare?\n- What the hell is wrong with you?\n\nYTA. Ring around. Find a childcare centre. **Pay the childcare centre to look after your child while you're at work**.\n\nYour poor kid sounds like he has zero routine in his life. I'd expect this sort of chaos from teen parents. Yeesh.",
      "id": 107,
      "comments": [
        {
          "score": 1514,
          "content": "I was hoping someone else had typed this out!\n\nSounds like they decided to have a baby with absolutely no plan in how they were going to care for it. \n\nYour baby, your responsibility.",
          "id": 108,
          "comments": [
            {
              "score": 657,
              "content": ">Sounds like they decided to have a baby with absolutely no plan in how they were going to care for it.\n\nBut EVERYONE just LOOOOVES babies!!1!\n\nI think that's all part of the whole entitled attitude. People like OP can't fathom how everyone else isn't just falling all over themselves to have/watch/interact with/coo over/take care of babies and kids, because they're SO precious, and anyone who doesn't think so is a cold, hateful person.\n\nI have no kids, and I'm the only woman in my family to not have kids. For 20+ years, there was this almost culty propaganda in my family about getting me to interact with and care for all the other kids, I guess in hopes of triggering my certainly-latent parental instincts. \"Here, \\_Kay\\_Tee\\_, little Baby needs a diaper change!\" \"Can you just keep an eye on the kids in the pool for five minutes?\" When I'd point out that I don't want to, it's not my responsibility, and it makes me incredibly uncomfortable, they'd start with the same kind of entitled rubbish: \"You can't spend ONE HOUR with your own nephew?! You're so selfish! I have to take care of them all the time and you can't do this one little thing? I never knew you were so cold. But Niece LOVES spending time with you- Oh, now she's crying. Great.\"\n\nThis is why OP's BIL has to keep saying \"child-free.\" Like others have mentioned, he does not want to be responsible for the care of a child. That, in fact, is one of the LEAST selfish things a person can do.",
              "id": 109,
              "comments": [
                {
                  "score": 264,
                  "content": "“I have to take care of them all the time and you can’t do this one little thing?” \n\nYeah because you signed up to have kids 24/7. I did not!! People like this really annoy me!",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 67,
                  "content": "\"You didn't ask me before you fucked your wife, why is it my responsibility to deal with the consequences?\"\n\nMy saying on the matter, it's my choice when and how to interact with children not the other way around.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 64,
                  "content": "> \"You can't spend ONE HOUR with your own nephew?! You're so selfish! I have to take care of them all the time and you can't do this one little thing?\"\n\n\"I am so selfish that I expect you to shoulder the burdens of my choices.\"",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Ugh. That’s so annoying. I’m sorry you have to deal with that shit, dude.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "I’ve had the shoving kids in your face in the hopes in stirs latent motherly feelings. It has without fail had the opposite effect for me. Even well behaved happy kids are just awful to be around for me.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "The “I have to look after them all the time” gets me. Did I enjoy making the kid? NO! So it's not mine to take care of!",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "I love hanging out with my friends and their little ones. But I also love being able to walk away. And they respect that. I love them. But I don’t want to care for them. Sounds like the strained relationship between uncle and nephew is the dads fault for not allowing interaction other than “I’m sticking you with watching him.” Which is a shame.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "My pet peeve is when people complain about the cost of childcare AFTER they've had the kid. \n\nUm, you know, you could have Googled this information before you decided to procreate.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 467,
          "content": "As a parent of a 3 year old,  I wholeheartedly agree with you. Work is not an emergency. Pay for childcare and plan. I would never dream of expecting my siblings and siblings in law to be impromptu babysitters at my beck and call, especially if they had expressed no interest in watching my child. \n\nIf both parents are working, then you should be able to afford childcare. Also, I don't care what you do. You can't take care of a 4 year old and be productive at work. \n\nWe had childcare, the covid hit, so my husband quit his job to take care of our kid. If he's sick, I miss work due to lack of childcare. Our kid isn't an obligation that must be taken care of, he is our priority and responsibility. \n\nThis guy is a total a-hole. Not everyone wants to take care of other peoples kids, and work is no excuse. Everyone works. Figure it out.",
          "id": 118,
          "comments": [
            {
              "score": 22,
              "content": "Yes! Why would you want your child in the care of someone who doesn’t want to be watching them? That poor kid.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "100% this.\n\nI’m not a parent, I don’t want kids, and even I know that children need routine.\n\nOP, you’re selfish, definitely YTA, and not responsible with time and management of your household. Figure out a routine and a regular person to watch your child. Find a good daycare where your son can socialize with other kids so he hopefully turns out better than you and your wife: not as much of a sense of entitlement,  that “me me me!” expectation is what matters. Stop taking advantage of people. No one is expected to just GIVE you their time and effort… and especially not raise your kid for you.\n\nEdit: spelling/grammar",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Exactly this. My wife has meetings all the time. They Aren't a \"surprise\". They're on a calendar. I work in the hospital with a schedule that's all over the place. Her dad is in Thailand, and her mom is dead. My mom is disabled and my dad is dead. My SIL and my sister live too far away and I'm no contact with my brother. And we make childcare work just fine for our 8 & 2 year olds. OP needs to grow the fuck up and use a Google calendar and pay for some fucking childcare. BIL calling themselves \"child free\" is kinda cringe, don't get me wrong, but he's not an asshole for that. BIL shouldn't have to say anything in the first place. \n\nOP YTA big time for expecting your family to watch your kid for you all the time last minute, being a kinda shitty parent for having no real routine, and for being rude to your BIL. This is why some people shouldn't have kids.\n\nEdited to fix format",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4584,
      "content": "YTA\n\nHe has made it incredibly clear that he isn't interested in being responsible for your child. I would wager he's saying \"that's why I'm child-free\" not saying \"I won't watch him because I'm child-free\", but that's just a guess.\n\nHire a babysitter. He is not obligated to watch your child just because he's family.",
      "id": 122,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2839,
      "content": "YTA.\n\n*'for so many emergencies he has turned me and my wife away when we begged him to watch our son'*.   Why do you keep asking and expecting a different result?\n\nSome people just aren't comfortable with kids, whether they're related or not.  He's one of those people.  Delete him from your list of go-tos.",
      "id": 123,
      "comments": [
        {
          "score": 938,
          "content": "Also, in what way is a work meeting an emergency? A lack of planning on OP's part does not in any way constitute an emergency for the BIL or anyone else. OP, you're entitled. Your child is your responsibility - no one else's. Respect your BILs boundaries and sort out your own childcare like everyone else.",
          "id": 124,
          "comments": [
            {
              "score": 339,
              "content": "It seems like these \"emergencies\" are quite common for OP... If your job makes you unable to take care of your kid for the last 2 years, why aren't you looking for another job?\n\nOr, just like everyone else does, get a nanny for those few hours when you'll be in the meeting",
              "id": 125,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 470,
          "content": "I also love “no one was free to watch my son except my BIL”\n\nSays fucking who, dude? How did you know he was free? You obviously knew he’d say no so you *showed up at his place* like a crazy ex. How does he not think this will result in BIL straight up resenting this poor kid that’s parents pawn him off every time they leave the house because “emergency” or as others would call it: normal pre-planned work schedules that the rest of the world plans child care in advance for.",
          "id": 126,
          "comments": [
            {
              "score": 110,
              "content": "Because childfree people have no life and tons of free time on their hands. /s",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "And if he wasn't willing to look after the kid, then NO, he wasn't free.",
              "id": 128,
              "comments": [
                {
                  "score": 23,
                  "content": "Precisely. Sometimes I have no plans but that doesn’t necessarily mean I am willing / able to do literally anything anyone asks of me. If someone asks “Hey are you free?” my response is “for what” cuz if the implication is “hey are you free childcare?” the answer is always no.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "You know who WOULD be free to watch OP's son? A PAID SITTER.",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "BIL should call child services if OP tries to abandon his kid at BIL's house.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 126,
          "content": "Lol, the 'wouldn't apologize for saying no when I asked a favor' thing is hilarious. OP, YTA. You have a 'little audacity problem' you need to work on. Your BIL doesn't owe you anything, much less an excuse nor apology",
          "id": 132,
          "comments": [
            {
              "score": 29,
              "content": "Right?  How about OP apologizing for badgering someone who's *\"...made it clear he is just not interested in spending time with his nephew\"*.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2831,
      "content": "YTA. Stop demanding that he watch your kid when he’s made it clear every time that his answer is no.",
      "id": 134,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2567,
      "content": "Have you ever heard of these wonderful things called \"babysitters\"? Basically they take care of your child in exchange for currency. Look them up.",
      "id": 135,
      "comments": [
        {
          "score": 526,
          "content": "I think OP wants free childcare.",
          "id": 136,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 66,
          "content": "Lol",
          "id": 137,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2412,
      "content": "YTA. What if your BIL wasn’t around? You’d HAVE to find other arrangements. Stop trying to pressure him.",
      "id": 138,
      "comments": [
        {
          "score": 116,
          "content": "OP … because he can’t stand children and fell uncomfortable around them !",
          "id": 139,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}