{
  "post content": "My ex (M 39) and I (F 43) had been together for 9yrs. We have 2 children (7 & 5) and have lived together for a little over 7yrs. 4 yrs ago I bought a house and it is in my name only. He was bitter and upset about it, but we were not married and his credit was not good enough to be on the loan. So everything with the house is in my name. I was married before and have absolutely no desire to get married again. We had been having issues in our relationship for about a 1yr and everything came to a head right around Thanksgiving 2022 and after a brief separation (\\~2wks) I could tell nothing was going to get resolved and told him I was ending the relationship. He still wants to work on the relationship & is still trying to convince me to get back together. I have told him No repeatedly & he needs to make plans to get his things. There is a shed in the backyard I told him I would store his things & he could come to pick them up once he got a place & got them settled.\n\nNow about the fish, about 2yrs ago he built a pond in the backyard and a neighbor gave him 17 fairly large Koi fish. These are not fish someone can put in a fish tank and keep inside and he has added more fish over the last couple yrs. There are still 15 large Koi and bunch of smaller fish. The pond has required a lot of upkeep and maintenance that he mostly took care of. I would help feed the fish occasionally, but for the most part, I wanted nothing to do with it. Now that we are split up and I have asked him several times what the plan for the fish & his things is & he never gives me an answer. He just keeps saying he wants to get back together. This is not going to happen & I have made that clear to him.\n\nWell, it's starting to warm up here and I can tell the pump needs to be fixed again bc it is barely moving any water and the pond water is turning green already. I have been feeding the fish every few days, but that is the extent of my knowledge of caring for the fish and the pond. I do not have the time or money to figure out what needs to be done, so I found a fish/pond guy in our area and told my ex the guy was coming to look at the fish in the next 2 wks & he was probably going to take the fish & I would fill in the hole for the pond. He flipped out & said he wanted the fish & that I can't just get rid of his things. It has been over 45 days since we split and he has made absolutely no plans to pick up any of things or told me any plans for the fish.\n\nSo I told my ex he has until the fish/pond guy comes to get the fish, otherwise, I'm going to let him take them. He is LIVID & saying I can't expect him to find something to do with all these fish in a rental. He's saying I'm heartless and all the stuffs, but I really don't want to let these fish suffer bc of my lack of knowledge/experience/money/time/etc. I told him I don't want to deal with the pond/fish upkeep/maintenance and if hasn't picked them up before the other guy comes, he can have them.\n\nWIBTA for letting the fish/pond guy take the fish?",
  "id": 1,
  "comments": [
    {
      "score": 19,
      "content": "I'm gonna say NAH, honestly.\n\nThe fish's health and wellfare matters most in this imho.\n\nAlso it sounds like your husband is just putting things off.",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "I agree, NAH - this is a rock and hard spot situation.   Hard to move large coy fish, hard to lost a partner when you don't want to break up.",
          "id": 3,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "NTA. Your ex is using the fish as a reason to keep in your life (apart from the kids). Ditch the fish and remind him to come get his stuff.",
      "id": 4,
      "comments": [
        {
          "score": 7,
          "content": "Possible, but I'm not sure, Koi are both expensive, and require space, but are awesome to have and look at. If I had been given free Koi I'd be pretty desperate to try and keep them too.",
          "id": 5,
          "comments": [
            {
              "score": 2,
              "content": "In your desperation to keep them, would you be looking for somewhere for them to go and communicating that to your ex so they knew what was going on? \n\nCuz he's not communicating anything but \"I want to get back together\" and \"don't get rid of my fish\"",
              "id": 6,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "NTA  He is stalling to try to keep the relationship going. I think that you should check with a lawyer first because the pond is in your yard and he built it. It might be called a permanent install and he might have some rights regarding it (how much time he has to remove the fish). I know the American Bar Association has a web site were you can ask question for free but I don't know how long it takes to get an answer.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. Your ex has had ample time to make arrangements for the fish if he wanted to keep them. If he couldn’t keep them himself (understandable, being that he is staying in a rental), he could’ve made arrangements with you to stop by every couple of days and feed them or take care of whatever maintenance needs to be done. \n\nThe fish do not deserve to suffer because of this breakup, and the fish/pond guy seems like a much better home for them than the pond with a broken pump.",
      "id": 8,
      "comments": [
        {
          "score": 2,
          "content": "I gave him that option at first, but him coming by the house is not going to be an option at this point.",
          "id": 9,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA.\n\n***KOI**.*",
      "id": 10,
      "comments": [
        {
          "score": 1,
          "content": "Ahhh, yes I realized I spelled it wrong, but I don't think I can change the title. gah!",
          "id": 11,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Ahh, yes, I noticed i spelled it wrong, but I don't think I can change the title.",
          "id": 12,
          "comments": [
            {
              "score": 1,
              "content": "sorry, that is just such a pet peeve of mine 😭 you’re doing the right thing in passing them off to a good home. they’re beautiful creatures.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA \n\nYou have made it absolutely clear to your ex that you guys are over and that he needs to get his stuff.\n\nYou are looking at re-homing the fish your bf got, that’s the most humane thing someone can do when they didn’t want those pets at all.\n\nYour bf is simply guilting you. Hope you can move on as smoothly as possible. NTA",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I will get rid of the fish\n2. I can give him more time to collect the fish\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n \n\nMy ex (M 39) and I (F 43) had been together for 9yrs. We have 2 children (7 & 5) and have lived together for a little over 7yrs. 4 yrs ago I bought a house and it is in my name only. He was bitter and upset about it, but we were not married and his credit was not good enough to be on the loan. So everything with the house is in my name. I was married before and have absolutely no desire to get married again. We had been having issues in our relationship for about a 1yr and everything came to a head right around Thanksgiving 2022 and after a brief separation (\\~2wks) I could tell nothing was going to get resolved and told him I was ending the relationship. He still wants to work on the relationship & is still trying to convince me to get back together. I have told him No repeatedly & he needs to make plans to get his things. There is a shed in the backyard I told him I would store his things & he could come to pick them up once he got a place & got them settled.\n\nNow about the fish, about 2yrs ago he built a pond in the backyard and a neighbor gave him 17 fairly large coy fish. These are not fish someone can put in a fish tank and keep inside and he has added more fish over the last couple yrs. There are still 15 large coy and bunch of smaller fish. The pond has required a lot of upkeep and maintenance that he mostly took care of. I would help feed the fish occasionally, but for the most part, I wanted nothing to do with it. Now that we are split up and I have asked him several times what the plan for the fish & his things is & he never gives me an answer. He just keeps saying he wants to get back together. This is not going to happen & I have made that clear to him. \n\nWell, it's starting to warm up here and I can tell the pump needs to be fixed again bc it is barely moving any water and the pond water is turning green already. I have been feeding the fish every few days, but that is the extent of my knowledge of caring for the fish and the pond. I do not have the time or money to figure out what needs to be done, so I found a fish/pond guy in our area and told my ex the guy was coming to look at the fish in the next 2 wks & he was probably going to take the fish & I would fill in the hole for the pond. He flipped out & said he wanted the fish & that I can't just get rid of his things. It has been over 45 days since we split and he has made absolutely no plans to pick up any of things or told me any plans for the fish. \n\nSo I told my ex he has until the fish/pond guy comes to get the fish, otherwise, I'm going to let him take them. He is LIVID & saying I can't expect him to find something to do with all these fish in a rental. He's saying I'm heartless and all the stuffs, but I really don't want to let these fish suffer bc of my lack of knowledge/experience/money/time/etc. I told him I don't want to deal with the pond/fish upkeep/maintenance and if hasn't picked them up before the other guy comes, he can have them.\n\nWIBTA for letting the fish/pond guy take the fish?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 16,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Check and see how long you have to wait until property is considered abandoned. Tell him he has until that date to get his stuff or you be donating it. He's effectively abandoned his pets at this point, so unless he can figure out a way to get the first himself, you need to do what's best for them. Koi can live a LONG time and they deserve a good life.\n\nNTA, but it's time to give him a \"move your stuff by\" date and cut it off. You need to coparent, but that's about the extent of your relationship with him from now on.",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Those koi are probably worth a lot of money so don’t just give them away.  They need to be cared for so your ex not having the means puts you in a tough spot.  Consider selling the koi, emptying the the pond and not repairing the pump.  Send him the money.",
      "id": 18,
      "comments": [],
      "relation": "Support"
    }
  ]
}