{
  "post content": "I (25F) lived with my parents (50F and 55M) because it is very close to my service and it is a very expensive area.\n\n I can currently live alone, but I didn't because I never needed it and my parents didn't ask. \n\nAs time went on and I earned more, I put in air conditioning, made my room smart, as well as the house (Alexa), put a very good shower in the guest bathroom (which I eventually added to my bedroom) I bought quality furniture to my room etc. My room turned out to be the best in the house because of the changes I made. \n\nAnd yes, I paid rent to my parents (quite fat by the way). \n\nIt's been 3 months since they came to talk to me, saying it was time for me to change, because they wanted to have their moment alone now and I was able to live on my own. I agreed, after all I was just living there for ease and convenience. \n\nI found a house and I would need to make all the changes I planned, so in order not to have to buy it when I have it, I replaced all the sockets/bulbs/switches (smart) and the shower with common ones (I paid for them all and this increase in energy I paid too). I also removed the air conditioner and paid to plug the hole it leaves. Besides of course all the furniture in my room and Alexas scattered around the house. \n\nMy parents started complaining that I shouldn't take everything out, as they were in common use. They were planning to move his room to mine and that with these changes I made my room worse and the house in general too (it's just not smart, everything I bought was quality). \n\nI said that they asked me to move and I'm taking everything I bought, because I needed to have other expenses (I made a payment on the house) and these items were all bought by me and all the increase in energy I had was paid only by me too. And that if they wanted to buy, I can help search online, but I would take these items. \n\nThey called me selfish, because I made the house worse and removed the items in common use, as they were already used to the smart home. They complained even more when I didn't want to leave the 65' Smart TV in my room as a gift for them (I didn't leave it because it's new and it was too expensive). \n\nI moved a week ago, but they're still upset. \n\nAll items are brand new (most less than 1 year old) \n\nAdd: Yes it was cheaper for me to replace. Legally I can do this. It's not US, these things are very expensive in my country\n\nAITA?\n\n*Extra:  No replaced item made them lose money, all were replaced by the same (before smart) or better. It's because the Smart is twice the price of normal items  so obviously it's of a \"lesser\" quality compared to smart things.*\n\nExtra: About AC, I didn't put it in the text, they complained the least, because they don't use it, I took it mainly because it would gather dust in my parents' house.",
  "id": 1,
  "comments": [
    {
      "score": 14084,
      "content": "NTA\n\nI don't understand why your parents would expect you to leave stuff that you bought for your convenience. As long as the hole from the ac unit is patched and painted there should be no issue.\n\nEdit: spelling correction\n\nEdit 2: WOW! Thanks for all the up-votea everyone!",
      "id": 2,
      "comments": [
        {
          "score": 5552,
          "content": "This reminds me of the post some time ago of the tenant who turned a bare dirt backyard into a nice garden with plants, greenhouse, garden shed etc. and when asked to leave took it all along, only for the landlords to freak out because the value of the house plummeted because of the barren backyard. Never gets old. \nNTA, your parents wanted to profit from the changes you made. Any chance you could've left it as was of they had paid for new equipment?",
          "id": 3,
          "comments": [
            {
              "score": 2886,
              "content": "Sounds like my former flatmate who forced me to leave when I was away for a few months because she wanted her friend to move in, and expected me to leave all my nice furniture for her (at less than half the actual price). Lol honey, I packed and moved everything out, across several states.",
              "id": 4,
              "comments": [
                {
                  "score": 275,
                  "content": "That post always reminded me of an old neighbor. He rented the top half of the house and had replaced the freaking kitchen. Not joking. Always wanted to know what happened when he moved out.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 259,
                      "content": "When I move into an apartment I always take down the shitty fixtures and put up my own; lights, vanity, doors, shower head, etc. When I move out I put the original stuff back just like I found it. I kind of feel bad for future tenants, they tour it with my stuff installed and go to move in and find the landlord special instead.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 43,
                      "content": "He was probably PAID to leave the kitchen.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Fiextures like that are considered property of the homeowner. The tenant can’t remove them. He just gave the landlord a nice gift.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -7,
                      "content": "I presume the kitchen was on the first floor, which he was not renting... What was the reason exactly why he replaced what was essentially somebody else's kitchen?",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 210,
                  "content": "I had a housemate drive me away by generally being awful, she was perfectly happy when I decided to break the lease and move out until she realized everything except the shower curtain was mine. My mom was helping me pack and asked if I'd like to at least leave her one fork, and I said no thank you.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 113,
                      "content": "Should have told her to Fork off.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 192,
                  "content": "[removed]",
                  "id": 12,
                  "comments": [
                    {
                      "score": 264,
                      "content": "This is a comment stealing bot. Original comment here: https://www.reddit.com/r/AmItheAsshole/comments/x0i3ad/aita_for_removing_all_the_improvements_i_made_to/im93i9l/",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 87,
                  "content": "Yeah...one of my boyfriends expected me to leave all of my handcrafted hand carved teak wood bedroom and living room sets behind when he broke up with me because of how heavy they were when he and his brother moved me in! He didn't count on my income tax check being big enough to hire professional movers and I cleared all of my good stuff out that I paid for (95% of the furnishings were mine)! He about threw a conniption fit when he discovered I took all of my cast iron skillets and Le Creuset cookware with me too!\n\nI don't know why he was b*tching! I left his mattress and TV with the remote for him!",
                  "id": 14,
                  "comments": [
                    {
                      "score": 48,
                      "content": ">He about threw a conniption fit when he discovered I took all of my cast iron skillets and Le Creuset cookware with me too!\n\nDon't blame you cause that stuff isn't cheap and worth more than any boyfriend, even a good one lol.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "You can pry my Le Creuset from my cold, dead hands. Otherwise, it stays with me.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 749,
              "content": "For those looking for this particular case.\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/hbdi4l/aita_for_bringing_my_garden_with_me_when_i_moved/",
              "id": 17,
              "comments": [
                {
                  "score": 1399,
                  "content": "This post inspired me 2 years ago when our landlord was selling the house that my husband (pro horticulturalist & landscaper) and I had lovingly planted with perennials and stone pathways and planters. \nWe estimated the rocks alone were worth about $3000 and the mature plants around $2500 not including labour. \nThe realtor was a complete jerk and the owner really jacked up the asking price because he assumed we would just suck it up and buy instead of move. \nThe yard was always where the realtor would bring prospective buyers to talk up the place. It’s easy to forget foundation cracks when staring at the ocean over drifts of lilies. \nWe did buy, a different house about 5 blocks away, and managed to fit all the rocks and plants in husband’s work truck. \nThe old house is still on the market, and the yard looks terrible. \nI should probably thank the OP of that post lol\n\nEdit: thanks for all the love, the plants have flourished and it was fun putting it all back together.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 376,
                      "content": "I just wiped away a single proud tear.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 150,
                      "content": "Ah, I love this! \n\nMy family lived on a rented lot for years, when suddenly our landlord kicked us out. (Long story short: His step-grandson was our neighbor and did an awful thing, we called the cops on him, the family got pissed and we got the boot.) My parents had spent years cleaning up the lot and making everything nice, and there was no way in hell my mother was going to leave it behind. We took *everything*: the plants, the shed, the fencing, the two decks, even the cheap Wal-Mart pea gravel that she had bought. If she could have dug up the trees and grass we planted she would have. Landlord's family weren't getting left jack shit.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 125,
                      "content": "My sister had a friend whose house sold she thought based on her beautiful side garden. She left it there. Months later she drove by and the new owners had paved over the garden!",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 73,
                      "content": "Ya love to hear it",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 71,
                      "content": "This reminds me of a news story of a reality tv show which did up front gardens/yards to sell the house or increase its value. Apparently, behind the scenes, the flora which they planted was all buried pots and soon as filming ceased they dug up every plant, every paver, even reclaimed lumber used in repairs and took it back with them to the next site. Basically stripped the house down and it looked worse than before because now it was now torn up and left that way. The families who participated on the show were trying to sue for misleading them but I'm not certain where it went from there, I never saw a follow-up.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 66,
                      "content": "When I moved in with my husband, he didn't want to move my garden until I took him to a nursery.  Seeing the price to replace was much a higher price than digging and transplanting.",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 40,
                      "content": "Golf clap. And respect!",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "That’s so awesome! I’m glad you were able to bring it with you. It sounds like a lot of work and time went into creating it!",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My sister and her husband love a bit of gardening and when they left a rental they were happy to leave all the plants they'd put in but the landlord insisted it had to be returned to the same condition it was when they moved in, so it all got ripped out they gave away most of it to friends and family.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Have my award…..",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 230,
                  "content": "This is delicious and fills me with glee.",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 88,
                  "content": "Yeah, there is a reason that when I replaced the lights I used with LED bulbs I kept the original bulbs. When I move out those originals are going right back in.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 60,
                      "content": "When we were young and poor we replaced a really dodgy looking old toilet seat in a rental with a new one, and saved the old.  \n\nWhen we moved we put the old one back.\n\nThe seat we bought went to the next rental with us, and eventually to our first home.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 87,
                  "content": "Exactly right. Not fixtures! You return it to the original condition, subject to normal wear and tear that occurs, and that's it.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 73,
                  "content": "Much obliged!",
                  "id": 33,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "Happy Cake Day!",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "Thank you that is one of my favourite stories",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "Thank you for the link and happy cake day!",
                  "id": 36,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "This is just beautiful. Just…. Chefs kiss",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "thank for this!",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 385,
              "content": "I mean hell, if OP was that handy that she could both install and uninstall all the equipment on her own, then I'm sure she'd be willing to help out if her parents bought their own and asked her to help put it back up. The parents didn't want the expense either tho, kinda greedy and shitty to expect your child to fork over her own gear for free. NTA OP, stick to your guns and make them pay for their own smart tech",
              "id": 39,
              "comments": [
                {
                  "score": 47,
                  "content": "I mean, of course she would do the work if they bought the parts and asked. 😕",
                  "id": 40,
                  "comments": [
                    {
                      "score": 173,
                      "content": "I mean I can only speak personally, but it wouldn't be \"of course\" from me if they thought they'd just keep $3000+ of my gear and harassed me over it and only when I didn't cave they decided to get their own. I would be telling them to get the Geek Squad in cuz I wouldn't be doing them any favors until they apologized",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "\"Kinda greedy and shitty to expect your child to fork over her own gear for free\" - especially after they had just told her to leave just because they want to be alone!",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 102,
              "content": "Oohh I remember that one. The Op from the post even build a pizza oven and was expected to leave it behind.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 74,
              "content": "As soon as I started reading this I thought about that straight away. It was a beautiful garden and she built it all out of stuff that could be moved if she ever needed to move.",
              "id": 44,
              "comments": [
                {
                  "score": 32,
                  "content": "She built/planted everything so it could be moved: This is the key to her not being the AH. \n\nMy ex and I bought a house from friends many years ago. They had renters, and the wife was a landscape designer. The garden was beautiful. They dug up most of the plants before they moved out, leaving huge holes all over the front garden. They took two weeks longer than they were supposed to, so were still moving out the day we moved in.  \nWe were not happy about the plants, but didn't say anything, until they CAME BACK a week later to dig up more plants.   \nAt that point, we told them to stay away from the property and if they tried to take anything else we'd call the police.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 30,
                      "content": "My first partner bought a house and the seller \"dug up\" all the plants and took them.  At the closing it was raised that the plants were technically part of the property as they were planted and the seller could forfeit the deal including the deposit; put the plants back or reduce the price of the house.  He ended reducing the price of the house.  He did throw a fit and the lawyer closing the deal said my partner had the right to file a police report too, which convinced him to just lower the price.",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Yep, previous landlord was mad we took our AC with us, and that we put back the original showerhead that we had swapped out for a nicer one we brought from our last rental (and now have in our new house). Its not like we just left bare plumbing or a hole in the wall, we returned it to original condition. But I'm not sure why he thought we would pay him thousands of dollars to improve a house we get nothing out of.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "In the post OP mentions they offered to help search for, and I'm assuming set up, if the rents paid for it. Seems they decided OP is selfish for it, but NTA for sure.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I remember that one and was thinking the same thing!",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I thought of the same post as well!",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I took my stuff from my parents when I left — all the smart products, furniture I bought, etc. Housewide things I purchased to use but they made use of. They not only didn’t complain, but expected it and asked why I didn’t take some of the Wi-Fi equipment (I didn’t need it and it was way better then what they were using). Seems weird that they expected that back.",
              "id": 51,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 139,
          "content": "My sister got mad at me for taking the Smart TV and stand I bought and explicitly said I was taking when I moved out.\n\nShe said I should replace it because I took away the living room TV and made them throw the old one out and she can't watch Netflix anymore, ol TV was purchased in 1999 and she's acting like she watched Netflix on it before (I also paid for the Netflix).",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "They expected it because it was convenient and nicer for them. They wanted to benefit from the sweet upgrades. I’m also betting that they were hoping OP would ask before taking the upgrades and they were planning to play the “but we raised you and you owe us” card. \n\nOP is NTA.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "NTA. I mean you replaced stuff and didn’t leave it bare. When I left permanently myself, when I gave stuff, I did say I gave it and when I got my stuff, well, they’re mine.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "Because they kicked him out to take over his nice space",
          "id": 55,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "My brother bought a bigger TV than my parents that stays in his room. He is not even staying with them anymore and they still don't touch it. Never have. They know it's his.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": ">I don't understand why your parents would expect you to leave stuff that you bought for your convenience.\n\nbecause they're likely planning on selling the house and all that smart shit and upgrades and the nice room ups the value because they can include it in the listing. they were probably hoping to capitalize on all the work OP did upgrading the house",
          "id": 57,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "I suspect they wanted OP yo move out because they wanted to have her room and everything else in it (as she said, her room was the best in the house).\n\nThey fked around and found out. NTA.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "lots of parents feel entitled to their kid's things, no matter how old they get. because the kid themself is \"theirs\" and so are their things",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -3,
          "content": "NTA\n\nFWIW - there is a legal issue, if not an ethical or moral one.  In the US, Uniform Commercial Code dictates that any improvements you make to a property not owned by you become the property of the owner. The standard, generally, is if it requires a tool to remove (i.e. a screwdriver), you can't take it with you. In fact, the landlord is within their rights to raise your rent because the place is nicer BECAUSE of the improvements. \n\nBecayse you're not the US, UCC doesn't apply to you, but there may be an equivalent.  Though because it's your parents, it's really unlikely to be a legal issue. And because you're restoring everything (or better) even after they kicked you out, you're fine from an AITA perspective. \n\nBut, for US readers, remember,  if you attach it, you CAN'T take it.",
          "id": 60,
          "comments": [
            {
              "score": 9,
              "content": "\n>The standard, generally, is if it requires a tool to remove (i.e. a screwdriver), you can't take it with you.\n\nthat's not really the case. this is only true in the case of compensation for the improvements being exchanged, typically in the form of deducting the value from rent. the improvements are made in lieu of rent. \n\nand most landlords can't just turn around and jack up the price. rent control and annual maximum rent raises do exist for lots of municipalities. regardless of improvements a tenant makes. \n\n>But, for US readers, remember, if you attach it, you CAN'T take it.\n\nit's much more nuanced than that.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4892,
      "content": "NTA. It sounds like they liked all your improvements to your room and wanted it for themselves.",
      "id": 62,
      "comments": [
        {
          "score": 1376,
          "content": "Exactly, ding ding ding, they sound selfish so that’s what you get. Exactly they wanted OP’s stuff and wanted her to move out to take her stuff. So stupid and mean, that’s why they’re still complaining. Sad, they deserve what they get.",
          "id": 63,
          "comments": [
            {
              "score": 330,
              "content": "It's interesting that people are gendering op as a guy inherent sexism is everywhere in the world.",
              "id": 64,
              "comments": [
                {
                  "score": 362,
                  "content": "It's very interesting I wonder if they're assuming she's a man because of the handiwork and doing the upgrading herself? \n\nIs it just that?",
                  "id": 65,
                  "comments": [
                    {
                      "score": 170,
                      "content": "Yep and also the being rich.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "Sure, make up your own things to be upset about",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -45,
                      "content": "I wasn’t being sexist. I just made a mistake.",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 122,
                  "content": "I know right? Literally the second \"word\" of the post is their age and gender.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 103,
                      "content": "Yeh but clearly they put F instead of M. They must have made a mistake based on all the DIY they did",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Wow, don't know how I missed that!  And I'm married to a very DIY-capable person (which really works out, I'm the braniac that has trouble operating the coffeemaker).  Shame on me :(  \n\nWow, don't know how I missed that!  And I'm married to a very DIY-capable person (which really works out, I'm the brainiac that has trouble operating the coffeemaker).  Shame on me :(",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "People almost always gender characters the same as themselves when it is not specifically stated. You are not making some kind of profound revelation. Youre just looking for a problem and creating them wherever you can.",
                  "id": 72,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "Yeah, her rich parents were jealous of the Alexa add ons, 😂",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 202,
          "content": "They couldn't even pretend that's not the case, she said all the cool stuff is less than 1yo... they were in countdown to her finish the job to kick her out, that's simply awful no matter who you're, but specially if you're a parent doing this to your child.",
          "id": 74,
          "comments": [
            {
              "score": 62,
              "content": "Yeah, holy fuck.  OP \\*just\\* bought all these new nice things.  They saw an opportunity to keep all of it.  Why else would you be so upset when someone took new things they just bought with them?",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "This is just insane. When our three  kids moved into their own places, we looked around to see what they needed. We took them shopping, nothing crazy. We wanted them to have what they needed. Can't imagine demanding they leave us their improvements",
          "id": 76,
          "comments": [
            {
              "score": 39,
              "content": "This is how my parents handle things, and how I intend to. I’ve lived out of their house for almost 4 years now and mom still drops by with stuff from their place or the store with a “thought you might need this!”",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Right? My 23-year-old still lives with her dad because rents here are ridiculous and she makes entry-level wages, but she's hoping for a better gig and her own place in the near future.\n\nI moved in with my boyfriend last year and everything we had duplicates/extras of (which was a LOT) are in a giant box in the garage, just waiting for kiddo to get her own place. Towels, dishes, glasses, you name it. My friends keep telling me to just get rid of it all, but I want to be able to show up at my kid's first apartment with all that stuff taken care of.",
              "id": 78,
              "comments": [
                {
                  "score": 21,
                  "content": "We bought my child’s TV when they moved out because they didn’t have the room for it. It was three years old and we paid them what they paid! I have boxes in the basement for my other two like you do. And they get their furniture. We also never let them pay for any upgrades or furniture to their rooms. We aren’t rich but we aren’t AH’s either.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My son-in-law’s mother has asked him to pay them for his bed and a dresser.  And has fussed about it for years.  They have been married for 19 years.  \n\nI can’t stand the woman.  LOVE my SIL.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "im greatful everyday that i have a normal, sane mother. some people are just fucked from the start with shitty parents. there are much crazier examples of course but i could never fathom my mom being like this",
              "id": 81,
              "comments": [
                {
                  "score": 2,
                  "content": "My youngest called me, crying, intoxicated. She was with friends, they told stories about their terrible moms. She thanked me for being a mom she loved and she could count on. It was sweet and sad. She was 33",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "[deleted]",
              "id": 83,
              "comments": [
                {
                  "score": 4,
                  "content": "My oldest just turned forty. I still buy them things when I buy for myself. I cook when I'm at their homes. We all vacation together. So glad our kids still like their mom and dad.",
                  "id": 84,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Aww, this reminds me of my own experience! When I got my first apartment, my mom took me shopping to make sure I had everything I needed. I'm very glad she did, because she brought a list of the necessities that included things I hadn't even thought about. I paid for most of it because I wanted to, but she did insist on buying some of it for me. My parents even insisted on me taking a few pieces of furniture from the house so I wouldn't have to buy it all or do without. It wasn't a lot, just some small end tables, a chair, and an older TV, but it meant so much to me. I'm the youngest of 4 kids, and they helped all of us move out on our own in similar ways. It really makes all the difference in the world to have supportive parents who want you to be your own person, but you know will always have your back.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "Since murphy2345678 said it, I don't need to, lol.  But yes, it sounded like OP's parents allowed OP to sweat, toil, spend her money on all the improvements, then figured \"This is nice, time to boot OP out, and we will enjoy this\".  NTA for OP. and I'm glad OP removed everything possible and took it to their own place.",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "They killed their golden goose",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "You think? /s\n\nLol. NTA",
          "id": 88,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2070,
      "content": "NTA\n\nYou took all YOUR improvements are replace them with the kind in place beforehand. Nothing wrong with that.",
      "id": 89,
      "comments": [
        {
          "score": 80,
          "content": "NTA: If I make improvements in an apartment I’m renting you bet I’m keeping all the old hardware to replace my stuff when I move out. People don’t get upgrades or free handouts just because they want them. OP was paying rent and provided some free labor. AND they wanted the tv too?! They’re out of their minds. I’d tell them to pound sand.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -3,
          "content": "[removed]",
          "id": 91,
          "comments": [
            {
              "score": 52,
              "content": "Comment stealing bot. Report as spam",
              "id": 92,
              "comments": [
                {
                  "score": 1,
                  "content": "What was there",
                  "id": 93,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Lol who knows, who cares. Whatever it was, It was stolen from someone further down at random, so just keep reading and you'll see it (even if you don't know it)",
                      "id": 94,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 960,
      "content": "NTA there is no reason why they should think you shouldn’t take the things you paid for other than them being your parents. They are the AH here not you. If they wanted to keep the improvements they should have helped pay for them and for the increase in energy consumption. If they had it’s likely that they would then have at least a leg to stand on legally. When improvements are paid for equally then they almost always stay with the property. There might be payments to one of the parties to recoup funds but that’s about it. You paid for it ALL including rent!! They benefited from it without paying a cent. NTA. Period.",
      "id": 95,
      "comments": [
        {
          "score": 282,
          "content": "> You paid for it ALL including rent!!\n\nExactly this. OP was a tenant, and tenants take their items when they move.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 557,
      "content": "NTA. After rereading the post you replaced everything you improved and payed for it to be replaced with normal versions and are paying for any fixes that could be needed. Everything else you are taking is yours and not actually something your parents need and can very easily live without. As long as you have replaced the things you initially replaced like the shower and lights or whatever then no you are not the asshole because everything else is yours and you brought to improve your space not theirs.",
      "id": 97,
      "comments": [
        {
          "score": 29,
          "content": "This clearly fits into the standard arrangement that people have when selling a house, which is anything bolted in stays with the house.  \n\nThe only thing that seems to come close would be showerhead, but even that is pretty common to take.",
          "id": 98,
          "comments": [
            {
              "score": 29,
              "content": "When I rented, I would have a good showerhead I would swap out and put their under the sink.  When I moved out, I took mine with me and placed theirs back on it.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 451,
      "content": "NTA the entitlement of your parents is on another level. What did they expect you'd do op? Leave all the expensive stuff you bought when they told you to leave their house? \n\nYour stuff. Your money. Your rules. \n\nEnjoy your new house!",
      "id": 100,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 404,
      "content": "NTA and i think your parents just used you until you made the house \"better\" and then decided to throw you out.  they're jerks for assuming you'd leave the stuff you bought with your own money. common use or not, they can buy the smart devices and whatnot on their own if they want them that badly.",
      "id": 101,
      "comments": [
        {
          "score": 82,
          "content": "My first impression too. It didn't play out that way, now they upset.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 251,
      "content": "NTA. You buy, you keep. If it wasn’t gifted to them, it’s not theirs, whether it was used in part of their house or not. You replaced the items, you didn’t leave them with nothing. Take what’s rightly yours.",
      "id": 103,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 192,
      "content": "They waited for her to posh up the house before kicking her out hoping she'll leave the items behind. What do people say able stupid games and prizes again? NTA",
      "id": 104,
      "comments": [
        {
          "score": 42,
          "content": "play stupid games, win stupid prizes!",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 188,
      "content": "NTA. You paid rent for being there. Everything else was a favor you did that benefited everyone at the time. Since they asked you to move out, that normally entails removing everything that belongs to you, which is everything you purchased.",
      "id": 106,
      "comments": [],
      "relation": "Support"
    }
  ]
}