{
  "post content": "\nFor context, I’m a quadriplegic (C7 complete) I was injured relatively and got out of rehab a month ago. There’s someone who goes to school with me, let’s call her Jade, that has hEDS (a joint connectivity disorder). Lately she’s been messaging me a lot, trying to give me advice and kind of using me as a vent outlet. Normally this would be fine with me, but I’ve had some of my own issues lately. \n\nThis week, the issue was mobility and public perception . She was ranting about how her disorder is invisible and how hard it is on public transport when she needs to sit down but doesn’t ‘look’ sick. I do not relate to this issue. I’m in a powered wheelchair most of the time (working on eventually being able to move to a manual one for ease of life- getting there.) I basically said ‘that would suck.’ She started to ask if I’ve ever had someone tell me something like that. I haven’t, and I explain that. \n\nForward to yesterday. I’m on my way to physical therapy, and she texts me complaining about dislocating her knee. I look but was just arriving, so didn’t immediately respond. So I guess I ‘left her on read’. After my PT session, I check my messages again. She left three question marks, each as separate messages. I say “sorry, was busy. Hope you feel better”. Jade says “thanks, what were you doing?” I explain physical therapy and she starts ranting about how she can’t afford physical therapy and insurance won’t cover it. I respond with “well do you really need it?”  \n\nI wasn’t intending to be accusatory, more curious. She talks to me a lot but I’m definitely not an expert on hEDS. She says that not everyone has a visible disability like I do and that she has it just as hard as me. And I know I probably should’ve not said anything, but at that point a little part of me broke. She’d been complaining for me for weeks about how hard it is to stand up on the bus, how hard it is to walk from a to b without dislocating something. And that sucks- I get it. But at the same time she’s just been really dismissive of any issue I’ve had, not really letting me bring it up. So I basically say “come back when you break your spine, at least you can walk.” \n\nAfter that, she goes silent. I do feel slightly guilty and there’s definitely a better way to have phrased that- but at that point I was just really fed up. Today I’ve dealt with the repercussions in my friend group. She told everyone what I said, and the reception has been pretty mixed. I  don’t really know what to think. I know that what I said was a bit rude- but I don’t know if that makes me an asshole or if it was justified. Any opinions are welcome!\n\nEdit to address some comments: I’m quadriplegic because all four limbs have limited function, with function in my legs being completely gone, and function in my arms only being somewhat gone. The way I was injured makes it so I have some movement in my arms, but yes that’s still quadriplegia as function is still heavy impacted! A couple people were confused by this and I thought I’d clarify.",
  "id": 1,
  "comments": [
    {
      "score": 1203,
      "content": "I wanna say everyone here is the asshole, but more her than you. \n\nShe’s basically using you to vent and talk about her struggles, but won’t give you the same benefit. \n\nAs someone who’s kneecap literally came out of place and was on the side of my calf, yes, you do in fact need physical therapy for that. \n\nI had nightmares for over a year of walking with out crutches or a knee brace.  \n\nTo this day I refuse to run or play sports because of the mental and physical pain I went through. \n\nShe was an absolute asshole in this situation, and I understand your words came from a place of pain and frustration, so I don’t really hold it against you, but it was definitely an asshole move to dismiss her pain just because you’re dealing with something different. \nI will admit- she specifically deserves it because she’s been doing it to you, but it just kinda comes off like you’re dismissive of it all together because, “at least she can walk.” Ya know?? \n\nBesides that, I don’t think you did anything wrong. She doesn’t get to use you as a damn therapist/emotional support animal and get mad when you’ve had enough. \n\nFriendship should be equal on the support you give and receive.",
      "id": 2,
      "comments": [
        {
          "score": 399,
          "content": "That’s fair, thank you for the perspective!",
          "id": 3,
          "comments": [
            {
              "score": 66,
              "content": "I have also had my kneecap dislocated! While I don’t have any joint disorders, knee surgery and physical therapy very much suck. Even on crutches and in my big ass knee brace, I would constantly tell myself “at least I can walk”. There were many days before my surgery where I couldn’t walk, because as it turns out, you need your kneecap for that. Even though my situation was temporary, it’s very isolating. You might be the only person she has that can even remotely relate to her and she’s just dumping all that built up frustration on you. You’re not an asshole, but you’re also not a therapist (I assume). It’s not about who’s more disabled, it’s about the constant emotional dumping.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Another patella dislocated here, second time was 3 months ago and I'm still using a cane, going to physio, and trying to make my life work (I'm older than you, with two small children and a career on the go). I have the bonus arthritis and mobility issues from childhood clubfoot to deal with and an anxiety disorder as the cherry on top. I worry that the next time I'll be carrying my child and will hurt them, that I'll fall down the stairs. I already can't run after my children, what if it keeps getting worse? And so on.\n\nMy co-workers will complain about an ache or a pain and then catch themselves, saying things like \"Oh, sorry, I mean, it's nothing like what you're dealing with\". I tell them to cut that shit out. I don't have a monopoly on pain, or knee/foot issues, or on the right to worry or complain. Everyone's burdens and pains are valid, independent of those around them, and don't need to be justified or compared to what others experience.\n\nThat said....she is totally the AH for using you as an emotional crutch. You seem fresh into this journey, this new life you didn't choose but have to live with regardless. At this point, support should be going in *towards* you, not being drawn out *from* you. This is not a healthy friend for you to have right now, and I'd distance myself from her if I were you.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Late, but holy shit do I appreciate seeing a post where someone actually listens to the commenters they were supposedly asking.",
              "id": 6,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "It’s not friendship if the friend keeps pestering her and trying to one up her. NTA. And I know I’ll get blasted for this but honestly? OP *does* have it worse than her. A whole lot worse. It’s kind of like if I had pneumonia and my friend kept complaining about a cold. Yeah sure her problem sucks. But OPs disability absolutely sucks more.\n\nEdit: I’m surprised how lenient people are being with the friend. Can you guys imagine being a healthy young person and suddenly becoming paralyzed from the neck down? OP is right. This girl can still walk and that’s worth a lot, at least in her world. Friend lacks the self awareness needed to pick her venting audience. She’s TA.",
          "id": 7,
          "comments": [
            {
              "score": 17,
              "content": "Yeah, I have EDS and sometimes when I explain it to people I hear stuff like \"I don't know how you cope\". My answer is that I deal with it, and there's lots of people with stuff that's way worse. My uncle was a C5 quadriplegic and I know how hard his life was. I'll be fine, but he ended up dying from a kidney infection because he refused treatment because he just didn't want to live anymore. Daily dislocations and pain seem pretty manageable next to his struggles.\n\nNTA, and you need to separate yourself from her. I get a sense of her wanting to have her own pain acknowledged, but that is not your responsibility, especially right now as you navigate your new way of life. I'm sorry you have to face this hardship, and I wish you strength, support, and wellness.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -32,
              "content": "I’d rather never walk again than live in constant pain every time I did so, but to each their own. The “friend” has a chance of not getting to walk anymore too, with the condition she has.\n\nAnd while OPs situation is terrible, they don’t exactly have the right to pull the, “I have it worse so shut up” Card. You just shouldn’t do that. \n\nThese are two different situations that you can’t even compare. Neither has any idea what the other is going through or how they feel on a day to basis, so neither has the right to comment on how the other is living. \nThat’s why they’re both assholes in this situation. \n\nOP is just less of an asshole because this one specific person actually deserves the treatment she got because of how shitty she has been through the entire friendship. \n\nIf it wasn’t for her annoying and down right disrespectful actions then OP would be the only asshole because it’s never okay to tell someone they can’t complain or vent just because you “have it worse” when you couldn’t possibly imagine what they deal with. \n\nEspecially since having an “invisible” injury does come with a lot of negative judgment from the people around you when you do certain actions that are for ‘disabled’ people, even though you qualify. \n\nOP would’ve avoided being an asshole all together if they would’ve went with the, “I’m dealing with my own issues right now, a big one which includes recently becoming paralyzed, so I just can’t focus on yours” route, instead of the, “you can walk so oh well, my issues are worse” route.",
              "id": 9,
              "comments": [
                {
                  "score": 48,
                  "content": "Seems to be a bit of a misconception, but just so you know quadriplegia doesn’t = pain free. It’s also not really about walking in the long run.",
                  "id": 10,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 34,
                  "content": "Sorry but I don’t agree with you. She can pull the I have it worse card because she literally does. And I don’t think you’re understanding what a spinal cord injury at C7 does. It not only paralyzed your limbs, OP probably doesn’t have control of any of his muscles including his bowels and bladder. Would you still prefer to be in OPs situation knowing that he probably has to wear a diaper for the rest of his life? What about the fact that OP will forever be immunocompromised and is at far greater risk for something benign to become deadly? How about the fact that if she is a woman, she’ll likely never be able to have her own kids? and what about the psychologically trauma of what she’s going through? \n\nDisabilities suck. They really do. But let’s not act like there isn’t a scale of how terrible they are. The fact of the matter is, OP is in a much worse situation than this friend. That’s just a fact. I can’t ever imagine being so insensitive to someone to bitch about pain while walking when the other person is a recently made quadriplegic. It shows great lack of self awareness and is just in poor taste. I’m surprised by this sub I really am. I’m hoping this kind of view is due to the naive population that frequents it.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 24,
                      "content": "I think a lot of people here based on their comments don’t necessarily understand what quadriplegia is exactly. I don’t really want to say that I have it worse than anyone because everyone deals with their problems in different ways- but I think it might be fair to say that I’m less physically capable than my friend if that makes sense. I don’t have hEDS so I don’t know what it’s like, but she can still travel and attend school and walk, even if it’s painful. At the risk of being a bit too personal, She doesn’t need an aide to help her bathe and get out of bed. A lot of people responded with the assumption that quadriplegia = oh, OP can’t walk. Which is true, I can’t walk. But if I could choose between regaining bladder and bowel function or regaining the ability to walk, I would choose the first option in a heartbeat. For me, my biggest struggle isn’t about not being able to walk. If it was just my legs that didn’t work, that’d be one thing. It’s about the loss of independence. I don’t wear diapers personally, I use a catheter and that’s worked fine most of the time. And I’m female, just for reference.",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Lol okay then. \n\nI dated a guy who was quadripeligic (same as OP with movement in arms and upper body but hands affected). He had to use catheters in the shower to fully empty his bladder, he had leaks often from the condom catheter coming off in bed, he had to schedule his shits with laxatives, he couldn't fully use his hands to do things, he couldn't make his own bed, we would have to get people to carry his wheelchair up and down stairs if we went to events that weren't accessible, he couldn't have sex without a viagra and then could never feel it, etc. etc. etc. Also, people who are paralyzed can end up with horrific infections and other issues in areas they are paralyzed and not realize it for way too long. They can also end up with horrible neck and back pain from years of just sitting in a chair and from uneven movements. Do you think they can't feel in the rest of their body?\n\nThere are lots of things people who are paralyzed can do but it is completely fucked in the head and shows how little you understand about different disabilities to think you would rather be OP than OP's \"friend\" (no offence OP, but yeah... duh that you have it worse wtf is even the comparison?).",
                  "id": 13,
                  "comments": [
                    {
                      "score": 12,
                      "content": "No offense taken, I would also rather not be me lmao",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "So I don't have anyone in my life who has a physical disability (visible or not), but I would still think that complaining about how hard it is to stand/walk to someone who's in a wheelchair is insanely insensitive. To do it repeatedly shows a massive lack of awareness/empathy for the other person, or perhaps they're just really narcissistic. After several times, I think it's totally fine for OP to remind her that she's still able to walk, while they cannot. I don't think their reply was nearly as rude as the \"friend\" has been, and in this case totally justified.",
          "id": 15,
          "comments": [
            {
              "score": 5,
              "content": "Agreed, totally insensitive and inappropriate.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This. \n\nI've got a rare bone disease that cost me both hips so far. \n\nThe mental block and dear I have is very real. I'm still stuck to crutches.",
          "id": 17,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Having joint connectivity issues versus a spinal cord injury are night and day",
          "id": 18,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 299,
      "content": "ESH. She's venting to you and giving unsolicited advice. She obviously needs a friend. Unloading on you, I assume you're an acquaintance as best, a veritable stranger isn't ok. That being said I feel like you could have handled it better and told her straight up that you aren't someone to vent to/don't want her to contact you about disability problems. You both don't share the same disability so you guys can't know each other's struggles. Being paralyzed sucks. Being in constant pain sucks. They suck differently tho.",
      "id": 19,
      "comments": [
        {
          "score": 154,
          "content": "I suppose she’s a bit of a friend. I had talked to her maybe once in English class before I was injured. After my injury she started messaging constantly. I think maybe she wanted someone who relates to disability to talk to, and I do feel a bit bad about being so blunt with her and looking back I realize that I should’ve used a lot more sensitive wording.",
          "id": 20,
          "comments": [
            {
              "score": 40,
              "content": "Life happens. I get finding someone to relate to. I live in chronic back pain but I can't really relate well to my brother in law who is paraplegic. Maybe if you talk to her again recomend r/chronicpain. Unfortunately being disabled is a large umbrella and she will find her people. I dont think it's anyone is really am asshole. I think y'all are just young.",
              "id": 21,
              "comments": [
                {
                  "score": 9,
                  "content": "There’s also /r/ehlersdanlos which is pretty active and imo generally more supportive than /r/chronicpain. Plus similar resources on other social media sites",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I get the being over-enthusiastic about finding someone who can relate to mobility probs, but if all your interactions are functioning as some sort of peer counselling or group therapy that can rapidly be unhealthy. There's a good reason why therapy is generally only for an hour a week, or day, or whatever length of time it is it always has a clear start and end time. Do y'all spend much time talking about the rest of life like classes, politics, TV shows, crushes, hobbies....? Also, it sure sounds like she could benefit from other people to talk to about her physical struggles.",
              "id": 23,
              "comments": [
                {
                  "score": 30,
                  "content": "She only really ever talks about physical stuff. I don’t think we’ve ever had a real conversation about anything else",
                  "id": 24,
                  "comments": [
                    {
                      "score": 44,
                      "content": "That's not friendship. She's only interested in talking to you because she thinks you can relate to her about this one topic, but real friendships delve into your thoughts about a variety of things. I had to end a friendship once because it went from interesting discussions and debates about things to just a text every day from the person about \"how happy they were to be friends.\" Maybe you could have been less blunt, but your situation sucks and on top of that she's treating you like a free therapist. NTA.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yeah. She needs a support group or something. That ain’t you. If she doesn’t want to talk about anything else or listen to what you have to say about your issues or other convos then she’s not your friend and she shouldn’t use you. Disability or no. Perhaps the school counselor can help her connect with other people on her own issues.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "NTA. You’re not obligated to be her therapist. I have a friend like this who only ever talks to me to complain/vent and it’s emotionally exhausting.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Yes, but unless I read your post wrong, this is still something very recent to you. She shouldnt be trying to use you as a source for emotional support when you probably need it now much more than her. I'm not trying to quantify your disabilities or stratify them, but if this is something new to you then you're adjusting to a lot, whereas she is struggling with the same inconveniences she's had for years. If this had been a situation where she began reaching out to you because she felt she could offer support and insight for what you're currently going through then that would be very different, instead how you describes it makes it sound like you could suddenly provide that for her.",
              "id": 28,
              "comments": [
                {
                  "score": 11,
                  "content": "Yeah, it’s still fairly recent. I was injured six months ago and was only out of in-patient early last month.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "You can't change what you said, but I do think it's important that she gets feedback on how she's treated you. Feel free to use and tweak as necessary:\n\n\"Acquaintance, I apologize for being dismissive of your disability. I should not have lashed out, because my real concern is that I don't feel like our friendship has balance. You saw me as someone who could understand you better, and I get that- but it seems like you *only* talk to me when you have issues with your EDS. That makes me feel like you see me as a free therapist, not a friend. I wish you well, but this dynamic where you dump on me and then go about your life is not healthy for me, and I need to take space for myself.\"\n\n(edited to add an introduction)",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 172,
      "content": "NTA, honestly she sounds extremely exhausting to get along with, from what I get from the messages she's just using you as a verbal Dear Diary..\nI get it she has a lot of issues and I understand she's in a frustrating place where people don't believe her because of her invisible illness \nbut I'm guessing your injury is fairly new ish ? and you're still trying to recover from it the last thing you need is someone whinging and moaning and groaning in your ear while you're trying to get over your own struggles and especially if she's not listening to you at all just dismissing your feelings I personally believe that you've done nothing wrong..\n\nSometimes a lot of people take a lot for granted the too busy focused on their negative rather than appreciate what they got, yes a disability sucks but you can't constantly whinge and moan and groan if you cannot physically change it.. \n\nI have a friend who has 11 different disabilities diagnosis not once she complains she said she can't change it she has to live with it for the rest of her life so she doesn't lie there and moan and groan  but to be fair she can't lie for too long without being in pain..\nShe tries to focus on the good things she's a freaking genius for goodness sake lol her brain is amazing, she focuses on her passion for the medical field rather than sit there and moan and groan..\n\nI may be go against the grain but in my opinion its  NTA",
      "id": 31,
      "comments": [
        {
          "score": 97,
          "content": "Yeah, my injury was fairly recent. I was injured 6 months ago and got out of in-patient rehab a month ago. I’m trying to come to terms with everything now though.",
          "id": 32,
          "comments": [
            {
              "score": 105,
              "content": "Then definitely NTA, then that's really really selfish of that chick to lay it on thick and use you as a dear diary while you're just coming to terms with your own life changing disability..\n\nFor gods sake that's like going up to somebody who lost a loved one now and then complaining to them about losing someone years ago .\n\nHonestly I still stand my ground what she did was selfish self absorbed and taking what little life she has for granted for someone who's just got it big slap in the face..\n\nNot only you're trying to deal with your emotions feelings frustrations but to put her crap on to you without even offering something back, this chick not worth it honestly she's not really worth having a friendship she's just using you.",
              "id": 33,
              "comments": [
                {
                  "score": 65,
                  "content": "I don’t think she’s trying to be selfish, I think she just wants someone who relates to having a disability. But I really don’t relate with her- most of her problems are related to walking (ie they wouldn’t let me sit down, I was walking and x happened, etc.) and I just can’t do that so I don’t really relate. Idk",
                  "id": 34,
                  "comments": [
                    {
                      "score": 43,
                      "content": "maybe sorry but jumping on to someone who's just recently got a disability to vent, kinda does sound kinda selfish to me, especially if it's one-sided, but if she's willing to listen to you vent complain moan and groan every little emotion then yes it's not being selfish..\n\nBut that's what I got from the post of course I don't know your real relationship but give and take in any relationship is healthy if you're just taking and taking and taking it leaves you emotionally exhausted..\n\nif you want to salvage the relationship maybe you both need to sit down in person and talk an express each other's feelings and lay it all on the table.\nAnd give you an opportunity to express your feelings as well and how you been feeling because at the end of the day both of you have worth to express yourself..",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "It's only been 6 months? That means you're still trying to process the scope of *your* disability. It makes sense that you don't have the juice to be someone else's sounding board. I hope you have good mental health support as well?",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Can I say that you seem like a really great person. You're super understanding of her position, and frankly I think what you said to her was warranted. She needs to realize how totally insensitive she's being to you, and I think what you said did that.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "I'd say worse. It's more akin to someone complaining about their spouse to someone who's partner just died.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Ooohhhh , you are still dealing with shit and conflicting emotions. You shouldn’t be anyone else’s support system, my god.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 63,
      "content": "NTA.\n\nI have eds, and yes, of course physical therapy is absolutely necessary when your joints randomly screw up. I used to pop out my hip just rolling over in my sleep. Physical therapy strengthened the muscles I need to hold the hip in place.\n\nBut you’re not some sort of monster for not realizing that. It sounds like she’s just very sensitive.",
      "id": 40,
      "comments": [
        {
          "score": 6,
          "content": "Fyi, a friend with eds cannot stop singing the praises of prolotherapy. She has been in treatment for about a year and is doing so well she has her life back.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "I've seen pretty divided opinions on the usefulness vs risks of PT for EDS (I still want to give it a try tho)",
          "id": 42,
          "comments": [
            {
              "score": 7,
              "content": "This is interesting! I’ve never heard about a downside but my situation is a little unusual. I started PT when all anybody knew is that my hip had begun to randomly pop out at a young age. It wasn’t until later that I was told I had eds. At that point, the pt was already working so well for me that my doctor wouldn’t have said a thing about downsides. \n\nIt’s a little frustrating that I basically have to do the exercises every day forever to keep being able to walk. Sometimes I just want to chill on the couch. But still worth it on the whole. Highly recommend.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 31,
      "content": "NTA. Holy crap, you are really young, younger than she is by two years (I read the whole thread), and you’re dealing with this huge life adjustment that’s really fresh. Yeah, you snapped a little. But I’m 40 and supposedly grown up and I might’ve lost my shit a lot quicker than you did if someone decided we were besties based on a new-to-me disability, and then established the communication pattern you describe. \n\nWhat the fresh hell?! And why haven’t your friends defended you?  Is she just a lot louder (seems like it based on your post)? I’m so perplexed.\n\nWishing you all the best for your continued PT and life in general.",
      "id": 44,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 31,
      "content": "NAH. \n\nThis is a tough situation all around. There is no doubt in my mind that Karen faces some serious and unique challenges as a result of her condition - and that she probably doesn't get a lot of understanding or empathy from other people in her life about these challenges due to the nature of her condition. That sucks and is understandable. \n\nWhat she's doing is latching on to you as an outlet for these feelings, under the presumption that because of your condition, you will understand and empathize where others wouldn't. The problem is that in doing so, she is projecting her own challenges on to you based on assumptions about your experience based on the way you look - in essence, the same sort of biased behavior she encounters in her own life. That isn't cool. \n\nI think you're N-T-A because you did your best here. She's not treating you like your own person or valuing your friendship on its merits - rather you're an emotional outlet to her **solely because of your visible disability**. That's exhausting and disrespectful to you, even if she doesn't mean it that way, and you snapped. \n\nI think she's N-T-A because this is a really complex social dynamic, not your run-of-the-mill obvious asshole behavior. She's in the wrong, but I think that a frank discussion about the nature of your friendship and the implicit assumptions she's making about your challenges in life could go a long way here. \n\nAs I'm sure you know, nobody wins in the Oppression Olympics. You both face different challenges for different reasons, and she needs to understand that conflating her own problems with yours or making assumptions about what life is like for you is just as degrading and belittling as the things she complains to you about.",
      "id": 45,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 26,
      "content": "NTA. This drives me insane. When people take a much milder  case and say they can understand what your disability is. \n\nI'm ADHD and people constantly tell me they know how I feel because they forgot their keys once or get figity in a boring neeting. And I want to scream \"it's not the same thing.\" \n\nKnowing how much it bothers me, I get why it drives  you crazy. Most people have no clue how challenging doing something simple can be. I got a small glimpse with this great video where all the guy wants to do is get a bagel and it was horrendous. \n\nSo I'm going to say your reaction was justified. \n\nHers the video: \n\n\nhttps://youtu.be/LhpUJRGrZgc",
      "id": 46,
      "comments": [
        {
          "score": 6,
          "content": "[deleted]",
          "id": 47,
          "comments": [
            {
              "score": 7,
              "content": "Eh, my town is fairly accessible. Elevators can be rough when they’re full though. And restaurants are annoying, I’ve only gone to own since my injury and that was such a mess because I still wasn’t great at navigating my power chair and ended up bumping into a bunch of people accidentally. But I could probably get a bagel in less than four hours haha. Maybe..",
              "id": 48,
              "comments": [
                {
                  "score": 2,
                  "content": "You're actually being much nicer to her than I would have veen.  She is obviously self-absorbed and is using you as a sounding board.  You don't need that.  You sound very kind, and I'm sorry for what you're going through.  That she has such a lack of understanding towards your injury takes my breath away.  Yes, she has a painful condition, but it's not the same.  Do you really want to be friends with someone so selfish?",
                  "id": 49,
                  "comments": [
                    {
                      "score": 3,
                      "content": "After today I doubt she’ll want to be friends with me anyways",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Yeah, we really have no idea what it's like until we see it firsthand.",
              "id": 51,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "That was an amazing video",
          "id": 52,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "NTA. It seems like all she cares about is winning the misery olympics, and not actually being there for you. Good luck in your recovery!",
      "id": 53,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "NTA in my opinion. She somehow decided you were in a 2 person support group, where only she gets to talk. All the time. And makes it all about her. I understand needing to vent to a sympathetic person and it's very kind of you to be there for her so much. But this JUST happened to you and you are still adjusting. You're going through physical therapy which is no picnic and can hurt more than getting the injury. She kept prodding you with texts because you didn't immediately comfort her, and you snapped. You said what popped into your mind first. And you weren't out to be malicious. Maybe not the most compassionate thing to say but honestly she needs to hear it. I have my own disabilities but I know I'm lucky compared to most and I don't vent to others about it either. Don't beat yourself up, it was in the heat of the moment. Also, if she can vent to your friends about her feelings being hurt, she can vent to them instead of you all the time. You can't be her emotional support friend 24/7",
      "id": 54,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "Honestly, NTA. There is a trend of hEDS in my family, and we're quite confident I have it. However, she cannot dismiss the disabilities of others. If she only talks to you about her problems, and not your own, I can't blame you for getting uppety. \n\nAnd just saying, I totally say to people what you said to her a lot. Mostly in jest, but still.",
      "id": 55,
      "comments": [],
      "relation": "Support"
    }
  ]
}