{
  "post content": "My dad paid a music school to give me piano lessons and he paid for a year but there is two recitals in the year (1 in July 1 in december). I told dad that I hate piano and I suck at it but he forces me to take classes 2 times a week and practice everyday but i’m still super bad at it. The first recital was yesterday and i knew i would be humiliated in front of many people because i can’t play very well so i decided to just not show up (I went to the park instead).\n\nWhen I came home dad was the most angry then i have ever seen him. He screamed at me a lot and he even hit me (he rarely hits me) and he said that i had been kicked out of the music school and they won’t give him his money back for the rest of the year and he had bought me a piano to practice at home for nothing. Some mates from the school contacted me on FB after that and they were also really mad and told me that the whole concert was ruined because i wasn’t there and they all had a bad day because of me.\n\nI feel like i was really selfish but I hate piano so SO much that i really don’t regret it and i think i’m mostly just happy i don’t have to take lessons anymore. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 21,
      "content": "ESH.\n\nYou, because you let down all of your school colleagues. \n\nYour dad is also an asshole because he hit you.\n\nI’m also wondering whether your dad wanted you to continue till the end of the year to show you once you commit to something you should see it through, but even without that info I can judge that everyone sucks here except for all the participants of the concert who were let down with you just not showing up.",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 17,
      "content": "ESH. obviously your dad sucks for hitting you, but you’re also an asshole because that was an extremely selfish thing to do. you had a direct negative impact on several people and don’t even feel bad about it? yikes. \n\ndoing things you don’t want to do is part of life, get used to it",
      "id": 3,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "NTA. If you made your feelings clear that you didn’t want to learn piano and your father spent all this money anyway trying to force you to be a musician then he’s TA. We don’t get to decide these things for our kids. \n\nSome things we force our kids to do because it’s important, like eating vegetables. Playing piano is not one of those things.\n\nAnd speaking as a musician myself, these year end recitals are never ruined because one person doesn’t show up. If it was, then that was bad planning on someone’s part because people get sick.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "YTA - You listed all the people who were hurt by your actions. You informed no one in advance that you wouldn’t be at the recital. You lost your father a lot of money. On top of all of it, the only thing these people were trying to do was help and encourage you. You couldn’t be bothered to even let them know you wouldn’t be there. Huge YTA.",
      "id": 5,
      "comments": [
        {
          "score": 3,
          "content": "Is dad not the asshole for forcing his child into an activity that he hates? Why is it that it's on OP to learn piano?",
          "id": 6,
          "comments": [
            {
              "score": 8,
              "content": "Having been a child, that's what parents *do*. Children rarely act in their own self-interest when considering the long term. Nothing wrong with making a kid engage in an activity they claim to hate, within reason. \n\nMy own parents forced me to participate in boy scouts. I hated it at first, and now 20 years later my best friend is someone I met in that troop.\n\nThat said, re-evaluating *after* the recital would be within reason, and the dad is 100% an ass for hitting. Might be reading too much into it, but seems like this is just one of many issues between child and parent.",
              "id": 7,
              "comments": [
                {
                  "score": 4,
                  "content": "Eh, my experience is completely different.\n\nConsider the fact that OP is 15, he's an adult in 3 years, it's not like he's a little child who doesn't know himself at all. He could have at least gotten classes he cares about.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 2,
                      "content": "That OP is 15 was not in the initial post.\n\nIt really depends a lot on the situation whether it's reasonable or not. For all we know the father set the whole thing up to try and help OP be more confident/less self-criticizing. Or maybe the father just thinks that music is a thing to do for social standing, or is trying to show off to neighbors. We don't know.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "ESH - your father is a pig, but you mishandled this. \"Dad, I'm no good and I will not be attending the recitals.\" And get the damn teacher involved.",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "Your dad is TA for so many reasons, but mostly because \"rarely\" is too often. \n\nYou should show up to things you say you'll go to, but bailing on a recital has nothing on hitting your kid. Apologize to your mates if you wanna keep those friendships. Hope you're OK.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA. You made your feelings clear and you are plenty old enough to decide what hobbies you want to pursue. I’m a pianist and recitals like this aren’t ruined by one person not showing up. If you aren’t there, they skip over you. I missed one in my last year (I was in the ER so I had a good excuse but still) and people noticed I wasn’t there (mostly because I was the only senior so I had the largest set) but it wasn’t a big deal. Your friends were probably just looking forward to seeing you and over-exaggerated. Your father absolutely should not have hit you.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "YTA\n\nReluctantly, I think you’re the asshole here.\n\nYou may have a point about piano lessons that you don’t want to do. If you said how you were feeling before they were booked, and you’ve made your feelings clear throughout, you should expect your dad to show some degree of understanding. You’re within your rights to refuse these lessons, particularly if you never chose to do them in the first place. \n\nHowever, not giving people warning is the assholeish thing here. I think letting your classmates down is particularly bad. Your dad may have brought it upon himself by not listening to your concerns, if you’ve been honest with him.\n\nThere are ways to opt out or refuse while keeping yourself on the moral high ground.",
      "id": 13,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy dad paid a music school to give me piano lessons and he paid for a year but there is two recitals in the year (1 in July 1 in december). I told dad that I hate piano and I suck at it but he forces me to take classes 2 times a week and practice everyday but i’m still super bad at it. The first recital was yesterday and i knew i would be humiliated in front of many people because i can’t play very well so i decided to just not show up (I went to the park instead).\n\nWhen I came home dad was the most angry then i have ever seen him. He screamed at me a lot and he even hit me (he rarely hits me) and he said that i had been kicked out of the music school and they won’t give him his money back for the rest of the year and he had bought me a piano to practice at home for nothing. Some mates from the school contacted me on FB after that and they were also really mad and told me that the whole concert was ruined because i wasn’t there and they all had a bad day because of me.\n\nI feel like i was really selfish but I hate piano so SO much that i really don’t regret it and i think i’m mostly just happy i don’t have to take lessons anymore. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 15,
      "comments": [],
      "relation": "No"
    }
  ]
}