{
  "post content": "I'm getting married and my fiancé and I don't want to serve alcohol at our wedding. We've got no deeper motivation for it beyond the fact that neither of us like dealing with drunk people and we don't trust our respective families enough to restrict themselves. \n\nWe really just care about our ceremony but we are also having a reception, and we're going to be sending out invitations soon. This alcohol clause is really bothering people, and I've had multiple friends and cousins (and some older relatives) tell me that I would be an a-hole for not \"considering their wants\" at my wedding. I understand considering their needs (like I'm not inviting my friend with a wheelchair to a wedding on top of a bunch of stairs) but I think that wants is a bit excessive. We're not charging them anything to attend or requesting a gift; my husband and I are paying for the wedding entirely ourselves and have invited people under the impression that they'll just decline if something is really bothering them so much. \n\nI don't know if I'm being excessive, though. The people we're really close to (our parents, siblings, and dear friends) are all coming regardless of the alcohol, so this is just an issue for relatives we're not as fond of and honestly wouldn't mind if they come to our wedding or not. But I think that calling me an a-hole is a bit extreme, and I'd rather they just outright reject instead of making suggestions that we don't really want to take. I understand that weddings can just be a hassle for some people, and the alcohol's the only thing making it worthwhile; fine, then, stay at home and have some alcohol. But I feel like I'm missing something. Is there some sort of social code I'm not seeing?",
  "id": 1,
  "comments": [
    {
      "score": 1347,
      "content": "NTA.  Good way to weed out the people who are only showing up for an open bar.  Congratulations!\n\nETA:  OP said her motivation for not having alcohol is that people on both sides of the family will not restrain themselves.  Not how they want their wedding.  Isn't the point of a wedding to have people witness a joyous ceremony, a milestone in your life?  Some are commenting like the point of the wedding is to have a big party for everyone else to enjoy.  It is the bride's and groom's day, right?  The bride and groom will remember this day for the rest of their lives.",
      "id": 2,
      "comments": [
        {
          "score": 187,
          "content": "Thank you! :)",
          "id": 3,
          "comments": [
            {
              "score": 320,
              "content": "When they complain, just reply with \"thanks for letting me know that you will not be attending\".",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "I attended a wedding about 8 years ago where there was a small bar that completely ran out of booze after about 1.5 hours. Everyone got a drink for dinner and maybe one more. \n\nThe bride and groom planned this intentionally to avoid:\n- having guests throw fits beforehand\n- ppl knowing it was dry so bringing their own booze\n- what they knew would inevitably be some family members getting toasted and doing something dumb. \n\nI don’t drink much so it was fine with me, and it seemed like the only ones who really cared were the guys who would’ve done something dumb. \n\nNTA",
              "id": 5,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I've been to many dry weddings and many weddings that served alcohol. I don't remember any drama at any of the dry weddings. I remember loads of drama at so many weddings that served alcohol. All drama involved alcohol and two involved stupid use of anxiety script. \n\nIt's your day, do you. Anyone unsupportive of you is not someone you wanna share your day with. \n\nNTA.",
              "id": 6,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Listen, my fiance and I are still debating whether we want wine at the wedding if only because if we do we have to (a) get a license for the day and (b) per the venue's rules, hire a security guard. Per annoyance and cost alone, I'd consider no alcohol at our wedding, so don't let your family bully you.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -3,
              "content": "You could easily do a cash bar to mitigate the problem drinking. Also have the bartenders stop serving alcohol early like at 9. Lot of options out there to deal with excess drinking. Alcohol is a social lubricant and a dry wedding is no fun.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "This comment doesn’t have enough upvotes",
          "id": 9,
          "comments": [
            {
              "score": 13,
              "content": "I gave it another. Working on it!",
              "id": 10,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "I’ve never understood why people can’t go a few hours in a social situation without drinking",
          "id": 11,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -37,
          "content": "Doesn’t have to be an open bar. What’s really happening is the Introverts are being weeded out.",
          "id": 12,
          "comments": [
            {
              "score": 23,
              "content": "I’m an introvert. I enjoy an occasional drink. It wouldn‘t bother me in the slightest if I were invited to a wedding with no alcohol. Same with my introvert husband. In fact, the only people I know who would find a dry wedding deeply distressing are pathetic AH’s who can’t figure out how to be sociable or have fun without liquor. So maybe try again, but with fewer ignorant stereotypes.",
              "id": 13,
              "comments": [
                {
                  "score": 19,
                  "content": "I’m an introvert. Even more so since Covid. An hour or two is enough socializing for me. \n\nI like a glass or two of wine now & then. Alcohol-free wedding (or event) is absolutely fine.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I'm an introvert, and I would far rather be at a dry wedding making awkward conversation, than have to deal with the second-hand embarrassment of watching drunk people think they're having fun.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Starting to think I have social anxiety disorder lol",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Disagree. Many alcoholics are extroverts.",
              "id": 17,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Are… are you implying introverts are alcoholics?",
              "id": 18,
              "comments": [
                {
                  "score": 1,
                  "content": "No. I’m suggesting it’s much easier to have small talk after 2-3 drinks, which what most of the reception is, small talk.",
                  "id": 19,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I have extreme social anxiety and I can handle a dry wedding. It’s one part of one day",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I'm an alcoholic AND an introvert. If I loved/cared for someone, going one night without alcohol isn't the end of the world.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 597,
      "content": "NTA. Its your wedding. I will say all the dry weddings I've been to were the most quiet, and to be blunt, boring receptions I've been to. I'd just prepare yourselves for guests leaving early.",
      "id": 22,
      "comments": [
        {
          "score": 343,
          "content": "I've been to two:\n\n1. An afternoon ceremony with cake and champagne in the church followed by a semi-secret REAL reception for those who made the cut. Which, rudely, omitted people who flew in. Tacky.\n\n2. A dry, vegan reception where people stayed for the full toasts etc but didn't go long except for the inner circle. I learned something that hadn't occurred to me before: I don't care if I'm served alcohol on any particular occasion, but an event full of people who don't know each other, stuck together for hours, without something to focus on like a work conference, none of whom are drinking, is another level of dry. You can only spend so long swapping stories about your mutual person getting married.",
          "id": 23,
          "comments": [
            {
              "score": 163,
              "content": "Getting put together with people you don't know makes for a bland party when everyone is sober. That's just facts. Not everyone is a boozer. Some people just like to have a glass of wine or a beer to relax, get up on the dance floor etc. Dry weddings never have a fun dance floor. That is for sure lol",
              "id": 24,
              "comments": [
                {
                  "score": -30,
                  "content": "Not necessarily.  I had no alcohol and we had a hopping dance floor.  I've been to many south Asian weddings that have no alcohol but are a lot of fun.  If you need alcohol to have fun, you have a problem with alcohol.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 63,
                      "content": ">If you need alcohol to have fun, you have a problem with alcohol.\n\n\nDon't be shitty. You know exactly how it was meant.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 49,
                      "content": ">If you need alcohol to have fun, you have a problem with alcohol.\n\nI don't need alcohol to have fun with my boyfriend or my three closest friends. I do need alcohol to dance in front of 100 people at a wedding though, my social anxiety ain't there for that.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 44,
                      "content": "Many dry South Asian weddings also have people carrying hip flasks or running out of the venue, drinking and coming back in",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 31,
                      "content": ">If you need alcohol to have fun, you have a problem with alcohol.\n\nMostly, yeah; not always though.  I virtually don't drink, but a glass or two of wine at a dry wedding not only makes it bearable but lets me relax.  At my size that's not even a buzz.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 21,
                      "content": "Spoken like an extravert who expects everyone to be a natural social butterfly. Before you make a post, yes YTA.",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "I T A. Growing up our receptions were pretty dry and the fun/dancing was fabulous.",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": "I'm pretty introverted. I don't always want to drink at weddings (sometimes I just like being the sober person who can drive myself home or help others get home) but when people say that alcohol is a social lubricant, that applies to the whole group, even the people who aren't drinking! \n\nI've found that I'm more relaxed and better able to make conversation with strangers or people I don't know very well when there is a certain level of average alcohol consumption in the group on average. \n\nI'd never begrudge someone for having a dry wedding but if we aren't very close and I don't know enough of the other guests well enough to have conversations that aren't a lot of mental effort for me then that might impact my decision to attend.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I read “dry, vegan” as both referring to the food at least three times before my brain straightened out. \n\nTo be fair, dry would more than aptly describe the one vegan wedding menu I experienced, despite all the alcohol.",
              "id": 33,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "IMHO This holds true with alcohol in the \"mix\".",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "Good to know! Thank you:)",
          "id": 35,
          "comments": [
            {
              "score": 72,
              "content": "Our last dry wedding was a blast. They had a good DJ and photo booths and family and friends and we talked and danced and just about everyone stayed the whole time. I guess it depends on the crowd.",
              "id": 36,
              "comments": [
                {
                  "score": 6,
                  "content": "Was the crowd one that would normally drink?",
                  "id": 37,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Immediate family on both sides were dry for religious reasons but cousins and friends weren't so most of us were drinkers. Maybe 25% dry?",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "That’s a genuine surprise tbh. I don’t even drink but I drank at my wedding as did majority of people. Special occasions like that really do seem “dry” without alcohol.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 1,
                      "content": "It may be the other factors that go with the dryness. Not to offend anyone but I know some who are dry and just dour and devoid of fun. Those functions are torture, not because they're dry but because the hosts are borderline miserable and so are most of their friends.\n\nThe wedding I mentioned was dry for religious reasons but this is the happiest, funniest, most laid-back and kindest crowd I know. The kids are sci-fi fans and built that in and we just had the best time. We only knew immediate family but quickly made friends. We were so busy gabbing and dancing we never missed the drinks.\n\nHuman nature being what it is, if you have a party you do need to make it enjoyable. My family are all talkers and dancers so good food and music will do it. We're the ones standing at the door for an hour still saying goodbye so it's always fun.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Meh. I’ve been to Dry wedding that were awesome and fun.",
              "id": 41,
              "comments": [
                {
                  "score": -1,
                  "content": "[deleted]",
                  "id": 42,
                  "comments": [
                    {
                      "score": 7,
                      "content": "People get weird about dry weddings. The best wedding I ever went to was dry it was at an aquarium it was amaaaaazing.",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Congratulations, by the way!",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "In the second one, I was a coworker of the bride seated with coworkers and spouses so we had things to keep the Convo going. The vegan food was great. But we were at an outer table and interacted with the couple for 5 minutes. So the festivities consisted of witnessing the ceremony and then having a meal with some of the same people we did every weekday, with 1 hug in the receiving line and 5 minutes as they made their rounds. While hearing the toasts and other rituals and knowing that a couple dozen relatives in the other side of the room were probably having a special experience. And knowing nobody at the other tables. \n\nMy hint is to try to minimize the \"strangers stuck in a ballroom together but not really part of the central celebration\" effect. Congrats on your plans!",
              "id": 45,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I’ve only been to one dry wedding, friends who were religious. I was in my early 20s and our friend group snuck in flasks so we had an ok time - it was still pretty boring honestly but most weddings are. I wouldn’t do that now in my late 30s… but, yeah, maybe be prepared for folks to sneak drinks.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "That ain't a bad thing lol",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I drove out of state for a 5 pm wedding once straight from work. Couldn’t stop for food on the way and get there on time. Not only was the wedding dry (meh) the only food they had was a popcorn bar. No dinner. Nowhere did it say anything about no food or drink and it was a good 20 min from the closest food place. I left so early from that one cause I was starving!",
          "id": 48,
          "comments": [
            {
              "score": 1,
              "content": "I went to one similar, an hour away. No dinner or drinks. Just a few cupcakes that were left in the desert sun for 4 hours. Everyone left that one early because we were all dehydrated, starving, and bored.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "if people can’t have fun and celebrate two people getting married without the need to get blackout drunk, that sounds like an alcoholism problem.",
          "id": 50,
          "comments": [
            {
              "score": -1,
              "content": "Who said anything about getting blackout drunk? Do you know some people can drink 2 glasses of wine and stop? Not everyone is an alcoholic.",
              "id": 51,
              "comments": [
                {
                  "score": 2,
                  "content": "but why should alcohol be required at all to celebrate someone else’s marriage? that in and of itself is an aloholism issue. not to mention the fact americans act like they can’t do a single thing without alcohol being involved",
                  "id": 52,
                  "comments": [
                    {
                      "score": 0,
                      "content": "That's not at all a alcoholism issue. I said it was perfectly fine for them to have a dry wedding. Will it be boring? Yes. Will people leave the first chance they get? Yes. I was just pointing things out to consider.",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Who’s up for a tailgate party?",
          "id": 54,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 415,
      "content": "NTA.  If they want alcohol they can sneak it in like a normal alcoholic.",
      "id": 55,
      "comments": [
        {
          "score": 25,
          "content": "I died at this comment",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Every time I see a flask for sale anywhere I put on my best sales-y voice and say \"For the drunk on the go!'",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "They sell those tiny little bottles of liquor for a reason.",
          "id": 58,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "Ahh a man of culture 🤝🏾",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Flask, don’t ask.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 260,
      "content": "Your wedding, your choice. I've been to a dry wedding. I didn't enjoy myself, not because of the booze, it was simply boring.\n\nOne thing to consider, at that wedding, a lot of people went to the parking lot and drank out of their cars. Not sure how you would control that, but those who really want to drink will find a way.\n\nNTA.",
      "id": 61,
      "comments": [
        {
          "score": 19,
          "content": "Breathalyzer at every entrance 😂",
          "id": 62,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Good to know! Thank you :)",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "Damn it’s disturbing that people went and had their own drinks in the car. That screams dependant or at the least childish to me",
          "id": 64,
          "comments": [
            {
              "score": 3,
              "content": "I can’t believe you’re being downvoted. It’s very clear that if they cannot go one afternoon/evening event without alcohol, then they have huge dependency issues.",
              "id": 65,
              "comments": [
                {
                  "score": 1,
                  "content": "My guess is that it also says a lot about the people voting me down 🫢",
                  "id": 66,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 190,
      "content": "NTA. As they like to say, \"your wedding, your rules.\" Be prepared for people to sneak in flasks, get drunk before hand, or leave early. (Not saying that they are justified in doing this.)",
      "id": 67,
      "comments": [
        {
          "score": 57,
          "content": "The dry one I attended had discreet tailgating.",
          "id": 68,
          "comments": [
            {
              "score": 18,
              "content": "The one I went to was full of people drinking booze out of footwear in the parking lot. 😂😂😂",
              "id": 69,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Yep, I’ve been to one dry wedding, and one of the groom’s family members was serving alcohol out of a cooler in his trunk. The party moved to the parking lot real quick.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "But you aren’t saying they’re not justified",
          "id": 71,
          "comments": [
            {
              "score": 36,
              "content": "I'm saying it will probably happen, and it's best to be prepared for it. The morals of it? I'll leave that up to others.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 155,
      "content": "NTA, but in my experience (over a decade of hospitality service working wedding receptions), dry receptions end early with a majority of guests leaving after dinner. Just be prepared for that to happen. \n\nPossible compromise \n1. Offer only beer and wine\n2. Have an open bar until dinner, then switch to cash bar\n3. 2 drink max per person (you can pass out tickets to redeem for drinks) \n4. Shut down alcohol service after the bar bill has reached a certain amount \n\n\nOption 1 seems to be the most common way I've seen couples try to curb drunkenness \n\nCongratulations!!!",
      "id": 73,
      "comments": [
        {
          "score": 36,
          "content": "Our company dinners always have one bottle of wine for the whole table. So never enough to get drunk on but enough for everyone to have a glass.",
          "id": 74,
          "comments": [
            {
              "score": 35,
              "content": "And honestly 1 glass is enough for most people to loosen up a bit, and maybe not dance a whole lot, but certainly feel comfortable conversing with possible strangers for long periods of time.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "That's my my son did at his wedding last fall. It worked well and the problem drinker in the wedding party didn't get much to drink.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "5. Have alcohol served with the meal/speeches (served as bottles per table/glasses per place, with the option of water/apple juice/de-alcoholised cider if preferred), and then cut people off.",
          "id": 77,
          "comments": [
            {
              "score": -1,
              "content": ">de-alcoholised cider\n\nOr, as we call it in the US, cider or sweet cider -- just don't let it ferment and you won't need to de-alcoholize it.  How do you do that, anyhow?",
              "id": 78,
              "comments": [
                {
                  "score": 3,
                  "content": "Yeah, that's what we call apple juice. You guys only started calling it cider when Prohibition rolled around, and the juice sellers were like \"no really, it has no alcohol and we've written these instructions on the side to make sure everyone knows how to make sure it doesn't ferment!\"\n\n(You dealcoholise alcoholic drinks by fractional distillation, I think.)",
                  "id": 79,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Apple juice and apple cider are two different things \n\n“Now here's a little trick to help you remember. If it's clear and yella', you've got juice there, fella. If it's tangy and brown, you're in cider town.”",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "people can still get out of control on beer and wine tho so that doesn’t solve any problems.",
          "id": 81,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "I get the impression they don’t really care if people leave early which I think is perfect - it’s about them and focusing on each other not winning some trophy for most agreeable hosts is brilliant.",
          "id": 82,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 155,
      "content": "[deleted]",
      "id": 83,
      "comments": [
        {
          "score": -127,
          "content": "You need alcohol to have fun?  \n\n\nMust suck ...",
          "id": 84,
          "comments": [
            {
              "score": 21,
              "content": "If the other people who are there are people I only tangentially know, or worse don't know at all? Yeah I'm not going to have a good time unless there is a certain level of social lubrication.",
              "id": 85,
              "comments": [
                {
                  "score": -27,
                  "content": "Well again, that sounds horrible. I really can't imagine. I am almost always having fun. Whether I am on a party or in the convenience store. Life is too short to not have fun when there is a possibility to have fun.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Congrats on being an extrovert without social anxiety, you unicorn you",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Most weddings are kinda boring. You sit through a ceremony that's largely only meaningful to the people involved and hang out with a bunch of strangers. It's *not* fun. That's why they serve alcohol.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 90,
      "content": "NTA. But I think you have to acknowledge how majority of people view weddings, and how that view might affect the impression your guests walk away with. It’s no secret many people see weddings as an opportunity to party and have fun. And yes, for many this involves alcohol. The way I see it is, you’re throwing a party for your marriage. Now if I’m hosting a party, I think about what my guests would want and within reason, I provide that. I guess it comes down to this—does it matter to you and your husband about what people think of your wedding? Is it important that they leave saying “wow that was so much fun!” Or does that not make a difference? If it really doesn’t make a difference, do it your way! But if it’s going to bother you to potentially not get the best reactions, I might try to find some sort of middle ground.",
      "id": 89,
      "comments": [
        {
          "score": 26,
          "content": "Do you want people to go away saying \"that was nice, for a dry wedding!\"",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 70,
      "content": ">we really just care about our ceremony \n\nOk - weddings don’t usually have drinks at the ceremony anyway, so I’m not sure what the deal is here\n\nNAH I guess - it’s your wedding, and you’re paying.  \n\n*However*, the whole point of having the wedding is for *your guests* to enjoy a celebration. It’s not for a moderate time of pious reflection. \n\nAs such, you should elope to save them the trouble RSVPing “no” unless the food is going to be a spectacle.",
      "id": 91,
      "comments": [
        {
          "score": -56,
          "content": "Aaaand here's one!",
          "id": 92,
          "comments": [
            {
              "score": 2,
              "content": "Who tf downvoted this",
              "id": 93,
              "comments": [
                {
                  "score": 3,
                  "content": "The ones who can't go without drinking for a day?",
                  "id": 94,
                  "comments": [
                    {
                      "score": 2,
                      "content": "yes 🫥",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 69,
      "content": "As a wedding coordinator, your reception will most likely be over early. Very early. \n\nConsider a limited bar and absolutely no shots.",
      "id": 96,
      "comments": [],
      "relation": "Support"
    }
  ]
}