{
  "post content": "I'm a 31 year old single guy who lives alone in an apartment complex. I've lived there for 6 years. My neighbor across the hall, a woman around my age or a little younger (I actually don't know her first name but I'll call her Katie) lives across the hall from me diagonally and has for about 2 years. We exchange hellos but aren't friendly, which is how it is with most of my neighbors.\n\nSo I don't know how to cook, and due to losing one of my part time gigs, I don't have as much money for takeout anymore. I'm getting really sick of eating cheap fast food or box mac and cheese. I'm gaining weight and I never feel great.\n\nThis is where Katie comes in. I can always smell her cooking in the hall and it always smells amazing (I know it isn't the other person at our end of our hall cause it's a single old man). I've even complimented it a few times. So I got the idea that I'd offer to give her some money each week to cook a little extra and bring it over to me (or I can pick it up from her!) at night. She's cooking anyway and then I'd have varied presumably delicious food.\n\nI asked her the next time I saw her and she looked surprised and said she couldn't because she was too busy (which didn't make sense cause she cooks almost every day but okay). The next time I saw her a few days later, I asked her if she was sure and upped the amount I was offering, and she said she was sure and that it was rude to ask me, and that she isn't a housekeeper for hire and I should get a housekeeper if that's what I want. She also called me 'a stranger' even though we have talked in the halls before.\n\nOverall she made me feel like a big jerk and really embarrassed for even asking her, and a little mad because she was acting like I was being creepy (I wasn't, trust me, she isn't my type). I think asking her to split cooking wasn't completely outlandish, since she cooks every day anyway and it wouldn't be hard to make a little more.\n\nSo, AITA?\n\nEDIT: People keep assuming I'm sexist because I didn't think it was the old man who lives on our hall cooking. It's not an assumption for me. He and I have lived across from each other for 6 years. The cooking smells didn't start til she moved in, and I've talked to her about how good her cooking smells before.\n\nEDIT: Okay. It is abundantly clear that I was the asshole and asking her was inappropriate and, as much as I hate to admit it, creepy. My instinct is to apologize to her but since my instinct was to ask her in the first place, I'll do the opposite and stay out of her hair. Thanks.",
  "id": 1,
  "comments": [
    {
      "score": 27276,
      "content": "**YTA**.\n\nHonestly, OP: Thank you. So many people on this sub are just struggling for self-awareness, wading through uncharted territory, or trying to figure out how to navigate a complex situation with many moving parts and lasting social repercussions. Sometimes it's hard to know what to say, how to reach them, and especially how to reduce the situation down to a single three-letter acronym. But you, OP, are a 100% bonafide asshole. Let's count the ways.\n\n1. You're clearly making her extremely uncomfortable. You've caused her to feel like she has to walk on eggshells when leaving and entering her own home, because a strange man down the hall keeps insisting that she... cook for him? What the fuck? Hell, she might even feel like you're monitoring her movement in and out of the apartment in order to ambush her about cooking for you, which will **obviously creep her the fuck out** and **make her feel uncomfortable in her own home**.\n2. Why **on earth** would you think that you're entitled to this person's cooking? Even if she were your spouse this would be a problem, and you don't even know her! How did you hear her say 'no' and decide to keep pressing the issue? She's calling you a stranger because *you are a stranger*, and she's telling you no because *NO*.\n3. \"I know it isn't the other person at our end of our hall cause it's a single old man.\" Damn, dude. Fuck off with that nonsense.\n\nYou ***are*** a jerk, you ***were*** being creepy, and you should be **way more embarrassed than you are**.\n\nStop harassing your neighbor, learn to cook, and **leave her the fuck alone**.\n\nChrist, OP. She said no.",
      "id": 2,
      "comments": [
        {
          "score": 16251,
          "content": "I absolutely love that he is offended that she called him a stranger. He doesn’t know her first name!\n\nYTA, buddy. Wow. Leave this poor woman alone.",
          "id": 3,
          "comments": [
            {
              "score": 4418,
              "content": "Lmao I didn’t even catch this. \n\nOP doesn’t even know her name!! I take back my previous comment that the asking was weird but the doubling down is TA part. Firm YTA - you don’t even know your neighbours name and yet you want to propose this kind of arrangement? \n\nBe a little more self aware, dude. At the very least, take the time to learn someone’s name before asking for a favour.",
              "id": 4,
              "comments": [
                {
                  "score": 2060,
                  "content": "I think he thought it wasn’t a favor because he offered money. And when she said no he offered more money, which somehow makes it even worse. \n\nOP what on earth makes you think she needs your money? Or wants to cook for you?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1907,
                      "content": "[deleted]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 218,
                      "content": "I think my advice still stands. If this was a “business proposal” and not a favour... you should still learn the person’s god damn name. Lmao. It does make it worse because if it’s a business proposal ... it’s a bad one. Lol $5 per meal barely coveres expenses let alone labour.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "It also displays a lack of motivation IMO. If you don’t know how to cook and you’re aware of it, why not make your first step trying to learn how to cook? If the woman across the hall had to be brought into this, asking her for the name of a good recipe would have been a more appropriate action.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Lol!\nAnd to continue it looks like she has a clean apartment ( it didn’t smell , that’s all the proof you need ) so maybe she can come clean his place , you know .., while she already has the cleaning supplies out ! ....",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "The best part is when he decided her excuse, that she didn’t have time, wasn’t good enough. Like damn dude, maybe she thought of the first one that popped into her head because *she wants you to get the fuck away from her and didn’t want to risk the time to think of a better one*",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1497,
              "content": "Also, she’s “not his type” so it’s not creepy at all. /s",
              "id": 11,
              "comments": [
                {
                  "score": 224,
                  "content": "[deleted]",
                  "id": 12,
                  "comments": [
                    {
                      "score": 711,
                      "content": "How sure are you he hasn't tried saying that yet?\n\nAlso \"So I don't know how to cook\"... Seriously, learn how to cook. Is he going to ask her to clean his house as well because he \"doesn't know how to use a vacuum cleaner and her house always looks so clean when he looks at it using the spycamera he always slides under her door\"?",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 370,
                      "content": "\"No, don't worry, I find you physically repulsive. Sooo, if 10 bucks a week wasn't enough, how about I sweeten the pot. 11 dollars?\"",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "I love how he's decided it's not creepy because of his feelings about her. Whether or not you're being creepy is about how she feels about you, dude. And you're a creepy stranger propositioning her for food outside her home.",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "Yep almost felt like some r/niceguys or m'lady shit",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "What if she was his type?",
                  "id": 17,
                  "comments": [
                    {
                      "score": 10,
                      "content": "He’s still the asshole.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Some sort of \"communication hierarchy\" bullshit. I couldn't get past this either. This guy isn't just an asshole in this situation, I think he's just a dick overall.",
                  "id": 19,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1076,
              "content": "Can we also add that OP felt because Katie cooks daily, that it shouldn’t be a problem and felt she lied because she said the extra cooking would be a hassle.  \n\nSince OP doesn’t cook, let me share this. Cooking daily or regularly, unless you like it, is not necessarily fun.  Saying “just cause she’s doing it anyway” isn’t right.  You don’t know if she’s heating up leftovers, you don’t know what’s going on in her kitchen.  Cooking for one is work.  Even adding more to make it for two can lengthen the time she has to spend in the kitchen.  \n\nTo say she’s lying cause she cooks anyway is so wrong.\n\nEdit: YTA for sure op",
              "id": 20,
              "comments": [
                {
                  "score": 513,
                  "content": "I love cooking, and I really enjoy making stuff my family likes.\n\nBut the obligation to cook for someone daily (maybe even on a set hour) because he pays for it would ruin all the fun, honestly.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 180,
                      "content": "Exactly.  Once it's a job, you no longer have the option to not cook.  I love to cook, and I cook most nights, but if I don't feel like it, then I don't do it. If someone were paying me to cook, I'd no longer have that option.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 87,
                      "content": "Exactly, cooing for yourself is very different to cooking for another person. Her whole schedule would have to change, she is now responsible for feeding someone else, it impacts her whole freedom to go and do anything.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 395,
                  "content": "Plus, what if she doesn't want to cook every day and suddenly she has to? What if she likes making chicken pot pie but OP doesn't like it and requests something else? What if she wants a day off every now and then but OP picks up lasagne smells wafting from her apartment and gets offended because she's not sharing? What if he decides he wants seconds and comes knocking on her door? There's absolutely no way the ideal arrangement in OP's head would feel anything but intrusive and weird to his poor neighbor.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 157,
                      "content": "OP needs to hire a private chef or learn how to cook.  Katie don’t owe him a shit.  Or workout if his Mac and cheese diet is doing him dirty.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "What is he comes over when she’s got a hot date going or her parents? Very ackward",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "And you know someone with such poor understanding of boundaries and self-awareness would absolutely not think twice about doing those things.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 175,
                  "content": "Yes!  Adding another serving to food isn't too bad but it's definitely more work.  And portioning more out and bringing it to OP is adding a whole extra interaction to her day.  Would he plan to just return dirty Tupperware to her? (Something tells me yes).  What if she had a bad day and just wants to eat a pizza.  Does she have to call OP and explain that he needs to eat macaroni that night?  Does she worry about him being petulant?\n\nI would loathe that extra obligation.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Can you imagine having to interact with the guy and make small talk every day while he picked up his dinner. Obviously neither of them are interested in interacting as they’ve lived across the hall for two years and didn’t make friends but this proposal would require an awkward interaction every day. No thanks.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "He *absolutely* would return dirty tupperware to her, if he returned it at all. More likely her poor tupperware would just pile up in his gross apartment growing mold.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "She might even use her leftovers for lunches or meals down the line. Buying extra groceries to make double for him would increase cost that doesn't seem like is being balanced out with what he's offering, and extra prep time which no one wants to have to do!",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": ">Yes! I completely agree, the idea that increasing volume does not increase effort is so bizarre. There are VERY few examples that I can think of where that is true, even things I cook in an isntant pot or something require searing first or would require additional chopping, etc. to increase the volume.  Also, buying and storing more groceries to accommodate cooking larger portions is also a burden and your point about leftovers is huge. It's rare that I make a meal without planning to get at least one portion of leftovers out of it for future use.   \n>  \n> OP is entitled and at best misguided  and I so feel for this woman. Knowing that a man without boundaries is monitoring what I am doing in my home and feels that I have unreasonably denied him something would put me so on edge. I understand that OP hasn't been overtly threatening, however a perspective this warped would be alarming to me and would make me extremely uncomfortable.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I love to cook and I would be BEYOND pissed if a stranger came to me with this request and logic behind it. Fuck you dude lol",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Exactly! He says he doesn't know how to cook, but yet, he ASSumes it \"wouldn't be hard to make a little more\". LMAO!! YTA",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": ">Saying “just cause she’s doing it anyway” isn’t right.\n\nOP actually says it MORE THAN ONCE; in the initial justification for asking as well as later to be irritated that she said no. The whole thing just blew my mind but that sort of entitlement and complete lack of awareness around it got me all bug-eyed. I wonder if OP just assumed they could put the dirty dishes outside the door and she'd come pick them up to wash like room service.\n\nThe real crux of \"You're doing it anyway\" is \"I deserve your labor for free.\"",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 328,
              "content": "Right?? He literally talks about only saying hello every now and then, and how he doesn’t even know\nher first name, and then attempts to prove that he should get her cooking because they know each other so well.\nYTA OP. And please stop harassing this girl.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 185,
              "content": "[deleted]",
              "id": 37,
              "comments": [
                {
                  "score": 50,
                  "content": "He doesn’t want to learn. Not when there’s a convenient woman right there to do it for him for pennies.",
                  "id": 38,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "I'm actually more offended the dude can't even try to learn how to cook. \n\nIt's called being an adult buddy, take care of you own damn self. Also, eating takeout all the time is not healthy even if its not fast food. Restaurants do not care about making healthy meals, they care about making tasty meals that people will buy, so they use more butter and salt than any regular home cooked meal.\n\nThings every adult should know how to do regardless of sex/gender/preference/etc:\n\n\\- Cook\n\n\\- Clean \n\n\\- Do laundry\n\n\\- Change a tire\n\n\\- Check vehicle fluids\n\n\\- Sewing and Ironing\n\n\\- Minor house repairs\n\n\\- Budget to pay bills on time\n\nI feel bad for OP but also think he's a huge manchild who was spoiled by his mother and therefore can't take care of himself.",
              "id": 39,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "I can’t tell if my favorite part of this is the fact that he went out of his way to make sure we know that she’s not his type, or the fact that he had the nerve to say “she’s already cooking anyway it wouldn’t that hard just to make a little more” like what??? You know what else wouldn’t be that hard? A grown ass man following a goddamn recipe and cooking for his goddamn self.\n\nI genuinely cannot get over what an entitled prick this dude is and this has got to be one of the top five easiest YTAs to ever be posted on this sub.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Also, like, \"I couldn't possibly have been creepy. She's not my type!\"",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Some men don’t know how creepy they come off. There is an illusion or entitlement just because they “know” each other. And pressing for someone to do something she doesn’t want to do is cheap and insulting and absolutely creepy. I understand OP is probably just hungry but really you are not that woman’s responsibility. Learn how to cook or find a partner who will like you and cook for you. The woman said no respect her boundaries",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I love that he admits he doesn't know how to cook, and yet assumes cooking twice the food every day \"wouldn't be that much extra work\".  Cooking is not easy, dummy, if it was you'd be doing it yourself.\n\nThis is the most clear cut YTA I think I've ever seen.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2449,
          "content": "Also, can we talk about the “she’s not my type part”? Like that excuses the behavior? “Sorry my behavior is creepy, sexist, entitled and has made you feel uncomfortable in your own home but you’re not my type so like I deserve you to spend your valuable time cooking for and feeding me?!” YTA, OP, for asking her and then doubly TA for continuing to harass her after she said no.\n\nEDIT: How fun - my first award! Thank you, kind stranger!",
          "id": 44,
          "comments": [
            {
              "score": 1386,
              "content": "[deleted]",
              "id": 45,
              "comments": [
                {
                  "score": 509,
                  "content": "Imagine being on the receiving end of pretty much the exact behaviour of a sexual predator but due to being a brunette it's thankfully just about the food",
                  "id": 46,
                  "comments": [
                    {
                      "score": 133,
                      "content": "I know eh? I feel awful for this woman.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "Also \"creepy\" (as much as it really triggers some redditors) is absolutely not something that it's up to you to determine if you are or not. If you've creeped someone out then you were being creepy end of story",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 725,
              "content": "I full blown rolled my eyes at the \"she's not my type\" part. Creepy men always love pointing that out when they get called out for their shit as if to say \"don't worry sweetheart, you're not good enough for me to be creepy towards and if you were then you should be flattered.\" STFU dude, you're a fucking creep!\n\nGuy did this to me once. At a party, went to sleep in a room right next to my then-boyfriend on the ground. Didn't know everyone at the party but knew the hosts well. Woke up in the middle of the night to a man masturbating on the bed to my left. It was pitch black and no one had been in the bed when we went to sleep so I had no clue who it was. Couldn't get my boyfriend to wake up and when he finally does he leaves to go to the bathroom and the man quickly lays down so he goes unnoticed. Fuck no! I get up and follow my bf to the bathroom to tell him what's going on. He comes back and turns the light on to find it was one of our friends boyfriends.\n\nThe next day I remember him pointing out that he wasn't even attracted to me so therefore what he did wasn't wrong and I just wanted attention. My then boyfriend started to doubt the whole thing. Now I do think that the guy was just drunk and not thinking.... But how about just acknowledging how freaky it would be to wake up and see someone masturbating next to you? Say you were drunk, and sorry that it happened, you didn't mean to scare me. But no, instead it's made into I'm not attractive enough to assault and I should let it go.\n\nEDIT: grammar",
              "id": 49,
              "comments": [
                {
                  "score": 463,
                  "content": "I had a guy fall asleep next to me at debate camp in a room full of people. It was a bunch of people squeezing into a bed. He cuddled me in the night. It wasn't groping, just wrapped his arms around and spooned me. No hands anywhere weird and I nudged him off easily. He did it again. It's clear he is 100% asleep, light snoring and everything.  I nudge him off again even though it was actually pretty comfortable because I am awake and letting it go would have been odd. \n\nWhen he woke up in the morning and I told him he was HORRIFIED. He could not stop apologizing. He apparently is a cuddler from childhood on up but normally didn't sleep that close to people he want in a relationship with. He apologized and made no excuses other than \"I'm such a weirdo, I'm so sorry. I promise I was asleep. I know I cuddled my ex girlfriends when I slept but it never crossed my mind that it would be automatic. I'm so incredibly sorry, can I buy you a coffee? Please don't hate me.\" \n\nI am telling you this to point out that this very invent mistake was taken more seriously than this creep masterbating next to you. This is how I would've expected someone to react if they messed up. Everyone else found this funny, myself included but he did not because it was his reputation and his actions. \n\nI offered to provide an objective written reference if his A+ cuddling skills and we let if go bye. His roommate, however, dubbed him \"The Cuddler.\"",
                  "id": 50,
                  "comments": [
                    {
                      "score": 58,
                      "content": "This is the only time I've found nonconsensual cuddling kind of adorable.",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 48,
                      "content": "Lol that’s the difference between creeps and noncreeps. Noncreeps who do something creepy attempt to see things from a different point of view and apologize. Creeps blame others for their  own creepy behavior.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "I HAVE THIS PROBLEM AND ALSO AM MORTIFIED I WILL NONCONSENSUALLY CUDDLE SOMEONE.",
                      "id": 53,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Debate camp is wild",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 288,
                  "content": "Yikes. Your boyfriend was TA too in that situation. He should have had your back no matter what.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 52,
                      "content": "That's why he's an ex boyfriend.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "That tripped me up as well.  So if you're attracted to someone it's ok to be creepy towards them?  Lolwut?   \n\nAll people deserve respect and boundaries, attraction or lack thereof shouldn't be part of this equation.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 445,
              "content": "[deleted]",
              "id": 58,
              "comments": [
                {
                  "score": 17,
                  "content": "This is brilliant!",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Schödinger’s rapist could also be why she said no, especially with him living so close - and she was perfectly entitled to say no and leave it at that for this reason alone.",
                  "id": 60,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 326,
              "content": "The entitlement is what gets me.  The EXPECTATION that she WILL cook for him.",
              "id": 61,
              "comments": [
                {
                  "score": 160,
                  "content": "> I know it isn't the other person at our end of our hall cause it's a single old man.\n\nBecause men can't cook.\n\nThis dude lives in a fucking cartoon version of the world.",
                  "id": 62,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 118,
                  "content": "Well I mean yea! Why not?! She in the kitchen already! /s",
                  "id": 63,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Well, I mean, where else would she be? It's where she belongs! /s",
                      "id": 64,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "And his first instinct was for her to bring the food over to his place, only later he adds as an afterthought, “or I could pick it up from her place”.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Well why wouldn't she? SHE'S NOT HIS TYPE THEREFORE HE'S NOT BEING CREEPY. 🤢",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 876,
          "content": ">But you, OP, are a 100% bonafide asshole.\n\nYeah, normally posts like this are so wild that I can laugh them off as creative writing exercises. But the OP here is believable enough that I'm shaken knowing that people like this live amongst us. If my neighbour offered me less than minimum wage to cook for them (even before they ingredients were purchased), and then doubled down on it with a second offer, I'd want to move house. I felt this post in the pit of my stomach whilst reading it.",
          "id": 67,
          "comments": [
            {
              "score": 227,
              "content": "This dude is the guy girls are warned about growing up, yikes.",
              "id": 68,
              "comments": [
                {
                  "score": 12,
                  "content": "Immediately thought of the first story in The Gift Of Fear where the rapist won't let up about going into the woman's apartment with her. *Shivers*",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "[deleted]",
              "id": 70,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 789,
          "content": "Also, to address OP's \"she's already cooking\", she would potentially have to add more time to her cooking for prep/cook time for bigger portions and depending on what she's making, more batches, which would also add more time.\n\nSince OP did note he doesn't cook, he probably has no idea that cooking a little more could potentially take up more time.",
          "id": 71,
          "comments": [
            {
              "score": 1023,
              "content": "I don't think making bigger portions is so much the issue here as the imposition on her autonomy and privacy. What if on Tuesday she decides to meet a friend for dinner instead of cooking? What if on Friday she just doesn't feel like cooking? What if she goes on holiday for a week? She now owes \"explanations\" about detailed aspects of her life to the random dude across the hall. Who might get angry if he's told on short notice that she will not be cooking for him. No thank you.",
              "id": 72,
              "comments": [
                {
                  "score": 513,
                  "content": "God yes. What if he doesn’t like one meal? Does she not cook that anymore? Does he then get to request / demand the meals he likes? What if he gets sick from something? Too much drama.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 449,
                  "content": "Exactly. What if she eats leftovers 2-3 nights a week and he wants something different each night? Not to mention having to potentially account for his tastes and/or dietary restrictions. What if she's a vegan and he doesn't like that? What's to stop him from saying, \"I'm paying you for meals, why aren't you making food that I like?\"\n\nOP doesn't even know the type of food she makes, and hey, maybe he's not at all fussy. But if it were me, my first thought would be that cooking for someone else also involves planning around their preferences, not just my own. \n\nOn the surface it sounds easy like, \"just split what you're making,\" but it inevitably won't be that simple.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 142,
                      "content": "What if she is tired and just doesn't want to interact with this asshole every single fucking day? Even if OP was a charming polite guy, I would never ever consider doing that. Hell even if he were a flatmate and a friend I probably wouldn't do it. Maybe if I was broke.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 140,
                      "content": "I can’t believe this issue didn’t come to mind sooner when it’s what I do myself all the time. I make a meal that takes an hour or two and it’s my lunch/dinner for the next 2-3 days.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 84,
                      "content": "Right? I cook for myself and my husband, and even that means that I have to plan around his preferences instead of just my own. No way in hell would I be cooking food for some random neighbour I don't even speak to!",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": ">On the surface it sounds easy\n\nAnd even on the surface, OP is ignoring one huge factor: she gets exactly zero benefits from this arrangement. Since he can only afford cheap fast food/boxed mac and cheese, the money he's talking about would go toward extra ingredients only. So he's expecting a stranger (one who's name he doesn't even know) to bend over backwards to make life easier *for him*. The mental disconnection here is crazy.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 162,
                  "content": "Everything you said is true but bigger portions could well be it's own issue. She may have recipes down to a T that give her a certain amount of meals for dinners/lunches. It's not just a matter of adding extra stuff. Now to accommodate this stranger she needs to use a second pot/dish or else cook more often to have enough portions. Let alone making sure that the flavours stay the same. \n\nThe more I think about, the more I'm appalled at the sheer cheek of this asshole.\n\nEDIT: And that damn clickbaity title. You'd swear he was doing her a favour.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 30,
                      "content": "the title is so clickbaity. i clicked on this thinking it was going to be one of those completely ridiculous stories where OP is obviously not TA and humblebragging, only to be completely horrified",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "I agree. I don't really follow recipes, but I cook for one and know how much of what I need. Doubling it messes me up because I don't measure, and so it's legit hard to tell when I'm putting too much or too little of something in.\n\nAnd omg the title. I share food with my best friend. Buy a full cabbage, chop it in half and share. Big bag of onions, split 'em up! 10 bulbs of garlic is the same price as two? Here's 5 garlic bulbs for you! His proposal is not sharing food. It's hiring a personal cook.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Right there’s a mental cost to this can’t be calculated. I like to bake as a stress relief, for example, and I’ll do it randomly and bring it to work the next day. When there’s a potluck and I agree to bring something, it feels different. I’m not just doing it for me, I’m doing it because I have to, because someone expects it, because there is a plan. Those times don’t have the same stress relief aspect, even when I’m doing it for someone I like. I can’t imagine cooking, enjoying it, and then just always doubling my portions for a stranger, at cost. It would take out all the joy she probably gets from cooking for herself.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 315,
              "content": "This! \n\nSome of the dishes I make can only be cooked one plate at a time (wok cooked meats on high temp). Cook time isn’t that long, but it’s active, not passive cook time, so I’ll be damned if I’m standing over the stove for an extra 5 minutes for a stranger. \n\nOp, buy a fucking cookbook. Your wallet and your gut will thank you, and it’s a skill every adult needs to have.",
              "id": 83,
              "comments": [
                {
                  "score": 244,
                  "content": "I find it such a weird thing to say, 'I don't know how to cook'. I rarely cooked before leaving my parents home. From that moment on, I had to fry my meat and potatoes and boil my vegetables myself. It never occured to me to tell myself that I just couldn't do it and just leave it at that. I just started doing it.",
                  "id": 84,
                  "comments": [
                    {
                      "score": 179,
                      "content": "This. It’s not rocket science. And then the audacity to be like, “I don’t cook... so a random woman should do it for me!”",
                      "id": 85,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 42,
                      "content": "RIGHT??!! Its not that hard to bake some chicken and steam some vegetables, JFC. I HATE cooking, my mum tried to teach me and I refused to learn - it doesn't interest me! But I moved out of home and started. It is not that hard to throw easy shit together and meal prep for a week or god forbid, follow a recipe!  This guy needs to grow the hell up.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "\"I dont know how to cook\" \n\nGOOGLE IS FREE.",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "I don't see this about cooking. \n\nOP is lazy, sexist, entitled and wanted an excuse to talk to a female across the hall regularly by making her do him a favor and thinks it's no prob because somewhere along the way he's learned that thats what women do.\n\nHe's now put his neighbor into a position of potentially feeling self conscious while cooking for herself.",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "There is a youtube video explaining how to make literally any dish you can think of.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "Exactly. Like, he says that money is an issue here but just paying someone else won’t even solve the problem aside from that being creepy.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 206,
              "content": "And what if she just doesn’t feel like cooking one day, or gets caught up late at work? Suddenly she can’t just throw in a frozen pizza in a pinch. If she can’t cook for him is he gonna be chill about it, or is he going to whine about how he can’t eat? Poor woman doesn’t just have a second job now,  she has a baby.\n\nHow anyone can think this guy isn’t the asshole is beyond me.",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 152,
              "content": "[deleted]",
              "id": 92,
              "comments": [
                {
                  "score": 20,
                  "content": "When I first head the title I thought maybe he was going to suggest he cook some evenings, his neighbor cook others and they share a costco card or something. \n\nHe's very lazy and complains about putting on weight because he can only eat fast food?  Not being able to take responsibility for your own food choices and assuming a woman should obviously feed him because she's doing it anyway is vile. He's so beyond.  \n\nHim even considering that she's not a good person because she won't be his personal chef is beyond.",
                  "id": 93,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "He says elsewhere he feels $5-$10 is appropriate. Take what you will from that.",
                  "id": 94,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "He’s apparently offering her 5 dollars/day. Probably doesn’t even cover the ingredients. He literally wants to pay this woman just as much as he spends on his pre-made mac and cheese",
                  "id": 95,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Honestly the amount would have to be pretty high for me to agree to this. I cook meals almost every night. I get take out or go out to dinner maybe 3-4 times a month and I have about 20 different meals that I cook with a couple odd balls thrown in when I come across something interesting I want to try. \n\nI’ve figured out the portions of these meals and it’s enough for me and my girlfriend for dinner and lunch the next day. If a third person pops into that my lunch is gone and whatever money they paid me is going to get put towards a shitty fast food lunch. No worth it.",
                  "id": 96,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 97,
              "content": "For me, as well as all the practical problems such an arrangement would bring, it's the *entitlement* that he expects to her to do something for him simply because it will be useful for *him*. The fact from her viewpoint that this means a total male stranger has walked up to her and asked her to do something for him - and he's offered to pay (?) doesn't occur to him that this is seriously crazy and creepy for his poor neighbour. It would be helpful for him so he thinks he's entitled to her help....\n\nDefinitely YTA",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 551,
          "content": "OP, I'm not sure you understand *why* she doesn't want to do this. Maybe she just doesn't want to cook more, and that's it. But more likely, she doesn't want to see your face every day. Or she doesn't want to feel the pressure of the social contract you're asking her to enter. Or she doesn't want to let you know if she's going out for a night and not cooking. Think about all the ways this ask imposes on her - YTA, and it's not about the food.",
          "id": 98,
          "comments": [
            {
              "score": 361,
              "content": "This is the real issue for me. He is very uncomfortably prying into her life in so many ways. Like \"Hey I'm a man that lives very close to you and have noticed things about your life, and now I want to insert myself into your life. But it's okay, I'll pay you.\" He thinks that because there's money involved and because it's not uncomfortable for him it can't be uncomfortable for her.",
              "id": 99,
              "comments": [
                {
                  "score": 33,
                  "content": "Next thing you know, he will be asking to pay her for sex. I mean, no big deal, right?",
                  "id": 100,
                  "comments": [
                    {
                      "score": 35,
                      "content": "“I hear you having sex through the wall and it sounds great!  Could I pay you $5 for the occasional hand job if you’re already planning on having sex that day?”",
                      "id": 101,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "> because it's not uncomfortable for him it can't be uncomfortable for her. \n\nWhat?!  You mean, his perspective on things isn't the universally objective truth of the situation for everyone?!!!!  \\*audible gasp!!!!\\*",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "I guarantee as well the \"delicious smell\" is just her cooking garlic and onion too. We are all assuming he is smelling her amazing cooking, when she is probably just cooking.  Literally just making dinner. Nothing to suggest she is doing anything amazing, just that he is lazy and sexist. \n\nAnd what's up with not understanding its insulting to try and buy people.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": ">OP, I'm not sure you understand *why* she doesn't want to do this. Maybe she just doesn't want to cook more, and that's it. But more likely, she doesn't want to see your face every day. Or she doesn't want to feel the pressure of the social contract you're asking her to enter. Or she doesn't want to let you know if she's going out for a night and not cooking. Think about all the ways this ask imposes on her - YTA, and **it's not about the food**.\n\nThank you for stressing this because frankly all the focus on learning to cook is missing the point. \n\nOP is asking a complete stranger to enter into a form of relationship with with him (that's what this arrangement would be. She has to think about his desires and needs while making his food. He would occupy a space in her mind.). And he feels entirely entitled to it, enough to insist and then seek validation from reddit. What the actual fuck. \n\nHow does someone like this go thru life and maintain any kind of personal relationship?",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 486,
          "content": "3. If OP never confirmed what if it is the single guy cooking? That makes it so much creepier to proposition a woman to cook meals daily when she isn’t cooking. The lady even said she didn’t have the time. \n\n4. He can’t afford take out, but can somehow pay her? This makes me believe either A. that he thought he could get great hearty meals for cheap and choosy beggared her (I’ll give you $10 a week for three meals a day!) or B. he offered her $10-$20 per meal (cost of a good handmade meal at a restaurant) which means he could afford to get takeout and lied.",
          "id": 105,
          "comments": [
            {
              "score": 351,
              "content": "He offered 5/day first than increase to 10/day.",
              "id": 106,
              "comments": [
                {
                  "score": 351,
                  "content": "WHAT?!?!? \n\n\nWow.   That drastically increases the asshole level",
                  "id": 107,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "At 10 a day you get a microwave meal shoveled onto a plate.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 24,
                      "content": "But he want a tasty, healthy home-cooked meal, made by someone else.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 256,
              "content": "Close! The initial offer was $5 a day, which he then upped to $10 a day when she said no (see OP comment)",
              "id": 110,
              "comments": [
                {
                  "score": 263,
                  "content": "$5 dollars a day? Lmao!!! He definitely choosing beggared her. Even if I was inclined to sell meals, it would not be for $5 a day.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Like cmon man, 20 bucks minimum for a meal holy shit.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 194,
                  "content": "$5 a day would barely cover the actual ingredients, let alone the time spent planning, shopping, preparing, cooking, and cleaning up!\n\nI'm honestly wondering if OP is from space, and doesn't know how humans operate yet.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Well he \"doesn't know how to cook\"  which is weird. You can learn how to cook. I mean it's 2019 you can hop on google and literally type in \"How do I cook chicken breast\" or even just pick up a rotisserie chicken for 5 bucks, run over to the freezer aisle and buy a bag of steamed veggies that you microwave for 5 mins and are even easier than box mac and cheese, you can still even use box mac and cheese as a side if you want dude. WTF. Buy a crock pot for 25 bucks and you can throw a can of salsa and chicken or pork in there and eat for a week putting that on rice.  I think you'd have to actively try to not know how to cook anything. Especially if you're deciding you like what this person is cooking just from smelling it across the hall, you can't be that picky. \n\nTLDR: OP is def from space.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I could definitely see this happening in the first Third Rock from the Sun season lol.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 120,
                  "content": "According to this website:\n\nhttps://www.care.com/c/stories/15242/how-much-does-a-personal-chef-cost/\n\npersonal chefs for five meals a week cost about $200 to $300 on average in the United States. $10 a day is low.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 480,
          "content": ">You're clearly making her extremely uncomfortable.\n\nThis is so true\n\n>She also called me 'a stranger' even though we have talked in the halls before.\n\nIf you live across each other for 6 years and have never been inside the other persons apartment or done something with them privately, then you guys are strangers.",
          "id": 117,
          "comments": [
            {
              "score": 245,
              "content": "He doesn’t even know her name!",
              "id": 118,
              "comments": [
                {
                  "score": 44,
                  "content": "[removed]",
                  "id": 119,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "2 years",
              "id": 120,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Especially when OP doesn't even know her name...",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 323,
          "content": "Also. Minor complaint given everything else that's wrong about this situation, but people who say \"but I don't know how to cook!\" are so fucking annoying. Just fucking learn. No one expects you to be Emeril Legasse but it's not hard to boil water and read instructions.",
          "id": 122,
          "comments": [
            {
              "score": 44,
              "content": "[deleted]",
              "id": 123,
              "comments": [
                {
                  "score": 40,
                  "content": "Oh, man. This really is a hill to die on. I'm not saying \"yes break up with him 100%!!!\" but generally stuff like this isn't isolated to one aspect of the relationship. Even if it is right now, you may decide to introduce children into the mix, and then it bleeds over to \"I don't know how to prep bottles/where to take them to soccer practice/change their diaper/where the P/T conference is!\"\n\nLearned helplessness is a real thing. If I were you, I'd leave him on the hook for his own food. Let him whine and complain about it. All your response needs to be, should you choose to even dignify him with one, is a cheerful \"Sorry to hear that! I'm sure you'll figure something out.\" Then go to where he isn't so you stop hearing about it.\n\nHe's a grown-ass, presumably able-bodied adult and can feed himself. Hold your ground and see how long it takes for him to boil his own fucking pasta water.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "My parents didn't teach me to cook.  I'm in my 40s, but the internet has been a thing since my 20s.  I got cook books and watched videos.  I also watch cooking shows.  I'm an OK cook now (I have no idea how to create my own recipes, but once I see similar recipes with similar ingredients I know how to tailor it to my tastes).  It's really not that fucking hard.",
              "id": 125,
              "comments": [
                {
                  "score": 12,
                  "content": "IF there's one thing you can really learn easily online is cooking. My cooking has gone leaps and bound better with youtube. And my wife and  I are vegan.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Seriously! You don't have to cook a fucking souffle! It's really not rocket science.\n\nI remember a radio show once where this couple had called in about a fight they were having over Thanksgiving. Wife said she was tired of her holiday being super stressful and exhausting every year because she was cooking everything all day while Husband sat on the couch and watched football. Husband was super whiney and insisting that she HAD to do Thanksgiving because he \"couldn't cook\" and if he did the cooking it would be terrible \"for the children\" whose lives would apparently be ruined if they saw their father trying to be considerate or appreciative towards their mother. The worst part was that of all the people that called in with their opinions, more than half of them were on the husband's side!! Even women were calling in and agreeing that it just wouldn't be the same if the husband cooked. WTF. Watch some youtube videos and figure it out, dude. Thankfully the hosts sided with the wife and in the end they agreed that he would cook a few dishes and order the rest from a caterer but if the wife stepped one foot into the kitchen he had failed her as a man. Correct outcome, but it infuriates me that we even had to have a discussion about that. Being able to cook shouldn't automatically enslave you to all the people/men who are too lazy to figure it out for themselves.",
              "id": 127,
              "comments": [
                {
                  "score": 12,
                  "content": "\" Being able to cook shouldn't automatically enslave you to all the people/men who are too lazy to figure it out for themselves. \"\n\nRight?? This attitude is so common and it makes NO sense. This is why I truly love my boyfriend (after going through some real shitty ones). He literally can't breastfeed our baby and sometimes baby just wants mommy, so he makes damn well sure he washes bottles, does the laundry for all three of us, changes most of the diapers, cleans, and just generally goes above and beyond in addition to his full time job. I'd say overall our relationship is equitable, but right now he's literally doing MORE than me and it's so refreshing. I'm trying to push aside my woman guilt and just enjoy it! Why shouldn't I have nice things sometimes!",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Fucking right? \n\nGet an instant pot or off brand electric pressure cooker and throw some frozen chicken in with your jarred sauce of choice and some rice and BOOM dinner. \n\nSeriously. I make chicken Tikka masala with the jarred sauce from Aldi all the time. It takes half an hour or less and makes 5 meals for super cheap. AND it freezes okay.",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "People say it like it's some esoteric hobby and not **an essential life skill**. If you can't cook, you need to learn. You're not a child.",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "OP mentioned in an earlier comment:\n\n> **I have tried cooking before and honestly just don't enjoy it**. She seems to enjoy cooking.\n\n> I also explained my situation, that I am hopeless at cooking and trying to save money. I offered her $5 at first per day (25/week) and then upped it to $10 which is still cheaper than takeout but more than covers groceries.\n\nCooking is not like carpooling/ride sharing and the whole situation is just flying over his head.  Soup isn't hard to make even if it comes from a can.",
              "id": 131,
              "comments": [
                {
                  "score": 13,
                  "content": "Plus how does she seem to enjoy cooking? Because she does cook? Some people enjoy it and some people see it as another chore on their daily tasks and find cooking cheaper/healthier/easier to control for allergies so they cook. He seems to think she must enjoy it because she does it instead of possibly because she's a responsible adult.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "YouTube can teach you so much, and it's there for free. Guys like this are entitled little brats. I'm going through this with a coworker who is a single dad. He got a rice cooker as a gift, and was surprised when I told him he needed to add water. Thankfully he is coming along.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 269,
          "content": "I think this deserves a spot in the Food Assholes Hall of Fame. With Subway Guy and Lasagna Guy and all the others.",
          "id": 134,
          "comments": [
            {
              "score": 216,
              "content": "Don't forget the guy who made his vegan guest bring her own dinner and watch the other guests eat a feast for a full year. I'm still not over that one.",
              "id": 135,
              "comments": [
                {
                  "score": 47,
                  "content": "[deleted]",
                  "id": 136,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Thank you for reminding me of the lasagna thief post.",
                      "id": 137,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "But at least Subway Guy and Lasagna Guy \\*had\\* food!",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Oh man, now that you mention, it really does seem like all the worst people are the food ones. I'm sure there's some bias to what I'm remembering, but I really can't remember anyone worse than the food guys right now. And let's not let Olive Garden guy and Bolognese guy go unnamed here. They were too awful to not call out directly.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Ooo I don’t recall these—anyone have links?",
              "id": 140,
              "comments": [
                {
                  "score": 246,
                  "content": "AITA Food Assholes Hall of Fame:\n\nSubway Guy\nhttps://www.reddit.com/r/AmItheAsshole/comments/ca7bdz/aita_because_i_ate_more_than_my_share_of_a_6_foot/?utm_source=share&utm_medium=web2x\n\nNoki Guy\nhttps://www.reddit.com/r/AmItheAsshole/comments/cblw2u/aita_for_refusing_to_pay_at_a_restaurant_that_was/?utm_source=share&utm_medium=web2x\n\nOlive Garden Guy\nhttps://www.reddit.com/r/AmItheAsshole/comments/achoyx/aita_for_very_rarelyalmost_never_wanting_to_go_to/?utm_source=share&utm_medium=web2x\n\nNo Vegan Food Guy\nhttps://www.reddit.com/r/AmItheAsshole/comments/dmlcx3/aita_for_not_accommodating_a_vegan_guest/?utm_source=share&utm_medium=web2x\n\nLasagna Guy\nhttps://www.reddit.com/r/AmItheAsshole/comments/b66ucw/aita_for_taking_my_girlfriends_lasagna_home_when/?utm_source=share&utm_medium=web2x\n\nChicken Guy\nhttps://www.reddit.com/r/AmItheAsshole/comments/bzr0h7/aita_for_serving_myself_the_biggest_piece_of_meat/?utm_source=share&utm_medium=web2x\n\nBolognese Guy\nhttps://www.reddit.com/r/AmItheAsshole/comments/dh2ai3/aita_for_not_wanting_my_wife_to_make_her_favorite/\n\nRecruit-a-Cook Guy\nhttps://www.reddit.com/r/AmItheAsshole/comments/dp37p9/aita_for_asking_a_neighbor_if_she_wanted_to_share/\n\nNo Vegetables Guy\nhttps://www.reddit.com/r/AmItheAsshole/comments/dusbc1/aita_for_not_letting_my_wife_control_what_i_eat/\n\nEdited to add Bolognese Guy and Recruit-a-Cook Guy!\nEdited to add No Vegetables Guy! Thanks, u/KittyScholar",
                  "id": 141,
                  "comments": [
                    {
                      "score": 72,
                      "content": "Omg, yes, noki guy! He's my favorite.",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "Wow, that was a doozy. Moral of the story: men expect their GIRLFRIENDS to be their personal live in chefs.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Or what about that guy who went on a date to a nice-ish restaurant (20-30 dollars a plate) with his girlfriend and was so pissed about the bill and kept calling gnocchi \"noki\" in his reddit post.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 168,
          "content": "This is one of the best AITA responses I've seen in a while!\n\nOP obviously YTA. \n\nWhy couldn't you just ask her \"Hey I'm not a good cook but I've smelled some great food coming from your place, would you mind sharing some easy recipes with me if that's not too much trouble?\"",
          "id": 145,
          "comments": [
            {
              "score": 33,
              "content": "[removed]",
              "id": 146,
              "comments": [
                {
                  "score": 18,
                  "content": "So many options and yet OP failed to do a single one of these!",
                  "id": 147,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 30,
              "content": "Exactly. OP could have used this as an opportunity to get to know his neighbor better and possibly make a friend (friend as in friend, not as in whatever OP might let his creepy imagination run away with), but instead turned it into... this.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Cause he can't cook, unlike woman who are born knowing how! \\*eye roll\\*",
              "id": 149,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Even that's weird dude, just google your damn recipes.",
              "id": 150,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15954,
      "content": "INFO: what the fuck?",
      "id": 151,
      "comments": [
        {
          "score": 3631,
          "content": "It's OK. He said she's not his type.",
          "id": 152,
          "comments": [
            {
              "score": 2124,
              "content": "Yeah, she just wants her to be his mommy, not his girlfriend! Sheesh",
              "id": 153,
              "comments": [
                {
                  "score": 570,
                  "content": "[deleted]",
                  "id": 154,
                  "comments": [
                    {
                      "score": 175,
                      "content": "Even asking for a recipe from a stranger can be kind of weird and has to be done just right. Asking a stranger to cook your dinner is just...what the actual fuck?",
                      "id": 155,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 239,
              "content": "Yeah, that’s where I fell off the fence.  Before that, I could see how this guy was maybe just a bit aloof.  But wow, that line just absolutely sealed the YTA ruling.",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "He even doubled the offer. But the initial $5 was pretty lucrative IMO",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 48,
              "content": "Yeah, that part was especially bizzare.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "That was quite possibly my favourite part of the story.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1820,
          "content": "That was the first time I got a chuckle out of this post.",
          "id": 160,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 513,
          "content": "Pretty much what the neighbor was thinking all the time.",
          "id": 161,
          "comments": [
            {
              "score": 28,
              "content": "It's his defense mechanism to deal with the fact he's a creep",
              "id": 162,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 288,
          "content": "\"I don't know how to cook\".\n\nSolution: Hmm... Could learn how to cook.... Nah, I'll just be a creepy ass neighbor and try to hire this women in the other apartment. \n\n*WTF*\n\nNo sense at all. No curiousity. No boundaries. No empathy. Who the fuck raised this guy? WHERE DOD YOU COME FROM THAT YOU ARE LIKE THIS?",
          "id": 163,
          "comments": [
            {
              "score": 51,
              "content": "This FFS - it’s not hard to make basic meals. There are Youtube instructionals. Don’t be so fucking lazy and entitled.",
              "id": 164,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 276,
          "content": "I would like to know when did he think it would have been a good time TO ASK HER HER NAME. Like I would have thought the situation was ok if he asked a friend, but the fact that he asked her to cook for him before even asking for her name is the thing that blows my mind the most",
          "id": 165,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 74,
          "content": "[deleted]",
          "id": 166,
          "comments": [
            {
              "score": 137,
              "content": "31 year old man who doesn't know how to cook and has to ask a stranger woman to cook for him. Jfc.",
              "id": 167,
              "comments": [
                {
                  "score": 92,
                  "content": "the whole \"dont know how to cook\" baffles me so hard. watch a video. follow the intructions. taste test to see if you need more or less spices. boom, youve cooked.",
                  "id": 168,
                  "comments": [
                    {
                      "score": 79,
                      "content": "[deleted]",
                      "id": 169,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 26,
                      "content": "How somebody gets to 31, say they don't know how to cook and not...  You know...  Go learn...  Like an adult...  Is amazing. \n\nIt's a learned helplessness that's pretty damn horrifying.",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "This deserves gold. lol",
          "id": 171,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "The only comment this post deserves",
          "id": 172,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9857,
      "content": "YTA - She said no, stop asking. Learn to cook, there's plenty of videos and subreddits to help you along. Hell, get a slow cooker. It's so hard to fuck shit up with a slow cooker.",
      "id": 173,
      "comments": [
        {
          "score": 2579,
          "content": ">Hell, get a slow cooker.\n\nThis can pretty much cook anything.... Just throw anything.... And it's ready.. Even for those who can't cook.",
          "id": 174,
          "comments": [
            {
              "score": 483,
              "content": "Electric pressure cooker > slow cooker",
              "id": 175,
              "comments": [
                {
                  "score": 813,
                  "content": "Yeah, but I can leave my house with my slow cooker on and not worry. I would never leave a pressure cooker alone. \n\nThey’re both great appliances to have.",
                  "id": 176,
                  "comments": [
                    {
                      "score": 191,
                      "content": ".... should I not be leaving my instant pot alone when it’s pressure cooking? I generally set it and then go run errands, is that not good?",
                      "id": 177,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "Ahhhhhh the multi cooker... That looks like rice cooker but has many function",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 101,
              "content": "This has literally been my solution to self-cooking. I love food but not a great cook (still trying to learn on my own). I got a croc pot for my bday along with a slow cooker cookbook. Now I can meal prep for a week so easily, and other than some meat browning or other quick frying in a pan, all I have to do is dump everything in the pot and wait. getting a pressure cooker or slow cooker is great advice.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 987,
          "content": "Hes 31, has he been living off fast food till now? The fuck? I can understand not knowing how go cook big steaks sous vide or something but OPs post makes it sound like he cant even cook a pasta dish.",
          "id": 180,
          "comments": [
            {
              "score": 442,
              "content": "He is not a rare case. I know plenty of people at OP's age that doesn't cook at all. It actually made it rise the amount of \"home made frozen meals\" business where I live.",
              "id": 181,
              "comments": [
                {
                  "score": 142,
                  "content": "Hell, my brother is almost 35 and his interest in cooking is nil. He probably *could* if he really wanted to, but he doesn't. Like, he's a smart guy, he could follow a simple recipe, buuuuut if you just put him in a kitchen with some ingredients and tell him to make something, he's gonna order himself takeout instead.",
                  "id": 182,
                  "comments": [
                    {
                      "score": 27,
                      "content": "I don't see a problem if his takeout is good food and not fast food. Some people don't have the time or the interest in cooking. That's fine. Other people make a living cooking frozen food. It's a win-win situation. \nThe main problem is that most people will go for fast food takeouts.",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "I work with a guy like this. 28, lives with his mom. Is constantly making unfunny “jokes” about how he can’t cook, and how he’s generally useless with life skills, because his mom does everything for him still. And it shows: the other day the toaster oven caught fire, because he put the rack directly on the element. He buys a fully precooked BBQ chicken every other day for lunch, and leaves the carcass all over the place...\n\n...but he’s *just* signed up for an adult’s basics cooking class (learning how to make soups, salads, etc.), so there’s that. And he’s not asking strange women to feed him a la OP, so!",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Or prefer not to cook. My husband doesn't get any joy from cooking unless it's to cook for me (even then it's only when the idea tickles his fancy) while I love to cook, so I'm usually the one that cooks. He can cook, he just doesn't enjoy it and would rather pop in a frozen meal or eat cereal for his meals. He enjoys baking though, so we end up with a giant amount of monster cookies at least once a month.\n\nEDIT: We're both 30, so OP's age if that matters.\n\nEDITx2: Adding on my thoughts about OP, why the fuck does he think he can just demand a total stranger to make him food?? Even my husband doesn't do that! He requests every now and then, but he normally doesn't 'cause he isn't an entitled person. WTF is wrong with OP??",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 307,
              "content": "Seriously. I don’t understand how people can “not know how to cook”. Like... put the food near heat until it’s no longer raw. That’s it. There are millions step-by-step instructions called “recipes” online for everything imaginable.",
              "id": 186,
              "comments": [
                {
                  "score": 129,
                  "content": "Ok, it's not just that there are recipes.... there's YouTube to show you stuff you dont know how to do, Google to look up words you don't know and every appliance you could need. Cooking has never been easier",
                  "id": 187,
                  "comments": [
                    {
                      "score": 24,
                      "content": "[deleted]",
                      "id": 188,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 175,
              "content": "Excuse me, are you saying mac ‘n cheese isn’t a pasta dish?! Holy kraft, how dare you?\n\n/s",
              "id": 189,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 86,
              "content": "And he doesn't even know her name...",
              "id": 190,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 67,
              "content": "Seriously, pasta is so damn easy too. Boil water in a pot, stick in salt, add pasta, stir pasta, leave it for a bit, drain water. Noodles done. Chop onions, add garlic and onions to a pan, some spices if you want, wait for onions to cook, throw in minced meat, stir until not pink, throw on sauce, leave for a bit, done. An eight year old can do it. No long or complicated prep work and it's generally quite forgiving.",
              "id": 191,
              "comments": [
                {
                  "score": 79,
                  "content": "Not disagreeing with you or making an excuse for the guy (Jesus, he’s in his thirties), but I have watched people fuck this up in countless ways. It’s not like cooking skills are overwhelmingly hard to pick up, but when you’ve been cooking throughout your life, it’s easy to forget that beginners don’t know not to [put the stove too high and burn the garlic and onions/undercook the garlic and onions out of impatience/overseason or oversalt/use the wrong seasoning/overcook the pasta/not drain the pasta right away/not salt the pasta water/burn the meat]. I have nothing but respect for people who learn to cook as adults—like learning a foreign language, it’s so much better when you’re a kid with brain plasticity and an unlimited license to screw up!",
                  "id": 192,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "In grad school I met a woman who was nearly 30 and used to work for the government, lived alone for over 6 years, etc.\n\nShe told me the only way she knew how to cook chicken was to boil it. This was her excuse as to why she never cooked—never ever.\n\nShe just always ate at restaurants or pre-made meals from grocery stores. I am positive she could learn how to cook, but she doesn’t have to and has no interest in learning.\n\nThis was not unique amongst my classmates. That’s what I get for going to one of the good ol’ boy schools.",
              "id": 193,
              "comments": [
                {
                  "score": 10,
                  "content": "Boiled chicken isn't even that bad. Throw some carrots and onions in there, and you got a stew goin', baby.",
                  "id": 194,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 243,
          "content": "I’m wondering if OP had other intentions even though he said “she isn’t my type” because I can’t imagine how anyone who doesn’t even know their neighbor’s name would have the audacity to ask a barely acquainted neighbor to cook for them and be upset they got turned down. He didn’t even have the decency to find out her name. Also, from Katie’s reaction I’m wondering if she already felt weird vibes from OP before he asked her to cook for him. I also agree with the top comment of how bad it is for women to have their own home become a place of anxiety. I have this issue with one of my doormen. It’s not fun. OP is def TA.",
          "id": 195,
          "comments": [
            {
              "score": 101,
              "content": "Maybe it's just because she's a woman and he thinks that's what women are for. After all, it couldn't possibly have been the old single dude doing the cooking.",
              "id": 196,
              "comments": [
                {
                  "score": 49,
                  "content": "She can't be creeped out by my actions, she's not my type!",
                  "id": 197,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "Based on his comment about how it couldn't be the single male neighbor cooking, this is likely it. OP has some sexist notions.",
                  "id": 198,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yeah. I bet OP gave off creeper vibes way before this fiasco.\n\nHe's out of touch with so much here I doubt he comes off as a regular joe.",
              "id": 199,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 178,
          "content": "There’s even videos and subs to teach you how to cook cheap shit healthily ans quickly. OP isn’t even trying.",
          "id": 200,
          "comments": [
            {
              "score": 195,
              "content": "He also lost one of his jobs... meaning he presumably has hours of free time that he just sort of spends not trying to cook.",
              "id": 201,
              "comments": [
                {
                  "score": 142,
                  "content": "That was what killed me.  He can't afford takeout anymore so what was he going to pay this neighbor?  The price of a value meal at the golden arches?",
                  "id": 202,
                  "comments": [
                    {
                      "score": 39,
                      "content": "He offered five bucks initially and upped it to ten lmao",
                      "id": 203,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "I’m not a great cook. You know what is? My InstantPot. I can forget to defrost the chicken, but add 5-10 more minutes to the pot and *bam* perfectly cooked chicken. \n\nOP get an instantpot and change your life! And leave that poor girl alone!",
          "id": 204,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Seriously. My friend who tried to cook brie in a bowl in the microwave can even use a slow cooker. Its not that hard and plenty of cookbooks are aimed at beginners and walk them through cooking. There are even  a million meal kit delivery services",
          "id": 205,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Shit even spend the extra for a large instant pot..the newest models all have settings from pressure cooking to slow cooking. OP, YTA",
          "id": 206,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6495,
      "content": "[removed]",
      "id": 207,
      "comments": [
        {
          "score": 2227,
          "content": "Who says she enjoys cooking? Whether she does or doesn't, why would she want to cook for a stranger? Cooking for yourself and cooking for others is totally different and comes with pressure, especially with money involved. And the fact that OP tried to pressure her a second time! So cringe worthy. Definite YTA.",
          "id": 208,
          "comments": [
            {
              "score": 624,
              "content": "That’s what I was thinking! She’s cooking to survive as a human being lol. And cooking just enough for herself. Doubling up recipes can be a headache",
              "id": 209,
              "comments": [
                {
                  "score": 383,
                  "content": "I also cook way differently for myself than if I cook for other people. I’m not a bad cook but I cook bad food all the time (healthy, little to no oil, cheap ingredients, with whatever is in my fridge that I need to use up). I eat it because I have to eat something, and sometimes it’s good and sometimes it’s not. I would never bring it to another person.",
                  "id": 210,
                  "comments": [
                    {
                      "score": 196,
                      "content": "Exactly. Last night I had four whole tomatoes that I ate like apples and a can of lukewarm soup for dinner. I was tired, I had a big lunch, and the tomatoes were going unused, so it was perfect. Still, nobody else would eat that if I tried to serve it to them lol.",
                      "id": 211,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Thats the thing that got me, why does OP assume its not more work to add another mouth to feed? Doubling the amount of onion chopping, garlic mincing, etc. Plus shopping for/transporting/storing twice the groceries. YTA.",
                  "id": 212,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "She probably also feels afraid of having a guy she doesn’t know coming to her apartment  **at night**  to pick food up. Probably thinking “what if he tries to barge in?” \n\nSome guys don’t realize how scary that is. Most of us are smaller and weaker than the average man.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Exactly. I hate cooking, but I've learned enough how to make nice tasty meals because I do love food and my hatred for eating the same thing over and over again outweighs my hatred for cooking.",
              "id": 214,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 753,
          "content": "Well and also its the added stress that this person now has come to expect food everyday.\n\nThe thing is yes she probably does cook most days but its on here schedule, sometimes earlier, sometime maybe not at all. If her plans change she can just pick up something on the way home.\n\nAs soon as she agrees to this, there will be a fella who will ask: \"Hey Katie, last night I sat around for 3 hours waiting for food! I have paid you for this and I expect food or at least a 24h notice to get my own food tonight\" which will then lead to you trying to eat with her every night and hold her accountable to this agreement that suits you really well but essentially takes her independence away.",
          "id": 215,
          "comments": [
            {
              "score": 381,
              "content": "And what if she cooks something he doesn't like? I know op would be all \"I'll eat anything!\" but eating Kraft mac & cheese without even *trying* to switch things up doesn't exactly scream \"curious consumer\" to me. Is he going to tell her how spicy she should be making her meals? Or what veggies he doesn't like? \n\nThis isn't a favor for a friendly neighbor. This is like him walking by a Wendy's and saying \"ah, that smells good, I think I'll get me some of that.\" Plus, isn't Kraft mac & cheese a dollar a box? This is his budget? \n\nIt'd be one thing if he asked her for recipes, but this is just creepy.",
              "id": 216,
              "comments": [
                {
                  "score": 40,
                  "content": "I guarantee this guy has an awful palette. 30 something surviving off KD lmfaooo. \n\nIf I was his neighbor I'd put some chicken tenders on an Iron Man plate and slide it under his door for this literal manchild and then charge him $5 for Heinz ketchup because I know he needs it to eat his tendies.",
                  "id": 217,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5165,
      "content": "YTA. For one thing, you are a human adult. Learn to cook. There are so many books and videos about this. You talk as though your only options are either takeout or Katie and they're not.\n\nYou assumed it wasn't the other person cooking because he's a single old man? Single old men eat too, there's no reason he couldn't be cooking? What a weird assumption.\n\nWhen she said she was busy, that was a polite way of saying no. It doesn't matter that she's cooking for herself every day, the socially appropriate thing to do would be to gracefully back off with the offer. Instead, you doubled down. You weren't asking her to split cooking though, you were asking her to do 100% of the cooking, including planning and buying ingredients. It's one thing to do this when it's your job, because you are paid for your time and so on. You keep saying it's not a big deal cos she's cooking anyway, but I think you're overlooking things. What if she doesn't want to cook one night? What if she stays late at work? What if she's sick? Speaking for myself I wouldn't want that sense of being responsible in some way for your meals, particularly when I don't know you well.\n\nAlso you can be creepy even if you're not into someone, you know. Being creepy is about not respecting boundaries, which is exactly what you did when you pushed the issue after she'd already declined. Making sure you told us that she isn't your type makes you sound like an asshole.",
      "id": 218,
      "comments": [
        {
          "score": 1500,
          "content": "PLUS! What if he doesn't like what she's cooked one night? What if he has allergies and food intolerances she doesn't know about? What if she mistakenly purchases an ingredient that gives him an upset stomach (or worse)? Forget how unbelievably creepy this all is, she's also being asked to open herself up to criticism and potential liability suits as well. Plus if she's being paid, doesn't her kitchen need to meet some kind of legal hygiene standard too? \n\nSo much YTA I'm almost speechless.",
          "id": 219,
          "comments": [
            {
              "score": 945,
              "content": "It also just forces her to communicate with her neighbor every single day, which is one of the (many) reasons this would be perceived as creepy. Does she have to knock on his door with a steaming plate of food? Will this stranger be using her dishes? Does he then have to knock on her door to return the empty plate? Is he expecting them to eat together? Wash dishes together? How long before he also asks her to do his laundry? What if all of a sudden he's there all the time and they're virtually married but it's the 1950's and she does everything? There's just no way for this not be weird.",
              "id": 220,
              "comments": [
                {
                  "score": 407,
                  "content": "It’s essentially forcing her to have some sort of relationship with him... all because something in the hallway smells good in the evenings.",
                  "id": 221,
                  "comments": [
                    {
                      "score": 135,
                      "content": "It'd be like if he said \"hey I notice you wear workout clothes several nights a week, could I pay you to be my personal trainer?\"\n\nOr \"hey I noticed you take out your garbage regularly, can I pay you to also take out mine?\"\n\nShe's your neighbor, not a freelancer on Angieslist.",
                      "id": 222,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 50,
                      "content": "I mean, why would she put delicious food smells into the hallway, if she didn't want people to eat her food... She's sending mixed messages here!\n\n/s",
                      "id": 223,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "I can relate to his situation so for me this is extremely weird.\n\nI'm a single guy in my mid 30's who lives in an apartment and I can't cook for shit. Luckily I can get healthy take away food where I live.\n\nI'm not friends with anyone in my apartment building but I know them and we are on good terms. I have a really good relationship with one couple especially and we've known each other for 10 years. The woman is especially nice and she's helped me with all kinds of stuff before. Like sewing a whole in my jeans and stuff like that.\n\nThe thought of me asking her to cook for me everyday is so cringe worthy I can't even describe it.\n\nEdit: Since this post has been locked I'll answer the reply from /u/Welcoming32 here.\n\n> Without commenting one way or the other, could you possibly express yourself in a manner that would be more hurtful?\n\nYes I could easily be more hurtful. I didn't say anything negative about OP at all. Only about the actions he took.\n\n> Are you trying to send someone into a shame spiral?\n\nNo. I was giving my opinion about how I'd feel if I had done what OP did. I'm not sure exactly what made you think I was trying to do that. Is it \"cringe worthy\" that did it?\n\n> Are you one of the people that acts shocked when people break and do harmful things to society, despite contributing to the problem with your hurtful vitriol?\n\nNo I'm not shocked when that happens. It's also not my responsibility to stop that from happening. I don't want to be rude to other people but other than that I'll speak my mind. If that somehow affects society negatively then so be it. \n\nIf you think I was rude in my original post I'd like to know what specifically was rude.\n\n>  The fact that you can’t muster up some constructive advice despite being in your 30’s is likely why you are single and angry. Get some help big guy.\n\nI did muster up some constructive criticism/advice.\n\n1. Get healthy takeaway food.\n2. Don't do something as cringe worthy as asking a stranger to cook for you.\n\nWhy do you think I'm mad? I was reading through the comments of a post and since I'm in a pretty similar situation to OP I thought my perspective on the matter was relevant.. I honestly don't see how you get mad from my comment at all. Please enlighten me.\n\n\n**Edit2:**\n> Making OP feel estranged and humiliated was clearly your goal. Words matter. If he was your brother, you’d choose your words more carefully. Instead, he’s an internet stranger, so hey, who gives a shit, make him feel like scum garbage.\n\nSo I asked you to enlighten me on exactly what word(s) you found to be rude specifically. You can't do either but can only call me a dick and throw out a generic \"words matter\". Sure they do, tell me which ones exactly got your panties this much in a bunch?\n\n> Just another keyboard tough guy.\n\nI'm the keyboard tough guy? I haven't resorted to name calling or anything of the sorts.\n\n> Hope things get better for you, bud.\n\nYou're not my bud, pal!\n\nAlso do you have some sort of prejudice that single guys are not happy? I'm pretty happy for the most part.",
                      "id": 224,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "Right he's such a sexist entitled piece of shit. \"oh that food smells good. I bet that woman creature, who is totally not hot, will just be so happy to cook special meals for me. She obviously loves to cook and my budget of dollar menu/Kraft Mac and cheese will be a good enough of paying her to go shop, prep, cook, and interact with me. She's a woman she probably gonna enjoy doing it anyway\"\n\nHope this shit head stays single forever.",
                      "id": 225,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "The whole thing would really open up a pandora's box of social nightmares for this poor woman. I get stressed out just thinking about the actual mechanics of living with this \"deal\". She'll be avoiding this guy at any cost in the future.",
                  "id": 226,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I used to cook weekly at a friend’s house in her big kitchen doing meal prep for us both for the week in exchange for use of her washer dryer. We would split the cost of groceries. She hates cooking and I enjoy it. It was a pretty nice deal for both of us because we both benefitted... but it was also a huge pain in the ass because she can’t tolerate anything even slightly spicy while I love spice. I made things we would both enjoy because she was my friend and it was a mutually beneficial situation (but damn is it nice to now cook and not worry about someone else’s preference because my boyfriend will eat anything I cook!).",
              "id": 227,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 880,
          "content": "Also \"I don't know her name ... but we aren't strangers.\" \n\nYes you are.",
          "id": 228,
          "comments": [
            {
              "score": 53,
              "content": "Yes. I would consider most of my neighbors strangers. We generally only see each other at the annual 9-1-1 call. (I don't know why, but about once a year we all end up outside at the same time due to an emergency). But I know their names. How could you live in an apartment and not have seen their names on the buzzer system, on the mailboxes, or on packages delivered to the lobby?",
              "id": 229,
              "comments": [
                {
                  "score": 24,
                  "content": "[deleted]",
                  "id": 230,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "Exactly.\n\nAsking the neighbor to be his personal chef would be like step 104.\n\nStep 1: Ask for her name.",
              "id": 231,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "What if she invites a date over to her house for a home-cooked meal?\n\n\"Thanks for cooking for me tonight Katie! Not only are you my type, but those steaks sure smell delicious! Hmmm, you made three of them?\" \n\n\"Yeah, I always make extra and bring a plate to my neighbor down the hall.\"\n\n\"Oh, you mean that nice old man? Makes sense, he's old and therefore can't be cooking for himself.\"\n\n\"Nah, it's the single guy around my age. We have this arrangement where I do girlfriend type stuff for him, and he pays me. Be back in a sec!\"",
          "id": 232,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": ">Also you can be creepy even if you're not into someone, you know. Being creepy is about not respecting boundaries\n\n**This**! OP idk if you realize the lack of logic in explaining away that you weren't being creepy bc she isn't your type. Just, like, think about that for a bit. Maybe put yourself in others' shoes: could someone creep you out if you weren't their type? (How would you know if you're their type?)",
          "id": 233,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4165,
      "content": "There’s no excuse for a man your age to not know how to cook at least a few things. YTA",
      "id": 234,
      "comments": [
        {
          "score": 1413,
          "content": "Holy shit I completely glossed over the fact that he was 30+. Imagine being that age, having lived alone for years, and still being unable to make yourself a decent meal lol.",
          "id": 235,
          "comments": [
            {
              "score": 391,
              "content": "My dad was like that until I moved in and cooked for him. So he stopped eating out, started making meals himself. Now, years later, he posts his poorly taken photos of his bachelor meals all the time. \n\nOP is an asshole but also has clearly lacked any positive role models regarding food",
              "id": 236,
              "comments": [
                {
                  "score": 338,
                  "content": "Yeah but he also can just, like, make a fucking sandwich. Why is he resorting to only fast food and Mac and cheese? Make a sandwich and heat up some soup, dude.",
                  "id": 237,
                  "comments": [
                    {
                      "score": 40,
                      "content": "[deleted]",
                      "id": 238,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 31,
                      "content": "Oh but he \"doesn't enjoy\" cooking.  \n\nAre you fucking kidding me, OP?\n\nPeople do things that they have to do, even if they don't enjoy them.  Because a adult human needs to be able to cook for themselves.  YTA",
                      "id": 239,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "Exactly. Hell even if all he buys is ramen and mac n cheese you can jazz that up 72 thousand ways.",
                      "id": 240,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Also, there's a lot of fairly inexpensive but easy to heat up ready made food. For like $6 you can get multiple meals worse of potstickers + fried rice from trader joes which is mildly healthier, lower calorie, and has hte option to just be heated up on a pan or microwaved if you're that desperate.\n\n&#x200B;\n\nLoooots of places have food that has like... two step preparation if you aren't ready for more complex meals. Stuff to hold you over while you learn how to cook actaul... meals\n\n&#x200B;\n\nFuck, steaming vegetables is some of the simplest shit you can do. Boiling eggs. Heating up soup!!",
                      "id": 241,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Oh I agree for sure",
                      "id": 242,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "aw this is super cute!",
                  "id": 243,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Yah my dad is adorable. He grew up on a mennonite colony and started out with all the racism and sexism that comes with that. But he listens and learns and gets really excited about perspective shifts. He's far from perfect but he tries and cares and it's one of my favorite things. \n\nWhen I graduated from computer engineering he was bursting with pride despite earlier warning me about what was appropriate for women to do, for example",
                      "id": 244,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 217,
          "content": "I mean literally you cannot fuck up some slow cooker meals. I just made something yesterday and COMPLETELY FORGOT a major ingredient and it was still bomb.",
          "id": 245,
          "comments": [
            {
              "score": 19,
              "content": "Stop teasing and give me *all* the slow cooker recipes. Please?",
              "id": 246,
              "comments": [
                {
                  "score": 18,
                  "content": "Google \"slow cooker crack chicken.\" One of my favorites.",
                  "id": 247,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Came here to say this... there isn't any excuse for a 31 year old man (or woman) to not know how to cook.  At the very least you should be able to capable of making a sandwich, that's not even cooking.",
          "id": 248,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2862,
      "content": "YTA - everyone else has laid out why really well but I also find it genuinely astonishing to ask someone whose first name you do not even know to cook for you???\n\nAlso you are clearly not thinking about all the extra labour that would go into this hypothetical arrangement besides the shopping, prep, cooking and packaging it up (Do you provide tupperware or containers? Does she use hers and do you factor in that cost).\n\nThink about it, you two would have to be in constant communication now re. meals, if you expect food every time she cooks and assume that is every evening then she now has to let you know every time she doesn't, so every time she goes on holiday, or is out for the evening, or is having friends round and they are getting pizza etc etc. She also now needs to take into account your tastes and any dietry needs, if you don't like what she cooks will you still pay her? Also, if you are not eating in then you need to tell her, what if you spontaneously go out to dinner one evening after work and forget to let her know? Do you still pay her for what she makes or is she now out the cost of that food? \n\nThat is all actually a lot of planning, organisation and constant communication ie. work and emotional labour.",
      "id": 249,
      "comments": [
        {
          "score": 963,
          "content": "I think OP might have low empathy.  Basically he just cared about what he wanted: good food.  He wasn't able to put himself into his neighbor's shoes.",
          "id": 250,
          "comments": [
            {
              "score": 314,
              "content": "He's never been the chef and sincerely believes it'd just be taking $X food budget now + $Y from him, and nothing else changes for the neighbor! She just stirs a pot of slightly more food, right? I can empathize with OP for the blindspot existing, but damn..\n\nIn case OP reads this, kudos on taking feedback via blunt force and not digging yourself deeper with the neighbor.",
              "id": 251,
              "comments": [
                {
                  "score": 317,
                  "content": "I make $10 an hour cooking food. \n\nI’m not gonna make you a meal everyday for less than $40 per meal all meals paid for up front on the first day of the week. \n\nMy kitchen is not a small factory dedicated to making food. What you’re doing is essentially begging for free food like a homeless person.\n\nI don’t go to the store everyday. I don’t have space to store food for someone else, now I have to worry about double the amount of food spoilage, double the amount of prep, double the wear on literally all of my equipment, I probably have to buy bigger pots and pans to suddenly double the amount of food I’m having to portion. Plus, you’re gonna borrow my Tupperware every night and give them back in the morning or what? Or are gonna insist on eating with me every night too? Or do you just wanna walk in and scoop food out of the bowl and go back to your apartment like a weird roommate because the whole point of paying for your own apartment is not having to put up with that anymore. You gonna help pay her rent too?",
                  "id": 252,
                  "comments": [
                    {
                      "score": 121,
                      "content": "My SO did meal prep / private cooking for people with very restricted diets, and she was paid for groceries + $300 for a weeks worth of meals. As you've outlined, there's a substantial amount of effort from start to finish, but if you're going to agree to take on this new uncomfortable obligation to cook for your neighbor, it needs to come with a fucking payday not an extra $5-$10 / meal.",
                      "id": 253,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 236,
              "content": "That and he is lazy as hell. Look up recipes online, buy a cookbook and some supplies. GROW UP, OP!",
              "id": 254,
              "comments": [
                {
                  "score": 21,
                  "content": "Or even ask the neighbor for her recipes. I mean, too late now, but I bet prior to asking not once, but twice for her to cook for him, she would have been flattered at the request for the recipes she uses.",
                  "id": 255,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "Maybe OP could offer her money to wear her shoes every now and then.",
              "id": 256,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "OP’s mommy is no longer feeding him so obviously that job goes to the nearest woman by default whether he even knows her damn name or not...",
          "id": 257,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Believe it or not, there are *places of business* that actually do all that stuff...they're called *\"restaurants,\"* because feeding strangers is a business some people choose to get into. I know, OP is 31 but didn't know this!",
          "id": 258,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "Deserves to be higher, I totally agree. \n\n\nIn principle yea, she's cooking so why not make you something\n\n But you're now forcing her to be in contact with you all the time. That's the creepy bit, and sounds exhausting especially when  you're not even friends. She may not feel like cooking but feel obligated to, with this arrangement. Or if she's ill/away she now has to tell you, when she's obviously not interested in anything more than the polite neighbour relationship she has (had!). FWIW I'm pretty sure after this, you're not her type either.",
          "id": 259,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This. He gets upset that she considered him a “stranger” but started out by stating he doesn’t even know her first name. I don’t know what fairy tale world this guy’s living in but yes YTA.",
          "id": 260,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2660,
      "content": "Um, yeah, YTA. \n\nJust because something 'makes sense' to you doesn't mean she should just jump on your bandwagon. If I was vacuuming my apartment and my neighbor knocked on the door and asked if I could vacuum theirs for $5 I'd be weirded out. I'm vacuuming my apartment, not advertising a business.\n\nYou're offering to pay her, but she'd have to buy extra, modify her recipes, spend more time making more food and then package it all up for you and then bring it to you?? It's really pretentious of you just because \\*you\\* think someone has the time and energy to do something, that they should. Cooking is tiring, requires a lot of dishes and prep, and you\n\nThere are plenty of meal services and meal prep companies that advertise this service. You badgering your neighbor to make you dinner just because you offered to pay her is weird and ridiculous.",
      "id": 261,
      "comments": [
        {
          "score": 545,
          "content": "Just the fact she has to think about OP at all in her daily food life. What if she doesn’t feel like cooking one night? She now has to feel the obligation to do so because the guy across the hall is expecting food? This is an all round weird request. \nI mean, wouldn’t we all love to have someone else preparing food for us after a long day? The idea of just walking next door and asking my neighbours to do it for me, even for money, is beyond insane.",
          "id": 262,
          "comments": [
            {
              "score": 62,
              "content": "If he was offering like 20-30$ a night, I'd be down. But he was prob offering like 5$, not even worth the effort.",
              "id": 263,
              "comments": [
                {
                  "score": 72,
                  "content": "Per one of his comments, it was literally $5 lmfao then he tried to get her to do it for $10",
                  "id": 264,
                  "comments": [
                    {
                      "score": 34,
                      "content": "That's a no from me dawg.",
                      "id": 265,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Considering the dude can't afford takeout anymore, yeah I'm guessing it's a lowball",
                  "id": 266,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Even worse, only offered $5 then $10. Because the ingredients for another person, nay, a grown man aside from a woman, will only cost that much somehow.",
              "id": 267,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "What's funny to me is that it's far too much work for him to buy groceries and cook for himself but he thinks that SOMEONE ELSE would enjoy doing that work for a total stranger.",
          "id": 268,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "You can tell OP has never tried to cook. it’s a lot more work than people who don’t cook think it is. It’s not just “making a little extra”",
          "id": 269,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "You make a good point that services like this exist. It sounds like OP is not in a position where he can afford these services, or he would just do that. So the fact he thinks he can hire his neighbor to do it really makes me wonder how much he offered her.",
          "id": 270,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2188,
      "content": "YTA\n\nIt might have been OK to ask once, but it’s an asshole move to ask twice.\n\n> I think asking her to split cooking wasn't completely outlandish, since she cooks every day anyway and it wouldn't be hard to make a little more.\n\nYour request was very unusual. Since you don’t know how to cook, you are not in a position to tell someone else how hard cooking is!!",
      "id": 271,
      "comments": [
        {
          "score": 1208,
          "content": "I think it's weird as fuck to even ask once.",
          "id": 272,
          "comments": [
            {
              "score": 347,
              "content": "I think it could make you just weird, or maybe a forgivable asshole, but asking again after being rejected is total unforgivable asshole.",
              "id": 273,
              "comments": [
                {
                  "score": 201,
                  "content": "The first time was tone deaf. The second, he’s completely TA",
                  "id": 274,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 238,
          "content": "Exactly, he doesn’t cook but he assumes that extra cooking is not a big deal, like ????",
          "id": 275,
          "comments": [
            {
              "score": 13,
              "content": "*Him* cooking is a bid deal.  *Her* cooking isn't a big deal.",
              "id": 276,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1758,
      "content": "[deleted]",
      "id": 277,
      "comments": [
        {
          "score": 692,
          "content": "Was it literally $5?? man holy fuck that is insulting",
          "id": 278,
          "comments": [
            {
              "score": 264,
              "content": "I know right? If you're going to be a weird asshole about this, at least be a generous weird asshole. Throwing cheapo into the mix just makes you look pathetic",
              "id": 279,
              "comments": [
                {
                  "score": 186,
                  "content": "even those meal kit delivery services where you cook your own food are like $10 a serving",
                  "id": 280,
                  "comments": [
                    {
                      "score": 34,
                      "content": "My ex of years ago went pescatarian out of nowhere when those boxes came out so I decided to order them for a while to learn how to cook those types of dishes. They allow you to cheat a little bit because everything they send is portioned appropriately already but I'll be damned if I didn't learn a ton about vegetarian cooking. They're expensive but a decent way to broaden yourself for a while. You want a fucken seared tofu dish or lentil soup now? I'm your man.",
                      "id": 281,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Lol this is my favorite comment.  Life goal: *generous* weird asshole",
                  "id": 282,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Wait... he offered $5?!",
              "id": 283,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "He even said he doesn't have money for take-out-food. The audacity...",
              "id": 284,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 382,
          "content": "Yeah as someone who cooks for two regularly, $5 is nothing, especially if you’re cooking meats/proteins. I’m in shock at how ridiculously self-unaware this guy is.",
          "id": 285,
          "comments": [
            {
              "score": 240,
              "content": "Get this. In a response he says that maybe in a few months he will have another job. Or a girlfriend to cook for him!!! OP is off his rocker.",
              "id": 286,
              "comments": [
                {
                  "score": 18,
                  "content": "He is not ever going to have a girlfriend to cook for him. Not with his attitude.",
                  "id": 287,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Sadly yes he will. Plenty of girls with low self esteem or girls who are taught that it is their role to be a housekeeper/mum to their partner.",
                      "id": 288,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I cook for two regularly and it rarely comes out to more than $5 per serving unless I'm doing fancy or weird. But yeah, OP should also have factored in labor. $10 is a bit more appropriate unless it would actually be a lot of extra cost and labor, which, who knows.\n\nOP is still just full of yikes though",
              "id": 289,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 40,
          "content": "Are you serious? $5 wouldnt even cover the cost of ingredients, let alone pay her for time and labor. This guy sounds sexist as hell.",
          "id": 290,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": ">  Offering her $5 for a home-cooked meal \n\nwat\n\nedit: Okay, checked his comments. Even though he doubled the offer - the guy can't be serious. I mean, 10$ wouldn't even remotely be enough for such a service where I live, and AFAIK groceries are more expensive in the US. I strongly doubt that this would even cover her costs.",
          "id": 291,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}