{
  "post content": "I (24,f) moved to another state with my family right before the start of my senior year of high school after living in Chicago for 10 years (2005 - 2015, technically 10 yrs and 3 months). I was constantly sick due to the cold weather and my mom thought it was best to move back to where I was born which was California. After moving back I rarely got sick like I did while living in Chicago however I was also in a committed relationship too (23, m). We've been together for 10 years now and he wants me to move back to Chicago to move in with him. He says that i wouldn't have to wait for the bus and that he can pick me up and drop me off at work to prevent me from getting sick even though I tell him it is the cold weather and that if I go back it will not end well. I've already discussed me going back with my doctors at least health wise and they have all recommended that I shouldn't go back due to my extensive medical history. When I try to convince him to move out to Cali he always makes the excuse of it being too expensive and that it would be cheaper and the smartest option to live in Chicago. I'm starting to feel like there isn't a compromise here but I love him. \n\nAm I the A-hole?",
  "id": 1,
  "comments": [
    {
      "score": 28,
      "content": "If you’re looking for a compromise, it wouldn’t be California or Illinois. Maybe somewhere that doesn’t have the price issues of California or the cold issues of Illinois. \n\nIt might not even be the solution, but it would be an interesting test. If he shoots down a compromise then obviously he’s.. well, he’d be uncompromising. If you’re not willing to float the idea, then the same could be said for you. \n\nUntil that conversation is had, NAH.",
      "id": 2,
      "comments": [
        {
          "score": 6,
          "content": "I think this is the answer.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 15,
      "content": "NAH there are 48 other states to live in. Over half of them are going to be warmer than Chicago and better living costs than California. If you both can’t agree on where to live together, then distance may not be the issue.",
      "id": 4,
      "comments": [
        {
          "score": 7,
          "content": "This. He may just want to stay comfy in Chicago, and not compromise at all. OP, your health is way more important than his comfort of living in Chicago.",
          "id": 5,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "NAH, but you two still are going to have to work this out one way or another.",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "He’s the asshole for wanting you to move to a place you were chronically ill. What kind of quality of life is that?\n\nNTA",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA. If actual doctors are recommending against it, then it should be a no-brainer not to move. \n\nThe problem is there *is* no way to compromise on this. Your health is a priority, so his compromise involves you doing something that is unhealthy and just relying on him to keep you out of the weather, basically forever? Never gonna happen.\n\nI'm more interested in how a 14yr old and a 13yr old manage to stay in a committed relationship for 10yrs when more than half of it is thousands of miles apart.",
      "id": 8,
      "comments": [
        {
          "score": 2,
          "content": "We do visit each other a few times a year after I moved. I moved when I was 17 and he was 16. It's been rough tbh but we've made it work and it's been even harder since the pandemic.",
          "id": 9,
          "comments": [
            {
              "score": 4,
              "content": "Well either way, still n t a. \n\nYour family moved across the country for you to be healthy. Your boyfriend wants you to move across the country to be unhealthy. \n\nThis may be one of those times you have to go your separate ways. You shouldn't be forced to move, and certainly not forced to risk your health. At the same time, he shouldn't be forced to move either.",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "Info: I think I’m misreading, you moved to Chicago eleven years ago at the beginning of your senior year but somehow you’re only 24?",
      "id": 11,
      "comments": [
        {
          "score": 2,
          "content": "No, she moved back to CA after being IN Chicago for 11yrs.",
          "id": 12,
          "comments": [
            {
              "score": 1,
              "content": "Yeah OP just explained that",
              "id": 13,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I moved to Chicago in 2005 and stayed there for about 11 years before moving back to Cali before my senior year of high school.\n\n2005 - 2015. It was 10 years about 3 months tbh. I'll fix it though",
          "id": 14,
          "comments": [
            {
              "score": 2,
              "content": "Oh you moved away from chicago right before senior year I understand",
              "id": 15,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA. He is the asshole because he isn't listening to what your saying, but rather trying to solve a problem that can't be solved with rides. And I'll doubt he'll he eager to play chauffer once that snow hits. Snowfall around the greatlakes can be nightmarish.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA \n\nI also laughed out loud at him claiming Cali is to expensive. Chicago isn't cheap by any means",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Why have you been in a committed relationship since you were 14?! You’re an adult now. It’s well past time to move on from your childhood relationships. And this is the perfect opportunity, because you clearly want different things. Take the time to be alone and learn who you are and why you want to be. You can find someone to date who’s local later. NTA",
      "id": 18,
      "comments": [
        {
          "score": 2,
          "content": "How is any of what you said relevant? What a fantastically ignorant statement to make? I have friends (we are 48) that got together when they were 15. Still married. Why would she have to break up with someone just because they got together as teenagers?",
          "id": 19,
          "comments": [
            {
              "score": -2,
              "content": "It’s not ignorant. It’s an informed, wise statement. I’m the same age as you. Nearly everyone I knew who got together as children eventually broke up or are miserable and didn’t do most of what they wanted with their lives. \n\nPeople need time to figure out who they are and who they want to be. Staying with a childhood love leaves both people stunted and unrealized.",
              "id": 20,
              "comments": [
                {
                  "score": 0,
                  "content": "That is a blanket statement and absolutely untrue.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 0,
                      "content": "You don’t have to agree with me. It doesn’t make my opinion any less valid than yours.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I don't feel like a good girlfriend because I won't move back to Chicago for him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 23,
      "comments": [],
      "relation": "No"
    }
  ]
}