{
  "post content": "My  mom is married to \"Rick\" not even going to call him my stepdad. He does  not like me, does not speak to me, and I recently learned doesn't  actually know which of my kids is which. That being said we can hang out  and be civil. He just will not talk to me.\n\nRecently  we went to a beach with Rick, my mom, and my aunt and uncle. The set up  kind of sucked because the sand area was very narrow, so we had to walk  pretty far to get a spot. Since we have kids we had a lot of stuff, and  had to go back to the car. I told my wife to stay with the kids and I'd  get it even if I had to make two trips.\n\nAt  this point I don't know where my aunt was. My mom took her dog for a  little walk, and my uncle was also making a trip back to get some stuff  for my one year old cousin. So Rick was the only person sitting. My wife  asked Rick if he would keep an eye on the kids while she went to the  car. He said no. She told him he was being childish and it would only be  a minute.\n\nI did see her in the  parking lot, but she told me Rick was watching the kids. When we  returned my aunt yelled at me that we are irresponsible and stupid, and  that she had to go in the water and get my kids. My wife asked Rick what  was going on and he said he told her no, and called us both fucking  idiots. He said the kids were fine and he wouldn't have let them drown  (I agree with my aunt that they shouldn't have been out there)\n\nMy  wife yelled at Rick, and my aunt began to berate us (she was mad  because she didn't have a good spot to put her baby) At this point my  mom came down and asked what was going on. My wife began to yell at my  mom that she never should have married Rick, and this is her fault for  bringing him into the family.\n\nI  snapped at my wife and told her she always treats my mom like shit for  the most minor things, but she was irresponsible and owes our kids,  Rick, and my aunt an apology. I said she put out kids in danger, so how  am i supposed to trust her again, and said she needed to use her head.\n\nShe  began to cry and said I was being mean. She asked if I was going to  yell at my aunt for being a bitch, or yell at my mom for marrying Rick  and I said no. Now she is angry with me, and saying she doesn't want to  be around my mom anymore for marrying Rick. For reference our kids are  all under 5 and two can't swim.",
  "id": 1,
  "comments": [
    {
      "score": 1011,
      "content": ">He said no. She told him he was being childish and it would only be a minute.\n\n\n\nYour wife is the AH.   Majorly.\n\n\nESH.   This trip was going to be a shitshow and I think you knew that.   Good grief, don't travel with people you don't like!",
      "id": 2,
      "comments": [
        {
          "score": 45,
          "content": "how is OP an ass here? curious as to the reasoning.",
          "id": 3,
          "comments": [
            {
              "score": 204,
              "content": "Why would he subject his family to a man like Rick, who treats him and them with nothing but disdain? If my mom's husband would literally pretend I don't exist, I would never make my kids spend time with him...",
              "id": 4,
              "comments": [
                {
                  "score": 38,
                  "content": "Imo both mom & OP made some questionable decisions to facilitate the family beach day: the parents’ stupid calls show that Rick is not just an asshole, but also a danger to their children.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 106,
              "content": "Well, for starters, he dragged his entire family on this nightmare of a vacation…",
              "id": 6,
              "comments": [
                {
                  "score": 4,
                  "content": "Sounds like it was just a day trip",
                  "id": 7,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I reread the post and I think you’re right. I’ll bet that day trip felt like it last a week, though.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 78,
              "content": "He was also extremely cruel for how he spoke to his wife in the moment.",
              "id": 9,
              "comments": [
                {
                  "score": 8,
                  "content": "Maybe if the giant AH he married did not abandon their children when Rick said NO to watching them, and then yell at OP's mum for nothing... she got what she deserved.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 497,
      "content": "ESH (except your mom and uncle)\n\nYou were completely wrong for yelling at your wife and singling her out. Absolutely, you two needed to have a conversation about her decisions but to berate her in front of your family was horrible. \nYour wife was wrong for yelling at your mother and Rick She definitely made a bad choice leaving the kids with Rick. (Rick said no; sure, it was rude but he was transparent). \nYour Aunt had no business increasing the drama. \n\nWhat an awful situation.",
      "id": 11,
      "comments": [
        {
          "score": 186,
          "content": "She was yelling at OP's mom who wasn't at fault. If we say that a husband should back their wife up if they are being yelled or treated badly by their parents (especially mother) and stand up for them, then why is OP wrong to ask her to cut her shit out when she's yelling at his mom.",
          "id": 12,
          "comments": [
            {
              "score": 112,
              "content": "For real, I don't get why OP is TA here.\n\nOfc the family dynamics are kinda weird, but can these grown ass ppl not pull themselves together so the kids can have ONE nice day with their parents and grandma? What petty ass bullshit.\n\nThe wife could've gotten those kids killed, bc of her entitlement, then tried to blame everyone and their mother (OPs to be exact ( ͡\\~ ͜ʖ ͡°) ). If my partner was so horribly wrong, ridiculous and insulting then I would say sth as well.\n\n&#x200B;\n\nETA: That whole 'berating' shit was not out of nowhere. It was to protect someone else that has been absolutely wronged in that situation.",
              "id": 13,
              "comments": [
                {
                  "score": -6,
                  "content": "He could've handled this a lot better, but the wife is not the only AH in this situation, though she is the biggest one . \n\nHe definitely could have calmly spoken to his wife, but it is never okay to yell and scream at your partner",
                  "id": 14,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Are you actually saying you would‘ve kept your cool when:\n\n- your wife left your kids on the beach\n- those 2 kids JUST got pulled out the water\n- your wife is yelling at everyone, desperately trying to shift the blame onto someone else\n- your wife in that moment is more concerned of who to blame and airing her general grievances (‚ugh I hate this man, if your mum didn‘t marry him, this would not have happened‘) than the fact your kids almost fucking died right then and there\n- everyone else is yelling back as to defend themselves/MIL?\n\n\nBc I actually highly doubt that. ‚You should never..‘ is all fine and dandy… until you‘re in an actual crazy situation like this. \n\nI don‘t blame OP one single bit.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "When your partner is clearly yelling at your parent( for no fault of theirs) or even you then yes you can yell back. She is screaming and yelling but OP needs to talk calmly to his wife when she just endangered their children.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "No that's sexist. Nearly every time we see a wife berate her husband for doing something stupid, people vote NTA. Now we see wifey over here puts children in danger for no good reason and it's \"E S H\" or \"Y T A\".",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 47,
          "content": "Idk, I think the aunt had a right to freak out. She was dealing with a baby and then had to swoop in and save the other kids. I'd have been pissed to know that those kids were left to just wander into the water.",
          "id": 18,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "The mother also sucks for marrying a man who dislikes her son.",
          "id": 19,
          "comments": [
            {
              "score": 8,
              "content": "That's her right, he's an adult. It would be different if he was a child",
              "id": 20,
              "comments": [
                {
                  "score": 0,
                  "content": "She clearly has that right. Nobody stopped her, she got her marriage license using her freedom to marry whoever she wants. She has that right whether her children are underage or not. We can disagree on whether it's an asshole thing to do or not, but I never said she didn't have the right to do that.",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -16,
          "content": "And especially the kids, little shits.",
          "id": 22,
          "comments": [
            {
              "score": 1,
              "content": "Looks like no one else found this funny, but *I* enjoyed it",
              "id": 23,
              "comments": [
                {
                  "score": 1,
                  "content": "Thanks lol",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 288,
      "content": "I can't  believe I'm saying this, but ESH except Rick and your uncle. Rick sounds annoying, but he said no and he's not required to watch someone else's children. Your aunt sounds like she escalated the situation, your wife somehow found a way to blame your mom (which I don't totally understand) and you chewed out your wife publicly when it should have been a private conversation at home. It's clear none of you get along, so maybe skip the next family outing?",
      "id": 25,
      "comments": [
        {
          "score": 104,
          "content": "Perfectly stated. Rick may be a jerk for other reasons but no means no, and he did nothing wrong here.",
          "id": 26,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "This! So much this!\nNo means no. He still kept a eye on them, bit your wife left! Wtf! \n\nMy husband is a trained lifeguard and swimming teacher (his side job in collage) \nWe have 5 kids, and trust me it can be soo hard going to the beach! Wich is why we plan it, pack for it, and make sure one is in the water with the kids, and one is on the beach at ALL times! We do switch, but all the kids are coming up with the person in the water, and then go back if they want to go back. Even the oldest at 12, who learned to swim at age 5. \n\nESH",
          "id": 27,
          "comments": [
            {
              "score": -14,
              "content": "[deleted]",
              "id": 28,
              "comments": [
                {
                  "score": 7,
                  "content": "Lake =/= Ocean",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 36,
          "content": "100% agree.  Rick might not be Mr. Personality but at least he's straight up honest and doesn't pretend to like anyone else.",
          "id": 30,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "I think the aunt had every right to say what she did, honestly. How would you feel if you had to swoop in to ensure the safety of some kids that their parents just left to wander into the water? I'd be livid.",
          "id": 31,
          "comments": [
            {
              "score": 6,
              "content": "Op said the aunt was mad because she didn't have a spot to put her baby, not because she had to swoop in. Though I don't know how reliable op is as a narrator",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "This was perfectly stated. If I could use your exact words I would…but ya know…don’t wanna steal a comment.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Lol, I think I have to change my vote to exclude Rick.  You are completely right. That damn Rick!🤭",
          "id": 34,
          "comments": [
            {
              "score": 7,
              "content": "😆 I'm sure he's TA in many other situations, just not this one",
              "id": 35,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -13,
          "content": "I see your point but I feel that Rick is also an AH. He didn't care at all about what the kids were doing and couldn't even be civil enough to watch the kids for a minute or two. His assholery is the fact that he showed he doesn't give a f about his wifes family.",
          "id": 36,
          "comments": [
            {
              "score": 27,
              "content": "Rick is an older guy who was being honest that he couldn’t run after toddlers on the beach.  Nothing is more important than your own kids especially near water. What did your wife need from the car so bad that she couldn’t wait a few minutes.",
              "id": 37,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I agree somewhat with what you’re saying but this isn’t news to them.  Rick has shown he doesn’t give a shit and actively ignores them, so why would she leave her kids with him?  She asked and he answered, she chose to disregard his answer, knowing how he feels about their family.  This is on the mother trying to force Rick to babysit.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "He definitely sounds like an asshole *in general* but in this situation he was not in the wrong.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 168,
      "content": "NTA your wife left your kids unsupervised by water. Rick told her he would not watch them, if something happened she would be 100% responsible. She was beyond negligent and should feel horrible for putting her kids life in danger.",
      "id": 40,
      "comments": [
        {
          "score": 55,
          "content": "This. There might be a lot of messed up context, but in this particular situation, the wife is the only AH and she deserved to be yelled at for both putting their kids in danger and trying the shift the blame onto others. Let’s pretend Rick didn’t dislike OP, but still said no to watching the kids. What would she do then? Her entire defense is that Rick can’t say no to watching the kids and because he did, OP’s mom sucks for marrying him? What a massive sense of entitlement.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "This right here. The e s h comments don't make sense to me because it seems like OP only berated his wife after she yelled at literally every other adult there. Handling it privately became null after she started hollering at every other adult there.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 128,
      "content": "ESH.\n\nY'all don't like each other, so why do you keep hanging out with each other like you're buddies ?",
      "id": 43,
      "comments": [
        {
          "score": 14,
          "content": "That has no bearing. The issue is the wife left young children to be watch by someone that said they wouldn't watch them. If anything happened it be on the wife. Hell she then started to blame everyone else for what happen.",
          "id": 44,
          "comments": [
            {
              "score": 4,
              "content": "Everyone understands that. It’s humor. I laughed.",
              "id": 45,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 86,
      "content": "ESH. Your family sounds like a blast. The fact that none of you will do even minor favours for each other, and everything is just an excuse to yell at everyone else, sounds like a lot of fun. Rick actually sounds like the sanest one of the bunch, because he's simply decided not to engage with the rest of you - which based on this post is 100% the right call. I'm on Team Rick all the way.",
      "id": 46,
      "comments": [
        {
          "score": 71,
          "content": "Rick really just sounds like the toxic cherry on top of a pile of dysfunctional toxic ice cream.",
          "id": 47,
          "comments": [
            {
              "score": 35,
              "content": "Right. Rick is an asshole based off the simple fact he doesn’t feel the need to differentiate between Op’s children. I get not liking kids, but dude at least be arsed to know their names and see them as individuals if you plan on being with Op’s mom for a little bit.",
              "id": 48,
              "comments": [
                {
                  "score": -7,
                  "content": "I like my best friend, I like his kids, we hang out to play, but I'd lie if I didn't confuse his two boys from time to time because they look a lot alike.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 9,
                      "content": "There’s confusing your friends kids every now and then, but it sounds like Rick genuinely doesn’t know which one is which, and doesn’t care",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -3,
          "content": "This made me acc burst into laughter omg",
          "id": 51,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 60,
      "content": "ESH and god I feel bad for everyone on this crowded beach who had to listen to this",
      "id": 52,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 39,
      "content": "ESH What a debacle! But your wife should have NEVER left the children with someone who said they wouldn't watch the kids and then go on her merry way.",
      "id": 53,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 37,
      "content": "Esh\n\nyou are all a piece of work.",
      "id": 54,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 30,
      "content": "NTA\n\nYour wife was responsible for the kids and she tried to force those responsibilities on someone who had refused. What did she need so badly from the car that required her to leave her kids with someone who voiced that he wasn’t going to watch them?",
      "id": 55,
      "comments": [],
      "relation": "Support"
    }
  ]
}