{
  "post content": "My father passed away very recently. I won't go into too much detail but he and I had a rocky relationship when I was a child. He was prone to fits of anger due to alcoholism and was just a generally scary guy. We kinda reconciled as I grew into adulthood but by no means were we close when he died, I preferred for our relationship to be amicable yet distant. My parents divorced several years ago, dad never remarried, and I'm his only child, so the decision about what to do with his body rests with me. \n\nDad was sick for a while before he died and I repeatedly asked him what he wanted done after he passed away. He was in an accident as a teen where he was burned pretty badly, so he said he definitely wasn't comfortable with cremation and being burned again. However, he said he wasn't comfortable with being buried either and didn't like the idea of rotting away in a hole. Rejected a mausoleum for pretty much the same reason. I told him those were his only options and he needed to pick one. He always said \"I'll think about it,\" evading the subject forever and never gave me an answer. Now I have to decide what to do for his burial and none of the options available to me are things he would want.\n\nI've met with a funeral director and discussed the options, and a cremation is by far the cheapest way to go and that's what I'm thinking of doing at this stage. Dad had no insurance and was on the verge of filing for bankruptcy before his death, so I won't get anything in the way of inheritance. I'm going to be floating the bill here 100%. Due to his accident he very vehemently said he didn't want to be burned again, and I know I should be respectful of his wishes, but he never bothered to actually tell me what he wanted, just what he didn't want. And as far as being burned again, well, he's dead, he's gone, it won't hurt him since he can't feel anything. I've been mulling this over for several days and I just want to get his burial over and done with so I can move on with my life. I'm just struggling with how to respect his wishes when he never gave me any alternatives.\n\nSo, WIBTA for cremating my father?",
  "id": 1,
  "comments": [
    {
      "score": 27,
      "content": "NAH, since your dad never said what method he wanted by rejecting all options until his death, it'd be impossible to actually do what he wants. Might as well go with cremation.\n\n&#x200B;\n\nMaybe mix him with soil and put a plant in him, so he gets to be a part of something alive again? ",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "NTA.  If he had specific desires for how to deal with his body after his death he should have made pre-arrangements.  Have you considered donating his body?",
      "id": 3,
      "comments": [
        {
          "score": 5,
          "content": "If I could do that, I absolutely would, but unfortunately his body is not in a good enough state to be donated to medical research from what I've been told. I don't want to give too much detail or be too morbid but he passed away rather suddenly and violently so his body is not altogether intact.",
          "id": 4,
          "comments": [
            {
              "score": 6,
              "content": "I'm sorry you're having to deal with this.  By all means, have him cremated using the most inexpensive option available.  Usually, there are only two or three crematoriums in each town and all the smaller funeral homes contract with them.  You can often get a cheaper price for the same product by bypassing the funeral home. ",
              "id": 5,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "NTA\n\nOnce people are gone, they are gone.\n\nIf he had a preference and you ignored it YWBTA, he didn't so it really doesn't matter.\n\nAs a parent, I will also say, If i don't have the cash ready to pay for it, I expect my kids to spend as little as possible for it.\n\n\n\n ",
      "id": 6,
      "comments": [
        {
          "score": 1,
          "content": "NTA. Agree with this. OP specifically tried to address this and dad did not provide sufficient guidance for his child. Cremation is fine OP, don't beat yourself up about it. ",
          "id": 7,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NTA.\n\nI just want to say that there are more than 2 options (cremation or embalming/full package). There is NO law that says a body has to be embalmed or that you have to do basically any of the stuff funeral directors tell you to do (embalming, make up, expensive casket, viewing, etc.). They are a business and there to make money. You can absolutely have a natural, no fuss, low cost, literally pine box send-off if that's what you're most comfortable with emotionally and financially. Burials do NOT have to cost thousands.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA - like you said, he didn't give you an answer before he passed. The answer now falls on you to choose and cremation is the cheapest.\n\nSorry for your loss. :(",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***This is a copy of the above post. It is a record of the post as originally written, in case the post is deleted or edited.***\n\nMy father passed away very recently. I won't go into too much detail but he and I had a rocky relationship when I was a child. He was prone to fits of anger due to alcoholism and was just a generally scary guy. We kinda reconciled as I grew into adulthood but by no means were we close when he died, I preferred for our relationship to be amicable yet distant. My parents divorced several years ago, dad never remarried, and I'm his only child, so the decision about what to do with his body rests with me. \n\nDad was sick for a while before he died and I repeatedly asked him what he wanted done after he passed away. He was in an accident as a teen where he was burned pretty badly, so he said he definitely wasn't comfortable with cremation and being burned again. However, he said he wasn't comfortable with being buried either and didn't like the idea of rotting away in a hole. Rejected a mausoleum for pretty much the same reason. I told him those were his only options and he needed to pick one. He always said \"I'll think about it,\" evading the subject forever and never gave me an answer. Now I have to decide what to do for his burial and none of the options available to me are things he would want.\n\nI've met with a funeral director and discussed the options, and a cremation is by far the cheapest way to go and that's what I'm thinking of doing at this stage. Dad had no insurance and was on the verge of filing for bankruptcy before his death, so I won't get anything in the way of inheritance. I'm going to be floating the bill here 100%. Due to his accident he very vehemently said he didn't want to be burned again, and I know I should be respectful of his wishes, but he never bothered to actually tell me what he wanted, just what he didn't want. And as far as being burned again, well, he's dead, he's gone, it won't hurt him since he can't feel anything. I've been mulling this over for several days and I just want to get his burial over and done with so I can move on with my life. I'm just struggling with how to respect his wishes when he never gave me any alternatives.\n\nSo, WIBTA for cremating my father?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "# [Vote here for your favorite posts and comments of 2018!](https://redd.it/adh2vn)\n\n\nIf you want your comment to count toward judgement, put one of the following abbreviations at the beginning of your comment. Include ONLY ONE of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top comment.\n\n\nJudgement | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. You said it very clearly - your father never gave you a straight answer and he certainly cant give you an answer now. You can't burden yourself with his expectations because where will it get you? I think you should make the best decision for you right now. If cremation checks all the boxes, then go for it. If a burial sounds better, go for that instead.\n\nI am very, very sorry for your loss, regardless of how close you were. I hope everything resolves and you can find peace with it.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA.\n\n&#x200B;\n\nIf he had told you in a more explanatory manner, then you might have had the necessary insight to respect his wishes. That's one, another thing is, the guy simply avoided the entire discussion, like \"if you wanted me to decompose of you so you could become a tree or something, you should've told me\" that's the way i see it.\n\nI'm truly sad that you feel this guilt, but you have to know that you did the right thing, both by yourself economically, and ashes are easier to preserve, so you can do a lot with the ashes, scatter them into his favorite lake, or ocean or something, use them to fertilize his favorite plant.\n\n&#x200B;\n\nThe ashes don't have to be his end.\n\n&#x200B;\n\nBest of luck, and take care of yourself buddy <3 ",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA  He's not really here to make the decision, so you need to decide what's best for you.  ",
      "id": 14,
      "comments": [],
      "relation": "Support"
    }
  ]
}