{
  "post content": "I worked for a wealthy family. They had two children and they’d pay me 25$/h +gas +food while there. During the summer we did not have set times I’d work. All I had to do was work off 20h per week. Sometimes that was a single day, sometimes it was every day of the week for 3h.\n\nOne Friday, the dad told me Monday they would most likely need me at around 1p.m but he was unsure and had to double-check with his wife and would text me. Monday rolls around and I forgot he had told me I needed to receive a text. When they did not call or text I always showed up at 5p.m according to set schedule. At 12:55 the dad calls me asking if I am going to be late.\n\nMe:Oh, but I thought I should come at 5 since I never got a confirmation.\n\nHim:No I need you right now.\n\nMe:I need 25minutes and I’d be there, I am so sorry for the misunderstanding.\n\nHim: This is not a misunderstanding, these are my children.\n\nMe:I’m sorry I must’ve understood wrong what we spoke about on Friday. Do you want me to come now at 1:30?\n\nHim:No(hangs up)\n\nI texted him offering to come at 5p.m and his reply was ‘no, you’d be useless’.\n\nHe calls me again at 5:10p.m.\n\nHim:Where are you? Are you actually not gonna show up twice in a day?\n\nMe:Huh, what? But you said you do not need me today?\n\nHim:Show some proactiveness! Try to show us you actually care for our children!\n\nMe:Sir, I cannot randomly show up at your house unless you’ve asked me to. I don’t think I am in the wrong here. That’s unfair.\n\nHim:I’ll tell you what’s unfair the crap service we are receiving from you and the crazy money I am willing to pay you! You shouldn’t be allowed to take care of plants let alone children. Grow up because with this attitude you’d be lucky to graduate college, darling. I can call you out on the ‘bitch’ you are and you should smile and nod.\n\nMe: Okay I quit. Consider this my two week notice. I won’t be dragged down like this for any amount of money.\n\nNext day I am supposed to 2p.m and there is a new replacement I need to train. At 1p.m I get a long letter delivered where I am being fired and my pay for the next two weeks would be 5$ due to child endangerment. I text them, since I am fired I do not need to work off those two weeks and would not be coming in.\n\nI turned off my phone and when I finally picked up the dad exploded and called me an a-hole, telling me that because of me they had to cancel a very important business trip to take care of their children (which both had a severe breakdown when they found out I was leaving and a new girl was coming in. It was worse for the older one (6y) who was severely attached to me. He fell down the stairs in his panic and broke a hand and busted his face open).\n\nThis was a few months ago but I am still feel partially guilty. So Reddit AITA for leaving them like that?",
  "id": 1,
  "comments": [
    {
      "score": 18886,
      "content": "NTA. \n\nYou never endangered any children. They fired you and then expected you to what? Still work for them? That's not how employment works.",
      "id": 2,
      "comments": [
        {
          "score": 5707,
          "content": "Still work for them for $5 per hour (or possibly $5 total?)! Hahahahaha.",
          "id": 3,
          "comments": [
            {
              "score": 4316,
              "content": "And they also Wanted someone who they claimed endangered children to still be watching their child\n\n\nOp you are NTA. I know it’s sad that the kids are going to have to deal with the fall out of this but The parents would be continuing to treat you like this if you didn’t stand up for yourself",
              "id": 4,
              "comments": [
                {
                  "score": 989,
                  "content": "Agreed 💯 Those kids were lucky to have OP while it lasted.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1864,
                      "content": "I hate to ask this, but are we sure that the kid whose dad seems to have rage issues actually “fell”?",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 62,
                      "content": "Chim Chimney...",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 169,
                  "content": "This. Look the dad in the eye and calmly ask how he could have his children cared for by someone who was a danger to them.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 272,
                      "content": "Don't put yourself in the presence of those people. They are clearly aggressive and hostile.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 157,
                  "content": "You endangered my children! Now please come watch them and train your replacement.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 41,
                      "content": "He would never say please, come on. XD",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 37,
                  "content": "Yeah they basically said we are ok with you “endangering” our kids but then the pay is only $5.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 878,
              "content": ">I can call you out on the ‘bitch’ you are and you should smile and nod.\n\nI wouldn't even have given them two weeks notice after that. He messed up the communication, was verbally abusive to op and she was still good enough to give them two weeks notice and they try to only pay her $5 an hour? Wtf is wrong with these people?",
              "id": 13,
              "comments": [
                {
                  "score": 543,
                  "content": "I really, *really* hope OP develops higher standards for herself as she gets older, for her friends, romantic partners, and certainly employers. None of those people get to call you a bitch.\n\nOP did give her notice when he called her that, but for purely practical reasons it's grounds to immediately be full-stop done with this family altogether. She needs to consider that people this mean and irrational aren't just degrading to be around — they're *dangerous*. \n\nAnd for that reason, she should really share this account on any and every local forum for babysitters/caregivers she can. Because people who are cruel, batshit insane, rich enough for frivolous lawsuits, and determined to blame their babysitter for their own negligent parenting could *really* fuck up a babysitter's life — if not hers, than whatever poor schmuck they hire next.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 215,
                      "content": "And don’t delete those texts, OP! In case that man is crazy enough to sue",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 85,
                      "content": "I hope so too. It’s a common mindset to have, especially when you’re young, to still want to be a “good employee” even when you’re treated like trash, and it can take a long time to shake that. Her refusal to come in for $5 is a good sign though, and I hope after this incident and this thread she is empowered to demand decent treatment from employers (and personal relationships) in the future.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I think the OP was thinking about the kids who were super attached and would have liked to properly transitioned them to the new person. A lot of people who go into child care can't help but grow attached to their charges and even when they have to end a professional relationship due to AH parents still want to do right by the kids.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Honestly, she should also call CPS",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 130,
                  "content": "Typical rich people who think having money makes them better than everyone else.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "Sounds like the Dad thinks he owns her",
                  "id": 20,
                  "comments": [
                    {
                      "score": 25,
                      "content": "And he's modeling that behavior for his kids. Imagine how they are going to treat anybody that works for them now or when they're adults",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I would have asked him how the hell he expects me to work for him after that.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 2,
                      "content": "We all live and learn. At that stage, op probably needed/wanted a reference. No matter how fair we think the world should work, it doesn't always work that way. It doesn't look good for op if she is looking for a new job and her previous employers won't give her a reference or even worse, they say that she endangered the children.\n\nEven though we know that her previous employers were full of shit, how do prospective employers know that? If you were interviewing someone to look after your children, would you even entertain someone who left on bad terms? It's not fair but you would probably be more inclined to hire the nanny/babysitter who has good references, rather than the one who has employers who say she endangered the children. \n\nThis is why employers have so much power and nannies put up with so much shit so as not to get a bad reputation.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 177,
              "content": "That has some \"It's one banana, Michael. What could it cost, $10?\" vibes.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 54,
              "content": "$5 an hour I wouldn't lift a finger for $5 an hour. Fuck off.",
              "id": 25,
              "comments": [
                {
                  "score": 108,
                  "content": "I'd lift a finger all right...",
                  "id": 26,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Nice",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Brits would lift 2.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": ">Still work for them for $5 per hou\n\ni'd have gone to work and then taken them to court for both emotional and financial damages.",
              "id": 29,
              "comments": [
                {
                  "score": 4,
                  "content": "OMG. Stop. People don't need to go to court over every damn thing. The whole 'I'm gonna sue them!' attitude is why this world fucking sucks. \n\nEmotional damages? Give me a fucking break.\n\nBut also please don't sue me for this comment, which I imagine you will.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 41,
                      "content": "i thought it was pretty obv hyperbole\n\npaying below minimum wage is also literally illegal and you can take them to court for backpay",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Lol when my kids were little that was their go-to advice for everything. Newspaper delivered late? Sue. Carpool mom was late? Sue. I have no idea where they got it from, I never threatened to sue anyone in my life",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 426,
          "content": "[removed]",
          "id": 33,
          "comments": [
            {
              "score": 86,
              "content": "Exactly. He should have said \"oh wow that's all on me. Please, 1:30 is fine, and expect a bonus for the trouble- again, my deepest apologies \".",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "The above comment was stolen from [this one](http://np.reddit.com/r/AmItheAsshole/comments/rmv4og/aita_for_quitting_on_the_spot_as_a_babysitter/hpomc9m/) elsewhere in this comment section.\n\nIt is probably not a coincidence; here is some more evidence against this user:\n\nPlagiarized | Original\n-------- | -----------\n[Does your aunt scream at...](http://np.reddit.com/r/AmItheAsshole/comments/rmslzo/aita_for_telling_my_aunt_to_keep_her_bitchy/hpoo92j/) | [Does your aunt scream at...](http://np.reddit.com/r/AmItheAsshole/comments/rmslzo/aita_for_telling_my_aunt_to_keep_her_bitchy/hpof1xh/)\n[NTA.  That’s your recipe...](http://np.reddit.com/r/AmItheAsshole/comments/rmv7dr/aita_for_not_wanting_to_give_my_exmanager_my/hpoocfu/) | [NTA.    That’s your recip...](http://np.reddit.com/r/AmItheAsshole/comments/rmv7dr/aita_for_not_wanting_to_give_my_exmanager_my/hpoj87w/)\n[NTA I imagine he'll get m...](http://np.reddit.com/r/AmItheAsshole/comments/rmug8t/aita_for_not_always_stocking_the_fridge_how_my_bf/hpooano/) | [NTA I imagine he'll get m...](http://np.reddit.com/r/AmItheAsshole/comments/rmug8t/aita_for_not_always_stocking_the_fridge_how_my_bf/hpokkpo/)\n\nbeep boop, I'm a bot -|:] It is this bot's opinion that  [/u/jfinkevcxvsdfhg](https://np.reddit.com/u/jfinkevcxvsdfhg/) should be banned for karma manipulation. Don't feel bad, they are probably a bot too.\n\nConfused? Read the [FAQ](https://www.reddit.com/user/reply-guy-bot/comments/n9fpva/faq/?plagiarist=jfinkevcxvsdfhg) for info on how I work and why I exist.",
              "id": 35,
              "comments": [
                {
                  "score": 3,
                  "content": "Good bot",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "U/jfinkevcxvsdfhg is a bot",
              "id": 37,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 284,
          "content": "This can’t be a sudden case of abusive behavior, was the father always like this? What does the wife think of the situation. He literally went 0 to 200 over nothing.",
          "id": 38,
          "comments": [
            {
              "score": 128,
              "content": "He sounds like he has some untreated addiction issues. The forgetting to do basic things like texting,  his warped view of reality ( \"why aren't you here?\" After saying don't come at 5), and the intense rage are not normal, rational behaviour.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "This caught my attention, too. It wouldn't change my judgment (NTA), and I still think she did everything right given the situation, but I do wonder if she usually dealt with the father or the mother, and if this was typical behavior. I'd like to imagine that this is wildly out of character, but we all know that's not necessarily true.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "Also was the kids injury really an accident or did the dad do it?\n\nBecause he seems really agressive",
              "id": 41,
              "comments": [
                {
                  "score": 4,
                  "content": "That was my thought. Sounds like an anonymous call to CPS might be in order.",
                  "id": 42,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Yeah I agree. The father’s communication was borderline insane. It made me almost doubt the story.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 131,
          "content": "[removed]",
          "id": 44,
          "comments": [
            {
              "score": 4,
              "content": "u/calinvxcvfdsh is a bot",
              "id": 45,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 111,
          "content": "this could also be in r/antiwork and r/entitledparents. wow. they fired OP and still expect her to work?\n\nNTA\n\nthey’re the architects of their own mess",
          "id": 46,
          "comments": [
            {
              "score": 2,
              "content": "Came here to say r/antiwork too",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "Plus the dad threatened you and insulted you. He can go jump in the lake…..",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "He’s neurotic enough to think that telling someone to not come and then berating them for not coming, makes him right. It doesn’t surprise me that he’s delusional enough to think OP would still work for them after firing her. \n\nWho the hell “tests” an employee by telling them to not come and then gets angry when they don’t come?! Now let’s add the fact that he is treating the person *responsible for your children* like a dog! OP was probably the only sane adult in the kids’ lives. I feel sorry for them",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "> They fired you and then expected you to what? Still work for them?\n\nThis is what's unreal. \n\nThem: You're fired\n\nHer: Mkay\n\n*Later*\n\nThem: WHERE ARE YOU\n\nHer: [tf](https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/34dd5cd9-9591-471f-9b45-e6501ca1aebf/d8p19a4-8b9b6558-6432-4897-95e6-f34272fde990.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7InBhdGgiOiJcL2ZcLzM0ZGQ1Y2Q5LTk1OTEtNDcxZi05YjQ1LWU2NTAxY2ExYWViZlwvZDhwMTlhNC04YjliNjU1OC02NDMyLTQ4OTctOTVlNi1mMzQyNzJmZGU5OTAuanBnIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmZpbGUuZG93bmxvYWQiXX0.70Yha-HYc3BFfiGwr9KUKSW3bOVRf4txm--55hY9Sv8)",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "He also expected to be able to verbally abuse OP and have them jsut take it while they \"smile and nod\" like give me a fukcing break",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": ">They fired you and then expected you to what? Still work for them?\n\nAnd this was after op *already quit* 🤦🏻‍♀️. The entitlement of some people, smh",
          "id": 52,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6722,
      "content": "NTA. He turned a simple miscommunication, which was likely him forgetting to send the text, into a reason for abuse and manipulation. You were willing to rush right over, but he turned that down, and he changed the requests repeatedly without telling you.\n\nYou were probably right to leave. The child's injury is not your fault. Nor is them missing the business trip. You were absent due to their behavior and they ended up facing the consequences of their actions.",
      "id": 53,
      "comments": [
        {
          "score": 2148,
          "content": "A child hurt themselves under the care and supervision of their own parents/main caregivers and a person who was not present and not meant to be present is at fault. Hm that's a weird logic.\n\nAlso he could be lying to guilt OP. Regardless, not OPs problem. You quit the parents not the kids and that is a-okay when it comes to nannying/babysitting.",
          "id": 54,
          "comments": [
            {
              "score": 701,
              "content": "From the description they sound like high-powered business types, which is sufficient explanation for why they took an outstanding employee (why else would they go through such length to make her stay, and want her to train a replacement?) and decided to abuse her anyway over their own mistake, to save face in a situation where everyone involved already knows what really happened. I don’t know how you can do that without being embarrassed, but I’m not a narcissist. Then, they’re shocked and aggrieved that their *former* employee is being insubordinate *after being dismissed*, and for a cherry on top have spun a tale of how they’re such incompetent parents that without this employee, their kids will just stumble to their deaths. That’s orders of magnitude more humiliating to admit than the original mistake of “I forgot to send one text one time.”\n\nThey took a small mistake they made and in their attempt to “fix” it they created something that’s an utter calamity by comparison, cost themselves a valuable employee, and loudly broadcast that they are complete bumbling fools who don’t know their ass from their elbow in the simplest of daily life tasks. No wonder they climbed so high up the corporate ladder—they are perfect executives.",
              "id": 55,
              "comments": [
                {
                  "score": 288,
                  "content": "I would adjust this to say high-powered business types who only got the job through daddys connections.\n\nPeople who work their own way up are generally very appreciative of competence.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 36,
                      "content": "they also have learned the importance of PYA and will overdo it though.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 76,
                  "content": "There are a lot of high-powered business types and executives who recognize how dependent they and their families are on nannies, housekeepers, etc., and treat them well. That is kind of what the $25/hour should be about - paying a generous wage to employees who make your career possible. \n\nCareer focused does not have to mean abusive or unappreciative. This guy was special.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Great summary. It sounds even more ridiculous with your first paragraph. \n\nI can’t help but be curious if the father has always behaved similarly to OP, in terms of crossing the line with this sort of manipulative blackmailing in the history of working for them.",
              "id": 59,
              "comments": [
                {
                  "score": 2,
                  "content": "Don't forget sexist micro-aggressions. \"Darling\".",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "As a teacher, I once had a parent email the whole school district accusing me of \"gross negligence\" because her daughter wasn't allowed on a field trip. The reason the child couldn't go on the trip was that she didn't turn in any assignments, and the she was given a warning 4 week ahead and another 2 weeks ahead of time, and the opportunity to turn in ALL the missing assignments for full credit.\n\nParents will do some crazy things to avoid accountability.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 258,
          "content": "OP, did you see doctor or hospital bills? Given the source, that's a story too wild to believe without proof.\n\nNTA He preferred abusing you to admitting he forgot to send a text. Nothing would have justified continuing to work for someone that unhinged.",
          "id": 62,
          "comments": [
            {
              "score": 89,
              "content": "I can guarantee the child didn't so much as stub his pinkie toe. That's a sob story reeking of manipulation by trying to blame the children's wellbeing on her. I hope op doesn't waste a single moment worrying about this kid beyond the sympathy he deserves for having a manipulative dad.",
              "id": 63,
              "comments": [
                {
                  "score": 28,
                  "content": "Or let's take it at face value. The child was soo upset that they threw themselves down stairs. That's a child that needs professional help that might be being ignored by the parents because \"the babysitter is good with them\".",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 142,
          "content": "Minor but important correction: he didn’t repeatedly change the request, because a request by definition is communicated to the other party. He changed his *expectations*, and did so *without* changing his request. Everything else you said is bang on.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2519,
      "content": "If you don't know you're NTA, that's pretty worrying.\n\nHe dropped the ball, you were proactive in offering to get going right now, he threw a tantrum, insulted you and told you not to come in, so you didn't.\n\nyou're entirely in the right and after you quit / were fired (how petty to fire someone who already quit) and got your pay reduced (that can't be legal), he blames you? lol nope. This is his fault entirely. He's an adult and a father, so it's on him to actually parent. His business trip isn't your problem either and his kid's injury is tragic, but not your fault.",
      "id": 66,
      "comments": [
        {
          "score": 1157,
          "content": "Contract stated that I need to hand in a one or two month resignation. I could hand in a shorter one but that could affect my pay (decision of parents). Nothing specific as to how much.",
          "id": 67,
          "comments": [
            {
              "score": 1688,
              "content": "There is not a single tribunal in the civilized world that would side with the father after the abuse you went through.",
              "id": 68,
              "comments": [
                {
                  "score": 766,
                  "content": "Some of my colleagues said I should have sucked it up because of great pay and benefits. I loved the children dearly and dad was a-hole but I feel so guilty for how upset the little guy was. I should have gone to say goodbye to him..",
                  "id": 69,
                  "comments": [
                    {
                      "score": 1285,
                      "content": "Oh god, never \"suck it up\" for good pay. You deserve better than that. The little guy feelings are not your responsibilities. I know you loved him, but the dad is the only bad person here, and you are a victim just as much as him. \n\n(Also, kids are resilient. He'll get over it, don't worry :) )",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 357,
                      "content": "Sucking up for great pay is more like you suck up working at a tech company that treats you bad and works you hard but pays you 500k+ a year. 25/hour is not great pay to have to suck up for.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 259,
                      "content": "I have \"sucked it up\" for good pay. Was saving up for a down payment for a house, it was a really good pay.\n\nEnded up with a mental breakdown and unable to work for a year. All my good pay savings went to support me. \n\nYour health and self respect are worth more than any good pay. Seriously.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 79,
                      "content": "Even if you went to say goodbye, there is little you could have done to help him considering how his father was acting. The kid would have still been pretty affected because he lost someone important and the father would have still badmouthed you at home (because let's be real, he didn't tell the kids you were leaving becase he, as the father, was a disgraceful asshole) and the kid would have still been really confused because you told him one thing and his father another\n\nI'm sorry it went this way, I'm sure you loved those children a lot and this must have been hard. But never doubt yourself when leaving situations like this, you never know when someone can escalate and the father was already being quite aggressive. I don't think he would have gotten physical, but it would have been a nerve wrecking ordeal",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 61,
                      "content": "I would make sure his wife knew your side of things because I guarantee he blamed everything on you.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 51,
                      "content": "Im not a kid person but based on what I've heard around work, 25/hr does not seem like good babysitting pay, especially from someone who can afford it.",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 42,
                      "content": "Sucked what up? He gave you conflicting instructions and abused you for following them. He then projected his own abusive behavior to you, accusing you of something you were innocent of. I wouldn't doubt if he pushed the child down the stairs. You couldn't possibly stay involved with that family.\n\nNTA",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "They're free to do that - but I would never. You pay with your mental health for the pay and benefits, and that's not worth it. Don't sell yourself short!\n\nHe told you not to come - there is nothing you can do. The fact that you worry about his child and he doesn't tells us a lot about his character, and about yours. I totally understand that you'd like to say goodbye, so how about a letter? You said the child was 6, he should be able to understand that his dad calls the shots and you're sorry you had to leave so suddenly without saying goodbye in person.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "You don’t have to suck anything up or deal with his treatment of you. Also, they wanted you to train someone else and work for $5/hr yet you were also fired? It’s best to remove yourself from the situation- stay away from their home and their kids, so that he can’t fabricate more claims against you. They’re the parents. That’s on them if they can’t handle your kids. In your absence, you’re not responsible for the kids falling or melt downs.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "It's ok and normal to feel sad for the kids and that you didn't get to say goodbye. But, that also wasn't your fault, that was their dad's fault. He created this situation for himself, and his kids - and You! It is sad that you didn't get to say goodbye and it is sad that someone this poor kid cared about very much and probably felt safe with (in that household, that could be a big deal) disappeared suddenly from his life - but all of those things were caused by the father, not you.",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Plus it’s almost certain the dad’s behavior and failure to communicate violated the contract giving her free reign to choose not to uphold said contract.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 170,
              "content": "...that contract can't be legal - in my country, anything in a contract that violates the law is considered void. Still, it'll be hard to enforce that.\n\nBut since he fired you effective immediately, you're in the clear morally, if not legally. He also gave you written instructions not to show up, so he can't really do anything.",
              "id": 81,
              "comments": [
                {
                  "score": 88,
                  "content": "I don’t know, my sister is a lawyer and she said there was a loophole that could be considered legal and reduce my pay (in her opinion definitely not to 5$). She said I would have to take them to court for this.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 43,
                      "content": "Are you in the US? If so, an employer can reduce pay rate going forward as long as it is communicated to the employee. However, an employer cannot reduce pay retroactively for hours already worked.",
                      "id": 83,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 26,
                      "content": "Make sure you keep the texts from the Dad in case he tries to pull any legal sh!t on you.\n\nYou are DEFINITELY NTA.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I think that the contract is VOID. He called you a b\\*\\*\\*\\* and talked very down to you, kept saying that you were to show up when you were not supposed to. After he said that you put his kids in danger and you did not;  I think it VOIDED your contract. He said that & it was not true. You have a legal right to keep yourself out of harm for further issues that he may make up. When he asked you to watch them again after he said that you put them in harm it shows that it was untrue. No one would have some one watch their kids again after he said that. You owe him nothing... If needed: Have your sister write up something up that he VOIDED the contract after the note that he sent you. State what he said about you was not true and you are voiding the contract to cover yourself,  state it shows that you caused no harm because not one would have their child watched by someone after that shows it.  State that to cover false claims in the future. you will not babysit. Also, called you a b\\*\\*\\*\\* . Do not contact them again or watch the child again. No matter how much the pay is I think that he may say untrue things about you again. Because of this do not see them in person or babysit again.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "You can always quit on the spot. They are legally required to pay your normal rate for the hours you’ve worked. They cannot withhold your pay.",
              "id": 86,
              "comments": [
                {
                  "score": 17,
                  "content": "Might not be the u.s.. other countries have restrictions on quitting and firing",
                  "id": 87,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "Here is the fact. They can fire you on a whim with no notice. You can quit the same way..",
              "id": 88,
              "comments": [
                {
                  "score": 80,
                  "content": "In the country I reside you can have ‘repercussions’ for quitting on the spot. Part of a contract you sign going into the job. It’s legal and it’s there to protect the employer. My sister said it could be argued that my short-term notice can affect my pay, but it could also be argued I need to be reasonably paid, way closer to original agreement. She said this is either set by middle men (contracting firm) or a court. Neither was appealing to me.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 63,
                      "content": "They informed you that they were not going to pay your agreed to wages for the 2 week notice period.  In every country that is considered termination.  You were within your legal rights to not go back.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Your only other alternative would have been to harass these people after they told you not to come. You’d have to violate their disinvitation to “show initiative,” and they’d have every right to think you were a psycho for showing up to a house you were told not to visit. I have no idea about the quitting/getting fired laws, but any reasonable person reading these texts would see the clear message that you should not come.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "What country is this, if you don’t mind telling us?",
                      "id": 92,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "I dunno what part of the world you live in, but that doesn't sound legally enforceable to me. (IANAL though)",
              "id": 93,
              "comments": [
                {
                  "score": 80,
                  "content": "Contract is over sixty pages long. I was naive to never question what was in there and take everything on good faith. Lesson learned on that one. It was completely my fault.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 154,
                      "content": "60 page contract for a babysitter?? There's no way that's a legally binding document.\n\nThese people sound fucking nuts. For a contract to be legal it can't be overtly one sided / exploitive, which slashing your pay to 20% most certainly is.",
                      "id": 95,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 76,
                      "content": "A 60-plus page contract for babysitting sounds completely insane.",
                      "id": 96,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 65,
                      "content": ">Contract is over sixty pages long.\n\nWTF?? \n\nWhat kind of employment contract for a nanny is sixty pages long?? I've worked for 16 years, including some large billion-dollar corporations, and have never had a 60-page employment contract.\n\nIs this normal where you are?",
                      "id": 97,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "Just because it's written in a contract that doesn't mean it's actually legally enforceable. That depends on the laws where you live",
                      "id": 98,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "60 page long contract?  Is he a lawyer?",
                      "id": 99,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Wait what? What sort of insanity is this?",
                      "id": 100,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": ">PYA\n\nThis sounds like Sheldon's Cooper's rental agreement with Leonard Hofstadter.",
                      "id": 101,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "60 page contract!!!???? for a nannying job?!??\nthats the biggest red flag on earth.",
                      "id": 102,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Lol what? This man is actually nuts.",
              "id": 103,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Not sure where you live but I don’t see this contract possibly being enforceable.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "It's not legal to reduce your pay to below minimum wage, no matter what. So there is that.\n\nAnd no one can force you to work.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Where do you live?",
              "id": 106,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "They fired you, none of that matters in that case.",
              "id": 107,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "I don't think that it's worrying that she's unsure whether she's the NTA. It seems like she might be fairly young, and with an AH like the father reaming her and trying to make it seem like it's her fault, I can understand a bit of uncertainty on her part. So she comes here to get a sanity check.",
          "id": 108,
          "comments": [
            {
              "score": 0,
              "content": "i agree 100%! I'm only worried because she was thinking the right thing for her mental health, then doubted herself in such extreme circumstances.\n\nPerhaps i'm worried because i understand that uncertainty as well, and know that it can (in the worst case) lead to returning into an abusive situation if you don't get the right second opinion. It's great that she got a sanity check though, and I hope her gut-feeling keeps protecting her :)",
              "id": 109,
              "comments": [
                {
                  "score": 1,
                  "content": "I agree. It sounds like that when push came to shove, she wasn't hesitant about saying \"I quit,\" which is a very good sign that she knows what she should and shouldn't take, and knows where to draw the line.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 0,
                      "content": "absolutely!",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1178,
      "content": "NTA\n\nThese parents sound insane. First off, it isn’t like $25/hour for two kids is such a high rate. Second, dad tried to treat you like a slave and wasn’t able to communicate effectively on your hours. Third, you did nothing to endanger the kids. Fourth, the kid getting injured was 100% NOT your fault.",
      "id": 112,
      "comments": [
        {
          "score": 252,
          "content": "This! Obviously this highly depends on the region, but in my opinion, $25 for two kids isn't too out of the ordinary for an adult person taking care of the kids (I'd say it's different than a 14 y/o babysitting after school).",
          "id": 113,
          "comments": [
            {
              "score": 109,
              "content": "We are far from wealthy and that's exactly what we would expect to pay if we ever had to hire a nanny.  Not \"a crazy amount\".  It is a big expense, but that's what good childcare is worth, at the minimum.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "Thank you! I was honestly rolling my eyes at him calling that a “high” rate. I’ve charged $20/hr for a single kid. Granted he was a foster kid with FAS so there was government involvement in my employment and he could be physically dangerous to himself, but still",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Agreed. This guy was abusive towards OP, and his poor communication is on no one but himself.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 419,
      "content": "NTA - 5$ pay because of child “endangerment”?!?! What on earth?",
      "id": 117,
      "comments": [
        {
          "score": 338,
          "content": "Not enough characters to explain the whole letter. Child endangerment because often times I’d get kids from the bus with the parents not home. If I didn’t show up, older kid was left to wait at the door. They were in a gated community with security on entrances and bus drivers never bothered to check if an adult was picking up the kid. It happened once when the bus was 10minutes early.",
          "id": 118,
          "comments": [
            {
              "score": 215,
              "content": "Still not TA, the parents/father is/are. I know you probably miss the kids but don’t trouble yourself anymore. Nothing of what has transpired is your fault.",
              "id": 119,
              "comments": [
                {
                  "score": 109,
                  "content": "If I thought my babysitter was endangering my child I would fire them, not pay them less. \n\nThis guys just an AH. Move on. Sounds like they may be a danger to the children. Call CPS",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "I don't understand this reply. Are you saying there were multiple occasions where the kids were left alone at the bus stop either no one there to pick them up? Were you *supposed* to be on the clock and there to pick them up when this happened?",
              "id": 121,
              "comments": [
                {
                  "score": 85,
                  "content": "Yes, dad leaves at 5p.m and I need to be there 5p.m sharp. Bus comes anywhere between 4:45-5:10. Dad called me to hurry up that day because he meeded to leave early but there was traffic and I could not come in early. Shared fault. We cleared that up when it happened.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 249,
                      "content": "> Shared fault.\n\nNo, if there was traffic that meant that you couldn't be there early, that's on him because he didn't let you know soon enough to avoid the traffic.\n\nThis guy is a total asshole and has treated you terribly.  You don't need to make excuses for him.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 167,
                      "content": "> Dad called me to hurry up that day because he meeded to leave early but there was traffic and I could not come in early. Shared fault. \n\nThat isn't shared fault, that is you not being able to come in early.  The fact that you think it is shared fault has me even more worried, it might be worth going into therapy to work on drawing lines with people if you are going to stay in your current business.",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 116,
                      "content": ">Shared fault.\n\nNo, not shared fault. Their fault.\n\nYou sound like you're a nice person, but, if I may be harsh for a second, be careful not to let yourself be a pushover. I've seen several of your comments in this thread, including even the OP, where you seem to be taking on guilt or accepting blame when you don't need to.\n\nPlease stop that. I'm telling you this for your own good. The first step in having others respect you is respecting yourself. None of this is your fault, don't let that bully of a father make you believe otherwise.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 108,
                      "content": "Still, if your responsibility is to get there at 5, and you got there at 5, you did nothing wrong. If they want you there at 4:45 to be ready in case the bus is early, they need to tell you that, and they need to tell you with reasonable time for you to get there.\n\nThis is not a shared fault, this is on the parents. You are blaming yourself too much!",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 63,
                      "content": ". -- mass edited with redact.dev",
                      "id": 127,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 36,
                      "content": "That isn't shared fault. You were not able to come to work early. It is unreasonable for an employer to call you in early on the same day as a shift and then be upset that you couldn't make it.\n\nHonestly OP it sounds like this guy made a habit of being unreasonable to the point where his behavior started feeling normal. It isn't.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "Stop making excuses for this absurd and abusive maniac.\n\nYOU ARE NOT TO BLAME.\n\nPlease. Internalise this. NTA.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yeah you can't control traffic.  If he didn't give you advance notice to be there at 4:30 (like, that day at 2 or earlier) but instead called you while you were driving to ask you to speed since he wanted to leave?  HE is the one who chose to leave the child alone.  This is not shared fault.\n\nAlso: where is mom?",
                      "id": 130,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "If the dad wanted you there early that day, telling you to hurry when you’re already stuck in traffic really isn’t going to do any good. He should’ve given you 24 hours notice so you would have adequate time to leave early considering traffic. He definitely shouldn’t have left knowing the kids would be by themselves. \n\nIt is not your fault and I hope that all the internet strangers will be able to convince you that it wasn’t.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "This is **NOT** your fault!!! Dad should have called you earlier to come in if needed. ***ALSO PUT this information in a letter if needed that the DAD was at fault.*** The dad should not have left until you arrived or should have called someone in the complex to meet the kids until you arrived.  The complex could have had a guard or groundskeeper wait at the bus stop if it was so important. He was the one that was at fault and tried to blame it on you to safe face... Be strong and stick up for yourself. Do not let them blame you for things that they did.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Make sure to document this and back up all your texts. The father sounds unhinged",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 263,
      "content": "NTA but that father sure is. Still laughing at him thinking that you’d be okay with 1/5th of the pay during 2 weeks, especially after he instilled you multiple times.",
      "id": 134,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 233,
      "content": "NTA. I nannied for very wealthy families right out of college and none of them treated me like that. It’s always the kids that suffer though when parents turn out to AH. Are you sure the kid was even injured? His father could just be making it up to rub it in your face.",
      "id": 135,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 223,
      "content": "NTA. The father needs to learn that just because he pays people doesn’t mean he can be abusive.",
      "id": 136,
      "comments": [
        {
          "score": 97,
          "content": "Plus, he's this shitty to her as the kids caretaker. Perhaps this is a crazy leap, but is it possible the kid didn't hurt itself in its own confusion? Lots of abused people hurt themselves \"falling down stairs,\" and I almost wonder if it's worth giving CPS a call after that half-baked excuse for the child's wrist and facial injuries. Especially if she has seen any other warning signs now that her former employer's real personality is emerging.",
          "id": 137,
          "comments": [
            {
              "score": 23,
              "content": "I was thinking that too, but it's a little too speculative. I think calling CPS on a hunch would be unreasonable. We don't really have any evidence, other than getting bad vibes from this dude.",
              "id": 138,
              "comments": [
                {
                  "score": 13,
                  "content": "I think it’s okay for us to bring up though, because there could be something OP either didn’t mention, or forgot about. There may even be a string of events that, by themselves, seem fine, but when looking at the bigger picture shows a pattern of abuse. Like, based on this story alone, I think calling CPS would be uncalled for. But OP should definitely take some time to reflect on their time there and just see if anything comes up or just didn’t sit right.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I think it’s more likely the dad lied to OP about the kid being hurt to make them feel guilty.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 99,
      "content": "I bet the kids freaked out so bad that they hurt themselves is also partly the dads fault.\n\nHe probably didn't calm them down but screamed around at home about you and created panic.",
      "id": 141,
      "comments": [
        {
          "score": 50,
          "content": "I won’t go as far as to blame him. Both kids are not English speakers originally and struggled a lot in kindergarten and school. They were always very panicky and it took them two months before they even spoke to me something else beside yes and no. \n\nI feel so guilty because I should have bit the bullet and went to say bye to the kids. It was the right thing to do because they never did anything wrong.",
          "id": 142,
          "comments": [
            {
              "score": 53,
              "content": "\"They were always very panicky\"\n\nUhh. This might be wrong, but as a person who suffered abuse from parental figures... Maybe they were panicky and not trusting because of a troubling home life. I was very skittish and quiet as a child because of that. I might be reaching though, but I'm assuming \"panicky\" means more than just normal shyness.\n\nTheir father has already shown himself to shift blame and manipulate to absolve himself of fault. I wouldn't be surprised if he's the one who caused his child's injuries (if the child is actually injured, and he's not lying about that too) and is using that ages-old excuse that they \"fell down the stairs because THEY were hysterical.\" Seems like a threat to me. D: Given this man's explosive reaction and willingness to abuse you over his own mistakes, I'm a little concerned about those kids...\n\nI could be reaching though",
              "id": 143,
              "comments": [
                {
                  "score": 18,
                  "content": "Not reaching, this was my first thought. This is how the father behaves when *he's* in the wrong. Imagine a little kid having to live around a temper like that, constantly walking on eggshells. I grew up with a similar parent.\n\nI wonder, where is their mother in all of this.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "That was my exact thought. No, you're not reaching.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Yes that's unfortunate. I worked as a Nanny too and know the feeling to let the kids down when you have to change jobs .\n\nMaybe write them a really nice goodbye letter.\nIf the parents love their children they will hopefully swallow their anger and pride and read it to them.\n\nOn a sidenote i am really angry about that gaslighting bullshit from the dad. He sais don't come, then is angry that you don't show up anyways with a guilty conscience.\nAll because he is not able to communicate straight.\n\nGood for you that you stood your ground!",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "So the children of a man that flies off the handle, is unhinged, and prone to rage tantrums are panicky? I was panicky and all sorts of situations as a kid. It was literally because my dad was like that. They are that way because he is an abusive person.",
              "id": 147,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Its very sad for the kiddos who loved you, but the dad made it impossible for you to exit in a better way. He would likely have berated you when you went to say bye which is unfair to you and scary for the kids.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">Both kids are not English speakers originally\n\n\nParents too? I'm getting the sense this is a culture where it's normal to treat the help like shit.",
              "id": 149,
              "comments": [
                {
                  "score": 22,
                  "content": "If it makes any difference they were from Sweden. I don’t think it’s a cultural thing.",
                  "id": 150,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Girl, I'm swedish & this is **not normal *or* a cultural thing**. The dad is an abusive asshole, those poor kids are going to have a harsh childhood, & the mom isn't any better. She's been okay with things getting this bad.\n\nNTA btw. There is nothing wrong with what you did. He's just some controlling ass. There's a reason why a loy of people say swedes are super nice & polite. It's rare for them to behave this way",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 77,
      "content": "NTA their parents treated you like crap and the children suffered as a result of that. Glad to see you have some selfrespect",
      "id": 152,
      "comments": [],
      "relation": "Support"
    }
  ]
}