{
  "post content": "So i have always gotten along perfectly with my friend until i disagreed with one of his political views. I'll refrain from saying what it is just in the interest of keeping the discussion focused on whether i am the asshole or not. \n\nIn truth i am pretty apathetic on the issue. He sent me a political meme along with a laughing emoji. I say \"really? i think (insert opinion here)?\" He replies back to me: \"Dude. you really think that? Like honestly? That's ridiculous.\" He then sends me a handful of angry paragraphs with links after each one. I skim it and reply \"I guess i can see your point\" in hopes of defusing the situation.\n\nI didn't think much of it until the next time we decided to hang out. He asks if I agree with him after what he sent me, and i say no, i do not. He says that he cant believe i would think something so absurd. I tell him i really don't care all that much about the issue, and i think it is fine if he has another opinion. He demands that i explain my reasoning, which i agree to, but am interrupted in absolute rage after a few seconds. He rants about how wrong i am and how stupid it is to hold such an opinion. Trying to be reasonable, i again say that i see where he is coming from. I then make multiple attempts to casually shift the conversation in another direction, to no avail. After the casual route doesn't work i straight up say \"dude, can we just talk about something else? I'm sorry we disagree but i came here to have a good time, not argue.\" He disregards this. Hours go by before i finally make up an excuse to leave.\n\nWe decide to hang out again the next week. After greeting each other the first thing he says is \"Look, about last week dude. I just get really heated when it comes to that topic.\" I reply \"no worries, we have all been there man.\" I am relieved that all is well before he immediately says \"Ya i mean it's just (insert random opinion) really doesn't make any sense to me. Like how can you really believe that and still call yourself a good person?\" \n\nMy stomach turns as i realize what this is about to snowball into. And it DOES. Once again i remain calm and nod my head as he rants (though this time i am getting really mad internally). I ignore the little jabs at my intelligence and questions of my sanity.   He yells he is not done yet when i try to change the topic (At this point i really AM questioning my sanity). When nothing changes after about 40 minutes i once again tell him that i have to leave. He looks at me in disgust and says: \"You're really gonna disregard all the points I've been making?!?! I guess I've been wasting my time here. Go run away again like a fucking COWARD! I though you were better than that!\"\n\nI....freaking....lose it. \"BETTER THAN WHAT?\" i exclaim. The next raging barrage of insults i screamed was something along the lines of \"I'm better than you in every fucking way possible! First of all, you're dumb as fucking rocks! You flunked out of class because you couldn't understand basic fucking courses. Not to mention i have had 3 different girlfriends since we have know each other and you STILL bitch and moan about how lonely you are. I had to stop bringing Sarah (not real name of ex) over because she thought you were a creepy fucking loser. Sucks not having a single ounce of social skills, doesn't it? What more can i be 'better than that' at? The fact that i wipe my ass with your salary? You had daddy's trust fund to fall back on and you still haven't amounted to SHIT! You think i had it that easy? Oh and you got a problem with me saying this? Then throw a punch man. Oh wait, YOU'RE the coward and you KNOW id kick the shit out of you! Don't ever fucking disrespect me like that again! You will always be dirt.\" Absolutely livid, i then stormed out of his house.\n\nObviously i feel terrible about saying all that. If i could take it all back i would. I hate egotistical people, so it was really cringy writing that all out! Though part of me still feels it was justified. I tried my best to conduct myself in a reasonable manner. I gave him every opportunity to chill out, to take the hint, to agree to disagree. Hours upon hours. Eventually i completely blew up and said the worst thing i could to him because he just would...not...stop. So who is it gonna be Reddit?",
  "id": 1,
  "comments": [
    {
      "score": 67,
      "content": "Everyone's an asshole. He provoked (over and over again) and you responded with a stream of insults. Next time, if someone won't drop something after you repeatedly try to change the subject or tell them to lay off after it becomes unpleasant, it's probably a good idea to limit your contact with that person. ",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "Totally agree with what you say but keep in mind that he was a close friend (for like 4 years) that i had only had good times with before that. I figured it was just a one off incident. Since it happened twice (and i had the meltdown) we have not spoken.",
          "id": 3,
          "comments": [
            {
              "score": 16,
              "content": "Oh, I don't blame you for seeing him again and wanting it to be your normal good times. I would just hold firm in the moment if you continue to be treated rudely (\"as I said, I don't want to talk about this and I'm going to leave if it's all we're going to talk about,\" \"I'm not going to listen to insults about me,\" or just walk away, as you attempted) when you can, rather than giving in to the provocation- it seems like he was looking for some kind of blowup. ",
              "id": 4,
              "comments": [
                {
                  "score": -7,
                  "content": "Goes to am i the asshole sub. Gets told that they are indeed the asshole. Responds with: \"Totally agree\" . Gets downvoted for it. Savage AF. But muhhh internet pointssss!!!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 19,
                      "content": "You got a few downvotes. I don't know why. I'd let it go. But as a heads up, if there's one thing I almost always see get downvoted, it's complaints about being downvoted. ",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 36,
      "content": "[deleted]",
      "id": 7,
      "comments": [
        {
          "score": 5,
          "content": "If anyone asked me \"dude this conversation is making me uncomfortable, can we please change it?\" I would instantly change it and feel like a dick for even bringing it up. They ignore you once: Ok maybe the are just really into the topic. Twice: Well it cant hurt right? For an hour straight? Two hours straight? An entirely new day, doing the same exact thing they know you as a person hate? Try to sit still for 3 hours straight. Try it. Now imagine it the same but with someone insulting/yelling at you to your face and forcing you into a personal conversation they knew you didn't want to have.\n\nShould i have left and just called him an asshole? Of course. Is it out of the realm of possibility that i just wanted to stabilize my friendship but finally snapped when i couldn't take the insults/shouting/disregard anymore? \n\nIt all comes down to this:  is it worse to knowingly be awful to someone for extended periods of time or to say horrible things to someone in the heat of the moment because they are being horrible to you? If you choose that latter because \"the words were REALLY MEAN\" than you are free to think that.\n",
          "id": 8,
          "comments": [
            {
              "score": 21,
              "content": "[deleted]",
              "id": 9,
              "comments": [
                {
                  "score": -8,
                  "content": "Sorry. You are no longer aloud to think that! You have to agree with me and me alone!!! Better?",
                  "id": 10,
                  "comments": [
                    {
                      "score": 23,
                      "content": "[deleted]",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 26,
      "content": "Everyone's an asshole. He kept pushing a topic after you repeatedly asked to drop it but you came at him with some pretty nasty words.",
      "id": 12,
      "comments": [
        {
          "score": -6,
          "content": "Nah it was an emotional response. He was provoked and belittled. Not the asshole",
          "id": 13,
          "comments": [
            {
              "score": 1,
              "content": "A little addition that i did not include. The initial response to the incident from me was regret and sorrow. The response from him was a subliminal message on FB about \"when the ones you trust most turn out to just be snakes all along.\" \n\nLike dude, you threw a fit that I didn't agree with you, so you tried to make me feel like shit for hours on end.  He had every opportunity to let it go. I tried to defuse the situation and be understanding until i couldn't take it. Everyone has a breaking point. But does everyone need to continue a conversation for hours while you belittle people so you can be \"right\"? I felt bad but justified for what i did. (Though throwing it out there: i may be biased here!) Imo there is no justifying what he did. Food for thought.",
              "id": 14,
              "comments": [
                {
                  "score": 7,
                  "content": "The mature thing to do is get out of the situation before you reach your breaking point. And don't take vaguebooking personally. (Even if it is aimed at you, that behavior should never be validated.)",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 22,
      "content": "You're both assholes. He's an asshole for not dropping the subject - although I do wonder what it was as clearly it means a lot to him, and the subject matter might change my perspective. \n\nYou're an asshole for snapping and saying some awful things. ",
      "id": 16,
      "comments": [
        {
          "score": 11,
          "content": "Well i REALLLLY didn't want to turn this into a politics thread. If you must know, the answer is weed. He wouldn't drop the issue that i was fine with weed as he thinks its \"degenerate\" (perhaps coming from his strong religious background idk though) and i find it acceptable for a grown adult to partake in something that only affects themselves. \n\nNow if that changes how you feel positively/negatively towards me or him then its just your subjective opinion rationalizing one side because you agree with them. The actual thing that is the issue here is the actions taken. He disagreed with me over this and was not stopping a conversation he knew i was not enjoying insulting me slightly,  throughout. I eventually blew up and used extremely harsh insults towards him. Replace marijuana legalization with changes to taxation. I really don't see the part that would help justify his/my actions. We are judging ACTIONS here, not opinions.",
          "id": 17,
          "comments": [
            {
              "score": 16,
              "content": "This does change my opinion actually. I initially assumed that since it was politics, and he was so offended by your view, that it was about being in support of Donald Trump. You'd still both be assholes if that were the case. But now you're both assholes, and he's a bit of a dumbass.\n\nEdit: I change my mind. You're the asshole here, and just a huge asshole in general. While your friend was only being a little bit of an asshole in the moment. Your attitude and your weird attacks out of nowhere make me think that your friend was simply trying to get his point across, and you were just twisting the conversation into a frustrating mess. ",
              "id": 18,
              "comments": [
                {
                  "score": 3,
                  "content": "well ya it changes your opinion because my actions make more sense to you personally. The fact is, it shouldn't matter. To someone who hates weed i'm sure now they think its all my fault because i didn't condemn the \"devils lettuce\". See what i mean? You throw being objective right out the window as soon as you find that out.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 16,
                      "content": "That's true I guess. But it didn't change the overall ruling of \"both of you are assholes\". And I do actually believe subject matter... matters, even in politics. \n\nFor example, you can't just be like \"Whites should reign supreme over all.\" And then have the gall to say \"Well, it's my political opinion so you can't criticize me for it.\" Like, uh.. yes I can. And I will. There are absolutes in the world.\n\nLike I don't do weed. It's just a personal decision for me. The stigma that surrounds it, the smell, the idea of it turns me off. Whatever. It's not a morality thing though. But I guess, I'll admit that it does slightly change my opinion of people if I learn they do do weed. That being said, I won't condemn them, and I do think it should be legalized.\n\nI'm rambling, but I guess my point is that if he hates it because it's immoral, and condemns you for only being apathetic towards it. Then that just makes him a little bit more of an asshole than he was.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Thank you for providing some context. Context is important. You cannot separate the actions someone takes from the reasons they took them. For instance, if you were defending something like the holocaust, or white supremacy or equally contentious issues, it would explain why your friend was not willing to let the matter drop. Similarly, if you were defending something that affected him personally, I can see why he might not be able to let it go. It wouldn't excuse his actions but it would make them more understandable.\n\nAs it is, I agree with /u/The_Nipple_Tickler. This extra information actually puts me more on your side as it really is a comparatively trivial matter to keep harping on about. But I also agree with the aforesaid user that your actions and tone in this thread so far have not given me any reason to think you're anything but an asshole in general. ",
              "id": 21,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "You're not an asshole. He's an idiot.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 12,
      "content": "Both assholes. Your friend provoked you, but you went for the low blow. I hope your friendship can recover, but some things can never be unsaid.",
      "id": 23,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 11,
      "content": "That friendship is dead as fuck. obviously you had some underlying issues with him before hand or else all that bottled anger wouldnt have come out. This was prob going to happen sooner or later. You were getting tired of hos attitude, his being creepy toward ur friend or gf. His self confidence issue his self fulfilling prophecy of loneliness. Your friendship ended. It happens. Sometimes its nice other times its not. This is one of those times. \n\nAs far as asshole, yall werent communicating. U should have told em that he creeped out sarah (assuming u didnt cause u brought it up like it was new to him). U should have been calling him on his shit for his self pity party. Hes just an ass for pushing his politics and what seems like bringing u i to his loneliness issue.",
      "id": 24,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 9,
      "content": "Agree with the others, everyone is an asshole here to varying degrees. The degree to which he is an asshole depends on the point you were trying to defend. If I had a best friend that I found out was a KKK member for example, I would probably do what your friend did and try to persuade him by all means necessary (any less of a friend and I would just stop talking to him). ",
      "id": 25,
      "comments": [
        {
          "score": 1,
          "content": "I decided to say that \"i felt pretty apathetic on the issue\" to try and give a hint that it wasn't a fringe idea. Since i already told someone else who asked: The issue was that i didn't care if people smoked weed.\n\n I don't know many people that apathetically decide to get involved in the KKK! harrr. Most people id think feel very strongly towards them, good or bad.\n",
          "id": 26,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "You're definitely an asshole. \n\nGetting angry is completely understandable, even yelling though not ideal is understandable. But if you wanted to yell at him it should have been about *what he did*, and what you want him to do.\n\nInstead you went all ad hominem on him about *who he is*, assassinated his character and basically told him you hold him in complete contempt as a person. Totally uncalled-for and a real asshole move. You weren't trying to solve anything, you were just trying to punish and hurt him.\n\nYou guys were good friends, yet you have destroyed the friendship over an anomaly. The friendship is probably over, because now he knows what you really think of him. Even if you patch it up, it will never be the same. \n\nLooking down on your own friends is not an attractive trait - the fact that you want to be friends with people you think of as \"dirt\" says more about your own insecurities than anything else. Also, some of the things that you think make you superior... you think being paid better makes you a better person? Having more girlfriends? Having higher IQ somehow makes you a \"better\" person? Dude...\n\n",
      "id": 27,
      "comments": [
        {
          "score": 5,
          "content": "Excellent insight.",
          "id": 28,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -1,
          "content": "Dude, i don't think that i'm better than him. I DON'T believe any of the things i said!!! I said them simply for the fact that i got enraged and wanted to say anything that would hurt his feelings because he hurt mine. Weird that you understood this because you say \"you were just trying to punish and hurt him\". THEN you go on to deliver this little nugget of gold:\n\n\"the fact that you want to be friends with people you think of as 'dirt' says more about your own insecurities than anything else.\"\n\nAre you unfamiliar with the concept of people saying things they don't mean when they are emotional? (Be it rage,sadness, jealousy, pity) Can you honestly tell me that every sentence you have ever said is 100% how you truly felt?",
          "id": 29,
          "comments": [
            {
              "score": 7,
              "content": "So, you're telling me that you *deliberately lied to him* in order to hurt him simply because you were angry.\n\nIf anything, that just makes you an even worse asshole. \n\nThat said, good luck getting him (or me) to believe it.\n\nI mean, all those things you said didn't come out of nowhere. From your description, you did all this in the heat of the moment. Ockhams razor tells me that means that all these examples were right there, easily accessible in your mind. In other words,  even before the argument you already kept tabs on whether he earns more than you or not. You were already sitting in judgment about his level of intelligence and social skills. \n\non some level, maybe even a subconscious one, you think you're superior, and that's why it was your go-to in the heat of the moment. Whether you consciously believe these things or not, the fact is they were the things you instantly chose to say.\n",
              "id": 30,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6,
      "content": "All assholes here. He needs to learn why you don't talk politics with friends and that arguing rarely changes someone's opinion. Your rant was complete assholedom, too. It's super gross to make fun if people's insecurities. Judging someone's worth is pretty tacky, but using money as a measuring stick is extra gauche. This friendship is not doing either one of you any good.",
      "id": 31,
      "comments": [
        {
          "score": 1,
          "content": "I agree with you fully. \n\nMy two questions would be:\n\n1. Do you consider either of us trying to make things better/worse?\n\n2. Do you see what he did as a heat of the moment mistake? How about what i did?",
          "id": 32,
          "comments": [
            {
              "score": 4,
              "content": "My opinion:\n\n1. He's trying to make things better and failing, cause he sucks at persuasion. You're trying to change nothing. You want the friendship to be the same as it always was. In this way, you're the asshole. His intentions are pure.\n\n2. I think his intentions were to save you. He thinks weed is really bad (it's not), and from his perspective getting you on his side would be really helpful to you. You just don't want to hear it. You want to control the relationship and steer the conversation where you want to go. You're not willing to put the work in to resolve the disagreement. You're the asshole.\n\nI have to say, your line of questioning and your behaviour in this thread have my mind changed. He is not the asshole. You are the asshole.",
              "id": 33,
              "comments": [
                {
                  "score": 1,
                  "content": "What choice did i have? There are three options: \n\n1. Instantly leave. (This option sacrifices the friendship. If i storm out every time i go to hang out with him then its over. I DIDN'T want that, so i stayed as long as i could.)\n\n2. Strongly voice my opinion. (This is where you think I failed, but you should have read more closely. I DID make attempts to explain my point, but they got him absolutely furious and screaming. Going with option 2 results in a chaotic shouting match, perhaps also ending the friendship.) If i screamed and yelled at you because my \"intentions are pure\" would you be understanding?\n\n3. Realize that there is no changing his mind and attempt to sit through his rants until he decides to be finished. This is the route i chose. I wanted to preserve the friendship but obviously it didn't work out that way. \n\nSo now riddle me this: What was so terrible about deciding option 3?\n\n",
                  "id": 34,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Oh, my mistake. I thought you were the asshole.\n\nWhy would you post here if you already knew the answer?\n\nSeriously though, if you can't have a civil conversation with him about this issue either he's a terrible communicator or you are. Judging by how you've handled the rest of this thread, I think it could be your fault.\n\nYou should always remember that you can't control other people. You only have power over yourself. In this way, everything is your problem to deal with.\n\nAlso, you're the asshole.",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Option 1 is argumentum ad absurdum. Walking out specifically because the two of you are having this particular fight and you want to de-escalate because you are angry *does not equal* \"storming out every time\" you hang out with him.\n",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "Both assholes. He was petty and provoked you but you just tore him to shreds.\n\nThose comments weren't baseless petty insults either, they were personal. You're an asshole for acting like a friend for so long towards someone you clearly have no respect for whatsoever. ",
      "id": 37,
      "comments": [],
      "relation": "Attack"
    }
  ]
}