{
  "post content": "\n\nMy wedding was days ago. My brother attended but his wife didn't. She was nearing her due date to give birth and she didn't come. The wedding was going well. Til my brother recieved a call from his mil telling him that sil was in labor. He told me he was leaving and my wife and I were fine with that but the issue began after he had told one of the guests that sil was in labor. Word spread out and suddenly, everybody was talking about it which disrupted the event. Even my parents started calling and there was a huge fuss which frankly, was unnecessary if my brother just left in silence or made up some excuse.\n\nI contacted him later and expressed my grief and frustration with what he did. I told him how the news of his wife being in labor disrupted the wedding and caused my wife to feel like her day was ruined. He lashed out asking how any of that was his fault. I explained how he should've just left or made up some excuse to leave but he said he didn't mean any harm and that he was in a hurry and worried at the time. He said it wasn't like he announced it and told me I disrespected him by arguing with him about it. We had a big argument and our parents sided with him and told me to 'get over myself' and are now expecting me to apologize.\n\n\nEdit// I just came back and started reading the comments. First comment I appreciate the sarcasm but in all seriousness, I did not expect people to come against me in this matter. I do accept my judgement but still am taken aback a little.",
  "id": 1,
  "comments": [
    {
      "score": 46539,
      "content": "The baby is obviously at fault here. Selfish jerk couldn’t even wait until after the wedding to be born. What an AH",
      "id": 2,
      "comments": [
        {
          "score": 5229,
          "content": "BTAH, true story.",
          "id": 3,
          "comments": [
            {
              "score": 3539,
              "content": "I can confirm, I was the umbilical cord.",
              "id": 4,
              "comments": [
                {
                  "score": 2449,
                  "content": "Glad you guys were able to separate amicably",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1325,
                      "content": "Yeah great for them, I was one of the other sperm that lost out to that jerk. I would never have ruined OPs wedding had I reached the egg first.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 48,
                      "content": "Umbilicamicably",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 32,
                      "content": "I don't know about that. I heard the fully cut contact.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 23,
                      "content": "Amicably? They were cut off!",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "Amicably? Sharp object was involved. I don't call that amicably.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 631,
                  "content": "Can also confirm, I was the cervix and frankly I opened up just to disrupt the wedding because F OP.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 69,
                      "content": "I beat you to the punch. I was the mucous plug.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "Thank you for your cervix!",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I just woke up my dog from laughing.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 148,
                  "content": "I can confirm, I was the baby - I planned it all.\n\nMwa haa haaaaa",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 142,
                  "content": "Can also confirm, I was the placenta",
                  "id": 16,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 34,
                  "content": "I can confirm, i was the fly on the wall.",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 31,
                  "content": "Then the placenta clapped.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Then the doctor, nurses and spectators all clapped.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "Can confirm the baby is the asshole (and has an asshole) and that you were the umbilical cord, as I was and still am, the cervix.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Can confirm, I was the short nurse’s left glove.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Can confirm. This comment is why I fucking love reddit.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I can confirm, I was the fuzz on the baby's head.",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": " 🤣",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 29,
              "content": "Honestly, there are whole subreddits devoted to this. Check out /toddlers . Just parents venting about their AH toddlers.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "They always are. I wish they’d read “what to expect when you’re expecting” before being born because they never meet expectations.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "AAAB - Assigned Asshole At Birth",
              "id": 27,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "To be fair, aren’t all babies pretty mush assholes?",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 3739,
          "content": "And now their anniversary and the baby’s birthday are probably on the same day, too. The nerve!",
          "id": 29,
          "comments": [
            {
              "score": 838,
              "content": "You must disown the nibbling. Obvim",
              "id": 30,
              "comments": [
                {
                  "score": 462,
                  "content": "Only one way to settle who gets the day. 3 rounds bare knuckle boxing between op and the baby.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 31,
                      "content": "honestly wit the way OP whines I bet the baby could take him..",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "Idk why but out of all these comments, yours hit my sweet spot!! I like you, and I'll sell tickets to the match 😈",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Gonna be an upset when baby wins!",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "I bet the baby knocks him out in the first round.",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "I fight kids lol",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "This kid is about to get furniture assembly instructions from its aunt every Christmas.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 605,
              "content": "now the baby can't celebrate any birthdays because it'll ruin OP's anniversary",
              "id": 38,
              "comments": [
                {
                  "score": 29,
                  "content": "Can you imagine what the 50th will be like? Sharing with a 50th birthday party! Over the hill and black tie. What a mess...",
                  "id": 39,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I admire the optimism that you think a coupling between two self-centered jerks like the OP and his wife will make 50 years.",
                      "id": 40,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 365,
              "content": "That tiny little asshole. How dare they???? /s",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 116,
              "content": "IKR? The little bugger decided to wreck his mother’s lower parts just to show up and show out on the big day! Selfish little  avocado-milk drinking millennials, I tell you…",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Wonder if OP even thought of that hahahahahahahaha",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "My husband and I have two niblings with birthdays on our anniversary (not the same year we marked though). His niece was born the year before our wedding, and my niece was born on our anniversary 3 years after. They’re the only two kids that I’m *confident* I know their birthdays 😂",
              "id": 44,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "We’ll have to just change the baby’s DOB",
              "id": 45,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2229,
          "content": "How can you blame an innocent baby in this situation?  It’s clearly the mother’s fault.  Why couldn’t she just hold the fetus in longer?  It wasn’t even her due date!    She is clearly the selfish one.",
          "id": 46,
          "comments": [
            {
              "score": 919,
              "content": "I second this. Clearly mom is such an AH, gosh and I bet she’ll have the audacity to celebrate their birthday on OPs anniversary next year",
              "id": 47,
              "comments": [
                {
                  "score": 356,
                  "content": "With ops audacity he’ll insist they move his birthday. \n\n“AITA for asking my brother and sil to not celebrate their kids birthday on my wedding anniversary”",
                  "id": 48,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Am I wrong to strongly believe that it will happen?",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Loudest laugh of the day 😂",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 171,
                  "content": "If mom had simply crossed her legs while in labor, or better yet nine months previously, then all this drama could have been avoided and OP’s wedding day might not have been ruined. How thoughtless and selfish of mom.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 30,
                      "content": "How dare you get pregnant nine months before my wedding date!!",
                      "id": 52,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "Mom should have done headstands to keep the baby in.",
                      "id": 53,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "It was HIS brother that got his SIL pregnant.. pretty sure they were planning the wedding and he impregnated his wife because HE wanted to sabotage the wedding. When will this sibling rivalry end?!",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "Right? Just cross those legs and have a nurse shove the head back in so OP can finish his wedding! If the baby gets brain damage, bro can just give it a lobotomy and lock it in a mansion. It worked for the Kennedys!",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "Next thing you know, save the dates will start coming like this:\n\nDue to the fact that our wedding is in June, we would like all who attend to avoid coitus from July August 1 - Nov 15.",
                      "id": 56,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "I'm pretty sure the dad gaslit her into having the baby during the wedding.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 510,
              "content": "She should have squeezed her legs together tighter! It's just like holding in pee! It works the same way!",
              "id": 58,
              "comments": [
                {
                  "score": 609,
                  "content": "It's the same muscle that lets you hold in your period. If you focus enough, nothing from your uterus will ever cause trouble for anybody.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 145,
                      "content": "\"If it's a legit wedding, the woman's body has a way of, uh, shutting that whole thing down.\"\n\nI think a senator said something like that once.",
                      "id": 60,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "THIS needs more upvotes!",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "And on their special little day of attention and all that attention was RUINED!! Marriage over. \n\nGFC. I would be thrilled if I found out I have a new niece or nephew incoming on my wedding day. The love would just keep expanding. But for many they have a big wedding and relish the attention that is the highlight of their life until they have kids and the cycle continues. And if anything that takes the attention off them well everything is just RUINED!",
              "id": 62,
              "comments": [
                {
                  "score": 11,
                  "content": "At our prenuptial dinner (the night before the wedding), two future cousins-in-law announced it was their parents’ 50-something anniversary (I forget the exact year) and toasted the anniversary couple, who was also there.\n\nSilly, naive little me. I took it as good fortune and hoped we would be married that long! I didn’t know they were (checks notes) actually stealing the spotlight and potentially ruining my wedding! /s",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Selfish, attention seeking momma! 😂",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "That is the ticket. She should have just crossed her legs and told the baby to wait until the next day.",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "She wanted to steal the day from the bride!",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "yup! clearly trying to upstage the bride. jealous her husband was going to the wedding. \n\nthe woman is clearl yta",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Exactly it’s like holding in a fart, how selfish of this mother. Imagine how her kids will turn out. Just awful…",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "Hahaha this brings out my aunt's story. Her daughter was born on new moon which is considered inauspicious. A lady came to visit my aunt and said if only she had held on for one day. It still enrages my aunt.",
              "id": 69,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "She must have been skipping her keegal exercises.",
              "id": 70,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1286,
          "content": "My (50f) chance to shine here, as this happened to me, well actually happened in an even more dramatic fashion. \n\nMy sister went into labour AT MY WEDDING (some 22 years ago now) and had to leave during the reception. This was my parents first grandchild as well.\nThis made the most amazing wedding and weekend at the time, as I was so excited for my sister when I heard all was well, and she has given birth early the next day. We also were fortunate to meet my baby nephew before we went off on out honeymoon (we luckily flew from the airport near where she lived).\n\nIn no way did I ever feel my sister distracted from my wedding. Entirely the opposite as no one is going to forget the weekend.\n\nI still all these years later think this is a fantastic story to tell and it brings me fun and joy to share it with anyone who will listen.\nPs as bonus another nephew was born on our wedding anniversary a few years later.\n\nSo yes YTA definitely, as this should bring joy to everyone.",
          "id": 71,
          "comments": [
            {
              "score": 204,
              "content": "Love this story so hard. \\^\\^\\^THIS OP\\^\\^\\^ this is the adult reaction. You clearly think you’re an adult. Act like it.\n\n”Taken aback” FFS- It‘s unnerving OP is this out of touch.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "[removed]",
              "id": 73,
              "comments": [
                {
                  "score": 48,
                  "content": ">OP is a real d!ck\n\nYa, he just edited to add: \n>I do accept my judgement **but still am taken aback a little.**\n\nI think we see the problem here...",
                  "id": 74,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I think he wanted us to call the baby TA.",
                      "id": 75,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 32,
              "content": "This is the way. You sound like an awesome person to be related to! \n\nOP, YTA. Get over yourselves. Attention isn’t pie - there’s enough for everyone to have some.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I LOVE your story! As someone who waited impatiently to become an Auntie, I would have been thrilled to have it happen during my wedding. What a blessing. You and I know what family really means. OP is DEFINATELY the asshole.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Im afraid this OP’s bride is a little too self-centred to see it the same way. How dare a baby be born on her most special day!!!",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "My sister was the pregnant SIL in a similar story. Her due date was the day of the wedding and when my sis announced this her SIL absolutely lost her shxt. ‘How could you do this to me’ ‘ruined my relationship with my brother forever’ type stuff. \nDespite being days from her due date my sister insisted on travelling over 100 miles to the wedding. Went into labour the day before, gave birth to her first child then got up and dressed the next morning ready for her hair appointment and proceeded to get ready to be a bridesmaid. \nMy sister was giving her sister in law the biggest middle finger possible in the most exhausting and self sacrificing way imaginable!\nGo sis!!",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Are you u/necessary_echo_8177 's aunt?!?!?!",
              "id": 80,
              "comments": [
                {
                  "score": 13,
                  "content": "Lol, I’m 47F and it was my mom’s brother’s wedding that I ruined (or not). Maybe this happens often.",
                  "id": 81,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "That's a great story! Not a self-centered entitled one like the OP. You are willing to share happiness with the entire family, whereas he only wants the spotlight on him!\n\nAnd yeah, your wedding day would be even more memorable with the events of your sister going into labour!",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "This ! I love this! This is how mature grown-ups handle things! THIS is how the OP should have viewed the situation! What a blessing! \n\nMy daughter was born on my birthday (it was my due date but not induced) I’ve spent the last 28 years making sure she felt special on that day, cleaning up after birthday parties etc. Never once did I feel “What about me???”  I think it’s the coolest thing! I feel so special because my daughter was born on my birthday! \n\nIt’s all about the lens you want to see it through.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Oh my gosh one born in the early morning hours just hours after your actual wedding day and another born on your anniversary. Adorable!\n\nI mean…wait! How dare those babies dare show their faces on your sacred day!",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 980,
          "content": "This was the baby's plan all along.",
          "id": 85,
          "comments": [
            {
              "score": 379,
              "content": "All of you, I'm DYING. 🤣",
              "id": 86,
              "comments": [
                {
                  "score": 91,
                  "content": "Ah going straight to the endgame are we?",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I’m sure OP’s nephew or niece will figure out some way of ruining your funeral. Seems they are destined to steal the spotlight from important events. Damn babies.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Don't die during the wedding, then it will be your fault",
                  "id": 89,
                  "comments": [
                    {
                      "score": 8,
                      "content": "But if OP dies at new baby’s wedding he’ll get the attention back on him! /s",
                      "id": 90,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Typical baby, making EVERYTHING about themselves.",
              "id": 91,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Should a left “NOT AT HOME FOR DELIVERIES” sign up for the stork, works every time! 👶",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Real main character energy you got there, baby",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 914,
          "content": "Not to mention the AH baby will consume the day ever year with it’s stupid birthday. And the brother will probably have the audacity to celebrate it’s birth every year instead of OPs narcissistic relationship",
          "id": 94,
          "comments": [
            {
              "score": 166,
              "content": "Our niece is expecting her first around our anniversary and I’m over here like please, please whatever you do have your baby on our anniversary! I can’t think of anything better than that!",
              "id": 95,
              "comments": [
                {
                  "score": 32,
                  "content": "Right? I was born on my great aunt’s birthday, and my niece was soooo close to being born on the same day as well. We were all fingers crossed hoping it would happen. Weird take this guy has that something cool happening on a day that is special for you is a tragedy. Growing up my aunt always said I was the best thing to ever happen on her birthday. Being born during the wedding could have been a cool story to bond with the baby as it grows up.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Aww that is such a great story! I was born right around all three of my aunts birthdays and one of my aunts always told me how much she loved me and will never forget the day I was born. I’m 41, she passed a few years ago. Even though she is gone and I don’t remember my birth, I remember how much she loved me. I can’t imagine being so ugly about the birth of a niece or nephew because “it’s my day”. I agree this guy has a weird stance on it. I totally would have declared in the middle of the wedding that it was the best day ever!",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "I have a niece that was born on my anniversary. I got to cut her cord. Can confirm best everness.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 713,
          "content": "I mean who wants to come out of a womb anyway? What a jerk.",
          "id": 99,
          "comments": [
            {
              "score": 312,
              "content": "ikr? when im in a woman, last thing on my mind is coming out.",
              "id": 100,
              "comments": [
                {
                  "score": 22,
                  "content": "😂 😂 😂 Okay this one wins",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Yeah, I'm more concentrating on not coming in...",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I wanna go back, but I don't think I'll fit.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 268,
          "content": "You made me ugly laugh at work!",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 246,
          "content": "yes, teach the baby now that everything is always the baby's fault, and that op hates them for ruining their day with their birth. so selfish of that baby",
          "id": 105,
          "comments": [
            {
              "score": 97,
              "content": "Dern Baby ruined THE BRIDE’S DAY! Might as well get an annulment.",
              "id": 106,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 86,
          "content": "🤣🤣",
          "id": 107,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 35876,
      "content": "YTA. What was happening to your brother was completely out of his control, significant and scary. To ask him to conceal that in the moment because it stole focus from you is utterly narcissistic. \n\nI'm guessing if his wife was in a horrible car crash and medivac'd to the ER you'd want your brother to keep his mouth shut too?\n\nYou owe everyone in your family an enormous apology.",
      "id": 108,
      "comments": [
        {
          "score": 10128,
          "content": "Not even that what if someone noticed the brother was gone from the reception. It doesn’t take a genius to put it together that brother with a very pregnant wife is gone, that the wife is in labor. \n\nJust wait until the niece/nephew gets his own party every year on their anniversary. \n\nYTA.",
          "id": 109,
          "comments": [
            {
              "score": 3584,
              "content": "[deleted]",
              "id": 110,
              "comments": [
                {
                  "score": 3784,
                  "content": "Forgive me for jumping to a conclusion, but if this news was enough \"disrupt\" the event, the reception must not have been very fun.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 2149,
                      "content": "Accurate. Like, if i were a guest and heard that so-and-so left because his wife was in labor, I'd be like \"cool!\".  And then immediately go back to whatever I was doing.  Maybe shoot them a text wishing them luck, depending on the level of closeness.  It's not like OPs brother stayed to make speeches or accept congratulations.  He was gone.  How disruptive could this have been?",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 398,
                  "content": "\"Where's our gifts?!!! It's OUR anniversary!!\"",
                  "id": 113,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "Yeah i thinks there’s a lot more underlying issues at play here. First off I mean come on OP you guys are brothers, his wife is pregnant and went into labor. I mean what you can’t share a special day with your brother. Most families would think this is the best thing in the world One son Married and one becoming a father! I mean how much better does it get for family things! \n\nHowever I’m sensing that either OPs wife doesn’t like his brother or maybe his family. Whenever there’s animosity over something so stupid there’s more at play. I mean I don’t know 100% but I could definitely see OPs wife saying to OP, OMG! I can’t believe he did that, it totally ruined our day. Your brother has to be the center of attention always. No one in your family can be happy for us. \n\nGuys do this and Women do it too, usually in controlling relationships they start build anger between you and your family. Then you slowly drift away from your family. You stop going to your family events, stop inviting your family by, and you loose touch with your family. Then it’s all about her family, you do everything with her family, all that matters is her family.  \n\nI’ve seen it happen to so many family and friends. Obviously I’m not 100% sure, but i could definitely see this happening. There’s something more going on here. It did start with this situation.",
                  "id": 114,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "I genuinely don't understand this obsession people have with the wedding itself being the only important thing happening that day. Like, to me, if a close relative is giving birth on the same day as my wedding, that's just extra awesome? Now there might be a new baby whose birthday is my anniversary! That's super cool! I would be out there gossiping and begging for updates myself.\n\nAt my actual wedding a few years ago, my husband's .... I think it's his cousin's stepkid? Anyway a girl at the wedding had her 11th birthday on the same day, and we had the DJ call her out and we sang happy birthday to her, and I made a point of congratulating her because, idk, girls usually like brides.\n\nSeriously, if I'm the bride (not that I'm planning to do that ever again), please announce your pregnancy at my wedding. Show me your engagement ring. Bring your new baby to see me. Show off how well your toddlers can dance. Celebrate your grandma who just turned 90. Other people's happy moments just add to the celebration as far as I'm concerned - they don't take anything away.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "OP giving real Jan Brady vibes.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Omg I was totally hearing Jan whine “Marcia Marcia Marcia!!” as I was reading this tale of woe.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "Hummm I guess Bridezila is to blame for this cry 😂 oh my special day, that brat ruined MY day 😭😭😭😭. Come on Groomzila, if I where a man, and my SIL was having a baby I would be the first one shouting \"I'M GONNA BE AN UNCLE RIGHT NOW!\" and have a toast in my nephew's honor! YTA",
                  "id": 118,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1056,
              "content": "but actually, i'd think this is so cute. if my wedding anniversary was shared with my niece / nephew's bday. isn't that adorable? what a special day.",
              "id": 119,
              "comments": [
                {
                  "score": 771,
                  "content": "Right? It would have made my wedding so amazing and MEMORABLE. I do not understand people who think that the world is supposed to stop spinning on its axis on their wedding day.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 397,
                      "content": "i would've loved to tell the story \"so we had JUST gotten married and then.. all of a sudden.. she went into LABOR! the drama... the intrigue...\"",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "RIGHT?! Hell, if this was my wedding I’d probably be so excited that I’d announce his departure to his labouring wife over the mic (if he was cool with it). It’s sad and twisted to see this as anything but ADDING joy to the celebrations. YTA.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "This happened to my sister! My BIL was at a wedding in another country when my poor sister had to undergo an emergency induced labor to save her life 2 weeks before the due date. It was quit a shock and BIL couldn’t get a flight home so was trapped there a complete nervous wreck. He very quietly told the bride and groom the news and they were so excited for him that the groom made an announcement to the entire wedding that his groomsmen was about become a father, and then announced the birth when my niece finally arrived. These people were all strangers to my BIL and they all celebrated and checked in on him when by all rights they had no requirement to. A night full of back pats, hand shakes, toasts and hugs. Seriously everyone was happy and excited about it and they still had a blast of a wedding even with the unexpected news. There was plenty of love and attention to share they said.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Maybe OP will read this and learn to change how he perceives the people and world around him. Other comments in this thread such as \"I would have grabbed the mic to announce the birth\" picture an entire wedding whooping and clapping in celebration!  \"I would have run to the hospital in my wedding gown to meet my niece/ nephew\". Could you imagine a picture of OP and his wife, in tux and gown, holding the new baby at the hospital!!! That joyous story and picture would go down through generations in OPs family. OP, please think of all these beautiful thoughts and memories that are lost because your viewed a birth as a slight to yourself. Tweak how you perceive the world and you will find your happiness increase.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Honestly, my wedding was an absolute blast and having my nephew/niece born on the same day would send it into a God-tier event for me. I can't think of anything more amazing and what a thing to share with them as they get older. \n\nOP is such an roaring arse.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "We love double events in my family! My sisters anniversary is my little brothers bday. My kids share a bday and my neice and husband share a bday. I was hoping she’d be born on mine, but my husband got her instead, their bday is a couple weeks after mine. \n\nIt just makes it more fun!",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Exactly. If it had been me, and my brother came up to me to tell him my SIL was in labor, I wouldn't care if he made whatever type of announcement he wanted as he jogged out of the reception. Pursuambly all your side of the family is at the wedding and I'd be sure to tell him he could call with an update if he liked and I'd announce it. What a great memory and story to tell the child later. But alas, I'm not OP. YTA.\n\nEdit, got a little confused on what side was writing. OP is TA.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Not the same, but my sister and I have the same wedding anniversary. Her wedding was exactly one year after mine and I love it. We can remind each other of the correct day every year lol",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "yea, i immediately thought it was adorable & thought it’d be a cute lil “how adorable my niece/nephew is on the way today!! what a wonderful wedding gift!!” but i guess not everyone is supportive :( YTA OP",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I posted this recently on Reddit in response to a similar scenario, but it’s worth repeating here. \n\nTrue story: My mom started having labor pains in the MIDDLE of her brother’s, my uncle’s, wedding ceremony. She went to the hospital immediately thereafter with my dad and grandparents, and all was understood.  \nMy aunt and uncle had a rocking wedding reception that went well into the night. It was 1984, so my dad had to call the venue every so often about the progress. As the party ended, many of the guests made their way over to see how she was doing. While my poor mom labored, my dad entertained those in their suits and tuxes and smoked cigars and had a jolly party in that waiting room. He had to take off a suit to put on his scrubs when the time came. I was born at 4:04 a.m.  \nI came into the world in style and just wanted to be part of the fun! We laugh about it every year and my uncle jokes that he has no excuse for ever forgetting my birthday.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Insecure people with few things going on in their shitty lives are hard to explain this to",
                  "id": 131,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 192,
              "content": "Oh God. That's a good point. What a great way to miss an annual Welcome To The Family party in the name of pettiness and selfishness.",
              "id": 132,
              "comments": [
                {
                  "score": 14,
                  "content": "Right? What a rude baby 😂",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Even if he slipped out without saying anything and people just put 2 and 2 together, OP probably still would have found a way to blame her brother. I already feel bad for the kid. \n\n\nOP's post in a year from now, \"AITA for threatening to cut off my whole family if they celebrate my neice/nephew's 1st birthday instead of my wedding anniversary. Their birth ruined my wedding so everyone should be focused on me to make up for it!\"",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "In my experience when something happens and people try to keep it a secret and something is obviously going on it attracts more attention than just letting everyone know so you can stop the gossiping and speculations.\n\nI don't see how he could have done it any better. If he has just left in a hurry people would have been like:\n\n\"Frank just left. Left his jacket, wallet and everything. You think....?\"\n\n\"Let me check my phone. Just a minute. Suzie told me she was 27 weeks along the 15th of May, that's 1, 2, 3, 4, 5, 6, 7, 8, 9 weeks ago. So 36 or 37 weeks along. That's  makes her either in or very nearly in the safe zone. \"\n\n\"You think they be okay?\"\n\n\"I hope so\"\n\n\"Did Frank say anything to you?\"\n\n\"No. But he seemed kinda stressed.\"\n\n\"I asked how Suzie was and he said she was pretty miserable. At the time I just chalked it up to 3rd trimester aches and pains.... Do you think he meant something more serious?\"\n\n....and all the guests going through some sort of variation of that.\n\nVs\n\nFrank: \"Suzie is in labour! Woop woop!!! Imma be a daddy today! Later suckers!\"\n\nAnd everyone giggles, do a toast and move on.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Lolol I didn't even think of the dates being the same. Let's hope the baby popped out before midnight 🙏\n\n🤣🤣🤣💀💀💀",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My grandparents refused to acknowledge my birthday because of I \"ruined\" their anniversary by being born",
              "id": 137,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Hell if they didn’t talk about it and just acted all mum’s the word, I’d assume something might’ve gone tragically wrong. \n\nMy nephew was born on my ex’s and my anniversary. Why on earth would we care about that? Like schedule your unscheduable life events around my life events. \n\nBizarre. OP you already know you’re the AH. I’m not sure why we’re here.",
              "id": 138,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1291,
          "content": "Yeah my cousin went into labour the morning of my wedding and her daughter arrived safely during the reception. Her parents were there as well as other joint relatives so of course the news went round and people got excited. I honestly thought it was really special that my family now had an extra reason to celebrate and that it made the wedding extra special and memorable. Plus it makes remembering her daughter's birthday super easy!",
          "id": 139,
          "comments": [
            {
              "score": 754,
              "content": "The key difference is that you aren't utterly self-absorbed and you're able to feel joy when good things happen for other people.",
              "id": 140,
              "comments": [
                {
                  "score": 270,
                  "content": "Exactly, the only reason it ruined OP's wedding is because OP and his wife ruined it for them selves.  OP and his wife should have got on the mic announced the labor and cheered on his brother as he ran to his car, take a moment to celebrate, raise a glass to his brother and SIL and then carry on with the party.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 15,
                      "content": "PERFECT!!",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "yeah OP, you're getting a niece or nephew out of this, why wouldn't you wish your brother and your absent SIL the best of luck with the baby's birth and cheer them on???",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 162,
              "content": "This happened to us too—cousin’s baby was born during the ceremony and my aunt and uncle got the news and told everyone right afterwards. We were overjoyed and crying all over again!! Didn’t ruin our day whatsoever. The only thing we were sad about was my cousin and his wife having to miss the wedding, but obviously not anyone’s fault.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Yes! This is a mature persons response to this situation. Take notes, OP. Maybe you can do better on the 2nd wife.",
              "id": 145,
              "comments": [
                {
                  "score": 29,
                  "content": "The fact that he even thought to bring it up with his brother instead of just quietly dealing with it says they both have the same level of immaturity. Let's encourage a long, healthy marriage instead because I'd rather they not inflict that on other people.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I dunno about that.  She sounds as bad as he is - in OP's post, he said the new bride felt like her day was ruined because of the baby's birth.  They sound like a-holes and they deserve each other.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 13,
                      "content": "I can understand feeling upset if the brother actually interrupted the ceremony and made a fuss during the actual vows or something, but this happened during the reception and he basically slipped out unnoticed?  it’s not his fault if other people started talking and yeah, the bride & groom could have refocused the attention by making a toast to the new family member. 🤦🏻‍♀️ what a couple of dummies. at least they’re well-matched? lol",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 461,
          "content": "This ⬆️⬆️⬆️ (and an award.) \n\nYes, get over yourself quickly and apologize profusely to everyone you offended and anyone else that will listen. YTA",
          "id": 149,
          "comments": [
            {
              "score": 19,
              "content": "I could not imagine being so self centered that my brother having a child was not a big deal to me and a total positive. This is so wild. Hell if one of my friends went into labor during my wedding I’d probably stop it to get details. I’d be so happy.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "OP probably thinks SIL should have waited to give birth so as not to rain on their VERY VERY, center of the universe, DAY. What narcissistic rubbish.\n\nOP of course you’re the AH. Stop being angry over there being an emergency on your wedding day and shitting all over your own wedding- because I 1000% know your *mood* was ruined by you. Not your brother. \n\nGrow up and stop manufacturing your own misery.\n\nYTA",
          "id": 151,
          "comments": [
            {
              "score": 14,
              "content": "She should have held it in like a period, obvious AH /s",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Guaranteed they are like, we booked this venue 18 months ago and you intentionally timed your pregnancy to ruin our big day.",
              "id": 153,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Who are these people who don’t love their family enough to say “our day is doubly happy, we’re gonna be an aunt and uncle AND husband and wife!” \n\nCelebrate that shit, OP. You’re being petty and small, and there’s joy enough for everyone. Too bad you’ve already ruined everyone’s “special day” (I hate this phrase now) and your parents’ celebration of their grandchild AND your wedding by trying to force people to side with you against… *a baby.*\n\nWTF. YTA.",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Also, baby is born and the first thing this guy says to his brother is, \"hey why did you ruin my wedding?\" Not, \"hey I hope this very large medical situation went well and everyone is healthy,\" like a normal human? Of course YTA, OP!",
          "id": 155,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Lol what is with people thinking the entire world stops the day of their weddings? Is this a new thing? It’s so bizarre to me.",
          "id": 156,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "YTA and frankly need to grow the hell up. Like this person said, would you expect them to stfu if their spouse were in a car wreck? Or like another person replying pointed out, do you think your guests are too stupid to put together where he slipped off to when half of them are your family that KNOW your SIL was heavily pregnant? It was going to come out, much like your nibling was about to come out into the world: Whether you liked it or not. Welcome to the real world, kiddo, it gives zero shits about your *special daaaaay*. Get used to it.\n\n\nYou AND your entitled princess wife both need to apologize to your brother like, yesterday. You both sound like insufferable children by pitching a tanty because \"zOMG how DARE SIL go into labour on our special daaaaay?!\" It's just so ridiculously entitled and childish. Your parents are 100% correct: You and your wife need to get over yourselves asap.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16900,
      "content": ">told me to 'get over myself' and are now expecting me to apologize.\n\nExcellent advice. \n\nYTA. And your wife, too.\n\nI look forward to the follow up post next year where you and your wife complain that the birthday celebration for your niece/nephew has ruined your first anniversay.",
      "id": 158,
      "comments": [
        {
          "score": 2425,
          "content": "Too funny 😂 we can definitely expect a post in 12 months",
          "id": 159,
          "comments": [
            {
              "score": 181,
              "content": "Depending on the labor, it might not be the same day. My SIL was stubborn and was in labor for 40hrs before she went C section.",
              "id": 160,
              "comments": [
                {
                  "score": 37,
                  "content": "I went 16 hrs and it's terrifying when they tell you, you have to have a c-section.",
                  "id": 161,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Just don't be like my mom please.  36 hours (no c section) and reminds me more than 40 years later on every bday that I took longer than both of my older siblings combined.  In my defense, the 2nd was 45 minutes, so... not fair :(",
                      "id": 162,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1130,
          "content": "That's if they don't divorce first. Any couple this preoccupied with the *day* rather than the marriage is probably not going to last too long after the boost from their special party has worn off.",
          "id": 163,
          "comments": [
            {
              "score": 213,
              "content": "My money is on them lasting a year or so as they are going to be trying to have a baby to get attention.  OP's wife will love pregnancy attention, and hate that the kid gets attention when they are born.",
              "id": 164,
              "comments": [
                {
                  "score": 17,
                  "content": "babies want to watch the world burn.",
                  "id": 165,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 178,
              "content": "My toddler flower girl totally stole the show at my wedding, and I *loved* it.  To be fair, I would've been fine just going down to the courthouse, but hubby wanted a wedding.  I just wanted to be married.\n\nMy bff had a big lavish wedding and during all the planning it was all about the wedding, not about the marriage.  Guess who has been in a horrible marriage for years?  Hint: it's not me!",
              "id": 166,
              "comments": [
                {
                  "score": 197,
                  "content": "My husband (under the circumstances I consider him my husband) died three weeks before our wedding. I can't even fathom what these people are thinking when they think it's the *day* that matters.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 62,
                      "content": "I'm so sorry for your loss and that you didn't get to share years together. These people that are more concerned about the party don't want to get married, they want a Sweet Sixteen like MTV used to air.",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Holyshit how awful. I'm so sorry for your loss *internet stranger hug*",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Oh my god, I'm so sorry.  Sending you lots of love and support.",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Thank you for this much needed reality check. Such sadness shouldn’t be suffered by anyone.",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Exactly this. If this was me I woulda been so pumped to have my niece/nephew being born the same day. IMO it just makes the day better and more special.\n\nHowever, unfortunately I know people just like OP and his wife and this does not surprise me. \n\nI think some people just grow up in a world where everything revolves around themselves and they can only be genuinely happy for themselves and what they are doing or have done.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12210,
      "content": "YTA. What was he supposed to do? Lie to everyone? Tell his wife to hold it in? \n\nHe came to your wedding during a time when his wife probably would have preferred he was at home and you're butthurt because you think it ruined your \"special day\" - if your own brother's exceptional, amazing life event on the same day as your wedding \"ruined it\" then you and your wife have problems.",
      "id": 173,
      "comments": [
        {
          "score": 2159,
          "content": "For real! I would be stoked if my sister ended up giving birth the day I was getting married. I would probably leave my own wedding to go be with her and meet my niece or nephew, honestly.",
          "id": 174,
          "comments": [
            {
              "score": 697,
              "content": "Plus, you'd always be able to remember the kid's birthday, too.",
              "id": 175,
              "comments": [
                {
                  "score": 392,
                  "content": "You can always ask your brother the date of your anniversary, you mean?",
                  "id": 176,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Touché.",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "That’s how my uncle and aunt (dad’s oldest brother) remember how old I am. They got married in 1987, the year before. So it was their 1 year anniversary the day I was born. I’m in my 30s and my aunt is always the first to text me because of this lol.\n\nAnd my bff got married on my birthday in 2019 💜",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "That’s assuming the kid was even born that day. Labor is a long process I went into labor one morning and my kid wasn’t born until the next day.",
              "id": 179,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 659,
          "content": "Right?  The one thing that the brother hoped wouldn't happen- his wife going into labor without him there- happened! She probably wasn't stoked on the timing either!",
          "id": 180,
          "comments": [
            {
              "score": 156,
              "content": "I can't imagine not sitting and getting updates too.  Births can be tricky sometimes.  I can't believe OP is annoyed that his parents were checking for updates.\n\nOP YTA.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 350,
          "content": "I love that op called his brother to express his grievances. Like, if my sil gave birth two days ago, I’d be asking my brother how sil is and asking what the new nibling’s name is. Last time I sent a grocery delivery. Op is so self-centered.",
          "id": 182,
          "comments": [
            {
              "score": 45,
              "content": "Right?!? Women still die in childbirth in this country in shocking numbers. A friend who had twins nearly bled to death 12 hours later. No one had caught serious internal bleeding until it was almost too late. A transfusion saved her life.",
              "id": 183,
              "comments": [
                {
                  "score": 18,
                  "content": "PSA for everyone to donate blood and register to be a bone marrow donor.\n\nEdit to add [bone marrow link.](https://www.googleadservices.com/pagead/aclk?sa=L&ai=DChcSEwjAxMLf5vX9AhVkyZQJHbLiDuMYABAAGgJ5bQ&ae=2&ohost=www.google.com&cid=CAESbeD2KE1lfqGX-yxVSO8cZbmHfHo3_EOLwg-qKljeygyxm1ShVdQhzGHLwGtt3zrn56UoPe3HtiJ_fcCRQDZc3fgkwS2-yGa82LUcZJidBSxptkalLLQalCIKDOgJofXR6WK3BBONIVTIDp2U3Eg&sig=AOD64_0XKWq35rqI4ZUgAJXJQsjqJttoCg&q&adurl&ved=2ahUKEwjqh7bf5vX9AhUlm2oFHbJBCYkQ0Qx6BAgHEAE)",
                  "id": 184,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yes!! I didn’t add this detail - my friend and I met working for the American Red Cross. I always tell her good karma paid off for her.",
                      "id": 185,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 191,
          "content": "Holding it in is the least SIL could have done after having the nerve to even be pregnant around the wedding date! /s\n\nHell, if it were my wedding I’d be so stoked & probably make an announcement myself! “Folks, let’s send my dear bro off with a toast as he’s off to join his wife who’s in active labor, can’t wait to meet their kiddo”. Round of applause, cheers, mood lifted, people happy, party good!",
          "id": 186,
          "comments": [
            {
              "score": 30,
              "content": "Right? Like do they even care about their family or is it the classic \"everything must go EXACTLY according to plan or my special day is RUINED...RUINED!!!!\"",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Exactly and she already didn't show up to the wedding (IMO this was the right move but OP probably hated that too) imagine if SIL went into LABOR during the wedding and had to call an ambulance and make a scene at the actual wedding. OP would have been PISSED the family would have been ruined.",
          "id": 188,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "“Express my grief”\n\nOp said that it caused him grief 😂😂😂",
          "id": 189,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "\"Tell his wife to hold it in?\" Dear internet stranger, I snort laughed at this. Upvote!",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I just don’t understand how just wedding guests talking about news “ruins” a wedding in any way shape or form. Like, this didn’t stop people from drinking or dancing in any way. Is it literally just that they dared to talk about non-wedding stuff for a few moments?\n\nOP, you sound ridiculous, YTA.",
          "id": 191,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Yeah, he wanted his brother to lie, to their parents and everyone else 🙄... he said make up a excuse to leave.   I don't know what else would be a good excuse to leave that wouldn't distract?",
          "id": 192,
          "comments": [
            {
              "score": 16,
              "content": "\"Sorry folks, I have to leave, my... Cat is having kittens.\"\nNo, no, much better to just bail and leave everybody wondering what terrible thing happened that he would abandon his brother's big day without a word...",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I’m sure if the brother decided to stay home to be with his very pregnant wife, OP would have flipped out and accused him of ruining the wedding. No win",
          "id": 194,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6728,
      "content": "YTA. I'm so over this whole \"the wedding has to be the center of the universe for everyone involved\" attitude. Would your wife get upset with a guest who suddenly had a heart attack at the wedding? Or an allergic reaction requiring an epi-pen and ER trip?\n\nSh** happens, even on wedding days. The ceremony was over, and it sounds like you were well into the reception. Your brother had his own stuff to be worried about at the moment, and he didn't exactly have time to think through every word he said. The day wasn't ruined. This was a cause for DOUBLE joy: a wedding AND a new baby in the family!\n\nIt was, however, a little rude of your parents to stay at the wedding but make more than one call to your brother. They could've texted, stepped outside, or left as well. But...only a little rude.",
      "id": 195,
      "comments": [
        {
          "score": 1870,
          "content": "Wedding expectations are so out of control. This guy wanted the actual birth of a child to be hidden and lied about so he could have his big moment.",
          "id": 196,
          "comments": [
            {
              "score": 594,
              "content": "Right!  Just get over it.  On my wedding day someone spilled red wine all over my wedding dress at the reception.  Did I get mad? No.  It was an accident.  They felt horrible about it.   I could have spent the rest of the party crying about a ruined wedding dress and making them feel even worse or I could have realized I just married the man I love and we're surrounded by people who love and celebrate us.  I chose option 2.  It was one hell of a good time.",
              "id": 197,
              "comments": [
                {
                  "score": 94,
                  "content": "OMG was there shocked silence in the room after the spill? I can just imagince the tension while everyone waited for your reaction.",
                  "id": 198,
                  "comments": [
                    {
                      "score": 261,
                      "content": "Yeah, all my moms ,OG, Step and MIL, along with my bridemaids just kinda froze.  I laughed and said maybe offering red wine wasn't a good idea.  We wiped off what we could and just moved on.  No reason to cry over spilled wine or spilled milk (unless you just sent a half hour trying to pump that breastmilk.  You can definitely cry about that.)",
                      "id": 199,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 46,
                  "content": "Ah see that’s just a good story/photo\nOpp! My friend got married and they rented a bouncy house so her and her husband got in it and were hopping around for pictures and completely tore the dress and they just laughed their ass’s off. It’s about people you care about and not the party.",
                  "id": 200,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Same thing happened to me at my wedding. My 4 year old niece was playing around my table and got red wine everywhere. Things happen, right?",
                  "id": 201,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Yep,  I do tell people to not serve red wine at their wedding now though.",
                      "id": 202,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Oh man I actually feel worse for the person who spilled if it was an accident, I would be so embarrassed. Glad you were cool, and hoping you at least got some pictures before the spill!",
                  "id": 203,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yep, it happened after all the pics so we were good.",
                      "id": 204,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Wedding Invitation Part 43(b)(17): Guest hereby agrees to avoid discussing any topic other than the wedding, including \"The building is on fire\" and \"I hear tornado sirens.\" Guest acknowledges that negative comments, including back-handed compliments such as \"My, the bride's ankle monitoring device is a lovely shade of black,\" or \"I see Kevin's oozing scabs are healing nicely,\" will require one session in the Wedding Reeducation Booth.",
              "id": 205,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 523,
          "content": "It feels like every wedding-related post on here is someone freaking out because family and friends of the wedding couple have lives outside of the wedding, and sometimes need to live those lives while the wedding is happening.",
          "id": 206,
          "comments": [
            {
              "score": 118,
              "content": "Exactly. Like the ones where the wedding is like 6 months away and someone in the family/wedding party is \"selfish\" for getting pregnant because it's going to steal the bride's attention? FML and get over yourself ppl",
              "id": 207,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "I don't even understand how this could derail a wedding party that much anyways. Like sure, people are going to talk about it but like.. people are going to talk about plenty of things. Its not going to be wedding talk 100% of the time.",
              "id": 208,
              "comments": [
                {
                  "score": 16,
                  "content": "People were probably already talking about the fact that the wife was due any second now. This was there was just extra cause for family joy!",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Maybe I should post the story of my wedding day and ask if I'm TA for not being more upset about some of the shit that went down🤣\n\nMemorable moments:\n\n-arch almost blew away. Photographer saved the day with giant zip ties and duct tape\n\n\n-my son/ring bearer cried because they wouldn't let him wear his pants backwards\n\n\n-groomsman got high on mushrooms and didn't show up. His girlfriend stood in his place....in a WINDBREAKER *GASP*\n\n\n-ALMOST dumped my father in law out of his wheelchair because I missed a hole the dog dug in the grass\n-groom DROPPED ME during the first dance",
              "id": 210,
              "comments": [
                {
                  "score": 11,
                  "content": "I'm glad you're laughing about all this! I mean, it makes your wedding day memorable, right?\n\nMy SIL wasn't sure if she'd be back in time for her rehearsal dinner...because she was driving a wounded crane she found to an animal sanctuary. Since she and my brother met because they were both ornithologists, it seemed sweet.",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Now now, there's also the \"I'm only serving water and bread\" people and the \"I refuse to have a single vegan option at my wedding, even the mashed potatoes and rolls must be liberally sprinkled with bacon\" people.",
              "id": 212,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I think it’s what Reddit people sometimes call main character syndrome. A healthy delivery would be excellent news to normal people, and it sounds like the news was traveling during the reception. I doubt their ceremony was impacted at all.",
              "id": 213,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Seriously! Like how much could it really disrupt a wedding? Did the DJ stop everyone from dancing to make the announcement, was dinner delayed? Weddings are stupid and boring, and every bride thinks it's some magical thing, sorry sis you ain't that special.",
          "id": 214,
          "comments": [
            {
              "score": 20,
              "content": "And a great hostess of a bride would have risen and led everyone in a toast to the newest member of the family to be! What is wrong with these people?",
              "id": 215,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Even when it’s something good and planned or controllable, I still don’t get this mentality of “my wedding is the only thing allowed to be happening.”\n\nYes, in the case of a medical emergency, obviously that takes precedence and needs to be focused.\n\nBut my wedding is on the same day as a close family friend’s 21st birthday and we plan to have a birthday card/ some other special thing at his seat, request the bar to make a special birthday cocktail for him, and lead our guests in singing happy birthday to him and encouraging people to give him happy birthday wishes. \n\nWe also are doing a New Years Eve wedding. So we’re sharing our wedding with (arguably) the biggest party night in the US, the end of one year, and the beginning of a new year. And we love that. New Years often has significance for most people (opportunity for a new outlook on life, reflecting happy memories from the past year, looking towards future goals, closing of chapters that are now over, providing a sense of closure and new hope, etc) and we love that. We love that our guests are willing and excited to share that special night with us and we are thrilled to be celebrating so many different things, even though many of those things aren’t about us.",
          "id": 216,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "weddings can be all about you and your new spouse. it’s called “eloping.”",
          "id": 217,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4934,
      "content": "NTA Your SIL should have just held it for a few days. I do it with big poops all the time and it's never been a problem",
      "id": 218,
      "comments": [
        {
          "score": 781,
          "content": "Bahahaha \n\nThank god I read the full comment",
          "id": 219,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 224,
          "content": "# poopbaby",
          "id": 220,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "Hahahahahaha!",
          "id": 221,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Oh come on now, we know you are pooping while you write this.",
          "id": 222,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4103,
      "content": "~~Honestly, NAH~~ YTA (I get being frustrated by something like this but he didn't do it on purpose just to mess with your day). \n\nHOWEVER...why, instead of getting upset when the news spread, why didn't you and your bride stand up and make an announcement and raise a glass to toast them? Doing so would have diffused the disturbance by getting it out in the open all at once instead of it rippling through the crowd. It would also have put the focus back on you two, the bride and groom. \n\n**You could have been part of the good news instead of in competition with it.**\n\nThis was a missed opportunity.\n\n**Updated ruling due to continuous infighting after the wedding. Excellent point by:\n>mystrymaster - \nYeah OP has forever ruined the day for the entire family unless they apologize and provide some closure.\n\nDude, apologize and fix it now or it will be hella awkward every. single. year. when your niece/nephew's birthday comes around on your anniversary.",
      "id": 223,
      "comments": [
        {
          "score": 1785,
          "content": "100% raise your glass and \"my brother is leaving to become a father, what a great day we will forever share with our niece/nephew, cheers and good luck\"",
          "id": 224,
          "comments": [
            {
              "score": 431,
              "content": "Gonna make it really awkward at the babies first birthday party when they complain about it being the same as their wedding anniversary.",
              "id": 225,
              "comments": [
                {
                  "score": 33,
                  "content": "Yeah OP has forever ruined the day for the entire family unless they apologize and provide some closure.",
                  "id": 226,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "How many anniversaries do you reckon they have in 'em?",
                  "id": 227,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Probably going to want the cake to say \"it's my birthday but my aunt & uncle's wedding was first!\"",
                  "id": 228,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 161,
          "content": "This would have been a great way to go about it!",
          "id": 229,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 119,
          "content": "Yep!\n\n\"Today my beautiful wife became part of our family but it turns out we're gaining TWO new members of the LastName family! My sister-in-law, Lisa, just went into labour! So let's all raise a glass for so many blessings coming our way today! To family!\"\n\nEverybody toasts and gets back to the party. But that would have required OP and his bride to not be self centered children.",
          "id": 230,
          "comments": [
            {
              "score": 23,
              "content": "A toast that eloquent would have brought down the house! Memorable and wonderful for everyone!",
              "id": 231,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Agreed, a toast would’ve been perceived as classy by their guests. Tbh, as a guest I likely would’ve wondered why the new uncle was mum about it…\n\nYTA",
          "id": 232,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2667,
      "content": "YTA\n\nSo you wanted him to lie? Or just vanish without telling anyone?\n\nIf your brother having a child causes you *grief* instead of joy, please seek help. \n\nYou got married at a time that a close family member was expecting a baby. That people discussed that during the wedding doesn't ruin your wedding. I don't know what you expected of your brother, but this feels so petty.",
      "id": 233,
      "comments": [
        {
          "score": 604,
          "content": "Lol I really don’t know what people want from weddings anymore. From these posts I’d swear they want all their guests sitting in silence staring at the bride and groom. No other discussion, no fun, no nothing. Discussing your job? Better not be going well! No other joy is allowed here!",
          "id": 234,
          "comments": [
            {
              "score": 280,
              "content": "It's weird because they act like they've never been a wedding guest before. People catch up and chat about their lives.",
              "id": 235,
              "comments": [
                {
                  "score": 322,
                  "content": "No no, at my wedding everyone sat still, chanting our names interspersed with ‘what a beautiful wedding’. Oh and eye-contact was forbidden",
                  "id": 236,
                  "comments": [
                    {
                      "score": 142,
                      "content": "At my wedding, I told everyone that introductions were forbidden because it was MY BIG DAY and I didn't want my family to be distracted by learning the names of his family.",
                      "id": 237,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Dressed exactly as specified by the bride and groom and no children within a 2km radius.",
                      "id": 238,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "'What a beautiful wedding,' says a bridesmaid to a waiter...",
                      "id": 239,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "You saw the bride wants silent wedding column ? https://www.reddit.com/r/bridezillas/comments/zg4uio/holy_smack_a_silent_reception/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button",
              "id": 240,
              "comments": [
                {
                  "score": 15,
                  "content": "And here I thought I was being outlandish and preposterous",
                  "id": 241,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "I guess the silver lining is when their anniversary comes up it will be: “sorry can’t come—it’s the baby’s birthday!”",
          "id": 242,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I dunno about that.  Most weddings seem to take *waaay* longer than 9 months to come to fruition.",
          "id": 243,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1254,
      "content": "Why can’t people just be happy for each other and not be so self absorbed??\nIts your brother, you became an uncle too, would you not be happy to hear that news. Why does someone else’s happiness have to take away from your happiness, imo it would mean double the celebration. YTA because he didn’t announce it. It was happy news and you should have just congratulated him and moved on.",
      "id": 244,
      "comments": [
        {
          "score": 87,
          "content": "YTA. Yep. Their day was ruined because they let their ego ruin it. Congratulations to the new parents and to the new couple. Both things can happen with joy and happiness. Change your mindset, OP. You and your wife are the AHs.",
          "id": 245,
          "comments": [
            {
              "score": 31,
              "content": "OPs edit saying they are \"taken aback\" by the judgments in here. \n\nI think you're right, they are in their own little world.",
              "id": 246,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "This could have been the wedding to remember for all the right reasons, but no. There had to be foot-stomping and pouting instead.",
          "id": 247,
          "comments": [
            {
              "score": 9,
              "content": "Welp, now it's going to never be forgotten for all the wrong reasons. They will get that attention they wanted I guess.",
              "id": 248,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1211,
      "content": "These posts about \"stealing our spotlight\"  just baffle me. I can't for the life of me remember a wedding I've been to where all we talked about was the bride and groom. All attention on them during the ceremony itself, the toasts, and other rituals? Of course. But at the reception, I'm catching up with people I don't see often, talking about what's going on in our lives, etc. Brides and grooms are delusional if they think they should be our only topic of discussion.",
      "id": 249,
      "comments": [
        {
          "score": 245,
          "content": "I always thought the weddings were really more for the families honestly. The bride and groom are just busily going through the motions while everyone just gets to party!",
          "id": 250,
          "comments": [
            {
              "score": 26,
              "content": "That's how my wife and I approached our wedding. The wedding was a party we were hosting for our friends and family, and so a lot of the decisions were based on that. We had been guests to plenty of weddings and knew that to make a wedding fun for everyone you needed good food, good music, and alcohol. So that's what our budget primarily went to.\n\nEveryone had a blast, and that was the point.",
              "id": 251,
              "comments": [
                {
                  "score": 13,
                  "content": "Same here. It was busy at first for my wife and I, pictures, ceremony, more pictures, go the reception site, great some guests, eat, pictures, greet more people. But once all the traditional shit was over, it was just a big party. If a kid was born right on the dance floor, I don't think we would have cared. I mean, beyond probably calling an ambulance.... like, 'hey, someone help this lady, she just had a kid! Cheers to babies!'",
                  "id": 252,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "That’s how Asian weddings are. I’m Asian American and reading about the self-centered entitlement of western weddings on this sub make me 100% sure I’ll have a Filipino wedding when I get married. With lechon 🍎🐖",
              "id": 253,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Reddit has opened my eyes to how ridiculous some people are. I got married as a young, likely selfish, white Western human and I still thought about my family in all the planning. I made sure there were rooms for nursing moms at the venue, I deliberately found roles for every single one of my (young) nieces and nephews in the wedding and turned my bridal room into a comfortable nap and movie room for any tired kiddos. I encouraged people to wear whatever was comfortable, even the bridal party. We had plenty of parking and paid for people to get transportation. We asked around for food restrictions. We had the photographer take some nice family photos for all of my husband’s siblings and children. And honestly, if I did it again, I would make it even less formal and more fun. I can’t *imagine* the mindset some people have. I love my family and friends. Like ???",
              "id": 254,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I don't get it either. I'm getting married in a few months and my fiance and I don't want to be the focus of attention at all,and we're counting on the free bar and our dog to distract people 🤣",
          "id": 255,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "It starts out with “someone proposed at my wedding and I got mad” and everyone says NTA cos it’s your special day and they’re stealing the spotlight. Fair enough.\n\nSadly it’s now snowballed and evolved to anyone doing anything outside of the bride and grooms express wishes makes them an asshole. Even having a baby, apparently,",
          "id": 256,
          "comments": [
            {
              "score": 18,
              "content": "Exactly.\n\nThere is a clear taboo against someone purposefully making use of the large gathering you’ve planned and paid for to make themselves center of attention instead of you without your permission (like a proposal, planned pregnancy announcement, etc). That’s a conscious choice to take attention from the hosts and there’s no reason to do it at that moment other than wanting to draw attention.\n\nThere’s no taboo against being a real person with a real life in which real events happen. Guests will be pregnant. If it’s noticeable, they have no choice but to be openly pregnant and accept any congratulations they receive. Guests may be recently engaged, or new homeowners, or new parents, or newly graduated or promoted, and there’s no reason they shouldn’t talk about those things! That’s just what humans do in social situations, and anyone who doesn’t want that should invite a room full of mannequins instead of human guests. It would also save on catering costs.",
              "id": 257,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    }
  ]
}