{
  "post content": "Okay, I know the title makes it sound like I'm some kind of monster, but hear me out! (Throwaway account btw)\n\nA little background; I'm a teenage girl with two parents who had been together for 31 years. Exactly 1 month ago my mom found out that my dad had been cheating on her with some random woman for over a year(!) She threw him out of the house within 2 days and packed all of his belongings. Now it's just the two of us at home, but I still have contact with my dad. \n\nSo obviously, my dad is feeling very embarrassed and guilty (as he should), and he's trying to be as kind as possible so as to not upset me or my mom even more. He knows he won't ever get on my mom's good side again, so he's trying with me. \n\nI'm taking advantage of his weak state, not because I want to punish him, but because I feel like I deserve it. He's made me suffer so much, it's only fair he pays me back for the damage he's caused to out family. And it's not like I'm sucking all his money out of him, he has plenty more than mom and I do! \n\nI guess my question is.. AITA for taking advantage of my dad and making him give me tons of money and gifts? \n\n\\*sorry of this doesn't include enough info.. I hope it's enough",
  "id": 1,
  "comments": [
    {
      "score": 16,
      "content": "I guess ESH since his cheating started it, but is it really a question if you're being TA when you describe it as \"taking advantage of his weak state?\"",
      "id": 2,
      "comments": [
        {
          "score": -1,
          "content": "I guess I didn't want to admit to myself that I was being toxic, I'll work on it",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "YTA. Your family is in crisis here and your focus is on gifts/money. Albeit, it’s probably much easier to think about those things than it is to think about what’s really going on and how you feel about it. My heart goes out to you in that one!!",
      "id": 4,
      "comments": [
        {
          "score": 0,
          "content": "I try and be there for my mom as much as possible, but there's not really anyone there for me (my mom is sad all the time, and I haven't told nay of ym friends about it). so I suppose I just try and comfort myself with gifts. thanks for the feedback.",
          "id": 5,
          "comments": [
            {
              "score": 3,
              "content": "For sure understandable. Gifts will only comfort you temporarily. You should reach out for some support so you can feel comfortable and happy long term! Other relatives, school counselor, religious leader, might offer something for you!",
              "id": 6,
              "comments": [
                {
                  "score": 1,
                  "content": "thanks :)",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "YTA\n\n“I’m taking advantage of his weak state”",
      "id": 8,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "Yes, obviously YTA, you drippy biscuit.",
      "id": 9,
      "comments": [
        {
          "score": 2,
          "content": "r/rareinsults Can I use this?",
          "id": 10,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "well damn okay haha, thanks for telling me",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "INFO - Can you give me specific examples of how you're \"taking advantage of him?\" \n\nI think it's NAH If it means that he's treating you out to dinner / offering to buy you things and you say \"yes\"\n\nIf you're asking for money/ expesnive shit knowing that your using his guilt that's YTA. You're making the hurt and pain transactionaly with money and I don't think it healthy for either of you.",
      "id": 12,
      "comments": [
        {
          "score": 0,
          "content": "well.. he often takes the initiative to go out to dinner and to the movies with me, since he misses me I guess. and I often say yes because.. free food, right? and to be fair I miss him too. but sometimes when I've spent a bit too much money on useless stuff I ask him for some extra.",
          "id": 13,
          "comments": [
            {
              "score": 2,
              "content": "Was your relationship with dad like this before the cheating? Did you used to ask for money?",
              "id": 14,
              "comments": [
                {
                  "score": -1,
                  "content": "I did sometimes, just not as easily I guess. he's a pretty generous person, and we did go to the movies before we found out about his secret. we had a pretty good relationship, and I want to keep it that way but for now it' just very awkward",
                  "id": 15,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Are you still feeling mad at your dad for the cheating and do you feel like you're expressing that by asking for money?",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "YTA",
      "id": 17,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "YTA. You already sound entitled enough, the last thing you need is for him to spoil you even more. I like how you wanted us to hear you out but you didn't say anything that make you seem any less of a monster than the title implies.",
      "id": 18,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "YTA, and you know it.\n\nYour dad and your mom are going through a lot. You taking advantage of the situation isn't warranted. \n\nYou're simply looking for cheap and short-term benefit, based on what is going on right now. \n\nStop it and support your family as best you can as everyone goes through a very rough time.",
      "id": 19,
      "comments": [
        {
          "score": 0,
          "content": "i am supporting my mom as much as I can.. I just have. hard time finding a reason as to why I should support my dad as well. I've done wrong, and I realize that now. but I just can't really see myself sitting there and letting him.. support himself on my shoulder when he's the one who caused all this in the first place",
          "id": 20,
          "comments": [
            {
              "score": 1,
              "content": "Yep, he made a mistake. A BIG one.\n\nBut he's still your dad.\n\nYou need to decide for yourself if that's worth enough to you to continue on your relationship with him, and at what level and manner. There's no right answer here. You are justified in cutting off all ties with him forever. You are also justified if you continue to love him and want him to be an important part of your life. Or something in between. It's up to you...no one gets to tell you how to feel. \n\nYou do not, however, get to play him for money and gifts without being an asshole.",
              "id": 21,
              "comments": [
                {
                  "score": 1,
                  "content": "okay, thanks for the feedback. I'll stop.",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOkay, I know the title makes it sound like I'm some kind of monster, but hear me out! (Throwaway account btw)\n\nA little background; I'm a teenage girl with two parents who had been together for 31 years. Exactly 1 month ago my mom found out that my dad had been cheating on her with some random woman for over a year(!) She threw him out of the house within 2 days and packed all of his belongings. Now it's just the two of us at home, but I still have contact with my dad. \n\nSo obviously, my dad is feeling very embarrassed and guilty (as he should), and he's trying to be as kind as possible so as to not upset me or my mom even more. He knows he won't ever get on my mom's good side again, so he's trying with me. \n\nI'm taking advantage of his weak state, not because I want to punish him, but because I feel like I deserve it. He's made me suffer so much, it's only fair he pays me back for the damage he's caused to out family. And it's not like I'm sucking all his money out of him, he has plenty more than mom and I do! \n\nI guess my question is.. AITA for taking advantage of my dad and making him give me tons of money and gifts? \n\n\\*sorry of this doesn't include enough info.. I hope it's enough\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 23,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 24,
      "comments": [],
      "relation": "No"
    }
  ]
}