{
  "post content": "We live in a multi-generational household so on the weekends everyone is home. I’m 8 months pregnant, already very uncomfortable as it is, so I try to do what I can to find comfort here and there. \n\nOn the weekends I tend to spend a lot of time in our room because in here I can be bra-less, wear tanks, crop pants whatever. We’re conservative Hindus so this is not necessarily appropriate to do among the overall household but even if it was, I wouldn’t feel okay doing it.\n\nMy husband asked me to start spending the day downstairs on weekends because he thinks it’s not fair of me to be holed up all day and leave our toddler to him and his parents. He helps a lot with our toddler, he pointed out that he spends half the day with her on weekdays. Which is true. I’m responsible for her nap time, bath time, night time routine and bed time, but he gives her lunch, plays with her outside in the evenings. He is currently waiting for a new job to start and I have quite a bit of summer studying to get through as I’m a full time student, so this has been working for us the past few weeks. \n\nToday he asked me to stay downstairs on the weekends despite me being uncomfortable because he said it’s not a huge ask. And honestly it’s not, but I am big pregnant and uncomfortable. He wants me to especially be downstairs when his mom cooks on the weekends  because our toddler is really attached to her grandmother and gets in the way. I completely completely understand this and do what I can to keep our toddler away from my mil on the weekdays after she gets home. I’ve asked him all he has to do is bring her up here on the weekends, she has toys here and we play. I also have sciatica so when it flares up I try to avoid the stairs as much as possible, like today. And I was sick with covid for about 10 days through the end of May, so I still have random intermittent symptoms pop up.\n\nI’m currently on summer break for another 3 weeks but am full time in a very rigorous professional degree program. I will be giving birth at the start of the semester and will not be able to take any time off. So I’m also just trying to relax as much as I can now because I know it won’t be possible later. \n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 20,
      "content": "NAH \n\nI can see this from both sides. Your husband is doing the majority of the work it seems. But on top of pregnancy you also have sciatica and a full study load. \n\nYou’ve offered a compromise where you watch your toddler in your room. \n\nAnother alternative; could you stay downstairs with the family in the morning, and rest after lunch?",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": "He’s definitely been doing a lot more the last 2 weeks, I am so grateful for that, because I definitely need a break. We try to split up childcare as much as possible, and up until about a month ago I’d been handling most everything on my own since he’d get in around midnight-1am from work. He has always watched her for the most part on the weekends since he’d get such little time with her on the weekdays. \n\nSo I have been staying downstairs until breakfast/coffee on the weekends (mostly the last 2 after I got better) then heading up to relax. It’s never really been the entire day upstairs, except today where I was upstairs from 1130 onwards.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "I mean I was getting ready to ask why your daughter doesn’t just spend some time with you in the bedroom on the weekends, but you already covered that when you said you’ve suggested that to your husband. It seems like the obvious solution, and a fair compromise. If you weren’t willing to do that, my vote would have gone a different way, but you’ve already offered to accommodate the problem in a way that works with your pregnancy and comfort. \n\nNTA",
      "id": 4,
      "comments": [
        {
          "score": 2,
          "content": "Thank you! I wasn’t sure if I was being completely unreasonable but honestly under the circumstances I felt justified in wanting a day to myself where I didn’t have to be available for everyone. Which is pretty much how I feel on the weekdays especially but also just in general. \n\nMy husband complains about that too sometimes, that he’s always doing something for someone else. He does a lot around the house, a lot of errands for his parents and grandparents, things for me and our daughter. In addition to his own stressful/demanding career. I feel the same way sometimes but these are active choices we’ve both made. But I still do understand him wanting me to take our toddler today for a bit, I just don’t understand why he expected me to come downstairs when she would have been perfectly happy upstairs with me and I could have still been comfortable.\n\nI think he’s not liking being solely at home as he has been the past month, a lot of things come up when you’re home and I think he’s still adjusting to that.",
          "id": 5,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "INFO, sorry if it's my bad reading comprehension, but what would be the issue with you watching the toddler while you're upstairs and comfortable?",
      "id": 6,
      "comments": [
        {
          "score": 1,
          "content": "[deleted]",
          "id": 7,
          "comments": [
            {
              "score": 3,
              "content": "I think PinkDog is asking why the husband doesn't feel that's an acceptable solution",
              "id": 8,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "After seeing your clarifying comments, you're totally NTA. You're trying to stay comfortable during a difficult time and you've offered a reasonable compromise!",
      "id": 9,
      "comments": [
        {
          "score": 15,
          "content": "Also a part of me thinks if I was a man and had to do the amount of studying I need to, no one would even be asking me anything. Let alone the fact that I’m pregnant, studying, and also of course everything else related to being a mom.",
          "id": 10,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Thank you! I feel sometimes no one realizes that I’m effectively a SAHM, a full time medical student (so studying around my household/childcare responsibilities), and that I’m doing a million things at the same time in one or two hours during each weekday for others so I can study in peace later. Up until my husband quit his job I was doing childcare things (barring feeding her dinner) on my own because he’d get home around midnight. \n\nMy husband is a good man, he can just be really stubborn and not sensitive to my needs sometimes. I’ve had to remind him a few times that he went through medical school, he knows how difficult it is. And to now imagine doing that with a child, with in laws expecting things, and the responsibilities of being married to someone with a demanding schedule that requires me to manage his life. I made the decision to go to medical school but everyone supported me and agreed to support me. It doesn’t always feel like that though.",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA. I was sympathetic towards your husband until you posted what you both are responsible for during the week. I still don’t think he’s a massive AH, but giving a kid lunch and playing outside is different from handling bath and bedtime and the stuff that a kid usually has no interest in doing, even if it’s equal time. So it’s not like you’re doing nothing. Yes, it sucks that he has weekend duty. But he has his parents so he’s not alone and you’re growing a CHILD. It’s summer and hot and you’re at the tail end of a pregnancy. If you weren’t pregnant that would be one thing but even then I would say have the toddler come hang out with you because I don’t get why everyone in a house has to hang out all the time.",
      "id": 12,
      "comments": [
        {
          "score": 2,
          "content": "Thank you! He has definitely stepped up since he quit his job to pursue his own practice. I do feel guilty at times that I’ve been relying on him more than usual lately, but I don’t think I would have as heavily if it hadn’t been for covid+pregnancy. \n\nYour last line is amazing. I live with 6 other adults so it can be difficult to find some privacy at times, but at times it can also feel like I’ve gone days without seeing anyone. Luckily we all have our own spaces we can retreat to. I also am not a huge fan of everyone always hanging out en masse in general. But I’ve been in quarantine effectively since March and everyone else, except for my grandparents in law, have been leaving the house to go to work and grocery, etc. I’ve gone to the doctor, the hospital, and to the Burger King drive through with my husband. So I’m also definitely just tired of seeing everyone all the time.",
          "id": 13,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA, you offered a compromise.",
      "id": 14,
      "comments": [
        {
          "score": 1,
          "content": "Thank you! I definitely felt bad saying no, but I really just didn’t want to. Any other time I likely would have just gone downstairs, but I was so exhausted today with a number of things and I don’t think it was an unreasonable compromise I presented after I told him why.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA. It's literally the middle of June and you're growing HIS child in your body. He should have some compassion and leave you alone. You'll have a lot to do when the newborn comes and you deserve to relax every chance you get!! He should stop being so insensitive. You have to endure hours of pain and years of responsibility for these children, you can take some time during your week to relax, he should realize that you won't really get to relax after you give birth. It's hot as heck and you have a human pushing around all your organs. Tell him to politely shove it.",
      "id": 16,
      "comments": [
        {
          "score": 1,
          "content": "Thank you! I think he’s been getting overwhelmed the last month because I was in isolation due to covid and I’m still intermittently getting symptoms so I do rely on him a little more than I would have otherwise if he was just home. He’s been doing a lot and I think he’s overwhelmed. However I don’t think that excuses him not being able to sympathize with me today.\n\nIt is soooo hot. My grandmother in-law is convinced AC makes her arthritis worse so we keep the temp\na little on the higher side so I have really been feeling the heat. And I had a fever most of the day today so I’m sure that didn’t help with being hot, it finally broke and I feel human again.",
          "id": 17,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Eh, making my judgement NAH. Both are stressed about various things. And I think they'll work it out.\n\nInfo: So kiddo being upstairs for a few hours is no go. What about you spending lunch to dinner downstairs, and mornings upstairs? That way you're only half the day uncomfortable?",
      "id": 18,
      "comments": [
        {
          "score": 3,
          "content": "That’s a good idea! I guess I was just so unwilling to compromise today especially on bad days (like today). I forgot to mention I’m also getting over covid still. I’ll randomly have weird days where I get chills, tummy issues, extreme exhaustion. Unfortunately today was one of those days. I was sick from like May 20ish to the end of May. So me being isolated definitely threw off our schedule. I’m not sick anymore but get random weird things time to time. I power through if they happen on the weekdays.",
          "id": 19,
          "comments": [
            {
              "score": 2,
              "content": "I'm glad you like the sound of that! And oof, congrats on the recovery. No wonder hubs is so stressed. I hope it goes well, and ya'll figure something out til the baby arrives. And good luck to ya'll after, too. :)",
              "id": 20,
              "comments": [
                {
                  "score": 2,
                  "content": "Thank you for your kind words and wishes! Yeah I do feel bad for him, it’s been a month of a lot more responsibility for him. Honestly if I hadn’t gotten covid (which I likely caught from my mil or bil who are also both doctors seeing hospital patients) I don’t think our schedule would be so out of whack, barring the pregnancy related issues of course. \n\nI’m hoping to get back into my normal weekday/weekend schedule soon, and he can maybe just take her for breakfast and playtime and I can have her the rest of the day so I still get some extra time. We’ll see! \n\nI should probably start thinking about how to manage with a newborn and toddler and everything else. But as of a few hours ago, my mom has offered to come stay with us for the 2 months after I give birth. My mil is amazing but she works full time so I didn’t really feel comfortable relying on her any more than I already do. And we no longer have the nanny we had planned to hire because it doesn’t feel safe to expose others or ourselves any further. My parents are retired so their time is much more flexible but my dad can’t come as my younger siblings are starting high school. \n\nI guess in a way this whole thing ended up working out because I was hesitant to ask my parents to come, but today I felt the push to finally ask and I’m glad I did! I’m looking forward to having my mom with me (she couldn’t be with me the first time because her dad was really sick unfortunately and she was his primary caregiver).",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWe live in a multi-generational household so on the weekends everyone is home. I’m 8 months pregnant, already very uncomfortable as it is, so I try to do what I can to find comfort here and there. \n\nOn the weekends I tend to spend a lot of time in our room because in here I can be bra-less, wear tanks, crop pants whatever. We’re Indian so this is not necessarily appropriate to do among the overall household but even if it was, I wouldn’t feel okay doing it.\n\nMy husband asked me to start spending the day downstairs on weekends because he thinks it’s not fair of me to be holed up all day and leave our toddler to him and his parents. He helps a lot with our toddler, he pointed out that he spends the entire day during the week with her as well. Which is true. I’m responsible for her nap time, bath time, night time routine and bed time, but he does everything else. He is currently waiting for a new job to start and I have quite a bit of summer studying to get through as I’m a full time student.\n\nHe wants me to stay downstairs on the weekends despite me being uncomfortable because he said it’s not a huge asks. And honestly it’s not, but I am big pregnant and uncomfortable. He wants me to especially be downstairs when his mom cooks because our toddler is really attached to her grandmother and gets in the way. I completely completely understand this and do what I can to keep our toddler away from my mil on the weekdays after she gets home. I’ve asked him all he has to do is bring her up here on the weekends, she has toys here and we play. I also have sciatica so when it flares up I try to avoid the stairs as much as possible. \n\nI’m currently on summer break for another 3 weeks but am full time in a very rigorous professional degree program. I will be giving birth at the start of the semester and will not be able to take any time off. So I’m also just trying to relax as much as I can now because I know it won’t be possible later. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 22,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nHelp keep the sub engaging!  \n\n#Don’t downvote assholes! \n\n\nDo upvote interesting posts!\n\n[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 23,
      "comments": [],
      "relation": "No"
    }
  ]
}