{
  "post content": "So Zelda: Tears of the Kingdom came out today on the Nintendo Switch and I have been looking forward to, and planning for, this game for years. Zelda has always held a place in my heart where I can escape the mundane of daily life, especially as an adult who works a full time job, pays the bills, etc.\n\nNo kids in the household it’s just me and my wife. Starting 6 or so months ago I told my wife that when this game came out I would essentially become and hermit and go into a hole for the entire weekend of its release. I would eat, sleep, breathe Zelda. I continued to reiterate to her my plans every time the topic came up and even more so as the game got closer to release. I took time off of work as I put this on my work calendar as soon as I knew the launch date.\n\nFast forward to earlier this week, I reminded her again that I would essentially disappear this weekend to do what I want to do which is to play the new game all weekend. She then plans a movie night with a bunch of neighbors for tonight, on launch day. I made sure to clean up the house, do the dishes and even did like 4 loads of laundry and re-organized the linen closet in preparation for this weekend. The time for the party rolled around and I took a break from playing, made all the popcorn and set everything up in our home theater for her and then went back to play my game. As guests showed up I welcomed them in and showed them the way to the theater room and continued to play my game. When the movie was over I greeted them again as they left and then I helped clean up the kitchen on another short break. \n\nFast forward to now, my wife is mad at me for playing my game downstairs while she hosted the movie night alone. She said it was weird and stupid that I couldn’t carve out a couple hours for this movie night. It’s just a stupid video game she is saying. I reminded her that I made my plans for this weekend months ago and that what I did doesn’t contradict what I’ve been telling her I would do for months now. So AITA for playing my new game while she hosted the movie night?",
  "id": 1,
  "comments": [
    {
      "score": 12723,
      "content": "NTA. She arranged this when she had known for months what your plans were. You did a lot of preparation for her event, took breaks to speak to her guests and even helped to clean up after her event. She's being utterly unreasonable.\n\n>She said it was weird and stupid that I couldn’t carve out a couple hours for this movie night.\n\nI'm afraid that this was done deliberately.\n\n>It’s just a stupid video game she is saying.\n\nYes, deliberately.",
      "id": 2,
      "comments": [
        {
          "score": 5676,
          "content": "If it's just a stupid video game, then it's just a stupid movie. OP is a better partner than me. I would've been like \"Cool babe, have fun.\" And disappeared until after everyone else had left.",
          "id": 3,
          "comments": [
            {
              "score": 1680,
              "content": "Right??? And if op did that he would still be NTA , imo",
              "id": 4,
              "comments": [
                {
                  "score": 291,
                  "content": "I'd get a bj and a pat on the head for organizing the linen closet. What the hell lady?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1331,
                      "content": "The bar is so low...",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 192,
                      "content": "Would you give a bj/eat out if your partner did it?\nGiving and getting sex as payment for stuff that needs to be done anyways is such a Bonobo-thing to do",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 48,
                      "content": "yeah i hope this is a joke",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 47,
                      "content": "Damn, is your wife single?",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 30,
                      "content": "You expect a parade for doing the bare minimum? This is so shocking",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "Is the pat on the head before or after the bj?",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "Typing that up didn't feel like a bummer at all?",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Do you need to be rewarded to preform basic household tasks?",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Why did people upvote this comment so much, I thought for sure I’d be downvoted",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "that’s sad, not something to brag about. you’re meant to help our around the home because it’s your home as well not for a BJ.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 138,
              "content": "I am glad this thought was up here. Now I don’t have to say it. OP is a better partner than me, because I would have locked myself in a room and not have done anything to help at all. She is being unreasonable to expect you to change your plans because she wants to entertain people. NTA",
              "id": 16,
              "comments": [
                {
                  "score": 50,
                  "content": "But does she really want to entertain people? The whole planning of this, and the comments afterwards WTF. I think the plan all along was to do whatever the heck she could to ruin his weekend that he told her he was going to have. Who knows why maybe she doesn’t like video games, maybe she just Hass to be the center of attention at all times, I can’t believe the lengths OP went to to help for this movie party. what a gracious and kind husband. I hope that doesn’t make him the perfect victim for this monster he married. Perhaps he should look back and see if there are other signs…",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 104,
              "content": "And locked the door just in case someone wants to get friendly and come to great me.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "The gamer in me is seething. I get having an event if you are lonely because gamer partner is occupied but don't assume they need to stop their plans for yours.\n\nMy SO gets a new obsession game and I know what my next week will look like.\n\nI love when my SO puts a plate in front of me and suddenly I remember I haven't eaten all day because ... leveling on my MMO.",
              "id": 19,
              "comments": [
                {
                  "score": 2,
                  "content": "I like video games but I'm not a new release person. I kinda get the hype but it's not for me. Its a little silly that my friend took PTO for this. I'm not going to be a dick about it. Whenever he emerges again I'll ask how fun it was. Its just about respecting other people and being nice to them, especially if you want to keep them around.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "Hey i agree with the wife that it is a stupid game (not specific to this game) TO ME!! But it is NOT a stupid game to OP which is all that matters in this case. It is not like he dropped this bomb after wife had planned something for them. He has been planning and reminding her for months. She did this to try to force him and it backfired so now she is upset. Too bad so sad, her problem. NTA!",
              "id": 21,
              "comments": [
                {
                  "score": 13,
                  "content": "I let my bf play this exact game all day this weekend and left to meet up with the girls. That's how you respect your partner in a relationship, you don't pester them do only do YOUR thing.\n\nETA \"let\" is not the right word but yall get the idea I hope",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "yep! i would have done exactly the same thing.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Omg good point lol it’s just a stupid movie",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "[removed]",
              "id": 25,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "I would have done the same. No popcorn, no greeting anyone. She wants to play host when i told her about my plans, fine. But I wouldn't be a part of it at all. And demeaning something important to him just because she didn't get her way is fucking shitty. NTA OP.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Goddamn, the man's a hero. If I were the wife I'd be bragging and grateful, not complaining.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 691,
          "content": "Yeah, this was absolutely a power move and a test. She went looking for a fight and surprise surprise is annoyed that OP held his boundaries and didn't just fall into line.",
          "id": 28,
          "comments": [
            {
              "score": 233,
              "content": "Totally a power move and a test, but I don't think is just to fight. Many people are so insecure they do this just to test if they are 'more important than...' and the more emphasis you put on how important it is for you, they get more mad. But is just my opinion and maybe you are right and she is trying to control even his free time.\n\nOP is NTA.",
              "id": 29,
              "comments": [
                {
                  "score": 105,
                  "content": "^ I agree with AwesomeBeardProphet (fantastic username, btw). I have a friend who married someone like this. His wife is lovely in many ways, but her insecurity is *exhausting*. She’s always doing these little “tests” to make sure my friend loves her above anything and everything, and flips out if he doesn’t meet her standards. She even knows she does this, and consistently blames it on childhood trauma. And woe to him if her birthday and Mother’s Day aren’t celebrated “enough” for her. The insecurity is just so deep. It’s crazy, because they’ve been together for over 15 years, and he’s so obviously head over heels for her. \n\nAnyway, OP, you are NTA.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 50,
                      "content": "That poor guy's life must be hell behind closed doors",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Get her checked for borderline personality disorder 0/ therapy could help",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "this is true and sad",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "The very first sentence, \"I've been planning for this for *years.*\"  And he's been reminding her for months.  It isn't like he sprung this on her.  He cleaned house, did laundry, made snacks, welcomed guests, helped clean up after... Absolutely NTA, I agree, I think she planned it for this night just to see if he'd bend.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "[removed]",
              "id": 35,
              "comments": [
                {
                  "score": 4,
                  "content": "This is the best comment!",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 506,
          "content": "It was very deliberate. Throwing an actual party at the house on the one night he asked to keep clear was bad enough but guilt tripping him for not participating after railroading him into it was laugh-in-her-face ridiculous. I wouldn’t have lifted a finger to prepare for a party that was forced on me out of spite. OP is a saint for putting up with it but she’s the one that’s mad now? These are not the actions of a person who loves and respects you, OP.",
          "id": 37,
          "comments": [
            {
              "score": 40,
              "content": "I think if she didn't have the expectation that he would join, then it's not really an AH move of her to plan an event. It's not like it was a raging party, it was a movie night. It's plenty feasible that he could be in one area alone playing the game, and her gathering in a separate room watching a movie and hanging out with friends. My husband has company over from time to time and all I want to do is be upstairs alone in the bedroom watching a tv show, and that's fine.",
              "id": 38,
              "comments": [
                {
                  "score": 49,
                  "content": "Making her own plans while he plays Zelda all weekend is totally understandable but I do still think having a gathering at the house on that specific night at the last minute after months of forewarning is assholey. OP described wanting to be a hermit. The movie night put him in the position of seeming rude for not joining in. It’s not relaxing, which then ruins his plans to chill in solitude. I know it’s her house too but they could’ve gone to a bar or the neighbours’ house if they really wanted to meet up that night.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I guess it would depend on the premise she gave her friends. We live in a somewhat bigger place and most of my husband's friends live in the dorms on a military base, so not conducive to hosting. If he had hosted his friends and told them I'd be upstairs on my own, I think it would be understood that I'm not gonna join them and that's okay. Honestly, that's why I wouldn't bother showing face and greeting people, OP is kinder than I am in that way, lol.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 254,
          "content": "This was a power move for sure. She wants him to drop his hobby altogether so she can dictate how they spend their free time.",
          "id": 41,
          "comments": [
            {
              "score": 106,
              "content": "Her free time. He has none",
              "id": 42,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 221,
          "content": "Exactly!\n\nWhile I don’t get the excitement around a video game, he made it extremely clear to her how important it is to him, helped around the house even when she made these movie plans last moment. OP was not consulted before inviting them over.\n\nNTA",
          "id": 43,
          "comments": [
            {
              "score": 252,
              "content": "It's like being able to spend hours uninterrupted with a brand new book in a series you'd been waiting years for, or a sports game where the two teams are like... celebrity players or something (I know in Cricket they did it a while back, I think it was a charity event and all the players had microphones and would do ground commentary, it was most excellent even though I wasn't an avid cricket fan). The next installment of your favourite movie series. Basically trying to quantify it so its relatable.\n\nI personally have done midnight launches for games (can't do that anymore, I have a child and more on the way.... though I suspect in the next few years I *will* be doing it again, but for my son's sake because he's a gamer rofl). I can definitely understand the hype after Zelda: Breath of the Wild was so critically successful.\n\nOP is NTA and the wife had been warned well in advance.",
              "id": 44,
              "comments": [
                {
                  "score": 202,
                  "content": "I was in line at GameStop one night waiting for the midnight release of a World of Warcraft expansion to get released. Three young guys in front of me one woman behind me. The woman tried to strike up a conversation by saying something like ‘the things we do for our kids huh?’ I just laughed and said ‘ well mine doesn’t play. This is for me!’ She pointedly ignored me the rest of the time while the three guys were impressed and we talked about the xpac for the rest of the time. Guess she wasn’t interested in a 50something gamer chick LOL",
                  "id": 45,
                  "comments": [
                    {
                      "score": 132,
                      "content": "50 something gamer chick here and you’re so right about when people find out I still play video games",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "I was in line for the new Zelda a couple of night ago, with and for my son. There were people there of all ages, from middle aged to kids. There were people my age and older getting the game for themselves, that had played since the original came out. Fun stuff!",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Shoot , my husband takes expansion week off ( I used too when I worked). and we both play. I plan ahead, make chicken salad, egg salad, tuna salad ahead of time. Rice Krispies bars. No real cooking, and paper plates only for that time lol.",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "60+ gamer here. I bought a PS5 a couple days before Burning Shores dropped and my wife just laughed and said, \"So I'll see you sometime on Saturday maybe?\", with a reminder not to spoil anything because she planned to play it as soon as I was done. She even brought me sandwiches and bottled water throughout those couple of days (unasked). Lovely woman. I returned the favor and fed and watered her when she played it a few days later.\n\nWe've both been playing video games for 40 years with no plan to stop. Ever.\n\nI get into the same conversations at GameStop when people tell me how much my kids or grandkids must love me. \"Nope, these are all for me.\" lol",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Seeing this post is a funny coincidence, cos I was just looking at the Zelda edition Switch and thinking “should I get that...?” (and the 2 Zelda games) knowing the new game just got released.\n\nThis post is like the universe going “you **should** get that...”  \n(I’m always feeling like there’s a video game hole in my life and wondering “should I get a PS, should I get an XBox, should I get a Switch?” but then I feel like I don’t have the “right” to be a gamer, so I let it drop for a while before starting again with the wondering.)\n\nThanks OP! And NTA.\n\nedit: formatting",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "The day after the last Harry Potter book came out, my friends dragged me to a birthday party for one of their friends. I told them \"I will be reading this book all day and all night,\" as I had been doing since midnight when I bought it. They didn't believe me and I didn't know how to stand up for myself yet, so I went with them and then spent the entire party on the couch reading my book. They were annoyed and called me a nerd (fair) but like... I told them what I would be doing, and I did exactly that.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "You will totally be doing this for your son! My kiddo is 14 and his dad told him to hurry home from the bus and surprised him by throwing some drinks and snacks in a cooler, then heading out to GameStop so they got a good place in line. Kid was stoked, dad was so excited to have his lil buddy back for a few hours rather than the teenager he's been lately. Then Friday morning, as my son was about to leave for school his dad says where you going? I thought you'd want to stay home today! So they got to do breakfast and my kid got to hook his switch up to the big screen, they both had a blast it was so cute.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Everyone hopefully has had things they anticipated and just wanted to enjoy. The next Harry Potter book or Outlander book. I know I just want to read. Has this woman no hobbies, interests, or anything independent of her husband???",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "I gave two of my employees the day off just so they could spend the entire day-beginning at midnight-to play Zelda. They have been talking about nothing else for a week!!! I get it, tho I don’t play. NTA but the move by the wife was insecure or mean.",
              "id": 54,
              "comments": [
                {
                  "score": 1,
                  "content": "I mean I'm using every inch of my iron will not to buy a switch just for this game.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I would equate it to watching the football draft for my brothers, season opener in baseball, the Ryder Cup or British Open, the Olympics, Superbowl for much of the US, or the World Cup for the rest of the world.\n\nThese sports-related events have broad appeal to many, so while a game release might have a statistically smaller group, to them, it has an appeal.\n\nThink about the midnight parties for new Harry Potter books that were held, being in on a new release is exciting to many.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "He could have planned to do absolutely nothing, and would be NTA for not participating in her movie night.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 161,
          "content": "What is 'weird' is her planning this event when the game came out. Definitely a very deliberate AH move and a power play.",
          "id": 58,
          "comments": [
            {
              "score": 50,
              "content": "Exactly. When I read the title I thought the celebration was for their moms since it’s Mother’s Day weekend in the US. Fully expected OP to be a grown ass man who’s mom flew in for the weekend and he wanted to play a video game instead. I’m glad my assumptions were wrong. He’s definitely NTA here.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "[deleted]",
              "id": 60,
              "comments": [
                {
                  "score": 4,
                  "content": "That’s 100 percent fine . I don’t mind my girlfriend’s friends coming over and I’m chilling in another room . It’s both our house anyway . \n\nI would get annoyed though if I was busy and she wanted me to interact heavily with her for friends.",
                  "id": 61,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 88,
          "content": "Omg, Zelda is not just a stupid video game, either. It's amazing and the best.",
          "id": 62,
          "comments": [
            {
              "score": 33,
              "content": "I literally bought it for my husband yesterday while he was at work and he was so damn happy. Lots of people have been waiting for this game to come out.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I'm the same as OP, got the ink to show for it and I'm far too invested in the timeline theories and lore. I'm not like this with anything else. My partner? He was annoyed we only had one dock station so one of us would have to play the game handheld (already have another ordered to fix this), he didn't plan things to stop me enjoying myself like OPs weird wife. That's not supportive, it's demeaning a person based on interests and showing a jealousy over a game. She could have found a way to enjoy it too or planned a weekend for herself. NTA.",
              "id": 64,
              "comments": [
                {
                  "score": 3,
                  "content": "My husband and I are both gamers, so we support each other when releases like this come out. Like his last big release was the new Destiny Xpac. Oh no, the person I love enjoys a thing. I just did my own thing while the cats bothered both of us equally.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "We picked up gamestop docks so that every tv in the house can take a switch. Now we need a second switch.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "So true. Zelda is such an amazing franchise.",
              "id": 67,
              "comments": [
                {
                  "score": 16,
                  "content": "As someone who just bought an old DS to replay Minish Cap with LED backlighting. I concur.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Have fun playing Minish Cap. Always loved its graphics.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I bought a first gen GBA and the parts to install a LCD screen on it so I could play Minish Cap. It was super fun to do, and I added USB-C charging at the same time.",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Fuck yeah. I grew up with it and it was my escape from my extremely abusive household. \n\nWith that being said I really disliked the new Switch ones. It just wasn't the same. WHY DO MY WEAPONS KEEP BREAKING AND WHERE MY DUNGEONS AT???\n\nApparently I am an outlier though lol so never mind me.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 2,
                      "content": "So sorry you had to deal with that as a kid. That aside, I’m with you about the new Switch games. Hated the weapons system and no dungeons except the Divine Beasts. Never understood the hype for BOTW & TOTK.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "It could be ET for Atari, and it wouldn't matter. OP was abundantly clear with his wife about his plans for this weekend for *years*.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "And people who are married to people who play Zelda KNOW THIS!",
              "id": 74,
              "comments": [
                {
                  "score": 2,
                  "content": "My hubby took our kid out all morning so I could play lols :) we've been waiting for this for years!",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "also i feel like you can't complain if you plan a whole event by yourself that you have to host it yourself too. im sure op wouldve joined any other day if they decided to do this together but it was all her idea so its all her responsibility to entertain the guests",
          "id": 76,
          "comments": [
            {
              "score": 25,
              "content": "Yep. Its movie night, its simple; snacks, drinks, and push play. Clearly it wasn't that hard on her, she still did it, with support from her husband, but she didn't get what she wanted so now she's retaliating.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "Yup - power trip by her.\nNTA\nSTA 100%",
          "id": 78,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "She did this deliberately",
          "id": 79,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3635,
      "content": "NTA\n\nIll be the minority by saying regardless of what you were doing, you already planned it and told her said plans. You also did help with the party, so its not like you didnt do anything.",
      "id": 80,
      "comments": [
        {
          "score": 743,
          "content": "I agree. She could have picked any weekend for a movie night and picked the one she knew they had plans for.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 553,
          "content": "and I wouldn't even be helping with the party that was deliberately put together on a weekend I had very clearly stated I had plans and kept on reminding everyone around me I had plans...\n\nOP is NTA and a better person than me obviously 😂😂",
          "id": 82,
          "comments": [
            {
              "score": 167,
              "content": "This one made me laugh because I’m honestly in the exact situation with the opposite woman.  I have had a month long countdown for this videogame to come out, I told my girlfriend this and we decided I would go veg out in her bed all weekend while she made plans to do shit.  Last night I got off work, grabbed a six pack and put a blanket over my head while I played all night and she went out with a friend and brought me back sushi :)",
              "id": 83,
              "comments": [
                {
                  "score": 31,
                  "content": "Nice! This is how healthy relationships work. Good for you both!",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "First year of my relationship I told my wife that I'll be a hermit during a Path of Exile league start. She did her own stuff that weekend. 2nd league start she joined me and now this has become our ritual for the past 5 years lol.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 163,
          "content": "> I'll be the minority...\n\nNot posting on an online forum you won't be...",
          "id": 86,
          "comments": [
            {
              "score": 61,
              "content": "I was thinking I guess they haven't read the other comments!  😆",
              "id": 87,
              "comments": [
                {
                  "score": 23,
                  "content": "I was one of the first so i havent yet 🤣",
                  "id": 88,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Usually it's a toss up whether a man playing video games all weekend is going to get shit on here or not.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Oh you should check out the comments of the thread of the dad who golf's all the time... lol\nThis poor dude who wants to play this new video game reached a sore spot with everyone who has a hobby.  He did everything he could do to be a responsible adult and his wife tried her best to ruin the one thing he wanted to do for himself, taking nothing away from her.",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": "I was expecting something like OP was playing a game he/ she always plays and wife’s friend from across the country was in town for the first time in 3 years and wife planned a get together. THEN I could see hoping OP would step away from the video games for a few hours. I don’t think prior plans ALWAYS trump newer plans if the new ones are important to your partner. BUT omg this is the exacting opposite of that! The game was hugely important to OP and a movie night sounds like it could have been any night. Plus, like you said, OP DID step away and help a lot. She should be thanking OP not complaining.",
          "id": 91,
          "comments": [
            {
              "score": 69,
              "content": "I have to stop playing for mothers day, but it's just unfortunate that it coincides this weekend. \n\nBut if my husband planned a random event that wasn't because of a specific family obligation,  I'd be pretty livid.\n\nIt doesn't matter that it's a game, op had clearly stated he was setting time aside to engage in his hobby. If this was a grand final, eurovision, blood moon knitting circle - whatever the hobby is - OP would get entitled to utilise their hobby time",
              "id": 92,
              "comments": [
                {
                  "score": 6,
                  "content": "Nope I can't see you mum, I've planned this months in advance, I'm going to lock myself in my room and watch Eurovision",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Shh, the knitting circle is supposed to be secret!",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "There's a blood moon knitting circle???   \nWHY am I only just finding out about this NOW?!!?",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "And she choose one of the easiest, most non-involved get-togethers she could. Movie night.. Really? I mean if she was hosting a dinner party for 10 or so I could see some room for complaint. But movie night all you do is set out snacks, talk a bit, and push play, maybe a bit of community discussion afterwards.. Not really a huge hosting commitment. Bit of cleanup and bam you are done. This was definitely malevolent, and intended to disrupt. Passive-Aggressive make a choice me or the game stuff.\n\nNTA",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2577,
      "content": "[deleted]",
      "id": 97,
      "comments": [
        {
          "score": 621,
          "content": "Yeah, tbh I don't get the whole video games thing, but I swapped it in my head to the Rugby 6 nations final weekend and definitely understand where OP is coming from. \n\nNTA",
          "id": 98,
          "comments": [
            {
              "score": 223,
              "content": "Exactly, my partner knows I’m unavailable that weekend, at least until after Ireland play, and he makes other plans. NTA",
              "id": 99,
              "comments": [
                {
                  "score": 66,
                  "content": "I've had to miss it a few times due to mothers day/birthday and it's awful. One year we took her to see Mamma Mia in Dublin on the last Saturday and my heart was broken 💔",
                  "id": 100,
                  "comments": [
                    {
                      "score": 22,
                      "content": "That sucks, I hope your mother appreciated it.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "It can be applied to any hobby, OP had planned this, talked about this, and anticipated this game release for months and months. Then OP's wife chose the one weekend that OP had definite plans for to do this knowing all of what I said above.",
              "id": 102,
              "comments": [
                {
                  "score": 53,
                  "content": "To add to this, launch day is particularly exciting for gamers who play with friends or belong to any kind of fandom or even just really love the franchise. Yes you can play the game anytime but launch day is your only chance to be a part of the initial communal excitement, which is a lot of fun.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I totally agree with this my boyfriend was so upset he could not play zelda: totk on launch because we are on vacation so I bought the game for myself and told him he could play inbetween vacation activities and he was so happy with that solution. He has been waiting for this game for years just like OP did and you want to play it as soon as possible and be exited about the game with the rest of the fandom.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "Well, that's what I meant really. Video games aren't really thought of the same way as a sports tournament etc. Either way, OP had very clearly made plans",
                  "id": 105,
                  "comments": [
                    {
                      "score": 31,
                      "content": "I work for a rural ISP (Fixed Wireless/Satellite internet) and when Minecraft videos/streaming was just starting to take off, us Techs would be busy with \"Speed calls\" due to the increase in streaming and parents not understanding. \n\nWe all bashed on the kids for watching stupid videos, rather than playing them, but then I had an epiphany and realized, that this is just the new Hockey/Baseball, etc. and watching sports instead of playing is no different. \n\nNow I watch gaming videos and steams🤷 \n\nAnd there's even Excel E-Games out there, which I appreciate as I'm using Excel a lot more since my front line tech days. :-)",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Yeah, I was just adding more onto the point you made :)",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "That's exactly it, you don't **need** to understand why your partner is obsessed with this one thing. You just need to understand that it's as important to them as the thing **you're** crazy about.\n\nMy Mom LOVES musicals. My Dad LOVES Formula 1. They don't really appreciate each other's loves. My dad doesn't really get enjoyment out of musicals, my mom doesn't really get enjoyment out of the races. But they don't have to because they understand how important that thing is to the other person. \n\nThe wife's thing about how it's \"Just a stupid video game\" is a pretty clear sign that she's the bad guy in this scenario. She knows it isn't dumb to him, and she's refusing to accept it's as important as the dumb crap that she loves.\n\nIf we give this thing a generous read, she doesn't pay attention and she's oblivious. But to be honest this really reads like a childish power move to try and force him out of his weekend plans that he had for months in advance for what was absolutely non-emergency.",
              "id": 108,
              "comments": [
                {
                  "score": 33,
                  "content": "She probably thought he wouldn't actually follow through in front of the guests",
                  "id": 109,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Absolutely that was the plan. \n\n**\"You don't want to make a scene do you? Shouldn't you be polite in this scenario?\"**\n\nWhen your wife is using the same tactic that scammers use in public places, abusers use on the people they abuse, and literal rapists use to get their feet in the door, that wife is the asshole.\n\nIt's supremely shitty to do to someone, and you don't get to hide behind the \"it was just about a video game\" excuse for bringing out the move that violates the marriage Geneva Convention.",
                      "id": 110,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I respect that way of thinking. That's how important video games can be to people at times.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Fair, for some reference the games last entry won game of the year and is widely considered one of the best video games ever made, and has become the standard for its genre. This game is its direct sequel.",
              "id": 112,
              "comments": [
                {
                  "score": 20,
                  "content": "Yeah, that's really the point I'm making. Like if it was the World Cup, or anew Bond movie it would probably be considered 'more important'  but obviously this is a huge weekend for the gaming community. Just bc I, or others don't get it, doesn't make it so",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1410,
      "content": "NTA. Six months of repeatedly warning her should have really gotten the message over. ETA, after some thought I'm beginning to wonder if this was premeditated. Did she do this just to mess up your Zelda weekend with malice aforethought? If so, why? ETA 2 is this some kind of power play. \"I don't care about your Zelda weekend, you're going to do what I want!\" ?",
      "id": 114,
      "comments": [
        {
          "score": 481,
          "content": "I would have a really hard time believing it wasn’t premeditated purposefully to ruin OP’s plans because she isn’t a fan of his gaming hobby. Though I say that as someone who totally just did more or less the exact same thing but on accident. My husband and I both were planning on playing Tears of the Kingdom the entire weekend and I totally spaced and accepted an invite to a party tomorrow. He was… not stoked about it.",
          "id": 115,
          "comments": [
            {
              "score": 139,
              "content": "[deleted]",
              "id": 116,
              "comments": [
                {
                  "score": 28,
                  "content": "Or she's the kind of person who think video games are a loss of time.\n\nI mean, some people think video game are childish (ok boomer)... which is ridiculous : I prefer spending an evening with my gf playing a game and be active, talk about what we are doing etc than sit on my ass and watching a movie without interact with her.  \n\n\nThat's being said, I won't read this thread any further because the said gf and I must test Diablo 4 before the june release and also... yeah, Zelda :D",
                  "id": 117,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Looks like this is leading towards the Reddit default: time for a divorce.",
                  "id": 118,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 103,
          "content": "It was obvious that it was premeditated.\n\nHer comment of it was just a stupid video game proves it imo.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "MINOR TOTK SPOILERS FOR THE PURPOSE OF A JOKE\n\n\n\n>!She didn't do it with malice, it's gloom now!<\n\n\n\nMINOR TOTK SPOILERS FOR THE PURPOSE OF A JOKE",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 637,
      "content": "NTA. Wife tryna pull some shit… you did your part… and gave ample warning.",
      "id": 121,
      "comments": [
        {
          "score": 158,
          "content": "OP did far more than their part. Far, far more.\n\nHis wife did this just to cause problems. Absolutely no question about it.",
          "id": 122,
          "comments": [
            {
              "score": 6,
              "content": "I think OP might have suspected what his wife was trying to do and that's why he did so much. He took care of everything that he could so that if his wife were to have any complaints, they could only be about him playing a game.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Strip away the video games and everything else. If my wife planned a party at our house without running it by me first, I'd be a little mad. Like we both live in this house, I wouldn't just start planning to have people over without checking with her first. It's OUR home and OUR space and OUR time. You don't just get to make unilateral decisions because your decisions no longer just impact you, at least not when it comes to shared spaced. Assuming this wasn't intentional and she somehow forgot OP's plans for the day, her expectations of their involvement should have been shaped when she talked to OP about the party she was planning. I kinda get the sense he was told and not asked, which is inconsiderate.\n\nNTA",
          "id": 124,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 499,
      "content": "You’re NTA. \n\nYou had important plans for you that you were clear about for a long time and which were dictated by the date of release. You didn’t stop her having a movie night and even assisted in elements of it, despite having these pre arranged important plans being disrupted to do so. \n\nYou were more than reasonable and she was actually pretty disrespectful to you and is still being disrespectful. She’s not acknowledging video games because *she thinks they’re silly* which is not the point. They’re important to you, and it isn’t as though they are controlling you life: this was a particular event for which you planned.\n\nI don’t like video games. My husband does. When a new game is released that he’s excited about he sets aside time to play it and that’s fine with me. I’m even happy for him to tell me about the game. Why? Because this is his thing and it means something to him. I’ve even found a couple of games I am OK with to play with him. That’s what you *do* in a relationship.",
      "id": 125,
      "comments": [
        {
          "score": 154,
          "content": ">That’s what you do in a relationship.\n\nI got into gaming when I got with my boyfriend of 8 years. I've found some that I like but for the most part I just enjoy watching him play. (Yes I go 'you died' when his character dies and it's fun for me every time) If he wants to sit there and gush for an hour about the new Diablo or Call of Duty hell yeah I'll sit and listen. Because I care about him and his interests. They're not 100% my thing but he is and I wouldn't disrespect his hobbies or enjoyment of them. OP is definitely NTA.",
          "id": 126,
          "comments": [
            {
              "score": 46,
              "content": "Exactly. My husband and I do not share all the same interests but we make an effort to take an interest in what is important to each other and engage on the topic. It’s funny you talk about watching him play: I have done that as well, and I get him to explain the game to me and try to understand it.",
              "id": 127,
              "comments": [
                {
                  "score": 7,
                  "content": "It's just what you do, as you said. He always makes a point to ask me about whatever I'm reading, cross-stitching, drawing, watching, whatever. But watching someone play video games is fun it's like a tv show.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Yes, I love story driven games but don't really like playing often. So I watch him play while crocheting/knitting and look up hints if he gets stuck so he doesn't have to ruin the game.",
              "id": 129,
              "comments": [
                {
                  "score": 5,
                  "content": "Ha, I cross stitch while I watch. What a coincidence lol. It's like watching a tv show but better.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "[deleted]",
              "id": 131,
              "comments": [
                {
                  "score": 3,
                  "content": "I do have sensitivity to loud noises so he'll turn it down some for me which is much appreciated. Gun shots can be a lot on the ears lol.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "makes sense, “respecting your hobbies” and “being annoyed when your hobbies are intrusive to the peace” aren’t mutually exclusive",
                  "id": 133,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "when my girlfriend dies in a game, my favorite thing to do is say “autumn, look out!” literally as soon as the the “YOU DIED / GAME OVER” screen pops up",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I’m not into video games but if I WERE trying to stop my spouse from playing them, the appropriate reaction would be an adult conversation, not passive aggressively choosing to place a completely optional event on the night I’d been told about for six months.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This x1000.\n\nMy partner and I have been together 15 years, married 13.  While we have a lot of overlap, we both have separate interests and passions that the other doesn't share. But we each love hearing about the others' interests because we love and support one another. And while I may not be excited for ThingX, I AM excited for their excitement. And I want them to share that joy with me, and mine with them.\n\nI know too many couples where one does not value the hobbies or interests of the other and regularly steamrolls over them, or continually makes it clear they think those interests are some variations of dumb. The result is almost always the shut-down partner stops sharing as much in general, and ends up hiding things because they don't want to expose themselves to that negativity.\n\nI see it in my in-laws all the time. My FIL has all kinds of interests that my MIL brushes off or puts down so he just doesn't talk about them anymore, and has stopped doing some even. But now and then when me or his other SIL are around and we hit on one of those topics he absolutely lights up. MIL then gets annoyed that he doesn't talk with her like that anymore.",
          "id": 136,
          "comments": [
            {
              "score": 2,
              "content": "Exactly: it’s about sharing the joy and excitement and of course I want to do that with my partner. \n\nI too have seen too many couples where one is dismissive of the other’s interests and you are absolutely right that it results in distance and withdrawal to varying degrees. It also has a compounding effect because quite often the other party stops showing an interest in their partner’s stuff as well, not to punish but just because it’s hard to muster the energy and willingness for something that is not reciprocated. \n\nThe other thing that really irritates me about people who treat someone’s interest as silly is that we all have interests someone would call silly. Mature adults understand that there are times when interests will take a back seat to important life matters, but weighting interests against each other is different. In this example I truly fail to see how a movie night is superior to playing a video game.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Agree 100%. My husband is an avid gamer and is upstairs playing the new Zelda as I type. My gaming skills are limited to Pokémon GO, Animal Crossing, The Sims and a bit of MarioKart (although I did play the first South Park game which was awesome). I don’t get excited and book time off work to play new releases like he does. But it’s important to him, and if he took time away from his plans to clean and greet my friends when I invited them over, I’d be super grateful. If what OP is saying is true (and I currently have no reason not to take his post at face value) he’s definitely NTA.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 469,
      "content": "NTA.  \n\n>earlier this week, I reminded her again\n\nSo she definitely knew it was the weekend, starting Friday night.\n\n>She then plans a movie night with a bunch of neighbors for tonight\n\nShe did it deliberately, she has no respect for you or your hobby. You've been looking forward to this day for months and she intentionally tried to ruin it for you. \n\nYou even helped her by getting everything ready and stopped your game to greet her guests and helped  her clean up afterwards. She should be thanking you for helping her even though you had other plans.  She had months to have her STUPID movie nightbut she specifically chose this weekend.\n\nIf anyone should be angry, it's you. She sounds very selfish and narcissistic.",
      "id": 139,
      "comments": [
        {
          "score": 168,
          "content": "My husband has similarly been very excited for the new Zelda release. He realized a few days ago that he wouldn’t get off work in time to pick up the game on release day or even for several days after. I volunteered to go pick it up for him. I knew how much it meant to him. I even happily watched the opening scene. Then I read a book while he played. I support his hobbies and he supports mine.",
          "id": 140,
          "comments": [
            {
              "score": 31,
              "content": "My partner was supportive too. We went out and got it yesterday after he got off work (it was my birthday present), and then he watched me play for a few hours after we got home. He even helps with the puzzles and stuff.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "My girlfriend has been playing all weekend and I’m having a good time just chilling out and drawing while she plays. This is a special time so I get it. :)",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Agreement.  I hope OP takes this feedback to heart and has a serious discussion about boundaries with his wife.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "she is jealous of a video game! She wants more attention.",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 347,
      "content": "Lol, my boyfriend literally did this tonight for the new diablo game.\nHe told me in advance he was excited for it, said he wouldn't be coming over tonight because he wants time to play the shit out of the game.\nKnow what i said?\n\"Ok! I love you ❤️ and i hope you have fun with the game\" \nI spend plenty of time with him, if he wants to set out a night or even a full weekend to play a game, i'll just find something else to do.\nWhich in my case will actually be playing Zelda lol",
      "id": 145,
      "comments": [
        {
          "score": 65,
          "content": "Ohh no way! I didn’t realize Diablo came out this month! I thought it was next! Awesome, thanks.",
          "id": 146,
          "comments": [
            {
              "score": 50,
              "content": "Think its the server slam this weekend. Not the actual full release",
              "id": 147,
              "comments": [
                {
                  "score": 22,
                  "content": "Damn, Ya’ll are helpful:) thank you",
                  "id": 148,
                  "comments": [
                    {
                      "score": 39,
                      "content": "June 6th! My husband has excitedly told me about 312 times.",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "6.6.23 is the official release date for Diablo IV. If you’re curious.",
                      "id": 150,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I'm told it still needs a lot of work",
              "id": 151,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Another Beta",
              "id": 152,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "It’s just a new Beta release. Not the actual release.",
          "id": 153,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "My husband does the same thing when Destiny 2 gets a new raid (or whatever it’s called, I can’t keep track). He lets me know that he’s gonna be MIA for the next few days, and so I putter around the house doing my own thing. \n\nShockingly, it’s no big deal! Idk what OP’s wife’s problem is. I don’t plan anything for raid weekend (and I’m 9 months pregnant, so this most recent one I was just praying I didn’t go into early labor and fuck it all up for him lmao).",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "[deleted]",
          "id": 155,
          "comments": [
            {
              "score": 2,
              "content": "I certainly i hope so lol. \n\nI was in a few toxic relationships in the past, i've done alot of therapy and growing as a person so i hope my ability to pick a decent partner now has improved, and i'm making sure my own insecurities don't make me become the toxic one.\n\nI could be upset that my boyfriend wants to spend Saturday night without me when sundays are the only day we get to sleep in together. But why should i get upset with him spending one week out of many doing his own thing? There will be other Saturdays and other chances for sleep ins and i see him most nights of the weeks  anyway",
              "id": 156,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Right? If I was capable I’d try and support them and  make sure I made food for two and have them water because god knows I’d get hyper focused and forget. I’m in my 30s and I’m a mom. \n\nHonestly the inner child never dies, it’s a choice whether or not you try to snuff it out.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "6.6.2023 will be the release of diablo, he might take some time to game again :) Tell him good luck and not to pick the rogue :D",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "You wanna go next level? Pick up a copy and play with him.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 254,
      "content": "NTA. \n\nSome may trivialize your hobby because \"it's just a video game\", but it's also just a movie. Your hobby is as valid as any other and it sounds like you did plenty of communicating and planning in advance. You even played host other than when the movie was actually playing. NTA.",
      "id": 160,
      "comments": [
        {
          "score": 42,
          "content": "Exactly this. It doesn't matter what the plans are. OP made plans for that weekend months ago and told the wife well in advance.",
          "id": 161,
          "comments": [
            {
              "score": 51,
              "content": "I'm really into Dungeons & Dragons. When the finale of the campaign I am the Game Master for was coming up, I told my wife that I needed her to let me be a hermit for the entire Saturday so I could prepare. I had so much to get ready for. \n\nAnd this was for a literal imaginary game.\n\nAnd this absolute queen of a woman not only gave me that time, but brought me a homecooked meal to make sure I ate because I had been working for 6 hours non-stop and staring at my computer. I was just going to subsist on cereal that day and she went out of her way to do this for me for the hobby that I loved.\n\nShe went on a weekend cruise with her girlfriends and I cleaned the entire house while she was gone, finally took care of that work in the backyard I had been putting off, and installed our new water heater. \n\nSupport your spouse's hobbies with love and they will often give more love right back. Treat them with disdain and take a guess what will be coming your way.",
              "id": 162,
              "comments": [
                {
                  "score": 24,
                  "content": "100 feel this. Lmfao. My wife and I run a campaign together, and she has to put Tears of the Kingdom down  for our session today.\n\nLmfao!! Had to tease her a bit as she considered canceling session today so we could play more and I had to remind her that it's 4 hours and our players would be sad and also, like...today is 'give trauma to one of our players' day and he's been looking forward to it for two weeks so that did the trick. Dnd and Zelda today. Best weekend tbh.\n\nOn that note- Op 100%, not at fault, and I'm so sorry you're stuck with a spouse who power-plays you instead of supporting your hobbies. Have fun with TotK. It's been breathtaking so far!",
                  "id": 163,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Oh my God our weekly session is on Thursday and this week was \"Give my wife's Bard trauma\" session!\n\nTo make a long story short, the Bard's mother slit the Bard's throat. It was a pretty crazy session.\n\n**Long Version**\n\nThe Bard is a minority refugee who was separated from her mother when they were crossing the border to leave the Empire behind. She hasn't seen her mother for 5 years. The party is infiltrating the Empire to assassinate the Empress, so they meet up with the underground resistance movement.... and the Bard's mother is there.\n\nOne tearful reunion later that my players pointed out was very appropriate considering Mother's Day was a few days away, they're all sitting around a table together laughing and eating home cooked food.... when the poison in the wine takes effect.\n\nThe party is paralyzed while the Bard's mother stands up. She congratulates the Bard on a fantastic performance, but she knows she isn't really her daughter because she watched her daughter die. The Bard is obviously confused by this but cannot answer because she is paralyzed. And so Mother cuts her throat. Critical sneak attack took her right to unconsciousness.\n\nNext session they're trying to track down the mom because someone has clearly messed with her head and implanted a false memory. Our Paladin is very worried that The mother is being used as an unwitting spy to take out the underground resistance movement. As he put it during the session.....\n\n\"Oh shit, the machines are in Zion\"",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Totally. Separately from whether or not OP is AH it seems OP's wife is actively trying to undermine his hobbies. Maybe okay if the hobby was something dangerous or problematic, but playing Zelda is harmless. Not cool.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 186,
      "content": "I hate football, it bores me to sleep.  But my ex loved it, so when there were big matches I made sure to bring him snacks and stuff while he watched or entertained myself if he wanted to go out and watch it.\n\nOne doesn't need to share an interest to be supportive.\n\nNTA but your wife sure is.\n\nETA: spelling",
      "id": 166,
      "comments": [
        {
          "score": 18,
          "content": "Right I was saying up in my NTA comment that an event like this would bring the light to someone’s eyes, their face would just sparkle joy every time they spoke about it. Especially day of. \n\nShe literally had to watch this light fade from his eyes and face and had the ego to feel hurt about it. \n \nI’m in pain. The comment about it being just a stupid video game is painful and misses any point. It’s not about the game.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Me too, my parents love American football and I'm like \"meh\" so whenever \"their\" team is playing I freshen drinks and make wings and dip and sit next to them on my phone while they shout at the TV.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I am thinking how I used to play when I was a kid, then I decided it was for lazy slobs and had no respect for gamers, now 20 yrs later I work in Video Game marketing LOL. Maybe she never let out to him that she thinks gaming is for losers and she is selfishly trying to change him. Too late, gurl. I am sure you knew this side of him when you married him",
          "id": 169,
          "comments": [
            {
              "score": 4,
              "content": "My in young twenties camped outside stores for WoW releases.\n\nMe at 40 back to WoW and loving it. \n\nGames are awesome!\n\nAlso, with how expensive gaming equipment is, do people really think it is for kids?",
              "id": 170,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}