{
  "post content": "Throwaway because.\n\nLast weekend was my (M28) birthday. My girlfriend (F25) had asked what I wanted to do and I said I wanted to watch my favorite movie trilogy, LOTR. I don't think my girlfriend was thrilled but she didn't say anything and agreed. She has seen them before and I don't think she really likes them very much but she knows I love them so she doesn't really say anything besides they aren't really her thing. \n\nBut I really wanted to make a day of watching them and I went over to her house because she has a really big comfortable couch.  About ten minutes into the first movie and I look over and she is browsing on her phone. I was a little miffed but didn't say anything. She basically scrolled through her phone the entire movie. When we started the second movie, she opened a bottle of wine and proceeded to drink the whole thing, while still sitting on her phone. I was pretty irritated at this point because she wasn't even paying attention at all. \n\nThe third movie started and by then she had opened another bottle of wine and was asleep within the first twenty minutes. I was really mad at that point and just left and went home. \n\nA few hours later I got a text asking where I went. I told her I was mad that she couldn't pay attention to my favorite movies on my birthday. She told me I was an asshole and to grow the hell up. I've texted her a couple times but she hasn't responded. AITA?\n\nEdit: This has really blown up and I've gotten a little overwhelmed, but I do accept that I was the asshole. Watching 9 hours of movies that she hates was definitely too much of an ask and I shouldn't have reacted the way I did. I just took it personally because I felt like she didn't even try and these movies are important to me. The fact that she isn't much of a drinker and drank this much kind of set me off. I called and left her a voicemail apologizing.",
  "id": 1,
  "comments": [
    {
      "score": 36303,
      "content": "YTA\n\nShe's seen them before and she didn't like them, yet she agreed to be there with you while you watch them on your birthday without complaint. Why does it matter if she's paying attention? What do you gain from that except the validation of forcing someone to pay attention to something you like for however long that bloody trilogy is? I mean, that is *not* a small amount of time she dedicated to being there with you despite you both knowing she would get nothing from it. You are kinda ungrateful and controlling.\n\nNot to mention the way you just let yourself get angrier and angrier about it until you stormed out without saying anything. She's right. You could stand to grow up.",
      "id": 2,
      "comments": [
        {
          "score": 11496,
          "content": "I have difficulty sitting through a movie at home I really want to watch without something in my hand. I literally took up cross-stitch again because kept having to rewind the film as I was also scrolling on my phone too much. Some of us need something else to do while we watch tv.\n\nEdit: RIP my notifications. I’m honestly loving all your stories of crating while watching. Keep on stitching my fellow crafty viewers!\n\nFor those suggesting I may be ADD, I’m a 45 year old teacher and I’ve worked with enough ADD kids to recognise some of their patterns in me. I’ve developed enough strategies that I do t feel the need to pursue diagnosis as the only real side effect is creating lovely cross stitches. Win-win if you ask me!\n\nAnd to the random person who got very angry at my comment: Are you ok? I think you should really consider pursuing therapy.",
          "id": 3,
          "comments": [
            {
              "score": 6729,
              "content": "Me too! As bizarre as it sounds, I can’t pay attention to any one thing without doing something else stimulating simultaneously. \n\nOP, the combined trilogy is 11.2 HOURS. That’s a really long time to pay attention even if you *are* into something, which is sounds like she’s not. \n\nMy partner and I have a concept in our relationship we call “old people time.” (And I do mean old people in the best possible way.) Basically, we do our own things. But we do them cuddled up next to one another. Or in the same room. I personally adore that time. \n\nIt sounds like your girlfriend was happy to sit with you as you enjoyed rewatching LOTR. But she can’t *make* herself be interested. It does sound like she was interested in being there with you, though!",
              "id": 4,
              "comments": [
                {
                  "score": 3662,
                  "content": "Parallel play! My husband and I do that, too - usually he's playing on the PS5 while I cross-stitch and watch something on my tablet. It's still being together while doing something the other might not enjoy as much.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1267,
                      "content": "I love “parallel play!” Much sexier term. 🤣 But yea… it’s great, right?",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 911,
                      "content": "My parents have been married 33 years and are one of the best, happiest, most stable couples I’ve ever known. I absolutely guarantee that they would not have lasted this long if they didn’t do this. Their interests are just way too different. \n\nI lived with them for a couple months for the first time in 8 years in 2021. Every single night after dinner they’d both sit down in the living room, one on each end of the couch, and do their own things. Occasionally they’d pause to read/show something to the other. But for the most part there was very little interaction.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 518,
                      "content": "Parallel play is the BEST. It took my husband a while to get. I'm a painter but I work a full time job. To be able to paint/make money at painting, it has to seep into our together time. He'll put on a podcast or a movie or fiddle on his guitar and I'll paint. Its great because our son gets it now too. It's actually a reaaaaally valuable thing to learn for maintaining a healthy and balanced relationship.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 253,
                      "content": "It's literally just keeping each other company. Having your SO's presence is the whole point. Doesn't matter what each are doing. It's the fact that they are there that counts.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 124,
                      "content": "We do almost exactly this (I embroider or crochet, and he games) but we listen to a podcast together while we do it. We're enjoying our own thing, and something together at the same time, I really love it. It's usually Behind the Bastards.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "My husband and I do this. Some of the most enjoyable times we spend together is when he is playing games on the xbox or switch and I’m watching either folding washing, knitting or playing on my phone or laptop. It’s nice just being together but doing our own thing",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I litterally typing this while I'm pretending to read and my boyfriend is watching his car show.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Yes! My wife and I do that too. She can play something on the PS5 and I will be sitting close to her reading a book. It’s quite nice. Then we ask each other about what video game she’s playing and she asks me about my book.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "My fiancé and I do this and it's one of my favorite things. Nothing beats just existing in the same room as your partner while you both do something individually enjoyable. There's just a level of connection and understanding of each other that's unmatched",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "My best friend and me do that too, just with different things of course. I remember my mom saying years back, when I told her that we are doing that, that that's not a real friendship. So I'm glad to know that my best friend and me are not the only ones who do that.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 782,
                  "content": "If they’re his “favorite trilogy” I can almost guarantee he was watching the extended editions which is closer to 14 hours, more if like me, he’s the kind of person to pause and explain things/make food/use bathroom/ smoke",
                  "id": 16,
                  "comments": [
                    {
                      "score": 349,
                      "content": "WHEN HE KICKED THE HELMET HE *vaudeville hook*",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 178,
                      "content": "Eh. I'm the world's biggest LOTR fan and I vasty prefer the theatrical cut. A lot of people do. Those extra scenes weren't in the theatrical cut for a reason and they kind of ruin the flow of the story. Some stuff just doesn't translate well from a book to a movie.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "My husband is a big Godfather movies person and he sits there and EXPLAINS EVERY FUCKING PLOT POINT LIKE I AM NOT WATCHING THE SAME DAMB FILM OMG. And at least those aren't crazy long, and he skips the third one.  \n\nOh, and he doesn't care if I putter on my phone or read a magazine or sort mail or whatever. \n\nI just shrug it off as that occasional thing I endure.\n\nOP is out of line because he expects GF to like the same things he does, and pay rapt attention to the entire ass-numbing saga. And I'm sure he narrates the whole time too. YTA.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "I was curious myself and I did a quick Google. Apparently combined the extended comes out to about 11h55m or so but I've not personally checked the times.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Lol I would absolutely hope “he’s a person like you” that would take bathroom breaks, food runs, have some smokes during a 14 hour movie marathon. That sounds like a very reasonable, healthy thing to do.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 207,
                  "content": "I can't listen to podcasts/audiobooks unless I'm playing on the phone or doing something like painting or cross stitching. \n\nI have a hard time watching movies without doing something else on the phone. The combo of dim lights and comfortable place means I'm asleep in minutes.\nBest sleep I've ever had was \"watching\" Dunkirk at the theatre. The room was empty so I snatched a reclining seat, big mistake.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 104,
                      "content": "Totally. Man, I know this post is not about me but I’m finding these responses super validating.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I don't know how someone could just listen to a podcast with no other activity. Like just sit staring at the wall while you listen to it?",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Used to fall asleep in biology class(too many slides).\n\nBasically my brain said, \"hello darkness, my old friend...\" (Blessedly, at the time I did NOT snore)",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Personally, I do best with audiobooks when I’m driving. I do a lot of cross country road-trips and I’ve gone through the Eragon series, the Witcher series, and LOTR just while driving. Keeps me focused on the road 90% of the drive too.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 143,
                  "content": "I like LOTR and I needed to watch one movie a night to handle it.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 82,
                      "content": "I love them, can basically recite the script, but I still can only do 2 in one day before I fall asleep from not moving for 12 hours",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I enjoy watching movies, but I’m also not the person who can sit down and just watch the screen. I’ve got to do something while listening and glancing over to them. I don’t like audio ones, since I do like to glance over. I like the LOTR movies, but I couldn’t do them all back-to-back even while doing something else. \n\nOP YTA since she did agree to hang with you on your day to watch them, but expecting her to be glued all day to the screen is asking way to much. You’ve got to except different interests and find ways to support each other while doing them and fair time balances. Agree from above about parallel play. Ex: partner enjoys video games and I’ll hangout with him while also doing something I enjoy .",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 112,
                  "content": "Yeah I like the lord of the rings movies but I wouldn’t want to spend a Saturday watching all of them, Jesus",
                  "id": 30,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 82,
                  "content": "You have ADHD too, Pal? \n\nThis is basically every ADHD person I know. We all concentrate better doing two activities than one.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 65,
                      "content": "I have a strong urge to ask every \"two things required\" commenter just that. Is it an abundance of ADHD, or just a general thing for a lot of people (maybe related to increased general human over-stimulation)?? I'd love to know 🤔",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "It is not weird at all, this is how we evolved as humans. Working around the fire while listening to stories or singing.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "11.2 hours. Of movies she doesn't like? Girlfriend is a saint. \n\nI rarely watch movies (even that I enjoy) because sitting in place for that long AND paying attention is often a bridge too far for me. \n\nI can't think of the last newer release movie I've seen. I'm not sure I've seen anything released in the past 5 years? Longer? Ugh. I'm becoming my parents. When did the Rise of Skywalker come out? Pretty sure that is the last current movie I've seen.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Me and my friends & partner call it “catting” because it’s like how you spend time with a cat. Happy to be in the same room doing different things.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Meanwhile I have Velcro cats that need to have a paw on me at all times except when I am in the shower. It is way worse whenever I am at my computer or on my phone.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I can't believe what I'm reading, it's like finally meeting fellow aliens. Two comments in a row describing not being able to sit through movies?  It's a huge, big joke with my kids. ( Also board games...). Theaters yes, sofa nope. \n\nOP should be extraordinarily happy she made it that far AND I suspect he already knew she's far too ants in the pants ( kids description ) to make it through a trilogy before his birthday boy tantrum.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 234,
              "content": "Omg yes that’s why I started cross-stitch. Even shows/movies I love I still need something to do",
              "id": 38,
              "comments": [
                {
                  "score": 140,
                  "content": "Crochet for me!",
                  "id": 39,
                  "comments": [
                    {
                      "score": 126,
                      "content": "Hooker solidarity!",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 128,
                  "content": "Lol I’ve done cross-stitch in the past but now I do those diamond painting things. My fiancé is *constantly* rewinding our shows/movies or just repeating exactly what was just on the screen. No matter how many times I tell him that I absolutely *am* paying attention—listening 100% and watching about 75%, he still doesn’t get it and thinks I only get about 10% of the whole show. Like bro, I can multitask?",
                  "id": 41,
                  "comments": [
                    {
                      "score": 64,
                      "content": "Yes! I am paying attention, if anything it helps me concentrate. I also stitch at DnD, and it means I can pay attention longer",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Meh, that's kinda a dick move if he doesn't believe you. I sometimes like to give people a rundown of all the things I did get, and the confused/surprised expression can be quite satisfying 😇\n\nBut for a partner (random, unasked-for reddit stranger advice-y thing ahead), I'd probably try to have a very serious conversation about this, where I'd let them know I don't appreciate the implication I'm lying about this...  mostly to make it clear to them that that implication is there. Then figure out together a future strategy, probably.   \nIf that were fruitless, then I'd maybe give them the perception rundown upon any rewind to make my point clear. Also would be quite annoyed.\n\nObviously though, I know shit all about you and your relationship, I just like to preach some open communication magic 😅\n\n(Also I'm really curious, how do you manage the 75% watching with these activities, they seem like they'd require actual visual attention to do? Shows that go for visual-only meaningful scenes are my downfall every time!)",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "I compulsively make little Xs too 🥰",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Which is easier to get into, crotchet or cross-stitch? \nIs it better to go for one over the other (in terms of making more complex things later.) \n\nNever done either or have much knowledge.\n\n-Someone with fidgety hands",
                  "id": 45,
                  "comments": [
                    {
                      "score": 43,
                      "content": "I haven’t done crochet, but cross stitch is paint by numbers for embroidery. You get a pattern to follow and you only need a couple of stitches (cross stitch and backstitch, French knots if you’re fancy). It does take longer than you think, because you’re stitching pixel by pixel, but projects haven’t cost me more than $50 AUD total and have given hours of enjoyment.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "As somebody who crochets, crosstitch, embroiders and knits. Crochet is definitely the least physically painful. Crochet was also the first I picked up. I think it’s also the easiest to do sporadically when you want to stop you can just stop (or maybe finish a stitch or two more if your doing a specific pattern) with knitting I think it’s alot harder to set down when you aren’t at the end of a row. With cross stitch and embroidery you have to figure out a place to safely stow your needle and thread, maybe not a big deal for most people but I spent 2 hours looking at my couch bc I knew I stabbed my needle in it before I got up to go to the bathroom but I couldn’t find it (I eventually did without anybody getting stabbed)",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I don't cross stitch, but I do a bit of embroidery and crochet, both are pretty easy to get into, but crochet has the benefit of being *very* easy to unravel and start over from a certain stitch if you make a mistake. I recommend starting out with a 5mm or bigger hook. You can find yarn and hooks at a secondhand craft store at a very inexpensive price, and I think dollar tree sells ergonomic hooks. But embroidery might be the cheaper hobby of the two.\n\nEdit: you could also try out a knitting loom.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I personally prefer crochet, but it does have a slightly higher skill entry point than cross stitch with learning the basic stitches (I say this as someone who recently tried to teach their son to crochet. It took him a bit to pick up the basic stitches, while he could follow a basic cross stitch pattern fairly easily. But with detailed cross stitch, I find I have to pay more attention than crochet. A part of that is because I have bad eyes and more advanced cross stitches can be hard for me to read the patterns, so YMMV.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "It depends what you're doing. I knit, crochet, and embroider (not at the same time!). For all of them, there are simpler or more complex projects. It depends what you want to be able to make.\n\nI can knit basic patterns without watching what I'm doing and I'm getting close to that with crochet. You definitely can't do that with a lot of embroidery.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "Same.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "Knitting for me.\n\nBut this is like forcefeeding for more that 10 hours for someone.",
              "id": 52,
              "comments": [
                {
                  "score": 6,
                  "content": "Loom knitter here! I wish I could control standard needles, but at least I can still make some pretty things!",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Omg this. I peel my fingers’ skin really bad without even thinking about it if i am watching a movie and have nothing else to do. \n\nSo my boyfriend bought me lots of fidget toys and i also play a tetris-like game on my phone while we watch things so i can keep my fingers busy so i’m not peeling all my skin off lol. My bf js super sweet about it and even says “play your game babe” or hands me a pop it toy if he notices i’m going ham on my fingers while we watch our shows.",
              "id": 54,
              "comments": [
                {
                  "score": 4,
                  "content": "OMG I do this exact thing, but have noticed i do it more often when my anxiety gets bad! Driving new places for me is the absolute worst!",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Thissss, my bf gets mad if I’m colouring or doing a task while watching a movie but if I’m not I’ll start daydreaming and have to rewind half the movie",
              "id": 56,
              "comments": [
                {
                  "score": 6,
                  "content": "Maybe you should show him this thread so he understands it's normal and you really are paying attention and know what's happening. It's silly for him to be mad about it, but I do think it's hard for people to understand if their mind doesn't also work that way.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Shoot, my friends all decided we should get together and have a movie day of watching all of the LOTR movies (not extended) because a couple people haven’t seen them. I’ve seen them all a few times over the years and enjoy them. But the thought of sitting there rewatching something that long sounded like torture to me. I packed up my cross stitch stuff and brought it over to my friend’s house so I could sit and watch them without any issues. If I didn’t do that, I would have either been on my phone the entire time or I would have ended up pacing the room like a maniac instead!",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I'm guessing if he's as big of a fan as he says he is... They were the extended versions. \n\nSo 20 minutes into the third they're already 6.5 hours in.",
              "id": 59,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "My partner is massively into anime. Even HE scrolls his phone while watching. I am not into it and do the same thing. He doesn't care. I really enjoy being with him, even while anime is on.",
              "id": 60,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I thought it was weird to need two kinds of entertainment, one for me ears and one for my eyes/hands lol. But yeah same, I can watch a show while scrolling on social media etc... I can't sit still and just watch it",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I have ‘crafts and crime’ on Sunday evenings - currently S.W.A.T, NCIS:LA, and crochet",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1887,
          "content": "Girlfriend: What would you like for your birthday?\n\nOP: Sacrifice",
          "id": 63,
          "comments": [
            {
              "score": 744,
              "content": "Honestly. I don't think it's unreasonable to want to share your favourite movie/show with your partner, especially on your birthday, if they haven't already seen it. I share things with my wife that I know she isn't super interested in and she will pay attention and talk about it with me for a little bit, and I'll do the same for her interests because we love each other. But come on man, 3 movies that she has already seen AND disliked? Especially when they're around 3 hours each? That's just not reasonable.",
              "id": 64,
              "comments": [
                {
                  "score": 495,
                  "content": "It’s kind of like picking where you go to dinner on your birthday. My husband is vegetarian and hates sushi; I love sushi. On my birthday, we often go get sushi. He eats a vegetarian noodle dish that is basically fine but not what he’d ever pick to spend money on, and that’s okay, because it’s my birthday!\n\nIf I wanted to go to a 24-hr sushi convention filled with sushi classes and sushi tasting and lectures by top sushi chefs around the world, where ONLY sushi would be served the entire time, I’d never ask him to go with me - birthday or not. It’s asking way too much of somebody!\n\nA single dinner or film, fine. An all-day extravaganza of something you know the other person dislikes? Really unfair. \n\nShe was a good sport for playing along in the first place; he can’t demand she also stare at the screen while faking rapt interest for 12+ hours straight. You can’t make people enjoy the things you enjoy. I **love** LOTR,  myself, and I couldn’t watch all three films straight before losing my mind (ADHD).",
                  "id": 65,
                  "comments": [
                    {
                      "score": 37,
                      "content": "I’ll attend that 24-hr sushi convention with you, yummmm 😍 and I totally agree, and I’m the type who loves LOTR and has done multiple marathon viewings of the trilogy. I would never put someone who doesn’t even like LOTR through that, YTA OP.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Exactly. I wouldn't refuse to go eat somewhere on my wife's birthday, I would suck it up and find something on the menu even if I didn't really like the place, but forcing someone to do something they dislike for an entire day just to make you happy is pretty selfish, birthday or not.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Oh my god… a sushi convention sounds like the best day of my life. I would absolutely go to one if that was a thing!",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "YES. That's a thing you do with a like-minded friend, where you then meet up with your partner afterward for dinner.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I am disappointed to learn that the sushi convention is not real🥲 I would pay for the VIP sushi pass",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "My biggest issue is that he kept getting angrier she wasn't paying attention?  Like, okay? It doesn't matter if she isn't paying attention if it's something YOU want to be doing.  Keep doing what is making you happy, and she will keep doing what makes hers. No need to get mad about it when it's a show that's already been watched.  If she hadn't seen them, then you'd have a little bit more ground to stand on.\n\nLife doesn't need to be so hard dude.  If you can't handle someone hanging out with you, drinking, texting and then falling asleep during your favorite trilogy despite disliking itthemselves, you are going to have a rough rest of your life with the other individual.  Lot of downtime in a long term relationship where you are just spending time in eachothers presence, while doing the things that make you each happy.\n\nYTA OP ans you definitely should grow up a bit.  You aren't 18 anymore mate.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 17,
                      "content": "I'm guessing his idea was just \"if she gives it another chance and really pays attention this time she'll love it as much as I do\". But you can't force people to like things, and trying to force someone to like something is almost guaranteed to make them dislike it even more. I'm sure his girlfriend has hobbies and interests he doesn't like, so how would he feel being forced to do that for an entire day? It really is just a simple as having a little empathy.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": ">My biggest issue is that he kept getting angrier she wasn't paying attention?\n\nI actually get really distracted when I am watching a movie with someone and they aren't paying attention. Which is why I mostly watch movies alone. \n\nYou have to be a bit reasonable with stuff like this. If you're asking someone to make a big time commitment to watching a series you need to accept they might be bored and wander off, especially if they have seen it before. If you're asking them to sit with you and watch something they hate you should probably accept they will be on their phone the whole time. \n\nAlso the fact that his ex-gf was apparently uncharacteristically drinking a lot and his reaction is to be upset she wasn't paying attention to his movie marathon is not a great indication of him being a loving partner.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "I love my husband and I'm pretty sure I'd cry if he asked me to watch *all three* of the LOTR movies in one sitting. Freaking torture. OP's gf was a trooper and OP is YTA for getting mad at her coping mechanisms.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "> Especially when they're around 3 hours each? \n\nBold of you to assume he didn't insist on the extended editions.\n\nI love LOTR, and I'd love doing an entire extended edition marathon with my girlfriend. But I would never ask that if she had already seen them and didn't like them. And if she hadn't seem them, but was clearly losing interest halfway, I'd probably propose doing something else.\n\nAlso, as a general rule, if your girlfriend (or any friend you're spending 1on1 time together with) is starting on their 2nd bottle of wine, it's time to pause whatever you're doing and ask if they are okay.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yeah this is where I’m at. Asking for undivided interest for two hours for something you really love and want to share isnt unreasonable. This isn’t that.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "This was my exact same thought. I was fully on board with the thought that she should try watching a SINGLE movie that she HASN'T SEEN YET, but when he said she'd seen it before and that it was going to be a marathon of each of them, I immediately went YTA. Both of them should've talked after the first one (before it tbh but still) rather than descending into her passive aggressively drinking and him just forging ahead with them until she fell asleep and then leaving, but that was an outrageous demand for someone to give up more than a work days worth of time to something they already know they find immensely boring.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I like the LOTR movies and still fall asleep during them. When I wake up, they’re still walking.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Hahahahhaah",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1002,
          "content": ">What do you gain from that except the validation of forcing someone to pay attention to something you like\n\n**This is exactly what he gains** \\- validation and attempts to control - it's essentially a test to see if she'll prove her love and devotion to him when he already knows she's not going to like it.  (Thanks for wording it so well).\n\nSo when she 'failed' out so soon - it had nothing to do with her or her feelings/comfort/preferences.   It was all about him pushing her to do something that would slightly annoy her, just to see if she could power through 'for his special day'.  \n\nOP: Are you 'irritated' and  'mad' that she didn't follow instructions to prove her love and wouldn't play along with your game?  Or are you embarrassed that she didn't take the bait, you've shown your hand, and she isn't as into you as you thought?",
          "id": 80,
          "comments": [
            {
              "score": 503,
              "content": "Well it’s nice to share things you love with people you love. That’s the intention I read from the post. But if he went into it knowing she’s not super into it, he should have been clear that he was looking for a participant not a couch mate and maybe found a friend to do that with or not get mad that she is as engaged with it as she was given that it’s not her jam",
              "id": 81,
              "comments": [
                {
                  "score": 642,
                  "content": "For someone I love, I could probably do one movie. But the entire trilogy in one sitting is a lot to ask of anyone.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 363,
                      "content": "Yeah, I love LotR and my partner and I usually do a re-watch of the full director’s cut every other year or so. Even then, it’s rarely full watching/doing nothing else the whole time back to back. \n\nI wonder if OP would sit through 11 solid hours of content they’d both already seen and he didn’t like without doing anything besides fully engaging.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Definitely. At first I saw day of hanging out and watching movies with partner, sounds like a nice day to me. Then I saw LOTR. The fact this woman was willing to hang out through like 12 hours of watching movies she doesn't like, just to spend time with her bf, says a lot. The fact OP is pissed she was willing to do that, but didn't do it to his standards, says a lot more.",
                      "id": 84,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "Yeah my husband loves dnd. He spends probably a minimum of 10 hours a week watching various campaigns. He gives me the broad strokes of what happened because he's excited and I enjoy hearing the highlights. I am not sitting through a 5 hour episode of critical role. I'm sorry. I'll watch the animated show or pop in for a bit but jfc OP wants an entire exhausting day.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I'm a fan and all three in one sitting is too much, especially if you have the extended editions",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Seriously. I love the trilogy, and even I think watching all three in one day sounds like a fucking chore.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "One movie?  Ok - fair point.  But this is an entire day - If he knew she was into them too then also fair.  But he knew she wasn't into them but still chose all 3 vs only 1 of them.  There are so many other things that they both could have enjoyed (binging a series?  porn?) which comes back and supports your point about enjoying things together; I agree too.  So why would he then make a point of going for all 3?\n\nHe also decided to go to her house for this.  So he's making good use of her couch and setup (which then essentially keeps her at home all day), and then got mad at her for being polite and distracting herself whilst having to tolerate hours of LOTR in her own home.   That's a lot - too much to be asking of a non-fan without it being deliberate in some way.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Might be perspective but I personally didn't see that intention. Few key bits stood out:  \n\"asked what I wanted to do and I said I wanted to watch my favorite movie trilogy\"  \n\"She has seen them before and I don't think she really likes them very much\"  \n\"But I really wanted to make a day of watching them and I went over to her house because she has a really big comfortable couch\"  \nMight just be the phrasing but these don't indicate OP wants to spend time with GF, they want to watch the trilogy on their comfy couch.   \nI do think you are correct with the intention deep down but how it reads doesn't portray that to me",
                  "id": 89,
                  "comments": [
                    {
                      "score": 16,
                      "content": "It's like GF isn't a fully realized humans being here, with her own thoughts and preferences. \n\nShe's the owner of a couch and she's supposed to obediently stare at movies she doesn't enjoy, for hours upon end. Like a hostage in her own home.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Especially since those movies are infamously long\n\nThat’s a good **12 hours** there\n\nWhere he wanted her undivided attention",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 332,
              "content": "I don’t even think it’s an attempt to control. I think he just straight up doesn’t understand how anyone could be less enraptured by LOTR. This seems like a limited worldview kind of thing to me. No less dangerous, but certainly less malicious.",
              "id": 92,
              "comments": [
                {
                  "score": 72,
                  "content": "They could’ve had a hilarious tipsy night of movie banter but he threw a tantrum instead. It’s pretty fun to watch your favourite with someone who hates it as long as you both actually love and respect each other.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Nah, I think he wanted her to have an epiphany and suddenly see the movies through new eyes and love them... Inexplicably.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Holy IMax, Batman, thats a huge projection!",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 305,
          "content": "In HER house. I love LOTR, but all three movies in one day is a lot, even they're not the extended editions. \n\nIf an at-home movie day is what you want, that's fine. But not in your SO's house, who doesn't like the movies. Just dumb. YTA",
          "id": 96,
          "comments": [
            {
              "score": 13,
              "content": "Agreed. I love LOTR and have entertained a marathon in one day… but I just don’t have the stamina to pay attention to over 11 hours of JUST movies. I would look at my phone, too. Even when I’m watching one movie at home I check my phone or reply to texts.\n\nYTA, OP. She’s in the comfort of her own home because you wanted to watch them at HER place. I don’t care that it’s your birthday. 11+ hours of just movies that she doesn’t enjoy? She *was* compromising. I just turned 39 a couple months ago and went for sushi. One of my friends that came doesn’t like fish very much and never had it before. But she was willing to try one meal. That’s not the same as asking for 11 hours of someone’s uninterruptible time and attention for something they don’t like at all. If you asked her to watch one of the movies, sure, but the whole trilogy? Let her drink and browse her phone.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "They're my favourite films ever made, I think they're absolute works of art, masterpieces. \n\nI couldn't watch 3 in a day. 2 at a push.",
              "id": 98,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 288,
          "content": "I fucking love lotr, watching all 3 in a day sounds like an amazing day and I could have very easily acting like OP's gf. If for no other reason than I have a short attention span. Just saying.",
          "id": 99,
          "comments": [
            {
              "score": 71,
              "content": "Same. Adhd and I still read stuff while watching movies. We watch the trilogy every Christmas",
              "id": 100,
              "comments": [
                {
                  "score": 6,
                  "content": "I crank up IMDB and read all the trivia about whatever I'm watching. \"Hey, did you know so--and-so was also in this other movie?\" \"They did that entire shot in one take!\"\n\nADHD and an information sponge too. By the time I'm done watching (by some definitions of \"watching\") I know more about it than the person who suggested it.\n\nI try to keep it down to a dull roar when other people are in the room. 😄",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 186,
          "content": "My 8yo gets mad when we're watching a movie of her choice and I don't 'enjoy it properly'...\nBut even she acts more mature than you!\n100% YTA OP. BIG time.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "I it's the extended edition you're talking more than 9 hours. I own this trilogy and make a point of watching them alone as my husband hate these movies. OP is definitely TA. At least his girlfriend was in the same room as him.",
          "id": 103,
          "comments": [
            {
              "score": 10,
              "content": "The extended editions back to back are like 12 hours.",
              "id": 104,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Yea. I can’t think of anything more boring to do than to sit through ALL of them in one sitting! She must really love OP that she at least sat there without complaining and probably thought she was being a good sport for his bday. I would not have been able to not be on my phone and be quiet all day just so my bf could watch the entire trilogy! I wonder how OP would have behaved if the GF would have asked OP to watch rom coms for her birthday for 12 hours straight. No way he would have done so enthusiastically like expected from his gf! YTA hands down.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "OP I have experienced this firsthand. My partner loves LotR so much. He has a lot of happy childhood memories of his dad reading from the books to him.\n\nI have my MA in literature and I still managed to escape having to fully read the books (mad respect for Tolkien but it’s not my thing). But I love my partner so I read the books. He was pleased that I gave them a chance. \n\nThen came the movies. I already know I dislike the series but I love him so once they were all out on dvd I watched them. I fully watched and paid attention.\n\nWe talked about it and, to be fair, I did like some parts. However he understands that if he wants to watch them I have zero problems with it - sometimes I stay in the room but sometimes I go do something else.\n\nOP my point is that while sharing things we love is very important it’s EQUALLY important to respect the fact that your partner may have different opinions. You know she’s not into them. Yes it’s your birthday but why not do/watch/experience something you BOTH enjoy? That way she WILL be happy to pay full attention.\n\nThe fact that she sat there that long shows you she cares for you. But it’s unfair to expect her to sit through all of those movies that she doesn’t like and focus 100% on the movie.\n\nHonestly if I were that big of a fan I’d save watching the movies for when I’m with a friend who also enjoys them.\n\nSoft YTA. You aren’t being awful - just a little oblivious!",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I have ADHD & I do not enjoy LOTR. I'm impressed she stayed awake for 2 of them (isn't that like 9 fucking hours of the same movie‽)",
          "id": 107,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17381,
      "content": "All 3 of them? Clocking in at a runtime of over 9 hours? YTA",
      "id": 108,
      "comments": [
        {
          "score": 7714,
          "content": "I'd imagine that the OP would want to watch the extended editions, which run to 11h55m according to google.",
          "id": 109,
          "comments": [
            {
              "score": 5589,
              "content": "Honestly if OP wasn't even watching the extended versions that'd piss me off even more.",
              "id": 110,
              "comments": [
                {
                  "score": 771,
                  "content": "This is the way.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 214,
                      "content": "This is the way.",
                      "id": 112,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 536,
                  "content": "Extended editions or nothing. Don’t mess around with the theatrical editions.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 652,
                      "content": "please stop spreading this madness.\n\nEveryone should *at least* watch the theatrical editions first. They are unequivocally the better movies, with a much tighter pace and focus on what is important for the storytelling.\n\nThe extended editions are great if you are a fan and want to see even more, and I have no problem with them being the only version you watch - but don’t tell other people not to watch the theatricals. As a fan of film, I much much prefer the theatrical editions. I can’t stand how almost all the extended scenes completely slow the pacing of the story.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "The theatrical does my man Faramir so dirty",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Extended editions? Did you mean \"the only proper edition, not really long enough\", right?",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "that's what I did on my birthday. my wife would check on me and bring me snacks",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1193,
          "content": "Woof. \n\nThat is a long time to sit quietly and watch a screen when you don't really like what you're watching. \n\nLike sitting through a 9-12hour lecture. \n\nAnd IDK but I have never asked for 9-12 hours of anyone's undivided attention to celebrate my birthday, and I don't think that's a normal ask. \n\nFriend, I love you, and I love LOTR, but I need to move my body, talk, and generally put my focus where I want it after just a few hours.",
          "id": 118,
          "comments": [
            {
              "score": 473,
              "content": "oh, that's a great way of putting it that really points up the problem\n\nasking for \"9-12 hours of someone's undivided attention\"",
              "id": 119,
              "comments": [
                {
                  "score": 236,
                  "content": "Bet he wouldn’t do it for her.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 82,
                      "content": "Bet most women wouldn’t ask or expect. Gendered socialization is real.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "Lol reminds me of a video where a girl said in her dating profile she won't watch sports or drink beer and not to ask her to. Then when guys come into her dms getting upset, saying \"what if your man wants to watch the Superbowl??? You won't even watch it with him???\" And she shoots back \"I'm really into fashion. Are you going to be there with me during fashion week? Are you going to get up early to watch the runway live? Are you going to listen and feign interest while I outline for you my favorite designers newest collection? No? You're not interested in that stuff? Well imagine that!\"",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "She should have a Friends marathon for her birthday.",
                      "id": 123,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Let’s see how this man goes through titanic 1 and 2",
                      "id": 124,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Not even 9 hours of attention on him. 9 hours of attention on a bunch of dudes trying to destroy a ring!",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Yeah for my birthday during Covid my husband was like “we can watch doctor who!” It’s not a show he’s into at all, he knows I love it and usually only watch when he’s not around.\n\nIt was nice to have him there all day, even if he was on his phone or iPad doing other things. His random quips every once in a while when something weird happened is my favorite part of watching shows with him.\n\nI absolutely did it expect him to give 12 hours of undivided attention to a show he does not watch. This post is bizarre to me.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 503,
          "content": "Closer to 12 if he’s a true fan. Extended editions add some time.",
          "id": 127,
          "comments": [
            {
              "score": 63,
              "content": "OMG",
              "id": 128,
              "comments": [
                {
                  "score": 220,
                  "content": "Oh they’re totally worth it IF YOU LOVE THEM.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 107,
                      "content": "I don't \"love\" LOTR but imo everyone that wants to see the movies should watch the extended version. \nHad a \"movie\" weekend in my teens that just contained the extended movies + bonus features\n\nETA: the preformance from Viggo Mortensen gets so much more impressive when you realize how much he injured himself on set. \n\nMy personal favorite is when he broke his toe and everyone thought the shot went amazing",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "Only if you love them , then yes . if not Oh hell no",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 333,
          "content": "I can't reply but my ex did the same thing to me\nI died inside \nNot only did i see them all in theater but again and again at his place \nNope \nI cant even \nIll be down votes for this but unless your a fan they are soo boring",
          "id": 132,
          "comments": [
            {
              "score": 76,
              "content": "They came out either on or right next to my birthday.  The ex was more interested in them than me.  I can't watch them to this day.",
              "id": 133,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "I’m the family weirdo who never got into LOTR & ended up being dragged to the first 2. When the 3rd one came out, I made myself unavailable & even now when my cousins try to drag those movies out, I run. It’s never “let’s watch one.” It’s always every single one. No thanks",
              "id": 134,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 303,
          "content": "This is something my husband and I **tried** to do during COVID lockdowns. He's a huge fan, and I'm willing to give any full day of sitting on the couch watching good actors a fair shot. We both were napping by the middle of the 2nd movie.\n\nIf you want a gf that will stay awake and fully engaged for 9-13 hours of fantasy-Shakespeare, you need to be searching for her at cons or in D&D groups, or some place that someone who's into your exact kink might hang out.\n\nEven rabid movie buffs don't usually do 12 hours of Scorsese, man. LOTR is a huge ask!",
          "id": 135,
          "comments": [
            {
              "score": 33,
              "content": "I love lotr but even I couldn't watch the whole extended trilogy in one sitting and do nothing but pay attention to the movies (that's also my ADHD though)",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I was thinking that I couldn’t fathom making someone sit through the entire Godfather trilogy in one day. Even as a Godfather enjoyer, I’d be throwing back the wine and hoping for the end to come. Or any of the Harry Potters.",
              "id": 137,
              "comments": [
                {
                  "score": 12,
                  "content": "Oh gods, my husband asks for that regularly. I hate the Godfather movies now. And, yes, I do get loaded just to deal.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I had a watch party with some friends, one of them is the biggest LOTR’s fan I’ve ever met. Literally an encyclopedia of knowledge on LOTR - it’s crazy. We watched the extended edition of all of the movies and he recreated food from the movies to eat throughout (so like Elven bread, Meat Pie, Stew, etc.)\n\nIt was one of the best time I’ve had, with some of the best homemade food I’ve had, and  me and group of friends just ate food, and watched LOTR’s. And everyone (except me, because I’m weird - and even I struggled) passed out in the third movie. We had food, drinks, people dressing up, atmosphere, and literally everyone fell asleep. \n\nI couldn’t even imagine taking all of that away, all the food, all the drinks, all the friends and chit chat, and just…. Sitting on a couch, and watching it. \n\nThe fact that she even did that is an amazing gesture of love - even if she wasn’t paying attention, and the fact that he didn’t appreciate it makes me sad. \n\nYTA OP.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yeah my wife and I love LOTR but we couldn't do the full run in a single day. It just gets a bit much.",
              "id": 140,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I was taking a class on folklore and the media during the beginning and had already decided to do my term paper on LotR. \n\nConsumed the extended editions, classic cartoon versions, Yle's *Hobitit*, BBC original radio drama, other research papers, and a ton of erotic fanfiction (not for the paper just for me).",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Idk cause I’m a huge fan and would be down for a marathon but I also have ADHD and have seen them so many times when I was younger I memorized them (they were one of my favorite things to throw on in the background while studying for background noise) and I don’t think I could last the whole time without also crafting or playing a mindless game like solitaire or monster fighting grind. Add in some alcohol I’d be out like a light even with being a huge fan 😂",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I LOVE LOTR! However 9-12ish hours is a long time to sit and be interested in something you're not interested in. Go easier  on her. YTA. Also next time make a hobbit feast for it, duh.",
          "id": 143,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "He said \"AITA for asking her to watch movies on my birthday?\" when he should be asking \"AITA for yelling at her for wanting to sit through a ridiculously long movie marathon with a second source of stimulus?\"",
          "id": 144,
          "comments": [
            {
              "score": 7,
              "content": "*At her house,* no less!",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "That’s what my best friend growing up called the “Butt-numb-athon” - watching the entire trilogy in one day",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Seriously. \"Dedicate your entire day pretending to like being forced to sit through 3 of these God forsaken movies in a row because it's *my birthday*\"",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Two bottles of wine is the bare minimum!",
          "id": 148,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8883,
      "content": "YTA. Your favorite movies are your favorites, not hers, and you even acknowledged that she doesn't like them. Now you're pouting because she didn't enjoy being subjected to watching hours of those films? Would you have been attentive and enthralled if she lined up a day of watching Beaches, Fried Green Tomatoes, Sleepless in Seattle, etc.?",
      "id": 149,
      "comments": [
        {
          "score": 2438,
          "content": "I agree. My husband loves LOTR and Harry Potter and I just cannot keep my eyes open. So he watches them alone.\n\nI like the TV show Mom. I know. Don't care. My husband hates it. So I watch it alone and he goes and plays video games.\n\nIt's okay to enjoy different things. It's not okay to expect people to rewatch things you know they don't like, just because you want to.",
          "id": 150,
          "comments": [
            {
              "score": 298,
              "content": "My husband and I are the same. His is superhero stuff and I have some different tv shows. We each watch our own things. It works. Having different tastes is normal.",
              "id": 151,
              "comments": [
                {
                  "score": 23,
                  "content": "And also, it is not like the old days that the whole house only have one [i]precious[/i]TV\n\nWhen my girl occupying the TV watching Peppa Pig, I may watch grey’s anatomy on my iPhone ….",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "This. And if having the same tastes as your partner is important to you… get a partner who enjoys the things you enjoy, don’t force them to watch 9hours of movies they hate.",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "My husbands loves Rom Coms. I’m into action and super hero’s. We pick 1 day a week to watch a movie together and alternate who picks. But that’s only 2 hours. LOTR is like 11 hours. I watch that alone and hubby just watched occasionally with me here and there",
                  "id": 154,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "Oh, I like Mom too!",
              "id": 155,
              "comments": [
                {
                  "score": 11,
                  "content": "Mom is a really funny show",
                  "id": 156,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Early Mom before everyone left was awesome. At some point they definitely jumped the shark a bit though. Always struck me as weird that after a few seasons the ex-husband and her young kids just kind of stop existing",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I can relate! I often just play LOTR when I'm bored, but my wife doesn't like them and falls asleep literally every time it's playing, it's a very effective sedative for her. She probably hasn't gotten past the point where (spoiler alert for you, maybe) Frodo left the Shire. She also enjoys some shows I don't care about like Bridgerton and it's okay. We found a common ground on horror and mystery shows/movies though!",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Absolutely. It is both normal and healthy to be like, \"I'm gonna do this. What are you doing? Cool. Let's check in later. I love you.\" Yay, partnership. \n\nI'm sure he would try, but I would never expect my partner to commit to a literal half day of whatever the fuck nerdery I want, even on my bday. \n\nAlso, OP, I love a good movie marathon as much as the person, but it sounds like you literally played the movies with no perks. Were there snacks and nibbles? Did you expect her to watch in silence, or was she \"allowed\" to make comments?\n\nBeing in a relationship is mostly compromise, and being an adult is understanding that the world doesn't revolve around what you want. If OP could try either one, he'd probably have a better time in general. OP is TA.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Mom’s great. Allison Janney is brilliant.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "“I know. I don’t care” - I cannot express enough how much I love these two sentences.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Complete side note, I love Mom and am probably on my 9th rewatch 😂",
              "id": 162,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I actually really love LotR but I also drink two bottles of wine and fall asleep during a marathon 😂😂",
              "id": 163,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 596,
          "content": "It’s really an example of not having boundaries - he doesn’t understand the difference between himself and her, and his enjoyment is all caught up in her reaction. He needs to learn to be himself and let other people be who they are and not get emotional about other people’s tastes and opinions.",
          "id": 164,
          "comments": [
            {
              "score": 180,
              "content": "This is a really nice way of putting this idea. I find myself always watching to see if my husband likes \"my\" things, because it's important to me (for whatever reason) that he does. Now, I don't act the way OP did if he doesn't like them, but I do need to check myself and see this is a boundary rather than an unintentional personal slight.\n\nThanks for helping me reframe my thinking today :)",
              "id": 165,
              "comments": [
                {
                  "score": 20,
                  "content": "I'm always excited to show movies/tv shows/video games/wtv I like to my partner or friends. I always hope they like it, and I'll admit I'm a bit hurt if they don't pay attention or don't care. So now I watch reaction vids on youtube because it's almost like you get to show stuff to people and they have their full attention set on it.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I’m the exact same way. It’s important to me to share the things I love with my partner. I do get a little upset sometimes that he often doesn’t pay attention… I often take it as a personal slight ie if he really loved me, he’d respect that these things are important to me… but this thread really has me thinking now. Thank you for this.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Well observed.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 386,
          "content": "> Would you have been attentive and enthralled if she lined up a day of watching Beaches, Fried Green Tomatoes, Sleepless in Seattle, etc.?\n\nNo seriously. Because at first I tried to approach this thread from a place of understanding and compassion but quite frankly I would NEVER subject my partner to a Joy Luck Club, Steel Magnolias, Fried Green Tomatoes marathon JUST for my own gratification and appeasement. ESPECIALLY if they don't just \"think\" they wouldn't like those movies, but saw them and knew they didn't like them. \n\n\nThis is giving me war flashbacks of all the guys I dated who INSISTED I sit through hours and hours of their favorite rap mixtapes or country albums knowing I wasn't into it. It's selfish af.",
          "id": 169,
          "comments": [
            {
              "score": 88,
              "content": "\n>I would NEVER subject my partner to a Joy Luck Club, Steel Magnolias, Fried Green Tomatoes marathon JUST for my own gratification and appeasement. ESPECIALLY if they don't just \"think\" they wouldn't like those movies, but saw them and knew they didn't like them. \n\nNot only this, but then get upset when they show signs of (edit: not) enjoying them, even though you knew they didn't like them before you started. But they didn't complain. They just looked distracted.",
              "id": 170,
              "comments": [
                {
                  "score": 11,
                  "content": "It's honestly like having a crappy day job (plus overtime, omg) and a terrible manager who just gets mad at you for complying instead of buying into the company mindset. If OP needs his gf to wear 30 pieces of flair, then he needs to say it. As it is, she's wearing 15 pieces and being super nice about it.",
                  "id": 171,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Just make 30 the minimum amount of flair if you want me to wear 30 pieces of flair!",
                      "id": 172,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Joy Luck Club is so good though 😭😭",
              "id": 173,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "All three of those movies are awesome.",
              "id": 174,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": ">This is giving me war flashbacks of all the guys I dated who INSISTED I sit through hours and hours of their favorite rap mixtapes or country albums knowing I wasn't into it. It's selfish af.\n\nPreach.  What is *with* those guys?  It's the absolute worst to be forced to sit through something you know you don't like, and that the person subjecting you to it knows you don't like, but thinks they can convert you or something.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Lol, I know like my best friend was at my house and we couldn’t decide what to “watch” while hanging out and he was like “well what about that reality show about the fat chick you like?”\n\nUhm…. uhh…. uhhhhhhhhhhhh listen that is a guilty pleasure I know you would hate it so let’s not lmao",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "I love Fried Green tomatoes",
          "id": 177,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "We all know the answer to this.  He's a hypocrite, she needs to love his stuff, he doesn't have to like her's.",
          "id": 178,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Make him watch the twilight trilogy",
          "id": 179,
          "comments": [
            {
              "score": 17,
              "content": "Twilight has five movies so not a trilogy, but still an hour shorter than watching lotr extended cuts",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "When I need a day I usually do dirty dancing & all the Bridget jones movies. My husband will sit and watch something in his iPad or read or play video games. He knows what the movies are and knows he doesn’t love them like I do but still sits with me when we both have the time.\n\nI enjoy the parallel play thing. We’re just so different I can’t imagine it working any other way",
          "id": 181,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6531,
      "content": "YTA. I want you to just think for a minute a movie that you watched  that you REALLY did not enjoy. Now, imagine that your girlfriend asked you to watch that really long (what's it like 7-8 hours) movie for her birthday. If you can honestly tell me that you wouldn't fidget, fall asleep, get on your phone or zone out to think of something/anything else during that movie, then you're the most patient person on the planet and I commend you, sir. \n\nBut the fact is that you picked an activity you knew your girlfriend would not enjoy and then wanted her to sit, raptly entranced by the wonder that is LOTR for a really long time. She was sitting with you. She was doing quiet activities. She wasn't making fun of the movie or saying how stupid it was (that would have made her the AH). She wanted to spend time with you even though the activity you picked wasn't something she enjoyed.\n\n I absolutely loath sports on the tv, but I sit with my partner while he watches it and crochet or read while it's going on. It doesn't mean I don't like him. In fact, it means I really like him that I want to be near him enough to put up with football. Try to see it that way. Your girlfriend likes you enough that she'll sit by you while you watch something she doesn't like.",
      "id": 182,
      "comments": [
        {
          "score": 953,
          "content": "My partner is hugely into anime. He'll put it on, and I'll do exactly what OPs girlfriend does; play on my phone and put headphones on so I can scroll insta/tiktok/facebook silly videos to entertain myself. Many times I've fallen asleep. It's not wrong.",
          "id": 183,
          "comments": [
            {
              "score": 311,
              "content": "I guess OP needs to learn that even couples, as much as they love each other, can enjoy entirely different things, and that they don't need to enjoy their likes together all the time. I hope they're able to work it out.",
              "id": 184,
              "comments": [
                {
                  "score": 20,
                  "content": "I think it's reasonable to ask 'hey it's my bday and -I know they're not your faves- but it would make me happy if we could watch a LOTR movie.' \n(Obviously not ALL THREE OF THEM in one sitting jfc)\nIf my gf asked me to watch a movie I don't like or care about, it wouldn't make me thrilled...but it's her birthday! I'll sit through it and pay attention.\n\nEdit: I want to add, in this specific case, OP  the AH because this is 12 hours of movies!!",
                  "id": 185,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Oh yeah, I’d happily watch some movie I hated for my boyfriend for his birthday. I’m not watched a fucking half day’s worth of movies I hate though. That’s absurd.",
                      "id": 186,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yeah having different interests is normal. My boyfriend does try to engage in the trashy reality tv I watch, but sometimes he plays video games on his computer at the same time. I can’t expect him to be enthralled by a whole season of Love Is Blind any more than he can expect me to figure out how to play Elden Ring. As long as we get to do our interests in the same space and take some interest in what the other one is doing, it’s healthy.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Also this is A Thing! It’s essentially Parallel Play. People sit together (either side by side or in the same room) and do their own thing, but they’re still together.",
              "id": 188,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 632,
          "content": "> Your girlfriend likes you enough that she'll sit by you while you watch something she doesn't like.\n\nTHANK YOU!\n\nNot to mention it was her place, her couch, and her TV that OP was using.",
          "id": 189,
          "comments": [
            {
              "score": 25,
              "content": "plus the wine etc. she tried making it cosy",
              "id": 190,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Good point.",
              "id": 191,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 317,
          "content": "He specifically said \"AITA for asking her to watch the movie\" instead of \"AITA for yelling at her\" which shows that he completely missed the point of his own question.",
          "id": 192,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 174,
          "content": "well put!",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 108,
          "content": "[removed]",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "It’s 12 hours!",
          "id": 195,
          "comments": [
            {
              "score": 25,
              "content": "Yep, I watched LOTR trilogy prolly 10 times thru as a kid and I used to know all the diff scenes between the theatrical and extended and the extended editions literally add 2-3 hours onto the already long trilogy \n\nCondolences to the gf",
              "id": 196,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "I want OP to someday be forced to sit and watch the Legally Blonde trilogy then get back to us about how attentive and engaged he was.",
          "id": 197,
          "comments": [
            {
              "score": 9,
              "content": "Like 3x in a row tho. Has to be 12 hours of LB (there’s a third?? Had no idea)",
              "id": 198,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I believe the extended cuts (which any fan would watch, not the theatricals) is almost 12 hours, something like 11 hours 55 minutes.  So, longer than 8 hours, *twelve* hours.  This guy is so much the asshole.",
          "id": 199,
          "comments": [
            {
              "score": 9,
              "content": "Yeah, it's a fuck ton. My partner and I watch through them all about once a year. And we split them all up, so one night we'll watch half of the first and maybe the next week we'll finish it. And we do this over like two months. And we LOVE these movies, but I'm not sitting through more than two hours of anything. \n\nThe only exception is over Christmas because then we pull all the blankets and pillows to the living room and nest for like three days doing nothing but watch TV, play video games, sleep.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "In her own home, no less!",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I googled it - the run time for the whole trilogy is 11.2 hours. MORE THAN ELEVEN HOURS.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3659,
      "content": "YTA. Honestly, how did you think it was going to go? Like if she isn’t interested in the movies, was she really going to spend 9 hours of focused watching? It seems like she was a pretty good sport all things considered.",
      "id": 203,
      "comments": [
        {
          "score": 1462,
          "content": "He was secretly hoping she would *finally* get it and love the movies as much as him. He's an AH for trying to force her to love something as much as he does.",
          "id": 204,
          "comments": [
            {
              "score": 417,
              "content": "My ex did that with star wars, I was so bored I accidentally started daydreaming throughout the majority of the marathon because he would get pissed if I even touched my phone.",
              "id": 205,
              "comments": [
                {
                  "score": 282,
                  "content": "Im old. I once had a boyfriend who did this to me with Twin Peaks movies. He got mad that I dozed off (no smartphones then) and he fucking restarted the movie when I woke up. *Twice.* I’m still amazed at his attempt to try to *force* me to watch something I had no interest in.",
                  "id": 206,
                  "comments": [
                    {
                      "score": 26,
                      "content": "‘Once had a boyfriend’ is the key phrase OP needs to understand. He is so replaceable.",
                      "id": 207,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "hahah omg Natural Born Killers for me. \n\nAlso, I liked Twin Peaks, but even liking the show, I could not get into the movie. It wasn't good!",
                      "id": 208,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": ">My ex\n\n>would get pissed\n\nGood on you for making him your ex.",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "My brother does this a lot. I don't think he'd ever say it out loud, but I suspect the deep seated, subconscious opinion is that his taste in media is objectively \"correct.\" So why wouldn't other people like the same things he likes? And if they don't like it, something is wrong with them.\n\nThere are people who I think of as perpetual sharers. They think what they love is great, and so everyone else must love it too. They want the validation of other people loving what they love, and I think we all want that to some degree. It becomes a problem when they KEEP sharing it, over and over, trying to get someone to see it a different way that will make them love it too. And that really doesn't happen. I'm at a point where even if I think I will like something my brother wants to show me, I don't want to engage with it because it will just encourage him to keep showing me more stuff.",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "He would Teach Her!!!!! and Train Her!!!!! to have the same tastes as him, so he would never have to be challenged! And she would praise him, and thank him in oh so many ways for having shown her the light!!!!",
              "id": 211,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Yep!  This is the attitude of someone who thinks if you just sit there and watch it you will suddenly get it and love it.  That’s just not how it works!",
              "id": 212,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 648,
          "content": "I love that she was just knocking back bottles of wine. I think we can really see where she was at with it all 😆",
          "id": 213,
          "comments": [
            {
              "score": 166,
              "content": "Totally. I was reading the post wondering how I would get through that situation and then realized how much I like her.",
              "id": 214,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I mean shit I'd do that too and I LOVE those movies.",
              "id": 215,
              "comments": [
                {
                  "score": 15,
                  "content": "I once had a LOTR and drinking game night. 15 people. There were only a few survivors.",
                  "id": 216,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 169,
          "content": "Heck, I really like the movies and I'd still be messing with my phone most of the time. Its nearly 12 hours and (presumably) she's not a robot. Last time I watched the LOTR trilogy and the Hobbit trilogy was with a friend and our partners. Our plan was to watch it all non-stop like crazy people. His gf and my husband fell asleep because they aren't into it but wanted to spend time with us, and we stayed up as long as we could then finished it in the morning. Didn't bother either of us at all",
          "id": 217,
          "comments": [
            {
              "score": 24,
              "content": ">Its nearly 12 hours\n\nAnd with no pausing. All the comments suggesting it's 7-9 hours are cute.\n\nI used to watch the entire LOTR trilogy solo every Sunday when I was in college. By my mid-20's, I'd only watch it on my birthdays, also solo. My BF, who is as much of a LOTR nerd as me (perhaps bigger) is ok never watching it again because he has also seen it 80 times. A few years ago he asked me what I wanted to do on a birthday and I said sit in bed and do the trilogy like the old days. He can barely sit through 1.5 hour movies he *enjoys* so he asked if he could do other things on his laptop in bed and I said no problem.",
              "id": 218,
              "comments": [
                {
                  "score": 6,
                  "content": "Yeah, I've seen them enough that now when I \"watch\" them it's more.like they're pleasant background noise",
                  "id": 219,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3120,
      "content": "YTA. Over 11 hours?! You expected her to suck up half a day actively watching a trilogy you knew she didn’t like? For the sake of your birthday? That’s insanity. If it was ONE of the movies, I could see you being upset, but holy moly, all three?! Did you two discuss expectations before agreeing to this? Did you tell her you expected her undivided attention for 11 hours so she could gracefully nope out or offer a compromise? \n\nYou went over to her place because you like her couch, which she was cool with, for the entirety of your LOTR marathon. You knew full darned well she wasn’t keen on the trilogy, but somehow you still expected her undivided attention? She was bored out of her skull, but was quiet about it. She didn’t tap out and ask you to leave. YOU were the one annoyed with HER, while camped out on HER couch. She was keeping herself occupied on her phone while you watched your favorite movies. The woman is a saint. \n\nBut you, the birthday boy, got all bent out of shape because she messed around in her phone and drank two bottles of whine, er, wine, to cope with/accommodate your 11 hour marathon. She fell asleep and you immaturely left without saying a word. The goal should have been to spend time hanging out together for your birthday, which, honestly, was accomplished. You could have very well watched all of that on your own, on your own time in the comfort of your own home. You cannot monopolize half of someone’s day when they feel obligated for the sake of it being your birthday, and then dictate how they cope with boredom. That is torture.",
      "id": 220,
      "comments": [
        {
          "score": 1060,
          "content": "Looks like OP's birthday wish for quality time with his girlfriend turned into a Fellowship of the Whine.",
          "id": 221,
          "comments": [
            {
              "score": 1152,
              "content": "Bored of the Rings",
              "id": 222,
              "comments": [
                {
                  "score": 88,
                  "content": "I giggled.",
                  "id": 223,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "The 12 Hours",
                  "id": 224,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Sometimes I wish Reddit had an algorithm like Tiktok just so obscure yet hilarious comments like this could be exposed to the masses..",
                  "id": 225,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Written in 1969 https://en.wikipedia.org/wiki/Bored\\_of\\_the\\_Rings",
                  "id": 226,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Return of the Cabernet",
                  "id": 227,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 280,
              "content": "He didn't want quality time with her though, or it would have been like the dude who begged his gf to watch the extended trilogy and she said \"Make a day of it then\" and he came up with a full menu, they cooked together, did thinfa in between each movie, and had it all scheduled.",
              "id": 228,
              "comments": [
                {
                  "score": 73,
                  "content": "See, I'm not huge on the whole \"sit and focus on a movie for more than 2 hours\" thing, my ADHD won't allow it. But hell yes I'd love it if it was broken up between movies and had a whole theme for the day going.",
                  "id": 229,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Exactly. I had a friend who did a Star Wars marathon with a bunch of us. We took breaks in between the movies to talk, get to know each other, have pizza, etc. Some of us even left and came back. Everyone was cool with keeping it flexible.",
                  "id": 230,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "This is what I do when I get people who have never watched Harry Potter to watch it.",
                  "id": 231,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "While hers was the Fellowship of the Wine",
              "id": 232,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "bUt It'S My bIRtHdaAaYy",
          "id": 233,
          "comments": [
            {
              "score": 8,
              "content": "[\"Because it's my birthday and I wants it!\"](https://youtu.be/Uo_TRFXh5XI)",
              "id": 234,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Well said. It is pretty unhinged to expect someone to sit through a trilogy of movies you know they don't like. Sounds like some kind of bizarre loyalty test",
          "id": 235,
          "comments": [
            {
              "score": 8,
              "content": "this is actually a whole thing for some reason. both my housemate and I found out that we’d had almost this exact experience with different boyfriends when these movies came out. we now use “LOTR boyfriend” as shorthand for men who think their tastes are inherently important to  anyone besides themselves, and view their partners as receptacles to their interests rather than people with their own interests.",
              "id": 236,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "This! All of this! 11+ hours is a long time and it's not even your place OP! It's her house! I LOVE LOTR and I would end up like her falling asleep somewhere or get distracted somehow due to my ADD if I have to watch them all in one day. It's okay to want to watch your favorite movie on your birthday. It's unacceptable to do everything that you did there. She was right, you need to grow up because you're being very inconsiderate and selfish in this. YTA OP",
          "id": 237,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": ">If it was ONE of the movies, I could see you being upset,\n\nI couldn't. Being UPSET about her not enjoying a three-hour movie? Heck, even if the movie were only an hour long, his getting upset about it would still be assholish. This guy really needs to rethink how he treats her.",
          "id": 238,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I feel like 11 hours is a long time to fume about something when you could have just had a discussion at some point about how you thought the day would look. 🤷🏻‍♀️",
          "id": 239,
          "comments": [
            {
              "score": 5,
              "content": "Like wouldn't he have mentioned her boredom by the end of the first one? \"Hey you look kinda bored, wanna do something else together?\" But nope, OP would rather be a child for the sake of his birthday than find something they could both enjoy together. Such a healthy relationship.",
              "id": 240,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": ">drank two bottles of whine, er, wine\n\n🍷😢🤣💀",
          "id": 241,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I'd argue that nearly 12 hours is essentially someone's entire day. Yeah there are 24 hours in a day but you sleep for 8 of them, shower/eat/etc takes up an extra however long, 12 hours is the vast majority of your conscious time",
          "id": 242,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": ">You went over to her place because you like her couch,\n\nNah that was just the excuse to make sure to rope her into it.  He was secretly hoping he'd convert her and she'd be able to see what he sees in the movies.  Which is an innocent and even cute sentiment, except you know for the whole, subjecting her to a 9-12 hr marathon that he already knew she'd experienced and didn't enjoy.  The couch thing was the coward's lie that he told her, and now himself and reddit, because it sounds better than \"I wanted an excuse that would use my birthday privilege to subvert her autonomy and keep her glued to my side as a literal captive audience because she can't excuse herself to leave for home and will feel uncomfortably like she *has* to sit with me the whole time.\"  Definite YTA.",
          "id": 243,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1821,
      "content": "If I had a boyfriend that wanted to watch these movies for his birthday, I’d probably do it. But sir….I’m 48. I like to sit.",
      "id": 244,
      "comments": [
        {
          "score": 639,
          "content": "\"But sir....I'm 48.  I like to sit.\"  I'm also 48.  This is the way.",
          "id": 245,
          "comments": [
            {
              "score": 197,
              "content": "Nothing beats a good sit.",
              "id": 246,
              "comments": [
                {
                  "score": 137,
                  "content": "I don't know, a nice nap is pretty awesome",
                  "id": 247,
                  "comments": [
                    {
                      "score": 114,
                      "content": "Oh yes, a nice nap followed by a good sit with a cuppa.",
                      "id": 248,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Oh, the great leveler. From the mightiest Pharaoh to the lowliest peasant, who doesn't enjoy a good sit?",
                  "id": 249,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "THE QUEEN OF COMMENTING HAS ARRIVED!!!!!!! ❤️❤️❤️❤️❤️",
          "id": 250,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "I like to sit, too, but having experienced the extended versions of the LotR series when I was a teenager and had much more patience and stamina, that is a LOT of sitting.",
          "id": 251,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I'm in my 20s and feel this way...",
          "id": 252,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "At 49 I have perfected the 11 hour sit",
          "id": 253,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Hilarious and true",
          "id": 254,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "XD my mom just turned 67. For her bday all she wanted a special meal and a homemade cake. I did that and put on one of the romance movies she likes. (I can’t stand said genre but it was ONE movie so I could deal for my momma) \n\nI also might have bought her some silly key rings for her purse as a surprise that she loved.",
          "id": 255,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1116,
      "content": "YTA I get that it's your birthday, and you can do what you want. But you knew she had seen the movies and she didn't really care for them. The fact that she was even willing to sit there with foe you for approximately 9 hours is a testament to her patience. Getting mad because she wasn't paying attention is dramatic. If you wanted to spend actual time with her, maybe you should have picked a different activity. Flip it around. How would you feel if you had to sit through 9 hours of movies you don't like?",
      "id": 256,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 857,
      "content": "YTA that’s several hours of movies she doesn’t like. That has to be agonizing. And I like lotr.",
      "id": 257,
      "comments": [
        {
          "score": 368,
          "content": "9 hours and 18 minutes if they aren’t doing the extended cuts. And I love LOTR, but we always do our family watch-alongs on a long weekend and do one a day. Even I would need to do something else about 4 hours in!",
          "id": 258,
          "comments": [
            {
              "score": 106,
              "content": "Yeah… that’s too much for someone that doesn’t really like them and that’s just having them sit there. OP expected her to actually watch them.",
              "id": 259,
              "comments": [
                {
                  "score": 139,
                  "content": "If OP had any empathy at all the correct response would be to either \n\n1. Not suggest an activity you know she doesn't like to begin with\n2. Or notice she's not into it so you turn the movies off and suggest something else\n\nOP is acting like just because it's his birthday he doesn't have to be considerate to his partner. There is no alternate dimension that exists where I'd do this to someone I supposedly love lmao",
                  "id": 260,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Listen…. my bf is into transformers and I dislike those movies a lot. If he wants to watch them marathon style I would, but i’d act a lot like OPs gf here… lol. But we both know better than to suggest stuff like that. If I wanna spend time w/ him, I suggest something we both like, otherwise i’d ask someone else who does.",
                      "id": 261,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 133,
          "content": "My husband and I watch the extended editions of LOTR around midwinter every year but even we have never tried to watch them all in one go. That poor girl 😭",
          "id": 262,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": "I love LOTR and I wouldn't want to watch all three movies at once, his gf doesn't even like them so it had to be absolute agony for her.",
          "id": 263,
          "comments": [
            {
              "score": 33,
              "content": "Right? I was there at the midnight showings of each movie. I read the books long before a movie was even talked about. I LOVE LOTR. \n\nBut one movie at a time is all my attention span can handle, lol",
              "id": 264,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yep, I do like the movies, but when my boyfriend and his friends decided to do a second all day marathon of the extended editions in addition to having a drinking game during the entire thing, I decided to not go since I went to their first attempt at it and did not enjoy such a long period of doing that. Luckily my boyfriend didn’t expect me to do it for his happiness, because, yeah, no way is it a reasonable ask.",
              "id": 265,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Yeah, I moderately enjoyed the LOTR movies when I saw them (in theaters, INDIVIDUALLY) but I think I would come away hating them if I had to spend a day watching them with an unreasonable, pretentious, self centered jerk like OP.",
          "id": 266,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 562,
      "content": "[deleted]",
      "id": 267,
      "comments": [
        {
          "score": 220,
          "content": "On her couch, looking at her screen, no less. YTA.",
          "id": 268,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}