{
  "post content": "I (28m) and have been married to my wife \"Bella\" (28f) for 5 years.\n\nWe both met and went to the same college. She pre-law while I was doing animation. She graduated top of our class and went to a T20 law school. While she was in law school, I had a lot of trouble finding a job in my field or a job at all, really. I ended up working in a kitchen as a line cook to help support us (in addition to loans she took out) while she was going to school so she could just focus on her classes.\n\nBella got a very good job in a different state after she graduated, so I quit my job and haven't gotten another one since. We have no kids, a nice house for the two of us, and are overall living very very comfortably. She works very long hours, so I take care of most of the household things. Cleaning, cooking, grocery shopping, re-painting the walls and doing other work and renovations to the house.\n\nIn the last 6 months Bella's started referring to me as her \"house husband\" around our family and friends. I've mostly been letting it go but every single time it bothers me. I'm already insecure about not being able to find a good job and it makes me feel even more inadequate. I finally got to the end of my rope when we were with her mother on Sunday, who still doesn't really approve of me, and they were talking about taking care of the lawn/garden and she said, \"Thank goodness I have a house husband for that or I'd never find the time\" and smiled at me. Then they both laughed. It was humiliating. \n\nI didn't say anything at first but I guess she could tell that I was really upset and asked what was wrong. I told her that she needed to stop emasculating me and making it seem like I didn't contribute anything to the household. We were arguing back and forth and she told me that she would stop calling me a house husband if I was going to \"get that upset about it\" but that it wasn't an untrue term and I needed to stop being insecure. \n\nBella refuses to apologize. I feel like she doesn't fully appreciate my value as her husband. I've stopped doing the chores until she apologizes and she is beyond pissed off. She's been coming home and cooking dinner (only for herself) and doing the chores I haven't and then taking off to spend the night at a friends house. I was talking to my sister about it and she told me that Bella was wrong but I was being immature in my response. The thing is, if I give in she's going to keep thinking what she's been doing is okay. I don't even know anymore. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 38360,
      "content": "Darling, you are a house husband. There is absolutely nothing wrong with that. Or being a house wife. \n\nWhy do you believe that it is a put down or emasculating? It’s an equal contribution to your family and household. It holds value. It permits your wife to work longer hours at her job, without trying to also maintain the household. \n\nIf your truly unhappy in that role- do something about it. Look for work in your chosen field or look into going back for new qualifications. \n\nYTA for getting upset about a factually correct statement.",
      "id": 2,
      "comments": [
        {
          "score": 25270,
          "content": "Nah. As a house wife myself, I'd be so annoyed if my husband said he has a housewife to take care of stuff. \nIf it was \"I'm so glad (my name) takes care of all of that!\" it would be fine. But to reduce your spouse to just their position, rather than a person is demeaning.",
          "id": 3,
          "comments": [
            {
              "score": 11915,
              "content": "I agree with you, though i do think OP abandoning his position as a house husband to manipulate an apology is what makes him TA, not being upset about it. \nIt’s an immature way to go about it, especially considering she has committed to not refer to him as a house husband any more.",
              "id": 4,
              "comments": [
                {
                  "score": 4709,
                  "content": "Honestly disagree.\n\n\nThere have often been posts along the lines of 'my husband belittled me as a housewife so I stopped working' and they all side with the 'house wife'\n\nNow the genders are reversed people are siding with the 'bread winner'\n\nConsistency is key",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3721,
                      "content": "That’s usually because the women have told the husband it bothers them. If he had communicated it before or she wouldn’t have stopped I would definitely call her an asshole",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1420,
                      "content": "She didn’t belittle him though. He decided to bottle up his feelings about this and then explode and act like a child and stop pulling his weight. \n\nMy husband jokes around about how I’m a kept woman etc. I don’t mind because… I am. 🤷🏻‍♀️🤣 \n\nIf he didn’t like that jokey title he should have been a grown up and talked to her about it. Men WAY too often bottle up their feelings and then spew them onto their partners at the worst possible time.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1121,
                      "content": "Context is also key. Men aren't the ones who have been repeatedly taken for granted and expected to do unpaid domestic labor. It's pretty standard fare for women to giggle at the role reversal *only because we grew up being told the best we could ever be was a domestic housewife.* This doesn't give her a pass to continue saying something that makes him uncomfortable *now that he's communicated that* BUT this reeks of a man throwing a fit because he *believes housewives are inferior to working professionals.* Which is why he's TA",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 757,
                      "content": "[deleted]",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 513,
                      "content": "I'd normally agree with you, as reddit is very hypocritical in this regard. However, OP needs to suck it up. He gets to hang out at home, do nothing but the chores for 2 people and house renovations. Every other human has to do those things on the weekend. This guy gets a free ride, and he's still whinging. Obviously the tone of his wife is probably what's annoyed him, but there's nothing untrue about him being a house husband, that's literally his role in the relationship.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 505,
                      "content": "She's c*omplimenting the quality* of his work, and there's no childcare or eldercare involved, which is different from the usual post when the genders are reversed. \n\nOr there was a recent one where the guy was telling his wife to be ready for sex daily at 2pm or something crazy - that's oddly specific and controlling. If OP's wife was doing that to him, it would still be bad. She's kind of joking, but also giving him real compliments, here.\n\nI don't get why this guy won't ask his wife for a loan (or get an SBA loan) and start a handyman or landscaping business. He feels like he can't get a good job, but everyone says how great his work is - start a business, OP. Yeesh.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 478,
                      "content": "I've never seen a post from a woman who was upset purely because her husband was simply referring to her a housewife.\n\n&#x200B;\n\nThe posts I have seen with female SAHP feeling disrespected generally where posters agree with the OP consist of a woman whose partner tells them that being a housewife is easy and unimportant.\n\n&#x200B;\n\nNowhere does OPs partner call him lazy, say that being a house husband is stupid, that he should feel grateful she's willing to support him doing nothing. She's actually complimenting him - telling her mom that she would be unable to take care of the house without his labor. It's just the LABEL househusband that OPs partner seems to find embarrassing. It's not inherently an insulting term. And OP has seemingly not told his wife previously that the term upset him. It is unreasonable to expect that she would have known.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 389,
                      "content": "I'm so sick of these \"if the genders were reversed\" comments. The context matters.\n\nIn his comments OP admits that he knows she wasn't using the term to belittle him but that he thinks domestic/housework isn't \"real\" work and is afraid other people will look down on him because HE devalues domestic work and doesn't want to be compared to a housewife, because he sees that as being demeaning. This is 100% an issue of OP's own misogyny and attitudes towards what he sees as \"women's work\"",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 363,
                      "content": "The difference is that she didn’t belittle him, she said she was grateful/ fortunate to have him as a househusband.  What he feels is different, she didn’t make him feel that way.  He voiced his objection and she said okay I won’t call you a househusband anymore but he’s punishing her anyway?",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 311,
                      "content": "I don’t think that it has anything to do with the gender of OP. I think people are influenced instead by his comments, where he: \n\n1. Acknowledged that she did not mean it as an insult, and said it nicely.\n\n2. Explained that his embarrassment comes from the idea that “men should be providers.”",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 56,
                  "content": "Well... I suppose I can agree with you on that. I do recall my mother \"going on strike\" a time or two to make a point, so I suppose I just view it as normal. (Although, when I've gone on strike, it's only to not pick up after anyone other than myself. Shit still gets done.)",
                  "id": 16,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Going on strike tends to be the thing to do when you it partner is unwilling or unable to value the work that you do at home. That’s not the case here though. She understands and values his contributions.\n\nHaving said that, if I was a housewife and my partner said “good thing I have a housewife for all that” I would have been annoyed too. Yet I still don’t think that is NEARLY bad enough to strike over. He really is being immature.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Well, now he's just an unemployed loafer, so what does she call him NOW?",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "And why would she stay married to someone who contributes NOTHING?  \nYTA",
                  "id": 19,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": ">I agree with you, though i do think OP abandoning his position as a house husband to manipulate an apology is what makes him TA\n\nand it's going to blow up in his face when she cuts off his allowance.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "He's TA because he never communicated the problem before and just decided that it was a huge deal after being quiet for so long. Also because he's feeling emasculated and humiliated for this, which shows how he feels about house wives and their work.\n\nShe's not diminishing his contribution at all, she was expressing her gratitude for it, although in a cheeky way. I can see how that is something I'd say, with no intention of diminishing my partners role but just that it's a novel situation. But she wasn't saying anything bad. \n\nHis whole issue comes from his own insecurities and his internalized misogyny (not wanting to be compared to a \"house wife\").\n\nIf I fixed my husbands car and fixed stuff around the house and he joked that he had a \"handy woman\" to do stuff for him, even if he was laughing about it, I'd feel proud that he thinks I'm good at what I do. I'd understand the \"joke\" and take it as compliment.\n\nIt only goes to show how women are seen in society if saying the exact same thing with roles reversed is considered humiliating",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Agreed, because not to be funny but what else is he bringing to the table? Note how he said “a good job” and before we go into “he supported her blah blah”, she took out loans. A line cook can pretty much only support himself so he’s basically brought nothing to the table but a poor degree choice and some light cooking and cleaning. House hubby needs to tighten up. He’s not the AH for being upset but he’s the asshole for both his behavior after the fact and also for not trying harder to get a job, any job. I get it the market is rough but he’s not putting forth any effort at all. He’s literally not worked since she was in law school and that was a line cook. The more time passes the less employable he becomes. His MIL hasn’t warmed up to him because she knows he’s mooching off her daughter.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I agree with this. The wife made the statement multiple times and from the OP’s account, he never communicated how he felt about the term. He expected his wife to read his mind and that’s never going to happen. If she were to quit her job over a dispute or lack of apology, where would that leave them? I can’t say OP is an AH but definitely immature.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "It also seems like he never spoke to his wife about being upset about the term. My husband calls himself a House Husband with pride, and loves being able to stay home, do the work around the house, and then work on his hobbies. I come home to a clean house, laundry done, groceries bought and put away, and the animals taken care of. He can’t cook to save his life, and I love to do it so I do that happily. If he ever had a problem with this arrangement, or the term, I know he’d speak to me about this and we’d address it together. \n\nIt seems OP is resentful of his wife and is taking out his frustration and maybe jealousy at his wife.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 154,
              "content": "Exactly. It’s absolutely the way she said it that was wrong. It wasn’t loving. \n\nAnd she knows it, but refuses to take accountability.\n\nN T A op, but maybe have another conversation with your wife and not let this drag on.\n\nEdit: Read some of op’s comments and changing to ESH.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "EXACTLY. like yes he does take care of the household, but if he doesn’t like the label JUST STOP USING THE LABEL. it’s truly so simply",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I think you’re missing the context of the conversation. It’s not reductive to say “I’m glad I have [person of x job] to do [x job]” . Would you find it offensive if someone was asking about a lot of legal work she needed done and she said “I’m so glad I have a lawyer for that stuff!” . We are also hearing his view of events, so perhaps the tone was not as described.",
              "id": 27,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "agree it’s demeaning, but he needs to ask her to stop referring to him like that, rather than stopping his duties lol.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yeah I agree with this. The tone and words make all the difference. That said, I feel some type of way about OP finding the use of house husband being emasculating and by extension insulting. I feel like that points to his own gender biases. Plus, I feel that if being called a house husband (though technically that’s what he is) bothers OP so much, why he doesn’t get a part time job like he used to have. It may not be the ideal job but it could boost his self esteem.",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I feel like this just highlights OP as being the AH for not communicating because clearly everyone has different perceptions as to whether or not her comment was demeaning. Which is totally normal and valid",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Hell the fuck no. What id give to be a house husband. I put up with way more bullshit in consulting than some demeaning terminology which is an accurate description btw. A husband who maintains the house. Sign me the fuck up ASAP.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I agree. But He should have communicated bother even in the story she says it and he *still* doesn’t speak up. She has to probe  and ask.\n\nI think it’s rude she belittled his feelings tho. It may seem childish to her but she should take his feelings more seriously IMO  ESH. \n\nShe can’t read his mind",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Maybe OP should consider getting a job again like every other person not living off their spouse's income needs to do?",
              "id": 33,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 610,
          "content": "If OP doesn't like being called that, his wife shouldn't do it. And the wife and her mom were being dismissive of OP. AND his wife is ignoring his feelings.\n\nFWIW, I'm a woman, and if I were at home, I would not want to be called a housewife.\n\nEDIT: N T A\n\nEDIT 2 after reading OP's comments: ESH",
          "id": 34,
          "comments": [
            {
              "score": 624,
              "content": "But it honestly sounds like instead of just communicating how he feels and being open, he let his insecurities fester until he couldn’t hide it and it honestly sounds like he blew up at her. And now he refuses to do anything until he gets an apology instead of trying to have a sit down conversation. \nIt doesn’t sound like he’s getting the heart felt apology that he thinks he deserves, and now what is he honestly contributing to the household? He should take the initiative of a sit down conversation since he refused to communicate for 6 months before the relationship completely falls apart",
              "id": 35,
              "comments": [
                {
                  "score": 224,
                  "content": "\\^ This.\n\nHe's a grown adult, he can use his words and talk to his wife about how he feels. How hard could it possibly be to just sit down and say \"Hey, I do a lot of hard work to keep this place running, and the way you've been acting towards me lately makes me feel like you're dismissing all of that\"?",
                  "id": 36,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I feel like being called a house husband says the opposite of what he thinks of contributing nothing to the household. Although now he really is contributing nothing, and thinks that after he claims he doesn’t want everybody to think he contributes nothing, op now does exactly that. And then he’s shocked that she still refuses to apology when he thinks he did nothing wrong. I honestly have a feeling in a few months when nothing changes because he’s so hard headed, she’s going to end up going for divorce because what’s the point in making all the money, doing everything around the house, and not even sleeping in your own home?",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "True. He needed to just sit down with his wife at home and talk about it. They should let each other know what things that can't be done in a joking manner.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 354,
              "content": "And now that he said it she said she will stop doing it. She can’t read minds",
              "id": 39,
              "comments": [
                {
                  "score": 210,
                  "content": "Bingo! He didn’t tell her before that he didn’t like it. She agreed to stop once he did, but he waited until he lost his cool to tell her, instead of just calmly doing so privately at literally any point ever. \n\nI tell my husband this a lot: if you want to bottle up your feelings and *not* be honest with me, you don’t get to blow up at me later because I couldn’t  read your mind.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 175,
              "content": "As soon as he actually communicated his feelings she stopped. If he feels like she’s not appreciate him he should start by actually saying something to her. He can’t expect her to read his mind",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 71,
              "content": "She already agreed to stop saying it.",
              "id": 42,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "What term would you use for yourself then?\n\nI think the issue is less the actual term househusband, and more the implications that he’s “lesser” because he’s not the typical “male provider”. I think he would have been equally upset if his wife was using a gender neutral term like homemaker. It all implies he’s “domestic” and that’s emasculating to him",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I think OP needs to see Barbie.  Absolutely nothing wrong with being a house husband except the patriarchy tells us it's bad.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I was like \"aw she has a house husband\" before I even read that she was calling him a house husband. \n\nThe problem here is not the term house husband, it's the fact that OP does not like that he is, in fact, a house husband. He feels insecure about it and that's a him problem. I don't see his wife putting him down - if anything she's acknowledging how important he is because otherwise nothing would get done around the house. He's framing it as an insult only because that's his perception of the situation due to his own feelings about his role in the family. If he loved being a house husband, he'd be like 'damn straight I mow the lawn and it's the best lawn on the block thank you very much'.\n\nAs far as I'm concerned, OP has a pretty sweet deal. Being a stay at home spouse with no kids is cruisy! Maybe if OP doesn't like it, he can leave and see how easy it will be for him to make it on his own... because I hear animation is a very lucrative career choice...",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Exactly. If being called a house husband is a put down then so is being called a house wife. Each bring a lot of value into the relationship.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "He could always just get a job...but he enjoys the lifestyle, just not the label that comes with it. \n\nShe was actually grateful and appreciative, which is more than I would be. I was a single professional working long hours and earning well above the average; I hired a cleaner and had weekly meals delivered and survived perfectly well without a house husband...it was probably cheaper, too. Maybe you need to find another way to contribute so you don't feel like a jobless mooch, which is the actual issue and you know it.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 12698,
      "content": "YTA.\n\nDefinition of a house husband: a man who lives with a partner and carries out household duties traditionally done by a housewife rather than going out to work. You pretty much fit the description and there is absolutely NOTHING WRONG or EMASCULATING about being a house husband mate.\n\nIf you still felt uncomfortable hearing that term, you could have had an honest conversation about how you're feeling with her instead of doing something childish like this:\n\n>I've stopped doing the chores until she apologizes\n\nShe has nothing to apologise for as she said she'll stop using that term as soon as you asked her to.",
      "id": 48,
      "comments": [
        {
          "score": 2715,
          "content": "I was going to say exactly this. Grow up and stop being TA.",
          "id": 49,
          "comments": [
            {
              "score": 34,
              "content": "I wouldn't be surprised at all if he ends up cheating with a younger woman. He sounds exactly the type to blame it on being emasculated by his more successful wife.",
              "id": 50,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1828,
          "content": "Exactly, I kept reading and waiting for the part where OP calmly told his wife he didn’t like that term. He never once asked her to stop, and she was willing to do so as soon as she knew.",
          "id": 51,
          "comments": [
            {
              "score": 1357,
              "content": "Yep, I was waiting for the part where he overheard his wife saying \"he's so lucky I'm willing to support him and he gets to just be a lazy house husband who doesn't contribute\" but nope, she's telling her mom she wouldn't be able to handle the household without his help, just a straight up compliment.",
              "id": 52,
              "comments": [
                {
                  "score": 457,
                  "content": "I actually suspect she feels guilty about not contributing more to the household chores and these comments are her way of convincing herself that it’s okay. It sounds more like she’s trying to show appreciation for the work he does, but he’s somehow taking it as an insult.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Yes, exactly. As someone that was in an incredibly demanding field for many years, I would have laughed to think that I could even partially handle running a household in addition to working in my executive position.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 324,
              "content": "Right. If OP said “hey, I don’t like being called a house husband, can you word that differently?” This would be be a different conversation",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Yuuuup! That's exactly why I deemed him TA. How you gonna get progressively mad at her, not say anything for months, and then blow up on her?",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 187,
          "content": "All if the - OP also TA for letting it build up like that - don’t say anything for months and then have a snit about it, completely unfair",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I think OP has gotten a taste of what it has historically been like to be the traditional housewife, and he doesn’t much like it.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Bro's about to be just some guy without a job and not even a house husband if he keeps contributing nothing to the household.\n\nYTA OP",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "YTA. Exactly this. If you don't like it you could always.... get a job.  May not be your dream job, but something.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "If he doesn't like this term, he needs to get a job and contribute financially to the house. By refusing to do the chores, he's not a house husband but an unemployed lazy AH. Does he like that better instead?",
          "id": 61,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8181,
      "content": "But… you literally are a house husband. If this were the other way around, surely you agree that she would be a house wife in these circumstances?  It’s also not saying you don’t contribute. It’s pointing out HOW MUCH you contribute. She is literally saying she couldn’t keep up without you. That’s giving you credit. \n\nAnd also…. It just is a fact. It may be temporary (or not, idk) but at this time, she is a bread winner and you are a house husband. If you find that humiliating, change it. But don’t get mad that someone else recognizes it as a fact. \n\nYTA.",
      "id": 62,
      "comments": [
        {
          "score": 3393,
          "content": "tone is important.\n\n“Thank god I have a house husband or else I’d never find the time to garden” isn’t exactly a compliment when it’s followed by laughter. \n\nThe same exact way that someone being a housewife isn’t a big deal, but going “thank god my wife is a housewife so I get to come home to a nice meal” is kinda condescending. \n\nIt’s like referring to your wife as “my housewife” instead of “my wife”",
          "id": 63,
          "comments": [
            {
              "score": 704,
              "content": "Exactly this. My mom would be extremely proud that her husband relies on her for a hot meal and she loves being the housewife. Me? Id feel degraded. Not that there's anything wrong with the label... But we can't always control how we feel about certain things. I'm more career driven and I suck at the domestic shit around the house. But... Tbh my heart isn't in it anyway. I hate cooking and cleaning. So if my husband ever said something along those lines I would feel like he's taking a stab at me to make me feel bad about myself. \n\nOp never aspired to be a househusband. He's just doing what needs to be done. But the label makes him feel like that's his duty and he should be proud but feels bad because he doesn't. I get it. He never envisioned that for himself and so any comments made towards it is very sensitive. He sacrificed his dreams to land on that role he didn't aspire to be a house husband. It hits different.",
              "id": 64,
              "comments": [
                {
                  "score": 167,
                  "content": "Except OP could go get a job if he wanted to… maybe not his perfect job, but a job nonetheless, so be did kinda choose it…",
                  "id": 65,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Exactly, it's not like there's children or a bunch of disabled cats or something that he needs to take care of. He just...isn't working. As an able bodied man. So he's 100% bringing it on himself and then hating the position he's in. I have nothing but irritation for these kinds of people. If he doesn't like being a \"househusband\" then go get a job. His wife is out there kicking ass, if he had half the drive he could be doing well too. But he's not, he would rather just complain about his circumstances (of his own design)  than do something about it. What's insane is that he thinks he's above something (being a housewife or househusband) but not realizing that a housewife or husband- especially that  have kids and manage all of that - are putting in an outrageous amount of work and sacrifice in everyday that this dude can't (won't) handle. \n\nAlso- yes I understand that he moved for his wife's work, but it sounds like they're not out in the boondocks. I'm sure that with a little ambition and creativity he could figure out some kind of work. He said he was a line cook- if being in a restaurant is interesting to him then he can work in one and/ or work there while training in culinary arts to be a chef or something. It sounds like his wife just wants him to do whatever he enjoys, while instead he's decided to feel belittled by her for his choices and then do absolutely nothing. What a guy.",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "It doesn't sound like he sacrificed anything except actually trying to get a job... He never even had one.",
                  "id": 67,
                  "comments": [
                    {
                      "score": 16,
                      "content": "[deleted]",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "If he doesn’t have a job then the house chores ARE his duty",
                  "id": 69,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "But I don’t see how your personal insecurities that (in this scenario) you haven’t shared with your partner are their responsibility? Like in your example if you never told your husband you find the term housewife degrading then saying he’s “trying to make you feel bad about yourself” is very unreasonable. Like just because you “feel” disrespected doesn’t mean a person disrespected you and they’re not at fault for your feelings.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 445,
              "content": "Not sure why people aren't picking up on the look and laugh. In no way did it come across as appreciative, just seemed intentionally humiliating. \n\nI just don't know why people are so cruel to their spouses. I've always felt that you should be the most loving and courteous to your immediate family. But what do I know,",
              "id": 71,
              "comments": [
                {
                  "score": 273,
                  "content": "I just can’t see it as intentionally humiliating when op in the comments said he knows for a fact she wasn’t saying it to be malicious. But feels it is emasculating because it suggests all he’s doing is domestic duties which he is only doing domestic duties. In my opinion he’s just insecure.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Is the look and the laugh because she called him a house husband or because she admitted she was incapable of doing something? Dude already admitted he was being insecure, I don’t think it’s entirely fair to assume she was laughing at him",
                  "id": 73,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "We're reading \"the look\" through his eyes and he thinks it's humiliating, so this colors his report. There nothing to \"pick up\" as it might not even be real, but embellishment or misunderstanding on his part. \n\nI can equally see this being her thinking she's being cute and affectionate and thinks it's endearing, not realizing it upsets him. She's giggling because she thinks it's sweet,  as people often do when calling their love by their personal pet name.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "The look and the laugh interpreted through an OP who already feels sensitive about this and is biased in this retelling?\n\nHow is it cruel to just make a factual statement and then agree to change your behavior once your spouse finally tells you it bothers them rather than stomping around like a petulant child?",
                  "id": 75,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "so replacing that phrase and obv not following it up with laughter.\n\n“Thank god i have my wife or else I’d never eat a nice meal” etc would change the meaning that dramatically? \n\nI’m reading that now and I do think for some reason just Wife or Husband is far less demeaning than housewife or househusband too",
              "id": 76,
              "comments": [
                {
                  "score": 23,
                  "content": "Yep! I wouldn't want my husband saying \"My housewife takes care of all the finances and gardening.\" It's almost like saying \"My house-elf does all the cooking and cleaning.\" or \"My house servant manages all of the dirty aspects of our household.\" When you put \"house\" in front of it, it instantly sounds derogatory--Like the person is just always in the house, doing all the stuff you can't be bothered to do.  \n\n\nI'm my husband's wife. I am also a housewife...but I'm not \"**his** housewife.\" He's not my boss. We're equals. I wouldn't say, \"My breadwinner earns all the money so I don't have to.\" He's more than his job--just like I'm more than my job.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 9,
                      "content": "They're clearly not the same? A factual statement vs a self-deprecating joke?\n\n\"My housewife does all the cooking\" He can fuck off\n\n\"Thank god she's a housewife, otherwise I'd never eat stuff this good\" Not the same thing\n\nThere are people who don't like the latter either, which is fair, but let's not pretend those two statements are the same",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Ya know, I’d even much prefer, “thank god we’re in a position where (first name) doesn’t have to work and can take care of all the jobs around the house.”",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I highly doubt “thank god I have a husband or else I’d never eat a nice meal” would feel any less emasculating to OP.",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Yep. And just because something is factually true doesn’t mean someone has to like it\n\n>My husband called me fat in front of everyone and I got mad\n\n>But you are literally fat\n\nCan be the same energy. I can also think of many cultures where “house husband” would be extremely emasculating especially around in laws. I don’t agree but that’s what some cultures value. \n\nThere’s a lot better ways to express gratitude to your spouse supporting you",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "It acknowledges that the breadwinner would be up shit creek without a paddle without someone doing the domestic labour at home. Much better than a partner pretending they could hold down a full time+ job while doing all of the domestic labour and child rearing and still get to enjoy hobbies on the weekend.\n\nI am a housewife. If I can say thank god my husband is a banker or I couldn’t spend my weekends doing hobbies, why can’t he say the reverse? It’s an accurate description of my role in the household.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I don’t know, maybe I’m too autistic but I don’t see an issue with this kind of tone in cases of someone being well-meaning, and I generally assume spouses do not hate each other or intend each other ill will\n\nEdit: never mind, he said himself in his comments that his wife did not mean it negatively, and that he feels it is negative because of the emasculating nature of house work.",
              "id": 83,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "It was just a joke without meaning to be offensive. If my husband cooked every night I could say \"thank god I have my personal chef at home or I would eat like crap\". It's cheeky but unless it's said in a context of a lot of other dehumanizing comments/actions it's just a funny way of saying im thankful that he cooks for me.\n\nIf he joked that \"thank god I have a sugar mommy that works so I can stay home\" wouldn't that be just a joke?",
              "id": 84,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 477,
          "content": "Yeah, to those that are saying it would be wrong if genders were switched, it really wouldn't. \n\nIf a housewife heard her husband say 'thank goodness for my housewife, I wouldn't find the time' in conversation with his dad, I bet she'd be thinking 'damn right, you'd be lost without me'.\n\nThe important thing is she stops once OP tells her he doesn't like it. People aren't mind readers and communication is important.\n\nEdited to add: YTA. Your response is immature. She said she would stop using the term once you expressed your dislike. If you stop doing the household tasks, she could also stop paying for your expenses, including housing and food. It sounds like the deal was, she pays for expenses while you do housework, no?\n\nEdit 2, commented also further down: If I were her, I'd probably laugh after saying it too. It's absurdist humour. A house husband was unheard of not too long ago.\n\nBut I can see how he can take it the wrong way if he is already feeling insecure.\n\nAlso can see how she doesn't want to apologize if she didn't mean it to be demeaning. Apologizing would mean conceding that 'house spouse' is inherently demeaning regardless of intent.\n\nEdit 3: For those that disagree with me, please check OPs comments. He literally says he knows that she didn't mean it in a negative way. He says the phrase 'house husband' is emasculating no matter the context or intent",
          "id": 85,
          "comments": [
            {
              "score": 33,
              "content": "even the title is immature, \"I stopped doing chores for my wife\" bro, you're not doing chores *for* your wife, you are maintaining a household, call yourself a butler or a handyman if it makes you feel better, but you're not the hired help, your maintaining your own damn household.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "I want to know what OP puts as his job on his taxes every year.  Does he put unemployed even though that isnt really fitting? Maybe homemaker or houseperson would make him feel better?  If/when they have kids, he’s going to hate the acronym for a Stay At Home Dad…\n\nPersonally, i’d want to be called a “kept man”.  The analogous female version is defined as follows:  “a woman who is given money and a home by a man who visits her regularly to have sex” - sounds pretty badass honestly.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "Maybe he would prefer the term homemaker? Not sure why a title will make him feel more confident",
          "id": 88,
          "comments": [
            {
              "score": 8,
              "content": "It won’t. He has already expressed that he finds it emasculating… i.e. he doesn’t think taking care of the home is “man’s work”. It’s actually pretty sexist and lame tbh. He is a house husband not matter what term is used, and it obviously bothers him. His issue is way deeper than his wife using that term.",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Maybe she can refer to him as unemployed instead",
          "id": 90,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Good thing for the wife is she seems to be doing just fine without this mopey AH",
          "id": 91,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5370,
      "content": "INFO: How is being called a \"house husband\" emasculating? Housewife has been used forever and it's not a degrading term.",
      "id": 92,
      "comments": [
        {
          "score": 4215,
          "content": "Because he sees the labor typically provided by women to be worth less than the labor provided by men. It's just toxic masculinity and misogyny.",
          "id": 93,
          "comments": [
            {
              "score": 932,
              "content": "YEP. I was honestly sympathetic until he dropped that little gem, and then I stopped GAF.",
              "id": 94,
              "comments": [
                {
                  "score": 95,
                  "content": "This is exactly where he lost me as well. He agreed to this role, played along with the terminology giving his wife no indication he was upset, then went off and quit performing the role he agreed to instead of talking to his wife about it from the first time she said it. Everyone in here talking about if roles were reversed- I wonder how OP would feel if his wife bucked on the role SHE agreed to and left him to figure out the bills. It’s asshole behavior that could have been avoided with a conversation from the jump.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 7,
                      "content": "EXACTLY. Maybe she should just stop paying all the bills since apparently that is how issues are solved",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Same, all I started to hear was \"wah wah gender roles\" \"wah wah women should do this only\" \"wah wah I'm a man so it feels bad\"",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 205,
              "content": "This is exactly it.  The very root of his objections boils down to this.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Ding ding ding ding!!",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Came to say the same. It's shitty to suggest that a job often taken by a woman is something \"bad\"",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Exactly. His shame and discomfort with the term is rooted in misogyny.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "thank you. scrolled looking specifically for this. this is exactly it.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1161,
          "content": "It’s only emasculating if you consider housewives to be “less than” for doing household tasks and chores. Turns out, if it walks like a misogynist and talks like a misogynist….",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 765,
          "content": "I've been a house husband for about a year now after losing my job while at the same time my wife started making significantly more money than I had  previously (after me being the sole money maker for around twenty years). She'd recently completed an engineering degree and after a long drought of job hunting, got some good fortune.\n\nI get how it can feel emasculating, I really do, but that's really just your perception and something you need to figure out how to either change or get over. We have three kids old enough to recognize the new dynamic, which adds another layer.\n\nI'm taking the time to complete the education that lost importance when I was working to support us, and plan to renter the workforce, but honestly, that's going to take a back seat to keeping our family running as it's doubtful I could replace her income any time soon.\n\nYou need to decide if you're happy with what you are, and work to change it if not. Her accurate read of the situation doesn't make you less.\n\nI'm reserving asshole judgement, as I'm not clear from the post if she was using the term to degrade you or not. You shouldn't view this any differently than a woman being called a housewife though. That's just silly gender roles and semantics getting at you.\n\nETA: I reread and YTA for refusing to do your job while she continues to do hers. She agreed to stop calling you what you are because it bothered you, which is silly, showing she's the bigger person.",
          "id": 104,
          "comments": [
            {
              "score": 182,
              "content": "I spent three different layoff periods, one an entire year, as a \"house husband\". I spent that one keeping the house clean, the baby taken care of, the errands done , and dinner cooked every day. And I was fucking proud of it, and if anyone said \"babysitting while Mom is out?\" I said \"no, I'm being a father.\" And that shut them up with the stare I gave them.",
              "id": 105,
              "comments": [
                {
                  "score": 24,
                  "content": "I really appreciate your and others' responses and stories. I'm also proud, we'd just moved and I got a lot accomplished and also allowed my wife to make a lot of career progress in a short time. She's also appreciative and generally a great partner",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I have sole custody of my daughter.  I'm a full time parent, I work full time and literally handle almost everything, full time. With the exception of the help I receive from friends, family and my girlfriend who is currently no longer living in the same house as me.  I still hear that babysitting shit.  Not as much as I used to now that she's going on eleven years old.  I've been doing this for almost half of her life.  I can see how that would get on your nerves.  I remember taking her to parks or wherever, when she was younger, and women  would feel the need to insert themselves as if I couldn't handle whatever I'm doing.  Perhaps I just perceived it in a negative way, but I don't think so.  I can understand how that term can be insulting.  A lot of times I don't think people mean it in the manner that it is perceived.  Regardless, it's struck a nerve plenty of times.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "It’s also not un-manly to take a breather after being the sole provider for decades.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "My bf - not even my husband - couldn't find a job for a year recently, so he went back into education to make a mid career switch to a higher paying path. While doing that he was taking care of my entire house - to be fair it was basically a room - but I barely lifted a single finger. I was really worried that he felt used or emasculated, but he said he never felt that, and felt that he was being valuable and that it lifted his self-esteem to be doing household chores.\n\nBecause he never once thought those things were beneath him. \n\nOP is so YTA.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "He says in a comment that he knows she didn't mean it negatively.",
              "id": 110,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "My husband and I switched roles for a while. He was home with the kids AND studying to finish his degree while I was the main breadwinner. We just took care of each other’s needs. We both agree that taking care of the kids is much harder than being in the workforce. We both have an appreciation for how hard it is to maintain the house. We both have a great relationship with our children and each of us is seen as a caretaker by the littles. He also now makes 3x’s what I do.\n\nThere have been so many benefits to role reversal.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 416,
          "content": "It’s not. Emasculation doesn’t exist. If OP thinks that certain jobs, appearances, tasks, even comments, make him somehow less of a man, it says something about what he thinks of men and women. It’s not anyone’s job to make you “feel like a man” - whatever that means. Apparently someone who makes money? Okay, OP, so do women become men when they get paid for their work? When people respect them? Emasculation is a super regressive concept. A man is still a man when his boss is a woman, if he wants to paint his nails, raise kids, care for the home, when he’s kind or knits a sweater. There is no innate maleness that is lost by engaging in activities stereotypically associated with women. Seems a bit like OP thinks a certain level of respect is afforded to him (by never ever associating with him with things that that could be confused as woman stuff), because he’s a man. \n\nYou’re just a person OP. Like women. Having stuff in common with women isn’t an insult. There’s nothing wrong with being a house husband, or a housewife, and you should examine these super regressive views you have, especially since it’s clearly causing you upset.",
          "id": 112,
          "comments": [
            {
              "score": 16,
              "content": "🎯. this one right here. his problem is 100% self-inflicted.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": ">Seems a bit like OP thinks a certain level of respect is afforded to him because he’s a man. \n\nExactly. His comment that the term “house husband” implies he doesn’t contribute anything as her husband except for domestic things implies that he believes there is some intrinsic value in just being the husband, which I’m sure he doesn’t believe about wives. He’s basically saying he deserves respect just for being the man in the relationship, period.",
              "id": 114,
              "comments": [
                {
                  "score": 7,
                  "content": "Exactly. He believes he is supposed to get authority and some special way of treating him related to his being a man. What a strange thing to assume. She should pretend he’s not a house husband, since he can’t feel manly enough if he’s a house husband? Ridiculous.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Being a house husband is emasculating, but leeching off his wife while he does nothing isn’t? Make it make sense.",
          "id": 116,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "It’s emasculating if you’re a fucking crybaby about it",
          "id": 117,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "This is the point though isn't it? All the men who would complain in this situation are just misogynists aren't they?\n\nThey see it as emasculating because it's 'women's work', it IS a degrading term to them, and they think they're too good for it.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Typical macho: \"I'm the man, she's the woman\" crap.",
          "id": 119,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Because, in general, men are taught that their value is based on their ability to provide for themselves/their family. A househusband contributes to the functioning and maintenance of the household, but doesn’t provide the household itself or the means to do the maintenance. Technically it isn’t an insulting term and in a healthy, open, well-communicating relationship it shouldn’t be emasculating. \n\nIn this case, it sounds like OP is mentally emasculating himself. If he had discussed his feelings and mindset with his wife instead of blowing up about it, it likely wouldn’t have come to a head. She said she’d stop as soon as he said something. And it certainly doesn’t sound as if she thinks any less of him for his role in their house. OP is being childish and actively ruining his marriage cause he got butthurt. He’s going to lose his frankly sweet deal cause he got in his feelings.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3999,
      "content": "YTA\n\nBeing a housewife isn't demeaning and it's a thankless, important job for a household. Women understand that and that's why the term house husband isn't offensive to them. It is a tough job women have done thanklessly for men for generations. To have a man reverse those roles shows he understands it's value, and that's why the women in your life are laughing and talking about it. A man willing to be a house husband is usually considered a catch in a world full of men who won't even do the laundry without whining.\n\nI think you need to reevaluate why you think being a house husband is emasculating or devalues your work. You must think that it makes you \"lesser\", but why? Why is being a housewife so shameful? Do you think less of the women who do that job? So many women have given up everything, their careers, financial freedom, and lives to fulfill this role. Why is it okay for them to make that sacrifice but shameful for you?\n\nYou ARE a house husband. Get over it and think about what that means instead of what other men have told you to believe.",
      "id": 121,
      "comments": [
        {
          "score": 1624,
          "content": ">I think you need to reevaluate why you think being a house husband is emasculating or devalues your work\n\nAnd why he thinks he's \"doing chores FOR my wife\", he's the one who seems to think this is a gender issue.",
          "id": 122,
          "comments": [
            {
              "score": 735,
              "content": "Lol and they don't have kids? Like what's he doing all day? Repainting the walls over and over?",
              "id": 123,
              "comments": [
                {
                  "score": 810,
                  "content": "It’s crazy how people are glossing over this lol. He isn’t staying home to fulfill a need for the family and kids. He isn’t staying home because childcare is expensive. He isn’t “taking one for the team”. \n\nHe is staying home because his Pixar dreams didn’t pan out and instead of shifting gears and pursuing a new field like most people would, HE decided he’d just take care of the house since his wife makes enough. \n\nNow he’s upset that people are calling it what it is because he wants to cosplay as a “traditional man”.",
                  "id": 124,
                  "comments": [
                    {
                      "score": 319,
                      "content": "exactly lol. she never called him lazy or useless or said he’s “not contributing to the household”. but it sounds like he knows that’s the reality so he’s projecting his valid insecurities. major YTA \n\nnot to mention the pouting and refusing to do work, no wonder she’s leaving his useless self to hang out with friends every night. hope the apology he’s not getting is worth the inevitable divorce.",
                      "id": 125,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 104,
                      "content": "I can’t believe I had to scroll so far down to find this comment. It would be different if they had kids but they don’t.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 81,
                      "content": "He's just a stay at home husband. Most people scoff at \"stay at home wives\" because that's a sign of financial security and it's quite luxurious because a lot of SAHMs do it because the loss of salary is literally worth the cost saved for childcare. \n\nHis wife is actually being really polite by saying \"househusband\". Like, people acknowledge that housewives aren't glamorous but they do a lot of shit.",
                      "id": 127,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "\"Any day now. I'm gonna get me that job\"",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 56,
                  "content": "Like, I complain about how annoying it is to cook and clean for myself every day but that's because I'm working at least 8 hours a day, so cooking myself dinner just makes my day that much longer. If I had no other tasks besides cooking and cleaning after two adults, that's not a full day's work. I'd love to say the house would be so clean, but I imagine I would just be cooking much more elaborate meals and the house would be regular clean, instead of barely clean like it is now (and my knitting would get done a whole lot faster).",
                  "id": 129,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Right??? When we moved after I graduated, I had a 1 month lag between moving and my job starting and I was effectively a house wife for that period (stay at home dog mom I joked). I workout for several hours, finish all cleaning, keep the laundry baskets empty, and make a scratch dinner + dessert in just a few hours. I typically had 5-6 hours of leisure during the work day",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Yup, I don’t think being at stay at home parent is less valuable than a working parent, but I’ll be perfectly honest, I do think a house spouse with no kids to take care of and no other special circumstances is inherently just doing less. Not saying that person as a human is worth less, but they are objectively doing less.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Agreed, if there were kids in the situation, it would be a completely different dynamic.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 337,
              "content": "Yes, how is it FOR my wife? You’re just contributing to the household chores, you enjoy the garden as much as your wife.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 166,
              "content": "I seriously eye rolled at his mentioning he is doing chores “for” his wife. So gross. OP YTA",
              "id": 134,
              "comments": [
                {
                  "score": 7,
                  "content": "I thought I was gonna read a laundry list a mile long of chores she makes him do but no he’s just doing household chores",
                  "id": 135,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 127,
              "content": "Yes. That stood out to me to and that tells me he is TA.",
              "id": 136,
              "comments": [
                {
                  "score": 9,
                  "content": "That, and also why didn't he say anything before. Don't awkwardly laugh and otherwise stay silent when someone repeatedly says something you don't like, discuss it like an adult.",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "I came here because of the title! As if he wouldnt be doing the same chores if he were single. LOL",
              "id": 138,
              "comments": [
                {
                  "score": 16,
                  "content": "and he wants a good-paying job, something around her income or higher, I bet he thinks that the one who brings more money will be exempt from doing any chores, lmao!!",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 167,
          "content": "Literally all of this. \n\nI would *love* to make enough money for my boyfriend to (in the future) stay home and be a house husband, or take care of the home and work part time doing something he loves and enjoys that isn’t about the money - if he wanted to. \n\nIt’s not an insult at all, it’s very high valued to us because we get what it takes to run a household.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 114,
          "content": "👏👏👏👏",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "Being a housewife is only a thankless job if the housewife is married to an asshole.  If you are married to a real partner, it is a frequently-thanked job.",
          "id": 142,
          "comments": [
            {
              "score": 12,
              "content": "As it should be!",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I came here to say this. My work outside the home isn't terribly time consuming, so I volunteered to be the one who does all the household stuff. I'm happy to do it, and my husband thanks me regularly. I know he appreciates everything I do, as I appreciate everything he does. That's what a real partner does.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Exactly. My fiancé tells me everyday, usually multiple times, how much he appreciates all I do for our household. He expresses his gratitude in other ways as well. I’ve never felt taken for granted.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Yes. She's not only thankful that she has a husband, she is thankful that she has specifically a house husband, a man she loves who is willing to take care of their household tasks full time while she works.\n\nI don't call my SO my house husband even though he doesn't bring in any income, he doesn't deserve the title. He works on his start up full time so we still share the chores. But if he spent all his working day doing housework, I'd be so happy about all these chores I don't have to do, I'd call him house husband to my friends and family too",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "There's a whole anime called Way of the Househusband and that's me and my partner's goal lol. I even bought my partner the apron he wears in the show and he loved it. My partner is very \"manly\" and would love to be a house husband. Sounds like some toxic masculinity going on.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "If I had an award I’d be giving it to you! This should be top comment",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Right?\n\nMy dad was the one that stayed home the most, took care of the house, the yard, etc.\n\nHe works, just not a consistent kind of work (landscaping is either booming or not in their area), whereas my mom is a nurse so get job is consistent.\n\nIt was never emasculating for my dad to be there one that did more of the house and yardwork, it was just, how things worked for them.\n\nMy fiance and I have talked about if we ever have kids and financially need someone to be the STAP, it's going to be him, not me. I'm a nurse, I make 3x what he does for his job, his job is important and even dangerous, but it doesn't pay what mine does. It would make no sense financially to add an extra mouth and then the better paid person quit work.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3671,
      "content": "Sounds like you have a plan\n\nShe will work and come home and cook for herself.  And do the chores important to her\n\nAnd you will….sit home and do nothing except make meals for yourself?\n\nGood plan. She’ll eventually wonder why she is pulling all the weight and thatd teach her.  She should find someone else that helps out around the house",
      "id": 150,
      "comments": [
        {
          "score": 746,
          "content": "And they’ve only been married 5 years so it’s not like he’s going to get much in a divorce, maybe a few years of spousal support but I’m sure their debt is still pretty high.",
          "id": 151,
          "comments": [
            {
              "score": 307,
              "content": "If she borrowed money for law school and he worked as a line cook, there is without a doubt a stack of debt, half of which will go to him in a divorce. Whatever spousal support he gets is not going to counterbalance the debt amount. If he’s smart, he’ll forgo spousal support in exchange for her taking on all the debt.",
              "id": 152,
              "comments": [
                {
                  "score": 317,
                  "content": "If he were smart, then he would have continued living a life that a lot of men would consider as having it made.\n\nWhat you suggest is exactly what my ex should have done and refused to do. The judge not only didn't grant him any spousal support (since like OP, he was willfully under-employed), but did grant him half of my medical school debt (which I never asked for).",
                  "id": 153,
                  "comments": [
                    {
                      "score": 104,
                      "content": "That is hilarious, and congratulations to you on dropping half that debt! I can’t say it wasn’t deserved :)",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 59,
                      "content": "> If he were smart, then he would have continued living a life that a lot of men would consider as having it made.\n\nIf my wife was the one working and I got to stay home and play games, after doing my daily chores or whatever, you better believe I'd love that...\n\nMy wife doesn't work (due to health reasons), but gets stuff around the house done. I work lates so she only needs to sort herself out for dinners 5 times a week but still, I WISH I had her life at the moment 😂\n\nOP basically has it easy from what he described.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 439,
          "content": "The plan is she can afford to divorce him and hire people to help her with those chores, may even cost her less. \n\nOP you’re the only one who can get yourself out of househusband. Your first step should be looking for a job.",
          "id": 156,
          "comments": [
            {
              "score": 93,
              "content": "It will definitely cost less. She works long hours, she has no time to mess up the house that much",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "If you know how much money you would spend to avoid frustration, then you can put a value on being frustration-free.  I wonder how long it will be before OP's wife thinks it's cheap at any price.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Getting an unemployable degree, being unemployed, lucking into a powerhouse wife that supports you, getting hired as a househusband, and still blowing it? \n\nIs this the most unemployable man that’s ever walked the planet? He’d find a way to get himself fired while volunteering 😭",
              "id": 159,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "Exactly what I thought. You think she doesn't fully appreciate your value as her husband? So make sure you contribute *nothing*. \n\nThat will sure show her how valuable you are...",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 41,
          "content": "Might be much cheaper too....",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "His plan is to teach her to live without him. It’s not that hard to pay for a maid op. LMAO",
          "id": 162,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "He withdraws the household tasks and she withdraws the funds that pay for him to live comfortably. Seems like a tale as old as time but reversed gender.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This dude married a lawyer and is deciding to play games. Not hard to figure out where the brains are in this one.",
          "id": 164,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Right like he is whining she isn’t appreciating his value add but he isn’t saying what that is now that he’s just lazing about",
          "id": 165,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "They don’t even have kids (probably a good thing)… so he’s just a “stay at home person.” What would he even do at home all day?",
          "id": 166,
          "comments": [
            {
              "score": 8,
              "content": "And she’s never home so most of the chores he’s doing are just cleaning up after himself",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "He will make meals for himself that SHE is paying for.",
          "id": 168,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2762,
      "content": "Dude. \n\nUse your fucking words. When you asked her to stop, she said she would. She isn't gonna know you're upset unless you say something. \n\nBut idk maybe you're too much of a man to actually fucking communicate \\*eye roll\\* \n\nYTA",
      "id": 169,
      "comments": [
        {
          "score": 724,
          "content": "This is a dude who is probably super fine and dandy with the term “housewife”, but it’s somehow derogatory if gendered with a male term, “house husband”.",
          "id": 170,
          "comments": [
            {
              "score": 230,
              "content": "Considering he used the word “emasculate” in this case, I suspect you’d be very correct.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 206,
          "content": "This is my hangup. He silently seethed for an extended period of time and fostered resentment for her. When all he had to do was ask.",
          "id": 172,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Why use words when no chore do trick.\n\nOp probably Kevin out of office.\n\nYTA",
          "id": 173,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "THIS. THANK YOU.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1866,
      "content": "Sounds like she was using “house husband” in a rather complimentary way to me - she’s probably sick of defending the progressive roles you’ve taken on & approached it w/ family as a light-hearted way of deflecting from others’ (antiquated) judgements. If that’s the arrangement you’ve both made & are happy with it, it’s nobody else’s business & I’d be inclined to joke it away w/ narrow-minded, old school family members as well.\n\nThat being said…you wouldn’t be so defensive about this if you weren’t feeling some type of way about the arrangement already. And if that’s true, get a job. Any job. You “stooped” to being a line cook once, you can do it again. Restaurants are always hiring back of house. It’s not like y’all have small children & made this decision for SAH parent reasons. Nothing is keeping you from leaving the house.\n\nDon’t take your insecurities out on her by pulling a full-on stand off about this, or else she’ll eventually wake up & realize she’s already doing everything on her own anyway, why support the equivalent of a temperamental child?\n\nDo you wanna cut your arm off to prove a point & be right, or do you wanna be happy? YTA.",
      "id": 175,
      "comments": [
        {
          "score": 161,
          "content": "You can be right, or you can be happy. \n\nOP doesn't seem to realize he's a kept man. Now he's neither right nor happy.",
          "id": 176,
          "comments": [
            {
              "score": 30,
              "content": "Ain’t that the truth. ☝️😂 Imagine choosing wrong & sad because (**checks notes) *semantics.*",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "🎯.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Nailed it",
          "id": 179,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1755,
      "content": "Gentle YTA.\n\nYou took “house husband” as demeaning because you look down upon *house wives.* If you saw the term “housewife” as having the connotation of huge contributions it should, you’d be proud to be called a house husband.",
      "id": 180,
      "comments": [
        {
          "score": 492,
          "content": "Yep YTA. You’re literally a househusband. This hatred you have for your role in your marriage is totally self-inflicted. Your wife seems happy and there is nothing wrong with supporting your wife in her career by taking care of the household chores.\n\nUntil guys stop treating househusbands and stay at home dads like they are somehow lesser than some dude who works at Walmart, things are never going to change.",
          "id": 181,
          "comments": [
            {
              "score": 24,
              "content": "I agree with you both but my main issue is more with his phrasing in the question posted here than his being offended. \n\nTo ask “AITA for no longer *doing chores for my wife*?” Is akin to a parent stating they don’t feel like *babysitting* their own kids. He’s not *doing chores* for his wife. He’s doing the jobs he agreed to do via their household division of labor which benefit *both* of them while she does her part earning money for their household.",
              "id": 182,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Came here to say this!!",
          "id": 183,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yes, it's like OP ran straight into the point but somehow still missed it. He was so close.",
          "id": 184,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1264,
      "content": "YTA\n\nFirst off, it’s the correct term. What would you prefer to be said regarding the work you do? That you’re an unemployed mooch? A sugar baby? \n\nA house husband is the accurate term to describe your work and contribution to your family. It isn’t emasculating. What’s the alternative?\n\nYour wife clearly appreciated what you do and recognizes that the home wouldn’t be nearly as good without your work.\n\nWhat makes you an asshole is that you never bothered to share your insecurities with your wife. You never bothered to have a conversation. You blew up about it instead and have now gone on with your temper tantrum and are now officially contributing nothing to the household and are just leeching off your wife. \n\nIf you don’t want to be a househusband then don’t. Get a job and contribute financially.",
      "id": 185,
      "comments": [
        {
          "score": 254,
          "content": "This is the best comment on here, OP needs to get over it. as a women who has been a SAHM and housewife, I never batted an eye when called a housewife.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 222,
          "content": "YTA, you just kinda told on yourself that you don’t see a stay at home wife / housewife as contributing anything even tho she’s supposed to do all the stuff that is your responsibility around the house. If you stop doing your share of the responsibilities you’re not even a -good- househusband you’re just a deadbeat",
          "id": 187,
          "comments": [
            {
              "score": 9,
              "content": "Seriously. What's to stop her from ditching him and hiring a housekeeper and lawn service if he keeps this up?",
              "id": 188,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 218,
          "content": "She just needs to start calling him her gold digger, which is how men actually refer to women in OP’s position (unemployed, no kids).",
          "id": 189,
          "comments": [
            {
              "score": 78,
              "content": "Literally! I see so many comments here saying \"what if the roles were reversed!\" As a way to support OP....like, she'd be crucified and called a gold digger, that's what would happen.",
              "id": 190,
              "comments": [
                {
                  "score": 36,
                  "content": "The roles have been reversed for most of history. We already know how women are treated when the roles are reversed. Some people just like writing creative fiction.",
                  "id": 191,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "I wonder if he’d rather prefer the term unemployed?\n\nI mean he  currently does not have a job.\nSo if someone asks the wife what he does for a living, she only has very few options: househusband, homemaker, unemployed. \n\nMay be he should pick one and let her know?",
              "id": 192,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 120,
          "content": "i 100% agree. the thing that’s so funny here is men HATE to be treated like they treat women 😂😂😂😂😂😂😂😂😂😂",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "OP is mad at his own internalized sense of gender roles and broader social gender roles.  \n\nReally, like you said, it's not his wife's fault that there isn't a term for his role that doesn't come with broader negative social context.  He *knows* his wife isn't judging him.  If he needs her to jump through a bunch of euphemism hoops to describe his role in the household, that's on him (and society).  \n\n>If you don’t want to be a househusband then don’t. Get a job and contribute financially.\n\nHe's not too good to maintain high standards for his worth as a potential working man though!  (from his comments)\n\nBest option is obviously \"getting the hell over it\", but if he keeps all this up, she's probably going to divorce him and he can be broke *and* have to do all his own chores.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "And he only told her cause she asked.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "The correct term: bum.\n\nHe is a bum - and objecting to being elevated to a higher status.",
          "id": 196,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Rofl \"ExCUSE you I am NOT a househusband, I'm a MOOCH! Or if you prefer the technical term, I'm a deadbeat husband, thank you VERY much.\"",
          "id": 197,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Unemployed mooch 💀",
          "id": 198,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}