{
  "post content": "My uncle 53 is a complete asshole. He is vulgar and rude. He positively delights in being as offensive s possible. My grandmother says it's from a brain injury when he was young. I have never seen proof of this. My dad 50 has put up with this his whole life. \n\nWhen I asked him about it he just says that is the way his brother is and always has been. \n\nMy mom basically banned him from our house when I was growing up so I only saw him at family events. At weddings where he would say the groom looked like a f**, or that the bride looked pregnant. Thanksgiving where he would tell offensive jokes at the table. Or a birthday party where he said the food tasted like shit. \n\nI M27 recently bought a house with my girlfriend 23.  It is small and needs work but we can afford it with a lot of help from our families and the bank.\n\nWe had a housewarming this weekend and had a BBQ. It was the first time we could host a big group as I only had a bachelor apartment and my girlfriend lived with her dad.  \n\nMy dad invited my uncle, I did not. \n\nMy uncle shows up and starts being himself. He starts calling my home a shit hole and asks my girlfriend why she is with a loser like me. \n\nI ask him to come out in the front yard to talk for a second and I read him the riot act.  I do not give a shit that other people have coddled him his whole life. If he cannot be civil then he is welcome to GTFO. \n\nI was not quiet. I'm pretty sure everyone in my back yard could hear me telling him to behave like a fucking civilized adult. \n\nHe left, but spent the rest of the day texting everyone there including his mom, my grandmother, and saying that it's not his fault that I overreacted to his behaviour. It put a damper on the party. His family are kind of on his side. But my mom's family and my friends are backing me. \n\n AITA?",
  "id": 1,
  "comments": [
    {
      "score": 14044,
      "content": "NTA. It’s your home and he disrespected you in it.\n\nAlso, your dad was out of line for inviting your uncle without consulting you first.",
      "id": 2,
      "comments": [
        {
          "score": 3590,
          "content": "If you can’t respect your host, then you should leave, plain and simple.",
          "id": 3,
          "comments": [
            {
              "score": 1537,
              "content": "[removed]",
              "id": 4,
              "comments": [
                {
                  "score": 919,
                  "content": "I mean you can't really learn your way out of disinhibition, that is kinds of the problem, but the fact that the uncle is not in any way apologetic is strong evidence that he is just an AH.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 657,
                      "content": "Yeah you can't learn in the same way someone on the spectrum might intellectually learn to recognize social cues even if it doesn't come naturally.\n\nBut in that case the family should have myriad strategies for addressing his behavior - go-to reprimands, taking him out of the situation, not expecting him to socialize with people who don't know him, distractions, meds even. They shouldn't just be letting him spray his asshole energy all over a social gathering.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 221,
                      "content": "Yeah, that's pretty much like Eric Cartman pretending to have Tourette, just so he can enjoy unapologetically being a huge AH to everyone.\n\nAnd if you really were disinhibited, then I'd imagine you probably couldn't even be convinced to leave, but would rather react by instantly going ballistic. If he can control his (re)actions, but just doesn't because he don't feel like it, then brain damage is a bad excuse.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 123,
                      "content": "I met someone that had suffered a traumatic brain injury. They were kind of exhuberant and definitely disinhibited, but that didn't make them an asshole. Sometimes saying stuff in public that shouldn't be said in public is one thing, but if their supposed lack of inhibition makes them a 24/7 bile spewing machine, they were probably an asshole to begin with anyway.\n\nThere have obviously been plenty of cases where brain damage did cause drastic personality changes, but Occam's razor suggests that he's probably just an asshole.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 47,
                      "content": "You can be disinhibited and also an asshole. Surely if it was just disinhibition he'd probably say some nice or just plain odd stuff too, but the fact that his constant outbursts are mean and judgemental means he's probably an asshole too.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "Yeah, OP is NTA. \n\nStorytime: My mom dated someone with a brain injury over a decade ago. It caused him to develop explosive anger, among other things, I'm sure, that I wasn't made aware of. I was 17 when they dated. I remember Thanksgiving that year, I was sick as hell, but was crawling out of bed hungry and planning on getting a bit to eat and to say hi to the family. I wear hearing aids, but my ear canals were a bit swollen and I didn't put them in. I was almost at the door when I heard this guy slamming the table and YELLING at my mom over something. I heard him clear as day, WITH my being hard of hearing, and after a bit, my uncle got involved and yelled back in defense of my mom. Nobody else had the balls to, myself included. I was standing at the door shaking. I'd never heard ANYONE yell like that before, much less a full grown man. Dude stormed out of the house a few minutes later and it was a solid 10 before I felt comfortable leaving my room. Thankfully nobody was hurt, but mom was in her room crying. Dude has a brain injury, but he was still responsible for blowing up like that. He was still responsible for berating my mom, and he owed (and gave) her a sincere apology, which she accepted, but still broke up with him. She didn't wanna be treated like that, and she DEFINITELY didn't want to see her kids treated like that, especially after her cousin saw my face ten minutes later and said she'd never seen a teenager so terrified. \n\nThere are still consequences for behaving like that, as there should be. You can't allow that kind of abusive behavior to be acceptable or you have AH's like OP's uncle who think it's funny to be so cruel.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "And the fact that the father says he has always been that way..i wonder how old he was when he got that injury? The father has known him since he was 3 years old.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "And disinhibition doesn’t mean all of your internal thoughts made external have to be inherently nasty. He can’t keep his thoughts to himself because he has a brain injury, but the thoughts he can’t keep to himself are shitty because he’s an asshole.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I'm not familiar with the term \"disinhibition\". I'm assuming it refers to damage to the part of the brain that controls inhibition. Years ago I had a roommate who was a speech therapist who dealt with people who had had strokes. They would use a lot of profanity when they talked because of the damage to a part of their brain. She would give them therapy, where she would get them to speak without swearing at people. If the uncle has brain damage, he probably could get treatment. Whether he has brain damage or is just an AH, it sounds like family members just don't want to deal with it. NTA. You have a right not to be insulted in your own home.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This reminds me of a post where someone’s sister had a TBI that caused extreme hyper sexuality, to the point that she was needing to masturbate every time she saw OP’s husband. She also had immense shame and guilt about it, which made it such a hard situation. \n\nYou’re right—you can have disinhibition, but you can also feel apologetic and guilt for it. The lack of it here makes it hard to give the uncle any leeway.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I had a pretty damn bad TBI, had to relearn how to read. It definitely changed my behavior, attitude, risk assessment, memory etc. I've had my moments especially early on where I would blurt out inappropriate things, was overly aggressive etc..you 100% can learn how to cope and deal with it, I still have intrusive thoughts but 99% of the time I'm able to act totally civil, I have a wife and children, I hold a good job. I know not every person reacts the same to TBI's but the vast majority of us can control what comes out of our mouths (not the thoughts usually), in fact I've never meet someone with a TBI who can't. This guy has sone underlying mental health issues combined with his injury or he's never been chastised for his behavior until now.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 127,
                  "content": "So my sons mothers step father got hit by a drunk driver years ago - got brain damaged. \n\nTurned him from a loving family man into a violent alcoholic. He killed himself last year after burning every single bridge in his life. \n\nThey really dont understand the brain as much as everyone thinks - it’s quite the assumption to think he’s just putting it on",
                  "id": 16,
                  "comments": [
                    {
                      "score": 249,
                      "content": "No matter if he is putting it on or not, it doesn't become OP's responsibility to put up with it in their own home.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 121,
                      "content": "That doesn't mean that OP has to put up with it in their home. If it makes him uncomfortable then he has every right to ask him to leave.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "He very well might be.  But that doesn't mean everyone around him is a punching bag.  \n\nThe people putting up with it need to make peace that not everyone will put up with it.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "There are things people genuinely cannot help doing because it is out of their control. If his brain is actually making him act in an unkind and offensive manner, fine I sympathize with the fact that he can’t help it. But you have control over whether you’re apologetic for the affect your uncontrollable actions are having on others. You can’t be an a-hole because of brain damage and just expect people to be ok with that.\n\nPeople also have the right to decide what they’re not comfortable with and who they’re not comfortable being around, regardless of their specific reasons bc it’s their choice.\n\nMOST people with mental illnesses and brain damages choose to be kind people who cause as minimal harm as possible, just bc there are those who choose to do the opposite doesn’t mean we should accept that as the norm or remain in unhealthy dynamics with those people. He could also seek help to manage his behavior but he doesn’t bc he likes the harm that the symptoms of his “brain damage” causes others.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "The grand irony of human biology is that the very organ we use to understand the world is so complex as to be barely understandable by us.",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Brain injury or not, it sounds like OP's uncle is doing a good job of burning bridges, too. I don't know which would be a sadder case: Uncle never getting the help he needed to function in society after a brain injury, or Uncle taking advantage of a real or presumed brain injury diagnosis by using it to verbally abuse everyone.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Heard similar with pro athletes behaving horribly - maybe an injury did mess with their heads, explaining if not excusing their actions, not solely choosing to be an AH\nFor example, Antonio Brown's behavior was not helped by a couple big hits from Vontaze Burflict in 2015 and 2018",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "That's simply not how it works. It's like telling someone to stop having seizures,  they can't just stop it.\n\nYou either tolerate it or politely tell him hes no longer allowed over.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 0,
                      "content": "[deleted]",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "If you haven't already, read up on Phineas Gage. He's mentioned in psych 101 classes as a poster child for brain damage and personality changes. \n\n(Not saying one way, whether the uncle has brain damage or not).",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "It's not primarily about knowing social norms with a traumatic brain injury (assuming that the injury wasn't made up), but about damage to the part of the brain that's supposed to control impulses. So, what comes into his head goes out of his mouth.\n\nBut it's very likely this guy is an asshole who also has a TBI!",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -1,
                  "content": "Yeah, either he’s an asshole whose behavior has been enabled and excused his whole life, or he’s someone who’s had nearly half a century to rehabilitate around his injury and is being enabled and excused for it. Either way he’s old enough to be responsible for his actions.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Not all TBIs can be managed and rehabilitated.\n\nOP doesn't have to invite that person into his home and be a punching bag, but that doesn't mean a person can just unlearn a TBI.\n\nNTA either way. Maybe the uncle is an enabled asshole. Maybe he truly has a brain injury and cannot change his behavior. The brain works in odd ways. Doesn't mean OP has to be disrespected.\n\nGrandma needs to accept that not everyone will tolerate him, and they don't have to.\n\nWe have limits and OP set theirs.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 219,
              "content": "Or simply don't attend...",
              "id": 30,
              "comments": [
                {
                  "score": 24,
                  "content": "Even better, save everyone the trouble.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -28,
              "content": "It's time for a real man to stand by her. Brain damage is on my cheek.",
              "id": 32,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1087,
          "content": "Yeah ESPECIALLY when his own wife banned the brother from their home. The presumption of OPs father to invite the nasty uncle to a house THATS NOT HIS. I've seen soo many stories of people enabling bullies but attack people when they stick up for themselves.\nNTA OP you need to tell your dad that HE won't be welcome in your house if he brings the AH uncle. In fact, that goes for all your family...That nasty uncle is NEVER to set foot in your place. Who cares if your family complains, let them deal with the AH uncle and you can live free of his vitriol",
          "id": 33,
          "comments": [
            {
              "score": 435,
              "content": "I bet dad thought that by inviting the uncle to OP's house, he could circumvent his wife and \"host\"/spend more time with his brother again by having all the family events at OP's house. Like \"sorry wife, I can't control who OP allows to come, if you want to see your son you'll put up with Uncle\"",
              "id": 34,
              "comments": [
                {
                  "score": 490,
                  "content": "Oh to be sure, which is why I mentioned the wife banning brother. OP might want to bring up THAT little factoid the next time his dad whines. \"You know Dad, you were very disrespectful to Mom when you invited your brother to my place. You know she doesn't want to be around him, why would you force her to interact with him?\"\n\nEdit: woo my first gold! 😊 thanks",
                  "id": 35,
                  "comments": [
                    {
                      "score": 63,
                      "content": "Take my cheep person gold. 🏆🥇🏅",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 327,
              "content": "This uncle is a clown that has been trained to put on a show for his family. They \\*LOVE\\* watching him do this shit, that's why they keep inviting him and taking his side. He is putting on a show and his brother and family are the audience.",
              "id": 37,
              "comments": [
                {
                  "score": 151,
                  "content": "That is exactly what I thought.  Like in school when the kids would aggravate the kid with profound mental health issues just to watch him explode.  If they really were bothered by it, they could have established a large, family-wide network to help deflect him and curb his tendencies to spare his targets.  That is if the brain damage is the true problem here, I’m not sure.  Onya OP for sticking up for yourself. You and your girlfriend really do deserve better.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "EXACTLY!",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "[deleted]",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 535,
          "content": ">your dad was out of line for inviting your uncle\n\n\"Dad. Next time you think about inviting my uncle? Don't. Next time he comes at your invitation will be the last time *you* get an invitation.\" \n\n(This is obviously the nuclear option.)",
          "id": 41,
          "comments": [
            {
              "score": 146,
              "content": "nuclear but honestly necessary.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "Not even nuclear tbh, this just seems like a very firm but also very fair and straightforward demand.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 93,
              "content": "It's not even the nuclear option, OPs father straight up disrespected him, his gf, and their new home.\n\nThe nuclear option is to never speak to the father again.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 180,
          "content": "Its also possible that the uncle believes his behavior is acceptable because no one tells him to stop. Not actually a brain injury (what even is the possibility of a brain injury that ONLY makes someone a asshole)\n\nIf the behavior is actually because of a brain injury. Why does he or anyone else not have medical proof of it or any medicine to manage it. and if he actually does have a medical condition of being an offensive asshole. Why does anyone willingly bring/invite him to social gatherings knowing he will ruin the experience for everyone else?\n\nTldr\n\nHes either is lying about the injury to be an asshole on purpose or the family hasn't stood up to him being an asshole on purpose making him think its acceptable\n\nOr he actually does have a brain injury and is totally incapable of not being an asshole. OP is justified not letting them be at their home in any case. I believe the uncle shouldn't be at the gatherings because of it. Unless some way is found to stop him from spoiling it",
          "id": 45,
          "comments": [
            {
              "score": 121,
              "content": "Damage to the frontal lobe can impede all sorts of higher order thinking such as the ability to filter speech. Imagine how much of an asshole you'd be if you couldn't stop yourself from saying anything that popped into your head.",
              "id": 46,
              "comments": [
                {
                  "score": 157,
                  "content": "You would probably get really good at apologizing for your conduct. Weird that this guy doesn't seem to have done that.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 145,
                      "content": "Weird as to the fact that he complains about everything.  Even if has no inhibitions, wouldn’t you think that sometimes he would express that food is good, houses are nice, bride and grooms look good, etc.  Why is everything shitty to him? Maybe because he’s just an AH.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "[removed]",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "I have ADHD and as part of that, I have problems sometimes with impulsive behaviour. It was a lot worse before diagnosis and treatment but it can still crop up when I'm stressed or tired and my ability to consciously control it drops.\n\nI should say, at this point, that there's also a fun, positive side that helps me overcome my autistic love for order and to be spontaneous and break the rules when needed.\n\nAnyway, it tends to mean that now and again, I might say or do something without thinking it through first but then immediately apologise and take it back!\n\nIt's usually more like I've forgotten the step where I subconsciously rehearse it first in my head to gauge whether it's appropriate and just skip to the 'do/say it' step instead.\n\nThe nature of ADHD means that my brain is constantly firing off all kinds of random ideas and thoughts and it's hard work to keep filtering from the outside world. I'm only human and I slip up. It's also hard work to keep filtering them from my internal mind and some get through and turn into intrusive thoughts. \n\nThat's why they're not actually true to who we really are. Many of them are misfires.Internal misfires become intrusive thoughts, external misfires become social gaffes. If they make it through the filter!\n\nBut I have bucket loads of empathy (I'm genuinely hyper-empathic) so if anything that I do or say has unintentionally offended and upset someone around me, then I will obviously apologise.\n\nAnd this is the crux of the matter.\n\nIt's one thing to have a neurological issue, whether it's a brain injury or neurodevelopmental disorder such as ADHD or mental illness such as bipolar disorder during manic phases, that causes impulsive behaviour.\n\nIt's another thing to absolve yourself completely of any of the  consequences resulting from that behaviour, once you are made aware of how it has affected others, and expect everyone around you to just accept it and move on.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -7,
                      "content": "because he has a brain injury",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 118,
                  "content": "Inability to filter somehow Never in this case results in uncle saying positive or tangential things, just insults.  And never apologies after his errors are pointed out.  What a coincidence.\n\nIt’s “the bride looks pregnant,” not “I gave that kind of flowers to my prom date then slept with her that night, it was great.”\n\n“Your house is a shithole,” not “Big bro parked his car behind me, I really want to take it for a joy ride.” Or “ooh, jalapeno poppers.  I’ll eat a ton of those then regret it on the toilet.”",
                  "id": 52,
                  "comments": [
                    {
                      "score": 129,
                      "content": "I've known a few people with TBI or FASD who had disinhibition as a symptom. And while they could sometimes get enraged or say something mean because of the lack of filtering, they were also often delightful to spend time with, because they also didn't filter any of the funny thoughts that popped into their heads, or compliments, or random observational monologues. So you'd get \"fuck you, I hate you,\" and a string of insults when something made them upset, but you'd also get a soft pat on the arm accompanied by the observation that \"your sweater looks like a fluffy rain cloud,\" or a 20 minute long monologue on all the different kinds of big cats and their differentiating traits because there had been a documentary on TV about zoo animals the night before, or a greeting of \"I just masturbated!\" followed by a sincere apology when you reminded them that wasn't appropriate dinner table conversation, or a recounting of a conversation they'd had several weeks ago with someone else you've never met. I'm not a neurologist or any kind of brain expert, but in my limited experience, disinhibition doesn't only disinhibit insults and anger.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 60,
                  "content": "i mean, in all honesty? i really don't think i *think* that much terrible shit. i don't hate anybody, i dont think a guy who just bought his first house has a 'shitty' house. now, i might say some food taste like shit though... that one might happen, lol.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Thank you! Like I'm not dropping slurs at weddings and insults every time I see anyone, even in my own head.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Neither do I. You would get a lot of really random shit from me and yeah, some negative, but not that much. Generally when I do have negative thoughts they're followed very quickly by positive ones too.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "It would be appropriate for him to have rehab or treatment for it then. Or lessons to not think offensive stuff all the time.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Yeah, but if the guy isn't sorry about his outbursts he is an asshole.  If he has an issue then is like sorry about that it's one thing.  In this case he's doubling down on being an asshole.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 2,
                      "content": "How much of an asshole he is depends on how \"young\" \"when he was young\" was since his family actively works to teach him that his behavior is okay.  If this brain injury happened as a child and the family has taught him from childhood that this is acceptable behavior, he may not have the ability to figure things out in adulthood that adults with no brain injury could.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "OMG…THAT’S what I must have!",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "as an autistic person who often says things that pop into my head without thinking, i’m typically embarrassing myself by sharing tmi, or talking about things not appropriate to the situation. on rare occasions i will say a very AH thing. but if the only thing coming out of uncles mouth is AH things, then he’s just an AH.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": ">Why does he or anyone else not have medical proof of it or any medicine to manage it\n\nThere's no indication that there's no medical evidence. It's not something you'd take along to a family dinner",
              "id": 62,
              "comments": [
                {
                  "score": 49,
                  "content": "> I have never seen proof of this [brain injury].\n\nThat's an indication right there.  It doesn't mean that *there is no proof*, which might be what you're getting at, but for whatever reason, OP thinks the uncle is using this as an excuse, whereas many responders are simply assuming the brain damage is real.\n\nBased on my experience with AHs and AH parents, my guess is if you asked grandma how he got his brain injury, she'd say something vague like \"so-and-so dropped him on his head when he was a baby\" and laugh it off.  Because whether it happened or not, it's a convenient way for his mother to excuse his AH behavior, if she wants to believe it's not even partially her fault.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 28,
              "content": ">Why does anyone willingly bring/invite him to social gatherings knowing he will ruin the experience for everyone else?\n\nThat's really the key right there.  Even if he has a biological explanation for his behavior, he's still actively unpleasant to everyone.  Why exposure yourself to that?  Life is too short.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "You can't medicate your way out of brain damage.",
              "id": 65,
              "comments": [
                {
                  "score": 56,
                  "content": "Actually with therapy and medication, you can manage many types of brain injuries, including disinhibition if that's what OPs uncle suffers from. We actually understand an incredible amount about the brain and have developed treatments and techniques to address so many different conditions and injuries that neurology underwent a major renaissance just like trauma care and transplantation care did post 9/11.\n\nThe reality is that the uncle likely never received quality care or the grandmother never pursued it due to the time period the uncle was likely injured. The first SSRI on the market was introduced in 1987 and evidence for using them to help treat various brain injuries didn't start appearing until about 15 years later.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yes, meds do help with some brain injuries or degenerative brain damage.\n\nMy friend’s son got a tbi at 19 then had years of mood and motor and speech issues.  He’s still on Ritalin for self-control and self regulation.  It helps.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "[deleted]",
                  "id": 68,
                  "comments": [
                    {
                      "score": 1,
                      "content": "yeah thats fair and more accurate, agree. i was mostly talking from frustration as a TBI patient myself w/ family that are assholes about it",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Thats not what i meant. I mean lowering the impact the injury has on his life",
                  "id": 70,
                  "comments": [
                    {
                      "score": -3,
                      "content": "Yeah no. Most TBIs you can't lower this kind of impact.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "Yep, OP’s dad is a colossal AH.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "What is the phrase \"your mental illness (or in this case, brain injury) is not your fault, but it is your responsibility\"? Like he could try to apologize, but at this point, I wonder if he's using it as an excuse. The Dad and the uncle are the wrong party, and OP is NTA. Your house, you decide who is allowed inside or outside of it.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Lord... My dad would do that! He used to invite people to catch up as if he was the host, me and my mom was the \"bad guys\" on this. Thanks lord he has learned his lesson and stopped doing this.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "The 'damper on the party' would have been worse if the uncle had stayed too. Best to get the ground rules set in the beginning so uncle knows his shit won't be tolerated in OP's house.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Should have kicked dad out too for overstepping.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Agreed. NTA.",
          "id": 77,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2882,
      "content": "NTA. Idk if your uncle is TA, but your dad is definitely TA for inviting him without telling you.\n\nEdit: also your dad's family for expecting you to put up with him in your home. He's their responsibility, not yours.",
      "id": 78,
      "comments": [
        {
          "score": 640,
          "content": "You really don’t know if uncle is an asshole??",
          "id": 79,
          "comments": [
            {
              "score": 376,
              "content": "At least the narrative of the family is that he doesn't know better. The father does. The uncle is an AH but for the purposes of this sub, maybe not TA.",
              "id": 80,
              "comments": [
                {
                  "score": 321,
                  "content": "A brain injury could potentially be reason for why he can't control it, but I cannot think of a way it would be the reason he doesn't know any better. The fact that he is not apologetic after the fac just means he is an asshole.",
                  "id": 81,
                  "comments": [
                    {
                      "score": 237,
                      "content": "Some people have brain injuries that literary affects their whole personality and they become basically unable to act in socially acceptable ways, so to speak. There's a case of a man that completely lost his capacity of filtering what he says and does, becoming completely impulsive due to a brain injury to the point he should have been considered legally disabled and incapable of independence.\n\nPeople really underestimate how much of us is just organic matter.",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Eh to be fair I've a cousin who has short term memory loss. He says a lot of inappropriate things but just doesn't remember it. He doesn't have the mental capacity to learn and grow",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Ye but just because nobody told him he’s being an asshole doesn’t mean he isn’t one.",
                  "id": 84,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 118,
              "content": "If he actually has a brain injury that stops him from filtering (a real possibility) than no. It’s the family that refuses to do anything to protect him and others who are the assholes",
              "id": 85,
              "comments": [
                {
                  "score": 103,
                  "content": "I don’t want to appear as if I’m wishing violence on the uncle, but what if he says the wrong thing to the wrong person? There are many people out there who are not as forgiving as op and more unstable than uncle.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 71,
                      "content": "Exactly. His family that continue to just let it go are being negligent.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I worked in brain injury and mental health and this has definitely happened. For the clients able to understand we would try and educate them on the possible consequences of upsetting someone in the community but while they may understand in the moment they may not be able to stop themselves from offending at any given time. Its definitely a very individual situation and it's down to the care givers to try and manage the situation.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "[deleted]",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 85,
                  "content": "Even if he really has no inhibition due to a brain injury, that does not mean he can't understand that he should apologize after the fact. The fact that there are no apologies is a strong indicator he is an AH, regardless of whether he has a brain injury or not.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Brain damage can do a lot. If you don’t believe you have anything to apologize for, you won’t apologize. Nor should you tbh. An apology that is only done as a social cue isn’t really an apology.\n\nShould someone apologize for calling someone a racist in their own home? Well, if the person did some racist stuff, then probably not, even if the host is offended. Doesn’t mean they won’t be asked to leave.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "That is a pretty fair point. It can also point to his family simply enabling that behavior for so long that he really doesn’t think he’s wrong.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yeah, but the described issue doesn't explain an inability to feel bad about being rude.",
                  "id": 93,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "A TBI may be a reason for poor behavior, but it doesn't absolve people of being an asshole.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Disagree.\n\nIt doesn't mean other people have to associate with them, though.\n\nOP can set a boundary.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "We have no idea if he actually has a brain injury that would affect his behavior. Original commenter is probably just erring on the side of caution.",
              "id": 96,
              "comments": [
                {
                  "score": 15,
                  "content": "Well, we have the guys mom saying he had one, and OP wasn’t alive for their uncles whole life. Safe to say he probably had SOMETHING happen.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yeah, but brain injuries vary significantly. A concussion is a type of brain damage after all and people can recover from them completely.\n\nThere is a significant range of outcomes for brain injuries from 'completely healed' to 'permanent irreversible changes' and no one here or the OP can tell if this is actually brain damage that had no chance of being fixed, or if everyone just coddled him because of it and let him be an AH so that even when his brain healed, he just kept being an AH on purpose to everyone long afterwards.\n\nBut regardless, no one should just be inviting Uncle around when he is this unpleasant. Having a brain injury doesn't make it okay to keep exposing people to his offensive behaviour without permission just whenever.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "I'm choosing not to make any judgements about whether or not he can control himself currently, as I am not there. But I do know that the dad shouldn't have just sprang this on OP",
              "id": 99,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -1,
              "content": "If he has brain damags he may not know if he able to understand what his doing wrong \n\nThe dad 100% does",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1339,
      "content": "NTA. you can choose what to put up with. Your uncle is using a supposed \"brain injury\" to be an asshole. And this is not to downplay brain injuries, which are very real.",
      "id": 101,
      "comments": [
        {
          "score": 675,
          "content": "My husband has a brain injury from work a decade ago. He worked HARD to get his anger under control and NOT be a huge asshole. It took a long time, and a lot of work, but he did it. He also had other things as a result of the injury, both physical and neurological to deal with.\n\nThere's no way that uncle is a perfectly functioning adult in every other way, and the brain injury *only* affects him so he can't not be an asshole.\n\nNTA.\n\nEdit: a word",
          "id": 102,
          "comments": [
            {
              "score": 91,
              "content": "Congratulations on your husband and family for persevering with the work. I hope you are all ok",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "exactly.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 117,
          "content": "The only thing my brain injury gets me out of is driving and remembering birthdays",
          "id": 105,
          "comments": [
            {
              "score": 66,
              "content": "The only thing my brain injuries excuse me from is forgetting alllll kinds of things. But this is just like mental illness: one can't help it, but they're still responsible for it.  \n\nOP has the right to choose to not be around someone regardless of any injuries.  And Uncle can have a brain injury and also be an asshole.\n\nBabies can't help shrieking and crying, it's just part of that phase in life.  However, I absolutely can't stand it.  But rather than be an asshole to a literal baby, I just avoid them as much as possible, it was the best solution I could come up with.  Uncle has had YEARS to find a solution to his lack of inhibition, and none of them include not being remorseful.",
              "id": 106,
              "comments": [
                {
                  "score": 13,
                  "content": "If he had the accident in the seventies I would imagine that there was not much in the way of therapy for this type of injury 🤕",
                  "id": 107,
                  "comments": [
                    {
                      "score": 17,
                      "content": "There's not a lot of therapy for retrograde amnesia either but I manage to not be a gibbering asshole in public",
                      "id": 108,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Maybe the uncle DID have a brain injury that hurt his frontal cortex and affected his personality. However, it doesn’t make him less of an AH to be making these comments. \n\nYou can still choose not to be around him. \n\nPlus people can be taught what is inappropriate and what’s not. We can control our anger.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 501,
      "content": "NTA. Good for you! About time somebody stood up to him. If everybody did that, I bet his \"brain damage\" would get better.",
      "id": 110,
      "comments": [
        {
          "score": 9,
          "content": "[removed]",
          "id": 111,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 304,
      "content": "[removed]",
      "id": 112,
      "comments": [
        {
          "score": 0,
          "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
          "id": 113,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -127,
          "content": "If he really had a TBI he literally can’t help it",
          "id": 114,
          "comments": [
            {
              "score": 119,
              "content": "There are compensations he could make that would prevent his rude behavior.\n\nIf this were from a TBI, it was likely damage to a frontal lobe affecting his impulse control. This type of damage can \"remove the filter\" that stops bad behavior. Since his bad behavior is limited to making rude comments, he could compensate by staying quiet and not making any comments until he's well thought them out.\n\nHis family allowing him to just act on his impulses are not helping him.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 95,
              "content": "People with TBI can learn to manage their triggers and function socially. Very few are beyond  growth, especially for a childhood TBI that is still making him act this way as an adult. Most people with TBI are absolutely just as accountable for working within the constraints of their abilities to function in normal social interactions.",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 80,
              "content": "Absolutely false. People with TBIs can seek behavioral treatment just like anyone else. They can use coping strategies just like anyone else.  The entire field of neuropsychology actually exists.",
              "id": 117,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "I had an uncle like this. He was a complete ass to everyone. He got coddled by my dear grandma because she somehow felt responsible (there was never a clear diagnosis, but they thought maybe something during birth) My grandma was in the hospital and couldn’t care for him for about a month and my mom had to step in. When he realized she wouldn’t take his abuse and still help him, guess who could miraculously be civil?",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "Nah. And if OP's father is saying \"he has been like this forever\", then the TBI is just a cover for being an asshole.",
              "id": 119,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "If he really had it he would apologize",
              "id": 120,
              "comments": [
                {
                  "score": 13,
                  "content": "Agreed. My wife had a TBI 17 years ago and she sometimes says or does hurtful things. But she apologizes. I would not put up with it if she didn't.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "It also seems like his parents didn't try to get him any help as a child of it did happen. They probably were like \"oh, he hit his head. We can't get mad at him\" and then continued to allow him to act out. Saying things like \"why are you with such a loser?\" Isn't a normal TBI thing. People with TBI don't go around at 50 years old telling people at a wedding the bride must be pregnant or judging the way the groom looks.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "People with TBIs get help managing their outbursts so they can function in the world. Even if he truly cannot help it, it does not mean he is entitled to shit over everyone because he is disabled. He can stay at home and offend his mother.",
              "id": 123,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 243,
      "content": "NTA.  You don't have to tolerate rude behaviour at your own home.",
      "id": 124,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 221,
      "content": "NTA. If you have a medical condition, which in this case sounds like a big if, you avoid situations where the condition disrupts others. You don't get to ruin everyone's good time forever because you have a condition.",
      "id": 125,
      "comments": [
        {
          "score": 85,
          "content": "This is not to say people with conditions shouldn't be reasonably accommodated. But this definitely isn't reasonable.",
          "id": 126,
          "comments": [
            {
              "score": 18,
              "content": "I’ve met some people like this. One who died at 30 because of the injury.  It’s hard because they still obviously care about people and their family loves them.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Funny how many assholes think \"I have a mental health condition\" translates to \"You must accommodate any of my behaviour no matter how toxic.\"\n\nA mental health condition means I'll be a little more open to someone rebuilding bridges after they burn them. It does not mean I'll sit on the bridge while it burns.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I'm curious how this man holds a job.\n\nDoes the family support him?  Does he actually turn a filter on at his job and he leaves it off with family because he's legitimately just an asshole?",
              "id": 129,
              "comments": [
                {
                  "score": 2,
                  "content": "These are great questions. Is he on disability?",
                  "id": 130,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yeah that's my question.  If he legitimately had a disability it'd be everywhere and uncontrollable.  I think he's just a golden child asshole because everyone makes excuses for him.\n\nThat's why he _left_ when told to and then kept at it on text messages.  Someone who can't control it often times doesn't go out of their way to keep the attention on them being an asshole like that.  Mom was right on the money on blocking him and the rest of his family just enable his horseshit.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 160,
      "content": "NTA.  Just because the rest of your passive ass family puts up with it doesn't mean you have to in your own home.",
      "id": 132,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 110,
      "content": "NTA. Brain injuries can cause disinhibition, personality changes etc but if he's been living with this since he was young he's had more than enough time to learn social norms. Good on you for kicking him out.",
      "id": 133,
      "comments": [
        {
          "score": 19,
          "content": "It’s not about learning. It’s about losing the muscle. This is a very real thing with brain injuries.",
          "id": 134,
          "comments": [
            {
              "score": 6,
              "content": "It's actually not about muscle at all. Brain injuries affect what bit of any given brain cortex. This in turn affects the centre it controls. Usually, frontal lobe or prefrontal cortex damage contributes to behaviour modification. Muscles are only as involved as they would be in an un-injured patient.",
              "id": 135,
              "comments": [
                {
                  "score": 32,
                  "content": "Sorry!  I meant metaphorical muscle not literal muscle.  I meant to express that it is not about learning to be nice it is the controlling whether one is nice or not that becomes the problem. I had a terrible concussion and lost social control for about two months. It was awful. I had to leave my job and live at home for a while because I absolutely could not be in polite company.",
                  "id": 136,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Concussions are traumatic brain injuries! It's no wonder you had difficulties, I've had patients with similar issues. They're very complex. I hope you've come through and healed and are doing ok now",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "That's assuming there aren't any other issues from the brain injury that could impact the learning of social cues.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 101,
      "content": "NTA. I'm a dick too. Like your uncle, I also have a shitty sense of humor. This however, doesn't absolve me from having tact. Your uncle has been coddled his entire life. Because of this, he will be single until he is old and grey.",
      "id": 139,
      "comments": [],
      "relation": "Support"
    }
  ]
}