{
  "post content": "Our son is 22 and our daughter is 26. She bought a house in July. We know that moving into a new home always comes with unexpected costs, right after you've probably depleted most of your funds. So, for Christmas we gave her $4000. Our son we gave a few different gifts totaling somewhere around $800.\n\nOur daughter had to work Christmas, but we did Christmas on the 26th and she stayed with us for the holidays from then until yesterday. Our son still lives with us, and today he told us both that he didn't want to say anything while his sister was here, but his feelings were hurt by the disparity in the value of the gifts. We explained that the gifts we got him were tailored to his interests, but his sister has just passed a big life milestone where money is more important to her right now than sentiment. He said it's still hurtful because it feels like we are more proud of her than him.\n\nMy wife got really frustrated when he said that and asked why he would choose the least charitable interpretation of our actions. He said that's just how he felt and he couldn't control it. I said that we didn't give her money because we were more proud, but because we had experience being new homeowners and knowing that something always breaks in that first six months and it's always expensive. He said that was all fine and good, but it still hurt to get a worse present and feel like an afterthought.\n\nMy wife asked if he expected us to get him four thousand dollars worth of gifts. He said no, but he expected the gifts between him and his sister to be equal. My wife said that's the same thing, and my son said it isn't. He said we could have given her the monetary equivalent of what we gave him. I told him that it isn't really fair for him to decide how much we spend on someone else's gift. Furthermore, cash is less personal than gifts, so giving her a cash equivalent to what he got would be her getting the \"worse\" gift.\n\nHe said we weren't listening to him, just justifying. My wife said we didn't need to justify anything, and he was being entitled. At that point he said he didn't want to talk unless everyone was civil and he went to his room. He skipped lunch (breakfast for him) today, and when he left for work he didn't say goodbye even though I was right by the door.\n\nMy wife is irritated, and my son is clearly resenting us. I can't really decide if we're in the wrong here. On the one hand, we should be able to give our money to whoever we want. On the other, I never want to hurt my son's feelings. Were we wrong?",
  "id": 1,
  "comments": [
    {
      "score": 32593,
      "content": "YTA for doing this at Xmas.\n\nI am the youngest of 4 siblings, my oldest sister is 10 years older than me, so we definitely reached milestones at different times. Things like wedding money, housewarming gifts/money, graduation gifts obviously came at different times for each of us and were not tied to group holidays like Xmas. \n\nYou could have given your daughter an $800 check or gift for Xmas, and $3200 for closing on the house at a different time/setting. Then you could tell your son \"we will be so excited to give you a gift of money to help out when you buy your first home!\" Instead, now it is a very disproportional Xmas gift, which is sure to raise some jealousy.\n\nEdit: My judgement is very light and you seem like very generous parents who want to help both of your kids get ahead in life. I definitely don't think you \"owe\" your son more now than an explanation and an apology for timing and reaction to his concerns. In the future I would just keep shared gift opening times \"in kind\" for both kids, and stick to milestone gifts timed with the milestone.\n\nEdit: Also getting a lot of \"rent free\" comments about the son. From OPs comments it seems like the daughter lived at home until the house purchase to save up money, and they have no issues with the son living at home now and want the same opportunity for him, so I don't really see it as an applicable factor in the judgement.",
      "id": 2,
      "comments": [
        {
          "score": 16779,
          "content": "Also, there was a clear invalidation of your the son's feelings. He sounded like he was being really respectful and brought up valid points as to why he was feeling a certain way. Instead of being open about the whole situation, you started gaslighting. It's a good way to stop your kid from wanting to approach you about things in the future.\n\nYTA",
          "id": 3,
          "comments": [
            {
              "score": 6293,
              "content": "This was the big sticking point for me.  Don't you want your son to feel comfortable coming to talk to you when he has a problem in the future?  Is son going to feel comfortable talking about his feelings / issues with mom & dad, when mom immediately starts attacking him?    \n\n\nAlso....and this is just the suspicious asshole in me....but mom got real defensive and came out attacking hard when she wasn't even \"called out\" - he was just expressing his feelings.  Her response was not proportionate - the point where she \"doth protest too much\"",
              "id": 4,
              "comments": [
                {
                  "score": 2493,
                  "content": "Of course, they don't want their son to express his feelings unless he's being always grateful and compliments them. If he has something slightly negative to say he's an ungrateful spoiled brat, at least in his mother's eyes.\n\nHonestly, the son sounded the more mature in this situation. He waited for his sister to leave before approaching the situation and left the conversation when the mum started verbally abusing him.\n\nThe parents could have kept the difference (3200$) in a savings account and if the daughter needed it, they cold give it to her. I already bought a house 3 times and never had bad things happening that tanned my experience. It's called budgeting for the house. You don't buy a house without having some extra on the side for some unexpected event. I'm not saying my experience is everyone's experience, but OP is assuming that something bad will happen, but he and his wife could have waited to see if it happens or not. If it does, they could have stepped out and helped. Nonetheless, they should put the same amount aside, for when their son buys or rents a house.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1661,
                      "content": "Right - Son did everything right here.  Based on OP's post (which I assume puts him / his wife in the best light), son waited til the appropriate time, and said these are my feelings.  He didn't come out attacking like mom did.  He handled it how it should have been handled - the healthiest option.  I guess he could have just stayed quiet and let the resentment fester....seems like that would have been preferred by OP/his wife",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 468,
                      "content": "They could even have made Christmas even and called the remainder a housewarming gift, with the understanding that the son will receive similar help when he buys a home. There were lots of ways that this could have been handled without hurt feelings, but that didn't seem to be one of their goals, much less a priority.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 355,
                      "content": "If you can afford it, giving a gift of $X is a really nice thing for parents to do for first time home owners. It's really generous. BUT, it needs to be kept separate from Christmas. Giving one kid 5 times the value of gifts compared to the other is sh!tty. Minimizing the least favoured child's feelings about it is super sh!tty.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 177,
                      "content": "The son is far more mature than his mother, who immediately got defensive and angry, called him entitled. How long have you been holding onto that one, Mom?",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "The little dig about how their lunch was “breakfast for him” was so unnecessary and judgmental…wanna bet on whether the daughter slept in until lunchtime when she was living at home?",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "The part you’re missing is that they can hear what he has to say and want him to express his feelings and still not agree with him. Everyone is not going to agree. I can see your point and still do something else. It’s not as if they low balled him on his gifts. He got $800 worth of gifts. Unless you’re very well to do that’s considered a very good Christmas especially when you consider that these are adult children. These are not children that you have to measure and out the dollar amount. When he buys a house he’ll get his $4000 too.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Honestly, if I complained about how much my brother was given compared to me I would expect my parents to be a bit frustrated. \n\nThey’ve just given my brother a significant amount of money to help him buy a house. At Christmas, because coincidentally that’s when he actually found one.\n\nOkay, cool. When I find a house in expecting about the same amount to help me buy it - and if I don’t, then that’s when I can start complaining about unfairness. \n\nMy parents paid for my brother during university. I had a full ride scholarship. I’m not going to sit there and demand they give me the same amount of money they gave him during that time. \n\nI am just having difficulty understand why the son in this post wasn’t just happy for his sister and understanding that they’re not in the same situation right now. \n\nThis is like a 14 year old asking why their 18 year old sister got a car and they only got a PS5. If you’re not at the same stage of life, why expect the same gifts? \n\nUnless the son *doesn’t* expect the same gifts when he’s at the same age, this just reads as being ungrateful. $800 of gifts is not an “after thought”. Especially if they’ve actually put some thought into what he’d like and picked things out for him. \n\nYes, you can split the cheques and give the daughter 800 at Christmas and 3200 another time, but why should you have to go through that kind of charade? It feels…wrong.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "On what planet is calling someone entitled \"verbal abuse\"? Dear god.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 106,
                  "content": "Exactly I could not agree more, she was very defensive wasn’t she.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "> ..but mom got real defensive and came out attacking hard when she wasn't even \"called out\" - he was just expressing his feelings. Her response was not proportionate \n\nShe unironically did the same thing she accused him of doing: chose the worst possible interpretation of his actions.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "That bothered me more than the gift disparity. I hope my son is that emotionally intelligent at that age.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yes! Honestly both parents came on really aggressively to a very civil conversation about their son’s feelings. Like that little dig about him sleeping in late (the “breakfast for him” comment about lunch) tells me they’re resentful of him- like that didn’t even need to be an addition but OP put it in to be rude to their son. It sounds like they’re on the defense because they know what they did was wrong/a little unfair and are just doubling down instead of validating their son’s feelings.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4177,
              "content": "“I’m sorry. I wanted to support your sister in purchasing her new home and the extra cash was for that. I didn’t think about how giving that extra cash to her at Christmas would make you feel. When you purchase your first home we will be happy to give you a cash gift to help you as well. We love you and your sister equally and are so sorry we made you feel lesser than during the holiday.”\n\nThe son sounds like he just wanted them to acknowledge what they did and how it made him feel. I doubt he was asking for money right then and there.  An apology goes a long way in situations like this.",
              "id": 18,
              "comments": [
                {
                  "score": 1170,
                  "content": "I really can't believe the parents listened to their son and then were incapable of just saying \"When you buy a house we'll do the same for you!\"\n\nLike how hard is that?  Instead the mother got frustrated with the son's feelings and the OP doesn't even seem to know what he thinks or feels...  how hard is it to just say \"You'll get the same some day too!\"\n\nThat's all the son wanted...  was to know that he would be treated equally at some point!",
                  "id": 19,
                  "comments": [
                    {
                      "score": 323,
                      "content": "Does the Dad actually say they intend to do the same for him? I wonder if they don’t and that is why they got defensive.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Took the words right out of my mouth. That would've fixed it. Maybe the son could've specifically asked, but really, why wouldn't they just say it?",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Yeah this is what always seems idiotic to me about these posts that involve siblings. Like just say that you'll do the same for the other sibling when the time comes.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 180,
                  "content": "It's not to late to do this OP",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 120,
                  "content": "An absolute perfect answer for their son.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 94,
                  "content": "Perfect answer right here  OP. You and your wife could have saved a lotta trouble by just telling him he will get the same gift when he gets his first house.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "It's 100% this. He doesn't care about the money. It's the huge difference between the 2. My parents make a huge deal of everything being fair between my siblings and me to the point of us finding it funny. And you know why? because differences like that are not rubbed in our face. The kids didn't mind about the cars because it was fair \" at 18 you get a car\".",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "THIS !!! I have been in fights with my mom lately because she’s been kind of shafting my husband and I in favor of my brother and his wife. And I don’t want or need it to be even, but I want acknowledgement that my feelings are valid. \n\nAlso, the son feeling this way isn’t entitled at all. He’s not demanding the difference, just acknowledging the disparity.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 897,
              "content": "Nothing in this post is gaslighting. OP was an asshole, but let's stop misusing that word. Disagreeing with someone's interpretation of a situation is not gaslighting. Gaslighting is an intentional manipulative tactic.",
              "id": 28,
              "comments": [
                {
                  "score": 176,
                  "content": "Its not gaslighting more like weaponized indifference.  They are just pretty much like \"you should have zero problem with us giving your sister $4,000 while we give you $800\" which quite honestly I don't keep track of those things, it doesn't do any good.  I don't live my life expecting anything from my parents, or my spouse's parents for that matter, even though my brother's whole life is supported by them.  Its not my money, why would I care.  i am also comfortable financially. \n\nHowever, its not hard at all for me to see how someone could be hurt or feel slighted by these things.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 397,
                      "content": "[deleted]",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "\"weaponized indifference\" means he's using his indifference as a weapon to intentionally hurt someone. Which is not what OP is doing at all.",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Calling OP an asshole for this seems like a bit much",
                  "id": 32,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 525,
              "content": "This idea that his feelings were invalidated (you’re not the only one saying it) is hilarious because I have very kind and giving parents and yes they’d absolutely be both offended and laugh me out of town if I was upset about this. Given the post and comments from OP, it sounds like they are plenty giving to both kids and different times. My parents are the same. They’d be offended I assume the worst in them, they’d be concerned that I’m not just happy for my sibling, and concerned I have the audacity to be upset when I received $800 in gifts… which is a lot of money and also takes some thought/effort.",
              "id": 33,
              "comments": [
                {
                  "score": 135,
                  "content": "Is it mean spirited that I wanted to ask if the parents were housing his sister at 22?\n\nIn all fairness maybe they were but it seems so wild to say “you put a roof over my head every day of the year but Christmas presents have to be equal or it means you aren’t proud of me.”",
                  "id": 34,
                  "comments": [
                    {
                      "score": 223,
                      "content": "I don’t think it’s mean spirited. I think it’s fair to say that the sister “needed” the bigger gift more than the son because their life stages and their needs were different. His needs are actively being taken care of, and I know we like to say that parents are supposed to support their children but it’s very obvious that they don’t mind supporting him even longer. He just didn’t “need” $4000 worth of Christmas gifts. \n\nAnd I actually think the reason why this is a sticking point for everyone and the son is because he got to see the exact monetary value of what they gave the sister vs him.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Missing the point a bit. The issue is not whether or not the son is justified - acknowledging how someone else is feeling is not the same as agreeing with them or condoning the feeling.\n\nThe son shared that he felt upset about the situation. Right or wrong, that is how he is feeling. That could have been a chance to have a discussion where the parents could a) point out that there may be other factors that he isn't considering and b) model good behavior for processing emotional reactions. Instead of that (possibly productive) discussion, the son got attacked for sharing. Regardless of whether or not you agree with him, it's a huge missed opportunity for a teaching moment and a great way to make sure that, in the future, he lets the resentment fester instead of sharing.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 437,
              "content": "Can we not call things gaslighting when it’s just a simple disagreement? “I don’t understand why you feel this way” isn’t gaslighting. I swear the internet picks up a new word and just uses it for EVERYTHING.\n\nI do not think there was a “clear invalidation.” You are taking their response the worst it could be, and his the best it could be. You are assuming he was perfectly respectful, but also assuming that they were not.\n\nIf you worked hard on getting a personalized gift, and someone seemed ungrateful for it, you would feel hurt by it. That is how they’re feeling. If he is allowed to tell them that he feels under-appreciated, then they are allowed to say that they feel he isn’t appreciating their efforts, too. It’s a two-way street here.",
              "id": 37,
              "comments": [
                {
                  "score": 105,
                  "content": "THANK YOOOUU! I am SO sick of people saying things are gaslighting when they're just plain old lies, manipulation, or people being mean or self-centered.\n\nThere is a **huge** difference.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 31,
                      "content": "GOD SAME!! Like I’ve had people tell me that me FORGETTING something is gaslighting. Literally, I was talking to my now ex friend, and she mentioned something I did when we were younger that upset her. I said i believed her but with my memory issues, I didn’t remember. She said I was gaslighting her. Fucking WHAT?? I literally SAID it probably did happen!!\n\nI also see people call just plain old lying “gaslighting.” Like what?? It’s not fucking gaslighting just because they’re being dishonest.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Or people using the word “abuse” for disagreements/uncomfortable situations or one off fights. Nothing to do with this post, but man, it bothers me so much!",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 241,
              "content": "That’s what bothered me.  The son approached it right and got a shit sandwich thrown back at him. \n\nYes parents can do what they did without explaining but the son went out of his way to share his feelings.  Sad",
              "id": 41,
              "comments": [
                {
                  "score": 30,
                  "content": "There is no world in which complaining about $800 of gifts can be approached \"right\".  It would be ludicrously entitled EVEN IF it wasn't over his fucking sister getting something she's going to need.  Holy fuck, what is _wrong_ with all of you???",
                  "id": 42,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 228,
              "content": "> and brought up valid points\n\nhis feeling may be real but he did not bring up \"valid points\". He's way too old too be crying about this like this and not wanting to understand this has nothing to do with equal gifts.",
              "id": 43,
              "comments": [
                {
                  "score": 168,
                  "content": "Agreed. This is like complaining that your 16 year old sister got a car for her 16th birthday and you only got an Xbox for your 14th birthday. He didn't ask if he would get a similar gift when he buys a house. He's upset that his older sister got a bigger gift than him because she's passed a milestone. Nothing indicates he won't get the same gift when he passes that milestone.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 167,
                      "content": "And it's not like that wasn't explained to him. It was and he continued moping about it. THE GUY IS 22. Not 12. TWENTY TWO. Crying about XMAS PRESENTS",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I thought I was losing my damn mind reading these other comments! my kids are 6 and 10, and they both know perfectly well that if I ever hear them counting gifts, comparing them (in a negative sense, not like \"hey, check out this cool thing\"), etc there'll be hell to pay. Like... Any sign of holiday entitlement, brattiness, ingratitude, general asshole behavior starting, and we will scale WAY back. \n\n\nHell, the 6 year old is perfectly capable of understanding that sometimes his sister gets cool stuff that he might want, but can't have yet because he doesn't need it/ isn't old enough/ just didn't and that's the way it is. Things aren't always equal.\n\n\n I can't imagine the balls on this 22 year old man complaining that his parents spent almost a grand on him for Christmas, while he's living in their home, but they gave his sister more for a specific purpose. It's not like they threw $4k at her for no reason. Who cares if it was at Christmas! He's an adult ffs.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "If a sibling got a better gift around a milestone I wouldn’t be salty. This kid is spoiled",
                  "id": 47,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Yeah hes not a young teenager at that age, hes a young adult already, he should be able to reason out his parents intent on why they gave him and his sister different presents at that age. Like if it was me in that situation I might be slightly peeved but I would move on pretty quickly. I think redditors are overly concerned with the immediate emotional response than actually being reasonable.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 194,
              "content": "Gaslighting? C'mon. That is bs.",
              "id": 49,
              "comments": [
                {
                  "score": 6,
                  "content": "\"Gaslighting\" has become a catchall term that could mean any number of things. I almost never see this term used correctly. Gaslighting is when you purposefully manipulate someone into questioning their own reality. The parents did not do this.\n\nGaslighting would be like the parents saying \"We didn't give your sister $4,000 what are you talking about? We gave you both $800.\"",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 161,
              "content": ">Also, there was a clear invalidation of your the son's feelings.\n\nHis feels ARE invalid tho. They're at different milestones in life. It's absolutely shitty to do this at Christmas, but it doesn't make any sense to give them the same value of presents if one hits a milestone. \n\nIf his sister hit 16 first and got a car, would he expect $20,000 in gifts that year? No, you just expect that when you hit the same milestone you get the same treatment.",
              "id": 51,
              "comments": [
                {
                  "score": 194,
                  "content": "Its not a milestone.  Its Christmas.   That's the whole problem.  \n\nA milestone would be a separate gift occasion.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 170,
                      "content": "So the only issue here is that the parents wrote a single check for 4000 instead of 2 separate checks for 800 and 3200? It's just pedantry at this point. All the parents need to say is that buying a house is a big milestone that comes with a lot of financial burdens, so she got extra, and when he needs the same support he'd get it. It's stupid to expect the parents to write 2 checks just to appease this childishness. The son is more than old enough to understand this",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "[deleted]",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "….it doesn’t matter it was Christmas. There is no rule saying that gifts should be equal during Christmas and no rule that you cannot give a milestone gift during Christmas. It’s pretty ridiculous how people think this thoughtful father is being an asshole here.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "And all it would/should have taken to show him there was no favoritism going on would have been to say 'when you buy a house, assuming we're in the same financial position we are now, we'll do the same for you'\n\nHis feelings aren't invalid, they're based on a belief that is incorrect according to OP. That doesn't invalidate them, just means he needs reassurance.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 128,
              "content": "What do you think gaslighting is? Nothing indicates they made the son question his sanity.",
              "id": 57,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 408,
          "content": "[deleted]",
          "id": 58,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 347,
          "content": "I agree the timing is what makes what would have been a set of very generous gifts into an AH move. That large a difference in things given out at the same time is bound to cause resentment. Splitting the daughter's gift up and giving it at a different time would have been a much better approach. \n\nBut, it's OP's money and they can do with it what they wish.\n\nWhat gets the YTA judgment from me is that when the son approached them in a what sounds like calm manner to tell them his feelings were hurt and ask why there was such a disparity between the gifts, OP and wife got defensive and made it into argument. Simply saying something like 'your sister's was a combined Christmas gift and housewarming fund' was all that needed to be said. Possibly followed by 'when you purchase a house you'll get a similar fund', if that is the intent. \n\nClaiming the gifts aren't dissimilar because 'cash is impersonal' and some of the other arguments OP puts forward are ridiculous. No wonder the son got more upset afterwards. They completely ignored his concerns.\n\nAll that being said though, if I got $800 worth of Christmas gifts I'd be super happy. Hell, I realized I was an adult when I got happy about getting socks for Christmas!",
          "id": 59,
          "comments": [
            {
              "score": 124,
              "content": "It's like if daughter got married in July and then Op gave her an extra $3200 for Christmas because weddings are expensive.  Son likely would not have batted an eye if they gave daughter $3000-4000  for a housewarming present but for Christmas it's weird.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Oh yes, nice socks, even a favorite type of underpants was a joy! One dear cousin wanted wool socks for hiking boots, best believe we all got on the bandwagon. Now, we young adults were all exchanging/receiving wool socks! We wore them, I even learned to darn socks. My mom and aunt thought these were very boring gifts, but it was we wanted, as late teenagers to young adults. \n\nFor a number of years, my brother, who is a very plus sized person, was so pleased to have comfortable knit boxer-briefs in his size. Last year, although we weren't supposed to exchange presents (financial problems for Mom, brother & SIL)  my husband & I showed up with large bags of good quality Costco towels, plus nice sheets for brother & SIL, as \"house presents\", not Christmas presents. Their three person household was in need of towels, plus all items were on a good sale, as we assured them. No need for them to reciprocate, or feel an obligation, as we were gifting \"the house\". We finisessed (sp) that situation.",
              "id": 61,
              "comments": [
                {
                  "score": 3,
                  "content": "I feel that's the true mark of adulthood. When you ask for 'household' goods for presents. The year I moved out my mom got me a Dutch oven that was just like hers for my birthday. I used hers all the time cooking at home. I was so happy, I might have started cooing 'my precious..' over it at my birthday dinner. Since that was at a fondue restaurant, it was slightly awkward. I gave zero fucks. *I got a Dutch oven!* \n\nThis year I got fox socks, a kitty hand towel, and a Van Gogh cat grocery tote bag. And I'm so happy with them all! And I still coo 'precious' over my Dutch oven.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 206,
          "content": "I'm glad I see this is the top response.  I was basically in the sisters shoes.  I bought my first house, and my parents gave me $5,000 for the VERY SAME reason.  A nice windfall if something goes awry.\n\n&#x200B;\n\nBut I was given that money for that reason, after buying the house.\n\n&#x200B;\n\nIf I was given that money at Christmas with my siblings around, they would be PISSED.  And almost rightfully so.  It's not exactly a Christmas present.  It's a house-warming gift.  And my parents also let my siblings know they would do the same when they decided to buy.\n\n&#x200B;\n\nedit:  Of course it sounds like the OP was trying to do right and clearly loves their kids.  They just don't understand timing or how their gift was perceived.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 201,
          "content": "> You could have given your daughter an $800 check or gift for Xmas, and $3200 for closing on the house at a different time/setting.\n\nThis is the key IMO.  She bought the house in July.  If the parents wanted to give her money to help with surprise expenses of a new home why not do it in July?\n\nIf the house needed repairs, new appliances, whatever then waiting 5 months to give her cash makes no sense.",
          "id": 64,
          "comments": [
            {
              "score": 21,
              "content": "[deleted]",
              "id": 65,
              "comments": [
                {
                  "score": 44,
                  "content": "If you need a tax return or a bonus check to make a large financial gift, you shouldn't be making a large financial gift.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 117,
          "content": "This is literally what my parents did. Whenever we bought our first home, they purchased an appliance of our choice. My brother chose a fancy fridge, my sister and I chose washer and dryers.\n\nChristmas was always the same sort of money and I still have no idea how much she spent on the others nor do I care. However if my parents gave my sibling £3200 extra at Christmas I’d have been a bit sad.\n\nAnd all that’s before you invalidated his feelings. \n\nYTA",
          "id": 67,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 34,
          "content": "I'd understand if indeed something had broken, and they offered to pay the repair fee, but it doesn't make any sense to give her a Christmas gift of that much cash for future repairs.  They could have just as easily bought her a home warranty as a Christmas gift. What happens if she decides to buy a vacation, or a laptop or something?",
          "id": 68,
          "comments": [
            {
              "score": 11,
              "content": "As some one who bought a home in the past few years I can tell you having a home repair fund gifted to me would have been amazing, knowing there is some money set aside if something goes haywire or breaks would have taken a lot of stress off my wife and mines minds as we were recovering from the actual purchase of the home l. They saved there daughter a lot of stress and worry.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Exactly yes.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Ding ding ding. This is the winner of an answer.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Oh good point! I hadn’t thought of it this way.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9041,
      "content": "It’s not even a small amount either, I mean 4K and 800 is a big difference. If you plan to give him 4K when he gets a house then maybe no biggie, also dunno why your wife is so irritated by him explaining the clear disparity. \n\nI’d expect my kid to be pissed if I made one a sandwich and not the other.",
      "id": 73,
      "comments": [
        {
          "score": 5074,
          "content": "On paper, sure. But this kid gets sandwiches every day because he lives at home and only pays for his gas, insurance, and *some* food. He doesn’t need a second sandwich. He might, someday, but for now, 80% of his life is paid for. \n\n$4000 will go to a new couch or carpet or a fridge when that breaks. Son doesn’t need those things right now. She basically getting $4k to help with bills, which he doesn’t have, at least not yet. Instead, he got $800 of fun gifts. \n\nId say fuck it and put $3200 in the bank for when HE buys a house, just so he knows it’s there for him. Every year he, too, can just get money earmarked for bills he *may* incur at some point, but no toys or luxuries because we want it to be super fair and make sure no one gets anything less or different.",
          "id": 74,
          "comments": [
            {
              "score": 1679,
              "content": "Yeah I can agree with this, and I really do see both sides here until they jumped to getting irritated and frustrated with him. He even asked to talk civilly and understand that he’s not asking for $4000, but just for things to feel a bit more balanced.",
              "id": 75,
              "comments": [
                {
                  "score": 1795,
                  "content": "But how do they balance things without giving him the money?\n\nThis feels like a 13-year-old getting annoyed because their 17-year-old sibling got a car and they didn't. You're at a different stage in life. Not everything can be reduced to a price tag.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 1238,
                      "content": "They make it feel balanced by not giving the money as a Christmas gift. Give it separately.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Funny example. When i was 8 my 18 year old sister got a driving license and car bought by my parents.\n\nThen, ten years later, my parents weren't as rich anymore, crisis and stuff you know, and i got only 50% of my drivings license paid, which honestly still made me feel guilty AF, and no car.\n\nSo yeah. Be careful with giving such gifts to your older children because you might not be able to match them later.\n\nI'm sure happy that it happened for my sister, but ngl I wish it also happened for me.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I don;t think its appropriate for the son to say OP should have given her less because of his feelings. He's not being treated unequally, he's just not at the milestone yet.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "He was asking for the money. Read between the lines.",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "I don’t think they jumped on him, they explained their reasoning and he didn’t like it. \nThey got him thoughtful gifts geared toward him 800$ is nothing to sniff at. \n4,000 is a lot, but being a new homeowner that could be a busted pipe away from wiping it out. \n\nSo I do think he is sounding very entitled. \n\nI have two children with a semi large age gaps. They’re at different stages of life. \n\nI got my oldest an iPad one year and my little one dolls. I did not; however, give my little one 400$ in dolls. The next year she wanted an x box and that’s what she got. It evens out eventually. \n\nA concept I go by is fair, not equal. People end up spending way to much money and end up stressed out being equal. And also spoil their children. Think of it like this, If Sally and Mindy both do basketball and they each got new shoes at the beginning of the year, but Mindy’s needed replacing and Sally’s didn’t I would replace Mindys. Because sally does not need hers replaced. And yes you should validate Sally’s feelings about not getting new shoes, But she doesn’t need the new shoes, Mindy does. And you tell her that when she needs new shoes you will replace them then. \n\nAnd then a couple months later her shoes die so she gets new shoes and Mindy doesn’t.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 766,
              "content": "Except the sister got the same perks and lived rent free there also.",
              "id": 82,
              "comments": [
                {
                  "score": 675,
                  "content": "And i bet those years, she didn’t get $4k in cash. \n\nTo me, it’s like a college fund. I “got” a lot of money when I went to school, it was just paid to the school and not me, but I got an education and to sleep in a dorm and go to parties and generally had an amazing time. My sister did not get an equivalent amount to have fun with. BUT when she went to college, she also got THE SAME help and no one was kicking me down extra funds because she happened to be getting more support that year. \n\nI mean, yes, as an adult, I get a lot of enjoyment out of a new appliance. But not PS5 enjoyment, despite the fridge/stove/water heater costing more. It’s “fun” but if it all was equal, I’d prefer getting fun gifts over buying a new appliance or home repairs, which was the intent of the gift.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 148,
                  "content": "Whose to say to he won’t get 4k when he buys a house while she only gets personalized gifts?",
                  "id": 84,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 347,
              "content": "Exactly I am the little bro in this situation. My sister bought her first condo last year. She has been dealing with a roof leak for a year(the HOA for her building was making getting it fixed difficult). If my parents gave her a couple grand for the holidays so she could do the minor repairs/fixes she put off so she could focus on the roof I would absolutely understand. I also think his son needs to understand that life isn’t always 1 for 1. This year his sister got a significantly larger gift do you circumstances - next year he could end up with the bigger gift. \n\nINFO for OP: did you by any chance mention to your son that if/when he buys his own place you would be giving him a similar gift?",
              "id": 85,
              "comments": [
                {
                  "score": 21,
                  "content": "OP said they didn't want to say that to the son as it feels like they're pressuring him. I absolutely do not get it.\n\nI'm the oldest. I always got the most support first because I did all the big life things first. I had my first house 10 years before my siblings. They subsequently got a lot more support for their houses, mainly because they didn't want to do what I did to afford it on a budget and build house in a new area. However, my parents record all the support and essentially offset it against any future inheritance or gift more money to even it out.\n\nFor me, I could have been resentful at always getting less for the same events, they could have been resentful for me getting more at a particular point in time. Neither was though, as my parents are always very fair and even it out over time.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Yeah, my sister and I have always supported each other being helped in ways that were equitable to our lives at that moment. I can understand why people are upset that the parents didn’t use this to talk to the son more about how this works (e.g. that fairness would be him getting this when he gets a house/has a bigger need) but I don’t really relate to the son at all.  \n\nEven by our early to mid-twenties, my sister and I didn’t worry about who was getting more (if anything, we were more worried about each other—like advocating to our parents on each other’s behalf. There were times I couldn’t help her out (because I was young and broke) and I knew she needed extra help, and I’d reach out to my mom to see if she could give her some temporary extra financial help. \n\nBut I do think this could have been a teachable moment for the parents with the son (with respect and validating his feelings still). And also agree that a lot of headaches would have been solved if they’d just separated the gifts. But it’s all kind of just “everyone being imperfect” and NAH (in any real sense).",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "Perhaps the other $3200 could have been separated and given as a housewarming gift.  \n\nI do think there is value to trying to be equal but I agree that they are in very different places in life and it's tough to maintain.   I have one at home and one on their own also.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 61,
              "content": "that's just it. But will he get it when he reaches that milestone?\n\nmy BIL got a generous chunk of downpayment from his family, and my spouse was promised same amount. When it came time for us, the downpayment help we were promised was gone. I'd like to say we never asked or assumed we would get - but instead were told we would receive. My spouse didn't seem surprised and said it was always like this growing up.\n\nEdit: to the folks saying son is acting entitled by asking for 4k. Son isn’t saying that. He even said he’s not saying that. He expected gifts to be equal, such as them both getting 800 bucks worth of gifts. Here’s an extreme example illustrating his point: daughter gets a new car and son gets a car freshener in his favorite scent. Not saying the parents can’t gift the sister 4k for surprise expenses. But packaging as her Xmas gift is an AH move. One commenter got it right. Should have gifted it as a housewarming and told son when he finds a place, they’ll do the same. OP and wife are acting blatantly ignorant how it looks to give one kid an extravagant gift and the other kid a lesser gift. \n\nAnyone commenting that the kid gets to live there for free. It’s 2023. A majority of kids under 30 live at home still because it’s too expensive and out of necessity.",
              "id": 89,
              "comments": [
                {
                  "score": 16,
                  "content": "OP says he planned to. We can only take him at his word. My parents, I trust to be as fair as they have always been. Your in laws, not so much, and it absolutely sucks that he knew not to expect anything from them.  It son didn’t air a list of other times they’ve been “unfair,” so I can’t assume OP will suddenly stop helping his kids when it’s his son’s turn.",
                  "id": 90,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "That example isn’t even a good one. An alternate scenario that better illustrates OPs sons entitlement(I actually read this in another comment but I can’t find it anymore) is a 14 year old getting a PS5 for Christmas and his 16 year old sister getting a modest starter car and the son crying because the car costs more than a ps5. Even though most likely when he turns 16 he’ll get a car too. Lol it’s not because his parents love the sister more, she’s just reached a milestone first??? Imagine the 14 year old complaining that since he got a ps5 and it’s worth $1000 his sister should only get a junk car worth $1000 to make it fair?!?? Like, does that really sound reasonable to you people??!?\n\nThe bratty behavior from OPs son I would expect from a child who can’t see past themselves. But this is a grown man and he’s acting like a spoiled child.",
                  "id": 91,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Fair doesn’t always mean equal. As a parent I’m shocked to hear the entitlement and audacity coming from the son. Yes, he approached them in a calm way and expressed his feelings the best way he knew how, however, he lives rent free, close to utility & bill free, his parents are affording him the opportunity to save and if he so chooses, buy a home with those savings. \n\nAnd from the other end of the spectrum, as a child with multiple siblings, (myself the oldest at 40+ and my youngest sibling being 16) I would never expect our parents to give us all the same or equal everything given our different circumstances and lives. Living rent and bill free I wouldn’t expect anything, more than likely I’d want to make sure I’m gifting them something showing my gratitude for the lifestyle I’m being afforded. I don’t think the parents are the AH here at all.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 694,
          "content": "She's frustrated because she says he's bean counting. She hates when people have relationship legers. She thinks thoughtful gestures should come from the heart, not be balancing imaginary books. I think it really bothers her because her mom is like that. My mother in law is very materialistic and doesn't care about sentiment, where my wife is very sentimental.",
          "id": 93,
          "comments": [
            {
              "score": 1079,
              "content": "Op I think your wife is the only ah in this situation. Your son came to you guys politely and while his sister wasn't around. Instead of reassuring him that his concerns weren't true.  your wife immediately got frustrated and chose the least charitable interpretation of his actions even though that's what she accused him of doing. he was the one trying to have a civil conversation and your wife is the one who wouldn't let that happen. I don't think you were wrong for giving the gifts you did but I don't think you guys handled his disappointment well in any way.",
              "id": 94,
              "comments": [
                {
                  "score": 472,
                  "content": "OP said that they explained to him the difference in gifts and after their explanation, he basically just said, yeah, well, I'm still upset. That would be frustrating. Like, what's there to talk about if the response is, \"That's the way I feel and I can't help it\"?  He's allowed his feelings, but so are his parents.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 379,
                      "content": "Because as the son mentioned to the parents, they were simply justifying their position and not understanding WHY he was hurt. \nIt would have been far easier to simply say \"we understand why you might feel that way, but rest assured when you are in the same position, you will receive a similar gift\".\nThere was no understanding, no reassurance, just justification.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 294,
              "content": "If he's been counting its because this is a pattern of behavior.",
              "id": 97,
              "comments": [
                {
                  "score": 125,
                  "content": "This level of disparity doesn't really need too much work to count.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 94,
                      "content": "There’s no disparity. If he had just bought his first house we would have also received $4000",
                      "id": 99,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Lol no. Some people feel slighted when there is none. Example:\n\nMy brother always says I got \"more\" than he did growing up. But it really wasn't like that. We were both spoiled. I got a computer first because I'm 4 years older but then he got a better computer when he did get one. I got a car at 16 and it was a pretty nice used car that I didn't pick bevause I had no preference except safety. He got an older used car because that's exactly what he wanted. I kept my car until I traded it in when I was in my 20s. He wrecked his so they ended up buying him 3 cars and the down payment for a 4th. I got some money for textbooks a couple of times and he didn't because he chose not to go to school. We both had to rent as young adults but he would always ask them for money so it was a wash. \n\nBut according to him, my parents screwed him over when compared to me. It's bonkers and OP's kid could be like that.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Or the sister just bought a house and that is the reason for the disparity. I think you a reading into it something that isn't stated.",
                  "id": 101,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Or the kid could just be a tad greedy for his own good. He is 22, lives at home paying minimally towards it and still got $800 worth of gifts this year yet that wasn't enough for him. \n\nI'm not saying this is the case, but it is just as likely as yours is.",
                  "id": 102,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "> If he's been counting\n\nNotice that OP said \"*bean counting*\", as in counting beans. Not that the son has been counting before.\n\nIn the business world \"*bean counters*\" is a nickname for the accountants that keep track of every dollar and cent that you spend, without really considering what you get for the money.",
                  "id": 103,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 202,
              "content": "Is money really sentimental though?  I mean....money is like the least personal gift you can give.  Even a gift card shows you spent some time deciding on a store you think the recipient would like.",
              "id": 104,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 184,
              "content": "Calling it a \"relationship ledger\" is unfair.\n\nIf your wife received a cheap $5 wine opener (say she's into wine) and her sister received a nice car (say her sister is into cars), would she say the gifts are equal because they're sentimental? Or would she maybe then be able to feel what your son is feeling?\n\nYour wife needs therapy because she is projecting her issues onto your son's feelings and that will damage their relationship in a major way.",
              "id": 105,
              "comments": [
                {
                  "score": 101,
                  "content": "That's a much bigger disparity than what happened here.",
                  "id": 106,
                  "comments": [
                    {
                      "score": 79,
                      "content": "$3200 is a lot of money. If it's actually all about \"sentimentality\" and keeping track of money is a \"relationship ledger,\" the disparity could be a billion to one and the wife shouldn't care because \"it's the thought that counts.\"\n\nI'm exaggerating because the wife is being disingenuous. She's accusing her son of keeping a relationship ledger but I'm sure that she herself would be hurt if her sister received 5x the gift amount that she did on Christmas.",
                      "id": 107,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "I mean you need to add a circumstance that actually makes sense for the above to happen. OP has one because his daughter just got her first place. Yours is just some vindictive type of thing where the parents dislike one child.\n\nHis wife does not need therapy. My god. If she does it isn't because of the very limited data provided here.",
                  "id": 108,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "You have no basis to say its fair or unfair. You have no idea how op has treated his respective kids for the preceding 20+ years.",
                  "id": 109,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Here is $800 of fun gifts. Your rent is paid and you have no bills and no unexpected costs coming up because you live with us. Just have fun. \n\nHere’s $4000 in cash because you own your own home and we expect you to have a lot of unexpected costs in your first year. This is your emergency fund. Good luck!\n\nMy brother got a house for Christmas this year, also some cufflinks. I got a brooch. I’m fine with that, because I know when I find a house my parents will give me a similar amount of money to buy one.\n\nIt’s really not hard for siblings to look at the bigger picture and just be happy for the other one knowing that their turn will come.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 132,
              "content": "There is counting and there there just looking at glaring evidence. \nSure, if he was complaing that he got 570$ over the years in Xmas gifts, while his sister got 595$ over the same time, that's keeping a ledger. \nBut pointing out that 4000$ is much more then 800$ is stating the obvious.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 107,
              "content": "But isn't she bean counting by basing a gift on the fact that your daughter \"needs\" more money right now? There's nothing sentimental about that - it's pure practicality.\n\nYTA, and there's nothing sentimental about your wife's reasoning.",
              "id": 112,
              "comments": [
                {
                  "score": 20,
                  "content": "The sentimental intent is having sympathy for a first time homeowner and not making the daughter struggle as much as they had to.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 74,
              "content": "He isn’t counting beans here though. It’s more like he’s holding the bag beans you gave him while he watches you give her keys to the storage locker full of beans you gave her for the same occasion. \n\nIt doesn’t take a ledger book to do that math. \n\nIt would have been much more appropriate to even out the holiday gifts and give her a housewarming gift separately from your Xmas celebration.",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 54,
              "content": "There's nothing sentimental about 3200. If you wanted to give her money to help with expenses that's fine. But you made it her Christmas gift. You absolutely are playing favorites. Your ignoring how you son feels. When you hurt somone you don't get to tell them their wrong. It's very clearly not about wanting more because he said her getting the same as him would have been fine. And your right, it's your money, you can distribute it however you like, but you don't also get to control and manipulate others in to reacting to your choices in a way you approve of. \n\nThey very act of identifying him as having a \"ledger\" is the same thing as having one. She's is weighing and measuring him and his reactions even more so than he is because she is counting up and weighing his feelings and counting that against him. At least a ledger is based on actions.",
              "id": 115,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "It’s not been counting when it’s a giant disparity and done right in front of his face. Your wife was so invalidating and owes your son an apology for dismissing his feelings when he was so mature and open with you and your wife responded like a scorned child.",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "> She hates when people have relationship ledgers\n\nYeah, because she treats people unequally. People who behave poorly hate being called out on it.",
              "id": 117,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 351,
          "content": "The kid lives at home, rent free. He's definitely looking a gift horse in the mouth! Also, he can feel any way he pleases, but he should be able to understand the nuance of a situation and not run his mouth. He's being jealous. \n\nNTA",
          "id": 118,
          "comments": [
            {
              "score": 321,
              "content": "Had to scroll way too long to find this take. The son is a grown ass man ffs. When he buys a house I’m sure he’ll get help as well. But right now he’s living rent free at home. The fact it was done at Christmas feels irrelevant when we’re discussing adults. I feel like my 14 year old son could already grasp this. And maybe this is just me, but to still be getting nearly a grand in gifts at 22 feels pretty lucky. I certainly wasn’t receiving that level of gifts at that age. And as mom I’d be frustrated too. I don’t see all this awfulness on her end that everyone else does. She called him entitled. I agree. I’d be annoyed to have this convo with a grown man as well. Sometimes our kids need to hear about themselves from us. I consider it a pretty critical part of my job. Long as we love them at the same time. My kids regularly get talks about selfishness, feelings of entitlement, equity vs equality, etc.",
              "id": 119,
              "comments": [
                {
                  "score": 145,
                  "content": "Finally someone making sense. I bet most of the Y T A votes are young adults projecting.\n\nNTA",
                  "id": 120,
                  "comments": [
                    {
                      "score": 31,
                      "content": "Seriously. I feel like I'm taking crazy pills here. The kid got more money in gifts than a lot of families give in total combined gifts. Kid is being entitled IMO. Especially since he lives at home and the parents explained it was specifically as a house warming present.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Seriously. A 22 year old got 800 dollars worth of gifts and instead of being appreciative and happy for his sister's accomplishments he throws a hissy fit over it, and people here think he's in the right! The comments calling the wife the asshole are wild, she's the most sane in all of this. \n\nReminds me of an old post here where a couple's teenage daughter wanted a separate bedroom for herself, but their house only had two. Comments with hundreds of upvotes were telling OP she was the asshole, and that she and her husband should sleep in the living room so that their daughter could have her own bedroom. Insanity.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Was just thinking that. Wonder if these votes are coming from parents or angry kids (young adults).",
                      "id": 123,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 91,
                  "content": "[removed]",
                  "id": 124,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 21,
                  "content": "The daughter lived rent free until a similar age. He isn’t getting anything that she didn’t already get.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Seriously! Imagine thinking $800 worth of gifts is an afterthought. I’d feel frustrated too if I was mom. It’s like a slap in the face.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "My parents always give us kids (and now the grandkids) a \"reserve bank gift card\" for Christmas (along with a small gift to unwrap) and some years I *really* appreciate that little bit extra - Decembers are expensive, what with all the friends and family gatherings that you want to cook nice things for, and outings etc. \n\nSo, them giving her the money at Christmas is also exceedingly practical. It's a lean month for many. \n\nDepending on how independent the son is (at that age, I was mostly relying on the parentals for most groceries, now I buy the grocery stuff myself even while I'm living with them again), he might not be aware of the \"expensive December\" phenomenon. \n\nHe has some growing up to do. Hopefully this will blow over. Admitting you're being an ass is also something you learn as you mature.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 239,
              "content": "NTA\n\nI hate when kids see their siblings get something and instead of being excited, they’re all “what about meeeee”. (When it’s not a pattern of dysfunction/GC/scapegoat).\n\nYes, he was respectful when he brought it up - but that doesn’t mean it wasn’t selfish.\n\nThe explanation for Op’s son is: “I’m sorry you feel this way, but when you buy a house we’ll do the same for you.”",
              "id": 128,
              "comments": [
                {
                  "score": 106,
                  "content": "If that's the case, why did they give sister the $4k for Christmas instead of when she bought the house in July, if this was a milestone gift\n\nIf this was better planned, they could have also given gifts to sister for \"Xmas\" and then cash as a \"Milestone\" and upfront told son thats how it was going to work before hand - that it wasn't an Xmas gift, but a life milestone separate from Xmas.\n\nIt doesn't really sound like they made that distinction clearly enough, which is just poor handling from OP and wife. We always make sure shared gift giving days are equitable for our gremlins so we can avoid this - and if we cant make things financially equitable, we make them socially equitable. What really makes this situation suck is that OP's son tried to share how he felt in a pretty mature and respectable way; but the story makes it sound like this devolved into chaos because the parents couldn't effectively communicate this was supposed to be a milestone gift.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "Did OP specify the living arrangements? I don't see anything about OP's son paying rent, or if the sister was staying on the same arrangements. \n\nIf they were the same arrangements, is OPs son getting the same when he gets a house? Does he understand that and did OP communicate that? And if so, did it need to be a Christmas gift? How was it presented, exactly? Was it in way that erases that context of it being a milestone vs Xmas gift? And could OP and wife explain this to son before handing the gift over to ease the shock of the moment? I think all this info is important to the conversation.\n\nWe also don't have any context to the family dynamic that may be adding to the problem. Has OPs son done this before? How is the sister treated compared to the son? Is there sibling rivalry, is one more or less successful than the other?\n\n\nI really think calling him 'jealous' [envious] is an over simplification.",
              "id": 130,
              "comments": [
                {
                  "score": 6,
                  "content": "We also have to assume that the 26-year-old likely had similar living expenses when she was 22 (living with the parents, or living somewhere paid for by the parents)",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "His own living situation isn't even remotely part of the issue, and even OP seems to see that. There's no reason to bring the tired old \"if you're not paying rent you're not allowed to have wants and needs\" argument that seems to be popular on this side of reddit \n\nI don't think expecting to be able to express your feelings to your own parents constitutes as \"running his mouth\". He didn't come out the gates making demands, he started off simply saying \"I haven't said anything because I know these feelings aren't worth ruining the holidays or upsetting my sister, but this thing made me upset and I want to talk about it\". He didn't start asking for things until his parents started making judgments on his character, which would make anyone defensive.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6738,
      "content": "EDIT:  After reading your responses, YTA.  I have no issue with you giving your daughter money.  Hell - I have no issue with you giving her more money.  Buying a house can suck, and things pop up that you never expect.  And everything is expensive.   But YTA for (1) framing it as a Christmas gift and not a housewarming gift and (2) the way you treated your son.  He did it right - he didn't attack - he just said these are my feelings.  And your wife immediately started going on the offensive and belittling his feelings.  Don't you want your son to feel comfortable coming to you with his problems?  Discussing his feelings with you?  Why would he feel comfortable speaking to either of you now?  If he comes to you with a problem - are you going to help - or are you going to sit there while his mom calls him names?  That's what makes you the asshole in my eyes.  He handled it right.  You guys didn't handle it correctly to begin with (though your heart seems to have been in the right place) and then you definitely didn't handle it right after the conversation.    \n\n\nINFO:  Why did it have to be at Christmas time that you gave her money for *possible* repairs?  Why not wait for X, Y, or Z to break down, and then cover the cost for her?  What happens if she doesn't have $3,200 worth of repairs come up?",
      "id": 133,
      "comments": [
        {
          "score": 2663,
          "content": "Yeah, I think the 4K should have been a housewarming gift, and the kids' Christmas gifts equitable.",
          "id": 134,
          "comments": [
            {
              "score": 950,
              "content": "This is the easy common sense answer OP is somehow missing. \n\nYTA",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 316,
              "content": "Exactly.  My son just got a college graduation gift from me of a nice amount of cash.  My other son didn't.  Because he hasn't graduated college yet.  There is ZERO resentment from my other son because duh, he hasn't graduated yet.  \n\nGiving vastly unequal gifts at Christmas just doesn't make sense.",
              "id": 136,
              "comments": [
                {
                  "score": 37,
                  "content": "Facts, the son should ask mom how would she feel if she got a pair of socks for Christmas from him and he gave his dad a Lamborghini, cannot understand how they not get it. Splitting into Christmas and house gift would have been the best choice. YTA",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "OR a more normal thing to do would be buy a nice bottle of whatever their flavour of beverage is, attach a fancy card with \"I.O.U your first major repair in your new home\" and then Christmas gifts totally separately",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 147,
          "content": "And what happens when she has already spent the repair money when the repairs come up?",
          "id": 139,
          "comments": [
            {
              "score": 61,
              "content": "…she pays for the repairs herself? \n\nDo you think her only source of money for repairs is the $4k she was gifted?",
              "id": 140,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 84,
          "content": " Right. I think the real issue here is that they just handed over a $4K check. Even if it is intended for the house, there is no rules stopping her from using it on something else. While I am sure OP hopes she saves it for a rainy day; it’s unrestricted funds at the end of the day. I think the son would feel better about it if the gift was something actually tied to the house (e.g. 2 years of a home warranty?). YTA.",
          "id": 141,
          "comments": [
            {
              "score": 29,
              "content": "Gifts shouldn't come with rules.",
              "id": 142,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Makes me wonder where the child got all of his emotional maturity from because he clearly got no such thing from his parents. There is a clear lack of empathy and understanding one from their actions, and their lack of doing anything actionable in response to the comments. Don’t post here if you’re not prepared to be called an asshole you know? I completely agree with what you said, the parents are the only ones to blame.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Absolutely agree. I honestly don't give a shit about the money or presents or Christmas vs housewarming or any of that. \n\nOP, the crux of the issue was that your son felt that you weren't as proud of him for not achieving what his sister has. That's not a thing an adult says lightly. He came to you privately, calmly, and without accusing. He described his feelings, where he feels like he hasn't achieved as much as his sister and he feels crummy about that. Instead of freaking out about \"omg he's such an entitled brat,\" maybe help him explore that. Does he usually compare himself to his sister, either when she was also 22 or now? Does he feel stuck in some way, like in employment or financially or with his relationships? Parenting doesn't end when he turns 18. Jealousy and inadequacy are feelings we deal with our whole lives. How did you bother trying to help him with this? Or did you just focus on the trees and miss the forest?",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "The son went to them and told them his issue, they gave a good excuse. The son then said, \"But I still feel hurt for the disparity,\" the parents replied, \"What do you suggest we do to make up for it?\" And the son replies with \"IDK\"  \n\nAfter that, the conversation started going in a circle until the Mom got fed up and started calling her son entitled, which was the wrong move, but still, what did you expect happen? \n\nFrom how the situation was going, the only endings would have been giving the son $3,200 or someone's feelings getting hurt. The best outcome would have been the parents admitting they goofed up and trying to do better next time. \n\nA similar situation happened to me when I was much younger. My family doesn't celebrate Christmas since we aren't Christian and don't live in a Christian country, but both my older sister and I share the same birthday. \n\nDuring one of our birthdays, my sister got a phone, and I just got a toy nowhere near the worth of a phone. Was I jealous? Of course, but when I told my parents that they told me essentially what OP and his wife told their son. My sister was older, and she would start going out more, and she needed the phone in case something happened. \n\nAlthough I was still jealous, I dropped the issue because I trusted that my parents would gift me a phone when I was old enough, like they did with my sister. \n\nAll in all, the entire situation is a NAH scenario. The parents aren't TA for giving their daughter the gift, the son isn't TA for feeling it was unfair (which it wasn't) and the parents aren't TA for responding the way they did. Just because their response wasn't optimal, that doesn't make them TA.",
          "id": 145,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 10,
          "content": ">He did it right - he didn't attack - he just said these are my feelings\n\nThis right here. He simply stated \"hey this feels really unfair and I'm hurt by it\". Clear message, no guesswork, and OP is thinking he's in the wrong",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Agreed, OP waited 5 months to give this money obviously she didn't need it that bad.",
          "id": 147,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Ok, I can agree that it would be better to frame the 4k dollars as a house warming gift, fair... But how exactly did OP's wife belittle the son's feelings? By asking him why he chose the worst possible (and most insulting) interpretation for their actions? By asking him if he wanted 4k in gifts? The son still got 800$ in gifts, IMHO anyone who receives gifts for hundreds of dollars and still complains is entitled. All the more so if the person receiving the gifts still lives with the parents and wakes up at lunchtime (unless he works night hours of course).",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": ">\tINFO:  Why did it have to be at Christmas time that you gave her money for possible repairs?  Why not wait for X, Y, or Z to break down, and then cover the cost for her?  What happens if she doesn’t have $3,200 worth of repairs come up?\n\nIt goes into a rainy day fund until they need it? Do y’all not have a savings account where you keep money you don’t need to use until you do need to use it?",
          "id": 149,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4318,
      "content": "NTA. I feel like people on here hate ‘favoritism’ so much that they think you have to treat your kids equally every second of their lives. The fact is, when children are different ages/at different places in life, they’ll be going through different milestones at different times. For example, if one of your children had gotten their license that year and you got them a car for Christmas, that doesn’t mean you need to spend a car’s worth of money on your other child that Christmas. That’d be ridiculous. As long as you treat the kids the same in the long run and help them out similarly for these milestones, it’s okay for there to be a little disparity every once in a while.",
      "id": 150,
      "comments": [
        {
          "score": 1654,
          "content": "This is the best comment. I’m a little baffled at the gall of your son for bringing up. The difference in situations should be very clear to him. Daughter is on her own. Money is tight after buying a house. Son lives at home and has the majority of his bills taken care of. It’s a case in which the son shares in everything the parents have, but wonders why he can’t have more from them. It is entitled behavior. \n\nNTA",
          "id": 151,
          "comments": [
            {
              "score": 788,
              "content": "[deleted]",
              "id": 152,
              "comments": [
                {
                  "score": 520,
                  "content": "I dont see how he's being a brat. He didn't cause a scene or anything just wanted to have a civil talk about it. OP could have said it was a housewarming gift and the son would see the same treatment when he buys his first home.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 370,
                      "content": "[deleted]",
                      "id": 154,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 214,
                      "content": "Because he didn't whine and have a tantrum doesn't mean he isn't acting entitled.  He was rational but still in the wrong",
                      "id": 155,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 37,
                      "content": "But why does the son, at 22 years old,  think his parents have to give him a gift of equal value to his sister? That's something you'd hear from little kids.",
                      "id": 156,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "A non-entitled brat would realize he would get the same and express gratitude for his EIGHT HUNDRED FUCKING DOLLARS worth of gifts.",
                      "id": 157,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Civilly talking about how fucking entitled you are and jealous of your own sister getting money for bills is absolutely 1000% being a brat.",
                      "id": 158,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 397,
                  "content": "It’s funny too bc this sub is SO QUICK to remind everyone that a 16yo “is old enough to not be an entitled ah” but are acting like this 22 yo is fine for whining about his 800.00 worth of presents because his sister got more. It’s ridiculous. It’s their money they can spend it when and how they want, and likely when HE has a major life event with the subsequent expenses they’ll be just as helpful to him",
                  "id": 159,
                  "comments": [
                    {
                      "score": 174,
                      "content": "[deleted]",
                      "id": 160,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "There's a lot of entitled brats who see themselves in the son.",
                  "id": 161,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 19,
                  "content": "I agree. $800 is not a small amount of money at all. I don't think I've ever gotten that much worth of presents in one holiday - and I've felt very spoiled. I've been in the son's position before and felt no negative feelings about it - because if your parents are catering your presents to what you need/like, then values are going to be different. I can see why some people think that the cash gift should've been framed as a house-warming gift instead, but it seems like a small misstep at worst. \n\nNTA",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "You're asking why all the Redditors would rush to the defense of the younger brother who lives at home who only got $800 worth of Steam cards while big sister who's actually doing something with her life gets more?",
                  "id": 163,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "Yes, he totally needs to start paying rent! He's getting pampered by his parents at an age were others are already independent and financially on their own.  Them he whines about his Christmas presents worth is \"only\" 800 dollar? Dude needs a reality check.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "its almost like reddit is full of spoiled brats\n\nlol",
                  "id": 165,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "Yeah, this is clear cut NTA. Redditors are the dumbest fucking people, I swear to god. Everything that could be somewhat twisted to be even minutely unfair or not 50/50 perfectly balanced is a terrible, assholish gesture worthy of ridicule. But then, name a better duo than Reddit users and untreated mental illness/harmfully stunted real life experience.\n\nThe son is being a huge baby. I'd understand if you helped one kid and not the other, but I would never in all of my years be angry that my parents gave a sibling extra money as a present (even on cHrIsTmAs omg111!) when they had just bought a house.\n\nAnyone saying YTA can get BTFO.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Completely agree. Either way it’s the parents money. They decide on their own accord how much to give. The son lives rent free. 100% entitled for being upset.",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "I’m baffled at all the comments defending him for “expressing his feelings” and berating his mother for getting frustrated with him. But like.. the feelings he was expressing were of entitlement. He saw his sister be in a totally different life stage than him and instead of understanding she has different needs he went “but what about meee”. \n\nAnd it’s not like his parents got him a cheap gift and told him to suck it up, he got 800$ worth of stuff! And I’d even argue that she’s going to spend her money on repairs or necessities, while he got fun/hobby things! Where’s the gratitude?\n\nI’d be frustrated too as a parent if this is how my generosity was received. And for the people saying they should’ve given her the money on a separate day, I say I’d get being extra careful with how they frame gifts if the kid was 12, but at 22 he should have the capacity to understand why she got more.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I can't understand how someone can feel like 800 dollars isn't enough as a gift and think that this isn't a reasonable situation while being... 22 YEARS OLD\n\nAnd for those people saying that he's an asshole for framing it as a Christmas gift, it doesn't matter, it's the same situation for him, it won't change if you just say \"oh we are giving your sister 3000 dollars\" at a random time",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 700,
          "content": "100% this\n\n$4,000 just doesn’t have the same utility to a kid living rent-free at home versus a kid who just bought a house. \n\nOnce you’re a homeowner, you don’t get $4,000 and think of all the cool stuff you can buy with it. You get $4,000 and think “oh thank god, if my heater breaks or my roof starts leaking I’m not gonna go bankrupt.” \n\nThe son’s gift was pure “fun stuff,” and the daughter’s gift is money that provides for something the son already has paid for by his parents. Unequal in dollar value, sure, but objectively, I’d be willing to bet that their son has more fun with his $800 worth of gifts than the daughter will ever have watching $4000 sit in an emergency fund until something breaks in the house. \n\nI’m a 25 y/o homeowner and my parents usually get me more expensive gifts than they get my siblings, but it’s all boring shit/pays for boring shit that no kid living at home would ever need or want because their parents take care of the boring stuff. My 16 year old brother who got a $500 PS5 bundle wasn’t exactly jealous that our dishwasher is worth $1000. He got the expensive thing he wanted, my wife and I got the expensive thing we wanted. And when he’s moved out & living on his own and my parents get him the expensive home gifts and I get an “I love you” card, I’ll be grateful to pass the torch.",
          "id": 170,
          "comments": [
            {
              "score": 276,
              "content": "Yea the fact that the son kept track of and calculated how much his parent’s spent on his gifts is icky. Be grateful that your parents spent $800 on your Christmas presents 🤦🏽‍♀️",
              "id": 171,
              "comments": [
                {
                  "score": 183,
                  "content": "Yea it's kind of concerning how much of Reddit feels bad for the bratt. You don't compare gift values especially when one is basically a combo house warming gift.",
                  "id": 172,
                  "comments": [
                    {
                      "score": 72,
                      "content": "I feel like most of those defending him are privileged young westerners",
                      "id": 173,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 28,
                      "content": "Most of the people on Reddit are teenagers so it’s skewed",
                      "id": 174,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 17,
                  "content": "Right? Its pretty embarresing to expect gifts from your parents in your mid-twenties. Also, $800 is A LOT to spend on one person for christmas. I'd be pretty grateful in this situation",
                  "id": 175,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Exactly! We still do gifts in my family, but we’re all well over *expecting* gifts. People in this sub must be teenagers I stg",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 559,
          "content": "This should be the top comment.\n\nNTA.\n\nAnd the kid IS saying that the only equivalence to be made is monetarily.\n\nHis mom spent her time finding him $800 of gifts that are specific to him. That is personal and sentimental. That counts for something. He is saying it doesn’t count for anything. \n\nHe clearly doesn’t care about his presents.\n\nHe just wants the cash. \n\nIt’s not about equity. \n\nAnd life isn’t equal all the time.\n\nIf he buys a house and they don’t help him out with costs afterward—THEN he can talk about unequal treatment.\n\nHe can be sour and let his parents know if he chooses to—but what was the point of it?\n\nYou choose when to air grievances that need fixing. You can also choose to be happy for a sibling.\n\nYou might ask if they’d do the same for you when you buy a house-that would open a conversation.\n\nHe wants them to give him money now for no reason and claim he’s being cheated. He’s acting like life has no context or nuance.\n\nI would be angry if I was this kid’s mom too. He’s 22, not 10. His morality should be developed past ‘that’s not fair’.",
          "id": 177,
          "comments": [
            {
              "score": 249,
              "content": "Do any of these people like their siblings? I have two brothers and I would understand if my parents did something like this and would be happy my brother had extra support during such a stressful time. I’ve also never added up the value of my Xmas presents and compared them to that of my brothers’ - it’s never even occurred to me!",
              "id": 178,
              "comments": [
                {
                  "score": 54,
                  "content": "I said this before, but judging from reddit alone it seems that north american families are like a second job where people put up with one another out of necessity. I can't imagine interacting like this with my parents or siblings.",
                  "id": 179,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 12,
                  "content": "I don't even like my siblings, and I've never added up \"gift value\". They certainly have and maybe that's one of the reasons I don't talk to them anymore.",
                  "id": 180,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Yeah, I don't get this. We get different things sometimes, me and my brother, because we're at different times in our lives, and no one has ever complained or was annoyed by it. It's normal and we know we'll get the same treatment when we each need it. We understand when the other needs more support.  \n\nI was thinking maybe the son feels unfairly treated because of other reasons...? If so then I hope he explains it better. If not he's very entitled.",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I Have a little bother that gets the vast majority of the help and attention from my parents, thats not because my parents hate me or my other brother its cause my little brother needs help.",
                  "id": 182,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "This 100%",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Yeah, maybe all the “YTA” people and the son woods prefer it if they gave him 4000 and then expected him to start paying market-value rent and paying for all his own bills and expenses.  Then that 4000 would truly be fair and equal.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "He also seems insecure about his sister's achievement. I was waiting for people to remember that he's a 22 year old grown man. I would've never uttered those words to my parents. They'd laugh me out of the room.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I'm irrationally upset it's not the top comment. Seeing all the people saying OP is the A makes me think that reddit really is filled with entitled basement dwellers. The kid lives at home and got fucking $800 worth of shit. And then he's sad his sister was given more. Everyone siding with the kid needs to grow the fuck up.",
              "id": 186,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 317,
          "content": "I wish I could upvote this 1000 times. \n\nAlso: son is living at home seemingly rent free! I’m sure he’s getting a lot more out of mum and dad than sister on average! \n\nOP - NTA. Your wife could have been slightly more sympathetic to your son airing his feelings, though.\n\nEdit: u/childplease_25 I can’t respond to your comment because the replier below blocked me. But my response: I find this notion that it being Christmas being responsible for the y t a judgements absolutely outrageous. 4K is a lot of money! They probably just saved that up, and Christmas is a time for giving gifts. Why should OP and wife have to split daughter’s gift into two parts and make the whole thing more complex and frankly awkward to give the illusion of fairness to their son? He’s 22 fucking years old!! \n\nI agree with the second point but it sounds like that’s what OP did? He explained that the son’s concerns about sister being favoured due to pride weren’t accurate and it was due to milestone. I don’t know if they explicitly said he’d get the same amount when he reached that milestone (but they’ve articulated this in the comments so I don’t see any reason why they wouldn’t have said that) AND they’ve done this discrepancy gift giving before when they bought each child a car. \n\nAll that aside son shouldn’t be giving them the cold shoulder or being ungrateful and petty for being given $800 of presents or free housing again at 22 years old!!",
          "id": 187,
          "comments": [
            {
              "score": 69,
              "content": "[deleted]",
              "id": 188,
              "comments": [
                {
                  "score": 132,
                  "content": "That’s exactly my point though. \n\nSon wants to benchmark with daughter *that year* while not taking into account their different circumstances.\n\nEdit: Someone below replied and then blocked me so I couldn't respond. I saw the response though - they're missing the pertinent fact that son is 22, not 12.",
                  "id": 189,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 197,
          "content": "Finally found the adult in the room. Son is entitled and should be mature enough to understand. Yes, even if it’s Christmas. \n\nNTA.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 158,
          "content": "Exactly. My grandmother just gave me 1000 dollars to put towards my wedding during our family Christmas gathering. Guess what? Nobody gave a shit because it's towards my wedding. My sisters didn't make a fuss.",
          "id": 191,
          "comments": [
            {
              "score": 103,
              "content": "My family also uses Christmas to give large cash gifts to support whatever people have going on in their lives, and none of the rest of us see it as favouritism. It's *convenient* when we're all together anyway for various checks to be handed out, and those checks are rarely equal. When my wedding was coming up, my grandma and my parents both gave me larger checks than my brother. And when my brother had each of his kids and bought a house, his cash gifts were larger than mine. This idea that gifting to adult children must always be equal is nuts to me.",
              "id": 192,
              "comments": [
                {
                  "score": 79,
                  "content": "It is kind of nuts. Don't see how they can even downplay 800 dollars, either. That's a whole game console or even a nice day out. To think he deserves 4k, for what? Is beyond me. People on here must never have to go through any issues to think this is an A H move.",
                  "id": 193,
                  "comments": [
                    {
                      "score": 50,
                      "content": "The deeper I get into my thirties the more it feels like most of the posters here are teenagers lol",
                      "id": 194,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I think this is a cultural thing. A lot of people are saying that the money should have been a house-warming gift rather than Christmas. The expectations involved are different for different people.",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "Not to mention. These are ADULT Children.     People  acting like these are two middle schoolers.\n\nI'm an adult and my parents might spend around 50 bucks on me for birthdays or Xmas. there i just something that rubs me the wrong way about adult children expecting extravagant spending from their parents on holidays",
          "id": 196,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "People are forgetting the son is 22 not 12!! A 12 yr old I can see being immature but 22 and he still doesn't realize he has no say in how his parents spend money?  And then gives them the silent treatment?  My 20 yr old knew this year had been a struggle and asked if we would just use the money we would spend on his presents on getting his teen siblings gifts instead. My son isn't perfect and neither am I but sometimes I forget how mature he is until I read Reddit.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "This well said. I also agree that $800 is a generous gift and the son should not be comparing with his sister who just bought a house. \n\n**NTA**.",
          "id": 198,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "I'm also surprised the son needs it spelled out for him that his sister's gift was Christmas + housewarming, while his was only Christmas.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1939,
      "content": "YTA - I typically don’t have much sympathy for people complaining about gift disparities, but in this case, you should have given your daughter a housewarming gift of cash separate from the Christmas gifts. By lumping a large amount of cash into her Christmas gift, you invite unfavorable comparisons.",
      "id": 200,
      "comments": [
        {
          "score": 919,
          "content": "Another way they could have dealt with this is to say “We plan to do the same for you when you buy your first home.” But no, they just keep going through all these mental gymnastics.",
          "id": 201,
          "comments": [
            {
              "score": 370,
              "content": "I know, why on earth would they just not say that and make it clear it’s a milestone gift but agree christmas may have not been the time. I’m sorry my actions hurt you, we had no intention, thank you for bringing it up to me so we could talk it out. Boom done.",
              "id": 202,
              "comments": [
                {
                  "score": 121,
                  "content": "Really makes me wonder if there is more to the picture than what was presented, it seems very easy to explain and tell the son he will receive the same once he moves out.  Same kinda things with all big gifts to children like cars or vacations, OP is fucking weird for not seeing this, how did he deal with education ?",
                  "id": 203,
                  "comments": [
                    {
                      "score": 30,
                      "content": "It would be interesting to know if they intended to do the same with the son. Why else wouldn’t you explain it like that.",
                      "id": 204,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "They never planned on doing it for the son because he's not the favored child, just based on the clearly correct way to approach this by the son that even dad trying to put himself in the right light couldn't avoid.",
                  "id": 205,
                  "comments": [
                    {
                      "score": 17,
                      "content": "That’s my honest opinion too. \n\nI totally get fucking up and giving it on Christmas. I would potentially do that being so wrapped up in gift giving, pun intended. \n\nThis was a very simple convo to have if the intentions were truly as he says.",
                      "id": 206,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "This was the AH part and not the gift.",
              "id": 207,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1603,
      "content": "I don't think either of you are TA, but I do think there's issues all around. \n\nI think the crux of the problem is that you chose to do this at Christmas. If you had waited a month and gifted your daughter the money as a housewarming gift then there wouldn't be a need for him to drawn a comparison. It would be assumed that when your son eventually got to that place in his life, you'd also return the gesture his way.\n\nAs the youngest kid in my family who typically also feels like an afterthought -- this is usually not about the gift, this is probably deeper than this one moment, but he is choosing this moment where it's obvious to point it out to you. Perhaps let him open up a larger conversation about whether he feels this way more often than just right now. \n\nTo be fair to you - your son is significantly younger and there's ample time for you to make the same gesture when he crosses this milestone, and he could stand to keep that in mind.",
      "id": 208,
      "comments": [
        {
          "score": 339,
          "content": "You really don't feel like the mom is TA? Her reaction just made things worse, at least for me. It was NAH until he approached his parents, after the holiday, to talk about it and was met with a bunch of stones coming from his mom.",
          "id": 209,
          "comments": [
            {
              "score": 89,
              "content": "I think Mom didn't really think it through, and shouldn't have been surprised that her son felt this way. Plenty of people don't react well when held accountable to their actions, and I think she should try to re-approach it, but I don't necessarily think she's an AH.",
              "id": 210,
              "comments": [
                {
                  "score": 26,
                  "content": "Yeah, but it happened yesterday and she’s still sulking it. Being a somewhat common response doesn’t make it appropriate. She should apologize, at least for how she reacted",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I think if someone complained after I spent $800 on gifts for them, I would be pretty annoyed too.",
                  "id": 212,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Agree on one of your points. I'm the youngest and my sister was the First Female Grandchild for both sets of my grandparents. she is 4 years older than me. \n\nshe got thousands of dollars for graduating high school. I got a couple hundred. she got thousands of dollars for graduating from college. I got nothing. she got thousands of dollars when she got married. I haven't had the pleasure yet, and I'm now 5 years older than she was when she got married, she's owned 2 homes and I'm still renting.\n\nmy family paid thousands of dollars for her to study Russian in Russia. I've never left north america. my grandparents took her on several international trips.\n\n... I've never left north america. etc.\n\nit goes on and on.\n\nmy ex was a youngest as well. his older sister had private college and sorority paid for; parents told him he could go to community college. she was given mom's couple years old car. he was given a decade+ old $1000 used vehicle. his sister is a terrible driver and his mother paid to replace her car when she inevitably wrecked it. he never wrecked his. \n\nit's... yeah. I dunno why, but it's a thing.\n\nI wish we had more INFO from OP.\n\nedit: I've never complained to my family about the disparity in money spent on me v. my sister. I'm glad things have worked out for her. it sucks that my life has sucked but a few thousand more dollars probably wouldn't have changed anything.\n\nwhereas my ex let the disparity between him and his sister be a CONSTANT sore point between him and his mother. tbf her getting to go away for college and him being stuck at home was a pretty brutal difference. at least my sister and I both had college away from home and paid for.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": ">your son if significantly younger\n\nHe’s not though. 22 and 26 are pretty close. Both of the kids are young adults.",
          "id": 214,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "> I don't think either of you are TA\n\nI'm not sure how you can say this after how they reacted to the son.",
          "id": 215,
          "comments": [
            {
              "score": 11,
              "content": "Idk, I’m not seeing anything relationship ending in what she said. She certainly was too harsh, didn’t listen enough, etc. but i also get where she’s coming from - she didn’t spend $30 on him, she spent $800. I get where her son is coming from and would be upset too, I’m just trying to have some empathy on both sides. She should def apologize but I personally wouldn’t categorize her as an AH.",
              "id": 216,
              "comments": [
                {
                  "score": 10,
                  "content": "She dismissed and minimized his feelings and went on the offensive when he tried to talk to them.",
                  "id": 217,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1540,
      "content": "Seems to me part of what you gave your daughter was a housewarming gift, and why would he expect to receive that too?  If she has a wedding, baby, etc, does he expect to receive the equivalent in those situations? \n\nHonestly, $800 is a lot of money for one person for Christmas, much less a grown-ass adult. I'd let him know when he hits similar milestones, you'll gift him similarly.  Unless you show consistent favoritism to her, he needs to stop keeping score and be more grateful.\n\nNTA.",
      "id": 218,
      "comments": [
        {
          "score": 699,
          "content": "I can't believe how far I had to scroll to find some common sense comments. My brother and i have the same age difference and saw our parents give different gifts at different times. OP's son is in a totally different path right now and $800 in gifts is A LOT of $$ for a grown man to receive. \n\nSounds like he is spoiled.",
          "id": 219,
          "comments": [
            {
              "score": 297,
              "content": "I was also shocked at the $800 on Christmas gifts for one person, and that he complained still. I’ve never gotten even quarter of that as a budget for Christmas gifts or any other holiday! Unreal (or more realistically, I’m just poor lmao).\n\nEdit: I can’t do math",
              "id": 220,
              "comments": [
                {
                  "score": 32,
                  "content": "dude I got an ~90 dollars gift for graduating and christmas and I got emotional for recieving that much, I can't get in my head how someone could feel less after getting 800 dollars for just another christmas",
                  "id": 221,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "yeah, a lot of this holiday complaining is due to the level of overspending people are conditioned to expect. The only time my brother and I complained about gifts were when 1)we were children and/or 2) the gifts were not age-appropriate and/or 3) when the giver wasn't honest/accurate about giving one.",
                  "id": 222,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 169,
              "content": "Me too . People on here seem to live in a very different world",
              "id": 223,
              "comments": [
                {
                  "score": 29,
                  "content": "More people here are like OP's son I bet.",
                  "id": 224,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Just has to be lol",
                      "id": 225,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "I scrolled up and re-read the post because I thought I missed something.",
                  "id": 226,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Dude gets $800 worth of christmass gifts presumably every year, a fucking car for high school graduation, gets to live with his rich parents rent free, is practically guaranteed to get bag of money later and has the audacity to complain...\n\n... and people here are defending him for some reason, this is the weirdest comment section I've ever read in this sub",
              "id": 227,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "They sound very rich, or maybe I have a skewed perspective because I'm poor.\n\nBut $4000 & $800 for a Christmas present, wow. And also buying a house at 26.",
              "id": 228,
              "comments": [
                {
                  "score": 6,
                  "content": "They're definitely comfortable. When I was a kid my parents would buy presents in the hundreds range (and higher). When we were adults that kind of gift-giving was reserved for cost-of-living situations. That's why the 22 year old comes off as so spoiled to me.",
                  "id": 229,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I know right, these people in here are wild. Reminded me of why I shouldn’t take reddit comments at face value or seriously 90% of the time",
              "id": 230,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 77,
          "content": "Didn’t they have every opportunity to do this, and instead mom just told him actually his sister got the worst gift because she only got cash, and so thus his feelings were invalid?",
          "id": 231,
          "comments": [
            {
              "score": 15,
              "content": "I read it as if the daughter got 800 in cash (to make it equal) then it would be worse than 800 in gifts, not 4000 vs 800",
              "id": 232,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "I'm sure they said a lot more than just what OP wrote here. But yeah, his feelings, while not invalid, are pretty unreasonable.",
              "id": 233,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "This. Maybe the timing of the $4k could have been better, don’t give on Christmas since it’s more than just a Christmas gift. But a grown man getting $800 worth of gifts and complaining… sounds like an ungrateful child to me. Also the $4k is likely going  to help keep up with bills/new house costs or other important things, while the $800 in gifts is likely frivolous “fun” gifts that will be enjoyed long after that $4k is spent on necessities.",
          "id": 234,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "I've never received an $800 gift in my life and I'm 41. He's an ungrateful child. I would be frustrated too as his mum.",
          "id": 235,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Also kinda hung up on that one. Sure 4k is a LOT more than 800, but 800 is still a LOT of money. At least to me it is. Back when my family still did the equivalent of christmas gifts, I'd be lucky to get 150 euro worth in gifts.\n\nHeck even with my expenses today, for 800 euro I could buy around 3 months worth of groceries...",
          "id": 236,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 690,
      "content": "I know what others are going to say, but I'm going with NTA. \n\nMy parents used to tell us all the time (especially at Christmas) that sometimes one child is more expensive then the other. I was always the more expensive child (ballet lessons, summer camp) year round but at Christmas I was happy getting less. When your son purchases a house, will you give him that same amount? Did you help your children out equally when they were in college?",
      "id": 237,
      "comments": [
        {
          "score": 936,
          "content": "Neither of our children went to college. I can't imagine why we wouldn't give him the same amount if he bought a house, unless inflation gets even crazier and he'd need more to afford the same repairs.",
          "id": 238,
          "comments": [
            {
              "score": 341,
              "content": "This comment here makes you NTA",
              "id": 239,
              "comments": [
                {
                  "score": 12,
                  "content": "No, this comment, told to the son when he was clearly upset, would have made them NTA",
                  "id": 240,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "No because the comment is way after the fact, and said to reddit, not their son",
                  "id": 241,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 137,
              "content": "Maybe you should've told him that instead of invalidating what he was feeling...",
              "id": 242,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 93,
              "content": "Did you let your son know this?  i still think you should have separated Xmas gifts with house warming gifts so there would be no hard feelings",
              "id": 243,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Okay, but why couldn’t you just simply explain that to your son instead of arguing over the merits of freedom and gift giving?? \n\n“Son, we combined her Christmas gift with her house warming gift, we certainly plan to gift you equally someday when you buy a house”",
              "id": 244,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "he just needs to know that you’re gonna do the same for him. Tell him that,",
              "id": 245,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "So tell him that.",
              "id": 246,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": " \n\n>\tI can’t imagine why we wouldn’t give him the same amount if he bought a house, unless inflation gets even crazier and he’d need more to afford the same repairs.\n\nDid you tell him this?",
              "id": 247,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Probably a good idea to mention this to him.",
              "id": 248,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 599,
      "content": "What is up with these Y T A comments ?  Are you guys teenagers ? It's absolutely fair on how they divied this up.  Your daughter is paying her own bills and moving into a house.  Your son got 800 dollars worth of gifts, works, and lives at home for free.  That 4000 dollars will absolutely go into that house , for something not as fun as the gifts he got I bet.  Like a broken water heater, shitty electric , so on and so forth.  Your son doesn't need that money right now.   Maybe next year gift him money on a down payment of an apartment and he can decide if he really needed that 4000 dollars in Christmas.\n\nEdit becasue comments are locked:. If the 22 years posted his pov , I'm willing to bet people would be calling him TA.  The fact of the matter is he is a GROWN MAN.  He is living rent free at his parents house. Fact of the matter is someone who just bought a house and paying their own bills, will probably need that 4000 dollars more , than someone who is living at home.  Something will break, and the parents gave her a little best egg to help with those fixes.  People are calling out the parents for not explaining that it's also a house warming gifts.  But at 22 years old he should realize that she'll need that money.  Let's say the be parents decided ok let me write you a check now to make it even. Do you think he'll regret that when he moves out to his own house and can't get that extra money then.  Or if they gave it to him and said you have thirty days to be figure out a place to live.  Becasue the ONLY way it would be considered not equal is if the son was moved out and paying his in own bills.  I'm sure he'll be sad while using those 800 dollar gifts.",
      "id": 249,
      "comments": [
        {
          "score": 143,
          "content": "I think the YTA comments come from how his parents reacted when he expressed his emotions. \n\nI don’t think they’re wrong for giving “unequal gifts.” Yes, giving the daughter the “housewarming gift” at another time would have been much more appropriate, but there being a better way to handle a situation doesn’t automatically mean you did something wrong. Oftentimes there is always a better way to handle something, but still, the gifts were both thoughtful and came from a good place. \n\nTheir gifts weren’t “assholish,” but their response to their son’s emotions kinda was, so I feel pretty neutral on the matter.",
          "id": 250,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Bro got 800 in gifts and he’s upset lolz",
          "id": 251,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "I’m wondering if there’s a major gen z/millennial split going on here, never seen such wildly varying responses",
          "id": 252,
          "comments": [
            {
              "score": 11,
              "content": "Gen Z and NTA. Yeah but I agree on this being such a Rorschach test. My theory is that it's the way people were raised... people who grew up with collaborative sibling dynamics = NTA, and competitive sibling dynamics = YTA. The son's reaction is just so wrong to me...",
              "id": 253,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I’m gen Z myself and the same age as OP’s son. I’d either go with NTA or NAH, tho I do think things could have been communicated better.",
              "id": 254,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 564,
      "content": "INFO: When he buys a house, will you give him $4k? If so, did you tell him that?",
      "id": 255,
      "comments": [
        {
          "score": 764,
          "content": "Depends on when he buys it. If he buys in the next couple of years it would probably be $4000. Of he buys, say, ten years from now, we'd need to give him more than that for it to have the same purchasing power, unless inflation magically starts going in the other direction.",
          "id": 256,
          "comments": [
            {
              "score": 589,
              "content": "Did you tell him that? If not, I recommend letting him know this, that your thought process is you’d do the same for him when/if he buys a house.",
              "id": 257,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 205,
              "content": "you could have avoided all this if you had just given your daughter the money as a separate, non-holiday/non-birthday item. you didn't even need to tell your son about it, it's not relevant to him - it sounds like he still lives with you at home for the time being.\n\nfor example, my mom provided a little bit of money for me for my first down payment. did she go and tell my siblings? no. there would be no reason to. it was a personal gift.\n\nbasically, you all sound like reasonably good people, even your son is being reasonable about his feelings, but the way you presented the gift ensured that he'd feel slighted and resentful.\n\nyour only option now is to take the heat or try to assure him you'll do the same for him in the future and try to spin it into a goal he looks forward to achieving, and be more tactful about your gifting in the future.\n\nyour son doesn't need to know about a gift like that if it doesn't concern him. when his time comes, you can gift him the same (or more, depending on market/inflation) and there likewise would be no reason to inform your daughter about it.",
              "id": 258,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "SO TELL HIM THIS! It’s that easy - you’re treating him like a baby when he clearly thinks coherently",
              "id": 259,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You sound like a great thoughtful Dad to me.",
              "id": 260,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah I think his feelings are a bit soft and childish and your reaction is a bit harder than needed. You might want to tell him it wasn't just a Christmas gift that it was a just bought a house gift and that he'll get a gift like that too one day.",
              "id": 261,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}