{
  "post content": "I feel like a giant asshole for not being more compassionate to those with mental illnesses. Hear me out:\n\nI'm in my 20's, and have been going through a rough time with my health (severe fibromyalgia/chronic fatigue/chronic pain and other issues), went through a massive breakup, estranged from my family (they don't believe that I have a chronic illness). My second cousins have been very generous to let me stay with them for a few weeks, to get back on my feet again. I am super grateful for that.\n\nThey are older (70's), their daughter is in her late 40's. She lives at home, now I know why: I discovered (I stay in the room next to her) after a week or so that she actually has a severe mental illness and talks to herself *constantly.* She spends the majority of her time locked in the bathroom, whispering and cackling to herself in multiple different creepy voices.\n\nShe regularly screams at her parents. I overheard them talking, she was angry about me being there. Her mom confessed the mental illness to me and said it flared up. I've been polite and staying out of her way as much as possible. She avoids me, glares at me, and seems to hate me.\n\nI feel like an asshole...I've disrupted the family, am getting a huge favor, AND I am not compassionate. Her mother (who owns the home) welcomes me with open arms. I have almost no money, having spent it all on my medical bills and having supported my ex-boyfriend's career (mistake) before getting dumped. My health is horrible, I'm applying for disability soon, and I have a hard time walking due to the pain and issues I have.\n\nI know the 'right' thing to do would be to leave, since my presence is clearly exacerbating the illness, therefore putting stress on the whole family. But I'm desperate. My parents won't help me until I can get approved for disability, I have no money.\n\nBeggars can't be choosers, but my schizophrenic cousin is creeping me the *hell* out. I feel like I'm in a psychiatric hospital. There's the fear that being schizophrenic, she may hear some voice convincing her to do something to me. I'm on edge. I avoid her and lock my door.\n\nShe disturbs enough that living out of my car or finding an old friend/another family member is starting to sound appealing. But I'm just struggling to do much right now with energy and pain. I just need a place to plan my next move. I can stay here but I feel like a jerk for biting the hand that feeds me.\n\n**So: (TL;DR:)** Am I the asshole for not being able to stand my cousin's mental illness / holding judgemental views, fearing schizophrenia? Being chronically ill myself, I feel I should be more compassionate. I feel like an a\\*\\*hole for disliking her so much. But it's the truth. I feel bad for her poor parents for having to deal with her terrifying unstable mental issues and secretly wish she were institutionalized for everyone's sake. I guess physical and mental illnesses just suck for everyone involved.\n\nEDIT:\n\nI forgot to add, she has her own multi-bedroom house that her parents bought her a few minutes away, she is there sometimes but I guess she chooses to live with her parents, perhaps because she needs to. I am not sure exactly what the situation is, just that she is there part of the time and here part of the time.",
  "id": 1,
  "comments": [
    {
      "score": 17,
      "content": "NAH for being uncomfortable if you’ve never been around someone with schizophrenia before. But I do think slight, slight YTA for saying you dislike her for having it and that you think she needs to be institutionalized. You’re only just recently getting the full picture. They’ve been dealing with this their whole lives. Schizophrenia is an incredibly complex and difficult disorder to live with. People with schizophrenia are not necessarily dangerous, at all.",
      "id": 2,
      "comments": [
        {
          "score": 3,
          "content": ">I know, I know, I do feel like an asshole. But this is the honest truth of how I feel. So I guess I am an asshole, and I guess I am judgemental. At least I'm honest (on Reddit)?",
          "id": 3,
          "comments": [
            {
              "score": 9,
              "content": "It’s understandable to be uncomfortable, schizophrenia has a lot of stigma and misinformation attached to it. I suggest you just learn a bit more about it so it’s not as unknown.",
              "id": 4,
              "comments": [
                {
                  "score": -3,
                  "content": "Yes, I should. But if I'm honest, I don't want to. I don't like her as a person. She screams and she hates me. I can pretend but I don't want to",
                  "id": 5,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Regardless, learning more could make things much easier on you. The majority of people with schizophrenia are not dangerous to be around. Learning more about your cousin’s symptoms and what you should expect could go a long way towards making you less fearful of the situation even if it doesn’t ever make you like her or enjoy spending time around her.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I think if you want your living situation to be better you should make the effort to understand schizophrenia. And in general.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "If you don’t want to learn about your cousin’s struggle, fine. But acting like an asshole and passing uneducated judgment toward Themis unacceptable.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 15,
      "content": "Leaning towards YTA - it’s bizarre how you don’t see the irony of how you are being (even if in silence) intolerant to her mental health diagnosis when you own family did the same to you about your diagnosis which BTW fibromyalgia and chronic pain are often linked to mental illness.  That’s her house, those are her parents, if you are uncomfortable - leave.",
      "id": 9,
      "comments": [
        {
          "score": 7,
          "content": "Piggybacking that the mentally ill aren't all that much more likely than anyone else being violent but we are much more likely to be the victims of violence. It's at least a good part due to stigma like this. You are minimising her value as a human being because she is sick you know exactly what that feels like. How can you do that to another person? Simply because her illness is much more obvious?",
          "id": 10,
          "comments": [
            {
              "score": 1,
              "content": "I know that my feelings are wrong, but it's how I feel. I am polite and kind and leave her alone, which is what she wants. Does not being able to stand someone asshole? Maybe. If she weren't schizophrenic but acting that way (yelling, screaming, saying she wants me to leave, glaring at me) I would also not be able to stand her. The voices and whispers are just an added piece of what I can't handle.",
              "id": 11,
              "comments": [
                {
                  "score": 1,
                  "content": "I respect this, but you’re blaming her like or dislike of you on her mental illness. This seems to be a personal issue, not one on her.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 0,
                      "content": "No blame is different than not wanting to be around someone. I do not blame her. That's your perception. I simply can't stand being around her because of the way she treats me and because of the voices. No blame and no rudeness whatsoever. I've kept it all here and I feel badly for her.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "Yes. I see what you're saying. You may be right. I haven't said a word about my feelings to anyone except here on Reddit. And no, my fibromyalgia is not linked to mental illness - it was caused directly by a medication I was prescribed for acne when I was younger. I guess it's just hard to be physically disabled, and to have nobody -- and then to finally have family welcome you in with open arms, and then be screamed at and feel very very uncomfortable. I could leave but right now that would mean me living out of my car for reasons explained.",
          "id": 14,
          "comments": [
            {
              "score": 12,
              "content": "actually there is an alternative.  You can be compassionate and remind yourself that she has as little control of her current state as you do.",
              "id": 15,
              "comments": [
                {
                  "score": 2,
                  "content": "I'm trying. I'm trying. I'm just being honest with how I feel to reddit. So maybe my feelings make me an asshole, not sure.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 2,
                      "content": "i’m sure it must be super difficult, you are battling your own struggles.  I know i’m useless when i get a headache so i can imagine how hard this must be for you while being in pain almost all the time.  Keep trying, it’s all you can do.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "There is no scientific evidence to prove your claims.",
              "id": 18,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "NAH\n\nJust try to hang on. You can't help it. She can't help it. Mom can't help it. We all just sometimes have to bite down and take one in the ass for the team.  \n\n\nWhen it's all over make an effort to mend fences with the daughter. It will mean a lot to the Mom.",
      "id": 19,
      "comments": [
        {
          "score": 2,
          "content": "Yeah, you're right, the a-hole part of me just really wants to never talk to her again. I felt pretty insulted that she was screaming at me. I guess you can't blame someone for having a mental illness but the truth is that I REALLY dislike her.",
          "id": 20,
          "comments": [
            {
              "score": 1,
              "content": "Do you dislike her or do you dislike her illness? Do you even know her? I mean I'm not trying to sound confrontational, but I think it would be pretty hard to separate her from the illness.",
              "id": 21,
              "comments": [
                {
                  "score": 2,
                  "content": "yes. good questions. i have no idea. i dislike the way she treats me and the way she makes me feel.  I liked her fine and ok before she started screaming about me and whispering in creepy voices.",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NAH. But not informed or practical. People with sever mental illness are rarely violent. That's a nasty stereotype perpetuated by movies/media and confirmation bias. People with mental illness are far more likely to be the victim of crime than a perpetrator.\n\nThat said, I do get why this living situation is terribly, terribly uncomfortable. But I do not think you have a practical alternative. You should look for an alternative (low-cost housing, living with a friend or relative). But from what you said here you are in poor health, and are contemplating living out of your car. That's almost guaranteed to make your health worse, and you could easily end up fully homeless because you do not have a reliable address at which to recieve services (mail, disability payments, correspondence about health care).",
      "id": 23,
      "comments": [
        {
          "score": 1,
          "content": "true. is it unfair of me to fear violence? When she talks to herself it sounds violent.",
          "id": 24,
          "comments": [
            {
              "score": 6,
              "content": ">it sounds violent.\n\nWhat does that mean? Having strong emotions isn't synonymous with violence. It sounds like you are stereotyping her as high risk because she makes you highly uncomfortable.",
              "id": 25,
              "comments": [
                {
                  "score": 1,
                  "content": "maybe so. I still feel somewhat threatened by the violent words and behavior.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Okay. And I think that's understandable, but it does not change your situation at all. You still have a chronic illness and no income at the moment. So unless you can move somewhere stable, moving out seems extremely unwise.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "YTA for your attitude and disinterest in learning more about this illness.\n\nYou seemed to have made up your mind that she is violent, and despite loads of people telling you to read up on the illness, you seem reluctant at best.\n\nYTA for choosing to go through life bigoted",
      "id": 28,
      "comments": [
        {
          "score": 0,
          "content": "I didn't say she WAS violent, merely that I felt that she behaved in violent manners.....screaming, slamming doors, yelling, etc. Violent demeanor",
          "id": 29,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": " though you're entilted to your feelings, your cousin is as well, you're intruding into her safe haven where she likly didnt feel judged and felt support from her parents, now having someone outside of her parents see her illness first hand is likly completely throwing her off. \nYou may not outwardly say anything but she may be also picking up on your disdain and bias. You seem validated in your reasons for disliking her, though you feel like asshole, but she also has valid reasons for disliking you, when you are in fact in her home judging her, where she should be allowed to feel sanctuary without a stigma, disdain, and feel like her every action is constantly judged. So mild yta for not seeming to understand her view point and making it all about you, ya youre going through a hard time, but Im sure you being there witnessing and judging her is also mentally exhausting for her.",
      "id": 30,
      "comments": [
        {
          "score": 1,
          "content": "True. I see your point. also (forgot to add) she has her own home nearby, but chooses to live with her parents.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "NAH I recommend learning more about schizophrenia because it is a very misunderstood and stigmatised disease.\n\nFeeling uneasy about her mental health diagnosis is one thing - slightly asshole-ish but can be remedied with education. \n\nFeeling uneasy because she is hostile to you and makes disturbing noises at night is another thing, which I think is reasonable. \n\nIs it possible to talk to her with her parents' support saying that, while you understand you may be intruding on her space, it is temporary and you need her to treat you with respect while you're here?\n\nThis is a tricky situation. I hope it all works out.",
      "id": 32,
      "comments": [
        {
          "score": 1,
          "content": "thank you. ive been taking the approach of just minimal contact. i think its what i have to do for my own mental sanity. how do you recommend i learn more? any good reading / sources?",
          "id": 33,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n  I feel like a giant asshole for not being more compassionate to those with mental illnesses. Hear me out:\n\nI'm in my 20's, and have been going through a rough time with my health (severe fibromyalgia/chronic fatigue/chronic pain and other issues), went through a massive breakup, estranged from my family (they don't believe that I have a chronic illness). My second cousins have been very generous to let me stay with them for a few weeks, to get back on my feet again. I am super grateful for that.\n\nThey are older (70's), their daughter is in her late 40's. She lives at home, now I know why: I discovered (I stay in the room next to her) after a week or so that she actually has a severe mental illness and talks to herself *constantly.* She spends the majority of her time locked in the bathroom, whispering and cackling to herself in multiple different creepy voices.\n\nShe regularly screams at her parents. I overheard them talking, she was angry about me being there. Her mom confessed the mental illness to me and said it flared up. I know she hates me. I've been polite and staying out of her way as much as possible. She avoids me, glares at me, and seems to hate me.\n\nI feel like an asshole...I've disrupted the family, AND I am not compassionate. Her mother (who owns the home) welcomes me with open arms. I have almost no money, having spent it all on my medical bills and having supported my ex-boyfriend's career (mistake) before getting dumped. My health is horrible, I'm applying for disability soon, and I have a hard time walking due to the pain and issues I have.\n\nI know the 'right' thing to do would be to leave, since I'm clearly disturbing her with my presence, therefore putting stress on the whole family. But I am desperate. My parents won't help me until I can get approved for disability, I have no money. \n\nBeggars can't be choosers, but my schizophrenic cousin is creeping me the *hell* out. I feel like I'm in a psychiatric hospital.There's the fear that being schizophrenic, she may hear some voice convincing her to do something to me. I'm on edge. I avoid her and lock my door. \n\nShe disturbs enough that living out of my car or finding an old friend/another family member is starting to sound appealing. But I'm just struggling to do much right now with energy and pain. I just need a place to plan my next move. I can stay here but I feel like a jerk for biting the hand that feeds me.\n\n**So: (TL;DR:)** Am I the asshole for not being able to stand my cousin's mental illness / holding judgemental views, fearing schizophrenia? Being chronically ill myself, I feel I should be more compassionate. I feel like an a\\*\\*hole for disliking her so much. But it's the truth. I feel bad for her poor parents for having to deal with her terrifying unstable mental issues and secretly wish she were institutionalized for everyone's sake. I guess physical and mental illnesses just suck for everyone involved.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 34,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 35,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "I think NAH as long as you aren’t overtly expressing your feelings to anyone. Just try your hardest to be respectful to both the cousin and her parents. I don’t blame you for feeling this way; severe mental illness is not easy to deal with, and she can’t help it but that really does not make it easier for others to deal with.",
      "id": 36,
      "comments": [
        {
          "score": 1,
          "content": "I haven't said a word. Keeping it all bottled in. I know she can't help it but that doesn't make me like or tolerate her.",
          "id": 37,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}