{
  "post content": "This first paragraph will probably make me sound like the a**hole, but please keep reading beyond that. \n\nMy fiance is 5 months pregnant. During this pregnancy, our sex life has virtually disappeared. She doesn't want to have sex, kiss, touch, or even so much as hug. Because my main form of emotional expression is through touch, this has left me feeling hurt and rejected. I've been pretty positive, but one day she used my laptop and saw recent porn usage. She has no problem with me watching porn, but she knows it's something I haven't really watched in years. This led to her asking me if our lack of sex has been hard on me. I admitted it has. She told me she just hasn't had a sex drive after becoming pregnant, and that she's sorry that she's been physically and emotionally distant. We talked things out, and the conversation went great.\n\nAt first, I was okay with everything. I would continue taking care of myself sexually and form a better connection with her outside of the bedroom. But not long after that conversation, I found a recently used dildo under our bed. I asked her that I thought her sex drive was gone. She admitted that she's still been masturbating regularly, almost every day. Naturally, this kinda hurt because I wondered how she could have drive to have sex with a toy, but not with me. I expressed this and she suggested that I get a toy as well.\n\nI bought a toy for myself. It was a standard fleshlight that I only used a couple times. Fast forward a month, and we were cleaning out our house. She grabbed a box which I had hid the toy in, and asked what was in it. Embarrassed, I said \"oh it's just a couple of books\". She started to open it and I stopped her and she asked again what was in it. I said \"It's a sex toy\". She immediately stormed out because she said I lied to her by telling her it was something else, which I guess is true. I just panicked because I didn't want her to see it. She left and went to her mom's house to stay the night there.\n\nShe was texting me saying that she can't trust me, and then that turned into her being mad about me having a fleshlight, even though she was the one who suggested I get a toy since we wouldn't be having much sex for awhile. I pointed this out and also the fact that she owned a dildo. Her counterargument was that her dildo was purple so that made it unrealistic, but the fact that the fleshlight was skin colored made it almost the same as cheating, and accused me of wanting to sleep with someone else, which is nowhere near remotely true.\n\nSo, people of reddit, AITA for this fight? Or is my fiance overblowing the situation?",
  "id": 1,
  "comments": [
    {
      "score": 5504,
      "content": "NTA. \n\n>Her counterargument was that her dildo was purple so that made it unrealistic, but the fact that the fleshlight was skin colored made it almost the same as cheating\n\nThis is probably the worst counterargument I have ever heard. You can just tell her that it is modeled after some nonexistant humanoid, like a succubus or something. Then it's no different from having Thanos' dick under her bed.\n\nEDIT: The hormones might be the reason for why she is being an asshole but that does not excuse her behavior.",
      "id": 2,
      "comments": [
        {
          "score": 806,
          "content": "Right? Like, it has no appendages,  no head, it doesn't even have a torso. It's basically just a jiggly sock.  How would that equate to him wanting to sleep with another person?\n\nDoes she see herself as a fleshlight with extra parts?\n\nEdit - my speech to text doesn't like my slightly stuffy sinuses.",
          "id": 3,
          "comments": [
            {
              "score": 211,
              "content": "I just imagined wearing fleshlights as socks",
              "id": 4,
              "comments": [
                {
                  "score": 57,
                  "content": "If you've ever seen the insert of a fleshlight out of it's shell in person then you'd know how horrible that is.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Have you seen fleshlight darts? It's hilarious",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 40,
                  "content": "[Relevant picture I saw on discord a few days ago](https://cdn.discordapp.com/attachments/618174374209519800/660189087709265932/exilfwgr23741.png)",
                  "id": 7,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 26,
                  "content": "I might be using this wrong but I feel like this is an r/nocontext moment",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Sticky....",
                  "id": 9,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "r/BrandNewSentence",
                  "id": 10,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "[why imagine it when there is this post?](https://www.reddit.com/r/funny/comments/5hk9h5/found_this_weird_sock_under_my_brothers_bed/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Enjoy\n\nhttps://reddit.com/r/TIHI/comments/eg4o8a/thanks_i_hate_squishy_socks/",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "Omg I can’t. Jiggly sock is too funny",
              "id": 13,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 358,
          "content": "Most likely it's not even hormones. Sometimes people lash out when they feel guilty.\n\nI think she likely feels guilty for not feeling like having sex with him, and has no idea to handle it, so is being massively unfair to OP. I hate when people do that, but it's extremely common. I do think, acting ashamed by it as OP did, made it seem like a bigger deal than it was, as well.\n\nShe's an asshole but they can likely fix it, if OP can talk to her about how she has no reason to be insecure and why she is lashing out in the first place.",
          "id": 14,
          "comments": [
            {
              "score": 328,
              "content": "This is just a wild guess here but...\n\nI wonder if her problem isn't lack of sex drive but fear of letting her husband see her naked pregnant body. Maybe she's afraid if he sees her like that, all the changes that have happened, that he won't be attracted to her anymore. If that's the case, they need to sit down and talk about it because the changes aren't going to stop. Her post-baby body is going to be way different too.",
              "id": 15,
              "comments": [
                {
                  "score": 143,
                  "content": "This is probably the case. Pregnancy plus pregnancy hormones are likely making her insecure and that’s why the 180 flip on the sex toy has happened. Completely not your fault OP but maybe throw in a couple more compliments than normal\nNTA",
                  "id": 16,
                  "comments": [
                    {
                      "score": 53,
                      "content": "Its going to take more than a couple more compliments. They need to communicate. She needs to get deal with him about it and admit what she's afraid of because he can't do anything about it until she does. He can't even have the chance to show her he still thinks shes sexy af to him.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Way to literally make excuses for his eifes shitty behavior and to assume your way to the best possible scenario to make ops wife the victim.\n\nHow about she just controls her emotions and she treats her husband better?\n\nIf these situations were flipped i bet you would give no lienency to the man and call him toxic as fuck and tell her to leave him",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "Sometimes you just don't want anyone to touch you. I hated it, but sometimes someone touching me when I was pregnant gave me the willies and I despised it. The drive can be still there, but you just don't want to deal with another human. Very likely nothing personal, and she loves you, but some feelings are difficult to explain.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Was same for me.  I wasn't so much anti sex as anti everything else.  I just wanted to get it done with as fast as possible and much preferred doing it by myself.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "It's her job to communicate this to him if this is her issue. She cannot be mad about what he doesn't know.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I agree.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Making the assumption that she knows what her issue is, is also wrong. I find myself in situations all the time where I have a general idea of how I feel, but I don’t know the who, what, when, where and why to it. \nPlus the amount of hormones that a woman produces while she’s pregnant literally double every day. It’s hard to know how to properly handle all of that hitting you at once. Not saying that it’s acceptable to act that way. But sometimes you gotta give a pregnant woman some space and time to realize that she was kind of being a bitch. We’re literally making a baby 24/7. It be like that sometimes plus trying to maintain a relationship, preparing for a baby to come to the world, accepting that your life and body will never be the same. It’s a lot to deal with.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "It could also be the thought of sex with a baby in side. It seems to bother some people, because they think the penis will poke the child or something.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 1,
                      "content": "It bothers sometimes and not. Why do our views swing so fast?",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "This is the one right here.\n\nThere's a lot of insecurity about a pregnancy body (I'm almost 9 months) and if she's still got a sex drive but feels embarrassed/ashamed of how she looks (seriously, your nipples turn into fuckin pepperoni, stretch marks make everything look weird...it is NOT pretty lol) her using a toy to satisfy her needs when she feels like she's denying her husband's likely makes her feel pretty guilty.\n\nAnd if he's watching porn with attractive women and using a fleshlight, it's not hard to imagine that to her it seems like he's basically simulating sex with other women rather than her just using a toy to get her rocks off. Add in hormones (an excuse I hate and typically won't bring up, but in this case they DO add to the irrational way she's seeing it) and you have a combination where she's probably as upset with her own issues as she is his way of handling his needs, and it's all jumbled up into a negativity that requires an outlet.\n\nOP is NTA, I'd even say NAH except that she is the A a LITTLE bit, even though I don't think she can really help how she's feeling at the moment.\n\nOP's best course of action is to let her cool down and when they talk, explain to her that he loves her and just wants to know how to meet her needs, and that it's okay if she's confused about those needs too.... This is a new experience for both of them! Remind her that this is just a stepping stone to their family growing and she's still the only woman he wants to spend the rest of his life with. Just.....soothe. Let her know he understands if her feelings are out of whack, and they'll get through it together.\n\nAnd for the love of God, OP, even if she looks like a sack of potatoes with straw hair and pepperoni nipples, TELL HER YOU THINK SHE'S BEAUTIFUL. LIE IF YOU HAVE TO. NOW IS NOT THE TIME FOR BRUTAL HONESTY. XD\n\nI think they'll be fine.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 12,
                      "content": "No, she's a lot the asshole. She flat out lied to her partner about not having a sex drive, then suggested he get a toy, then got mad at him for getting a toy like she suggested.\n\nI get that being pregnant can make someone insecure and hormones can make them unstable emotionally, but that doesn't mean that she isn't accountable for her behavior. \n\n**She** should have talked to her husband about being insecure about her body, but **she** decided to lie about it.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Dude you might think you’re not attractive when pregnant, but I really doubt your partner does. All of those changes are literally the culmination of sex with your partner, it is by definition sexy to him, or should be. There is nothing more attractive than being with someone who loves you enough to bear your child. The whole process is a miracle of nature that you get to share together. What can possibly be more beautiful?\n\nAnd no this isn’t lying, this is how I’ve felt since my partner got pregnant and had our child.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Her weird \"it's basically cheating\" makes me wonder if she's become more sexually attracted to another guy/stopped being attracted to OP. Accusations of cheating often come from projection. It just seems super weird to me that she'd be sp standoffish of OP even after he expresses how it affects him.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "Yeah she's definitely trying to guilt him with whatever this weird counterargument is. It was okay if she lied about her sex drive and used a sex toy but as soon as he decides he wants one and hides it then she considers it the same as cheating.",
          "id": 30,
          "comments": [
            {
              "score": 52,
              "content": "Sounds to me like she doesn't want him having any kind of sex at all.\n\nOr she's feeling guilty for not wanting to have sex and is hiding it behind anger.\n\nHormones or not, its incredibly unfair to deprive your spouse/SO of intimacy, lie about having a sex drive while you're getting yourself off daily, then get mad when he does pretty much the same thing you are. If she's not careful, she's going to drive her husband away completely.",
              "id": 31,
              "comments": [
                {
                  "score": 8,
                  "content": "This! 👏🏻\nIt’s incredibly unfair to refuse intimacy with your person but get yourself off regularly. \n\nI think she’s lucky you’re still around.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 11,
                      "content": "“Unfair” or not, no one has to force themselves to have sex with their partner if they’re not up for it. Libidos change. And their partner can choose to leave them if they’re not okay with a sexless relationship. Masturbation and sex are so vastly different, trying to compare the two like this is bullshit.",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -11,
                  "content": "The talk of \"fairness\" is scary to me, because it seems to suggest that physical intimacy is simple and necessarily transactional... IMO in a good relationship, physical intimacy is never transactional. \"Horniness\" is not a single homogeneous state, and his wife doesn't owe him sex regardless of what state she's in.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 16,
                      "content": "There's always one of you.\n\nNo one is saying she owes him sex. She does owe him kindness and understanding. And yes, fairness. She can't LIE about not having a sex drive only to be caught having sex with herself, have her partner be extraordinarily understanding about it then flip her shit when he *does what she suggested* and gets a sex toy.",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "I mean, I don't think anyone's saying fair in 'she should have sex with him' but I think it would be fair that if she's using a sex toy and getting off to it that he can do the same. Her argument that it's because his toy is flesh colored is just weird af because it IS super unfair of her to claim that using a sex toy is cheating when she's doing the same thing, but hers is purple.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Also, it is extremely hard to find a fleshlight that is not skin coloured. Dildos come in all kinds of bedazzled crazy colours, but if you look for fleshlights, they are seriously modeled after porn stars most of the time. \n\nTbh, I think men should be able to get sparkly fleshlights. I'm for sparkle equality.",
          "id": 37,
          "comments": [
            {
              "score": 7,
              "content": "You can [hand jive](https://www.pureromance.com/PWS/homeoffice/store/OCUS/catalog/sex-toys-couples/Hand%20Jive#thin)",
              "id": 38,
              "comments": [
                {
                  "score": 10,
                  "content": "Oh my gosh, I just down voted you for thinking this was a response to another comment I made.\n\nI was honestly impressed at the creative way you told me to go f*ck myself, but still a bit offended.\n\nThen I actually looked at all this.\n\nYou made me laugh at 3:04 am (an actual laugh, not a snort) and you accidentally supplied me with a new insult.\n\nAlso I really like the design of this sex toy.\n\nJust... thank you for this comment. Thank you.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Colour is nice, double sided fun too",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Sparkle is always good",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Okay that \"Thanos' dick\" remark too me the fuck out lmfao.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I think this entire ordeal needs to be contextualized with the fact that this woman is very pregnant and therefore very hormonal. \n\nChances are, when she is not growing another human inside her / spiked with hormones, she’ll not care about your toy.\n\nEdit for those who won’t read down the comments: \n\nI’m not really defending her so much as just looking at it from the biological perspective. I understand why she overreacted and even why now, since it’s probably a cocktail of hormones and insecurities. That sucks, but it doesn’t make her either innocent or target practice for the people on here who want to point-blank vilify her.",
          "id": 43,
          "comments": [
            {
              "score": 353,
              "content": "I have no doubt that she is hormonal. She is also feeling insecure because of the changes her body is going through. However that is the reason that she is being an asshole, not an excuse for it.",
              "id": 44,
              "comments": [
                {
                  "score": -85,
                  "content": "No it’s not; pregnancy doesn’t excuse her from overreacting but it does provide context as to why she overreacted, which serves as justification not to point-blank vilify her.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 50,
                      "content": "I suppose but she has boiled her argument down to a point of such an obvious fallacy that he has no choice to just take the unjustified punishment for a crime he didn't commit. I understand as a man that you'll have to bear some more scrutiny from you pregnant wife due to her bodies changes, but is it to the extent that he should be expected to always roll over when she is clearly wrong? I'm not being facetious; I'm young and trying to understand if this is true/coming to terms with the fact that I may not be cut out for child-rearing.",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "I may give that some thought if it wasn’t for the fact that this wasn’t some knee jerk reaction since she’s still giving OP a hard time about it",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 12,
                      "content": "Unless neither party is an asshole, someone is going to get vilified. That's the nature of this sub. If you feel I was being too harsh in my reasoning for why she is an asshole then maybe you are right, but I don't think I was.",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "You would then be agreeing that it makes her an asshole.  Not making her an asshole would be an excuse.  Context doesn't make her not an asshole.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 161,
              "content": "You can be hormonal and still be the asshole.",
              "id": 50,
              "comments": [
                {
                  "score": 25,
                  "content": "I’m so sick of hormones being used as why it’s ok for someone to be an asshole!",
                  "id": 51,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 90,
              "content": "I’ve been pregnant and hormonal and while I can understand how maybe she left unreasonably insecure because of the sex toy, she’s taking it wayyyy too far. She’s sleeping at her mothers because of it? That’s over the top.",
              "id": 52,
              "comments": [
                {
                  "score": 7,
                  "content": "To be fair, OP didn't immediately disclose that he named the sex toy \"Lucille\" and has rented it an apartment.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Well I thought this was funny",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "Another pregnant apologist",
              "id": 55,
              "comments": [
                {
                  "score": 74,
                  "content": "it shows a stunning lack of respect for a woman's agency as an adult human when people simply brush off truly horrible behavior as \"hormones\".",
                  "id": 56,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Its because alot of woman like to use this as excuse because it benefits them.\n\nIts also more disrespectful to the victim of emotional abuse than other hypothetical woman (OP is the victim in this case).",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "he didnt brush it off, he said he's trying to contextualize. can you ignore that pregnancy is widely known to change womens behavior?",
                      "id": 58,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 39,
              "content": "I don't think she'll change. She wants NO sex at all but is masturbating daily. Good luck.",
              "id": 59,
              "comments": [
                {
                  "score": 44,
                  "content": "There are many asexual people who masturbate. Simply having an orgasm is wholey different than having sexual intercourse with another person.",
                  "id": 60,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Then get a partner who is also asexual... What does rhis commsnt have to do with anything? \n\nOP and his wife arent asexual",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "aka, 'i dont \"feel\" sexy but am horny so i'll jill off but my husband cant touch me', i see no problems coming from that.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 32,
                      "content": "There's a difference between the physical need for an orgasm, and the desire to make love to someone.\n\nWhen I was pregnant, there were months when the thought of being touched sexually, disgusted me. Made my skin crawl.  (And there were a few months when I was horny and just wanted to jump my bf as soon as he walked in the door. So there's still hope for OP :-) )",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "Fuck that, she's still responsible for her actions, and her actions are shitty.",
              "id": 64,
              "comments": [
                {
                  "score": 2,
                  "content": "agreed",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Yes lets excuse her shitty behavior and her point blank lying to him. \n\nIf the biological perspective doesnt work for a mN it doesnt work for a woman",
              "id": 66,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "hormones don't excuse her shitty behaviour, only explain it. he is still owed a massive apology.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -20,
              "content": "Yes, pregnant women are like children. Also women on periods. That's why I think fertile women should not have any say in our society, who knows when they are hormonal?? Yay!!\n\n\nShe can be as preggo as she wants, doesn't excuse her behaviour.",
              "id": 68,
              "comments": [
                {
                  "score": 11,
                  "content": "It may intensify your emotions but it doesn't make you behave like an asshole. A pregnant woman who behaved like an asshole was an asshole before pregnancy.",
                  "id": 69,
                  "comments": [
                    {
                      "score": -1,
                      "content": "I responded to someone who knows nothing with the same amount of thinking. Was it not clear?",
                      "id": 70,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Your edit is largely incorrect. They may not excuse her behavior, but they absolutely impact how OP should approach resolving this even if he isn’t the asshole.",
          "id": 71,
          "comments": [
            {
              "score": 29,
              "content": "It would be largely incorrect if this were an advice sub. Absolutely it should affect how OP resolves the issue, but I'm not here to advise him on what to do. In terms of determining who is being an asshole, the hormones do not matter.",
              "id": 72,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "There is being an asshole and there is borderline insane.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": ">Then it's no different from having Thanos' dick under her bed.\n\nI'm so glad you went there, because I thought my brain was fucked for going there.",
          "id": 74,
          "comments": [
            {
              "score": 1,
              "content": "Don't be so relieved, chances are both of our brains are fucked.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I would understand a bit more if the fleshlight was modelled after his favorite pornstar or something like that, because I wouldn't be chill with that either, but I do agree that her reaction wasn't rational. You can't tell your partner to do something and then get angry about them doing it. \n\nI feel as if the pregnancy hormones are to blame and that she will calm down and realize how irrational she is being. Not excusing her behavior, btw. Just explaining that hormonal changes can make a person crazy and irrational.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1483,
      "content": "NTA dude. Sounds like your Fiancé has some contradicting ideas on what’s allowed and who’s allowed it",
      "id": 77,
      "comments": [
        {
          "score": 388,
          "content": "Yeah it was fine when she had a secret sex toy because it was purple but when he has a secret sex toy it's almost cheating because it just happens to be fleshed colored? Even if we take hormones into account that's still pretty insane.",
          "id": 78,
          "comments": [
            {
              "score": 325,
              "content": "People blaming her directly lying to her husband about having no libido while she's been masturbating daily + acting like a fleshlight SHE suggested means he wants to sleep around are being really insulting towards pregnant women who aren't giant assholes. Reddit has this thing where everyone thinks pregnant women are almost completely excused for being emotionally accountable. And here we are, in a situation where she's outright lying to her husband, and somehow even that gets blamed on the pregnancy.",
              "id": 79,
              "comments": [
                {
                  "score": 109,
                  "content": "I agree. Being pregnant doesn't excuse your actions just because your pregnant. Sure you might be a little more weepy than usual or have cravings but that doesn't mean your allowed to accuse your partner of cheating on you with a sex toy.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "I think society in general has that idea but you're right",
                  "id": 81,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Oh so true, quick victimising of anything that isn’t Male",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Am pregnant...think other preggo lady is waaay over the top and being a massive AH... insecurities or hormones, whatever is going on, she needs to freaking talk to her partner, not just throw a massive bitch fit over something she suggested.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Honestly, lots of people use any excuse to act entirely without inhibition or decency. Like if they’re sick. Like stress. Or being tired. Or angry. Or being drunk. Pregnancy is just a great excuse to use not only because there are many legitimately difficult pregnancies and you are legitimately, our culture treats having children as sacrosanct. If you’re pregnant you’re basically holy. \n\nHard not to get a big head that way and think that just because you have a hormone induced urge, just let it out because everyone will excuse it. As far as excuses to be shitty goes, it doesn’t get much better than pregnancy. And people feel entitled to be shitty for a lot less than that.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I think a lot of people aren't sure how much pregnancy can excuse since it is fairly routine to know pregnant people who act completely intolerable, and insist you need to tolerate it since its normal for pregnancy. And so if they are the type of people who accommodate anything at all, they figure its best not to press it too hard because they don't have an easy frame of reference for how true it is.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I totally agree with you!! I've noticed Reddit treats pregnant women as if they were perfect in every way and could do no wrong. \n\nFurther, it totally irritates me how Reddit acts as though pregnant women literally cannot do anything' can't watch a neighbor's kid because they're two months pregnant, cant pick up their clothes because they are six months pregnant, etc. \n\nI'm sure there are cases were women truly are unnable to do these things because of complications with pregnancy, but holy shit this should by no means be the majority. For hundreds of years pregnant women would work in fields, do intense housework, or watch over their entire family. I'm tired of pregnant women being portrayed as super fragile beings who literally cannot do anything.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Honestly, lots of people use any excuse to act entirely without inhibition or decency. Like if they’re sick. Pregnancy is just a great excuse to use not only because there are many legitimately difficult pregnancies and you are legitimately, our culture treats having children as sacrosanct. If you’re pregnant you’re basically holy. Hard not to get a big head that way and think that just because you have a hormone induced urge, just let it out. Because everyone will excuse it.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "The reddit rules for when you can't be wrong or can do whatever the fuck you want:\n\nYour wedding.\n\nYour birthday.\n\nWhen you're pregnant.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "We may be hearing about her in the future on r/insaneparents",
              "id": 89,
              "comments": [
                {
                  "score": 1,
                  "content": "!RemindMe 18 years",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "And even if she told him to get it so it wasn’t even a secret at any point. Logic.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Its true though. Culturally, dildos aren't seen as the same as fleshlights at all. If a girl has one, it is seen as routine or empowered. But having a fleshlight is seen as more embarrassing. Ten years ago owning a fleshlight was seen as making you instantly fall into neckbeard territory. In this case, it sounds like a combination of her having wildly different standards she didn't think too hard about as well as some hormonal or mental issues.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 829,
      "content": "Nta at all. She was the one who suggested you get a sex toy, and do they even sell unrealistic flashlights? I don't think I've ever seen a purple one. And you were embarrassed, so you lied, but you immediately told her the truth. I don't really understand what she's so mad for",
      "id": 93,
      "comments": [
        {
          "score": 238,
          "content": "They sell alien fleshlights, for alien fetishists.",
          "id": 94,
          "comments": [
            {
              "score": 150,
              "content": "Thats...  educational lol",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "TIL",
              "id": 96,
              "comments": [
                {
                  "score": 23,
                  "content": "Look up ovipositor .. or don't",
                  "id": 97,
                  "comments": [
                    {
                      "score": 21,
                      "content": "ive been in the darkest corners of wattpad enough to know not to look this up",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I can separate those parts and figure out that it is, and I don't think I really want to see what it looks like.",
                      "id": 99,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I think Bad Dragon also has dragon ones.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "They sell all kinds of Fleshlights. I only have one and it's clear. It's like having sex with a robot. It's pretty weird and not in a good way.",
          "id": 101,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 40,
          "content": "Let me introduce you to [Bad Dragon](https://bad-dragon.com/). You got dragon, dog, horse, rabbit...\n\nEdit: The \"models\" pass [The Harkness Test](https://1d4chan.org/wiki/Harkness_Test), so it's okay.",
          "id": 102,
          "comments": [
            {
              "score": 15,
              "content": "I just knew this had to do with Captain Jack Harkness and I wasn’t disappointed.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "They only call them \"dog\" and \"horse\" because they can't legally call them \"worgen\" and \"draenei\".",
              "id": 104,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Now I don't have a penis, but I can't imagine any world where I would want to get off by fucking a dragon, dog, horse, or rabbit shaped Fleshlight.",
              "id": 105,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "No thank you lol",
              "id": 106,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Literally said “what the fuck” out loud after opening that link",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "There are plainer \"masturbation sleeves\", but I still don't see why she's mad.",
          "id": 108,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "bad dragon sells unrealistic fleshlights",
          "id": 109,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "They do sell unrealistic ones. I got a free one that is clear instead of flesh colored, and its not really shaped like anything. Its just a hole. If you didn't know fleshlights were a thing there's a chance you might not even know what it is.",
          "id": 110,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "They do, but they tend to be in the more luxury lines because they are \"exotic\" while 99% of female sex toys are purple or bright pink.",
          "id": 111,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I have a glow in the dark green mouth.",
          "id": 112,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Bad dragon exists",
          "id": 113,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 719,
      "content": "NTA she set you up to fail, you're going to get a bunch of comments talking about how her emotions are all over the place due to her being pregnant and that you just have to suck it up, however you know your own wife so you can judge whether her attitude would be different if she weren't. It is worrying though, and a big double standard as far as I'm concerned.\n\nEdit Thanks for the silver kind stranger, my first, I've popped my cherry",
      "id": 114,
      "comments": [
        {
          "score": 106,
          "content": "There is a reasonable level of leeway to give a pregnant woman but this crosses the line. If this is entirely hormone-driven she needs some help for sure.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "I don’t think that the fact she’s pregnant means OP has to suck it up (*at all*), but more the fact that she is pregnant should shape his approach to this conflict with his wife. She may be hormonal, but I doubt that’s the whole story— is she insecure about her pregnant body? Is she worried that *his* sexual attraction to *her* will diminish if they have sex together while her body looks different than it used to? Is she feeling emotionally distant from her husband for some reason? If she wasn’t pregnant, and I was OP, the conversation would go more in the “are you a psycho?” direction (bad), but since she is, there’s probably *a lot* more going on here than just her having crazy double standards that are constantly shifting. So it should be a much more considerate/empathetic conversation from OP’s end. His wife is still the asshole (NTA), and OP shouldn’t just let it go, but OP should try to approach it in an understanding way.",
          "id": 116,
          "comments": [
            {
              "score": 2,
              "content": ">is she insecure about her pregnant body\n\nYes this is very obviously the case. This entire post is stupid, OP needs to be resolving his marital problems, not just coming here for validation. These posts don't belong in this sub IMO",
              "id": 117,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 431,
      "content": "NTA. Her behaviour is crazy, tbh. She’s gaslighting you.\n\nEdit: to be clear, you didn’t lie. Yeah ok you lied for a second out of embarrassment but then immediately confessed. That’s not a lie.",
      "id": 118,
      "comments": [
        {
          "score": 68,
          "content": "Let’s be fair both ways. He didn’t immediately confess out of honesty. She pressed for it and tried to open the box.",
          "id": 119,
          "comments": [
            {
              "score": 72,
              "content": "Let’s be honest, she didn’t trust him enough not to push it and try to open the box.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "So? This all happened in what the space of less than a minute? Calling that a lie and breach of trust isn’t reasonable.",
              "id": 121,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "[deleted]",
          "id": 122,
          "comments": [
            {
              "score": 22,
              "content": "This would make a lot of sense, and it would also explain why she's suddenly so upset about OP's sex toy.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I’m also betting something else is going on, and I’m not saying OP should be an asshole back to her. She’s his wife, and she’s pregnant, and I’m guessing this is out of character, he should act with love. Doesn’t change what I wrote tho IMO.",
              "id": 124,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "Sometimes it’s just easier to enjoy yourself and relieve some tension without having to consider someone else and their needs. You can still want to get off while not feeling up to engaging in sexual activity with another person.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -20,
          "content": "I definitely agree this behavior is a little crazy - but keep in mind that she’s likely very hormonal from the pregnancy. That doesn’t excuse asshole behavior, but context is important. Lots of pregnant women have body issues and self-esteem issues, and it seems like a quick reaction to feeling unloveable. If this is regular behavior then I find it very alarming, but if it was a one-and-done reaction due to hormones and stress then I don’t think we should jump to this kind of a reaction.",
          "id": 126,
          "comments": [
            {
              "score": 52,
              "content": "I mean, the cause of the behavior is sort of irrelevant to whether or not the behavior makes her an asshole, which is why we are all here.",
              "id": 127,
              "comments": [
                {
                  "score": 5,
                  "content": "I explicitly said pregnancy and hormones don’t excuse her behavior. My point was just that saying she’s crazy and “gaslighting” him might be a bit far if this is a one-time situation, and that it’s important to take that into account (not for the judgment, but for her being “crazy”).",
                  "id": 128,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Her directly lying to him about having no libido while lady-jerking it every day has nothing to do with hormones and everything to do with lying.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "I once sat and sobbed for an hour, nine months pregnant, because I could not iron a straight crease in my husband's boxer shorts.  Who irons boxer shorts? Hormonally irrational pregnant women.  \n\nYou don't excuse the behavior,  you just include the hormones in as a factor.",
              "id": 130,
              "comments": [
                {
                  "score": 7,
                  "content": "That’s exactly my point - no reason to excuse her being an asshole, but keep it in mind before absolutely tearing her apart.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I wouldn’t say I’m tearing her apart. I’m not saying she’s an evil person or he should leave her. No matter what the reason or what he should do about it, she *is* acting crazy and she *is* gaslighting him and she *is* the asshole in this situation. Her hormones don’t change any of that. Her hormones/greater context should of course impact how he deals with this — but I’m not speaking to that one way or another. This isn’t a relationship advice sub.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "What? So some guy who's had a crazy stressful week then comes home and hits his wife should be looked kindly upon because he's stressed? It's a \"one-and-done\"? If you let external influences be included most people would never be considered assholes then.",
              "id": 133,
              "comments": [
                {
                  "score": 3,
                  "content": "No, that’s not what I said. I explicitly said that this doesn’t excuse her being an asshole. And she didn’t hit him, those comparisons are not the same. Reread my comment.",
                  "id": 134,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 164,
      "content": "NTA - If she has had no such behavior before, maybe hormones are afoot. Either way, you're not an ass.",
      "id": 135,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 143,
      "content": "Assuming your side of the story is the absolute truth, your fiancé is tripping man. If she thinks a fleshlight is cheating because it’s flesh colored but it wouldn’t be cheating if it were another color thats kinda crazy... especially if she doesn’t care about porn which isn’t cheating at all but its WAYYYY closer to it than a plastic toy. \n\n\nThat really sucks man, you’re not an asshole for being embarrassed about a toy (I’m too embarrassed to even buy one lol) and a normal person would’ve lovingly chuckled at your embarrassment and made sure you didn’t feel that way since you know... it was their idea...",
      "id": 136,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 125,
      "content": "NTA... a toy is a toy at the end of the day so this is a massive double standard. \n\nNot sure what it is about her sex drive and not having sex with you but with implements but something doesn't seem quite right and I think you need to get to the bottom of that.",
      "id": 137,
      "comments": [
        {
          "score": 70,
          "content": "Obviously not OP's wife so i can't speak for her, but when i was pregnant i went through a phase of being incredibly touch-phobic, even a hand on my arm made me feel really gross. My poor husband didnt get a hug for about six weeks. So maybe something like that is at play here?",
          "id": 138,
          "comments": [
            {
              "score": 52,
              "content": "I would guess it’s a body image thing. Being pregnant really messes with your ability to feel sexy, especially when you’re navigating your big belly around with another person. It kills the mood fast. I bet it’s not a lack of sex drive, but a lack of being able to stay in the mood with her current physical/emotional state. I totally understand that. \n\nI bet his toy is just playing into the body insecurity she is already feeling. It’s not fair, or reasonable for her to react that way, but when society places so much value on a woman’s appearance and sex appeal, it’s a mind f*** when suddenly your body changes so quickly into the opposite of “sexy”.",
              "id": 139,
              "comments": [
                {
                  "score": 22,
                  "content": "Weirdly, i felt the best I've ever felt about my body as an adult during pregnancy. There was something about it that made me feel really gorgeous and sexy. Granted, i only had sex three times during the pregnancy (morning sickness all 9 months and excruciating pelvic pain, plus not wanting to be touched) but i felt like i looked brilliant.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 12,
                      "content": "You’re lucky! I have skipped the morning sickness bit (woohoo!) but feel like crying every time I look in the mirror. I realize it’s not logical, but it’s still so hard and depressing.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Morning sickness all mine months? 😭",
                      "id": 142,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Also it’s like, really hard to get into having sex if you have a baby rolling around inside you. I can see limbs pushing out from my sides, which makes it really hard for me to get in the mood.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "When I was pregnant, I could not stand the smell of my husband. Part of it was his body wash, part was just, I guess his natural smell? He doesn’t stink. It was never a problem before pregnancy and hasn’t been a problem since. I couldn’t sleep in the same bed as him. Not only that, but sex was just... unpleasant... Pregnancy changes so much stuff. At least it’s temporary. It ducks for OP, so hopefully things work themselves out after the baby.\n\nIn that vein, I had a SIL who went absolutely batshit nuts during her pregnancy. She was irrational as all get out. The more her husband tried to tell her she was being irrational, the worse it got.\n\nI have PMDD and can attest that hormones can seriously fuck up your rationale.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "I can definitely relate to her (edit: about the sex toy vs. sex specifically).  Morning sickness, increased mucus production, increased sensitivity due to increased blood flow, increased sweating, increased vaginal discharge, possible minor incontinence with increased pressure on the bladder and increased muscle flexibility, not to mention that the increased muscle flexibility itself can make sex a bit more painful if you're not careful about your position because you can more easily get into a painful position that normally you wouldn't, rapidly changing body, physical exhaustion, leaking boobs, are all things that can happen in the course of a normal pregnancy that can affect having sex with another person but aren't really impacted by a sex toy (your sex toy won't think you're gross, and even if you aren't actually gross to your partner all of this can make you *feel* gross and like you don't want to be touched).  And of course masturbation will both satisfy urges and relax you, and since you are in total control of it, you don't need to constantly instruct someone how to adjust to your increased sensitivity.  \n\nThere's nothing mysterious to get to the bottom of here, but OP can probably talk to her doctor if he wants to confirm this is actually pretty normal and isn't about how she feels about him specifically.  If you go on pregnancy boards, a good handful of women admit they feel this way and feel bad about it.  I understand why OP is hurt by this and sympathize. \n\nOP is NTA, hormonal or not she is super overreacting to the fleshlight.",
          "id": 145,
          "comments": [
            {
              "score": 12,
              "content": "Wow that's a big insight in to pregnancy and masturbation/sex. Thanks for sharing, people dont really talk about this and is probably why we're all wondering what's going on...\n\nAgreed, talking between the two of them will go a long way in understanding each other",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This is a very good comment. Thanks for writing all that out.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 81,
      "content": "NTA, is she all there mentally? Like be honest was she this gone before the pregnancy? Not only does she get one when you dont, AFTER SHE TOLD YOU TO GET ONE I MIGHT ADD, but also has no drive? No dude you got needs to you do what you gotta if she wont and it doesnt cross cheating lines. she is 100% in the wrong here",
      "id": 148,
      "comments": [
        {
          "score": 84,
          "content": "She's not all the way there. She has a history of severe depression, and some childhood trauma. Our relationship has always been filled with double standards and it's only gotten worse.",
          "id": 149,
          "comments": [
            {
              "score": 94,
              "content": "I will speak on the double standard regarding masturbating but not wanting sex as a currently pregnant woman- since becoming pregnant it's been weird to have sex and I find myself really not into physical contact with my husband. It can be small things like the heightened sense of smell or just generally not wanting to be looked at or touched. But the drive hits me sometimes and I need to have a quick orgasm. I've heard this will change after my hormones level out.\n\nThat being said, she's being totally irrational getting upset about your sex toy. That's not okay.",
              "id": 150,
              "comments": [
                {
                  "score": 9,
                  "content": "This! As a fellow pregnant woman I have to say sometimes I just want to satisfy the urge.  Plus it’s an amazing form of stress relief and pain management.  There’s such a difference in someone touching you or like you said smelling someone and just taking care of it yourself... (my husband’s breath is the worst even if he brushes his teeth right before he kisses me!)  \n\nAlso when you’re having trouble rolling over sex is a lot of work!  I pooped at like 3 months and the physical trouble/discomfort started then too!  \n\nI will say maybe she over reacted but why did OP lie if she told him to get it.  I feel like more of the problem is he lied about it and that triggered her hormones and insecurity.  If my husband lied about it I would wonder why he felt he had to lie to begin with.  \n\nBtw I am bipolar and I have to say the hormones make my emotions extra crazy.  I literally can not control my mouth sometimes.",
                  "id": 151,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I'm one of the rare cases where my mood has been great, only cried a couple of times the entire pregnancy and earlier when I wrote this I was like \"wow how irrational!\"  But I literally just snapped at my husband for leaving to play video games while we were watching a show about child birth. Then when he came back I just started crying. Hormones are weird\n\nI think you're probably right that it was about the lying and not the actual toy",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "yeah unless she gets real help now you're gonna have a horrid life and so is your baby",
              "id": 153,
              "comments": [
                {
                  "score": 36,
                  "content": "She sees a therapist and is being treated for depression. I'm hoping that if I don't give up, things will get better",
                  "id": 154,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Maybe try some sessions of couples therapy? Though it couldn't be her current therapist facilitating it",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "She needs to discuss this with her therapist.  She's still interested in sex-just not with you.  That's weird.  I get her feeling uncomfortable and not interested in sex, but she uses her toy daily?  But you can't?  Big issue.",
                      "id": 156,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I'm seriously trying to figure out why you thought having a baby with this person was a good idea, let alone marrying her. \"Oops\" isn't really going to cut it in 2020 unless you're in the 1% where BC fails. And she has another kid? Relationship \"filled\" with double standards? I guarantee you it's going to get 1000x worse when the kid is born.",
              "id": 157,
              "comments": [
                {
                  "score": 4,
                  "content": "It will. thought Op was someone I know in the same situation Lol but they had the kid and its gotten worse. She refuses to get couples therapy because she doesn't believe in it. And the double standards got even worse .his parents can't even have the baby sleep over their house but her parents could have their baby sleep over her parents house.  He cant get a new job but she can quit any job she gets. it's just a lot of double standard I can see also happening to op .",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Her trauma doesn’t give her permission to treat you like this and issue the double standards.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Depression doesn't necessarily take away one's ability to reason. It can certainly make one assume the worst and catastrophize, which may be why she's reacting like this.\n\nThat said, the emotional distance suggests to me that maybe . . . she's looking for a reason to get out of the relationship? And this is an excuse, albeit a flimsy one.",
              "id": 160,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "yall need therapy.  ESPECIALLY since a child is coming. It may throw her into a severe Post partum depression.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 41,
      "content": "NTA i agree you should have said what it was to begin with. But wow what a hypocrite. What a horrible feeling that must have been for you when finding that sex toy after your wife lied about not having a sex drive. But she doesn't care about her lie apparently.",
      "id": 162,
      "comments": [
        {
          "score": 15,
          "content": "This all seems really unfair to OP. She's getting a pass for being hormonal but that's not an excuse to take it out on him.",
          "id": 163,
          "comments": [
            {
              "score": 2,
              "content": "Ive been pregnant. I don't think anyone should get a pass for being hormonal. If you're being an asshole it is what it is. She should apologize",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}