{
  "post content": "I grew up in a single-parent household with my mother and my half sister \"Kacey\" who is 7 years younger than me. My mother struggled with drug abuse for the majority of her life, and as a result I have no clue who my father is. Kacey's father was also heavily into drugs and only stuck around for 3 years. I basically raised Kacey because when my mom wasn't at work, she was either gone for days on end or holed up in her bedroom/the bathroom doing drugs with whoever her boyfriend was at the time.\n\nI am now 31 and have no desire to have children after spending much of my youth caring for Kacey. Kacey unfortunately followed in my mother's footsteps in that she began excessively drinking, smoking, partying, etc. She enrolled in a university that's known for being a party school but dropped out during her first year after getting pregnant with my niece. 14 weeks into Kacey's pregnancy we learned that the baby would likely be born with intellectual and physical disabilities. I am pro-choice and discussed abortion as an option with Kacey, who at the time refused and assured me that she would love her baby no matter what disabilities she was born with.\n\nMy niece is now 4 years old and is nonverbal with pretty severe cognitive delays and motor/sensory issues. My mother has been sober for about 5 years and has since come around to help out Kacey with my niece. She feels bad about our poor upbringing and as a result enables Kacey to continue partying and being an irresponsible parent. Kacey is hardly ever around while my mother is left alone with my niece. She's pretty much become my niece's 24/7 caretaker. Both my mom and sister have asked that I help babysit from time to time, but I’ve politely declined because I know nothing about caring for special needs children. I also work a lot so I don't see how they think I would be able to do this. \n\nRecently I learned that my mother is planning to move a few states away as her boyfriend would like to be closer to his family. Meaning, she will no longer be around to help take care of my niece. Now Kacey has asked that I become my niece's godmother and that I move back to our hometown and in with her to help out. I declined because I know that what she really means is that she would like *me* to become my niece's primary caretaker. She then asked to \"compromise\" by having me pay for a home care aid, and for assisted living for when my niece turns 18. Again, I refused. My husband and I both have well-paying jobs so technically we could afford it, but I am sick of everyone rewarding Kacey for her poor choices. This resulted in a screaming match between her and I where, in the heat of the moment, I told Kacey that she should have gotten an abortion if she knew she was unwilling to step up and be a mother to a child with special needs. Now I am receiving daily texts from both her *and*  my mother stating how terrible of a person I am, and that if I truly cared about our family that I would help out. Am I the asshole?\n\nEDIT: I do plan on calling CPS. The only reason I haven’t done so is because my mother has actually taken very good care of my niece. My mother’s boyfriend is also very experienced with caring for special needs children due to the nature of his job.",
  "id": 1,
  "comments": [
    {
      "score": 7438,
      "content": "You should be calling cps like yesterday",
      "id": 2,
      "comments": [
        {
          "score": 4986,
          "content": "My mom has actually (shockingly) taken really good care of my niece. It’s just that now she is moving away, both her and my sister feel like I should be stepping in to help out and I feel like it’s not my responsibility.",
          "id": 3,
          "comments": [
            {
              "score": 2554,
              "content": "Yeah but your sister is not and she's the mother of the child",
              "id": 4,
              "comments": [
                {
                  "score": 2259,
                  "content": "Tbf if the mother has taken good care of her cps is pointless right now. However op should definitely call the day her mother moves away.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 983,
                      "content": "Exactly. If there is someone who is caring for the child, CPS won’t get involved. What would they do, other than what is already being done?\n\nOnce grandma is gone, though...",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Wouldn't they take a report and perhaps consider a transfer of primary custody to the grandmother?",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 102,
                  "content": "As long as a responsible adult is caring properly for the child, CPS is not going to get involved. Those resources need to be saved for children who are being abused and/or neglected.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Could she get help from the state as a foster mom or something though?",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "“Hello CPS? Yes, I know a child that will be mistreated in the future”",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Anyone calling CPS should heavily consider how often CPS puts the child in a worse situation. If the grandma is doing a good job for now, that’s better than CPS",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "CPS probably wouldn't do much since the child was cared for",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "It's almost like you don't understand what CPS does.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 0,
                      "content": "If the mother of the child isn't taking care of the child and the child's caretaker is leaving there will be no one to care for the child therefoe the child is going to be neglected and probably upset thay her grandma is leaving and her mom don't gaf",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "So should you call CPS on every parent who puts their child in daycare? As long as there is an adult willingly caring for the child there's no case",
                  "id": 15,
                  "comments": [
                    {
                      "score": -1,
                      "content": "But the willing watcher is leaving and its been stated the mother isn't a good mother so what's gonna happen now?",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "CPS wouldn't have given a shit until now tho. All they'll care about is that the grandmother is willing to look after her granddaughter and she's being treated fine.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Yeah but the mom is leaving so whos gonna take care of the kid now",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 400,
              "content": "It is absolutely NOT your responsibility.\n\nWhy can't sister and niece move with mom & bf?",
              "id": 19,
              "comments": [
                {
                  "score": 439,
                  "content": "They *can* move, but my sister doesn’t want to.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 501,
                      "content": "Then your sister needs to deal with her poor decisions. You’re right to stop enabling her.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 52,
                      "content": "You should let her know that the other option is losing her child. Because that’s the reality if (and when) cod is called",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 40,
                      "content": "NTA. I love how your sister doesn't want to move but calls you an asshole for not being willing to turn your life upside-down for her.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Well, as a great philosopher once said, *you can't always get what you want*",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "yeah thats ridiculus. maybe she will move in when she realizes how good she has it",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Your sister is a choosing beggar.",
                      "id": 26,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I give that 3-6 months before she's packed and moved.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 36,
                  "content": "I mean, OP's mother could love her grandchild, but it itsn't her responsibility either, was sister's choice to have/keep the baby so she should take care of him/her.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 113,
              "content": "You already raised one child which you should bring up to both women.",
              "id": 29,
              "comments": [
                {
                  "score": 130,
                  "content": "I dunno, I think every word OP says besides, \"No\" opens her to an argument.\n\nOP, No is a complete sentence.  Use it often.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "[deleted]",
              "id": 31,
              "comments": [
                {
                  "score": 182,
                  "content": "My mother would like Kacey and my niece to move with them, but Kacey doesn’t want to. The breadwinners are my mother and (mostly) my mother‘s boyfriend. Kacey has a part-time job and she didn’t go back to school after my niece was born.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 151,
                      "content": "As a friend used to say, the fact that she doesn't want to move along with her mother is a \"her problem\". Not your responsibility to coddle someone who doesn't want to make the decisions that would make her life easier. She can either stay where she is with no support, or she can move with your mom, thems the choices. That's it.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I would say part of the reason your sister doesn't want to move is because she doesnt want to lose her drug contacts and her drug and drinking buddies. Your mom is enabling your sister and theyre obviously very codependent. You're NTA OP. Dont you dare enable your sister to continue in her addictive behaviors, stand firm and force her to step up and if she doesn't call CPS.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Can your mom take parental responsibility for the child and leave Lacey where she is?",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Yet another selfish decision on the part of your sister.",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 55,
              "content": "Why doesn't Kacey and her daughter move with your mom?",
              "id": 37,
              "comments": [
                {
                  "score": 141,
                  "content": "She doesn’t want to move. She has a boyfriend that isn’t willing to make the move with them, not that I think he should.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 76,
                      "content": "Then your mother should fight for custody of your niece. You are NTA.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "She doesn't want to move but she's expecting you to move back to your hometown for her?",
                      "id": 40,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Yah it's absolutely ridiculous that she wants YOU to move when she's not willing to move. Good for you for setting up boundaries.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "Stick to your guns she will never learn if everyone does it for her",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "you need to call before she leaves the state. CPS can place your niece with your mother and close the case no problem. but once your mom moves states it becomes a removal and then its a lot more difficult to place with a relative who is out of state. its better to do it now",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Honestly you did your mom’s work already so if she feels so strong about the child, she should take her with them wherever they move, the mom is clearly incapable, a mess and doesn’t care enough to quit her party lifestyle",
              "id": 44,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Info: who is the legal primary guardian? If it’s your sister then call CPS despite how good your mom has been at caring for your niece.",
              "id": 45,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "If you call CPS wouldn’t they give your niece to your Mom as the next in line? Could your mom take your niece with her? It’s probably the best solution if they’re willing. Your mom could just adopt her even.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 102,
          "content": "KACEY: “Here take my kid” \n\nOP: “No”\n\nUh, that’s an NTA.\n\nThe abortion stuff is just to show how OP finally got to say “I told you so.”",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "See if mom and her bf can take the child with them.\nNTA BTW",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Why?",
          "id": 49,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2753,
      "content": "Changed my vote as I wrote it. NTA. If you had said it when the child could hear, then yes, that’s never okay, but you’re being honest with someone who is a terrible parent. \n\nBest thing to do here is to simply keep your distance and report child abuse and neglect as necessary to have the child taken away and matched with a better home.",
      "id": 50,
      "comments": [
        {
          "score": 1377,
          "content": "Yeah, I’m planning on reporting this to CPS. The only reason I haven’t already done so is because my mother has actually taken really good care of my niece. Her boyfriend is experienced with caring for special needs children also due to the nature of his job which has been a tremendous help.",
          "id": 51,
          "comments": [
            {
              "score": 412,
              "content": "I read your post OP. I know that there was no need to before with your mom taking care of the kid. I get it. I’ve been in a similar situation. \n\nI’m glad that despite being in a situation that fostered codependency, you were able to find your way out of it. Good luck!",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 71,
              "content": "Can sister and niece move too?",
              "id": 53,
              "comments": [
                {
                  "score": 153,
                  "content": "Yes, but my sister doesn’t want to go.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 169,
                      "content": "Boo fucking hoo",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "She is the cause for her problems and there are clear solutions for her to take to fix this but she obviously doesn't want to. \n\nGood on you for standing your ground and not going along with it because \"family\"",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "i'm glad your mom's turned her life around - but it's not her responsibility and it's definitely not yours. NTA. hope all works out for your niece when when you do call CPS.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -45,
              "content": "Her wanting help with her child does not mean you should call CPS. Your sister is being unreasonable and probably taking advantage of your mom, but CPS? Has she abused or neglected her daughter (and using your mom for daycare is not neglect). How bad is her partying? Does she have a stable job? Do you want your niece going to a foster family? Is your sister really that bad? If she is then I say make the call but really think this through. Maybe wait to see if she steps up after mom leaves?",
              "id": 58,
              "comments": [
                {
                  "score": 66,
                  "content": "Kacey is hardly home so I’d consider that to be pretty neglectful. On the rare occasion that she does actually look after my niece, she gets frustrated and irritable. I haven’t called CPS yet because my niece is well cared for by my mom and mom’s boyfriend. They all live together. \n\nMy sister has a part-time job and she’s out partying at least 3-4 nights a week. I obviously do not want my niece to go into foster care. But I also don’t want to give up my life and career to move 3 hours away back to my hometown so that I can care for a special needs child when I don’t even want to have children of my own.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 13,
                      "content": "That’s understandable. And thanks for the response. I think that sometimes these situations forget about the child and become adults bickering, but you’re right, this child is not your responsibility. If anything, at least wait until your mom and her boyfriend move and, if your sis still doesn’t step up, then you know calling authorities is the right thing. Good luck!",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "thank you for looking out for the kid. i was taken away from my bio family at age 2 due to abuse & neglect - my bio family were largely addicts. i’m hugely messed up now at 22, so if you can get child services to come as your mum leaves, it’d be ideal for the child. i’m sorry you’re dealing with this, but again, thank you for looking out. i wish someone had done it sooner for me.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Might your mom be willing to bring your niece (or even Kacey too) to where she moves?   Sounds like your mom and her boyfriend are the closest and most familiar with the child's needs. \n\nMy mom is in a sort of similar situation with my sister and her 2 year old.  She'd also like to move and has said she'd have to make sure there's room for them to join her, otherwise my sister would spiral down hard without her help.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "If we assume that the sister's substance abuse is the cause of the nieces health problems, I would say that's neglect.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "This is how I feel too.  Also your half sister sounds like a terrible mom altogether whether her child is special needs or not.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Its important to note that calling CPS doesn’t automatically mean the child will be “taken away and matched with a better home.” CPS can assist with substance abuse treatment, parenting classes, etc. also homes that are able to successfully parent children with special needs are extremely few and far between.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Lol I highly doubt that whatever \"it\" hears will hurt \"its\" feelings",
          "id": 66,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -34,
          "content": "[Text of original comment deleted for privacy purposes.]",
          "id": 67,
          "comments": [
            {
              "score": 17,
              "content": "This particular child is only 4 yrs old and non verbal so it seems unlikely that she would not understand what was said.",
              "id": 68,
              "comments": [
                {
                  "score": 5,
                  "content": "Not a fan of the idea that we can say horrible things about disabled people because “they can’t understand”",
                  "id": 69,
                  "comments": [
                    {
                      "score": 4,
                      "content": "That sounds like a horrible to say in it self",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Non verbal didn’t mean she can’t understand. She probably does not speak or communicate verbally, however.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh crap, I missed the “not” in my sentence.",
                      "id": 72,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "How many 4 year old know what abortion means?",
                      "id": 73,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": -7,
                  "content": "[Text of original comment deleted for privacy purposes.]",
                  "id": 74,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": -8,
              "content": "Yeah she’s a living human being, not a “poor choice”.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 847,
      "content": "NTA: call CPS, she’s a unfit mother and she is reaping what she has sow",
      "id": 76,
      "comments": [
        {
          "score": 362,
          "content": "A whole lot of people saying call CPS. Have you ever dealt with CPS? I have, for 5 years. They. Are. Useless. Reading the post, I can tell you there is no action to be taken by CPS yet. They barely do anything AFTER the fact. Let alone before, especially against a mom. This is a no win situation for anyone involved. Until something horrible happens, no one will help.",
          "id": 77,
          "comments": [
            {
              "score": 152,
              "content": "CPS tends not to do anything when it is needed, and tends to have a lot of unnecessary cases open on minorities. And if the parents are in a homeless shelter or methadone clinic. I can see the methadone clinic, but they keep the cases open even if there's no need, and many times they will close cases with active addiction. The smarter thing would be for your mother to go for custody and just take the kid with her.",
              "id": 78,
              "comments": [
                {
                  "score": 14,
                  "content": "I remember reading an article about a Black woman going to jail for \"neglect\" when the 3 year old wandered out of the house and she was actively looking for the child and successfully found the child. When you read more you see that she had a case open but it was truly for either mundane reasons or because of poverty. It's so sick how the system doesn't help those who needs it and punches downs on others.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 1,
                      "content": "https://www.nytimes.com/2017/07/21/nyregion/foster-care-nyc-jane-crow.html",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 99,
              "content": "I'm not saying this to be rude, and I definitely believe you on having a bad experience with CPS, because the system is extremely complicated and overloaded, and there are definitely bad social workers out there, but I always get a little worried when people post saying they won't do anything and not to use them at all, because they CAN and SHOULD be taking action if the situation calls for it.  This is an extreme example, obviously, but if everyone adopts the mindset that CPS is useless, they won't call them for cases of extreme abuse or neglect, then children will die.\n\nI am not an SW, but I have several friends that are.  The child would most likely not be removed in this situation, but they could always create an action plan with the mother if necessary.  If this were to happen, she would be required to follow certain steps (like counseling, for example), and they would be able to ensure these steps are being completed.  Even if they do nothing right now, though, the situation should be documented, so if they were called again about the family in the future, they would have more information to better respond to the situation.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "My son was removed from his biological mom at birth based on her actions prior to him being born and I’m thankful for it every day. People reported things and he didn’t fall through the cracks. I have no doubt he would have ended up a dumpster baby. She has since had 5 more and lost them all at birth. Unfortunately, she will never be able to raise a baby. But, those calls prior to his birth likely saved his life.",
              "id": 82,
              "comments": [
                {
                  "score": 2,
                  "content": "I’m glad your son found you.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Just bc CPS is terrible (they are) it means that a grown adult has reported lack of care and it’s on record. If a teacher hears of or saw this at a school, they’d have to report abuse or lack of care. (Mandated* reporting) That is critical for this child. It’ll also force Kasey and their mom to finally understand how serious taking care of the niece should be.",
              "id": 84,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "CPS are overworked, underpaid and have to deal with people like you calling them out for it. Go get a job in child protective services and tell me how easy you find it to simply remove other peoples children.",
              "id": 85,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -3,
              "content": "Lol anyone who has seen trials of Gabriel Fernandez knows CPS isn’t worth jack shit",
              "id": 86,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Nice metaphor and NTA",
          "id": 87,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 533,
      "content": "In context I’m going with NTA. It’s a harsh thing to say about any child (and I’m fiercely pro-choice), but you weren’t really saying it about the child, you were saying it about the mother making choices. You are a little bit wrong, in my opinion, about saying you “know nothing about caring for special needs children,” because that doesn’t matter, you could learn if you wanted to, but the point is, YOU DON’T WANT TO BABYSIT AND THAT’S FINE. You don’t need an excuse, and the one you’re using is kind of crappy. “I’m not interested in babysitting, making the time, or shouldering Kacey’s poor choices,” is all you need.",
      "id": 88,
      "comments": [
        {
          "score": 156,
          "content": ">because that doesn’t matter, you could learn if you wanted to\n\nFound the person who've never cared for a special needs child with developmental issues. This is a full-time job. You can't just pop in and out. You have to be there and available to the child wherever whenever. OP is married, has her own job, her own life, and you expect her after what she explained to end most of that to make things easier for her irresponsible sister? There is no two sides here only one. OP is not obligated to help. She  is not selfish for putting her feelings first and foremost because it is literally not her responsibility.",
          "id": 89,
          "comments": [
            {
              "score": 22,
              "content": "Wow, I disagree my friend! No one is saying OP’s going to take on this full time job! \n\nFor parents, a child with disabilities IS a huge ordeal. I am not making light of the heartache and trials and worries that come for having a baby that is fundamentally and for the rest of its life not suited for the world in which it was born. But many of the families with special needs children I’ve worked with have a support network (with outside caregiver services, with each other, with other programs) that not only serve to keep their kids involved in the community, but give them all a break when they need it. The people who do respite care or who volunteer aren’t on call all the time. If OP through generosity of spirit was to offer being temporary respite provider, there’s a lot of benefit for both sides. The child gets new exposures and the caregiver gets some hardcore lessons in compassion and empathy. \n\nAll that said: do I think OP should step in and take responsibility for caring for her niece the way sister wants? Hell to the no I don’t. It’s a huge commitment and she has expressed numerous times she’s not interested. That’s fair and valid, and it’s not selfish at all. It IS a huge undertaking. \n\nBut you *can* learn if you want to. Whether that’s through volunteering or community outreach or getting paid for respite care, you can learn and it doesn’t have to be 24/7.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "We’re on the same side, you and I! 🙂But yes, I haven’t had to care personally for a special needs child. My intention—less experienced than yours—was that she could learn the child’s physical needs in order to come for an hour or two if she wanted to make the time, but we agree, she’s not obligated AT ALL.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I'm very, very, lucky in that my daughter is only OCD and high functioning spectrum.\n\nLike, the worst we really have to deal with is compulsive self soothing techniques that cause panic attacks if she can't perform them. In the grand scheme of developmental issues, this is nothing compared to a non verbal 4 year old with cognitive delays.\n\nYou *could learn how to deal with my child. But the emphasis is on the word could. It's possible. And I think that's what the previous poster was trying to communicate. But that could, didn't ever mean should, or have to, or I'm entitled to it.\n\nThat being said, it is a hell of a thing to learn to deal with. I honestly can't imagine how much harder it would be for op.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -1,
              "content": "I think you misread their comment. They weren't saying OP should do that, they were saying OP's excuse wasn't necessary just saying you don't want to watch the child is good enough.\n\nAlso as an older sibling of two boys with autism and intellectual disabilities your life does not end because you are watching the children. There are people in the state that help watch them, there is school and support groups and many other resources to give the children support. Of course it is a lot of work but you are making it sound so \"it is the end of the world!\"",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 110,
          "content": "Love alone can't provide a good life for any child. Obviously the sister didn't get the memo.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I’m not going to babysit a child that I don’t know how to properly care for, that lives three hours away from me. How feasible is that, really? It’s not an excuse, it’s just the reality of the situation. I suppose I could go out of my way and find my own resources on how to care for my niece, but it’s not like my mom or sister have ever offered to show me the ropes either. It’s not fair of them to ask me to babysit on a whim, knowing that I haven’t been properly trained. \n\nI’ve babysat nieces and nephews from my husband’s side of the family plenty of times, so this isn’t an issue of me simply not wanting to babysit.",
          "id": 95,
          "comments": [
            {
              "score": -2,
              "content": "You’re absolutely not obligated to, even if the child lived next door, even if you did not need extra education to be a caregiver. Certainly distance plays a role, and the child’s needs do play a role, but you don’t even have to put up an ableist reason, unless it’s one your family will accept.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Why would she have to learn and do all of those things for a child that isn't her.",
          "id": 97,
          "comments": [
            {
              "score": -3,
              "content": "She doesn’t have to. Absolutely not. But that particular excuse is a bit ableist, and the plain answer of “I’m not doing it because I’m not doing it” is enough. (On the other hand, if OP feels she needs to give her family an excuse they can accept, and that particular one works, I completely get that.)",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 428,
      "content": "[deleted]",
      "id": 99,
      "comments": [
        {
          "score": 61,
          "content": "Read in Ron fucking Swanson's voice",
          "id": 100,
          "comments": [
            {
              "score": 8,
              "content": "For whatever reason I read this in Thomas sanders voice",
              "id": 101,
              "comments": [
                {
                  "score": 1,
                  "content": "[deleted]",
                  "id": 102,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I'm sorry I was trying to start a chain",
                      "id": 103,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 29,
          "content": "To be fair with some context it seems like the mother started turning her life around",
          "id": 104,
          "comments": [
            {
              "score": 10,
              "content": "A few years of good behavior does not erase the damage of a lifetime of bad behavior.  Especially when you are talking about the formative years of a person’s life.  OP will never have the relationship with her mother that her sister’s child does.",
              "id": 105,
              "comments": [
                {
                  "score": 1,
                  "content": "I never said it does I'm just saying that it should be at least somewhat respectable that someone is turning their life around",
                  "id": 106,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah she seems like she is, but OP also said that the mother is encouraging the sisters lifestyle because of her guilt about their childhood and also calling OP a terrible person.",
              "id": 107,
              "comments": [
                {
                  "score": 2,
                  "content": "Good point. Plus she’s guilting her other child to make up for the one she’s enabling.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "She just probably feels guilty but its good she moved or who knows how long she was going to have to raise the child alone",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 222,
      "content": "NTA. Your sister is not a fit parent. You are not responsible for her bad choices. If your mother and sister feel so strongly about this, they can take care of the child.",
      "id": 110,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 142,
      "content": "Soft ESH, but only because you explicitly told her she should have got an abortion. I think that comment is just a bridge too far, especially if you believe in her choice whether to give birth or not. On everything else, I think you’re well within your right to not clean up messes caused by poor decisions that aren’t your own. And yeah, CPS probably ought to know about the situation.",
      "id": 111,
      "comments": [
        {
          "score": 49,
          "content": "Yeah, \"you should have ended the life of your daughter before it began\" is just a nasty thing to tell someone. No matter how you say it, that's what is heard. She clearly needs to step up to the situation, but I think that's never a helpful thing to say",
          "id": 112,
          "comments": [
            {
              "score": 238,
              "content": "Would “You had a choice, and you should not have chosen to have a child that you didn’t intend to care for” not work? \n\nI don’t think that’s an inappropriate way of saying the same thing, and I’m pretty sure that’s what OP intended to say.",
              "id": 113,
              "comments": [
                {
                  "score": 11,
                  "content": "But it's not \"a child\" in the abstract sense anymore. It's her daughter who is a breathing, living, loved person. Yes, Mom totally sucks at how she's handling it, but you're not saying \"you shouldn't have a kid\" you're saying \"you shouldn't have had Sophie (random name)\". During pregnancy is vague. After birth it is specific.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 178,
                      "content": "Even with names, it still sounds reasonable to me. “You made the choice to have Sophie. No one forced you to make that choice. If you didn’t plan to care for her, then you shouldn’t have made that choice.”\n\nSame thing. Still fits.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 80,
                      "content": "I was tempted to write the same vote when I voted, but I didn’t because I think that OP was trying to appeal to the mother’s responsibility in all this. Because I’ve been around mothers like this before, and they will always act like having the child was some unpreventable tragedy that happened to them. That’s why I think OP was quick to remind the mother of her choice as it ends that ridiculous appeal for sympathy.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "> “ you should have ended the life of your daughter before it began\" \n\nI mean.. this would be one of the precise cases used as a wedge to rationalize the morality of abortion in the first place.. rape babies and those with severe disabilities were meant to be the “rare” in “safe, legal, and rare”",
              "id": 117,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Just feel like abortion is such a sensitive subject no matter what you say people will get but hurt. Not that I give a shit if you get one or not but if you something like “you can always get an abortion” people look at you like you’re fucking evil.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -6,
              "content": "Right? There's no 'undo' button. It's not like she can go back in time and have an abortion. OP is well within her rights to refuse to help, but telling someone \"you should have aborted your kid\" is just plain shitty....",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "[Text of original comment deleted for privacy purposes.]",
          "id": 120,
          "comments": [
            {
              "score": 34,
              "content": "Why? Truth be told, most of us agree with her, even if we would never admit it - that’s why. \n\nVoting isn’t an admission though.\n\nAbortion is legal for precisely these kinds of pregnancies. It’s the wedge that was used to force open the door for legal abortions, alongside rape babies - if she didn’t want the responsibility of motherhood she should have taken the state up on their offer to sanction the killing of the child.",
              "id": 121,
              "comments": [
                {
                  "score": -25,
                  "content": "[Text of original comment deleted for privacy purposes.]",
                  "id": 122,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Intended to injure? Of course it was. Sister thinks she's done this child a blessing by choosing to be her mum. Kid wouldn't know she didn't exist otherwise... but sis decided it was important to see the pregnancy through and now doesn't want to see the child's *life* through. \n\nSister's pride needs to be wounded.",
                      "id": 123,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "Somewhat neglectful? She has a 4 year old who is profoundly disabled. The time for partying ended 5 years ago. The fact that she isn't the primary caretaker is a huge fucking problem.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "> But there's a massive difference between thinking abortion would have been the right choice and choosing to say that to the child's parent after the child was born.\n\nIntellectual honesty?\n\n> The comment was just cruel and intended to injure.\n\nIntended to shame the mother into doing her job, instead of sucking on a crack pipe and whatever else her dealer wants her to suck, more like.\n\n> somewhat neglectful parent\n\nThat’s a joke, right? Somewhat? Sounds like you’ve taken a hit from the same pipe there.",
                      "id": 125,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": -4,
          "content": "[deleted]",
          "id": 126,
          "comments": [
            {
              "score": 14,
              "content": "I don't think she's saying 'you should have aborted because she's disabled', but 'you should have aborted if you couldn't look after a child'.",
              "id": 127,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Disabilities isn't what we're looking at. I would support what OP said even if the child was completely abled.\n\n[Poem about parents passing on pain and dysfunction.](https://www.poetryfoundation.org/poems/48419/this-be-the-verse)",
              "id": 128,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -10,
          "content": "This should be the top comment",
          "id": 129,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 133,
      "content": "NTA if your mother and sister care so much they should look after the kid not your responsibility although it sounds like you have a responsibility of calling CPS it does not sound like a safe household.",
      "id": 130,
      "comments": [
        {
          "score": 74,
          "content": "I am planning on notifying CPS.",
          "id": 131,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 41,
      "content": "Weather who's the asshole doesn't matter you need to help that poor child out by calling CPS",
      "id": 132,
      "comments": [
        {
          "score": 5,
          "content": "[deleted]",
          "id": 133,
          "comments": [
            {
              "score": 1,
              "content": "Yup I knew it was whether just couldnt be bothered to change it lol but yeah I agree",
              "id": 134,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 37,
      "content": "NTA\nYou said this to your sister and it’s your opinion.  You are not obligated to pay for your nieces care.  If you suspect abuse and lack of care is likely once your mom moves, you could call CPS if you think it’s necessary.",
      "id": 135,
      "comments": [],
      "relation": "Support"
    }
  ]
}