{
  "post content": "My husband and I have been married almost 3 years. In that time he's worked a total of 6 months and has had more jobs than I have in my entire life. We've had a lot of financial rough patches with me being the sole earner. \n We've been behind on all of our bills and I thought this week was going to be the first time we were actually going to be caught up. So I told him I could probably give him more money than usual like $150 and we could maybe go out to eat. Well I was wrong. We have one more big bill. \nThis morning he left to go see a friend. He took the debit card and called to ask to take $80.  I had the card turned off because we were overdrawn until I got paid. He came home when he realized this. He asked me to turn the card on so he could have $80. I was still in bed and I hadn't even checked the bank account. So I said I'll bring you money when I get up. He asked how much. I told him probably $40. He threw a fit. \nHe does do all the cooking. He complains I don't do enough housework so he does none of it. I do all the laundry. I do what housework is done after working full time. \nWhy I think I'm an ass hole: I did tell him he could probably have more this week. Instead he can only have his normal amount\nEdit: He did not get any money today. I told him to stay at his friends. I took the dog with me to work in case he threw another tantrum. I have cameras so I'll know if he comes home.",
  "id": 1,
  "comments": [
    {
      "score": 11168,
      "content": "NTA. He doesn't work. He doesn't clean. He throws temper tantrums when he can't just blow money on himself rather than showing an interest in making sure the household needs are met. He doesn't respect the work you put into your lives. \nAre you aware that your life would be easier without him in it?",
      "id": 2,
      "comments": [
        {
          "score": 3824,
          "content": "I know it would be. I can't afford a divorce. I can't legally kick him out.",
          "id": 3,
          "comments": [
            {
              "score": 4155,
              "content": "You can leave him before actually filing for divorce.  You might need to wait until your lease is up if you rent,  but you're already supporting a household on your own.  I know that it's not that simple and there are other factors.  But you know he's not going to change,  right?",
              "id": 4,
              "comments": [
                {
                  "score": 2599,
                  "content": "I own the house.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4691,
                      "content": "At the very least,  cut off the allowance.  Just simply tell him you can't afford it and he'll have to find a way to make his own spending money.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1475,
                      "content": "Give him a 30 day notice to leave. \n\nFile for divorce. Do whatever you can to get it done. Family that can help? Do not give him any money. Tell him it’s over and hopefully he’ll leave on his own once he realizes your not giving in.\n\nHe’s also abusive. Put a hidden camera in living room to record what he does when your not there and his violent outbursts. Then go to police station and try to get a restraining order",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 264,
                      "content": "Call your local DV shelter. You are being financially abused. They may have access to a pro Bono attorney or other legal resources. \n\nHas he made any threats? A restraining order is an option if they are in writing.  \n\nYou might want to open a bank account that doesn't have his name on it, and have your paycheck deposited there. You are not legally required to give him spending money, afaik.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 117,
                      "content": "Then start the separation process. That will give you legal grounds to start the eviction process to get him out.\n\nStop giving him allowance and use that money for the divorce.\n\nYou are only making excuses. If you don’t want to leave him just say that. You can easily build up the money by not paying for him, not giving him allowance, keeping your food locked up so he has no access to it. Small things like this add up to enough money for a divorce.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 71,
                      "content": "You own the house, why can you not afford to divorce him?",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 48,
                      "content": "NTA. He gets what you can easily afford, no more. If you made a mistake when you told him an amount, then so be it. It’s just an error because you were half asleep.  You spitballed an amount from your memory. Your memory was not correct. So be it. You get to make errors, too. Give him what you can easily afford, no more. \n\nIf you are in America, most lawyers will do a free consult to guide you to get you started. You don’t have to hire the lawyer. \n\nYou might need a divorce lawyer and a real estate lawyer consult. The latter is to learn how to remove him from your home. It takes a few steps and maybe a few months, but it is very doable. \n\nIf you know someone who is divorced, ask who they used as a lawyer and if they were satisfied with the work. Call that lawyers office to see if they will do a free consult. Uncontested divorces are pretty cheap. \n\nAlternatively, you can Google your “[state] bar association.” They have a phone number you can call to get referrals to divorce and real estate lawyers in your area who will do a free consult. They might charge about $35 or so for the referral.  \n\nI commend you for working so hard to get and keep your finances straight. It’s a lot of work. Good for you for putting in the longstanding effort. \n\nI hope you update us. I wish you the best. ❤️",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "If his name isn’t on it you can kick him out. Divorce doesn’t have to be final for separation to take place. In some states you don’t even have to file for separation you just have to break up.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "[deleted]",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 20,
                      "content": "give him 30 days notice. once he is gone you can save up for the divorce. this seems such a simple solution OP, im failing to understand whats stopping you from doing this.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Then you can kick him out. Put him in a box and mail him back home to mommy",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 198,
              "content": "Word of advice: I waited for a divorce far too long because I was worried about affording it. We have kids and the process was amicable with one attorney, $1700 total. But either way, you can separate and file when you are ready. You already support yourself. Don’t keep yourself miserable because you are afraid of the next step.",
              "id": 16,
              "comments": [
                {
                  "score": 3,
                  "content": "For real. I did the same exact thing. My ex didn't even have to show up to court to have it approved/finalized. Best money (on credit) that I ever spent.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "Why not? Is his name on the lease, mortgage?",
              "id": 18,
              "comments": [
                {
                  "score": 195,
                  "content": "It's our \"marital home\" I own it. It's all in my name.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 221,
                      "content": "Get some legal advice, I think Reddit has a sub for it, but if he’s not on the mortgage you may have legal standing to tell him to go. He doesn’t sound like he’s a good person.\n\nEdit: I have now learned the Reddit legal sub is no bueno, see if there are pro bono lawyers who could help you instead.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 116,
                      "content": "He is violent - throwing things, breaking the mail box. This would seem to me (get proper advice from an actual lawyer!) grounds for kicking him out.  Is there a legal advocacy group for women in your state? You might be able to get some pro bono work from them if so.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 46,
                      "content": "You might qualify for some free legal assistance. Call 211 and explain your lack of funds and that you are looking for an organization that might be able to provide some legal assistance. It's worth a try. Or if your work has an employee assistance program, many of those offer free legal advice and a limited number of free counseling services.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "I am not a lawyer, but it is quite possible that any amount of equity that you put into the home before you were married would be considered your personal property. Same for any financial assets, property owned, or gifts received before you were legally married.\n\nI have seen, in a community property state, that only the assets or debts acquired during the marriage would count as joint assets/liabilities and be split down the middle. (If the house has appreciated in value, you might have to count half of the appreciation as his). But depending on the law in your state, things may turn out more in your favor than you're expecting.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "get yourself a lawyer and get him out of your home",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "put a 3 day letter to vacate up and start eviction, this guy is a bum",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "NTA and you can file for legal separation.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 35,
              "content": "Check your state's Bar Association if you live in the U.S. You might be able to get a free consultation.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "You can stop supporting him though. It sounds like all he does towards the “partnership” is cook. Start cooking for yourself and give him a timeframe to get a job, then cut him off.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Stop giving him money at all, for any reason. Use that money to see a lawyer to understand what your rights and responsibilities are, including how to legally evict him etc. He's using you. He can get a job if he needs spending money. Lock down your credit. Change banks so he cannot access anything. The marriage is over, because you are being financially abused.",
              "id": 29,
              "comments": [
                {
                  "score": 5,
                  "content": "Yes. Lock down your credit. Consult an attorney. Then go from there.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Ask about a financial affidavit from where you file. Poor people get divorced!!",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "you also don't have to give him any money at all, unless he starts pulling his weight around the house so he can earn that 40 bucks",
              "id": 32,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Every state has aid for people on tough times needing to get a divorce. They often even waive the filing fees for serious hardships. What is happening his financial abuse. He doesn’t work because he doesn’t have to. You aren’t keeping money from him because you can. You are overdrawn and can’t afford it. Because he doesn’t work. You are well within your rights to demand to be separated. It’s amazing how much money you will save not giving him an allowance, or paying for his food, the extra utilities he creates and so on. Is their a friend you might be able to stay with? You are not required to tough this out and shouldn’t. NTA",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Actually, now is the perfect time for divorce because there isn’t much in the way of assets to split.  If you wait 10 years, he’ll end up with half of everything you managed to acquire on your own, and you’ll be back where you started.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I don't think you can afford not to divorce him, because his stealing will only escalate.",
          "id": 35,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1843,
      "content": "NTA.  He needs a job.  Period.  You don’t make enough to comfortably live and he shouldn’t be getting any “allowance”. It should be savings.\n\nWhy do you stay married to him?\n\nHe sounds like a child, not a spouse.",
      "id": 36,
      "comments": [
        {
          "score": 669,
          "content": "He's had more jobs in 3 years than I have my entire life. I don't have the money to divorce.",
          "id": 37,
          "comments": [
            {
              "score": 760,
              "content": "Maybe consider a separation.  There are some people who don’t divorce, but go separate ways and have separate places to live.  Is he on the lease or mortgage?  That’s where it gets dicey.  \n\nimo, I would have kicked him out long ago or found a way to, even if I couldn’t divorce.  \n\nMaybe save his “allowance”, to divorce.  🤷🏻‍♀️",
              "id": 38,
              "comments": [
                {
                  "score": 687,
                  "content": "I am on the mortgage. I bought the house before I even met him. All the bills are in my name.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 813,
                      "content": "Go get legal advice - please. .. not sure where you are but some countries have free legal services for certain things.. I'd also look into evicting him - if his name isnt only anything, it might be possible to serve am eviction notice along with separation papers?? Not honestly sure if possible. \n\n\nDo you have family/friends that you can ask for help from - not necessarily money but staying with you if you serve separation papers so you feel safe?",
                      "id": 40,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 98,
                      "content": "Why do you think you can’t legally kick him out? It’s your house, you pay the bills. Serve him notice.",
                      "id": 41,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 56,
                      "content": "If you bought the house before you met him thenits not considered marital property. Therefore, he has no claim to the house in any means, maybe equity of he can prove that he paid towards the mortgage or renovation. \n\nBut this gives you every legal right to evict him with 30days notice. If he doesn't leave at 30days, then you can getnpolice involved to remove him.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "Go to legal aid. They can walk you through it.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "How come you can’t legally kick him out of you own the house? You can issue him an eviction notice with the specified number of days to find other housing.",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "If you are in the United States look into Legal Aid for help or look at local Law Schools sometimes they have Law Clinics where students help you under the supervision of a practicing lawyer",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "If his name isn't on the house or bills, you should legally be able to kick him out. If he refuses, you can have him physically removed for trespassing. He's a deadbeat and you don't have to deal with this behavior.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "NTA at all, if you dont want to be with him anymore give him 30 days to vacate.  The house was yours before you were with him and married only a few years so that means he can't claim its his especially since he can't hold a job.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "You need to check your local laws, preferably by consulting an actual divorce lawyer from your area. \n\nDepending on where your live, he might not have any right to your home and you can evict him.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "So why cant you evict him?",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 134,
              "content": ">> I don't have the money to divorce.\n\nSweetie, you’re paying for this marriage in many _other_ ways though. You’ll find the money to get divorced. It’s clear you’re not compatible.",
              "id": 50,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 71,
              "content": "You would probably have more money when it's over though. Right now you're carrying dead weight -- paying food, utilities, etc for two people when you're the only one contributing AND doing the work at home.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 57,
              "content": "This is the only time I would ever suggest actively putting yourself in debt, or borrowing whatever you can from family. You will pay off the divorce much faster without this dead weight. \n\nYou deserve better. \n\nNo judgement, just hoping you are able to get out and get yourself on a better track. Just because yall have been together this long, doesn't mean you have to stay together.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "First of all, NTA. If there’s something preventing him from keeping a job, like health reasons or mental health issues, then he needs to file for disability so he is at least contributing to the household. If not, then he needs to get off his ass and get a job or at least start providing in other ways like a SAHP should. It’s been three years and it looks like this is who he is. You said you owned the house before you met him, so it sounds like your money problems are a result of having to provide for him. He’s a leech and the only way to better your live is to remove him from it. \n\nSecondly, I am an attorney, but not your attorney. If you’re in the US then contact your local Legal Aid, they have services that will help or answer more specific questions for little or no cost. Most states will lower or waive filing fees for parties that can prove financial hardship. You can often find sample divorce petitions online. He may contest the divorce, but you can do it without an attorney. If you can’t afford one, then he definitively can’t, so you’re on equal footing there.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I’m gonna phrase my comment this way: YTA for promising him more money instead of putting that money in a savings account toward an attorney’s fee. It doesn’t sound like you’re interested in a divorce yet but someday…  But you’re giving every cent you have available to this dud. Why?",
              "id": 54,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Info: why has he had so many jobs? \n\nI've had a million because my area of expertise is usually temp positions here and there.",
              "id": 55,
              "comments": [
                {
                  "score": 6,
                  "content": "He keeps getting fired.",
                  "id": 56,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Not your problem. The alternative to him working is, in his eyes, better than working. That's because you let him live with you for free, you give him an allowance, you pay for everything else. He will keep getting fired because he doesn't mind getting fired. Kick him out.",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "You will never have money and that’s on purpose. I think you will find you have the money to pay off the debt when he’s gone.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Cheaper than staying married and supporting this bum. \nThe longer you stay stuck in this, the more likely you are to lose so much more; like he takes half your house or something.\nAnd I haven't once seen you say that you love him or he's fantastic and you don't want to end the relationship; just that you can't afford a divorce. \nStop for a moment and think about that. Keeping the marriage is way more expensive and you don't seem to even want to be in it.",
              "id": 59,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Stop making excuses. Divorce isn’t very expensive at all when you’re already broke. In most states, you can file for divorce yourself for $75-150; all you have to do is Google how to fill out the forms. Do it NOW before y’all are together any longer, or the house that’s in your name will become community property by virtue of him living there long enough to claim it that way",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 799,
      "content": "NTA, unless you keep enabling him.  Can you spell D-E-A-D-B-E-A-T?  Please don't have kids with this guy.",
      "id": 61,
      "comments": [
        {
          "score": 453,
          "content": "I don't plan on it.",
          "id": 62,
          "comments": [
            {
              "score": 271,
              "content": "Be careful with your form(s) of birth control, I've known a few women in similar circumstances who said they wouldn't have kids until the men got their crap together and they ended up pregnant even using protection properly.",
              "id": 63,
              "comments": [
                {
                  "score": 231,
                  "content": "I can't get pregnant",
                  "id": 64,
                  "comments": [
                    {
                      "score": 74,
                      "content": "That's a relief since it sounds like there is no way you could afford it and you would likely have been stuck with all the work, sadly like one of my friends.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 51,
                      "content": "‘Infertile’ does not equal ‘sterile’. \n\nInfertile people can and do get pregnant.\n\nIt’s something I see on Reddit regularly:\n“I am infertile, I thought I couldn’t get pregnant. But now I am pregnant…”",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "Make sure you aren't relying on general infertility or pcos. \"Miracles\" happen lol.  Be fully sterilized or non-afab before assuming you can't!  Docs told me it could never happen and i believed them. Was not true.",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "NTA- I think I might have been married to this guy as well...\n\nI'm sorry that you're going thru this, and it will get better. You have to be strong, and stick to your guns. \n\nI told my husband at the time, (he wouldn't work, same as yours, sat at home all day, wouldnt do anything around the house at all, all he wanted to do was play video games and drink, and when he was drunk, he was terribly verbally abusive), if I wanted to support a family by myself, I was gonna do it ALONE, and if he wasn't going to work, I was done supporting him. KICKED HIM OUT, made him move to his sister's house, in another town, and told him if he could get his shit together, and keep a job for more than 6 months and show he was trying to do something for himself, that I might be willing to work it out. But we never did.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Why did you marry this shit bag?  He stole your wedding ring and doesn’t have a job?",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 672,
      "content": "19 days ago you said HE STOLE YOUR RING! \nWAKE UP!!!",
      "id": 70,
      "comments": [
        {
          "score": 95,
          "content": "Wait what? That's theft! \nFile a police report and use it if he tries to go for your money in the divorce.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Talk about burying the lede.",
          "id": 72,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 413,
      "content": "Let me get the right:\n\nYour husband is contributing NOTHING as he doesn't work,  complains about doing chores, and then whinges about the money you can spare after you pick up all the bills? \n\nOP, you don't have a husband,  you have a teenage brat. \n\nNTA but you need to consider why you're allowing this man to treat you this way\n\nhttps://www.allthingsmedicine.com/why-does-he-do-that-pdf/\n\nRead this. I think you'll find it enlightening.",
      "id": 73,
      "comments": [
        {
          "score": 112,
          "content": "Thanks for the reading suggestion.",
          "id": 74,
          "comments": [
            {
              "score": 4,
              "content": "This book really helped me recognize what my husband was doing as well..highly recommend",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 300,
      "content": "NTA. Why has he only worked six months, and why are you expected to do housework when all he does is cook? If he wants 80, he should work.",
      "id": 76,
      "comments": [
        {
          "score": 178,
          "content": "He has been fired from every job.",
          "id": 77,
          "comments": [
            {
              "score": 560,
              "content": "He should be fired from your relationship",
              "id": 78,
              "comments": [
                {
                  "score": 30,
                  "content": "Lmaoooo",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Gottem",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "Sounds like he should be fired from being your husband too.\n\nNTA - please get out of this situation as soon as possible.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "He sounds like a hobosexual",
              "id": 82,
              "comments": [
                {
                  "score": 4,
                  "content": "Lmao! Thanks, just spit out all my water.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "From a fucked up standpoint, that's pretty impressive that he can keep getting fired yet go get other jobs to then get fired from.",
              "id": 84,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Your story is very much like mine.  Only we had 2 kids.  \n\n\nYou need an attorney to know how to best protect yourself.  I bought my house and it's only in my name but in FL it's community property after 2 years of marriage.  I got mine to sign a Quit Claim Deed to take the house out of the equation.  If you can do something similar and you don't have kids, in a lot of places you can do your own divorce.   The people at the local county courthouse were very helpful and gave me the forms to do  my own.     \n\n\nGood luck and I hope you find a way out.  No one deserves to be treated that way.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">https://www.allthingsmedicine.com/why-does-he-do-that-pdf/\n\nWhy are you putting up with this bullshyte?",
              "id": 86,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Because he doesn't want to work and doesn't have to because he's being taken care of by you. I really can't understand why you say you can't at minimum kickhim out of YOUR house. Get this trash out.",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 204,
      "content": "NTA\nYou cannot afford that money and he should be able to understand that. Though, it does sound like some miscommunication. \nAlso, if you are the sole earner, why is he only doing cooking and you the housework? Kind of sounds lazy...",
      "id": 88,
      "comments": [
        {
          "score": 153,
          "content": "He sleeps all day. And then doesn't do anything at night because I'm sleeping.",
          "id": 89,
          "comments": [
            {
              "score": 113,
              "content": "That just sounds even worse. He should be doing more. If he can't get a stable enough job to spend some extra money, then that isn't your fault. \nAnd just because you are sleeping, doesn't mean he can't do shit. Honestly, he just sounds like a lazy entitled brat. More a child than a husband.",
              "id": 90,
              "comments": [
                {
                  "score": 63,
                  "content": "Post history shows he stole her heirloom wedding ring just a few weeks ago too. He’s even worse than this post makes him out to be",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "Um, why are you with this lazy, leeching asshole? Do you really not have even a shred of self-respect? Jesus Christ. Want better for yourself.",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 134,
      "content": "Nta, \nYou can't spend money you don't have.\nIf you guys don't have enough money with one income, you should split up house chores and he should work as well.\nBut in the end you need to find a solution together and making responsable financial choice.",
      "id": 93,
      "comments": [
        {
          "score": 53,
          "content": "He's had more jobs in 3 years than I have my whole life.",
          "id": 94,
          "comments": [
            {
              "score": 80,
              "content": "Umm…aside from love, why are you with him? Your relationship doesn’t seem to be equitable.",
              "id": 95,
              "comments": [
                {
                  "score": 40,
                  "content": "Well it's costly just to file for divorce. That's the big thing. Plus I can't legally kick him out.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 174,
                      "content": "You need to figure out how much divorce costs vs. how much it costs to continue to live with him for the rest of your life.",
                      "id": 97,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 77,
                      "content": "Look into fee waivers. Depending on your income, you may be able to have all or part of your filing fees waived. You know, assuming you want to go that route.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 74,
                      "content": "I don't understand.\n\nStop giving him any sort of allowance and bam, you'll have the $300 filing fee for divorce.\n\nYou may not be able to legally evict him yet, but you don't have to make his life comfortable. \n\nHe isn't entitled to an allowance. I would also only do my laundry, only cook for myself, etc.\n\nIf you want to get rid of this guy, you absolutely can. Get a free consultation with a divorce lawyer and then decide what you want your future to look like.\n\nIf he starts making threats or gets violent over you not supporting him, call the police. It will only help your case.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 60,
                      "content": "You can evict him, it will just have to be formal and you will have to have him served.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 52,
                      "content": "Just fyi In many states you can fill out a form stating your financial need and they’ll waive court fees.",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "Look into filing for free. Since he has been violent that will help as well. There's a form (I had to use it myself) for a fee waiver, fancy name for it is In Forma Pauperis. You put your income and expenses and they waive the court fee.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Cut off the \"allowance\" until you can save enough for one",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Uh, yes. Yes you can. 30 day eviction, you own the house and he doesn't contribute. He has no claim in like 98% of cases. A free consultation with an attorney will help you, and most will take a payment plan - put that 40 a week to better use. 2 months and divorce paid for.",
                      "id": 104,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "I think all in all, if you factor what you're spending in $ and labour to support this leech, a divorce would actually be cheaper long term.\n\nAnd as you have been advised above, look into your legal options for eviction.",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Divorce will be cheaper than keeping him around",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 109,
      "content": "NTA. You already give him money but he still complain that it’s not enough while you’re the only income and keep the finance afloat?\n\nWhat was the reason behind the 80$?",
      "id": 107,
      "comments": [
        {
          "score": 144,
          "content": "He wanted $40 for weed and the rest for cigarettes and to split a bottle with his buddy. I told him no. So he threw things around the house and knocked down the mailbox.",
          "id": 108,
          "comments": [
            {
              "score": 150,
              "content": "That’s not even for basic needs like grocery, it’s solely for recreational stuff he can’t afford and only for himself!\n\nI would strongly advice you to think about your relationship and readjust thing now…\n\nWish you the best!",
              "id": 109,
              "comments": [
                {
                  "score": 86,
                  "content": "I can't even get new glasses. I'd divorce but it's like $300 just to file.",
                  "id": 110,
                  "comments": [
                    {
                      "score": 145,
                      "content": "Start saving up. Step one, open a bank account he can't get to and get your wage deposited there",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 95,
                      "content": "But it looks like you thought that \"you could give him more than the usual $150 a month\"? Stop giving him money for a couple of months and freaking file for a divorce! YTA to yourself!",
                      "id": 112,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 73,
                      "content": "$300 doesn't sound like that much if you're weekly giving him $150. Just stop giving it to him. Directly pay for necessities. \n\n\nIf you feel unsafe, stay somewhere else while you do this.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "So when that big bill is payed for, he doesn’t get $150, he gets 50, and you monthly save the remaining 100 for your glasses and a new start 😶\n\nEdit: Wait, no, you get glasses before he starts getting more than 40. Glasses are a necessity.",
                      "id": 114,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 38,
                      "content": "**And how do you know he's not going to get into a credit card debt?**\n\nYou **NEED** to seperate, as of yesterday. Your spouse will get a credit card, even if he's jobeless and has a bad credit himself. Even worse, because of his financial situation / history, he will get into a credit card debt with very bad interest rates.\n\nAs you know, when you are married, this kind of debt is SHARED. It doesn't matter he did behind your back, both of you are on the hook. The only way to avid it is to seperate - this way no-one can come after you because at the point when he got the card you were no longer together (it doesn't matter you haven't divorced yet).\n\nOf course, the matter is much more complicated and there are a lot of exceptions, hence good to have a chat with a lawyer, but please, seperate. It is very important that you do.\n\nBesides, you aren't poor, you have assets such as your house. You can sell it if needed. Don't fuck up your life even further. Seperate, speak to a lawyer.",
                      "id": 115,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "Yes i read in an other comment that you’re stuck for the time being and I feel sorry for you.\n\nI don’t know if or how much you want to keep this relationship so I won’t say « just quit him » like it’s an easy thing to do (emotionally and financially) but if one day you decide it’s enough, you could simply keep his allowance to file for divorce. Or redirect that money to counceling… Depend on what you want.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Sounds less expensive then financing this guy's life",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Stop giving him an allowance and you will have the fees in no time. Speak with an attorney, initial (half-our) consultations are usually free. Also, speak with a DV shelter - you ARE being financially and emotionally abused - and they may have resources for you.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Depending on your state you may be able to file in forma pauperis which will wave the filing fee. Check with your local law library. They often have forms to helps with this.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Stop giving him money and stop making excuses, you will be MUCH happier when you're not supporting this dead beat!",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Weed, nicotine, and booze. These are things a grown man acquires for himself independently. Sorry if that seems sexist but that's my point of view. \n\nDo you really want to be married to man were he single he would be homeless?",
              "id": 121,
              "comments": [
                {
                  "score": 38,
                  "content": "Thing is I don't smoke weed or cigarettes. These aren't even shared vices.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 27,
                      "content": "It really sounds like you need to re-evaluate this relationship if he isnt willing to change.\n\nThis whole post and all of your comments are massive red flags.\n\nThers nothing wrong with smoking/drinking but hes an adult, if he wants to do those things he needs to be supporting them himself, and as a secondary priority to your life together. If he cant do this then this is going to be your life until you leave.",
                      "id": 123,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "You are supporting him and his vices and he is  mad? Dear, whatever is there after paying the big debt you have, he doesnt need to know you have extra money, save it, evict his ass and get a divorce. NTA.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Even if you smoked more than he did, you're under no obligation to support anyone's addiction.",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "Sorry. Spending money you don’t have on weed and cigarettes is stupid and childish. To throw a tantrum that you can’t get them is even worse. Think hard what this immature, irresponsible fool brings to the table in your marriage and act accordingly. Definitely NTA.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "This is making me wanna scream. You’re in debt, and doing so well to resolve that, and he’s throwing a tantrum cos he can’t blow $80 on drugs. All the while he’s unemployed but won’t take care of your shared home. What are you getting out of this arrangement other than stress and a kiss before bed? I’m feeling stressed just reading this, i can only imagine how you must feel. Absolutely NTA",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I'd report him for domestic violence. If he can knock things around the house and then the mailbox, what do you think may happen to you if you piss him off enough? It happened to me.",
              "id": 128,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "why the hell are you still married to this guy? raise the fucking bar a little op. Jesus.",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Why would you give him money just for him to keep living on you? He is not even contributing to the basic needs and you are giving him money to buy weed, cigarettes, and drinks for his friend? You understand that you are enabling him and giving him incentive not to get himself together right?",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Ever heard of a PFA? When someone is throwing stuff around your house with you in it and knocking down mailboxes, it is reasonable to assume they will turn violent on you. A PFA is free and the courts will force him out of your house and order him not to be near you for 2-3 years. You need to go to the police and tell them he's being violent and you need him away from you!\n\n  \nAnd quit making excuses. All your replies are full of why you can't leave...if you don't want to dump him just say that!",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "The throwing things and knocking down the mailbox are violent behaviors. You should reach out to domestic violence organizations for help.",
              "id": 132,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Next time he starts breaking shit call the cops and let him catch a DV charge",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 81,
      "content": "[removed]",
      "id": 134,
      "comments": [
        {
          "score": 31,
          "content": "He can't keep a job.",
          "id": 135,
          "comments": [
            {
              "score": 138,
              "content": "He seems to be keeping the job of “husband” pretty easily… why haven’t you fired him yet?",
              "id": 136,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 61,
              "content": "Jobs are super easy to keep. Show up on time, wear clean clothes, do what’s asked of you. He chooses not to keep a job because you allow him to get away with it. NTA",
              "id": 137,
              "comments": [
                {
                  "score": 2,
                  "content": "OP, read this!!! This is very important!",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "Why should he? You keep allowing him to float by in the current situation. \n\nI’m going with ESH. I understand you’re married to him, but you sound more like a mother than a partner. If you two can’t come to an agreement around family finances with both contributing, do you want to be his caretaker for your mutual lives?\n\nTime to seriously consider how long you want this financial and emotional drain in your life.",
              "id": 139,
              "comments": [
                {
                  "score": 9,
                  "content": "Tbh she sound more like the doormat in front of a bank rn",
                  "id": 140,
                  "comments": [
                    {
                      "score": 3,
                      "content": "The ATM doormat for sure.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Why are you with him?",
              "id": 142,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Why can’t he keep a job?",
              "id": 143,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "INFO: does he have some kind of mental health issue or disability that makes having a job difficult? Doesn't sound like it, but want to be sure. Because if he doesn't, then he sure as hell can keep a job. He just doesn't have to, because you'll pay him for doing f-all",
              "id": 144,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "That's not your problem! He's a grown man, time for him to act like it!!",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You’re enabling the shit out of him. He hasn’t kept a job because he knows you’ll lay down and take it.",
              "id": 146,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "He can't function as an adult or a husband either, nor can you help him or carry him forever. \n\n\nYou only get one life. Don't waste it on this loser.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}