{
  "post content": "I (25F) live in a highly populated city. We have a backyard parking lot in the small building I live in and the the ground is covered with concrete grid pavement (has holes with grass in between).\n\nI was away from home for a few weeks and also purchased a new car. This car is significantly bigger than my last and extremely hard to park, especially with the small and awkwardly spaced parking lot. It’s not straight lines like at a grocery store. The builder worked around the weirdly shaped building and the gazebo so the parking spots are all over the place so every apartment can have one.\n\nWell, the morning I came back I received a text that I had run over the kid’s project garden for the summer. I was confused because I was sure I hadn’t gone near any of the small patches of dirt we have for planting. I went on the balcony and did see that there were crumpled plants on the left of my parking spot. The plants however were planted in between the grid pavement. I texted back that their makeshift garden was quite literally on the pavement meant for cars to go over. They told me that I can avoid running it over.\n\nI tried for a few days but ultimately one night in the dark I ran some of them over again. They painted white lines but again one night in the dark I ran it over. Next step my neighbours took was to put potted plants to surround it, and guess what I ran over the pots late at night.\n\nAt this point one guy called me downstairs and gave me a 10minute lecture how to park without doing it. I told him to respectfully f-off and move the plants next to his parking spot. My spot is so awkward, and there is a huge car on the right, so in the dark, when in doubt I am driving over the plants as opposed to damaging the car next to me. He got really livid and we got into a huge argument. \n\nSome people suggested they install lights so I can see better at night and avoid the plants but honestly even in the daylight I have to spend 10minutes manoeuvring and getting out the car to make sure the garden is okay. I don’t wanna do that. I said no and told them I would run over the plants again and they should move. A lot of the people called me an a-hole. Am I?\n\nEdit: an attempt to show you the parking spaces\n\n\n                         |          |\n\n   Building         |   me  |\n\n———————|          |\n\n         Garden           /         /\n\n     Neighbour ->   /         / \n\n—————           /         /\n\nBuilding 2\n\nEdit: English is not my first language, to clarify the garden is in a driveway, in a space meant for cars to drive on.\n\nLast edit: I think some of you don’t understand that there is a learning curve. It doesn’t mean I am an irresponsible driver. I signed up for a few lessons with a driving instructor for this but I still need time to get used to driving a bigger car. I don’t get the hate that I upgraded to a bigger car. I’ve  been driving for 7 years and I don’t have a single parking ticket or road scuffle. Why? Because I take my time learning to use my cars. It’s not a crime.\n\nEdit: my new car is a BMW GT, not one of the massive trucks you have across the pond. Those are not even available over here",
  "id": 1,
  "comments": [
    {
      "score": 11712,
      "content": "NTA\n\nYou do not make a garden in a parking lot. They can do potted plants in their parking spot, but not yours.",
      "id": 2,
      "comments": [
        {
          "score": 2589,
          "content": "How anyone can even consider an answer other than this one is beyond me. \n\nAlso I too upgraded from a 1 litre Suzuki alto to a 1.4 opel Astra hatchback and then to a 1.6 Toyota avensis saloon. I ABSOFUCKINGLUTELY spent a month parking that avensis slanted in every spot til I got the hang of the length of the thing. It’s not a freaking sin to have to get a bigger car. You just choose spaces away from other cars when you can while you’re getting used to it!",
          "id": 3,
          "comments": [
            {
              "score": 474,
              "content": "I have 5 kids that are very tall and I am very short. Our SUV is hard to park to say the least. I try but I have to use the cameras and it is hard.",
              "id": 4,
              "comments": [
                {
                  "score": 176,
                  "content": "Have you tried only doing reverse parking? I used to drive my fathers old Volkswagen Tiguan (still very rarely drive in his current one) and I fairly quickly noticed that SUVs have a really nasty turn radius to work with unless reversing. Once you got that reverse parking going, those camera's are nothing but last alignment help. \n\nI have camera's now as well myself, didn't pay for that because they're useless lol. Use the camera's, who cares, that's exactly what they're for!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 213,
                      "content": "Wayyyy too many people don‘t know the magic trick of reverse parking, some, like my mother, even outright refuse the use of this dark art of magic.\n\nOn a serious note, a lot of people really do underestimate how much easier it is to park a car in reverse once you got used to it because they never really got used to it in the first place.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Learn to back using side mirrors. Ask a school bus driver to teach you! It’s easier than using the so called backing cameras. Yes, they help some but mirrors are better.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Imagine thinking Tiguan is big ;) — just teasing as in many parts of the world it probably is considered big lol\n\nBut seriously reverse parking is basically all I do. It’s a million times easier and it’s safer when you’re leaving.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -1,
                      "content": "All cars park better in reverse. Black people and truck drivers know this and anyone can learn.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "How long have you had it? If it’s been more than maybe 4 weeks give or take, you might want to consider just booking a couple lessons with an instructor? I know I said there is some learning involved in getting a larger car. That’s only reasonable. But if you are persistently struggling it can be a hazard. Maybe take some time after or before business hours in an empty parking lot. That’s what I did!",
                  "id": 10,
                  "comments": [
                    {
                      "score": 1,
                      "content": "She did it's in the post..",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I have no problem parking any vehicle I've ever been in small Toyota to 20 foot uhauls... I've never had a problem maneuvering any of them... for plants in the pavements??? I'd have run them over as well... currently driving a big ish minivan but I wouldn't have told them to buy it.. I just know the nature of alot people especially children is to be hurt and offended and want something to \"coddle\"* them. \n\n\nSo I'd probably get a planter that's as big as the area they had and offer it up like, \"Yea the spot you chose sucked but I didn't want you to be too sad so here's a safer place than the parking lot\" me getting the planter isn't obligatory but I know it'd go a long way into solving the immediate issue and any upsettedness from the issue. \n\nI try to avoid conflict and calm people but also I'm kinda petty so if it were adults I'd teller to make better choices and not care... but it's kids... and kids are unreasonable. So I have to e the reasonable one as much as I can.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 22,
                      "content": "That’s very nice of you, and a thoughtful way to keep the peace. But this sounds like the parents are yelling at OP, not the kids. OP is NTA. Once is a misunderstanding that OP was away and the spot was free. Continuing to let their kids do it is the parent’s responsibility.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Get a cushion to boost you up higher. They even have ones that have clips to go around the back of your seat so they won't slide about, and decent ones are under 20 bucks. They're better for your back, and you can safely drive.\n\nYou never ever ought to NEED the cameras to park, and it means that when driving you can miss hazards or (heaven forbid) small kids or animals with your blidspots.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "Get a smaller car then.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 2,
                      "content": "And where should I put my kids? On the trunk or the hood. My 9 year old twins are 5 foot 2. My 13 year old is 5 foot 10. Maybe i should try the roof lol",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "[deleted]",
              "id": 17,
              "comments": [
                {
                  "score": 5,
                  "content": "I know it’s not the same but I drove my dad’s Subaru Impreza a few times and could never park it right and the spoiler on the back made me jump out my seat every time cause I thought it was another car lol! Some cars just aren’t for us!",
                  "id": 18,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Actually the crosstrek is just an impreza with a lift kit! The more you know. I struggle to get my crosstrek parked straight too. It's got a lot more headroom and the windows give a better exterior view that makes you feel like you're higher and wider than you actually are. The nose is also shorter than you think and the ass is flat. So you feel like you're in a much bigger vehicle than you actually are.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "From the title I expected to say he was ta but with the full story, the fricken \"garden\" is in his parking space. Tell the kids to move it closer to the actual garden.",
              "id": 20,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "I recently upgraded from a VW 05 crossover to a Small SUV, and before the VW I had a small Chevy sedan (idk the American name but here it was a monza) that was basically a compact with a trunk. Both times the learning curve for parking has taken more than a few weeks.",
              "id": 21,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yoo, off topic but my first car was a Suzuki Alto. Tiny little thing, so great to park. Wang it in any space",
              "id": 22,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "…wait. You have cars with only 1.6 Lt engines? Oh my god, how amazing is the gas on them?! I’ve gotta get one. My 2.4lt baby is a drain on me so much 😭",
              "id": 23,
              "comments": [
                {
                  "score": 0,
                  "content": "My first in the comment was a 1 litre and tbh this comment is just condescending. You have those cars too. They exist. And you know bloody well they do.",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "gasoline is far too cheap people in the US drive around in mobile living rooms and act like it's okay.  \"upgraded\" your emissions, your waste. Smaller vehicles are easier to manage, and often far cheaper to purchase, maintain, fill the gas tanks. And you can better avoid running over gardens.",
              "id": 25,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -19,
              "content": "Considering how many pedestrians are killed by people driving ever larger vehicles and the state of the climate crisis...well, it isn't a \"sin\" to get a huge car or truck, but it's a super shitty thing to do. (And no, almost no one actually needs a huge car, people around the world, including trades and labourers and people with large families, do just fine with much smaller vehicles than are the norm on the US.)",
              "id": 26,
              "comments": [
                {
                  "score": 21,
                  "content": "You don’t know me or OP. It’s not for you to decide who can buy what car and it is not a shitty thing to do. I’ll tell you what is shitty. Being judgemental and putting your goddamn plants in someone’s parking area.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -28,
              "content": "I mean, the other answer is \"don't own a car you don't know how to drive.\"",
              "id": 28,
              "comments": [
                {
                  "score": 18,
                  "content": "Did I not just explain that? You can’t tell people never to get a bigger car. You don’t automatically know exactly how to make adjustments for your next car. You have to spend some small amount of time getting used to it. Nobody is causing accidents here it’s a case of making small mistakes SUCH AS parking slightly slanted. Don’t be a tit.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "So people should never buy new cars? Or should they rent every car they plan on buying before they buy it?",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 91,
          "content": "It's a parking lot. The assholes are the people encouraging a garden in the parking lot. \n\nNTA\n\nAlso, look up the Fed Ex truck parking instructions. Should be able to find them on Youtube. Once you learn to back into a space and how to properly parallel park that thing life will be tremendously easier.",
          "id": 31,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "Maybe. But really can’t say without photos. OP’s little edit “showing” us with text characters tells us nothing really.",
          "id": 32,
          "comments": [
            {
              "score": 236,
              "content": "I haven’t a clue what OP is trying to convey with that diagram. This calls for MS Paint, minimum.",
              "id": 33,
              "comments": [
                {
                  "score": 106,
                  "content": ">This calls for MS Paint, minimum.\n\nAh, an aristocrat",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Me neither. A picture is worth a thousand words here.",
                  "id": 35,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "No. She said that the plants are planted literally inside of a grid that is in concrete meant to be a driveway. Just because there's a tiny bit of grass growing in a crack on a driveway does not mean you can plan a garden and demand people maneuver around it. They need to plant their Garden in one of the designated areas for gardens were put there driveway Garden next to their own parking spot so the inconveniences themselves and not their neighbors",
              "id": 36,
              "comments": [
                {
                  "score": 6,
                  "content": "This would have been a great learning opportunity for the kid. Teach them that if you pick a random spot to try to do something like that, others who have no idea what you're trying to do can ruin it without even realizing it.\n\nUnfortunately, it seems that the parents never learned that lesson.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 63,
          "content": "Totally NTA. Grow your garden in a sunny window, a balcony if you have one, in \"one of the small patches of dirt \\[they\\] have for planting,\" or last resort they can plant them in their own parting spot. How on earth they decided this was a good idea is on them. If the kids did it without the parents the parents should have helped them move it. If the parents did it they need to offer to trade parking spots with OP or move the garden themselves. The parents let the kids down by allowing this in the first place, not OP.",
          "id": 38,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Yeah I’ve got as soft a spot for kid projects as you can get but if there have to be limits - if the project blocks other people from using a space, it’s gotta go. Like when my daughter set up an animal shelter in my bedroom. It was fine until all my laundry baskets became dog crates and I could no longer get to my bathroom because of the adoption desk. Then I said I’m sorry but this is too much, move it or clean it up.",
          "id": 39,
          "comments": [
            {
              "score": 5,
              "content": "It's not just that. Imagine someone taking their time getting ready in the car (I have a friend that can't drive without music, even for a 30 second drive to park the car somewhere else, so he spends more time getting the music fixed than we are actually driving) meanwhile the kid comes to tend their garden. If the kid crouches behind the car for that you might not see them while backing out. So people rather need to teach their kids they should not play behind cars rather than getting angry. If the pots are too close for OP to hit them, the kid tending their graden is so as well.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "They each have assigned spots, op keeps crashing into their assigned spot that is full of pots with plants in them. It’s not common space, the spot belongs to the other renters. Op bought a car they can’t drive and continue to damage other people’s property. They even state in the story they keep going over the line. \n\nThank goodness it’s just potted plants and not their car. They would have had to get insurance involved.",
              "id": 41,
              "comments": [
                {
                  "score": 17,
                  "content": "I think you are misreading. The pots are not in the neighbors' assigned spot. They are next to OP's spot, in the general use part of the lot - the part that is not anyone's assigned space but is there for everyone to drive through as they get in and out of their spaces.",
                  "id": 42,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": ">op keeps crashing into their assigned spot that is full of pots with plants in them\n\nI don't think so, bc OP says that the neighbor got upset when OP asked them to move the garden and pots to their (the neighbor's) spot.\n\nEdit: \n>I told him to respectfully f-off and move the plants next to his parking spot. My spot is so awkward, and there is a huge car on the right, so in the dark, when in doubt I am driving over the plants as opposed to damaging the car next to me. He got really livid and we got into a huge argument.",
                  "id": 43,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Why do you keep imagining the presence of pots? Why can't you respond to the story that actually exists?",
                  "id": 44,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Its in the story why don’t you have better reading comprehension?\n\nEdit to add: 5th paragraph down",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This is the way, I do not get the other YTA posts.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "She was over the line into their spot. It says so in the story.",
          "id": 47,
          "comments": [
            {
              "score": 37,
              "content": "And if \"garden\" were an acceptable alternative usage of a goddamn parking space, that might actually mean something.",
              "id": 48,
              "comments": [
                {
                  "score": -13,
                  "content": "They each have their own space, again op says this, they can do what they want with their parking space. \n\nBuying a car you don’t have the ability to drive does not mean everyone else has to cater to you. \n\nShe’s over the line, she’s in the wrong. \n\nYTA",
                  "id": 49,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Actually no, you don't get to do \"what you want\" with a parking space just because it's assigned to you. You get to park there. That's it. It isn't just some free space for whatever you feel like.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "where does it say it's their spot??",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Where? She also says that she asked them to move the garden to their spot, but they got mad at her. \n\n>I told him to respectfully f-off and move the plants next to his parking spot. My spot is so awkward, and there is a huge car on the right, so in the dark, when in doubt I am driving over the plants as opposed to damaging the car next to me. He got really livid and we got into a huge argument.",
              "id": 52,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Maybe get the people who are angry to trade their parking spot?? What will happen in winter?? Unless you are in tropical country. It's it a condo?? If not get landlord involved.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "In that case she's in the wrong.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "they clearly have pots, use them...",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "NTA if the neighbor is so concerned he can build a raised planter bed and put it against his house. Why would a parking space be the only option here",
          "id": 56,
          "comments": [
            {
              "score": 2,
              "content": "There is literally a garden area that they decided not to use.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3719,
      "content": "NTA, why do they insist to put the plants near your spot?! If they don't get enough light at their own spot they could simply look for plants that can live with less light",
      "id": 58,
      "comments": [
        {
          "score": 2443,
          "content": "There are patches of dirt in the backyard they can plant at but apparently the gridded pavement sections them better so they can monitor growth in sun, shade, mixed etc. I understand that it’s something nice for the kids but yeah, I don’t see why this pet project is not around their parking spots but smack dab next to mine.",
          "id": 59,
          "comments": [
            {
              "score": 1431,
              "content": "Probably because you were gone, these people are trying to take advantage of you. Good on you for not being a sucker",
              "id": 60,
              "comments": [
                {
                  "score": 936,
                  "content": "Plus, if they put the plants near their spot, it’ll probably be difficult for them to park and god forbid *they* be inconvenienced!",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 169,
                  "content": "I don't think they are trying to take advantage, I just think some people forget that strangers aren't required to give a fuck about someone else's kids.",
                  "id": 62,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "NTA. I mean, if you want to really stop this, bleach over plants prevents them from growing and what not, but it’s a very nuclear option only to be used if the family tries to escalate the situation.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 95,
                      "content": "Boiling water will kill the plants without pouring chemicals into the soil.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 261,
              "content": "Nta. Have you talked with the building manager about this. There is no reason to have a garden in the parking lot",
              "id": 65,
              "comments": [
                {
                  "score": 7,
                  "content": "THIS!!!",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 259,
              "content": "Are they food plants? Cause they won’t be safe to eat that close to car exhaust.",
              "id": 67,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 155,
              "content": "Plant a garden in theirs. NTA",
              "id": 68,
              "comments": [
                {
                  "score": 153,
                  "content": "Hahahahahahaha I LOVE this! Growing up our neighbors were very obsessive about having the most beautifully manicured neighborhood in town. They got upset because we mowed too close to their property line. They had a bunch of trees put in the next day. So my dad went out and bought a bunch of plastic palm trees and put them along our property line. They were not happy 😆",
                  "id": 69,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Your dad is awesome 😎",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "That's awesome, I love when people mess with snobby neighbors! I'm all for gardening and having pride in the work you put into your own property but when you take it to the level of caring about what your neighbors do with their yard I roll my eyes. I know there are plenty of people will disagree with me but meh, I can't be bothered with what my neighbors do with their yard.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "Can they trade parking spots with you if the one assigned to them is easier to get into and then they can worry about driving around the garden?",
              "id": 72,
              "comments": [
                {
                  "score": 53,
                  "content": "No one wants because my parking spot is under a huge oak and twigs and leaves fall on the car.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 67,
                      "content": "Understandable. I would still offer the neighbor with the garden the choice- we can trade spots or I can continue to drive through your garden that is in the middle of the parking lot. Which is more important to you?\n\nHave you brought up the issue with the landlord",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 52,
                      "content": "You know what that sounds like a perfect spot for your neighbor next time he complains. I didnt suggest this at first because I thought you wouldnt want to swap parking spots but if its a bad spot anyways. Tell him either you can swap parking spots or he can move his kids project next to his own car and those are the only options. You should not have to cater to the needs of his kids when he can do so perfectly him self.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "I keep wondering if you live in Munich because this is such a Munich thing lol. A neighbor once locked her bike to my flatmates bike for days and we had to cut the lock because we didn't know who she was. She then angrily rang our door and scolded us for not asking more neighbors about her. Then a day later she came to apologize and brought vegan chocolate but still demanded it was both their fault so he has to go halfsies on the lock which ultimately was probably similar to the price of the vegan chocolate. Just Munich things I tell ya.",
                      "id": 76,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 45,
              "content": "Yeah, NTA then. Probably was convenient for them when you were gone, but now you’re back. Making adjustments for your return is on them, not you.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Do they not realize it is dangerous for kids to crawl around and inspect and tend to a garden in an actual parking lot? \n\nI guess after the first kid gets run over by a car?",
              "id": 78,
              "comments": [
                {
                  "score": 25,
                  "content": "I mean you cannot, even if you want to, enter that parking lot with any sort of speed. The entrance is tiny. I think they just let them play in the parking lot as they sit and drink at the gazebo and they have a clear view. I don’t judge them for wanting the kids out in the sun. I think it’s great if they are careful.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Quite possibly driven by OP.",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Next time they get mad, see if they want or can swap the spots. I'm sure running over their own kid's garden a few times will drive the point home.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "There should be a dedicated area of that space that is ONLY for the garden, not patches of plants in the spaces between stones where cars park.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yeah, NTA.  You could also offer to switch parking spots with someone (whose spot would work better for you).  And ask them why they don't get a community plot at a nearby park.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Not just “near”, but actually in the driveway/parking spot. OP drives/parks on a spot that is designed for driving and rain runoff control. It’s a path of concrete honeycomb blocks. That allows grass to grow in the spaces. It’s not intended for gardening. \n\nThe problem is that the neighbor’s kids are just doing WTF they want and the parent(s) are refusing to parent.",
          "id": 84,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1162,
      "content": "NTA\n\nI'll give the benefit of the doubt that it shouldn't be this difficult to park into a normal bay and placing unnecessary obstacles around that just makes it even worse. It shouldn't be difficult to park up at home.",
      "id": 85,
      "comments": [
        {
          "score": -136,
          "content": "It's sad that we live in a world where a damage to a neighbour's car will cost more than a kids' garden, but unless OP's neighbours (kids' parents) agree to cover any future damage while they try to park and protect the plants, NTA",
          "id": 86,
          "comments": [
            {
              "score": 235,
              "content": "Was there ever a world where plants cost more than car damage? Lol",
              "id": 87,
              "comments": [
                {
                  "score": 67,
                  "content": "There are plants that expensive, but no one is planting those outside. Unless we are getting into treelaw. Then that's a whole different discussion. Trees are expensive.",
                  "id": 88,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 60,
              "content": "It's sad to live in a world that makes logical sense? It's sad to live in a world where damage to a large and heavy piece of equipment that can move at high speeds is more expensive than damage to plants placed in a poor spot? \n\nI'm guessing you meant that it's sad that it makes more sense to damage the plants than the vehicle but we'll no that's not sad. All they have to do is move the plants. \n\nAnd even if the kid's parents agreed to cover any vehicle damage the judgement should still be the same, op is nta. Even with costs covered nobody is gonna put a poorly placed garden above protecting the vehicles in level of importance. \n\nThe NTA part is the only part of your comment that makes sense.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "> It's sad\n\nWhat, why? Plants literally grow on trees (etc.) and are relatively cheap. Cars, on the other hand, are manufactured tools that cost tens of thousands.",
              "id": 90,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 836,
      "content": "NTA. Why on earth would they put a garden so close to where people park? That’s just dumb. What if the kids are out there tending to the garden and get hit?",
      "id": 91,
      "comments": [
        {
          "score": 464,
          "content": "I will see the kids as my lights pass over there the minute I enter. However, it is absolutely impossible to get in the parking spot without reversing. I basically drive up to the side of my neighbours car and do a full right backwards. As I go back my front goes left and over the garden. \n\nEven with a smaller car I need like 7-8 more manoeuvres to get in my spot and avoid the garden. At 3 a.m I am more cautious with my surroundings so that’s why I usually go too far and over the plants.",
          "id": 92,
          "comments": [
            {
              "score": 109,
              "content": "Run them over. It’s your spot. I’d probably accidentally stomp on them too for good measure.",
              "id": 93,
              "comments": [
                {
                  "score": 52,
                  "content": "...you meant the plants, right?",
                  "id": 94,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Not necessarily",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 678,
      "content": "NTA.He could have put his pots near his parking lot but he persisted on putting it on your parking lot.Parking lots are not for putting plants.",
      "id": 96,
      "comments": [
        {
          "score": 58,
          "content": "It doesn't sound like they are in pots. It sounds like they planted it in the cracks/grid of the pavement.",
          "id": 97,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 476,
      "content": "NTA and they are potentially blocking you from parking. They should do their project garden in a GARDEN.",
      "id": 98,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 404,
      "content": "NTA they have no business putting their garden in the parking lot period. Report them to leasing or management if they keep harassing you.",
      "id": 99,
      "comments": [
        {
          "score": 94,
          "content": "This was my thought too. Maybe mention to management the garden and it's placement to ask if that's allowed. NTA",
          "id": 100,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 357,
      "content": "NTA it's a stupid damn place for a garden.",
      "id": 101,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 240,
      "content": "NTA that is wildly irresponsible of those parents to allow the children to put a garden in the parking lot. The least that will happen is that the plants get destroyed by being driven over. The worst is a small one tending a garden who is not visible to someone driving in. \n\nDo you own your apt or rent? Is there a building manager? I’d speak with them, because this neighbor is being unreasonable and if I owned the building I’d be worried about liability.",
      "id": 102,
      "comments": [
        {
          "score": 142,
          "content": "Own it, it’s I guess a condo then? There isn’t a manager per se, we just have meetings and decide stuff with majority votes.",
          "id": 103,
          "comments": [
            {
              "score": 120,
              "content": "Read your condo covenants and see if there is any language about leaving personal property in the parking area for more than the few minutes required to load/unload it (like if someone is moving).  If there isn't, perhaps there should be...",
              "id": 104,
              "comments": [
                {
                  "score": 23,
                  "content": "Isn’t leaving personal property in the parking area going to be allowed by default because it’s for, yknow, parking?",
                  "id": 105,
                  "comments": [
                    {
                      "score": 23,
                      "content": "LOL good point, perhaps non-vehicle property would be a better term.  No children's toys, tools, litter/trash, etc.  I'm sure the COA board could work out appropriate language.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Can you switch parking spot with this family for the summer? You're completely in the right; this is just to get them off your ass.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Do you have a board of directors?  (Owners who basically are elected to help run teh building).\n\nDunno if your building would count as condo, or co-op, both tend to be run by owners/residents via committee.\n\nI'm on my condo board, and I'll straight up tell you, parking lot/space issues are a major pain in the ass.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 169,
      "content": "NTA. No matter what they should not be leaving anything that is not a car in the parking lot. I rent in a condo building with a shared parking lot and there’s a rule that only automobiles are allowed to stay for long periods of time in that area (trying to phrase that is odd - I just mean like obviously a person can stand in the parking lot, but you cannot sit in a chair for hours). \n\nSo for my place, even if the plant pots were in their parking spot, they’d be against the rule and removed. Because it’s a driving hazard (I had looked into it because I don’t have a car and had a neighbour parking in my spot).",
      "id": 109,
      "comments": [],
      "relation": "Support"
    }
  ]
}