{
  "post content": "I (50F) have asked my family (47M, 15M, 14F) to either state beforehand if they are going to make a stinky fart or go to the bathroom to fart and then light a match after. Today at the breakfast table my husband did the thing where he leans to one side to lift a buttcheek (I assume? Actually not sure what the purpose of the leaning is) to fart loudly. Hilarious, sort of, but also gross. He does this infrequently.\n\nThis began a discussion where everyone told me that my fart rules are body shaming and not cool. They were tongue-in-cheek but also serious about the body shaming. I told them no one wants to smell surprise stinkiness (hence the announcing) which wouldn't be necessary if people would just go to the bathroom to fart (ideal). According to them, not farting loudly or stinkily in front of others is a just me thing or maybe just a UK thing (I grew up in the UK). No one has suggested that it's an on-the-spectrum thing because my family doesn't hold that over my head, but I wonder. And I honestly find it gauche to like, have a farting stance, but again, they say that's just me. Really? We live in Mexico and I haven't noticed any public farting.\n\nMy family says within the family it's fine to just fart away. Some context: I got massively told off by my in-laws in the pandemic year where we were always together for dinner for suggesting people refrain from talking with food in their mouths at the table in front of my kids, because we were trying to teach them this rule. That was true, but also I really find it disgusting when people do that. Normally we live in a different country so I suck it up when we're all together. But this was every night, so that day it became a huge fight between me and my husband where I slept on the couch for days and refused to eat at the table if we couldn't agree on what I thought was basic manners specially as an example for my kids but honestly because I hate it. My mother-in-law has ADHD and she says if she stops talking to chew she'll forget what she has to say and then she won't be able to tell us. Plus, it was her table, her house. I realise I was horrible and the lesson I learned there is to not care so hard about manners over people's feelings. (In case anyone wonders, my couch-sleeping has only happened once or twice in my marriage, it's not common).\n\nSo here we are, my family has told me they would like to fart freely in the house and my rules are nonsense. I hesitate to disagree because of the talking-with-our-mouths-full episode. I want to be lighthearted and laugh it off. But, stinky! Stinky farts! You can taste them! I think it's pretty reasonable to ask to not live in a fart zone. We (or maybe just me I guess) do have other rules like, knock before entering someone's room, say please and thank you, etc. I'm not going to list them all because of space. So reddit, am I the asshole?\n\nTLDR: I tell my family they should either say they're going to fart or go to a different room to fart. They say this rule is unreasonable. AITA?\n\nEDIT: the farting isn't constant, it's infrequent. Not daily. And it's 90% accidental which we laugh off.\n\n2nd EDIT: The rule is several years old. Possibly decades old for my husband. When I said 'I have asked' I meant, in the past, not recently.",
  "id": 1,
  "comments": [
    {
      "score": 408,
      "content": "I would say not blasting farts at the dinner table is a very reasonable request",
      "id": 2,
      "comments": [
        {
          "score": 57,
          "content": "My feelings exactly.",
          "id": 3,
          "comments": [
            {
              "score": 36,
              "content": "anyone who has enough time to set up their cheek at an angle, make a funny face and THEN fart, has enough time to go to the bathroom to fart.\n\nUnless every single person is into communal farting, then it is absolutely disgusting to spray fecal matter in the air ESPECIALLY when eating wtf?\n\nI'm 35 and my dad has never farted in front of me that I'm aware of. My brother maybe twice as a teenager did it to be a pain in the neck but even then was sheepish about it because EWWW. And we are not like a very uptight or overly polite around each other family. NOONE WANTS TO SMELL YOUR SHIT.  \n\n\nObviously if it happened by accident or someone has IBS or something and can't make it to the bathroom in time, that's fine. but to repeatedly subject people to it when they are not cool with inhaling the fecal matter repeatedly, is NOT on\n\nNTA",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "This post really feels like a joke to me. I'm having a hard time believing it's real. It's just too absurd. \"make a stinky fart\" \"you can TASTE them\" Like ? Come on? It may be bc OP is just a little blunt with phrasing, but I just..can't believe this is real.",
          "id": 5,
          "comments": [
            {
              "score": 5,
              "content": ">joke\n\nI wish I were joking. My favourite idea in this thread is to keep a can of air freshener on the table to balance the scales. But I have confidence now that I can insist on some better manners from my family and try to see the funny side as much as I can.",
              "id": 6,
              "comments": [
                {
                  "score": 3,
                  "content": "Your family sounds abnormally rude and gross for anywhere in the world based on their lack of table manners ! I mean I definitely had a blast when my 3 year old niece discovered Alexa will make fart noises and gives descriptive details about their sound....but constant stinky and loud farts at the table? That's beyond childish and immature. The same Alexa fart loving niece even at most would blow up and then push her cheeks to make a noise like a fart during a mealtime but even that would be pushing it for her. \n\nI know you said your family doesn't try and hold your diagnosis over your head but this sounds like they're deliberately trying to make you feel bad and uncomfortable which is pretty awful to do :( . Expecting someone to always leave or announce a fart is not an appropriate thing to ask in normal circumstances because people normally aren't weaponizing farts to constantly cause another family member distress like they are here. They aren't going to do it because they're purposely doing it to upset you. \n\nThe chewing thing- it's totally gross to chew with your mouth open. No matter where you are and making conscious efforts to model appropriate normal behavior and manners for your kids is totally fine. I'm an adhd talker that forgets what I'm gonna say too all the time and have found myself speaking before swallowing and you know what? I'm always mortified by it! But it's not something that's a constant habit or anything and her reason for why it's ok is just bad. She should just not say the thing or wait to take a bite. It does sound like you got a bit rigid but not spraying others with food and open mouth chewing is not a big or absurd ask. It's the bare minimum. Backpackers have more table manners than that. \n\nThe fact that your husbands family basically made you feel like you were the problem and acting awful is nonsense. , they're not nice or good people. They're not treating you with decency or respect. You deserve better",
                  "id": 7,
                  "comments": [
                    {
                      "score": 1,
                      "content": "It's not constant, and the jokey farting at the table is my husband, not my kids. I have to tell my kids it's the jokey performative farting that is the problem, not the accidental kind. As for table manners, my husband's family is very welcoming and lovely, but it is impossible to criticise them. They won't hear criticism and take it poorly. However, I can't stress enough how kind they are: when the pandemic hit we showed up with one suitcase between the four of us and they housed us for over a year, converted a room for my daughter, fed us, etc.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "You've never smelled anything potent enough you could taste it? Fart or perfume, cleaner maybe? Some of my worst pregnancy farts could probably be tasted if you had to linger long enough around and couldn't vacate the area.",
              "id": 9,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 185,
      "content": "ESH, I think your husband is being a little too loose with farting, and you are being a bit to uptight about it. Asking them not to fart at the dinner table is acceptable, asking them to only fart in the bathroom is too much.",
      "id": 10,
      "comments": [
        {
          "score": 25,
          "content": "Agreed, making a show of it is obnoxious and immature. But announcing it/going to the bathroom is too much.\n\nAlso I think you just need to let the chewing thing go at other people's houses. Enforce that rule at your own table but it's rude to tell others what to do when you're the guest (or even if they are your guest).",
          "id": 11,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "This! Also, try to work towards a compromise. I have found that when I hold a fart in when it first tries to emerge, and then let it out later very slowly and soundlessly, it stinks hardly at all. Everyone can learn this trick!",
          "id": 12,
          "comments": [
            {
              "score": 16,
              "content": "I worry that being a 'fart coach' is something I will attempt because I 100% agree with you.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Lol I have attempted to teach this to my kid because farting at school made him panic.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I disagree. Some people lack a sense of smell and it shows.",
          "id": 15,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -3,
          "content": "How is it? if you have time to go to the bathroom, the preference is always \"spread your fecal matter in the air in the bathroom\" and not anywhere else. Obviously if it slips out, that's life and no biggie but if you have time then GO TO THE BATHROOM unless every person in the room enjoys inhaling your fart.",
          "id": 16,
          "comments": [
            {
              "score": 15,
              "content": "Yeah I'm not getting up and moving in my own home just because gas has to come out. And frankly I think it's wrong if someone expects me too.",
              "id": 17,
              "comments": [
                {
                  "score": -6,
                  "content": "I think it's wrong to expect people to smell your fecal matter just because you're too lazy to take 5 steps to the bathroom,",
                  "id": 18,
                  "comments": [
                    {
                      "score": 8,
                      "content": "that's cool. we probably wouldnt be compatible living together. which is fine.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 67,
      "content": "NTA. I think not farting when someone else is eating is the BARE MINIMUM courtesy to show. It drives me bonkers when my husband sits next to me while I’m eating and farts loudly. It’s so freaking rude and disgusting. He knows now not to do it but if he starts I immediately tell him to get out of the room, he lost his privilege to be there. It is completely reasonable to ask them to leave the room. Otherwise, I hate to think of how they’ll ever keep partners once they’re old enough. People generally do not find that behavior cute or funny. ETA: farts happen, you can’t always control them, but you can try to.",
      "id": 20,
      "comments": [
        {
          "score": 15,
          "content": "\nUgh I agree. My husband will do the lean to the side and I know what’s about to happen and get so mad. If you know you’re about to fart, then can you move away from me instead of leaning to let it out?\n\nI don’t get why people feel farting is funny, and that it’s appropriate to just let rip wherever they are. My husband wouldn’t fart in front of his co-workers or parents, so why should I be subjected to it? I get you can’t alway control it or whatever, but when you are forcing them out, obviously you know one is about to happen.",
          "id": 21,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "That's what I'm trying to accomplish, for my family to at least try not to release loud and stinky farts when possible.",
          "id": 22,
          "comments": [
            {
              "score": 27,
              "content": "To the people saying they can’t control it, do you think your kids and husband would be farting at the table I’d say one of their crushes or someone they liked from school was over? Absolutely not.",
              "id": 23,
              "comments": [
                {
                  "score": 24,
                  "content": "Until reading these comments, I had no idea how many people have zero control over their buttholes.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 34,
      "content": "NTA\n\nShamelessly farting in front of others in abhorrent behavior. And calling your request body shaming is nonsense.",
      "id": 25,
      "comments": [
        {
          "score": 9,
          "content": "Thank you.",
          "id": 26,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I was raised to believe that just openly or purposeful farting in front of people is so disrespectful. NTA OP. I actually get so offended when ppl push one out in front of me especially adults. It’s just gross. I stopped being friends with someone who thought it would be funny to fart in my face while I was sitting on their couch. But I’m so fascinated by people who are so comfortable to fart",
          "id": 27,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "It’s funny behaviour actually",
          "id": 28,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 22,
      "content": "ESH. People can't always control it. They should at least try to do it in a more respectful way.",
      "id": 29,
      "comments": [
        {
          "score": 12,
          "content": "[deleted]",
          "id": 30,
          "comments": [
            {
              "score": 9,
              "content": "Not if you have IBS lol. It just comes out 😳",
              "id": 31,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 22,
      "content": "NTA.  Not gonna lie, I did giggle my ass off reading this, as I do find farts hilarious.  There's a time and place for a well-placed poot, and eating a meal isn't one of them.  It's the equivalent of shitting where you eat.  It's disgusting.  I remember one time my family and I were in an Olive Garden and my mom let one rip.  It wasn't stinky, it was just loud and the dining room was packed.  All conversation stopped and people were staring at our table.  She offered a meek \"sorry\" and we asked for our meal to go.  We were so humiliated we haven't been back to that particular Olive Garden, this was 15 years ago.",
      "id": 32,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 20,
      "content": "“Excuse me. Excuse me, all. I must announce that I am about to have an episode with flatulence!”\n\nAs funny as that would be to see, not going to happen.",
      "id": 33,
      "comments": [
        {
          "score": 11,
          "content": "Yeah I find the announcing the fart rule hilarious",
          "id": 34,
          "comments": [
            {
              "score": 6,
              "content": "Honestly it's to give me a chance to exit since they won't.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 19,
      "content": "Me and my friends started doing this really funny thing where we go I'M FARTING and then brace ourselves on the nearest furniture. Just grabbing onto the edge of the desk and holding on for dear life.\n\nMaybe this is something ya'll can look into",
      "id": 36,
      "comments": [
        {
          "score": 7,
          "content": "💀",
          "id": 37,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "[removed]",
      "id": 38,
      "comments": [
        {
          "score": 3,
          "content": "See I can understand the point that I've been socialised to react a certain way, and the rest of my family wants to live in a home where my reaction to farting is more similar to my husband's. I've tried to be chill about farting but I worry that I'm going to end up with a scale of acceptable-to-unacceptable farts and judgement-free-fart-zones in the house and I just end up being crazier and crazier. I want to be accepting but the smell is bad. And yes, my husband has some dietary restrictions he ignores that I could possibly bring up to him.",
          "id": 39,
          "comments": [
            {
              "score": 2,
              "content": "Ha ha I do know what you mean! My partner & I are chill about farts but we are not stinking out the house all the time. We chuckle when a bad one comes along. If the bad ones are too frequent to chuckle at, surely it's the smell you gotta try to address!\n\nStill, with no mean criticism intended, there probably is also something you can do, looking inwards, to find peace with things you can't *really* control, like other people's buttholes :D",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "I am so glad I read this today.",
      "id": 41,
      "comments": [],
      "relation": "Support"
    }
  ]
}