{
  "post content": "Me(24 F) has a cousin(21 F) who has a daughter(7 F) has always been self centered. She always thinks that her and her family are the most perfect family who deserves anything. I collect these little stuffed animals called Squishmellos that are very popular with kids, and I have a lot of them. This Monday our family had our annual Christmas Party, and my cousin and her kid came. Her kid automatically saw my squishmello collection as you could see inside my bedroom door when you walk through the front door. The first thing she said to me was \"Can I see your Stuffies?!\" And I wasn't going to be rude so I let her. She kept on repeting the same phrase \"I wish I had squishmellos\" but I kinda ignored it. She spent her whole time glaring at me and my Squishmellos as if she was mad or something. When it was time to leave I saw my cousins kid crying and my cousin walked up to me. Can't remember exactly what she said but it was something along the lines of \"Look, you have so many Squishmellos and my daughter has none so can you give her like 5?\" And I said \"no,sorry, I've been building this collection for awhile and I can't just give it away\" she SCOFFED and walked out with her kid. Since then I've gotten many calls from family that i am the a hole and say I should have just gaven her the stuffed animals. Am I in the wrong??",
  "id": 1,
  "comments": [
    {
      "score": 9136,
      "content": "NTA\n\nLoudly, to child, while maintaining unblinking eye contact with cousin: \n\n\"I'm sure if mommy loved you enough she would buy you ALL the Squishmellos your adorable heart deserves.\"",
      "id": 2,
      "comments": [
        {
          "score": 2976,
          "content": "I think I was just reassigned to a lower circle in hell for how hard I laughed at this!",
          "id": 3,
          "comments": [
            {
              "score": 317,
              "content": "As was I lol 😆",
              "id": 4,
              "comments": [
                {
                  "score": 205,
                  "content": "I'm in for the hell party!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 243,
                      "content": "Squishhello party, here we come! I just woke up the cat.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "At least I will be warm",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I'll bring beer",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I've picked out the cutest little handbasket!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I'll bring s'mores!!!!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "A squishmello hell party, that could be a Halloween theme party 😂",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Day late and a dollar short, but I’m all for the hell party too",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Nah, parents like that deserve that kind of response. I’ve had my kids’ second cousin try to give my kids some of their toys and my first thought is to talk to that cousin and her parents to make sure that this is an item she won’t miss and that it is ok for her to give away. And even then I’m still hesitant, because I don’t want the cousin to regret the offer.",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "I’m right there on the bus with you for that one.",
              "id": 14,
              "comments": [
                {
                  "score": 16,
                  "content": "I'll drive  the bus ..... all aboard the Hell mobile.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Beep beep",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Shotgun!",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I’m driving",
                  "id": 18,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "Sweet! Now I will have company! I've been here a lonnng time, and it gets lonely...",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "Who’s driving the bus? 99% sure we’re going to need a big one.",
              "id": 20,
              "comments": [
                {
                  "score": 9,
                  "content": "The biggest.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "We aren’t taking the bus. Handbasket transportation service!",
                  "id": 22,
                  "comments": [
                    {
                      "score": 2,
                      "content": "hear me out tho: party bus.  we can have our handbaskets ON the party bus",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "i certainly don't feel guilty for laughing at it. but then again i'm already in hell lol",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "What's even funnier is while I too was laughing very hard, part of my laughter is me asking myself \"what the hell is a squishmallows\" and trying to stop laughing so hard to Google it. All I have to say is, NTA. Squishmallows. Wow 🤣",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Right here with you on that one.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I’m on the hell bus too. But at least we can have all our squishmallows with us!",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Don't worry I've got a bus for all of us... lol'ed so hard my pets left the couch!",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "NTA. I like the me too",
              "id": 29,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 342,
          "content": "Also squishmellows are expensive there is a second hand market for these... “Adults” always devalue youth culture\n\nAsk them to buy one for her for Christmas when they see the price their heads will explode.",
          "id": 30,
          "comments": [
            {
              "score": 283,
              "content": ">“Adults” always devalue youth culture\n\nI'm in my 40s and I collect plushies.  I will never understand why people think that it's a \"children's\" thing or or that it's ok just give them to kids without even asking.\n\nWhen my first was born and my mother came to visit, she immediately grabbed one of my collection to play with the baby, in spite of the fact that the baby's toys were all in easy reach and she had to go into a different room to get it.  She then acted like I was being stupid and childish for saying \"That's mine, here play with one of their toys\" and said, \"Surely these are all for the baby now\".  Then my ex \"helpfully\" unpacked them all into the baby's room when I moved a year later, forcing me to choose between losing my massive plushie collection and breaking my child's heart.  Not one single person thought I was reasonable for being upset at either of those things.\n\nOP lock those squishmallows in a display case.  You are absolutely reasonable to pick this as your hill to die on.",
              "id": 31,
              "comments": [
                {
                  "score": 76,
                  "content": "And then you have my husband’s grandparents doing almost the opposite - they have a big box of beanie babies that they seem to think are worth money. So they let my kids play with them, but they have to be very careful. \n\nSo instead of socializing with the adults, I get to supervise 2 small kids to make sure they’re playing carefully.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 62,
                      "content": "Are they ever in for a disappointment. I used to work at a thrift store and we got so many Beanie Babies they were automatically tossed into the 50 cent bin.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 41,
                      "content": "I will never understand why collecting antique dolls (children's toys from generations ago) is an adult thing, but plushies are not. \n\nHow would they feel if you had antique teddy bears?!",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "That sounds like parenting.....",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "I'm in my 50s, and replaced a cheating husband with more Squishables than I will admit spending money on.\n\nThey are huge, soft, and NOT cheap.\n\nNo one gets to play with the toys I buy with my money.\n\nI know at least part of it is trauma, because my parents had \"interesting\" ideas about what age toys were no longer acceptable for girl children (Less than 10) vs how long boy children could have toys, so Mine all vanished.\n\nI'll never get them back, so I buy what I want now.\n\nMy bedroom door has a lock on it, and visitors are NOT allowed in that room at all. (mostly because I don't want to be mocked but still)\n\n&#x200B;\n\nHere is one for example, not cheap but lovely [Squish](https://www.squishable.com/mm5/merchant.mvc?Screen=PROD&Product_Code=squish_plague_doctor_15)",
                  "id": 36,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Oh.\n\nMy.\n\nGod.\n\nI NEED THIS.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I bought myself that plague doctor when I was sick with COVID.  He made me so happy.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Went looking for the top comment to mention the price of these things. My boyfriend has quite a few, and was looking around at some online. I thought the upfront price was expensive but the resale market is even worse.\nHe shares with our young daughter but that's his choice. He makes a pile on our bed then they jump in and make a fort but *that's his choice*\nHe decided to share his *expensive* stuffies. \nOP did not and is NTA for standing their ground. \nAlso, 7 years old and crying over someone else's things she wants... Wonder where she learned that behavior",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "You are my hero of the day.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Yasssss! I want it!",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Noooooo! Why did I have to learn about more adorable plushies! Thank you!  But also my bank account hates this!",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Why did you have to give them up?",
                  "id": 43,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "That's why he's an ex and she's not invited anymore to the house, right?",
                  "id": 44,
                  "comments": [
                    {
                      "score": 2,
                      "content": ">That's why he's an ex and she's not invited anymore to the house, right?\n\nI was too young and stupid then, but yeah this is definitely part of it and a major sore point.",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I swear if someone did this with my plushie collection..... you are an adult which means you can choose what you want to collect and do with your money. If you want to collect... I dunno what \"normal adults\" collect.... music record. Then go for it. If it's plushies or something else that's seen as a child's item.... who cares! It's your collection! It's what you like! You're the adult and it's what you choose to buy. I can't stand people who make others feel like they can't get things they enjoy under the guise of \"needing to act like an adult\". So NTA",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "[removed]",
              "id": 47,
              "comments": [
                {
                  "score": 23,
                  "content": "When I first saw 5 and below I thought it was a sporting goods store. Went in was so confused and massively disappointed.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Yes and some are more collectable than others. Like bean babies",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "When the first saw 5 below I thought it was an ice cream store. Now that was confusing and very disappointing lol",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 58,
              "content": "Costco. They always seems to have a good collection and they are usually well below what you would spend in other retail stores. Seriously. Costco for the win. \n\nhttps://www.costco.com/plush-toys.html?brand=squishmallows&refine=%7C%7CBrand_attr-Squishmallows",
              "id": 51,
              "comments": [
                {
                  "score": 23,
                  "content": "Yes! We got a set of eight mini ones for my daughter for like 20 bucks. They're Christmas decorations. She loves them. I keep finding them all over the house.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Might have to wander over - got a 3am wake-up today because her single “mushmellow” was missing. \n\nIt fell out of bed dead center on her clean floor but cool glad I hauled my pregnant ass out of bed.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "I'm jealous.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yep, my kids LOVE these and 90% came from Costco. The other 10% were gifts, LOL!",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Oh man I miss American Costco SO much!!!",
                  "id": 56,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -1,
                  "content": "[deleted]",
                  "id": 57,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Costco pro tip: you don't need a membership to use a Costco gift card.",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "The collectibles, sure. There are plenty of cute ones for kids for reasonable prices. I think the one I bought my daughter was 15ish",
              "id": 59,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "My daughter just bought 5 for friends at Target for $15 each...MSRP.",
              "id": 60,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "At the grocery store where I live and the Target near me the Squishmallows are usually 30% off. They are usually usually under $20 when I buy them.",
              "id": 61,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "I’d never heard of these so I checked on Amazon. Some go for $35! NTA!",
              "id": 62,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "$5.96 is expensive? 😂 that's how much they are in Walmart and 5 Below so I guess if you think that's expensive you might have bigger issues.",
              "id": 63,
              "comments": [
                {
                  "score": 2,
                  "content": "Have looked at the resell price for the rare or collectible versions? No. \nOkay.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yeah because little kids definitely know about that right 🙄 and pretty much none of them are rare that's just what people put in the listing so gullible people will impulse buy them thinking they got something \"rare.\"",
                      "id": 65,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 127,
          "content": "This is the way.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 93,
          "content": "If mommy didn't have you at 14 and set you up for a life of disadvantages maybe you'd have some nice things in life.",
          "id": 67,
          "comments": [
            {
              "score": 35,
              "content": "A child raising a child - should work out juuust fine.",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 35,
              "content": "I also did the math. JFC, no wonder the child is so immature for her age.",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "That's an unnecessarily cruel thing to say omg",
              "id": 70,
              "comments": [
                {
                  "score": 5,
                  "content": "[removed]",
                  "id": 71,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Yeah let's blame 14 year old",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Made me go back and check the ages. Damn.\n\nI will say though, that may explain the entitlement. The family probably circled the wagons (especially considering dad doesn't seem to be in the picture) and she got used to her family just... doing whatever she wanted/needed.\nI'm theorizing obviously but the reaction from your family members is kind of what's making me think this.",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "And a pony.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "I will use this in the future even though it will piss off all my relatives because I'm considered one of the family members that is 'doing well in life'. I can imagine them scolding me now lol.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Plus depending on the size those things aren’t cheap, even the little ones are $10-$20 each so she wanted like $100 worth of free stuffies?  I don’t think so",
          "id": 76,
          "comments": [
            {
              "score": 17,
              "content": "I got a giant hello kitty dressed as a tiger one that sells for like $60 for $30 on sale.\n\nMy partner got it for me.  I saw it and loved it but said, no, that’s silly.  He snuck back and got it.\n\nI saw a giant stuffed peep bunny at Easter and debated buying one ‘cause it was $25.  He got me one as a surprise since I spent Easter alone in a hotel while my mum was recovering in hospital from emergency heart surgery.\n\nIt’s ridiculous in a way - half of my bed is two giant plushies plus I have a body pillow and a small black bear plush that I usually am hugging when I fall asleep that was $20 at the national park service gift shop.\n\nThe plush life ain’t cheap.",
              "id": 77,
              "comments": [
                {
                  "score": 2,
                  "content": "I have Squishmallow sinclair the Avacado toast stackable. He truly is my pillow. Very comfortable. His price depending where you get him is like from $19-$100.",
                  "id": 78,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Ahhhahahaha I love this so much. Perrrrfect advice. Turn the entitled ones on each other. \n\nAlso OP NTA. Your cousin is though.",
          "id": 79,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": ">Loudly, to child, while maintaining unblinking eye contact with cousin:  \n>  \n>\"I'm sure if mommy loved you enough she would buy you ALL the Squishmellos your adorable heart deserves.\"\n\nThis is evil genius!",
          "id": 80,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Love it",
          "id": 81,
          "comments": [
            {
              "score": 50,
              "content": "Oh how I laughed! Five!!! NTA. You don't have any because mommy doesn't love you enough to buy you any.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1738,
      "content": "NTA \n\nI will end of by saying\n\nIf you spoil your child you will raise your grandchild,  if you raise your child you can spoil your grandchild.  \n\nBased on the ages I will say there must be a significant level of entitling behaviors going on.",
      "id": 83,
      "comments": [
        {
          "score": 255,
          "content": "First thing that came to mind but the parents obviously didn’t bother raising either",
          "id": 84,
          "comments": [
            {
              "score": 456,
              "content": "The first thing that came to my mind was that she was 14 when she had her child",
              "id": 85,
              "comments": [
                {
                  "score": 334,
                  "content": "Yeah I kinda feel like most people missed that part. \n\nDoesn’t change the judgement but like, am I surprised they’re both acting like children? Lol no. They practically both are children.",
                  "id": 86,
                  "comments": [
                    {
                      "score": 103,
                      "content": "According to OPs post history, OPs mother was 15 when OP was born as well.\n\nEither there is something up with this family or else we have a creative writer who is bad at math.",
                      "id": 87,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 34,
                      "content": "Exactly! What can you expect when a child has a child",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "My jaw dropped at that and I couldn't read past it.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "I've known a couple of people who got pregnant at 13.  There was a whole LOT of f'd up about those situations.  Most 13 year olds who get pregnant have a *much* older partner in that endeavor.",
                  "id": 90,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "Yah, bells went off when I read that.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Omg yes, the first thing I did was the math! I had my first kiss when I was 14. I can't imagine first; already having sex at at least 13 and second; having a baby at 14. Jezus some girls don't even have their period yet at that age. I truly wonder what the age of the father of the child is..",
                  "id": 92,
                  "comments": [
                    {
                      "score": 3,
                      "content": "ya i was super skinny as a kid/teen and so i got mine a month before I turned 14 in my second month of grade 9......i had to wait even longer to get boobs lol.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I kept reading that part thinking it was a typo.",
                  "id": 94,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "Pretty sure having a child at 14 is evidence of statutory rape. I'm not happy with blaming the victim here.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 2,
                      "content": ">. I'm not happy with blaming the victim here\n\nI didn't.",
                      "id": 96,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "My aunt and cousin are the living definition of that saying.\n\nIt's a shitshow all around, and the poor grandchild has to deal with all the fallout of having a spoiled child for a parent - so now it's multiple genrations of screwed up people not getting the childhood they need to come out healthy and functional.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 778,
      "content": "NTA . Common thread here, especially the frickin family piling on you part. The kid's a brat and so is her mom. Just tell her you'll trade 5  squishmellows for her engagement ring. No? It's too precious hahaha. Maybe they'll stop. Close and lock your bedroom door if they come over again. Kid will try to lift them if she gets a chance.\n\nEdit. Wait! Cousin is 21 with a 7 year old kid? No wonder they're both babies.",
      "id": 98,
      "comments": [
        {
          "score": 328,
          "content": "Baby at 14?? I know it happens, but my goodness.",
          "id": 99,
          "comments": [
            {
              "score": 188,
              "content": "Sometimes it happens twice in a row. I recently worked with a woman who became a grandmother at 28, when the daughter she had at 14 ALSO had a daughter at 14. And no, this was in no way a healthy family. Such a mess.",
              "id": 100,
              "comments": [
                {
                  "score": 72,
                  "content": "Oh that's just so sad :(\n\nAnd yet sex education is still insanely lacking",
                  "id": 101,
                  "comments": [
                    {
                      "score": 33,
                      "content": "You would think that at least the grandmother would have educated her daughter so that what happened to her didnt happen to her daughter...",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "That's assuming that these young girls were willing participants.\n\nThey might have been, but they also might not have been. Over a quarter of teen moms have baby daddies who are over 20. https://pubmed.ncbi.nlm.nih.gov/10227344/#:~:text=Adult%20males%20were%20fathers%20of,mothers%20aged%2013%2D14%20years.",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "I grew up near a person that was a grandmother at 30, she had 3 grandchildren, from two daughters...",
                  "id": 104,
                  "comments": [
                    {
                      "score": 8,
                      "content": "It is quite common in Europe among Roma people, kids are married off as young as early teens, sadly because they live \"in-between worlds\" they rarely have documents, institutions do not even know about them, and very rarely do we hear anything about stopping this.\nOnly heard one case in the last few years where social workers reacted, they took away a PREGNANT TWELVE YEAR OLD girl from her 16yr old husband, aparently they were engaged at 9 and 13 years old and he waited until she matured at 12!!",
                      "id": 105,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "> And no, this was in no way a healthy family.\n\nThis was redundant; it's not possible to have a healthy family with a 14 year old mother.",
                  "id": 106,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 122,
          "content": "My main question as well. What is with Reddit users having extended families that pile on them at any conflict? Mine don’t even like each other enough to become united in a petty cause.\n\nMany adults like stuffies. Others need to get over that. Nobody is ever entitled to demand another’s possessions.\n\nA big NTA.",
          "id": 107,
          "comments": [
            {
              "score": 41,
              "content": "That’s because that kind of family is the only environment where entitled assholes thrive. Most sensible people say no and put up boundaries and don’t have these kinds of problems",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "With mine they either word it in a way where the person who said no was a monster (yelling, cursing, threw a fit etc..) while painting themselves (person who actually did wrong) as the innocent victim. Or they make such a fuss everyone sides with them and tells you to do what they want just to get them to shut up and blame you for rocking the boat.",
              "id": 109,
              "comments": [
                {
                  "score": 5,
                  "content": "Ah! This actually did happen in my family with one case - my grandmother. My family was a “everything revolves around the matriarch’s navel” type. Aside from issues where she was the supposed victim, everyone else just didn’t like each other enough to unite like that.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yeah I think for posters like this the bigger problem is they are in a weird family that all gossips about each other and then gets involved in blowing up small incidents into dramas.\n\nOP needs to stop buying into it and not take these kind of  calls.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "> What is with Reddit users having extended families that pile on them at any conflict?\n\nThey don't. These stories are made up by people with active but limited imaginations. Same with all the tragic deaths at an early age.",
              "id": 112,
              "comments": [
                {
                  "score": 22,
                  "content": "The easier answer is selection bias: no one with a normal, happy family is coming onto AITA with this kind of drama. No one is going to post about their ordinary, conflict free lives. \n\nAnd yes, people do behave this way. Both sides of my family love to pull this shit. If you find it unrealistic you probably had a functioning family and I love that for you.",
                  "id": 113,
                  "comments": [
                    {
                      "score": -4,
                      "content": "Well, perhaps. The Jeremy Kyle Show had no difficulty finding life's losers to appear. I still don't believe the death rate for an instant.",
                      "id": 114,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "The lock door comment is totally true. The kid, or her mother, will steal from you now that they know what you have. Please be clear on this.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I agree also since one visiting someone  s home equal a exposition visit where you get free stuff or whatever you like that you see there?\n\n If someone  bought  this for THEIR home it's  because  they consider  it to belong there. \n\n You see something  you like get your @$$ at the store search for it and buy it. Nta op.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "The family contacting OP like that makes me wonder what twisted story the cousin is telling",
          "id": 117,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 236,
      "content": "NTA Anyone giving you crap doesn't understand these things. They are just as bad as pound puppies in the 80's and Beanie Babies in the early 2000's. They are collectible and rare. I have seen kids and adults go nuts for them. They are also expensive. Not to mention they are so freaking soft!\n\nRegardless of all of that. They are YOURS Regardless of everything else ypu have a right to keep your stuff and a right to say no to giving thwm away. If she wants her daughter to have some she can walk her butt to the store and buy some.",
      "id": 118,
      "comments": [
        {
          "score": 46,
          "content": "They're really not that expensive or rare. They have small versions at 5 Below, I just bought one for a kid's birthday party for $15 at Target. Hang on to your possessions, sure, but they're not exactly Babe Ruth baseball cards.",
          "id": 119,
          "comments": [
            {
              "score": 65,
              "content": "There are the common ones, but they also have a rareity scale. The more rare ones can be expensive. And I just spent $50 on a big one.",
              "id": 120,
              "comments": [
                {
                  "score": -49,
                  "content": "[removed]",
                  "id": 121,
                  "comments": [
                    {
                      "score": 44,
                      "content": "No, she want any 5 from OP.",
                      "id": 122,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "Why does that matter? Scarcity doesn't matter here. What matters is that they belong to someone else and the kid can't have any, let alone five.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "How do you know? Where in the post stated that the kid had chosen specific ones?",
                      "id": 124,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "It doesn't matter if they're cheap or expensive.  That child is not entitled to other people's possessions just because she's being whiny about it.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Some rare ones sell for a large amount and are limited though, thus not easy to get again..",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "True. You can find the good sized ones for $16.00-20.00 at Winners (Canadian equivalent to Tzj Maxx and Marshall’s).",
              "id": 127,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Doesn't  matter if they are common  either it s not visit  and choose what you like free from all the stuff  ffs.",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I'm in my 30s and I collect squishmallows. There's definitely some expensive ones. Also availability differences means they might sell for £5-15 in store but will sell for double or triple that online, especially if willing to mail between countries.\n\n\nThere's also a horrible scalper culture involved. Some really nasty people who will literally snatch from children.\n\n\nNTA for not giving to the kid though, in general I wouldn't give any of mine away to a child as I got them to collect. I would absolutely reward a polite child with one of their own however, which is not the case with this kid.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 175,
      "content": "NTA. She can just buy some for HER daughter. The entitlement is through the roof",
      "id": 130,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 158,
      "content": "NTA.\n\nIf the kid wants Squishmallows so bad, her mom can buy them for her. Those are yours, that you spent money on because you wanted them. She has no right to demand you give anything of yours up.\n\nAsk your family if it's cool that you take home something of theirs next time you're over at their house. It's only fair if you want it really bad and don't have one of your own, right? /s",
      "id": 131,
      "comments": [
        {
          "score": 40,
          "content": "...or 5, after all you're younger than them so they should give you stuff!",
          "id": 132,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "Right, depending on size and probably availability, 5 squishmallows could be $75-$100. Can you imagine demanding $100 from someone because they have more dollars than that and so they can spare $100 of them because now that you saw they had nice things in their house you want more nice things. Redonkulous!",
          "id": 133,
          "comments": [
            {
              "score": 29,
              "content": "In Australia a SINGLE large squishmellow sells for $60. I would have laughed the cousin out of my house",
              "id": 134,
              "comments": [
                {
                  "score": 10,
                  "content": "Well, I know what my friend should vacuum pack and stuff her suitcase with when going to visit her son and grandbabies.\n\n“Yes, these Are all personal gifts!  Not at all to be sold to offset a chunk of airfare.  Here’s my grandkids, let me tell you about them in exhaustive detail and why they deserve 10 each.”",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yes. IMHO, OP should let her family know EXACTLY what happened. What the kid did, what her mother said, and how the mother instigated a pile-on on OP from a bunch of people. We hear about these pile-ons every day and OP's family should understand this is no joke.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 101,
      "content": "Yikes, NTA.  Who just asks if they can have someone's stuff?   If you want to be nice, maybe buy them one as a Christmas present or something but that's a pretty unreasonable thing for your cousin to ask.",
      "id": 137,
      "comments": [
        {
          "score": 67,
          "content": "And who asks for 5 of someone's things?",
          "id": 138,
          "comments": [
            {
              "score": 9,
              "content": "Lol was just thinking that!",
              "id": 139,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I think they're at least $25 a piece.\n\nTalk about a hot mess.",
              "id": 140,
              "comments": [
                {
                  "score": 3,
                  "content": "I had never heard of them but some comments said upwards of 60$ depending on which one it was\n\nE: but it's just so absurd to ask for 5 of someone's things, it's absurd to ask for anyone's things TBH. Like imagine you were having someone over for dinner and afterwards they were like, I really liked that fork, give it to me. Absurd right? Now how about, I really liked that fork, give me 5 of them. Like what the fuck",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Why should OP bother to spend their money on a spoilt child? The child won't even appreciate it anyway, and will be on to the next latest thing",
          "id": 142,
          "comments": [
            {
              "score": 2,
              "content": "I'm not saying she \\*should\\*, just that it's a thing she could do if she felt bad for the kid in any way.  I don't really blame the child for wanting a toy and she didn't \\*technically\\* exhibit spoiled behavior, at least to the OP (saying she wanted a Squishmello a bunch is borderline, but she's just a kid and may have been trying to hint to mom to buy one rather than OP).  But I'm not saying OP should feel obligated to get one for her or anything.  Cousin was definitely out of line though.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I don't think it's outrageous to ask. Especially if the kid had asked for one, or if the mom had said \"hey would you consider parting with one?\" But then no is no, and a reasonable answer. Putting this on the buy wishlist for upcoming present then is the next step, not throwing a tantrum.",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "NTA, tell the Mom to go to Five below, they got them for $5. If the family is so concerned then tell them to buy them for her. Next time go over to their house and be like “I like this crockpot Aunt Helen, ok it’s mine now.” See how fast they change their tune. You did nothing wrong!",
          "id": 145,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 80,
      "content": "NTA\n\nIt’s almost Christmas, everyone upset with you can buy her one for Christmas!? And how in the hell does a 7yo not already have stuffed animals?\n\nGotta ask though, are you sure you have their ages right? Your cousin had a baby when she was 14?",
      "id": 146,
      "comments": [
        {
          "score": 35,
          "content": "No, 15, idk how but it's something to do with the birthday",
          "id": 147,
          "comments": [
            {
              "score": 29,
              "content": "If cousin was 15 when the child was born, on the baby's 1st birthday, mom would have been 16. 2nd birthday, 17..... There's no way for the kid to have already turned 7 and mom is still 21.",
              "id": 148,
              "comments": [
                {
                  "score": 3,
                  "content": "“It’s something to do with the birthday” lmaoo\n\nLove how OP dipped after this comment",
                  "id": 149,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "UNLESS kid was born february 29... and , well no it does not work either.",
                  "id": 150,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "No probably the mom is going to turn 22 in a month or so or the child just had her birthday . Example: there is an entire year between me and my bf but I turn 23 in April and he turns 24 in august so technically both 23 but he is still almost a year older",
                  "id": 151,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "[deleted]",
              "id": 152,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 58,
      "content": "NTA,  you cousin is for “tattling” to your relatives about it. Also, she’s 21 with a 7 year old? Maybe that’s why her daughter is so spoiled; your cousin was a child herself when she had her daughter.",
      "id": 153,
      "comments": [
        {
          "score": 9,
          "content": "And i suspect that cousin's flying monkeys still see her as a child and cater to her every whim...",
          "id": 154,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 29,
      "content": "NTA - What the heck is it with people who think it is totally appropriate to demand others' belongings and getting all bent out of shape when refused?  Tell the family members who think this kid is apparently going to be scarred for life without Squishmellos that they can go buy some for her themselves.  This kid and her entitled mother are old enough to learn that their wants won't hurt them.",
      "id": 155,
      "comments": [],
      "relation": "Support"
    }
  ]
}