{
  "post content": "On my birthday this year, I treated myself to 50 bucks in lottery tickets, and managed to hit one of the huge $50,000 payouts. After taxes, I had ~$34,000, so I’ve put $7,500 into my wife’s car, and put the rest into a high-interest bank account. I’m planning to switch jobs early 2020, but first, I plan to travel for the month of January and half of February across Asia and Europe. I’ve never had a proper vacation (unless you count weekend trips to Disney World for the kids) and have really wanted to take the chance to go out there and explore the world.\n\nWell yesterday my daughter Emily were talking about the job movement and the topic of the vacation came up. I told her about how I’m financing it with the lottery (she previously did not know about the winnings) and Emily went quiet before saying “instead of wasting 25 grand on a vacation, why not do something practical like maybe spend $5,000 on a vacation and help your daughter not graduate with mountain of debt”.\n\nI told her that I’d be happy to co-sign loans for her, but I was only willing to pay upwards of $10,000 of her education (the amount I promised both her and her brother when they were 13-15). She said even after paying that off, she’s looking to be at being $29,000 in debt by the time she finishes school. \n\nI told her that really sucks, but reminded her that I offered community college as an option years ago when she was applying to schools, but she insisted that she didn’t want to “miss out on the prestige” (she got into Dartmouth). I talked to her about how transferring was an option, but she ultimately picked that route.\n\nShe’s brought up how the 10k I gave Jason (my son) was enough to completely pay for college cost + some extra spending change, because he got a state scholarship that paid for 100% tuition. She argued how it’s not fair that I was essentially willing to pay all of his college but leave her with a mountain of debt.\n\nI told her that he’d be able to argue the same thing if she got more money than he did. Ultimately, the line I drew was that both children get equal amounts and I can choose how I want to spend my money, end of discussion.\n\nI thought it was over but it turns out that she went and talked to my wife Amy about it behind my back. Amy tried to “persuade” me to make it a 2-3 week vacation as opposed to the 1.5 months I had planned. I told her the same thing that I told our daughter, and then SHE then got mad and said that I’m being selfish and using all of the money that for myself (nevermind the amount I put into *her* car AND the fact that she used ALL of a $5,000 inheritance on cosmetic plastic surgery 4 years back). I told her this vacation was non-negotiable.\n\nNow I have two women in this household giving me passive aggressive looks and eyerolls. I feel like they’re both acting entitled to MY shit; am I really being unreasonable here?\n\nEDIT I'm not leaving my wife behind; she can go for 10 days. She can't take the full 1.5 months off, though.",
  "id": 1,
  "comments": [
    {
      "score": 6914,
      "content": "ESH. \n\nMight be unpopular but you win 50 grand and decide to give chump change to your wife and decide to leave behind all of your familiar obligations to go on an expensive vacation? I mean even for 1.5 months, 25 grand for a vacation is outrageous. Spending more is not going to make it better, and I think compromising with ~15 grand for the vacation is perfectly doable. \n\nThat being said, I don’t think you should be obligated to spend that on tuition. In fact, I think it’ll be unfair to your son. Put it to something for the family or maybe keep it stashed away for an emergency. But I think it’s irresponsible to spend all of that on a single vacation. \n\nYou’re not a single man. You have responsibilities and a duty to your family. You chose that life. You can’t just run away from that when it’s convenient for you.",
      "id": 2,
      "comments": [
        {
          "score": 2733,
          "content": "It was really 34 grand after taxes, and I feel like you people are missing the fact that I bought my wife a car. And prehaps I should put an edit; I don't *anticipate* spending the full 25 grand on the vacation (though I wouldn't be mad that I did); I just want to make sure I have enough to do everything I want to do and see everything I want to see",
          "id": 3,
          "comments": [
            {
              "score": 7794,
              "content": "Dude. You are NTA. It’s your money. 29k in college debt is not that much. Live your life. You’ve only got one. If you pay off your daughter’s debt, she’ll be able to afford to take trips and have fun. While you’ll be stewing at home. She’s got way more years left on this planet than you do. I’m in your shoes too. Paying for my kids tuition. Almost done. But, I said state school only. \nEveryone has what they want. Your daughter has her prestigious degree. Your son has his fully paid tuition. Your wife has her car. And, YOU finally get your trip. \nGO on that trip. Enjoy this one life. That’s all",
              "id": 4,
              "comments": [
                {
                  "score": 1871,
                  "content": "This. Sounds like the OP has done right by everyone in his family both before and after the win. Please OP, take your vacation and enjoy it.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1462,
                  "content": "Thank you!!! $29k in debt with a Dartmouth degree?!?!?!? That will disappear quickly after graduation as long as she has a decent degree!!! Depending on her course of study, some employers will pay that off for her.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 360,
                      "content": "I'm am a smaller uni in Central Kansas and $30k is what I'm going to end up with, but I'm an Accounting major and the firm I'm set up to intern with next spring has a program that helps pay off debt. Even if it's not a great debt repayment program, it'll still only take me about 10 years to pay it off with just an extra level position. I'm certain a Dartmouth degree in a decent field will take her less time to pay off than me.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Exactly. I have almost $70k in student loans but I’m pretty sure I’ll be able to pay it off easily. $29k is nothing with a Dartmouth degree. Totally NTA.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I feel like I'm missing something. How do you go to Dartmouth, financed by 10k from your father, and only have 29k in debt?",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "29k is nothing. Talk to me when you're in the 6 digits. ;-; Help....",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 547,
                  "content": "$29k is nothing. I paid that off in two and a half years (lived at home during the time, to help me pay as much back as possible). Yes, it did affect my social life a bit. However, a mere three years after paying it back I singlehandedly have a brand new car and home. The two years of busting my butt were worth it for the payoff. \n\nDo your thing, this is your daughters turn to step up.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 266,
                      "content": ">$29k is nothing. I paid that off in two and a half years (lived at home during the time, to help me pay as much back as possible). Yes, it did affect my social life a bit. However, a mere three years after paying it back I singlehandedly have a brand new car and home. The two years of busting my butt were worth it for the payoff. \n>\n>Do your thing, this is your daughters turn to step up.\n\nIt sounds like you worked really hard to lose that debt, and you deserve kudos for that for sure. But your also really fortunate that your parents lived somewhere you could get a well-paying job and that you could live with them. \n\nOne of my best friends was also able to pay off his student loans in a few years because he got a well paying job in the big city where his parents lived and they were totally okay with him moving back in with them. \n\nAnother of my closest friends makes roughly the same amount of money (nearly 6 figures) and has been out of school the same amount of time, but he is still paying off his debts. He couldn't live with his parents because his dad is straight up an abusive psychopath. His mom is only marginally bettet—they lived together for a while, but for his own mental health, it's better they don't. He pays his moms rent sometimes still.\n\nI'm incredibly fortunate that I didn't have any debt because while I did move back in with my parents after college, it was to save money to move. My parents live in a tiny town and I couldn't find anything but a job as a server, even with my degree.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "“29k is nothing”\n\n*proceeds to talk about how it took multiple years of living rent free and working your ass off to pay it off*",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 227,
                  "content": "[deleted]",
                  "id": 14,
                  "comments": [
                    {
                      "score": 389,
                      "content": "This is completely true. The wife got a boob job and a car. She’s also going on the trip with him for a week and a half. He also said he’ll probably not spend it all. Then, he’ll save the rest. Sounds completely reasonable.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 52,
                      "content": "Uhhhh it’s only technically hers if they get divorced. Which may happen in this case. But if he spends it before they do, he can do whatever tf he wants with it. \n\nAnd if they have a joint account so can his wife, but it sounds like she doesn’t have access to it. \n\nAlso, while I would support my kids, coming out if Dartmouth with only 29k in debt should allow her to clean that up in min 3 years otw she shouldn’t have gone to an ivy.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "He’s paid 10k for each of his children’s educations. He’s paid $12,500 for his wife’s cosmetic surgery and car. It doesn’t look like he’s acting like the money is just his. It looks like him taking some for himself is what the rest of the family is unused to.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 81,
                  "content": "Speaking as someone with around 90k to go, shell live. I went to private college. Dont regret it, despite the pain in the ass loans. \n\n(The bulk of my loans are grad plus, the ones you get when your stipend isnt enough to live off. Was in grad school during the worst of the recession, husband was out of work for 2 years. Whaddya gonna do? Dont get grad plus loans, kids.)",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 78,
                  "content": "Yeah 29K is nothing... not that I’m complaining to trying to pull the “I’ve got more debt straw” (I’ve chosen an expensive school to get my degree). But there’s more than enough financial aid available if you look for it and just keep trying. It’s more than manageable to pay off while living within your means.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Exactly. If it was CC debt then yeah 29k would be beastly. But the interest rates on student loans are relatively low usually. She chose to go to Dartmouth to get prestige and better job prospects. It should not be that hard to pay off 29k in student loans assuming she found a job related to her major.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "I second this. Plus has she even tried to get scholarships?? Sounds like she just wants everything handed to her, especially after finding out about your winnings. They're your winnings for your birthday and you're allowed to spoil yourself.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 37,
                      "content": "If she’s getting out of Dartmouth with $29k debt, she’s already got some healthy scholarships. Tuition is $55k a year and dorms are another 10.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "The grounds of how to spend the money is interesting. Because OP purchased the tickets for his birthday, wouldn't that mean it's his money and his choice what to do so with it. If you were to buy a family member a lottery ticket and they won, wouldn't it be kind of shitty to ask for a cut? I know OP does have an obligation to their family, but they shouldn't have to spend what is essentially a birthday gift on their child especially if it's unfair to their other child. I'm not going to make a decision I just want other people to understand OP's perspective more.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I wish I only had 29K in student loans. I’m looking at about 100K",
                  "id": 24,
                  "comments": [
                    {
                      "score": 5,
                      "content": "And that's part of the reason that I'm more interested in trades rather than something I'd have to go to college for.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "She's also coming out of Dartmouth that alone gets money",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 318,
              "content": ">I bought my wife a car\n\nNo you didn't. You used your *joint* money to gamble and then spent your *joint* gambling earnings on a bottom-tier car for her and a lavish vacation for yourself.",
              "id": 27,
              "comments": [
                {
                  "score": 195,
                  "content": "Finally someone with sense. Here you go honey I bought you a necessity. Sucks you have to work while I go away on a 1.5 month vacation with our money.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 91,
                      "content": "Yeah, I think some of the people here don’t get the obligations that come with marriage. You generally want to enjoy things together, work together, suffer together. Regardless of what he does with the money, ditching that partnership when he pleases makes me say YTA.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "It’s funny how people spin things in their mind. Crazy how powerful projection and entitlement is!",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 64,
                  "content": "How do you know it’s a joint account? Maybe they keep their money separate? If my husband WON  the lottery with HIS money it’s because HE took the time and effort to buy the ticket and win the money. Now saying that I would be thrilled if he talked to me about how to spend the win. I’d be upset if he went on vacation without me and I’d probably quit my job so I could go too (if it came down to it my boss would probably be thrilled I get to have an opportunity like that and would let me go). \nBut no not once would I say he’s selfish and needs to pay off the daughters loans. Her choice and her debt. NTA.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 33,
                      "content": "Even if they keep it separated, it doesn’t make it any less community property. It’s not about where the money is. It’s about how it’s earned.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I largely agree with you, but let's not frame gambling as time and effort lol",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "If it's winnings from a birthday gift, yeah it ain't all joint funds unless he wants it to be.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Jesus Christ, aren't you a delight.\n\nEven under the assumption (plenty of those in your comment) that it's a joint account... He spent 50 bucks on himself FOR HIS FUCKING BIRTHDAY. He lucked out, his $50 gift to himself won him 34k. \n\n\"Bottom-tier car\" \"lavish vacation for himself\" ... you sound incredibly entitled.",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "7.5k on car and 1.5 weeks of vacation for her--sounds like she's already getting over 10k out of the ~30k in winnings.  She's already approaching the 50% mark people are whining about.  Especially if you add in that she spent 5k of inheritance that according to all of you should've been 50% his too on herself alone.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Not every couple puts all their money into a joint account. Most financial advisors say to agree on an amount that's theirs jointly, and amounts that are theirs separately. \n\nAnd not everyone cares about cars. They depreciate so fast that a lot of people only want to spend the minimum on them.",
                  "id": 37,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 248,
              "content": "I agree with you. You have some to your wife, some to your kids (it doesn't matter that the kids got their money before you hit the lottery, they got $10 Grand) . Now it's your turn. I don't remember you saying it, are you taking your wife on the trip?",
              "id": 38,
              "comments": [
                {
                  "score": 171,
                  "content": "She will go for a 10-day period; she can't take off the whole 1.5 months",
                  "id": 39,
                  "comments": [
                    {
                      "score": 811,
                      "content": "I hate to say it but I'd be pissed if my husband went on a 1.5 month vacation where I could only be there for 10 days, especially spending that kind of money.",
                      "id": 40,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 180,
                      "content": "Me, I would take a few smaller trips overseas with your wife. Split up the trips so she can go too. But that's just me. Each trip being 10 or so days.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 45,
                      "content": "[deleted]",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 163,
              "content": "You are NTA. If your daughter doesn’t want to graduate with $29,000 in debt (which really isn’t all that much, my cousin graduated with over $120,000) she should get a job and start paying off her loans while she is in school. My mom is a single mom and makes just enough to pay the bills, I work and save and pay for my *own* tuition which adds up to about $40,000. If I can do it, so can she. I’m sorry but she honestly sounds a little bratty expecting you to pay up like that. \n\nIt is YOUR money. Go on your trip. I hope you have a wonderful time!",
              "id": 43,
              "comments": [
                {
                  "score": 177,
                  "content": ">which isn't really all that much\n\nNo. Let's not normalize the criminal amounts students are forced to pay to go to college.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 114,
                      "content": "$29k for 4 years at Dartmouth is more than fair and in no way criminal.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 31,
                      "content": "29k isnt a criminal amount, at all.",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "I have to disagree. 29k for a four year degree where I live is.. really cheap. When I was shopping around colleges most were between 40k-80k and that was also with my scholarships and grants. \n\nIt’s also for Dartmouth, an ivy league college. Xavier University was 80k, and it’s just a regular university.",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Nobody made her go to a prestigious school.",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Nobody forced her to go to college let alone a prestigious school. There are literally 100s of jobs that pay just as well with technical training. If you don’t believe that you’ve never called a plumber on a Sunday or the AC guy in August LOL. I get it in this society everyone thinks they need to go to college to have a great life. It helps most certainly,  but it comes at cost. Personally I think college is over priced and the education you get is third rate but it is what it is.  I did college late in life only because I had to. But I worked and went to school in the evenings and paid for it as I went. No grants, no loans so when I was done I was debt free. I sacrificed a lot but I also had a house, car, bills and all the debt that living day to day requires. So when people say things like it’s criminal. I say pick another career, if getting a degree is what you want then just know it’s coming at a cost.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Fuck banks",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 85,
              "content": "You are NTA. I don’t understand how so many kids feel their parents should pay for their school. My parents couldn’t pay for any of my school and as a result I graduated with around $48,000 in debt. I make my payment every month and that’s that. When my parents sold their home to buy a much smaller one they had money put away, a good 70,000. Not once did I feel entitled to that money. \n\nYou have her the money you agreed on and you deserve your vacation. Life is short!!! Go travel and discover a bunch of new things, try all the food, have fun. Because from what it seems like your daughter will never be satisfied with whatever help you give her so just go do it!",
              "id": 51,
              "comments": [
                {
                  "score": 5,
                  "content": "> I don’t understand how so many kids feel their parents should pay for their school.\n\nBecause the entire US financial aid system basically assumes that parents pay for their child’s undergraduate degree.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "OP don't feel bad you gave her basically 20% of your winnings, and your kids 30% each. That leaves you with a grand total of 20%. Use the money that you won to live your life how you want. 29k is less debt than most kids have after college. Your daughter is being sort of entitled. You won that money, it is your choice on where you spend it. Also, you raised her all these years and on top of that you give her 10k, and she knew she was going to have to pay off the debt somehow, I mean she couldn't have known that you were going to win the lottery. NTA you are a great father, keep doing what you do. :)",
              "id": 53,
              "comments": [
                {
                  "score": 10,
                  "content": "Not sort of entitled. Completely entitled",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "NTA. Spend the money how you want, if your daughter makes a half decent use of her ivy league education then 30 grand isn't that much to pay off. Why should you not be able to have one last hurrah I mean is your place in life to be a walking atm to your family?",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "I'm on a 6 week break travelling to Seoul, Tokyo, Taipei, Chiang Mai, and Luang Prabang. I am staying in mostly full apartment Airbnbs and hotels. I doubt I will spend 5k, nm 25k.",
              "id": 56,
              "comments": [
                {
                  "score": 12,
                  "content": "It would also be quote easy to spend 25k in a single week. It all depends on how lavish you want to be, and OP wants to be more so.",
                  "id": 57,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "Yeah but Asia is significantly more affordable (lived in Korea). OP is also going to Europe *which is where most of their money will most likely be spent.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 6,
                      "content": "You can spend $15-20k in Europe over a month but you’d have to be pretty ballin.",
                      "id": 59,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Just bring up the fact that you spent a lot of money on each of them and that they are not entitled to your winnings",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "It's your money and your dream. Go for it. The only worry you should have is how your wife feels about you being in a foreign country with out her.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 265,
          "content": "Lol his daughter is an adult who is responsible for herself. He's not obligated to pay off the debt she took on to go to the school of her choice. This is totally absurd.",
          "id": 62,
          "comments": [
            {
              "score": 86,
              "content": ">\tThat being said, I don’t think you should be obligated to spend that on tuition. In fact, I think it’ll be unfair to your son. Put it to something for the family or maybe keep it stashed away for an emergency. But I think it’s irresponsible to spend all of that on a single vacation.",
              "id": 63,
              "comments": [
                {
                  "score": 115,
                  "content": "What did the wife put into the family coffers when she got $5,000? Oh yeah she foolishly spent it all on vanity plastic surgery.",
                  "id": 64,
                  "comments": [
                    {
                      "score": 68,
                      "content": ">What did the wife put into the family coffers when she got $5,000? Oh yeah she foolishly spent it all on vanity plastic surgery.\n\nThis. Arguably he has more money, but he didn't get a say in the $5000 she got. She probably would have been pissed if he asked that she give some of that $5000 to him. Well, that works both ways. \n\nI do think that some of the money should be set aside for something he and his wife can do together, i.e. \"share,\" but he shouldn't have to give up the entire dream vacation because his daughter decided she wanted the \"prestige\" of an Ivy League school. That's all on her.",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "Technically boob reduction is considered cosmetic plastic surgery, despite it drastically helping many women. So we don't know what she had done",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 168,
          "content": "The wife put NONE of her inheritence toward anything BUT HERSELF, no duty to the family from her. Nothing went to the kids, she did not buy anything for him. The daughter KNEW she was getting $10,000, and chose one of the highest costibg colleges in the USA. The brother used his money wisely AND got scholarship so he had money after college. The wife and daughter are really entitled.",
          "id": 67,
          "comments": [
            {
              "score": 7,
              "content": "It's baffling how far you have to scroll through the comments to find this sane one. \n\nThe fact that he and his wife are helping to pay any amount of their tuition is awesome. She should feel lucky.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 153,
          "content": "How rich are you that $7,500 is chump change? Even out of $50,000 (which really only came out to $34,000), 7,500 is a solid chunk of it and very generous. I do agree that planning to spend $25,000 on a vacation is rather wasteful. That's an absolutely insane amount of money to blow on a vacation.",
          "id": 69,
          "comments": [
            {
              "score": 69,
              "content": "This dude has raised two children to adulthood, he doesn't deserve something for himself?",
              "id": 70,
              "comments": [
                {
                  "score": 13,
                  "content": "I'm not saying that he can't spend it how it wants. But to someone who has never seen that much money at once, it's just a mind boggling amount to spend on a vacation. I think I would be way too afraid to spend that kind money on anything that was just for fun like that. But it's not my money. I sincerely hope he enjoys his vacation.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 8,
                      "content": "That's fair. It's a ton of money, but considering he called 7.5k pocket change, they're probably well off to begin with.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Two kids with 10 grand in school funds each. This dude is a giving machine. Too bad he raised a vulture.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "If I had raised 2 kids and then won the lottery, I would do anything to have a month and a half of peace and quiet. Life is about exploring and adventure, and he's finally getting to do that.",
              "id": 74,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "But why? Why is it ridiculous? How is it wasteful? Hes fully raised two children. This isn't money he's spending that came out of pocket from saving for years and years? It was something he won from his birthday. He's doing something he never thought was possible for himself. Now it is. He shouldn't have to give up hopes and dreams because everyone wants to feel entitled to the money.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "As someone getting ready to retire, I think OP is being wise, not foolish, in traveling at a decently young age when his body and  mental capacity are both in good shape.\n\nI watched my parents, whose last child was born when my dad was in his fifties (pre-BC pill days), wait for their last kids to become adults and my dad to retire so they could go traveling together. Sadly, by the time that happened he was already advancing into Alzheimer’s. The plan didn’t happen.\n\nThis is an amazing opportunity for OP, at a time in his life when he can take full advantage of it. \n\nHis wife chose plastic surgery to spend her own windfall on. He gets to  choose his—which does include his wife for the amount of free time she has available.\n\nMaybe if she’d tucked that $5k away, she could have taken more time off. But she chose differently.\n\nOP is NTA here.",
              "id": 76,
              "comments": [
                {
                  "score": 3,
                  "content": "So glad to hear from someone in your position.\n\nI assumed NTA as well, but a lot of the replies here made me think I was losing my mind.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "[deleted]",
          "id": 78,
          "comments": [
            {
              "score": 4,
              "content": "I want an update in a few years if she took this vacation.",
              "id": 79,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 68,
          "content": "22% isn't chump change, it's a sizeable chunk of the winnings.",
          "id": 80,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 42,
          "content": "It sounds like he has done a pretty good job raising these kids and they are out of the house. He has given his children and wife a lot of money. I dont get why he is the asshole.\n\nEdit: You are NTA though.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "How is $7500 out of $34000 chump change?",
          "id": 82,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "\nNTA \nI disagreee, fuck that.  daughter didnt have to go straight to uni, many people do the cc trasnfer route and that is nothing to be ashamed of. She also used part of that money for a cosmetic procedure. \n\nPops also paid off wifes car  and wanted her to go on vacation too. \n\n you also make it seem like dad is a deadbeat. He gave his kids 20 grand for college!!! He also mentions they took family vacactions. How would that make him a. Deadbeat?",
          "id": 83,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "[deleted]",
          "id": 84,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3872,
      "content": "Nta . You should give your kids equal money towards college. That's fair and that's what you guys agreed on. And your wife, who got to spend 5 k of an inheritance on plastic surgery should be choosing her words more wisely . Doesn't seem fair that she got to blow all her money on what she wanted",
      "id": 85,
      "comments": [
        {
          "score": 876,
          "content": "Agree! NTA...the daughter must have forgotten that her father sacrificed having legit vacations to take the family to Disney. \n\nAnd, since OP bought himself those lottery tickets, technically, this money is part of his birthday gift and ultimately his to decide how to use.",
          "id": 86,
          "comments": [
            {
              "score": 361,
              "content": "I also don't understand the daughter's comment, $29k isn't a lot of money, and if it's a lot of money for a Dartmouth undergrad then why did she bother going there.",
              "id": 87,
              "comments": [
                {
                  "score": 401,
                  "content": "Dartmouth's on paper cost of attendance is [$76,623](https://financialaid.dartmouth.edu/cost-attendance/cost-attendance) per year. The fact that shes only going to be 29k in debt means that she's already getting substantial financial aid. 29k shouldn't really be an issue, especially if she comes out of Dartmouth with a remotely practical degree. A friend of mine went 250k in debt for Stanford (relatively similar prestige level) and cleared his debt in 3 years of working in SF.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 79,
                      "content": "Offtopic: I still can't get those numbers into my head, my whole University degree (Bachelor) costs around 70k bucks including rent and lliving expenses. And your 70k is just for one year alone...",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 103,
                  "content": "Yeah actually the daughter is so damn entitled. Has she considered, idk, WORKING to pay off debt?",
                  "id": 90,
                  "comments": [
                    {
                      "score": 45,
                      "content": "Back in my day we walked uphill both ways to go to our job at the soda fountain to pay for our degrees.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "You know, this thread is making me realise just how clueless a lot of redditors are to how financial aid works these days and just how much less American value education lol. \n\nMost financial aid packages include what we call a work study. Without it, it's typically difficult to get on-campus jobs (and wtf are you gonna get at Dartmouth other than an on-campus job.) So either, she has a work study and is working an on campus job, or she doesn't and it's near damn impossible to get one any other way. Also, work study is factored into your financial aid, so if you don't work, then you don't get that part of your tuition paid off. \n\nBeing legally required isn't the same as not being an asshole. In the first place, in my culture, you'd be considered an asshole and a failure of a parent if your child was taking loans to pay for education. Not saying that's right, but I just find it funny how Americans have such a hands-off approach with their children once they turn 18. It's like, \"ah, we love you, but not enough to care after you turn 18.\" A family is family. I would be more than willing to forfeit a vacation if a close nephew or cousin needed help. I would be more than willing to pay to help my parents out the moment they ask. That's partially because I know we're a family and that they'd do the same for me. I hope OP's has a very good plan for his retirement; I wouldn't bet on his daughter helping out too much.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I really don't understand her comment about it not being fair that her brother got a full ride. \n\nHe chose something within the means that were provided to him, she's getting exactly the same amount from her parents and it isn't their fault that she's chosen a different (more \"prestigious\") path than her bro. \n\nIf she's getting the exact same amount, that's the very definition of fair. How would it be fair to the brother that she gets more?",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Yes!  Finally I see a comment that mentions this.  This is his birthday present!  It is all his.  Anything anyone else gets is a gift from him to them that they should be grateful for.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 171,
          "content": "I agree.  OP is NTA. His daughter and his wife are both acting extremely entitled. \n\nThe wife especially is in no position to judge him. I would throw the fact that she spent her windfall on cosmetic surgery right back in her plastic, store-bought face.",
          "id": 95,
          "comments": [
            {
              "score": 6,
              "content": ">I would throw the fact that she spent her windfall on cosmetic surgery right back in her plastic, store-bought face.\n\nI mean, OP could spend it all on the divorce attorney, if you really mean that OP should make it about you they way you did there.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 148,
          "content": "Exactly. \n\nIf my dad won the lottery, I would be so happy that he used it to fulfill his dream.\n\nJesus Christ my parents worked their asses off to care for me and my siblings. \n\nIt’s OP’s money. He should treat his kids fairly (as he’s offered) and enjoy the damn money.",
          "id": 97,
          "comments": [
            {
              "score": 10,
              "content": "This. NTA",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "If you get something nice, the people who line up for their share of it are NOT YOUR FRIENDS",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "maybe OP pampered his daughter too much before, so she felt entitled for that money. \n\nI mean, thats her parents' money, and even as a father, OP must have spent money for the kids, not like he never spent for the sake of others. and the promise of his daughter going to Uni and then OP still gonna help to pay part of the tuition (fairly for both children), still stand and should not suddenly change, unless OP is the one willingly to change that.\n\nbut maybe OP also should have bring the family to a nice dinner or something to lets say, celebrate the lottery, so at least the kids felt that they got some share the lottery (in part of nice dinner or something). so they dont feel left out. I know it might sound weird, but thats how human psychology works",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "The idea of being happy for someone is too much for some people.",
              "id": 101,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "This",
          "id": 102,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2289,
      "content": "NTA. Omg, not the asshole! Please don’t give in! She decided to go to an expensive ass college to not miss out on the prestige. Even in tough times a Dartmouth degree definitely gives you a leg up on the competition.  It’s HER debt not yours. \nGoing on this trip is something you’ve wanted to do for yourself and now you have the means for it DO IT. You might never get another chance and odds are you will regret not going. \nYou are still an individual with hopes dreams goals, etc. just because you have a wife and kids doesn’t mean you have to stop doing things for yourself. You go on that trip damn it, and you enjoy it and don’t feel bad about it.",
      "id": 103,
      "comments": [
        {
          "score": 701,
          "content": "> She decided to go to an expensive ass college to not miss out on the prestige. Even in tough times a Dartmouth degree definitely gives you a leg up on the competition. It’s HER debt not yours.\n\nOP please read this\n\nThe difference in salary she'll get from being a Dartmouth grad will make up the difference over going to a community college in like 3 months\n\nYou don't live forever and if you have two kids in college you aren't exactly young. Enjoy yourself dude",
          "id": 104,
          "comments": [
            {
              "score": 154,
              "content": "Not to mention he's already covering 25% of the bill. He put some in savings and split the rest with his wife.\n\nHis daughter has a lot of years to go on a trip like this. It's not like he won the Powerball.",
              "id": 105,
              "comments": [
                {
                  "score": 9,
                  "content": "Is it 10K/year or 10/k total. Darthmouth costs like 60k/year so he's not covering 25% either way.   \nWe can't say for sure, but I'd assume that he's already paying his share per year and that she was left with \\~7k/year of loans after scholarships, grants, and her dad's contribution.",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Not to mention 29k is a pretty minuscule amount of debt when compared to the over 300k (going off their estimates) it costs to get a 4 year degree at Dartmouth. Sure the prospect of graduating with less debt is always going to be appealing, but it sounds like she’s already in a pretty great situation.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "The worst part is that shes gonna make money... but hold this against him when it comes time to put him in a home. Hes already prepared to give her a decent percentage of it. But 30 years from now, she's gonna be making 6-7 figures and say \"oh, now you want *my* money\". And it's not even close to being the same thing. \n\nAt this point if I were him, I'd say I'm buying an addition for the family house to shut everyone up, add value to his home and then embezzle some of it to go on a few vacations by myself. \"The addition costs a shit ton of money\" 6 months from now, go on a \"golf trip\" and go to Singapore for the weekend with 3k. Next year go to Vegas with 2k",
              "id": 108,
              "comments": [
                {
                  "score": 4,
                  "content": "Hopefully in 30 years she’ll have a more adult perspective.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 82,
          "content": "I really want OP to go on this trip",
          "id": 110,
          "comments": [
            {
              "score": 23,
              "content": "Me too. I’m jealous!",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I agree. I have a single mom who barely makes enough to pay our bills. She made it very clear that my college tuition was *my* responsibility. If OP’s daughter doesnt want to graduate with student debt then she needs to go get herself a job and start paying off her loans now, and stop expecting daddy to pay for everything.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Dude, that's fine but if I told my fiancee that I was going on vacation for 1.5 months and she only had 10 days off she would probably be a little steamed.",
          "id": 113,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1406,
      "content": "...I feel like this is an unneccessay conflict, honestly. As someone who's pretty well traveled: what on EARTH are you planning to do for those six weeks that will cost 25 grand? I could travel for well over a year for that kind of money. You should be able to easily finance your vacation and have money left over, that you can split between your kids or whatever. Nobody needs to be deprived of anything! I'm going with a confused ESH.",
      "id": 114,
      "comments": [
        {
          "score": 557,
          "content": "As you probably got from my post, I'm not well-traveled so I don't know how much money to expect to spend. I just want to have a big pot and be able to afford everything I want to afford",
          "id": 115,
          "comments": [
            {
              "score": 348,
              "content": "Okay. Do you want any travel tips, or do you have any questions? If you outline where you're planning on going, I might be able to give you some money-saving tips, or just ideas in general. In either case, I hope you'll have a good vacation.",
              "id": 116,
              "comments": [
                {
                  "score": 314,
                  "content": "I really need to get to working on putting together an itinerary. I know for a fact that I'm going to England for a week to visit an old high school buddy. But otherwise, I don't have any specific places in mind? Money-saving trips and things to make sure I pack would be hepful",
                  "id": 117,
                  "comments": [
                    {
                      "score": 546,
                      "content": "An itinerary is definitely a good idea! As a general, overall tip: the more you plan ahead, the more likely you are to be able to have fun. Which isn't to say that you should plan every hour of every day, that's a recipe for disaster, but actively seeking out information BEFORE you go will give you a much better idea of how long you want to spend in each place. For example, I once met someone who had planned to spend an afternoon in Rome, \"to see all the attractions,\" which, uh. Is a bit of an under-budgeted amount of time.\n\nSince you don't have anything specific in mind, here's some general stuff:\n\n\\- Tripadvisor, while bad at attractions and restaurants, is not actually a bad place to look for hotels. (Since you're a first-time traveller, I'm guessing you will want to rely on hotels rather than AirBnB or hostels?) Do remember that you DON'T need a bunch of luxuries since you'll mostly be spending time there to rest and sleep. Look for stuff that is clean and quiet, and ideally central, so you can walk everywhere. And btw - bring at least one pair of good walking shoes!\n\n\\- Get an adapter, and check the locations where you are going here, so you know what you need: [https://www.power-plugs-sockets.com/](https://www.power-plugs-sockets.com/) Do get this BEFORE you go.\n\n\\- Are you American? If so, do make sure to check if your mobile phone (cell phone?) will work overseas. A lot of them don't.\n\n\\- Also check if your credit/debit card will work. If you don't have chip + PIN, it likely won't in most of Europe.\n\n\\- Communicating in English will work in the vast majority of countries. But learn to focus on the essence of what you're asking.  DO NOT say: \"Excuse me, sorry to trouble you, I hope I'm not bothering you, but I was wondering if you could possibly point me in the direction of the City Museum for the History of the Revolution? I've heard it is somewhere around here, and it sounds really interesting, but I seem to be lost, and I'm not sure if I should go this way or that way???\" DO say: \"Sorry - Museum for the History of the Revolution?\" and point in a direction that you think it might be. A whole lot of extra words = more potential for confusion.\n\n\\- In all of Europe, and in all Asian countries where I have been, waiters do not bring the bill to the table unasked. It is considered rude here, like they're trying to get rid of you. When you want to pay, look around for the waiter who has served you, catch their eye, and raise a finger and look hopeful. This should bring them to your table, and you can ask for the bill. We're a lot less fussed about tips than you are in the US, but 5-10% will generally be appreciated.\n\n\\- Generally, err on the side of politeness, and speak at a lower volume than you'd normally do.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 236,
                      "content": "So to be clear I don't think you are an asshole at all for not giving your daughter money and I don't think you need to do anything with your money that you don't want to do.\n\nBut I do think if you are a very inexperienced traveler and have not spent much time abroad that trying to plan an entire 1.5 month vacation successfully may end up being a bigger headache than its worth. Since your money isn't going anywhere and it sounds like you can be fairly flexible with your scheduling, I would schedule a 2 week vacation first and get your feet under you with international travel - you can do one week in England and another week going to a few cities on the European continent that interest you. This will help you figure out how you operate as a solo traveler, which kinds of attractions/amenities/locations are of special interest to you, and, most importantly, will give you greater confidence.\n\nThen once you have gained all of this valuable experience you can return home and plan another longer vacation (or two!) still using the money. This will allow you to be more sure of your own interests/wants/needs when making your itinerary, which is really really important. I think if you just plan one huge 1.5 month vacation you run the risk of planning to go several places that you discover fairly quickly aren't for you, and missing out on the types of places and experiences that would have been more valuable. Also honestly it takes a specific kind of person to be able to enjoy a 1.5 month vacation, and if you haven't done much traveling before other than weekend trips you may discover that after 2-3 weeks you feel exhausted and burnt out anyway. You may be exactly the kind of person who would feel excited and energized for each day of travel in a 1.5 month period, but until you do extensive traveling (with long days of sightseeing and lots of walking) you probably can't know that for sure about yourself. \n\nI LOVE to travel, and I consider myself fairly well traveled (I have been to 19 countries so far!) but I have found that 3 weeks is around my limit before I stop enjoying myself. After 3 weeks of sleeping in hotel beds, long days of walking and sightseeing, living out of a suitcase, and having to eat restaurant food for every meal I start to get tired and homesick and the vacation is no longer as enjoyable. I am not saying you are anything like me - many people love long trips! But if you don't know your limits its a bit of a gamble to jump right into a 6 week vacation. \n\nSo I don't think you should deny yourself these vacations that you want to take, but I also would personally recommend against something this long for someone who has yet to do much international travel.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 153,
                      "content": "You set aside 25k and 6 weeks and you don't even have a second country in mind? Your family might be hurt because it seems like your priority is \"get far away alone\" and not to fulfill some lifelong dream. And I know I'll get downvotes but that would make me sad too.",
                      "id": 120,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 51,
                      "content": "Honestly, if I were in your shoes I’d hire a travel agent. How dated, I know! Yes, you could do it all yourself but you have the cash and time to make it someone else’s headache. A travel agent is experienced in dealing with unforeseen hiccups in travel as well (lost passport, hotel issues, etc) and might have industry ins that you can’t get online. Since this is your first big trip in years, it’s worth looking into, especially if your wife can only join you for part of the trip. Best of luck!",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Not the person you asked but I recommend trimming down whatever you’re packing to 1 carry on bag. Saves time in the airport and the airlines can’t lose your bag. You’ll have to do laundry (but I assume you’ll have to do so regardless). Look on YouTube for packing videos.\n\nGet global entry. Pre-check is wonderful and wherever there’s a global entry kiosk, you’ll save yourself SO much time (we’re talking waiting on line for 1h+ to 2 minutes). \n\nLook into rtw tickets, some more info [here](https://www.nomadicmatt.com/travel-tips/buying-a-rtw-ticket/). I think cheapest is probably using a third party  website like [Airtreks](https://www.airtreks.com) who mixes and matches airlines but you’ll have to play around with it. If you want a more whimsical approach, look into kayak’s explore and go by the cheapest price.\n\nAs a guy, you’ve got both more and less options. [Couchsurfing](https://www.couchsurfing.com) is an option, although there are some that might not want to host a single guy. Hostels and capsule hotels (in Japan) are also options and fairly cheap.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "NTA but definitely can travel for a lot less money with some simple planning. Check out Hostelworld.com app which is fantastic for finding places (not just hostels, but another great option is getting private rooms in a hostel which have awesome amenities including great travel advice from fellow trackers and the front desk people at hostels are usually super informed ). For 1.5 months, I think you could do Europe pretty lavishly on 5,000. Especially if you decided to stay put and just pay rent for a month. Travel smart and cheap and you will then have lonely leftover for lawn mowers and bills.  And consider taking your Wife at least for some of the trip. Set price alerts on websites like hopper and Skyscanner and then you can wait for a cheap flight opportunity (round trip from England could be as cheap as 250$ if you watch flights closely). Take public transportation instead of taxis, which is very efficient in Europe.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "Someone posted a similar response so I'll ask the same question not to take a dig but I genuinely want to know. How do you  travel for six weeks to multiple European nations for actual vacation not just traveling on a significantly less budget of 25K? I mean actually vacation style traveling not backpacking, staying in actual hotel room (even cheap rooms just so you aren't sharing a bedroom with strangers) and not living on a strict budget  for food so you get to indulge in all the local cuisine of the country you want, see the various common tourist places of that  country and being able to buy various knickknacks to bring back for family and friends and to travel at your own leisure within  reason (so not doing group travel such as contiki tour) for less than 25K?",
          "id": 124,
          "comments": [
            {
              "score": 52,
              "content": "Okay, it's late in my part of the world, so here's my bullet point version!\n\n\\- For transportation: interrail, buses and Ryanair. Do not rent a car under any circumstances, since not only is it expensive, you get additional expenses like paying for parking + tolls. Public transportation in Europe is good, fast, and reliable, and if you do your homework and look for good deals, it's also cheap.\n\n\\- For hotels: actively look for stuff that's CHEAP and clean. It's going to be no-frills, sure, but the water in the shower will be hot and the bed will be your own.  I tend to have a mental budget of €35 per night, and don't usually have problems finding something. I'm willing to pay up to €60 a night if I'm feeling fancy, but I try not to feel fancy too often.\n\n\\- Restaurants: Do your research online beforehand for cheap and good restaurants, and ask locals while there. The restaurants in the most touristy areas are overpriced and often not representative of local cuisine at all, just a touristy-fied version thereof. Some of the best and cheapest food I've ever had have been in suburban, no-signs-outside-just-a-nondescript-open-door type places. We're talking €5-10 for exquisite dinners.\n\n\\- Food in general: don't eat out for every meal, for goodness' sake! Go to the market, look around for what's fresh and in season. A picnic in a park with Roman ruins in it, eating fresh bread from the bakery, some choice cheeses and cured meats + a few fruits in season? Often a much better representation of local cuisine than the restaurants anyway.\n\n\\- In general: don't travel in the high season. Off-season is cheaper, as well as having shorter lines to attraction, and usually more liveable-with temperatures.\n\nBudgetwise, for a single traveller, I personally tend to budget around €1000 per week if I need to be careful, and up to €2000 per week if I'm being stupidly, over-the-top extravagant. (I believe the dollar and the Euro are at virtual parity these days.)  Edit: this budget applies to short-term travel, i.e. 2-8 weeks. I would expect to spend a lot less for long-term travel (6 months to a year) because then I'd rent an apartment rather than living in pay-by-the-night kind of accommodation.",
              "id": 125,
              "comments": [
                {
                  "score": 34,
                  "content": "[deleted]",
                  "id": 126,
                  "comments": [
                    {
                      "score": 15,
                      "content": "25k is outrageous, idk why people try to downplay that. Even if you spend 100$ for a room every night and eat for 50$ (which is actually really over the top) you only spend 6,2k over the 6 weeks. How on earth do you plan to throw away the remaining 19k?? Op will have at least 10k left without looking to actually save budget. Hell, people around here live fairly comfortably for an entire year with that amount of money..",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Heck, he may even decide to spring for business class airfare, because his lottery winnings are YOLO money.  For 2 people than can easily be the bulk of his $25k (even though he's not planning to spend *all* of it, just have it available just in case).  \n\nAnd since OP is going while he's between jobs, his dates are not flexible, he might be going in high season, he has to pick from available hotels that have availability.  He might even just book a tour group for some of the countries, which is convenient but usually more expensive that DIY.  \n\nHeck, I travel nicely without splurging, but if I had fuck-it money, I'm booking nicer travel and VIP access to lots of places.  If it's truly a once-in-a-lifetime vacation, I wouldn't want to spend it waiting in line.  Private tours also give a better, more immersive experience.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "But why though? like why even bother???\n\n&#x200B;\n\nI'm from the UK and im fortunate enough to be extensively travelled. (travelled all over europe, north america, asia, a bit of africa and planning a wee trip to south america soon) I trvael to the point where I spend about 2.5 months a year out of the country, just travelling.\n\n&#x200B;\n\nYeh you can do things on a budget... but really its crap. Constantly checking your assets and making sure you have enough. Worrying about where youre gonna go and what youre gonna do. Fuck it... this is a once in a lifetime opportunity for OP. Take that money and have an amazing time.\n\n&#x200B;\n\nMy tips are as follows:\n\nIf you're heading to europe. Travel is not universally good. It's very much regional. For example trains in the uk are shit, trains in germany are amazing.\n\nDont spread yourself too thin.... its a mistake many people make. You dont want to spend your entire time travelling. 6 weeks really isnt as long as you think it is. Really!\n\nTry to spend 3-4 days in each place. That way youve had at least 1-2 full days without having to dick about with travel.\n\nIn the UK, its a massively varied country and i mean massively. Accept now youre not gonna see everything. If you're here for only a week, I would suggest the following: 3 nights in Edinburgh in Scotland. Edinburgh is beautiful and magical and I can not recommend it enough, catch the train from edinburgh down to stratford upon avon for 1 night (i know said dont spread yourself too thin but this one is a wee side trip) and catch an RSC Shakespear play (if you dont like shakespear dont bother with stratford at all, but this is something I would always advise to anyone, as its always an amazing experience) and then catch the train the rest of the way to london for another 3-4 days. Then either catch a plane to Paris or take a train on the Eurotunnel.\n\n&#x200B;\n\nParis is beuatiful and worth a look and a great place to start your trip properly, its good for a 4 day stay and its the perfect note to end your wife's visit on. From all the places ive been, which is alot, the follwoing cities have stood out for me in europe:\n\n&#x200B;\n\nGhent (Belgium - a Medieval town thats virtually unchanged from its original design. If you want to see proper old european history, its definitely the place to go)\n\nBarcelona (Spain - hectic and bustling with a vibrancy that is intoxicating. The Ramblas and the sagrda familia both jump out here)\n\nRome (Italy - its rome. It's grand, its loud, its marble and historic and its utterly moving and unforgetable. The Vatican is unmissable and deeply moving and the view from the hills of rome is astounding)\n\nVenice (Italy - dont go in the height of summer or the depths of winter, people always forget Venice is basically built on a marsh and the flies and heat can be awful. If you go at the right time of year however, its beautiful and utterly unique)\n\nCapri (Italy - very very peaceful and utterly beautiful but for me it was the journey up Mount Versivurus and the trip round Pompeii; that are both really near by, that make this place truly special.)\n\nLisbon (Portugal - sophisticated and trendy. Amazing food and history. If you stay for 4 days, i would recommend taking the train on one of them for a wee day trip to see the Pena Palace - utterly amazing)\n\nThose are the main ones that moved me, but to be honest theirs so so many:\n\n&#x200B;\n\nRiga - Latvia\n\nFlorence - Italy\n\nValetta - Malta\n\nKotor - Montenegro\n\nAthens - Greece\n\nDinant - Belgium\n\nGeneva - Switzerland\n\nMetz - France\n\nBudapest - Hungary\n\n&#x200B;\n\nThis list could really just keep going.... and thats only europe.\n\n&#x200B;\n\nHonestly you need to have a really clear idea of what you want to see and commit to it, dont try and rush it. As you'll have a shit time. Pick a selection of lovely places and just go for it.\n\nGo to nice restuarants and have great food and make memories youll never forget.\n\nIn Europe, any hotels 3 stars or over will be fine. (i tend to stay in 4 star hotels personally, as I enjoy the extra stuff they have on offer, but 3 is grand).\n\n&#x200B;\n\nReally though... I wouldnt try and be frugal. Go enjoy yourself and what youve got left over, is just that... left over.\n\n&#x200B;\n\nAnyhoo have an amazing holiday. Im kinda jealous!",
                  "id": 129,
                  "comments": [
                    {
                      "score": 6,
                      "content": "The only advice I would have, especially to Americans, is that public transport, while not always perfect, Will be able to get you where you need to go. If you're going without children you WILL NOT need a car. Even in the UK, where our train service is not as good as the continent, if you are not relying on it for work it's perfectly fine (overpriced, not 100% reliable and pretty garbage service but it'll get you where you need to go no problem).",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "I would budget around $15k for a 5 week multi city/country european trip, and that would be pretty extravagant. $300/day goes a LONG way even in London. Also this is in January - February (slow tourist season) so OP's money will go ever farther.\n\nOP deserves the vacation, but would totally be TA if he went over $20k on this trip",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "[deleted]",
          "id": 132,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1301,
      "content": "NTA\n\nThe family is being unreasonable. That’s found money and it’s your found money. You should be able to do with it what you want. Your wife already got a bunch of it for her car and you’re treating your kids equally. It’s not your fault your daughter refused to go a more affordable education route or apply herself to get scholarships like your son did. It’s not selfish to want to do something for yourself if the family is perfectly taken care of.",
      "id": 133,
      "comments": [
        {
          "score": 622,
          "content": "Thank you for your judgment. I feel like a lot of the commenters honestly are kids. Wanting to treat myself for once in my life is not a crime",
          "id": 134,
          "comments": [
            {
              "score": 433,
              "content": "OP as a college student myself I wanna say : DON’T give into all these Y T A ‘s. You’ve already given your daughter money. She is being selfish right now. She knew what going to that school meant and still chose to do it. This is your money, you have every right to do something you’ve always wanted to do.",
              "id": 135,
              "comments": [
                {
                  "score": 10,
                  "content": "Just so you know, I think your comment counts as a “Y  T A” vote because the acronym is in it. Add spaces or something to counteract this",
                  "id": 136,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 208,
              "content": "I'm shocked by the amount of selfish entitlement I've seen in the comments.  You don't **owe** your adult kids a damn thing financially.  And the people claiming your wife's inheritance belongs to her while your lottery winnings belong to the family sound so unbelievably stupid that I'm embarrassed for them.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 159,
              "content": "I wish my mom won a lottery so she could treat just herself, she deserves it. No reason to believe you don't either.",
              "id": 138,
              "comments": [
                {
                  "score": 6,
                  "content": "Hell yeah! I hope my father wins the lottery, after everything he has done for us throughout our difficult lives he deserves every penny.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 86,
              "content": "I'm a kid who has more student debt than your daughter. I'd love it if my parents had your good fortune and if they were taking a trip like that, I'd just be reminding them to take lots of photos.\n\nI think your daughter will benefit from humbling herself to pay for what she believes she's entitled to.",
              "id": 140,
              "comments": [
                {
                  "score": 13,
                  "content": "Yeah, I can't imagine trying to belittle my parents for spending their money on a vacation instead of on my student loans.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Good on you. You've got a great head on your shoulders. I'd buy you a beer if I could",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 53,
              "content": "[deleted]",
              "id": 143,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "I have College debt, and I wouldnt expect my parents to pay it for me. They raised me, gave me a great childhood, and loved me. It would be extremely entitled to EXPECT them to give me their money. I went to college, I took put loans, its MY responsibility.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I'm a 54 yo woman and I think YTA.\n\nMore to the point, I think your wife does as well. You are not just planning a trip. You're planning a single fantasy while you're still married. It's a slap in the face to your spouse.\n\nJust because money is \"found\" doesn't make it all yours. You are married. For better or worse. You don't get to take a vacation from that commitment. Your wife will not forget if you do.",
              "id": 145,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "There's a line somewhere that if the best defense you can muster about your behavior is it's not technically illegal, then you're an asshole, I feel like your line about this \"not being a crime\" really punctuates that.",
              "id": 146,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Sounds like you're the kid mate",
              "id": 147,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "It's not a crime at all but the way you wrote the post and way it seems to have played out seems really unhealthy. Why are you so resentful at your family and why are they this 'eye rolling' to you?",
              "id": 148,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "It's not his money, he's married, not how it works legally.",
          "id": 149,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "Totally agree! There is already an agreement in place with the kids, and it’s not like the daughter had to go to a prestigious school. This is once in a lifetime and what a huge regret it would be if he had to miss out on it!",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "> That’s found money and it’s your found money.\n\nThere's no such thing as \"my money\" in a marriage.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1257,
      "content": "ESH - I was in NTA territory until:\n>How come with my wife's inheritance, it was 100% completely hers, but when I get something, it has to be the family's? i just think that's hypocritical at all. She refused to help buy another lawnmower when ours went out and we had shitty weeds for a month because \"she hated being an a-cup\" and went under the knife\n\nIt sounds like you and your wife generally keep money split, so keeping with your relationship norms, I think it's all yours, and you've been kind with helping out with her car (although being married, I think it's kind of expected).  I also think you've been nice with giving the kids money for school.\n\nThat said, if your finances are still in such a state that it takes a month to cover the cost of a broken lawn mower, then the plan you've got for the money is irresponsible, and you should scale back the vacation and keep a lot of the rest as an emergency fund.",
      "id": 152,
      "comments": [
        {
          "score": 419,
          "content": "Hm, didn't think about that. The third, \"Are you sure you can afford this at all?\" option. Good catch.",
          "id": 153,
          "comments": [
            {
              "score": 16,
              "content": "He did say that the surgery happened 4 years ago, so their financial situation could have easily changed.",
              "id": 154,
              "comments": [
                {
                  "score": 30,
                  "content": "Well it's still a month and a half of not working, plus the risk of changing jobs so better to be absolutely sure the money wouldn't be better spent somewhere else",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 314,
          "content": "I thought the same thing based on how little Dartmouth is charging the daughter for four years. This win sounds like a great opportunity to make smart, safe investments to start a retirement fund. They tell you not to \"spend it all in one place\" for a reason.",
          "id": 156,
          "comments": [
            {
              "score": 126,
              "content": "There’s a reason that this guy is old enough to have college-aged kids but has never been able to afford a real vacation. He also makes financial decisions like spending $50 at a time on lottery tickets. He had an opportunity to live more comfortably for the rest of his life, and instead he’s going to blow his money in less than 2 months and then make that pikachu face when the next emergency pops up that requires a rainy day fund. I think he’s making the right choice for himself by going on this vacation, but he’s also clearly an idiot who isn’t great with money to begin with.",
              "id": 157,
              "comments": [
                {
                  "score": 22,
                  "content": "Who spends $7500 on car repairs?\n\nThats like you might as well buy a new car territory what kind of car is it?",
                  "id": 158,
                  "comments": [
                    {
                      "score": 39,
                      "content": "I think he said elsewhere he bought her a new car. But in the original text it dues signs like he made repairs.\n\nI don't know, this guy clearly sucks with money and he's coming off a bit unreliable. This reeks of \"justify meeeeeeee\" kind of post. Which Reddit is *always* willing to give when it comes to money and this sub.",
                      "id": 159,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This is an underrated post",
          "id": 160,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "This is true too. Having an emergency fund never hurts but I think you should at least take some kind of vacation for yourself",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Did he remove that quote from his post or was this in a comment?\n\nEdit: Found it, it’s in a reply a couple comments down when sorting by top.",
          "id": 162,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Damn, you should go become a Judge",
          "id": 163,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 957,
      "content": "[removed]",
      "id": 164,
      "comments": [
        {
          "score": 604,
          "content": "People have a lot of complexes on Reddit, and while it's certainly possible that someone going to community college can be just as or even more successful than someone at an Ivy League school, it's silly to pretend that your opportunities are the same at community college as they are at Dartmouth.",
          "id": 165,
          "comments": [
            {
              "score": 341,
              "content": "That’s honestly the only reason I want to say Y T A on this post. I genuinely don’t care what he does with his money but he needs to check that attitude about community college vs. Dartmouth. His daughter went above and beyond accomplishing what  99% of teenagers aren’t able to do and forcing her to give that up for a measly 10k and community college is fucking bonkers.",
              "id": 166,
              "comments": [
                {
                  "score": 85,
                  "content": "I did not get the impression that's what OP was doing. He agreed on a flat rate of $10K for each child. OP's daughter argued that that covered all of her brother's tuition and only a fraction of hers, and OP responded by saying it would have covered hers if she had gone to community college. I think it's perfectly reasonable to not adjust how much you support each child based on how their tuition, and I think OP's daughter was correct to choose the school with better prestige and opportunity, despite the debt.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 20,
                      "content": "OP is a cheapskate, then.  Dartmouth is a “need blind” school, they charge based on family income.  If she’s paying any money, it’s because her family could afford to pay.  The fact that she has any debt means that they can afford it but refuse to pay.  Ick.",
                      "id": 168,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 152,
              "content": "When you get to that level of ivy it stops being so much about the education and becomes more about the connections you’ll make. They’ve done studies on this. Instead of giving his kid the opportunity for an amazing leg-up in life, one that could make it so his kid has a much better life, he’s gonna go on a vacation. \n\nWhy even have kids if you don’t want the best for them?\n\nEdit: a lot of comments saying kids should take care of themselves, and that 30k isn’t that much debt to be saddled with... it’s insane what we’ve normalized. Think about what you’re saying. Christ. \n\nI repeat: why even have kids if you don’t want the best for them?",
              "id": 169,
              "comments": [
                {
                  "score": 20,
                  "content": "I know right! Having a holiday makes sense but spending that much for that long of a holiday feels almost greedy when his own daughter is going to be in crippling college debt. Sure have the holiday but maybe spare *some* for your child’s future. YTA.",
                  "id": 170,
                  "comments": [
                    {
                      "score": 9,
                      "content": "That's not exactly \"crippling\" debt. That should be a cake walk with an Ivy league degree. He has already spared some.",
                      "id": 171,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "But she’s still going to go to Dartmouth. Her admission is not reliant on her paying her tuition that day and 29k for a Dartmouth degree is CHEAP as fuck. With the salary she’ll be making, she’ll be able to pay that off.",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Well his daughter has a degree from a prestigious university and her debt isn't that high, I know people with $150k debt from college. She will pay that off fairly quickly with a good job she'll get from having that prestigious degree. She is not going to be crippled by this debt, she is going to be fine, she was planning to pay it off anyway. OP has won this money he got as a birthday present for himself and if he uses it to go on vacation no one in his family is worse off, and he gets to do something for himself. I don't see the problem. I would get it if he'd won a million and refused to help her out, I'd get it if she needed some kind of medical procedure or operation to fix some health condition and he decided to spend it on a vacation instead, or maybe even if she was struggling with fertility and desperate for IVF or something. But having debt from college is just normal, it's what they were all expecting from early on, and it's not such a huge debt that it's going to cripple her standard of living. People get cars for that amount of money on medium salaries and pay it off over 5 years no problem.\n\nI guess I just can't imagine asking my parents for this if I were in the same boat as OP's daughter. My parents contributed to my education, everything extra I wanted to do to give myself a leg up, like going somewhere to study that's more expensive, a masters and a PhD, I paid for myself through loans and work. It's just part of making decisions for yourself and taking responsibility for your own life. Yes parents are responsible to a point, and OP gave her money for her education. If my Dad won $30k on the lottery I'd not think of asking him for a chunk of it for my own debt I came into through my own choices. I made those choices because they were beneficial to me, weighing up the pros and cons of great degrees vs debt. My Dad doesn't owe me for those choices, just as OP doesn't owe his daughter.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 105,
              "content": "Lol as someone who went the community college route let me tell anyone who thinks it opens the same doors. It does not. My husband did the same thing I did. He’s got a degree in electrical engineering. His first 2 job offers were for $12 and $15/ hour. He thought they were joking. I got my first post college job because of the full time job I maintained during college. They didn’t care what degree I had, they liked that I had experience working in a difficult, fast paced, professional environment. I have a degree in finance but I work in another industry entirely. None of the jobs I applied for within my industry were interested in me or my unimpressive state college degree...",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "The fact that he belittles his daughter's achievement so casually is mind-boggling. Telling her that she \"can just go to community college\" is a huge slap to the face.",
              "id": 175,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 415,
          "content": "It's actually insane that this comment is so far down. What kind of parent cares so little about his children's success that he suggests community college over ivey league? It's mind boggling. Why have kids at all?",
          "id": 176,
          "comments": [
            {
              "score": 223,
              "content": "[removed]",
              "id": 177,
              "comments": [
                {
                  "score": 126,
                  "content": "Honestly, he's probably the type who in like 20 years is going to go to his daughter asking for money and will try to guilt her about how he paid for her college and all her achievements are because of him.",
                  "id": 178,
                  "comments": [
                    {
                      "score": 20,
                      "content": "[deleted]",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I got that feeling too. Source - my life. Lol.",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "People are extrapolating a lot from this that isn't there. \n\nThe man hasn't had a holiday his whole adult life. Let him live",
                      "id": 181,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "A LOT of Americans think this way. Once the kid is 18, they're left to figure it out on their own. And that's where students rack up tons of debt from student loans with ridiculous rates.",
              "id": 182,
              "comments": [
                {
                  "score": 5,
                  "content": "Fantastic system, really. Rich white Americans do everything in power to transfer as much wealth and influence to the newer generation while also ingraining the middle class with the whole \"once they're 18, they're not your responsibiloty\". Great way to keep the class divide lol",
                  "id": 183,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 285,
          "content": "Omg thank you for saying this. My head is spinning reading all of these posts saying that his daughter has no right to his help. And the community college thing is mind boggingly.",
          "id": 184,
          "comments": [
            {
              "score": 137,
              "content": "[removed]",
              "id": 185,
              "comments": [
                {
                  "score": 241,
                  "content": "It's such a weird family dynamic. How on earth can you be married with kids and think a $50,000 lottery win is just yours? And he rationalizes it by saying he bought the winning ticket with his birthday money. He sounds like a 5 year old.",
                  "id": 186,
                  "comments": [
                    {
                      "score": 111,
                      "content": "Thank you!! Married for approx ~20yrs and this is how he’s acting with a windfall?? I’m not sure if it’s a situation where money brings out the worst in everyone or, is this really the way some married couples manage their finances...",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 60,
                      "content": "Right?\n\nI read one excuse of his saying that his wife did whatever she wanted with her inheritance. Ok, but that doesn’t make it acceptable. It just makes both of them assholes.\n\nAnd also, who the fuck resents their kid for getting into Dartmouth?? “This smart as fuck spawn of mine got into an Ivy League school, so I’m going to suggest COMMUNITY COLLEGE as an alternative.” What the absolute fuck.",
                      "id": 188,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Right?!? He sounds terribly childish. First of all why would you spend all of it... all of it. 100 percent of your lotto winnings... why. Next, obviously he should share that money with his woman that’s what you do with your life partner. If you don’t think it would be more fun to spend together... then why are you even together...?\n\nI mean, I feel like he already did his kids pretty good: that debt doesn’t sound so bad with a Dartmouth degree and he gave them a great head start. But yeah if the poor smart hardworking kid asked for some of it he should totally throw a few bucks her way.\n\nOh and take off for an extended vacation by yourself. Just leave the wife at home for a month or so. Like what?? \n\nThis guy has no priorities from the setup.",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "THANK YOU!!! His daughter is his own flesh and blood; you can't hang them out to dry. Family members are not to be treated as business people. The daughter is totally justified for how she feels because her brother made greater use of the $10K while she's still under $29K. Mark my words, but this is going to be a point of sore contention for the rest of OP's life, because even if the daughter makes bank with a degree from Dartmouth, she will remember that her father wasn't there when she needs him the most.",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "> It is really crazy lmao like this is his daughter not some random asking for charity.\n\nShe's asking for the father to deposit 29k into her bank account. She's not going to starve because of a 29k debt, she's not going to have her degree revoked because of a 29k debt.\n\nShe just wants to have more money. That's it.",
                  "id": 191,
                  "comments": [
                    {
                      "score": 3,
                      "content": "No where does it say she asked for $29k. It doesn't even sound like he has $29k left anyways after the car.",
                      "id": 192,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Not to mention all the people thinking she's just pretentious/just wants the prestige of Dartmouth. I'll bet every red cent I will ever make, these same people would have been ecstatic if they were accepted into an Ivy League.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "not to mention that shes probably already covered a ton in scholarships she wouldve lost going to community college if 50k will pay her way through school. i doubt that covers even a full year of full tuition at dartmouth",
              "id": 194,
              "comments": [
                {
                  "score": 22,
                  "content": "Someone else made a really good post about all the connections she'll make and how invaluable that is. I don't think he understands what any of it means, so instead of making an effort he demeans it, and a lot of people in this thread are doing it too, saying the daughter is \"hung up on the prestige\" lol wtf does that even mean?",
                  "id": 195,
                  "comments": [
                    {
                      "score": 13,
                      "content": "[deleted]",
                      "id": 196,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "How dare his daughter think she’s entitled to that money when she chose a prestigious college that is extremely difficult to be accepted to over a community college. How dare she. What a loser.",
              "id": 197,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 224,
          "content": "I honnestly find this situation so mind-boggling. What kind of parent would suggest their daughter turn down the opportunity to go to one of the most prestigious schools in the US instead of being proud of her for getting in? Community college is great for saving money but the opportunities are available are not comparable to those at an Ivy League and there's no guarantee she could get in if she applied again. \n\nMaybe I am biased because I'm asian and the cultural norm is to pay for your children's college (or as much of it as you can), but I really don't understand why a parent would be willing to let their child go into debt when they have the means to pay for it.",
          "id": 198,
          "comments": [
            {
              "score": 74,
              "content": "[removed]",
              "id": 199,
              "comments": [
                {
                  "score": 46,
                  "content": "Asian kids read this post and are like... uh, what?",
                  "id": 200,
                  "comments": [
                    {
                      "score": 16,
                      "content": "\\+1\n\nI'm Indian so not technically asian but what the fuck dude. American family dynamics shake me up everytime I see posts like these.",
                      "id": 201,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Am Asian. Can confirm. Over here it's pretty much expected for the parents to pay for their children's college education. I mean OP is the one that brought her into this world, and yet he wants her to suffer for years while he himself goes out enjoying himself IN EXCESS? \n\nAnd these people are saying he's NTA? Wth is wrong with these westerners?",
                      "id": 202,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "as an Asian kid, I totally had that reaction",
                      "id": 203,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 40,
              "content": "And he’s *salty* she didn’t choose the community college.",
              "id": 204,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I'm Asian and if I can't afford to help all of my kids go to university, I'm not having that many kids",
              "id": 205,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Same I'm Asian too and the one thing my dad said to me that I will also do for my children is that ANYTHING related to learning and education he will do whatever it takes to help me pay for it. Without him I probably would've never been able to afford flight lessons, become an airline pilot, and buy my own house without drowning in debt. Honestly after reading most of these comments it's hard to believe these people love their children. I'd be willing to work myself to death to ensure my children have the best chance at a successful life.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I'm Asian too, but I have the opposite perspective. My parents busted their ass for most of their lives to provide for my sister and me. They always put our needs above theirs, to the point it was affecting their health. Despite their hard work, they were still too poor to pay for college. They took out some loans to help me get through the first couple years, and I took on student loans to cover the rest. I haven't asked them for a dime since I was 20, and I've financed my grad school, study abroad, and my wedding completely on my own. \n\nIf my parents won the lottery, I would absolutely have wanted them to use it on themselves. Pay off the car and house, and then go on a crazy trip. I wouldn't have felt entitled to any of it, I would have been happy they had the opportunity to do something fun for themselves, and I would have encouraged them to go wild. \n\nNow that they're retired, they're finally taking some trips, and I couldn't be happier for them. My dad hadn't been home to visit his family since he immigrated to the US nearly 40 years ago. I just wish they could've enjoyed them earlier, since they're pretty elderly now.",
              "id": 207,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "OP doesn’t say his race, but he sounds super white.  My family is like this too.  Very much a “you think you’re better than me?” attitude towards kids being more successful than the parents.  Literally, when I said I wanted to go to a better school it was taken as an insult and I was yelled at because other people in my family had gone to the state school.\n\nTo be honest, I think this is some kind of “white privilege” thing where for generations white people just got used to being picked first for everything, even if they were less qualified.  Their minds get blown by the concept that we now need to work to compete.  (Even though privilege still exists, it’s sure not like it used to be, which is of course a good thing.)",
              "id": 208,
              "comments": [
                {
                  "score": 5,
                  "content": "I think it's less that and the entire aspect of individualism is thrusted a but too deeply in American cultures.\n\nI've read so many stories about parents kicking kids out when they're 18 or asking for rent. I get everyone's financial situation not being the best, but that's just ridiculous. I don't wanna call it better relationships with the parents, but the sense of loyalty to family is definitely higher in Asian cultures than what I've seen from in white families",
                  "id": 209,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "Thank you!! Can’t believe how long it took me to find a comment with this sentiment. What is up with people feeling like they don’t owe their kids anything?? You chose to have a child, you are their parent, you owe them. Technically I guess you can put yourself first, but it still makes you a huge asshole.",
          "id": 210,
          "comments": [
            {
              "score": 17,
              "content": "Thank you. As the child of narcissistic parents, I can’t tell you how hurtful it is to watch your own mother and/or father not make sacrifices for their children. Because of “the expense”, my parents passed on getting me braces, passed on getting my nose fixed when I broke it as a toddler, plus many other things all while I watched them spend thousands on vacations every other year. They also happily paid for my older sister to get braces and spent $1500 when she was a senior in high school to go on a vacation to Paris. We’re less than two years apart so it’s not like there was any big financial changes, either. I’m 25 now and it still hurts to look back on. \n\nIt’s not like your daughter is demanding a car, or extra money like her brother got. Yes you would technically be putting more money towards her but the end result is the same: no debt. She will never see a dime of that money. In a perfect world I don’t think any kid should have to basically be punished for wanting to get the best possible education. I had to transfer to a state school away from my dream school after my freshman year because of the cost, and I was absolutely heartbroken. I’m still sad and feel like I missed out on tapping into my true potential. \n\nOP I wish I could sympathize with you, but I can’t. After being on the receiving end of being a lower priority than your parents I can’t even fathom the vacation crossing my mind in the first place. I think my immediate reaction would be “oh man I can’t wait to help out my wife/son/daughter with all this extra money!”, not “I can’t wait to treat myself!” I think you have to give up that mindset when you have children. Like, personally I would be much happier spreading my newfound wealth with the ones I love and then making the best of whatever is left over. \n\nOP I think you need to step back from all these comments, your perspective, your wife’s perspective, and just look at it simply: how would you feel if you were in your daughter’s shoes? Looking back in 30 years, will you think you did everything you possibly could to set your children up for success? Would you think of yourself as an exemplary parent who always prioritized their family over themselves? \n\nI don’t think the vacation is worth it. I think (hopefully, if you have a conscience) you’d end up feeling some degree of guilt because of hurting your daughters feelings, and it’s also very possible it could irrevocably damage your relationship. There’s nothing wrong with saying \n“You know what, I think you make a great point. I want you to have the same opportunities post-grad that your brother was able to have and that includes being debt-free. I do want to do some traveling but ultimately I always want to put my family first.”\n\nIt’s okay to be wrong sometimes, and what makes you a better person is admitting it and learning from it. Don’t be afraid to entertain the idea that you aren’t totally in the right, because being willing to take a good look at yourself and take constructive criticism is how you continue to grow. Bottom line: YTA. I wish there was a nicer way to say that haha but it just means that while I think it’s totally understandable to be excited at the possibility of spending this new money on yourself, I firmly believe that the people you love should always come first.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Lol you owe them in the context that you should provide well for them. Make sure they are living well and can be successful in life.  \n\nYou don’t owe them everything in the world. He is helping her pay for college. He raised her and provided for her for 2 decades. \n\nSorry that literally everything isn’t handed directly to her and she has to work and take loans like the other 90%+ of students who go to out of State, IVY LEAGUE colleges. \n\nJesus it seems like all these comments that say/agree with YTA are entitled little kids who think that their parents have to give them everything in the world, just because they had a kid. \n\nIf you’re being provided for and are living a decent life, then the dad is doing fine with the amount of money he has given. \n\nDebt after college is normal in the US and she will have no problem dealing with that debt when she has an Ivy League degree..",
              "id": 212,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 123,
          "content": "I agree! The way he minimized the accomplishment his daughter made by getting into this insanely prestigious school, even going as far as trying to get her to turn down acceptance and go to COMMUNITY COLLEGE, is wild. What were the first 18 years of her life for if not, in part, working towards this goal? If you think so little of her success as an academic that you can’t slice $5k off this ridiculous vacation plan and take a shorter trip to “England and...???? Somewhere else!” then it does kind of say a bit about you as a parent. Also all the people saying she should have worked while in school or tried to get scholarships clearly don’t understand how difficult that is at an IVY LEAGUE SCHOOL. Jfc this sub is like the twilight zone sometimes.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "This is what poor folks do. I'm not hating...these are basically my people. Ivy league education holds minimal currency. Every windfall is immediately squandered. \n\nThe give away here is that this whole thing is  over a lottery ticket.",
          "id": 214,
          "comments": [
            {
              "score": 5,
              "content": "I believe Dartmouth waives tuition fees and is free if your family makes less than $60k so they are probably not, like, poor poor.",
              "id": 215,
              "comments": [
                {
                  "score": 20,
                  "content": "That's why her debt is basically nothing. Seriously $29k is America for an ivy league education *is* winning the lottery.",
                  "id": 216,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "100k actually. \n\nOP's daughter took 30k in loans, which FAFSA believes her family's contribution should have been. Darthmouth covers all costs beyond FAFSA expected contribution.",
                  "id": 217,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 37,
          "content": "Totally agree, hes acting like a single man. What wife/family is happy with their husband just off and leaving for 1.5 months? Hes totally the asshole here, all the “mine, mine, mine” complex is gross",
          "id": 218,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "He was trying to SHAME his daughter into going to community college over Dartmouth. WTF?\n\nHe is also planning a 25K vacation and has no idea where he wants to go. It sounds like he’s planning a trip to reach his budget rather than a trip to reach his dream. \n\nHe’s going to blow through this money so quick while his daughter turns down grad school so she can earn a salary.\n\nSad.",
          "id": 219,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "It gets even worse when you read some of his comments. He literally has no actual trip planned, just knowing that he wants to go to England for a week. He just wants to keep the $30k+ because he has no idea how much he’ll spend. Like you could easily take a nice 6-week vacation and have plenty left over.",
          "id": 220,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 681,
      "content": "Yeah YTA.  The more you wrote, the more clear it became.\n\n> they’re both acting entitled to MY shit \n\nThat's not really a thing in marriage.  The money you spent buying the lottery tickets was family money, and so is the jackpot you lucked into.    The fact that you won't even consider a compromise is mind-boggling.",
      "id": 221,
      "comments": [
        {
          "score": 265,
          "content": "How come with my wife's inheritance, it was 100% completely hers, but when I get something, it has to be the family's? i just think that's hypocritical at all. She refused to help buy another lawnmower when ours went out and we had shitty weeds for a month because \"she hated being an a-cup\" and went under the knife",
          "id": 222,
          "comments": [
            {
              "score": 490,
              "content": "Legally speaking an inheritance is separate property and lottery winnings are marital property (even in non-community property states. If tour wife filed for divorce today she would get 1/2 the lottery money. That means you are spending some of her money on your trip. \n\nAre you factoring in the income you would have earned working for the 1.5 months in the cost of the vacation?",
              "id": 223,
              "comments": [
                {
                  "score": 170,
                  "content": "Legality aside, I guarantee you it would be a different story if he inherited money and spent it all on himself.",
                  "id": 224,
                  "comments": [
                    {
                      "score": 186,
                      "content": "Her inheritance was 10x less money.\n\nKinda changes things.",
                      "id": 225,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 166,
              "content": "Because a inheritance usually comes from HER personal side of the family. If she wants bigger boobs with the money she was handed from her family, then thats how she gets to spend her money. \n\nYou GAMBLED with your family’s shared money and got lucky.",
              "id": 226,
              "comments": [
                {
                  "score": 303,
                  "content": "You can capitalize gambling like it means what I did was irresponsible, but no, I spent the personal cash that I've set aside for personal use (as my wife and I get the same budget) and used that on my *birthday* to treat myself. So for all intents in purposes, I gambled with *my* money",
                  "id": 227,
                  "comments": [
                    {
                      "score": 215,
                      "content": "All of this is nonsense. Spend YOUR money on what you want.",
                      "id": 228,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "Yea, ignore this OP. There are always going to be entitled people in this world who see something nice and think it should be there’s. You’re already not keeping 100% of your winnings. If people can justify inheritance as personal money separately from the family then so is this. Go on your trip. Live your one life. And whatever you don’t spend after 6 weeks invest back into your family somehow.",
                      "id": 229,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 91,
                  "content": "Spoken like an entitled non-breadwinner.  \n\nSo, the inheritance is all hers but a gambling windfall (that was a birthday gift) isn't?  Reaks of self-serving double-standards.",
                  "id": 230,
                  "comments": [
                    {
                      "score": 54,
                      "content": "Unfortunately if they were going through a divorce that's most likely how it would be seen.",
                      "id": 231,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 53,
                  "content": ">You GAMBLED with your family’s shared money \n\nBullshit.  You don't know this for certain. Plenty of married couples maintain separate finances.\n\nOnce the shared bills are paid any additional monies earned belongs to the person who earned it.",
                  "id": 232,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Not to mention it was $50 in birthday money. Everyone who keeps posting that is basically saying he can't celebrate his birthday.",
                      "id": 233,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Legally it doesn’t matter what money he used. Even if he used property that was legally separate, the winnings would still be community/marital property. His separate property would only be entitled to reimbursement for the initial “investment,” if that.",
                      "id": 234,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Yes but this couple can't figure out how to  buy a 200 dollar lawn mower when they need it... I don't think they're financially responsible at all",
                      "id": 235,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "It’s mind-boggling you don’t see the hypocrisy here",
                  "id": 236,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 99,
              "content": "I'm not taking any position on what happened with the inheritance, but inheritances are generally considered and legally characterized as separate property -- not shared -- while other money coming into a household is considered shared.\n\nIf you can demonstrate you bought those lottery tickets with money you inherited, that's another discussion.  You'd still be a massive asshole, but at least you wouldn't be on totally hollow ground.",
              "id": 237,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 19,
              "content": "Do you like your family? Bc you don’t sound like you like your family. You’re being super harsh on your daughter and wife",
              "id": 238,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "So you're both assholes. Feel sorry for your kids. At least they both turned out all right, smart and hardworking. You should be saving up that lottery money for your future nursing home instead of blowing it on a vacation, coz you sure as hell won't be getting any help from your kids.",
              "id": 239,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "At the risk of sounding misogynistic, you have to be getting *some* benefit from the procedure.\n\nSounds like your whole family needs to work on your finances in general. She put the surgery before a lawnmower, you put a vacation before your kids' education, daughter thinks $29k of debt is bad with a degree from Dartmouth...",
              "id": 240,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "That’s sooo selfish. I can’t even fathom. I think I’m starting to see why you’re ok with family not coming along the whole time.",
              "id": 241,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "At this point your thoughts about the rightfulness of the situation is correct from your perspective only because it’s matches how your family has developed and not because it’s actually a healthy decision for a normal and healthy marriage. I honestly feel there are some deeper problems here in your relationship. There seems to be an environment of selfishness built by both you and your wife. I’ve never understood how people in a “healthy” relationship could keep their lives so separate and say things like this money is mine, etc. It seems unhealthy to me to be gone on a vacation from your wife for that much time and also unnecessary. Why not go on vacation for the same time as your wife and save the money to plan a trip the next year when vacation has built back up? Because I think like many that are part of marriages that are unhappy, it’s easier to not be around the “difficult” partner. It’s why men that I’ve worked with would sometimes rather be at work so that they aren’t with the “nag” at home. I think that you two have built this odd environment in your family and your perspective only make sense because of that. But other people in normal healthy relationships don’t think and act in this manner because they spent time building an environment of love and sharing in their home and would never in a million years plan to vacation away from each other for that amount of time, would never act as if some money earned or inherited was only a one sided affair, or do any of the other selfish things that have been mentioned in your post.",
              "id": 242,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "It seems like its possible you guys might have more issues than just this? I'm sort of sensing there's a level of passive aggressive hostility. You are resentful for not having a vacation and the other family members have their own things going on.\n\nYou're nitpicking or reaching back to old problems/fights like the lawnmower and her surgery both of which you don't seem to approve entirely of. \n\nAs far as inheritance goes, just in my eyes it belongs to the person it was sent to solely, but anything else you get during the marriage should be split as you should be a TEAM and on the same side. I believe even the law sort of works in this way, where if a couple splits, the lesser earning partner is basically entitled to a portion of what the more successful partner made (see Bezos recently).\n\nAll that being said, it is your money like you said and you do deserve to have a nice vacation and nice things but from a healthy family perspective there seems to be something wrong with this overall picture.",
              "id": 243,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": ">She refused to help buy another lawnmower when ours went out and we had shitty weeds for a month \n\nMaybe I'm wrong, but it sounds like you don't think you can hold on to the money, so you need to spend it before it disappears.\n\nI don't think you're an asshole, but this makes me sad.  This is a trap (mostly) lower-income people fall in to.\n\nI know several people who travel internationally basically every year.  None of them would consider spending $600/day on vacation.  Of course they have $100s of thousands in the bank.  But they don't feel the need to spend it as fast as possible, because they know the money won't disappear and will be there later.\n\nIt would be really nice if there was a way to get more out of your money than 1 long vacation.  If it's your first one it will be a little rough.  And most people get sick of travel after a while and won't enjoy the full 6 weeks.\n\nIf you're 50, check out Road Scholar and see if anything catches your eye.  They have a huge variety of vacation packages, and the prices are very reasonable (they are a non-profit).  I'm sure you could take several fantastic ones, and they're very easy compared to planning it out yourself.  Just winging it sounds fun, but it's easy to spend too much vacation time on the computer/phone planning the next thing.\n\nAlso if you like nature and haven't been to all the national parks, I wouldn't write off taking some US vacations too.  The national parks are amazing, and in particular the southwest (Zion etc) is very unique and can rival anything.\n\nI don't think it's wrong to spend the money on something nice for yourself.  You should tell your daughter to go to the Ivy League school, take it seriously, network, and get a job where paying back the $29k is nothing.  I just think you could get so much more out of it if you could manage to set some money aside and take several great trips over time.",
              "id": 244,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 37,
          "content": "He paid on her car and is taking her on a 10-day vacation; maybe she should just get all of it and get a tummy tuck and face lift this time? /S\n\nNTA, OP - my husband and I share finances (we both have professional careers), and last year he won (with our shared gambling money) when we were in Vegas, plus earned a large bonus at work, and he wanted a Rolex. I could not care less about having a Rolex and think it’s kind of a waste of money, but I went shopping with him with a smile, and helped him pick it out and did NOT demand an equally big prize for myself.",
          "id": 245,
          "comments": [
            {
              "score": 3,
              "content": "You have a \"gambling fund\" and are buying a Rolex, presumably a \\*watch\\* that's in the tens of thousands range.  \n\nOP bought his wife a car with $7500.  Like not fixed her Lexus for her.  He bought her a $7500 car.\n\nIn another post he says that she got breast implants and they couldn't afford a new lawnmower for a month.  \n\nThis probably doesn't seem like all that much if your family income is \\~$125-200k yearly, but it seems like a lot for OP.  He can do whatever the fuck he wants, but it's questionable at least for me.",
              "id": 246,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Honestly the way OP is choosing to spend his money is bizarre. I would find it really odd if one of my parents announced they were taking a month long vacation around Europe by themselves. Then my feeling would be pretty hurt when I found out they had the spare cash to take the whole family on a fabulous long vacation, but we’re going to go alone. This seems like a fantastic opportunity to bond and share an incredible experience with your family that OP is completely wasting. OP, do you hate your family??",
          "id": 247,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "God so many people on Reddit believe this crap. When you get married you don’t necessarily become a single individual with a hive mind. People can come up with whatever the hell financial marriage agreements they like.",
          "id": 248,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "\"Family money\". The 'child' is an adult who is in college and made her own choices regarding what debt she was taking on. The \"family money\" that was the inheritance all went to wife's cosmetic surgery.",
          "id": 249,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 615,
      "content": "ESH. The way you speak about the women in your family is so condescending.",
      "id": 250,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 523,
      "content": "YTA mostly for your shitty attitude about this. \n\nFirst off, the student loan crisis is SO BAD right now that that $29k your daughter will have in loans will likely balloon up. Going to Dartmouth is AMAZING and you don't seem to realize that it's MUCH harder to get in as a transfer. You should be proud of her. \n\nSecond, the way you talk about your wife's inheritance like...not for nothing, but it reads like you're jealous that someone DIED and gave her money. I don't know who died but I'm pretty sure your wife would've preferred the person to still be alive over the money. Regardless, being salty about that is childish AF. You are a grown ass man and should be better behaved than my three year old niece throwing a temper tantrum, but I digress. \n\nThird, you are literally leaving your wife behind on the trip of a lifetime because....why? Because you wanna spend 6 weeks straight travelling? Your wife is a better woman than I because I would be pissed as hell if my husband left to travel the world for 5 weeks without me. Dude. That is so selfish I don't even know why this has to be explained to you. \n\nObvs you can spend the money how you want, but you are definitely the asshole here.",
      "id": 251,
      "comments": [
        {
          "score": 368,
          "content": ">Going to Dartmouth is AMAZING and you don't seem to realize that it's MUCH harder to get in as a transfer. You should be proud of her. \n\nI can't be the only one who got royally pissed about that whole bit.\n\nHis daughter made it into an ivy league school. Not only did she do that, she made it into an ivy league school from what I gather is a rather poor household overall. That's fucking amazing! I don't have kids, but if I did I'd be overjoyed and also terrified about footing the bill, but you get your ass I'd do whatever it took for them to succeed. If I won the lottery like that I'd pay off anything desperately needed or that could help my current financial system and then immediately throw everything I could at my kid going to an ivy league school.\n\nOP though? \"She just wants the prestige and should just go to community college instead\"\n\nLike, what the fuck? How is OP that condescending to his child's accomplishments? If that's how he treats something amazing like that I shudder to think the disdain he must have treated her normally.\n\nOP is YTA, full stop.",
          "id": 252,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Your third point is what resonates with me the most. I find it mind blowing that she’s okay with him ditching her for a month and a half and he can’t see how selfish that is",
          "id": 253,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}