{
  "post content": "\nMy f32, sister f28, and her husband m32 moved in with us 2 days ago after they lost their apartment to medical debts for their child (my nephew). My husband and I are more than happy to have them stay for few weeks til they get this resolved.\n\n\nHowever, Yesterday at 7pm, I was in the kitchen when my husband rushed in and said that he saw both my sister and her husband walk out of the bathroom. They'd most likely taken a shower together. My husband said that it irked him and I agreed that what they did was somewhat inappropriate. He asked me to speak to my sister on the matter and I did. She got defensive asking how this is affecting me or my husband in any way. I told her that it made my husband feel uncomfortable and would rather that they just take their showers seperately. She started ranting about being overwhelmed by their son's health problems and not having some alone time together as a married couple and found this activity as a bonding time to spend together. I apologized for how she felt but requested that she just do as asked. She got mad at me and said that I was being inconsiderate and she didn't understand my husband's hangup on what she and her husband do. We started arguing and she stormed off to the guests room where my nephew and BIL are.\n\n\nShe's not speaking to me but my husband said I did the right thing by speaking to her and setting this boundary.\n\n\nAITA? Am I (and my husband) overreacted to this?\n\n\nSome infos:\n\n1. My husband did not mention hearing anything, just that he saw them get out of the bathroom. And yes they were clothed.\n\n2. It's the only bathroom in the house.\n\n3. They spent apprximately 10+ in the shower according to my husband.\n\nEDIT* I'm gonna bring my husband to look at the responses and help answer some questions down here, okay? Just give me a few minutes.\n\n\nEDIT* I'm sorry I can't respond to every single comment but my husband says he's uncomfortable and doesn't want to expand on the situation.",
  "id": 1,
  "comments": [
    {
      "score": 50610,
      "content": " You husband came \"rushing in\" to tell you that your sister and her HUSBAND took a shower together? This is so dumb YTA. Get a life bruh. Leave them alone they're stressed enough as it is.\n\nEdit: \nObligatory wow I didn't expect all the updoots and awards, thanks! \n\nMore importantly - I was a bit flippant in my original comment, so I want to use my newfound fame and glory (lol) to say something to everyone saying \"your house your rules\" or \"they need to get a hotel\". That's all fine and good, we're here to give our opinions on the situation, but can we remember:\n\nThis couple just lost their home. \nThey are in serious medical debt. \nThey have a very sick child. \n\nThe likelihood of their marriage surviving the immense stress and hardship they are experiencing is statistically low. \n\nCan we get some compassion for these people? Can you leave your personal hangups behind and give them some support? Can you find happiness that they are making time and effort to spend together? What's really more important here?",
      "id": 2,
      "comments": [
        {
          "score": 18625,
          "content": "Such an easy YTA. That's so embarrassing. If my spouse rushed in just to tell me that, I would be like ew don't tell me that lol.",
          "id": 3,
          "comments": [
            {
              "score": 4866,
              "content": "I got second hand embarrassment from this post. He declined to answer questions because he **knows** his behavior is that of a 2nd grader boy in a playground full of girls. I can imagine how dead OP’s bedroom is…",
              "id": 4,
              "comments": [
                {
                  "score": 2378,
                  "content": "BuT tHeY’rE NaKeD iN tHeRe…….",
                  "id": 5,
                  "comments": [
                    {
                      "score": 507,
                      "content": "You should see me, under all my clothes I'm 100% naked. Not a stitch.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "🤣🤣",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Naked in the shower!!! THE AUDACITY!!!!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I wonder if they realised that sister wipes her own arse with toilet paper and sister's husband needs to hold on to his penis to aim for the toilet bowl too.🤣",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 388,
                  "content": "My thoughts exactly. I'm willing to bet special time in ops bedroom is punctuated with awkwardly overexcited giggles from her husband.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 61,
                      "content": "I bet they use that weird blanket with a hole in from The Handmaids Tale.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "😆😆😆😆😆😆 I’m dying",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 315,
                  "content": "What I want to know is, does OP and her husband refuse to spend time in the same room with their nephew, knowing as they do that he is evidence that her sister and BIL have had sex? Further, how can OP stand to look her sister and BIL in the eye, ever, knowing that those eyes have seen each other naked?\n\nThis is exactly how ridiculous it sounds to forbid two married people from being in the shower together. “I don’t want to have to think about what they’re doing in there” is a really easy problem to solve: ***Don’t.***",
                  "id": 13,
                  "comments": [
                    {
                      "score": 339,
                      "content": "Maybe they weren't even showering together - just my assumption, but what if that is the only place where they can close the door and discuss sensitive things (like son's health, family financials etc) without any prying eyes and ears?",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 259,
                  "content": "Sounds to me like he's a little jealous of them.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 59,
                      "content": "My guess is he's attracted to her sister.\n\n\nNo wonder he won't be answering questions.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "OPs husband sounds creepy, like why does he know 10minutes - was he standing close by with a stop clock!",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 50,
                  "content": "Just because you ain’t fuckin in your home doesn’t mean you need to go around making some weird ass rule that ain’t nobody else gonna be fuckin",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "Omg seriously! My mental image reading this post was a grown man running into the kitchen like a second grader tattling to mommy that he saw 2 people go in the bathroom together!! How scandalous, he just can’t be expected to imagine the possibility this married couple see each other naked!!! Or (gasp) have SEX!!",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "I thought of throwing some serious shade about this too but I'll just say I whole heartedly agree with this comment. Their bedroom life is probably pretty dull lol.\n\n I mean as long as you can't hear sister and BIL in there then there is zero problem.\n\nEdited typo",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "What's next? Husband rushes in to tell OP that her sister and BIL let different foods touch each other on their dinner plates?",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1905,
              "content": "right??? lol",
              "id": 22,
              "comments": [
                {
                  "score": 3795,
                  "content": "YTA. ….my response would have been…..”um….and?”  What a charmed life you must lead to have such an inconsequential thing bother you.  Be sure and post again when the next trauma occurs.  We’ll be waiting.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 498,
                      "content": "His “charmed” life sounds super sad if he’s really bothered by any of this.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 75,
                      "content": "Ok, but it could be something serious next time. I'm thinking, maybe the toaster is darkening the bread too much. Something serious, like I said.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 46,
                      "content": "> ….my response would have been…..”um….and?”\n\nSame! I would have been \"ok...and?\" The only thing I can think of that might be a hiccup is if my girlfriend/wife was shocked by my gay brother and his partner coming out of the bathroom together but then...I wouldn't be with someone who had a problem with that.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 45,
                      "content": "Seriously though, that's the kind of shit i'd expect a six year old to do in that situation, not a grown-ass, married man.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 38,
                      "content": "This is a definitely a situation where OP and her husband created a thing that wasn’t a thing at all. They either live a very charmed life or a very boring one.",
                      "id": 28,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "Honestly, who's it hurting? They're even saving water by showering together.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I'd bet $20 at some point the trauma will be \"After EVERYTHING we did for my sister/SIL and BIL, they cut us off and won't let us see our nephew. Whaaa!\"\n\nThey'd be right to do it too. Either OP's husband is making trouble with the parents of an ill child just to stir shit, or he's got some kinda fuckery in his head built up around showers and Nephew don't need none of that.",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1735,
              "content": "If my partner did that, I would say \"good, they're saving water by sharing a shower\"",
              "id": 31,
              "comments": [
                {
                  "score": 1137,
                  "content": "Not only that, they have one bathroom,  and it will be occupied for less time. It's the opposite of a problem.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 153,
                      "content": "As someone who shares a bathroom with my brother, his girlfriend and my boyfriend, fucking AMEN.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I was thinking that.  Intimate, doesn’t waste the hot water, and less time in the shower.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 56,
                  "content": "That was my thought at “one bathroom.” Two people done in 10 min? Win for the household!",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 50,
                  "content": "With hubby our code is \"do you want to saving water?\". C'mon, it's not a big deal.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 68,
                      "content": "Plus, showering together means they can scrub your back and you can get fun back massages! Win win!",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "As the homeowner with 1 bathroom, I'd greatly appreciate one 10-minute shower over two 10-minute showers.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "My thoughts exactly! Plus spending less time in the one bathroom of the house for at least 4 adults & 1 child. If OP's sister & BIL had been being obviously intimate, being loud to where OP's husband could hear them from outside the bathroom; or if they walked out naked, then I could see having a talk with their house guests, but this seems to inconsequential, I can't believe such an ordeal was made about a husband & wife taking a shower together 🙄",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Lol. The saving water was my first thought also.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1543,
              "content": "I gotta wonder how long he was listening... if it was more than 10 minutes, damn!",
              "id": 41,
              "comments": [
                {
                  "score": 1497,
                  "content": "And they were ONLY 10 minutes. So they actually saved more hot water, than if they had showered separately.\nI don't think they were doing the hanky panky in 10 minutes LOL\nOP gentle YTA Chill out a bit.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 699,
                      "content": "It genuinely just sounds like they wanted to spend some quiet time together to bond to me in that time, which I think is sweet. Definitely would have suspected longer if it was sex.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 333,
                      "content": "Exactly. From personal experience shower sex is super difficult and takes longer than 10 min. And surely ppl would hear it as there a lot of movement. It’s no fun. 0/10 do not recommend and I highly doubt that’s what they’re doing.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Seriously. I often take more than 10+ minutes to shower. That's some impressive shower times for a duo. \n\nYTA, let the married adults have 15 minutes of peace together, ffs.",
                      "id": 45,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "[deleted]",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "I was just thinking this - a normal shower for me is about 15mins, and that's with a little bit of luxuriating (standing there just enjoying the water and time to myself lol). \n\nThey might just like doing their daily wash together? \n\nI honestly don't see what's wrong with them doing the watery fandango either, any mess will immediately be washed away, and assuming they clean up after not before, they're not gonna be all sex-smelly afterwards?\n\nSaves on water for the laundry too.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "OP said that her husband didn't actually hear anything, just that he saw them exit the bathroom together",
                  "id": 48,
                  "comments": [
                    {
                      "score": 61,
                      "content": "Imagine if they had went in there just to have the BIL like, check her sister’s back for a pimple and he freaked out and made a mountain out of a molehill. \n\nHe was probably snooping around a lot longer than just catching them coming out, especially since he doesn’t want to comment on what’s bothering him. Guy was being a creeper lmao.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 33,
                      "content": "Yeah, i saw that..... I guess I hoped he was listening... it wouldn't have justified his pearl-clutching... but it would've made more sense, especially if they were audible.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "And they were clothed.",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 28,
                  "content": "That's why he doesn't want to expand why...I bet",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "I wonder if he scraped the wall with the glass he used to listen",
                  "id": 53,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "I know!  Having a family move in with you can increase household expenses greatly.  TThat is why it’s such a gift.  In this case they are saving money than taking two separate showers!   OP.  You and your husband are totally TAH.  And Ew for him stalking them in the shower….",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1266,
              "content": "Right? I would be asking why my husband is taking time out of his day to picture what my sister is doing when naked. And to the point where he has to talk to me about it. Sounds a little pervy.",
              "id": 55,
              "comments": [
                {
                  "score": 60,
                  "content": ">Sounds a little pervy.\n\nI suspect OP's hubby is so uncomfortable—and refuses to provide detail—because he has a crush on OP's sister. He hates being reminded that only OP's sister's hubby can up-doot her, and he can't.\n\nETA OP is YTA",
                  "id": 56,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Or the husband.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 38,
                  "content": "Well apparently he’s uncomfortable and doesn’t want to expand so…",
                  "id": 58,
                  "comments": [
                    {
                      "score": 25,
                      "content": "he didn't even expand! maybe put a little camera in there for next time",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "His pants tent is expanding lmao",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "Pervy or prudish—come to think of it, the biggest pervs tend to be the prudes.",
                  "id": 61,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 251,
              "content": "Add me to the list of baffled people, OP - YTA.\n\nI don't even know where to start. Do you understand married people get naked with each other all the time? I shower with my wife all the time. It's not always sex, sometimes we just plan our day and kids' schedules.\n\nI'm now wondering what your rules are for them sleeping?",
              "id": 62,
              "comments": [
                {
                  "score": 24,
                  "content": "[By using this traditional method.](https://en.m.wikipedia.org/wiki/Bundling_(tradition))",
                  "id": 63,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 63,
              "content": "If my spouse mentioned it I'd just be like 'uhmm, okay???'\n\nAdmittedly, we shower together daily. It IS our bonding time - not even sexy times. It's a chance for us to - without interruptions - spend 10-20 minutes talking about our days and events and plans. Yeah, we're both naked, but we're also doing our needed task of showering.\n\nI agree with the top comment - if them getting 10-15 min alone in a shower is something they like, let 'em at it - they're going through so much stress and need whatever bonding and relaxation they can get in their situation.",
              "id": 64,
              "comments": [
                {
                  "score": 23,
                  "content": "My friend's parents are in their 80s and they have showered together every day of their lives. It is weird that everyone knows it because it so cute and remarkable now, in their 80s.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I'd say half the couples I know regularly shower together and it's not for sexy times, so I'm a little baffled by OP's reaction. It's not something I'd advertise, but if asked, it wouldn't be odd, y'know.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "YTA Is your husband 10 years old??? What they do in the bathroom together is their business and if they can take some time to gather a little comfort from each other…hooray for them.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "I think my reply would be “newsflash, they’re not virgins, they have a kid.” \n\nIf he’d walked in on them doing it on the couch I’d agree it’s inappropriate. They’re grown (married) consulting adults. \n\nInfo, is your husband okay to be celibate while they live there? \n\nYTA",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "My husband would rush in to ask if WE could do that too.",
              "id": 69,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6280,
          "content": "I’m honestly embarrassed for OP. She basically announced to the world that she and her husband have the most boring and vanilla intimate life. He’s horrified by two consenting adults showering together? Poor OP.",
          "id": 70,
          "comments": [
            {
              "score": 4074,
              "content": "Showering together isn’t necessarily about sex. It could just be 10 minutes that they get to spend together without interruptions (it also saves on water so winning either way).",
              "id": 71,
              "comments": [
                {
                  "score": 3446,
                  "content": "Exactly!!!! When my husband and I shower together we just lather each other up and grope each other, lmao! It's all bonding and giggles and good back scrubs and titties!\n\n\nWe wait for the sexy times for OUTSIDE the shower cuz it is slippery and cold in there, and we are not here for that nonsense.\n\n\nYTA, OP, ya damn prude.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 1183,
                      "content": "Hell, sometimes my husband and I shower together and literally nothing happens. Saves water! \n\nYTA OP.",
                      "id": 73,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 64,
                      "content": "Me and my husband shower together and all he does is wash my hair! When I was pregnant sex was off the table for us and him washing my hair was out version on intimacy and we just never stopped doing it!",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "So true. “It’s all bonding and giggles, good back scrubs and titties !” This made me laugh but you’re absolutely right. It’s just nice and doesn’t have to be a sexual thing at all. OP is so basic and an AH.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "As someone who has broken a collar bone from shower shenanigans…this is the way.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Shower sex sucks, it's what happens after that's fun!",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 39,
                  "content": "One of my favourite things to do is shower with my boyfriend, and a majority of the time it definitely doesn’t involve sex… mostly just giggling and making it impossible for the other to rinse off completely",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "My wife and I had a shower with two seats. Our work schedules were misaligned so our “shower talks” were an important time to connect during the week. Some cuddling. No actual sex. Shower sex rarely works out.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Was thinking the same thing. A moment of intimacy in a relaxing environment. If they had sex or not it doesn't matter. They could've been in there crying for all we know and they were just comforting each other. I feel bad for OP & her hubby for not understanding this and clearly they lack this in their relationship.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I’m not sure if anyone has pointed out, the last line of the original post makes it sound like the nephew is sharing the room with his parents.  So this ten minutes may literally be the ONLY time they have alone together.  Let them have it, OP.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Not to mention, just because 2 people are in a bathroom together and one is showering, doesn’t mean they’re both showering. They could just be talking or using the bathroom?\nAnd even if they were, OP should be glad they’re saving water!",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Exactly this! I've been married about 18 years and my husband loves showers. Sometimes he'll shower 3 times a day when it's hot. Whenever I get home from work he always joins me. It's more to see how my day was and unwind a little bit. Literally nothing sexual at all. Just catching up while showering, killing two birds with one stone. We live alone, no kids, but it's our habit now. YTA OP. They are grown married adults...you expect them to be G-rated and celibate or something?",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "They are being considerate guests! There's only one bathroom, and they were only in there for 10 minutes.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "One of my oldest friends and her husband shower together all the time, and not for sex, just because that is what they do...",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Given that they are now sharing a house and, apparently, 1 guest room - which they’re sharing with the nephew whose medical issues prompted this situation - the bathroom may be the one place they can cry together or discuss their realities and future without worrying about his (or anyone else) overhearing. At any rate, OP, YTA, but your husband is a bigger one.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 524,
              "content": "For all of 10 minutes.",
              "id": 87,
              "comments": [
                {
                  "score": 37,
                  "content": "The absolute horror!",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 38,
              "content": "Or…? He’s secretly jealous that him and OP don’t do that.",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "Bingo! I thought the very same thing.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1893,
          "content": "The only way this post makes any sense is if OP and her husband are strict Mormons, and even then, that dictates THEIR behaviour, not someone else’s. They’re not shooting porn, they can’t hear them fucking — what on earth is the issue? \n\nIt’s so weird to be drawing boundaries about whether or not two married adults can be in the same space naked — there is no evidence they were even having sex. People shower together for many reasons. I like chatting to my husband about his day while we do.\n\nEdit — thanks guys, I have been notably corrected many times about Mormons and their love of banging! I was mistakenly taking purity culture and applying it to marital sex. OP and her husband are just uptight.",
          "id": 91,
          "comments": [
            {
              "score": 634,
              "content": "I don't even think that's accurate. They're married.  And Mormons support making lots of babies.  I'm sure lots of Mormon babies have been made in the shower.  There's literally no reason for this.",
              "id": 92,
              "comments": [
                {
                  "score": 79,
                  "content": "Haha, that’s probably true! I more meant the weird pearl clutching hang ups about sex. Maybe that’s a Catholic thing. Or just a prudish asshole thing.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 61,
                      "content": "Yeah prudish asshole thing for sure. They have those in every religion and some of them aren’t even religious at all I’m sure lol.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Ha! Catholics like married couples who make babies too. Especially married couples who only use the rhythm method of birth control. Cause that makes lots of babies, lol.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 37,
              "content": "Strict Mormon here and I shower with my husband, maybe OP & her husband were brought up in some time warp bubble of the 40's or something? Heck my daughter & her husband needed to move back in with us and they shower together.",
              "id": 96,
              "comments": [
                {
                  "score": 21,
                  "content": "Mormon here who actually accidentally conceived the night we moved into my parents house temporarily between houses 😅🤪",
                  "id": 97,
                  "comments": [
                    {
                      "score": 14,
                      "content": "That's amazing!!! Hahahaha! It's be even better if it was because of a shower! 😂🤣",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "Sex is highly encouraged for married Mormons. The amount of dirty jokes and sex-focused conversations that I was suddenly surrounded by the second we got engaged was mind blowing. I thought all the adults in my life were prudes. They just didn’t talk about it around me until I was getting married myself. \n\nMormons love sex 😂🤪",
              "id": 99,
              "comments": [
                {
                  "score": 14,
                  "content": "That’s so interesting! I assumed from all the purity culture stuff in the media that it was a sort of taboo thing unless you’re actively baby making. Thanks for the insight!",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I have a feeling that OP's husband has the hots for the her sister and feels jealous of BIL.. I mean I could be totally wrong but a lot of posts recently have me jaded 😂",
              "id": 101,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "I don’t think so. Mormons like to have tons of kids so I doubt sex is a hang up for them.",
              "id": 102,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "As a Mormon I can tell you that my husband and I shower together all the time, even at my in-laws when we have stayed there for brief visits and no one has a problem with it so I don’t think that’s it. I mean we never really use it for sex either but it’s very prude of them to even care.",
              "id": 103,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 536,
          "content": "Thank God he was there to catch that. Just think of all the sin he stopped. Lol nerd",
          "id": 104,
          "comments": [
            {
              "score": 61,
              "content": "Thou shalt NOT scrub thy spous's back!!!",
              "id": 105,
              "comments": [
                {
                  "score": 33,
                  "content": "Yes that’s in 2nd Apostrophes I believe.",
                  "id": 106,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "Plus he timed them, lol.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "Yes. Normally I think “their house their rules,” but this one’s beyond ridiculous.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "The \"rushed in\" ended me. What a fucking nerd lmao",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "Not even that... He rushed in to tell her he *thinks* they took a shower together because 2 fully-clothed married people came out of the same bathroom together. \n\nThere's something super weird about this situation, and I feel like everyone here can see it but OP.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "I thought I was reading the title wrong, I don't get what the big deal is.",
          "id": 111,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 23,
          "content": "I laughed very loudly, so fucking weird",
          "id": 112,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 23361,
      "content": "INFO: Unless they were loudly banging, why do you care?  There's nothing weird or untoward by a couple showering together. My husband and I often shower together and 99% of the time it is completely nonsexual. We find it to be a nice time to chat without fear of interruption from our kids.",
      "id": 113,
      "comments": [
        {
          "score": 9340,
          "content": "My parents do every day.  It started out as a safety thing, my mother used to pass out sometimes when hot water hit her (just before menopause she got a PMDD diagnosis) so he wanted to make sure she didn't get hurt.  But now it's just a habit that they enjoy/find comfort in especially nearing retirement.  I grew up with it, so OP and her husband's pearl clutching just seems overly dramatic for literally no reason.",
          "id": 114,
          "comments": [
            {
              "score": 3384,
              "content": "I had friends in NYC that showered together everyday. Most apartments in the city have only 1 bathroom and when you have both have to be in the office around the same time it's just easier. They used to wave from the shower window on the weekends when we were meeting up for brunch. It was hilarious!",
              "id": 115,
              "comments": [
                {
                  "score": 2553,
                  "content": "“ …and they were roommates!”",
                  "id": 116,
                  "comments": [
                    {
                      "score": 428,
                      "content": "/r/achillesandhispal",
                      "id": 117,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 300,
                      "content": "Oh my god, they were roommates!",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 53,
                      "content": "\"Life long friends!\"",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "[deleted]",
                      "id": 120,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "I'm not seeing u/Cubadog saying they were not a couple though. I read this as the pair showering together *WERE* a couple, and both were friends of OP.\n\nThat is, \"I had friends\" is meant like this \"I had friends named Steve and Alice Smith, that were a couple, who did this\" not \"I knew these people who were each other's friend who did this\"",
                      "id": 121,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 405,
                  "content": "these dont sound like platonic friends lmao",
                  "id": 122,
                  "comments": [
                    {
                      "score": 44,
                      "content": "Somewhere in NYC, there's an art room being built.",
                      "id": 123,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 49,
                  "content": "The wave is hilarious",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 915,
              "content": "This is an incredibly sweet story and every person who wants to be in a relationship with another person should strive to find a person who will shower with them for safety.",
              "id": 125,
              "comments": [
                {
                  "score": 1473,
                  "content": "Oh, it gets sweeter...\n\n*First* date with my mother my father went home and told his mother he'd met the woman he was going to marry.  5 months later he did... 43 years ago.\n\nFew years ago my father was telling me about a 'weird' dream he had.  He said Jessica Alba was hitting on him and in his dream he apologized and said he was happily married.  He's like 'That's  weird right?'  I'm like 'No, it's literally the sweetest thing I've ever heard.'\n\nMy mother is someone who is not good about demonstrating emotions.  Neurodivergent, bad childhood, etc.  She was super pissy one day, just miserable to everyone.  I don't typically break confidences, but sometimes a rap on the noggin' is kindness when you haven't necessarily earned it.  I had been holding onto the 'Jessica Alba Dream' story for awhile so I was just talking about relationships and the ways people demonstrate love, loyalty, etc.  And I told her the story and she just looked at me and teared up.  She got really quiet and shortly after my father walked in she looked at him and in a completely different tone asked what he wanted for dinner and served him and picked up his dishes and was very kind to him all night.  To my knowledge he still doesn't know she knows.\n\n\nThey have had more than their fair share of struggles but I think the little things like showering together, meals together, etc have made the difference in keeping them together.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 313,
                      "content": "This is the cutest damn thing I have ever heard and I strive to be like that with my wife. Please hug your father for me.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 141,
                      "content": "I love your parents!",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "My heart.  ❤ I won't elaborate too much but your parent's relationship sounds a lot like mine. My stuff, both physical and mental, are well managed with medications but there are times when I need his help. I have (so far successfully) made it my mission in life to be the mama our kid deserves and I certainly couldn't have done it without him. She is a mini me. Dual diagnosis. Our girl gravitates towards me but she knows daddy loves us and will help if we need it.",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Protect them both at all costs 😭❤️😭",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "This is a sweet story. It's what true love looks like. Thank you for sharing it. <3",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "This is part of why my husband and I shower together. We shower together more often than not. Most of the time it's just a place where we can exist together, alone, and chat in a relaxing environment. About 25% of the time, when I'm having a flare up and I'm having major mobility issues he very happily soaps up anywhere I can't reach. Nothing sexual happens. I'm in pain, heat and massage help immensely. I wonder if my husband would be \"allowed\" to help me in OP's house.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "Wait a minute…I often feel lightheaded in the shower leading up to my period. I also have PMDD. Is this a symptom of that? Because I always thought it was just my period?",
              "id": 133,
              "comments": [
                {
                  "score": 51,
                  "content": "I think it had something to do with the hot flashes she'd get.  Or possibly she had a drop in blood pressure.  Idk.  But once she got treatment it stopped.  It happened enough that I begged her to go to a cardiologist and obviously we made an effort to watch for triggers and hot steamy water was one.",
                  "id": 134,
                  "comments": [
                    {
                      "score": 24,
                      "content": "I’ve never out and out fainted before and it only happens in the lead up to my period.",
                      "id": 135,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "My parents showered together last time they were visiting me - my mother was injured and needed assistance.  I didn’t think twice about it!  It was actually nice because my hot water tank kind of sucks - this way we all got hot showers for sure.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Also makes cleaning your back easier",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "That’s really sweet, actually. A lot of kids would give anything for their parents to care about each other like that. Made me smile.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "My parents have been showering together alot too. I think it started around the beginning of the pandemic cause my mom just left her job and my dad was already home on disability. They werent really sneaky with it, sometimes they would just be like \"hey me and (your) dad are gonna take a shower\". This was when i was still living with them as an adult btw.\n\nAt first i was weirded out cause who wants to think of their parents showering together but like, theyre married, they *made* me, of course theyre gonna do stuff like that. After a while i just got used to it and dont think much of it (it also helped that i moved out a couple years back). Hell when they downsized earlier this year they specifically made it so their master bathroom had a huge shower with two shower heads so they can go in there together lol.\n\nYes, its kinda gross to think about people (specifically family like parents, siblings, etc) doing stuff thats considered intimate/sexual but as adults we have no right to shame or \"forbid\" others from doing this stuff.",
              "id": 139,
              "comments": [
                {
                  "score": 15,
                  "content": "I grew up with it.  It doesn't phase me in the least anymore, and actually appreciate it as one of the reasons they've managed to have a long, successful marriage.  But my family uses showers as time to recharge.  My sister was an impossible grump as a child in the morning so they bought her a shower safe radio and told her to go take a shower before she ate breakfast.  By the time she exited she was awake enough to be civil. 😂  I've always used it as a way to wash the day off me.  I shower in the evening before I settle in.  Gotta do it anyway, might as well let it add value to your day.  🤷‍♀️",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": ">my mother used to pass out sometimes when hot water hit her\n\nI'm not the only one who experiences this?? Holy shit",
              "id": 141,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1883,
          "content": "I wish the husband would hurry up and answer your question the same way he hurried to tell his wife what the SIL and BIL were doing. It’s been a minute since that last edit.\n\nETA: That third edit… making me shake my damn head.",
          "id": 142,
          "comments": [
            {
              "score": 1489,
              "content": "> EDIT* I'm sorry I can't respond to every single comment but my husband says he's uncomfortable and doesn't want to expand on the situation.\n\nHe's uncomfortable because he'd like to be in there with her.",
              "id": 143,
              "comments": [
                {
                  "score": 585,
                  "content": "Wait til he finds out how they made his nephew in the first place!",
                  "id": 144,
                  "comments": [
                    {
                      "score": 188,
                      "content": "Babies come from the shower! I'm gonna stick to baths from now on.",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 30,
                  "content": "This response should be much higher up.  This is basically the ONLY answer that makes sense at this point.  I mean, he was immediately so horrified.....that he hung around the bathroom for ten minutes, then waited until the couple emerged, fully clothed *gasps & clutches pearls* before running off to tattle to OP and demand that she tell her sister the newest house rule.  Then OP immediately acquiesces and does so - even though she apparently cannot articulate *why* the concept of a married couple taking a quiet shower together is very offensive. Then, after OP starts a whole shit show by this demand that her sister and spouse MUST WASTE WATER AND TIE UP THE SINGLE BATHROOM IN THE HOUSE for even longer by showering separately...OP's husband still declined to elaborate on why this made his so very uncomfortable. The only explanation that would make him reluctant to elaborate would be something that involves the OP's sister....naked and showering ALONE.  Because the husband being there with her sister must have completely spoiled his little fantasy somehow...(I'm aware this is speculation on my part, but the absolute ignorance behind this post entitles me to a little creative license).  This whole entire post is weird as hell. YTA for accommodating the weird demand with no explanation. OP does not even come up with a concrete reason outside, \"we don't want you to,\".",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "More like “can’t respond to a single comment” apparently.",
                  "id": 147,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 256,
              "content": "He's not going to because this isn't going his way.",
              "id": 148,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 44,
              "content": "Ugh, I know, \"too uncomfortable to expand\"...really?\n\nHe's clearly a **\"my house my rules\"** kind of jerk, and if you dare not immediately conform, it's **\"because I said so!!\"** since I'm guessing he's actually too intimidated to just have an adult discussion with other adults. OP either agrees with husband or also must follow husband's house rules, either way, both are major assh*les.",
              "id": 149,
              "comments": [
                {
                  "score": 11,
                  "content": "can’t self reflect, or handle two people showering in a room. my gut instinct is he is attracted to her sister. no other logical explanation if there was no noise. we’re they germing up the place …in the actual shower? when shitting happens two feet away? lots of people shower together without it being sex. it’s intimacy and it sounds like their marriage is lacking it, because otherwise he would know that. even so? does he not expect a married couple to have sex under their roof too? this is so suspicious.",
                  "id": 150,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "He jelly",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "He can’t answer our questions because he’s busy listening in on SIL and BIL. \n\nYTA OP get a life and get over it. 2 married and consenting adults can take a few moments to themselves. Unclutch your pearls ffs.",
              "id": 152,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "I’m willing to bet he was hoping to “catch” the SIL but didn’t intend to tell op about it at all.\n\nCause why else would someone stand outside the door listening to someone shower then bolt the moment they realise that person wasn’t alone?",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1675,
          "content": "My best friend calls me on speaker phone while she showers if her husband isn't home. She's epileptic and has had seizures in the shower before. This way I know she's safe. They couldn't have been doing too much in 10 minutes. Maybe they were even crying from all the stress. It might be the only truly alone time they have!",
          "id": 154,
          "comments": [
            {
              "score": 1689,
              "content": ">Maybe they were even crying from all the stress. It might be the only truly alone time they have!\n\nRIGHT!?!? These people lost their house because their kid needed medical care they couldn't afford! A toddler! A toddler so sick that the bills mounted up and they lost everything. \n\nStress from a sick/injured/etc.. toddler, stress from bills, stress from moving, stress from having probably zero time together because they live in a house now with other people so their only retreat is in their room (with toddler? Maybe toddler has it's own room?)\n\nDamn OP, let them have the comfort of being alone with each other, and try to understand that intimacy can help them weather this storm together, draw them closer and remind them that at least they have love when everything around them crumbles.  \n\n(And honestly, you don't even know if they had sex. A quicky + shower for 2 + getting dressed would not take only 10 minutes)",
              "id": 155,
              "comments": [
                {
                  "score": 218,
                  "content": ">you don't even know if they had sex\n\nAfter I left my response I instantly thought of this. They could just be efficient and saving water heh. They could just be standing there crying together. It also sounds like he only knew they came out of the bathroom. Maybe one was on the toilet. Maybe neither was in the shower. There's just so many assumptions that could be made",
                  "id": 156,
                  "comments": [
                    {
                      "score": 49,
                      "content": "Yea sometimes me and my bf do separate non shower non sex things in the bathroom together. Like one of use will be shaving in the mirror while the other one is clipping their fingernails over the trash or something. You can do more than just shower and shit in a bathroom!!",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I grew up sharing a bathroom with my brother - a tub + shower combo with opaque curtains. So it was an every day occurrence that while 1 of use showered the other was getting ready for school.  Lots of conversations happened for years & years that way. \n\nNothing particularly sexual or gross going on, just trying to use the space we had efficiently.",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 79,
                  "content": "There is either a typo or lack of subject-verb agreement in the post, but I read it as the sister, BIL, and nephew are all sharing a room. This may be the only place & time that the two of them get to be alone, and whatever they do in their daily allotment of 10 minutes of privacy is their business. It might be sex, it might just be a chance to talk and not worry about OP’s nosy husband or their sick child overhearing it.",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "Your post shocked me because I suddenly remembered my wife and I showered together a lot when we had a baby in the NICU for months. Shower time during that trauma was indeed a powerful tool for us that I hadn’t realized.",
                  "id": 160,
                  "comments": [
                    {
                      "score": 8,
                      "content": "My son was born w a birth defect that was never noticed by ultrasound, once i delivered him they transported him to the childrens hospital. The dr that delivered my son looked at me and told me to spend time in the shower and cry- those showers in the NICU were just about the only thing that held me together for my baby. Showers are therapy in themself",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "I do get that it can be a little jarring to remember that family members have sex lives, and if it were loud or otherwise obtrusive, I'd agree that it's okay to ask them to quiet down, but honestly, I'm with you, if it's not noticeable unless you're watching the bathroom, leave it alone. Plus, a lot of people shower/get ready together without it being sexual, while they're in a relationship. When I've shared a bathroom with a partner, I've done my make-up while they use the bathroom and brush teeth and stuff.\n\nFinal point: If this is the only bathroom in the house, I'd be glad if this turns out to be an efficient/time saving choice, because bathroom lines suck.",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "It also saves water. When money was tight my husband and I showered together. When we aren't so tight up, I'd rather, and do, shower by myself.",
          "id": 163,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 75,
          "content": "This. My husband and I are \"old\" and we shower together a couple times a week because it's just a nice thing to do. We chit chat, scrub backs, and then we're done. Unless OP's husband had to poop there's no reason why he should be monitoring other grown ass adults shower time. Fookin' weirdo.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "My 19yo son still lives with me bc of long covid and, well, the economy. When his gf is over, they'll sometimes emerge from the bathroom post-shower together. Whether she is just sitting on the toilet keeping him company, actually in the shower, or whatever activities they may be partaking in... None of that is my business.",
          "id": 165,
          "comments": [
            {
              "score": 23,
              "content": "I don't know why this strikes me as an example of awesome parenting, but you're awesome. Just needed to let you know.",
              "id": 166,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 67,
          "content": "The edit about the husband not wanting to respond because he's \"uncomfortable\" speaks volumes. Yeah, OP. He SHOULD feel uncomfortable with himself given how many people are calling him out for being a complete creep asshole. He's also figured out how to make OP, his wife, an accomplice to his creepiness. What a weird situation overall.",
          "id": 167,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "I shower with my fiance and 99.9% of the time it's nonsexual. Showers are small areas, and unless someone is freezing the whole time, it's not very sexy...and besides telling them not to do it will just make them do it when OP and husband arent home",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "Isn't one 10 min shower better than  multiple 10 min showers? Sounds like they are saving water and time that the one bathroom is occupied.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11571,
      "content": "YTA and so is your husband. Why is he so pressed about what a married couple does? What makes them taking a shower together inappropriate? Did they walk out the bathroom naked? Why is your husband even making assumptions about what another couple does in the shower? What exactly is it that irks him about your sister and HER HUSBAND being together in the shower? Your husband is either jealous or is seriously projecting. If that isn’t the case, he’s being very creepy and invasive.\n\nEdit: Thanks for the upvotes and awards guys!",
      "id": 170,
      "comments": [
        {
          "score": 2339,
          "content": "Her husband only wants to imagine his SIL in the shower alone than imagine a married woman *daring* to have some alone time with her…husband",
          "id": 171,
          "comments": [
            {
              "score": 485,
              "content": "That is EXACTLY what I got out of it.",
              "id": 172,
              "comments": [
                {
                  "score": 44,
                  "content": "Same, he seems jealous",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I bet he also isn’t getting any and cannot stand the fact someone else in HIS HOUSE is… hurts his manhood.",
              "id": 174,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "I normally hate the stupid anti man theories this sub makes up, but tbh my first thought was \"why tf is he so worried about the sil getting fucked in the shower?\" Sounds like he has a crush.",
              "id": 175,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1675,
          "content": "OP made an edit and says that her husband won’t expand on why it bothers him, just that he’s “uncomfortable.” That’s a dead giveaway that he doesn’t have a valid or rational reason, and he knows it. That’s pretty much always the case when someone refuses to give a real reason for their thinking other than “that’s just how I feel.”",
          "id": 176,
          "comments": [
            {
              "score": 443,
              "content": "He was disgusted he was spying on a DUDE as well probably, listening to the sister in law shower for 10 minutes then realized he was getting off on a neked man",
              "id": 177,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 305,
              "content": "I think husband definitely is hiding some peeping Tom tendencies. His reaction sounds a lot like when my best friends uncle (who years later got arrested for peeping) he freaked out when he saw 9yo me smell my armpit to check if I put on deodorant before my friend and I left her house and he even rushed to talk to my mom about my “inappropriate” behavior. OP needs to get her husband to therapy asap before he ends up catching a case",
              "id": 178,
              "comments": [
                {
                  "score": 60,
                  "content": "Bro what. In what world is a pit check inappropriate? If anything, it’s inappropriate NOT to do a pit check.",
                  "id": 179,
                  "comments": [
                    {
                      "score": 79,
                      "content": "He found her doing something he considered it unattractive (like husband of OP) and internalized it as not being lady like, even though she was 9.",
                      "id": 180,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 33,
                      "content": "Supposedly it was disgusting and should be done only in the privacy of my own room (that’s the excuse he gave me) what he told my mom on the other hand was something vague like op’s husband “found her doing something inappropriate and it makes him uncomfortable, you need to teach your daughter not to sexualized herself so young” and I had to swear to my parents that all I did was a quick pit check and we were so confused for years",
                      "id": 181,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 77,
              "content": "He's got the hots for SIL and doesn't want to be reminded that she's sleeping with another dude",
              "id": 182,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 32,
              "content": "Either he doesn’t have a valid answer or his answer will make his wife mad at him",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I was hot about that edit. It shows a deep unwillingness to consider other opinions.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 280,
          "content": "Look at ops update \nu/Throwaway22314157\n\n>My husband says he's uncomfortable and doesn't want to expand on the situation\n\nHe doesn't even want to talk about it with his wife. She never mentioned if they actually talked about it together, only that he won't \"expand\" on the situation he put himself in. He more than likely is hung up on ops sister and upset that he can't fantasize her alone in the shower or even go as far as peeking in when he thinks she's alone.",
          "id": 185,
          "comments": [
            {
              "score": 21,
              "content": "Or he wants to fantasize about her husband! /s \n\nThe husband knows he has no reason, and doesn't want to admit he's wrong. He would rather double down than admit he's being ridiculous.",
              "id": 186,
              "comments": [
                {
                  "score": 18,
                  "content": "Maybe he's also jealous because he and op are vanilla as fuck and they don't *ever* shower together. Maybe they did at one point and op decided to not do it anymore. Now he's angry about seeing another couple shower together when he doesn't get to do it anymore.",
                  "id": 187,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 73,
          "content": "They spend 10 minutes and walk out clothed. \n\nHusband and I used to share truck stop showers. We were just taking a shower and it took us 15 minutes! \n\nThere's only one bathroom and they're trying to be considerate.",
          "id": 188,
          "comments": [
            {
              "score": 21,
              "content": "There's four people and a kid in the house, with one bathroom. They would be assholes *not* to shower together.",
              "id": 189,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "Yup, my first thought was … and yes I know I’m reaching (but just telling the truth on my opinion)… that the husband has a thing for the sister. Because wtf, who cares. They’re saving water and occupying the bathroom for a smaller amount of time than if they showered solo. \n\nGood lord have some loyalty to your own sister. Y’all are making it weird. DON’T MAKE IT WEIRD.",
          "id": 190,
          "comments": [
            {
              "score": 20,
              "content": "Yup. That’s where my mind went, especially since he doesn’t wanna expand on the reason. Much simpler than the “weird sexual hangup “ theory I’ve been seeing in other comments",
              "id": 191,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Or for the BIL... 🤷‍♀️ this could go either way..",
              "id": 192,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "Ikr? Wait til he finds out they've also been sleeping in the same bed together every night in HIS VERY OWN HOUSE, RIGHT UNDER HIS NOSE.",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Sounds like hubby sexualizes her sister so any intimacy with another man irks him imo",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "That's my question too. Did it upset him cause they walked out dripping water on the carpet. Or they were wearing nothing but a skimpy towel and he doesn't wanna see the SIL that bare?\n\nIf his reasoning is not beyond those possibilities. Then YTA, this is no different than them having intimacy in their room.",
          "id": 195,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "And its the best place in the house to do it, no ones gonna walk in on them, water running will drown out noise, no mess. They are doing it in the most considerate way possible. \n\nYour husband has some major issues OP. If he doesn't want to elaborate to reddit, fine, but at least make him explain to you and your sister why he has an issue with them being in the bathroom at the same time. (Because its entirely possible there *wasn't* any hanky panky happening. Someone may have showered while the other was busy shitting, 10 minute shits happen, I would know.)",
          "id": 196,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9300,
      "content": "Wait….\n\nLet me see if I’ve got this straight.\n\nTheir child is so ill they’ve lost their home to cover his treatment….  And you freak out because they walked out of the bathroom together??????\n\nYTA doesn’t even come close.  \nJesus Christ.\n\n\nEdit to say thank you for all the upvotes and awards",
      "id": 197,
      "comments": [
        {
          "score": 1884,
          "content": "Right. Like... wtf. From the sounds of it, they're sharing a fucking room with their child in OP's home too. So this is likely the one and only time they get ANY freaking 'alone time'. FFS. \n\nYes, OP, YTA. The only bigger asshole here, if at all possible, is your husband. WTF is his (and your!!) problem!?!?",
          "id": 198,
          "comments": [
            {
              "score": 642,
              "content": "It’s also really weird that OP and husband are assuming the “alone in the shower time” just ~has~ to be sexual. Putting aside the fact that two adults having consensual sex in a space that’s basically the self cleaning shouldn’t be weird to anyone, they could be doing so many things in there! Using it as like bonding time to talk, just hold each other, maybe even cry in a safe environment where their ill child or OP won’t hear them. It might even be an ingrained habit to save on water/heating costs. As long as they aren’t breaking shit or fucking so loud people can hear them, who cares!!",
              "id": 199,
              "comments": [
                {
                  "score": 252,
                  "content": "For real and they’re even keeping it to 10 minutes.  I take solo showers longer than 10 minutes sometimes.  Definitely my average shower is more than 5 minutes, so they’re saving water compared to me.",
                  "id": 200,
                  "comments": [
                    {
                      "score": 86,
                      "content": "I completely missed where they said it was only 10 minutes... Omg.. that makes it so much worse... I can't even wrap my head around OP/her husband's thought process... I really hope the sister can find some other source of support and living arrangements asap....",
                      "id": 201,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 55,
                      "content": "If I’m having a particularly bad day I will vibe in a candlelit shower for like 30+ minutes all by myself, like ten minutes is... insanely short for two people. OP invite me to stay with you and experience true shower suffering",
                      "id": 202,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "I’m confused how OP’s husband knew for a fact they were both in the shower at the same time, too. Like, who’s to say one wasn’t in the shower while the other was going to the bathroom or bristling teeth/doing hair/applying makeup?",
                  "id": 203,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Wow I didn’t even consider this, I will often pee while my husband is in the shower or he will brush his teeth while I’m in there. It’s such second nature to me like... what is OP’s relationship w her husband with...",
                      "id": 204,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 812,
          "content": "As someone who lost their home in a similar fashion, this is so messed up to me. The amount of marriages that don’t last a seriously sick kid is staggering. A lot of relationships can’t handle the stress. \n\nThis couple still craves time to be alone together and OPs husband is set firm on shitting on them even further. And OP is letting him. \n\nDisgusting.",
          "id": 205,
          "comments": [
            {
              "score": 36,
              "content": "This is exactly what I'm thinking. This poor couple is going through so much. I hope OP sees this comment and is ashamed of herself and her husband for adding even more stressors to their lives.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Right! OP should be encouraging her sister to do things like this, to make sure the couple makes time for each other, that they don’t neglect their marriage due to the stress of having a sick child, losing their freaking home, & being under financial duress.",
              "id": 207,
              "comments": [
                {
                  "score": 19,
                  "content": "and even if they ARE having sex.. so what? if they’re not loud or obvious, who cares?",
                  "id": 208,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "Husband “doesn’t want to expand” on why that makes him uncomfortable????? 🚩🚩🚩",
          "id": 209,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 50,
          "content": "To the point right here. No details needed this is weird af on ops husband.",
          "id": 210,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": ">Their child is so ill they’ve lost their home to cover his treatment…. And you freak out because they walked out of the bathroom together??????\nYTA doesn’t even come close.\n\nFR tho. Something like this can literally wreck a marriage. Instead they are comforting each other and maintaining sexual needs discreetly - so discreet that nobody would've known had it not been for hubs seeing them walk out of the bathroom fully clothed - and are now being shamed for it.\n\nINFO OP: how many times have you and hubby offered to take nephew out to eat so that a married couple can do married couple things?",
          "id": 211,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 31,
          "content": "yeah idk why people are saying things like \"soft yta\" or asking for info, this is a huge and obvious YTA",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "Yeah this is so weird. Why do either of them care? I feel like this is a husband problem that he needs to deal with, without making it a family member with a sick kid's problem. They have enough.",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "This lady sounds off her chain terrible. Watch the sister and husband move out and never speak to them again and they'll be like, \"What did we do? We let them live here when they had nothing. We only requested they be shamed and follow our ridiculous rules. Now they don't speak to us. How dare them.\" 100%.",
          "id": 214,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "For real!! If I had a loved one going through that, they can take as much alone time as they can get and need. Idc if they were having sex or not. This is a really awful thing for them to go through and it's ridiculous to rob them of a time where they can be intimate and loving.",
          "id": 215,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "And my thing is if they have one bathroom its more convenient for the SIL and her husband to shower together that way they save on the water bill and the amount of time people take a shower",
          "id": 216,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9136,
      "content": "[deleted]",
      "id": 217,
      "comments": [
        {
          "score": 3559,
          "content": "I was having that same thought; why exactly is he uncomfortable at the mere thought of two consenting adults having sexual relations behind a closed door?",
          "id": 218,
          "comments": [
            {
              "score": 3000,
              "content": "And that’s assuming that’s what hey did in there. They could have just wanted privacy for a conversation. Or to cry together under the water. Or any number of non sexual reasons.",
              "id": 219,
              "comments": [
                {
                  "score": 768,
                  "content": "Ew yeah, I didn't think about the aspect that in their current living situation, OP's husband is basically forcing them to make their child see every emotion they have.  That's horrible.",
                  "id": 220,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 626,
                  "content": "As someone who's had a sick child, I'm 95% certain they're in there crying together because they don't want to do it in front of their child. I can't imagine dealing with that pain, and then also having lost their house.\n\nYTA",
                  "id": 221,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 132,
                  "content": "Right, plus if you have a regular shower and not some fancy lots of space one, shower sex really isn't all the movies make it out to be.  So though on some level it might be a convenient time, on other it is probably more easily a place to have a moment to grieve everything they have lost together, a moment where they don't have to try to keep it together.",
                  "id": 222,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Or to just take a shower!",
                  "id": 223,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "I never thought of that. They could be discussing something really sensitive (money, sick child, living arrangements, creepy brother-in-law, controlling uptight sister) knowing they couldn’t be heard with the shower running.\n\nWhatever they were doing, it’s none of OP’s business.",
                  "id": 224,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "The fact that he only saw them walk out of the bathroom CLOTHED and assumed they had sex in the shower? Like what?",
                  "id": 225,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 772,
              "content": "And saving water at the same time! Win/win!",
              "id": 226,
              "comments": [
                {
                  "score": 31,
                  "content": "and no soiled linens!",
                  "id": 227,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Water AND time. It’s the only bathroom, be happy you have extra time in case of, yknow, butthole emergencies 😂",
                  "id": 228,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 608,
              "content": "They most likely weren't even having sex. But poor hubby was so bothered because two married people are seeing each other naked! Danger!!!!",
              "id": 229,
              "comments": [
                {
                  "score": 36,
                  "content": "Two married people _with a child_! They've clearly done _it_ before, it might happen again!!1",
                  "id": 230,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "MARRIED adults at that! With a child, so it’s clear they’re sexually active. It’s so weird.",
              "id": 231,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "And odds are they weren't even having sex, they were probably talking about who was doing what that day. OP? definitely YTA.",
              "id": 232,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Bold assumption that they were having sexual relations. So many people have commented that showering with a partner is more often than not more about the nonsexual physical and emotional intimacy and silliness than the, “ohhhh nakey shower sex.”",
              "id": 233,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "If they were having sex -- I know I couldn't take a complete shower and have a full session of lovemaking in ten minutes.  YTA, and why on earth is your husband such a prude?  His attitude seems very odd to me.",
              "id": 234,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "Even if they're super traditional or religious....the consenting couple are *married*. Did they think a married couple aren't going to get it on from time to time? What a weird thing to be upset about",
              "id": 235,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "They likely aren't even having \"sexual relations\"... My partner and I shower together often, it's bonding time for sure, but *most* of the time, that's it. Nothing sexual about it.",
              "id": 236,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1201,
          "content": "This sounds like one of those situations where the husband has some kind of weird sexual hangup, and the wife (OP) doesn't necessarily have that same hangup but immediately jumps to be on his side because he's her husband.\n\nThat sucks. You (OP) don't have to automatically agree with your husband. Have a conversation with him. He either has some kind of issue about others being close/intimate, or he just really doesn't want your sister and your brother-in-law in the house anymore. You should dig in a little more and find out what's bothering him. In any case, the sister and brother-and-law aren't doing anything wrong here, unless they walked around the house naked or something.",
          "id": 237,
          "comments": [
            {
              "score": 54,
              "content": "That's the feeling I got too. OP doesn't mention that she was also grossed out, only that she did as her husband asked without question. I think that's also why her sister was so angry—OP doesn't have a single actual reason for wanting her sister and BIL to stop showering together, especially when in all likelihood they hadn't actually *done anything* (have sex), they were just enjoying being alone together. \n\nI bet OP's sister, BIL, and nephew all share one room together in OP's home.",
              "id": 238,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 922,
          "content": "Every time someone posts the quote “My husband rushed in” I imagine a fully grown man speed walking  with purpose around a house to get to his wife",
          "id": 239,
          "comments": [
            {
              "score": 242,
              "content": "I imagine him with one handle on the door knob and one bracing the other side of the door frame, out of breath, huge step, leaning forward with their upper body. \n\nBut I guess that would be more bursting in than rushing",
              "id": 240,
              "comments": [
                {
                  "score": 101,
                  "content": "Gotta add *while clutching his pearls*",
                  "id": 241,
                  "comments": [
                    {
                      "score": 9,
                      "content": "His testicles?",
                      "id": 242,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": ">I imagine him with one handle on the door knob and one bracing the other side of the door frame, out of breath, huge step, leaning forward with their upper body.\n\nLike Homer leaning into Bart's room to scare him.",
                  "id": 243,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "I imagine Kramer entering Jerry's",
              "id": 244,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I picture this too. Walking like the speedwalkers I used to see walking around the mall. Glad someone else pictures it that way",
              "id": 245,
              "comments": [
                {
                  "score": 13,
                  "content": "Moooommm!!! I mean...Honeeyyy!!!",
                  "id": 246,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I imagine a fully grown man throwing a door open and running in, completely out of breath. And he’s unable to say anything until he gets his breath back after a comically long amount of time, hands on his knees, holding up one finger in a “hold on” sign, etc. Kind of like in a cartoon or sitcom.",
              "id": 247,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 254,
          "content": "They don't even know that they had sex! Plenty of couples just shower together. Weird for the husband to immediately jump to that and then go tattle and try to get them to quit.",
          "id": 248,
          "comments": [
            {
              "score": 55,
              "content": "Me and my fiancee shower together a few times a week, but in our 7 years together, we haven't had sex in shower even once. Naked people can be intimate without touching the nasties.",
              "id": 249,
              "comments": [
                {
                  "score": 44,
                  "content": "Honestly it's just kind of childish to immediately assume being naked or close together means sex like OP's husband did. Couples sleep scantily clothed in the same bed, they change in front of each other, they shower together, all of those things usually don't involve sex. Also makes me wonder how good their romantic life is if he thinks you can't be intimate without having sex...",
                  "id": 250,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "We don’t either. Just some fun non sexual intimacy.",
                  "id": 251,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I have a medically intense kid. He’s all grown now and doing well, but there were days my husband and I got in the shower and he held me while I cried. Literally that’s all we did. The sound of the water and the feeling of it washing over me let me cry and get it all out and my husband held me and kept me safe from falling. There is so much more to intimacy and the OP and her husband clearly have no clue. I kinda feel sorry for them that they’ll never know that kind of love.",
              "id": 252,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 42,
          "content": "Also, how hot is the sister?",
          "id": 253,
          "comments": [
            {
              "score": 32,
              "content": "Ok, my initial reaction was hubs is pissy cause he's jealous of the bil. Glad you said this.",
              "id": 254,
              "comments": [
                {
                  "score": 25,
                  "content": "I suspect either he's crushing on the sister and doesn't like it rubbed in his face (so to speak) that she has an intimate life with a man who isn't him, in his house. \n\nOr he's the type of cishet man who is so terribly fragile that other men doing intimate things in his vicinity (like in the bathroom that the whole household uses) threatens his masculinity somehow.",
                  "id": 255,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "That’s the first thing that came to mind. They have a kid but as long as he doesn’t SEE anything suspicious the fantasy lives on. Now it’s shattered. Why else wouldn’t he be able to just say why it makes him uncomfortable?",
              "id": 256,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 41,
          "content": "I’m so glad people are roasting them for the husband rushing into the kitchen to snitch on a married couple doing something completely normal. YTA. I hope your husband can find some hobbies.",
          "id": 257,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "The fact that in the edit the husband ‘refuses to expand’ on it says it all.",
          "id": 258,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4870,
      "content": "Your husband is upset because your grown, marrieded sister *might* have been what? Showering together or *showering together*? Either way that's kinda weird. Especially if he felt the need to go tattle to you about it.\n\nDoes he expect them to not sleep together, too? Because he might be shocked by the things that happen in a bed! \n\nThey're going through a rough time, they need a bit of time without you guys or the kid around (and unless there's enough rooms that they don't have to bunk with the kid, that's not happening). Soft YTA for you, your husband is A H for making a big deal out of this.",
      "id": 259,
      "comments": [
        {
          "score": 1171,
          "content": "I think part of the issue is it sounds like them and their kid are in the same room... so they're not *gonna* be able to do anything in bed. \n\nThey saw the bathroom as a safe space they could get some privacy. I still say OP is the asshole, where else are they supposed to do it? In a car on a public road like teenagers? Adults don't get off so easy for being caught at that...",
          "id": 260,
          "comments": [
            {
              "score": 437,
              "content": "I think OP husband has some issues with intimacy. Unless they're super religious, who in their right mind would get so upset about it?",
              "id": 261,
              "comments": [
                {
                  "score": 9,
                  "content": "I think OP’s husband is into OP’s sister",
                  "id": 262,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Honestly when my spouse and I are burned out, sometimes a shower together is literally just a shower. Just a hug in some warm water. When you don’t have the energy for more but just want to reconnect in a moment of peace.",
              "id": 263,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Either way it's ten minutes in the bathroom most people take longer than that alone... And even if they we're doing it in the shower why does it matter? We're they loud? Apparently not we're they maybe just trying to get some peace for themselves? Pretty much looks like it . Is her hubby jealous? Absolutely no doubt about it especially since he basically ran to tattle like a child who wants the same thing.",
              "id": 264,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3975,
      "content": "YTA. What two consenting adults do in a bathroom is none of your business. If you couldn’t hear them and they didn’t walk out naked, what does it matter? \n\nFurthermore, it kind of sounds like your husband is jealous. 🙃",
      "id": 265,
      "comments": [
        {
          "score": 807,
          "content": "Yup! Husband is legit jealous.",
          "id": 266,
          "comments": [
            {
              "score": 32,
              "content": "Or they were raised with unhealthy views on sexuality and human bodies.",
              "id": 267,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 359,
          "content": "Yep, husband has a crush on ops sist3r.",
          "id": 268,
          "comments": [
            {
              "score": 61,
              "content": "Or the BiL. 🤫",
              "id": 269,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1881,
      "content": "YTA. They’re adults. They took a shower together. Me and my husband shower together every single day. Now I may not personally do it at someone else’s house, but I really don’t see how it’s some scandalous thing either way. Unless you can hear them banging or something, there’s literally no reason you should be concerned with it. Tbh you and your husband are weird for even caring imo.",
      "id": 270,
      "comments": [
        {
          "score": 347,
          "content": "I don’t shower every day with my fiancé, and when I need to shave legs and “bits”, I prefer to not have a witness, not to mention our walk in shower doesn’t have space for the contortions needed for my shaving and him at the same time, but most the time when we shower together there isn’t even anything super sexual.  It’s just 10-15 minutes of time alone, as a couple, where we take time to interact closely with each other and relax.  Telling a married, highly stressed out couple that they can’t take 10-15 minutes to themselves to de stress and reconnect as a couple before facing the day is BS.  Also, “save water, shower with a friend”.  If it’s the only bathroom, they’re saving you big on water bills and morning routines, so tell your husband to suck it up for a couple weeks till they’re back on their feet. YTA",
          "id": 271,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1730,
      "content": "YTA let her have some time with her husband. So weird your husband even cares about this.",
      "id": 272,
      "comments": [
        {
          "score": 1282,
          "content": "I find it really weird that he happens to incidentally catch them coming out the shower, yet he: \n\nknows they made no noise during the entire shower, \n\nknows the length of time they are in the shower (consistently)…",
          "id": 273,
          "comments": [
            {
              "score": 526,
              "content": "This is what makes me think he's got his panties in a wad about this totally stupid non-issue because he's been trying to spy on OP's sister in the shower and he's getting pissed off that her husband is ruining the show for him. People have a right to lay down boundaries for guests in their home, but being uncomfortable with a married couple quietly taking a shower together is just so weird and nonsensical. It feels like he has a creepy ulterior motive.\n\nOP you are the asshole and so is your husband.",
              "id": 274,
              "comments": [
                {
                  "score": 201,
                  "content": "And this is why (according to OP’s edit) he won’t give a reason as to why this bothers him. He doesn’t have a valid or rational reason, so he just says it makes him uNcOmFoRtAbLe",
                  "id": 275,
                  "comments": [
                    {
                      "score": 55,
                      "content": "1000%. He's got to be a Peeping Tom.",
                      "id": 276,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 38,
                  "content": "Right? Next up on r/LegalAdvice ***Help! I found a camera hidden in my sister's bathroom***",
                  "id": 277,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I shouldn't have laughed at this, but... 💀",
                      "id": 278,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "We don't necessarily even know that they were having sex in the shower. Maybe she's just trying to keep husband from peeking, lol.",
                  "id": 279,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 63,
              "content": "I was thinking the same thing.  Why was he listening in?",
              "id": 280,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Yeah, OP’s husband is a creep. This is also super uptight and controlling. Who cares?? Two married adults took a shower together…. So effing what? I will never understand all these people who are so bent out of shape at the thought of other people having sex in their houses. Get a life. YTA, and so is your creepy husband. Tell him to stop monitoring your sister’s bathroom usage.",
              "id": 281,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "I WAS THINKING THE SAME THING!!!! Dude was lurking by the bathroom. Fuckin WEIRD.",
              "id": 282,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1699,
      "content": "YTA.  You and your husband both. Neither of you would have been aware of them \"showering\" together until hubby saw them come out of the bathroom together.   You didn't hear them doing anything, didn't feel banging on the walls, just saw them come out of the bathroom together.   What's next?   They sleep in separate rooms because you might see them go in the room together and imagine them laying down in the bed together?  GASP....  the horror and sinfulness of it all.   How dare they!",
      "id": 283,
      "comments": [
        {
          "score": 68,
          "content": ">Neither of you would have been aware of them \"showering\" together until hubby saw them come out\n\nOPs husband said the shower was 10mins, so he was keeping tabs from the start.. for some reason... 🥴",
          "id": 284,
          "comments": [
            {
              "score": 32,
              "content": "That's just creepy and kind of icky.  Just what does he think they could have done in 10 minutes other than wash up?  And why does he care?   Is he jealous?   What's the deal?",
              "id": 285,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 52,
          "content": "Did you ever see the Patriot? There was that scene where the man and the woman were sewn into individual sacks so they wouldn't do anything \"sinful\". I think it was Heath Ledger.",
          "id": 286,
          "comments": [
            {
              "score": 33,
              "content": "Lol.  That was too funny.   I wonder if OP and her husband are clutching their Victorian pearls at the idea of them being in the same room together without a chaperone.   Oh my...",
              "id": 287,
              "comments": [
                {
                  "score": 36,
                  "content": "Unfortunately they do have a chaperone in their room and it's their kid :(",
                  "id": 288,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Plus, who is to say they didn't go into the bathroom and just talk or cry together and turn the shower on to drown out them crying together?",
          "id": 289,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "The amount of times I've sat in the bathroom while my wife is in the bath/shower is beyond counting now. Sometimes it's because we were busy that day and missed eachother, sometimes it's because we need to discuss something and sometimes it's because I like the way she looks naked. We do sleep in separate rooms though, we're both very picky sleepers sand realized early on that eventually one of us would end up in prison if we confined to she the same bed.",
          "id": 290,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Imagine if they have sex!!!! Lord have mercy. She would throw a chasity belt on her.",
          "id": 291,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}