{
  "post content": "First post/throwaway and on mobile, here it goes - for my sides guests the only children invited would be my nephews and two children that will be flying in with their parents and grandparents(my aunt and uncle) from another country. They are all roughly the same age (8-12years). I have big families on both my maternal and paternal sides. My mother is worried that my aunts and uncles on both sides of my family will be offended that their grandchildren aren’t invited. Couple reasons I don’t want to invite all the kids - the kids on my paternal side can be very bratty. Straight up I am not a fan of them. The kids on my maternal side are much better behaved even though they are quite a bit younger and there are a lot more of them. \nIf we were getting married at the usual hall that everybody gets married at and is quite inexpensive I think I would put up with the bratty kids and invite them all. However, we’re getting married where the groom is from and it is five times more expensive and much more ‘posh’. I know that you’re not supposed to look at how much money you might make in gifts, but you hope to recoup some of the costs for at least the meal in wedding gifts. I know that we’ll end up in the hole paying for the families with kids. That might make me the asshole just for thinking that. I’m trying to save costs by cutting cousins kids from my list . . . Here’s the kicker my fiancé included kids on his list - there are about 5-6. He is convinced that his guests will cover the costs of their kids IF they decide to bring them.  I know that some of my cousins already intend on bringing their kids as they’ve already made comments about getting their kids new outfits even though invites haven’t gone out (it was not the time or place to say no kids when this comment was made). I’ve dropped hints to my maternal cousins that I wasn’t including cousins children and they seem fine with it and understanding even when it was explained that the out of country kids would be there. Again my mom still thinks that it will ruffle feathers if there are kids on fiancés side but not mine. My fiancé who is not as frugal as I can be thinks I should just invite them all. So if you made it this far and can get through the family tree . . . Would I be the asshole for standing my ground? (Invites haven’t gone out yet - but will be soon)",
  "id": 1,
  "comments": [
    {
      "score": 5,
      "content": "NAH, it's your wedding, invite who you want. It may cause tension but your not an asshole for doing it.",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "I'm with this. It's definitely piss off the uninvited family members, and be prepared to hear the cousins refuse to go, but it's your wedding. NAH.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA and I didn't even read it. It's your wedding, you are under no obligation to invite anyone you don't want to invite",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFirst post/throwaway and on mobile, here it goes - for my sides guests the only children invited would be my nephews and two children that will be flying in with their parents and grandparents(my aunt and uncle) from another country. They are all roughly the same age (8-12years). I have big families on both my maternal and paternal sides. My mother is worried that my aunts and uncles on both sides of my family will be offended that their grandchildren aren’t invited. Couple reasons I don’t want to invite all the kids - the kids on my paternal side can be very bratty. Straight up I am not a fan of them. The kids on my maternal side are much better behaved even though they are quite a bit younger and there are a lot more of them. \nIf we were getting married at the usual hall that everybody gets married at and is quite inexpensive I think I would put up with the bratty kids and invite them all. However, we’re getting married where the groom is from and it is five times more expensive and much more ‘posh’. I know that you’re not supposed to look at how much money you might make in gifts, but you hope to recoup some of the costs for at least the meal in wedding gifts. I know that we’ll end up in the hole paying for the families with kids. That might make me the asshole just for thinking that. I’m trying to save costs by cutting cousins kids from my list . . . Here’s the kicker my fiancé included kids on his list - there are about 5-6. He is convinced that his guests will cover the costs of their kids IF they decide to bring them.  I know that some of my cousins already intend on bringing their kids as they’ve already made comments about getting their kids new outfits even though invites haven’t gone out (it was not the time or place to say no kids when this comment was made). I’ve dropped hints to my maternal cousins that I wasn’t including cousins children and they seem fine with it and understanding even when it was explained that the out of country kids would be there. Again my mom still thinks that it will ruffle feathers if there are kids on fiancés side but not mine. My fiancé who is not as frugal as I can be thinks I should just invite them all. So if you made it this far and can get through the family tree . . . Would I be the asshole for standing my ground? (Invites haven’t gone out yet - but will be soon)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "INFO Why do you need to pay the kids way?",
      "id": 7,
      "comments": [
        {
          "score": 1,
          "content": "Paying for kids/youth meals ($100+ per kid)",
          "id": 8,
          "comments": [
            {
              "score": 1,
              "content": "Then NTA if they want their kids there they should cover the costs",
              "id": 9,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Usually the caterers have a kid option (like chicken fingers and fries) that is significantly cheaper than the adult meals.",
              "id": 10,
              "comments": [
                {
                  "score": 1,
                  "content": "That is the kid option :s",
                  "id": 11,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Holy crap. That sounds like an incredibly expensive wedding. Granted, I got married 11 years ago and we had about 80 people, but the cost for their meals was definitely not $100 each and we had an open bar, passed hors d'oeuvres, and the cake. We spent about $20k for EVERYTHING (food, venue, flowers, decorations, minister, DJ, photographer, tuxedo and my dress).",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": " NTA You can limit the kids you want at your wedding to the kids you know will behave and enhance your day. It’s definitely more expensive to invite them because you still have to pay per plate for them, so save the cost and send them all a little note saying as much as you’d love to see them, you don’t want them to be bored at the wedding but you’ll make sure to come see them soon! Don’t feel bad about only wanting the kids your comfortable with there!",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "No aholes here",
      "id": 14,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "People understands that the people from out of country have to bring their kids, but You can't have your fiancees side bring cousins kids and not yours.\nI would be very insultet if I had to let my kids stay home while other cousins of the bride and groom can bring theirs.",
      "id": 15,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA you can invite whoever you want. However if you invite cousins kids from grooms side, it would be fair to do the same for your side. Having nieces/nephews and overseas kids who have no babysitting choice only seems fine though?",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "YTA.. invite all or none.",
      "id": 17,
      "comments": [
        {
          "score": 1,
          "content": "I mean, she can’t control the grooms side of the family, and it makes sense that only the children who are coming from out of country are invited to the wedding because it’s extremely difficult to expect the parents to agree to let a sitter watch them in a country they aren’t or are less familiar with.",
          "id": 18,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "It’s her wedding her money she can invite whoever she wants....",
          "id": 19,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}