{
  "post content": "I was at a comedy show and the comedian made a joke referencing a joke the previous comedian made, problem is that comedian didn't make that joke (apparently he does it all the time) so the audience was confused. \n\nSomeone then said the first comedian kind of sucked, it wasn't that loud so I couldn't tell if he was actually heckling or if he just accidentally spoke to loud but the comedian heard it and asked him \"would you like to come up here for 5 minutes\" and the guy responds with \"no I'm not funny\" then the comedian says \"then shut up, you can't determine what is and isn't funny then\" the crowd goes wild cheering him on\n\nI then say \"I don't need to be Gordon Ramsey to say a meal is shit, just like I don't need to be a mechanic to know there's a problem with my car if there's smoke coming out of the engine. You don't need to be funny to think a joke isn't funny\" \n\nThe comedian then just said \"security can you get these 2 out of here\" \n\nMy girlfriend is pissed saying I ruined the comedy show. I think that comedian was just kind of a dick.",
  "id": 1,
  "comments": [
    {
      "score": 855,
      "content": "ESH. Comedians who can't handle hecklers are in the wrong business. People who heckle comedians are assholes, and that includes you OP.",
      "id": 2,
      "comments": [
        {
          "score": 143,
          "content": "The comedian handled the hecklers just fine by having them removed.",
          "id": 3,
          "comments": [
            {
              "score": 91,
              "content": "Did he though ? \n\nIts kind of like when a teacher's runs off in school to get someone more senior. The whole thing is just a tacit acceptance the kids won. \n\nThe reason you don't heckle a comedian is because you're worried you'll get utterly rinsed and humiliated (or just manners). Not because you're worried about being escorted out by security.",
              "id": 4,
              "comments": [
                {
                  "score": 109,
                  "content": "No. The \"whole thing\" is removing the problem person so that the person getting paid to do a job can get back to doing that job ASAP.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 55,
                      "content": "The best comedians can shut down hecklers in a funny way so the rest of their patrons don't have a shitty experience. This guy didn't even try and he went straight to throwing them out. ESH.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": -8,
                      "content": "tbh that's not how stand up works lol, if you're not funny enough to tackle a heckler with your wit maybe you should do an entirely different job",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -9,
                      "content": "Whole thing says to me that they can't go off script.\n\nIt must have been a pretty shite comedian, so maybes he's an asshole too for charging for a sub standard service?",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 30,
                  "content": "The crowd didn't come to listen to hecklers.  If a joke is bad, don't laugh.  If the comic is offensive get up and talk to management.  But don't screw with the rest of the audience's ability to have their night.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I mean also because you're a considerate human being who knows it isn't your time to talk. You don't think a movie is going to tell you off but you still shouldn't yell at it, in the cinema.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -10,
              "content": "If he'd simply had them removed without throwing a fit about it, I would agree.\n\nThey perform to drunk people. Find thicker skin because comedians getting all aggressive at drunk, stupid college boys is not a good look.",
              "id": 11,
              "comments": [
                {
                  "score": 25,
                  "content": "As a former college girl, I fully support anyone who gets aggressive at drunk, stupid college boys.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "The comedian chose to engage with the \"heckler\" (its not clear they were). At that point I think OP is in the clear.",
          "id": 13,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 361,
      "content": "YTA… if a joke doesn’t land for whatever reason. You don’t interrupt the show… that makes you an automatic A. \n\nThe same way you don’t interrupt a theater performance if someone botched their lines.",
      "id": 14,
      "comments": [
        {
          "score": -18,
          "content": "[deleted]",
          "id": 15,
          "comments": [
            {
              "score": 32,
              "content": "While I tend to agree, other people paid to see this guys bit and it doesn’t sound like he was inviting the audience to join. \n\nIt just sounds like he was frustrated his joke didn’t land then got heckled. OP is still the asshole.",
              "id": 16,
              "comments": [
                {
                  "score": 4,
                  "content": "[deleted]",
                  "id": 17,
                  "comments": [
                    {
                      "score": 20,
                      "content": "He was frustrated by a joke then interrupted in the middle of his bit not once but twice. So yeah, I think he had reason to get frustrated and have him removed. \n\nI love going to comedy shows. I don’t care how bad the comedian is, I didn’t pay to hear some rando person be a drunken ahole. I paid to hear the bit, unless it involves actual audience interaction, You Do Not Interrupt The Bit.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 303,
      "content": "YTA don't heckle. It's supposed to be a show not a conversation. If you interupted a play because you had a counterpoint to something an actor said would that be okay? It's not different. Keep your remarks to yourself.",
      "id": 19,
      "comments": [
        {
          "score": -273,
          "content": "I think it's a bit different because comedians interact with the audience, plays never do, though I understand your point",
          "id": 20,
          "comments": [
            {
              "score": 192,
              "content": "> plays never do\n\nSomething tells me you don’t know theatre that well if you think plays never do, no offense.",
              "id": 21,
              "comments": [
                {
                  "score": 16,
                  "content": "Ugh I used to do this one show with a RHPS sort of vibe... at the beginning of the play, the audience is encouraged to heckle, yell things out, etc, with the explicit goal of being funny enough to make the actors break character. One time we sold concessions that included things to be thrown at us at certain points in the show. It was such incredible fun.\n\nThey only got me once. Someone threw out the most incredible pun of a comment. Didn't even make it offstage, as soon as I was behind a set piece I lost it in silent laughter.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 1,
                      "content": "That sounds really cool! Do you remember the name of the show?",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 47,
              "content": "It’s not. You’re not allowed to disrupt the show a magician puts on with your own card tricks just because there are certain pre-planned points at which he involves one member of the audience in a guided and purposeful manner. YTA and if you can’t see why you should not go to comedy shows.",
              "id": 24,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "No. Unless a comedian is clearly trying to interact with the audience, it is not an interactive experience. In this case, telling a heckler to shut the fuck up is not inviting more interaction.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">comedians interact with the audience\n\nThey do not want to do this",
              "id": 26,
              "comments": [
                {
                  "score": 2,
                  "content": "They do sometimes, but only on their own terms.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 240,
      "content": "YTA but mostly because you said a mouthful instead of going for one funny line\n>\tI don’t need to be Gordon Ramsey to say a meal is shit ~~just like I don’t need to be a mechanic to know there’s a problem with my car if there’s smoke coming out of the engine. You don’t need to be funny to think a joke isn’t funny~~\n\nBig miss not just saying the first part",
      "id": 28,
      "comments": [
        {
          "score": 135,
          "content": "I refuse to believe he got this entire 72 word response out while he was heckling lmao",
          "id": 29,
          "comments": [
            {
              "score": 89,
              "content": "I've seen it. By the end everyone was cringing, the heckler was nowhere near as confident sounding by the end, and I still have second hand embarrassment 5 years later.\n\nGot shut down with something like \"wow you like the sound of your own voice\"",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "\"Well I may not be Gordon Ramsey..\"\n\n\"What?\"\n\n\"I said I'm not Gordon Ramsey, but I know shitty food, and if I was a mechann-\"\n\n\"Cool story bro\".",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 88,
      "content": "YTA. \n\nDon't heckle. Ever.",
      "id": 32,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 71,
      "content": "YTA.\n\nWhen you are watching a live performance, don't talk. This is not complicated.",
      "id": 33,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 53,
      "content": "YTA hecklers are the worst.",
      "id": 34,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 50,
      "content": "ESH - comedian sounds insecure, hecklers shouldn’t heckle, heckler supporters should just not support the sucky comedians",
      "id": 35,
      "comments": [
        {
          "score": 9,
          "content": "Or just walk out if you don't enjoy the show. I agree ESH",
          "id": 36,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 43,
      "content": "YTA. Not because you argued with the comedian but because you negatively affected other people’s nights. On a date this is especially bad. People go out to let loose and relax and then you tried to have some sort of half assed ideological fight with a comedian.",
      "id": 37,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 41,
      "content": "You deserved to be kicked out.  The comedian handled this pretty well then you opened your mouth trying to be a wise guy/savior.\n\nNext time hush up and let the show continue. And no the comedian wasn't opening themselves up to a debate or sorts.\n\nHe said one person can't determine what is and isn't funny. He was right. It depends on the room that night I think. \n\nJust because the one dude said he sucked doesnt make it true or false.\n\nYou didn't need to come in like the class agitator scoring points with the the cool kids by giving the teacher shit.\n\nYta and not want the audience paid to hear that night.",
      "id": 38,
      "comments": [],
      "relation": "Attack"
    }
  ]
}