{
  "post content": "\n\nMy M30 brother in law M20 \"Sean\" moved in with me and his sister after my father in law passed away few months ago.\n\nHe is the private type and keeps to himself. He goes out and never say where he's going or how long he'll be out, eats at random times during the day, wears earpuds while me and the kids are sitting with him. See, all of these are uncool behaviors and a bad influence on my children. I've already talked to Sean about certain house rules I have and how he was violating them maybe because he didn't but now he knows and still nothing's changed.\n\n\nLast night, he came home late at around 10pm. I wasn't thrilled with that because he knew the rules but he said that he was an adult and I shouldn't be policing him but it's not about that, it's about the fact that he's repeatedly disrespected the homeowner and the rules...So I told him this: \"If he won't respect the rules which are: Being home at 8, not eating at random times, and not using his electronics just like my kids aren't allowed when the family is gathered to spend time together. He ranted about how he wasn't a child, my child and called me unreasonable to treat him this way just because he lives under my roof, I told him it's not hard to show respect really but my wife went off asking what was wrong with me to be giving Sean who's still grieving, ultimatums and treating him like a child. I explained to her that I'm just making sure the kids won't be influenced by her brother's reckless behavior and she laughed asking if I think Sean being on his phone was reckless but that is besides the point. She called me a control freak and told me to get off her brother's back and leave him alone. I replied that she's just saying this because he's her brother but she said I overstepped and should back off and stop trying to control her adult brother. I asked her if she was happy with him coming home late and she said she was sick of arguing then went upstairs.\n\n\nAITA here?",
  "id": 1,
  "comments": [
    {
      "score": 57792,
      "content": "YTA.  Your wife is right. Why on earth should a 20 year old have a curfew and have his eating times policed? Also, you made a unilateral decision about your wife’s brother without even consulting your wife?\n\nYou sound already like an overbearing parent, and this is towards an adult who isn’t your kid. I feel horrible for your wife and kids.",
      "id": 2,
      "comments": [
        {
          "score": 15280,
          "content": "He is definitely the asshole, the fact that he treating his brother in law like he one of his kids is ridiculous. And I very much agree with his wife 100%",
          "id": 3,
          "comments": [
            {
              "score": 9503,
              "content": "Those children must fear this man. He is policing everything about their life. There is a difference between parenting and policing. What OP is doing is going to lead to a lot of anxiety and resentment on his children’s part.\n\nAlso, this will likely negatively impact his marriage. How will his wife feel when she knows she failed her brother when he needed her the most? And to know that it was because of her stubborn husband.\n\nOP you really need to reevaluate your views on parenting and as a partner or it will likely come back and bite you in the ass in 10 maybe 20 years. Divorce (or fractured marriage) and alienated children will likely be in your future if you do not reevaluate and improve as a person.",
              "id": 4,
              "comments": [
                {
                  "score": 4060,
                  "content": "YTA- 8 pm curfew for a 20 year old?  When you said that he came in at 10 I was wondering what he had done wrong. With everything that you said that you said that he did I was thinking, “What did he do wrong?” \n\nYou are a control freak with no respect for anyone other than yourself",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2813,
                      "content": "I thought the same thing- coming home at 10PM?  How scandalous!  I bet the young scamp was prowling the town, trying to look at women's ankles!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 725,
                      "content": "8pm is absolutely ridiculous. My curfew at 16 was 11pm.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 581,
                      "content": "I feel like no one is mentioning that this kid also just lost his father a few months ago. He's 20, just lost his father and his home, and has to live with his sister and her controlling husband. Feel a lot of sympathy for that kid.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 484,
                      "content": "My immediate thought was that sounds like prison. At 20 I was working jobs that kept me out past 8, I couldn't imagine having to be home by then. In the summer it's still light out until 8:30. If OP is so concerned about the kids wanting to stay out as late as their uncle, all he has to do is explain the difference between being a grown up and a child. The ear bud thing I kind of agree with.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "For context my 4th  grader doesn’t get out of basketball until after 8 . I cannot imagine telling a grown man he has to be in the house before my 4th grader was done at basketball 😆",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Could you imagine being 20 and being told to be home by 8pm? Most 20 year Olds don't go out until that time lol.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Totally agree. I was super  flexible with both my kids about curfews. The requirement was to let me know if you were going to be later than expected and use common sense about time. Neither of them abused the privilege. When they lived with me during college or for a time after college, I did not police their comings or goings, their eating habits, phone use, etc. They are adults. Expecting them to follow any sort of rules beyond those that are common courtesy (eg. cleaning up messes, being respectful of personal space, etc.) or safety (it is good to let someone know where you are going at night) is ludicrous. This dude's kids are going to HATE him. YTA",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I'm thinking he's not a fan of his BIL getting support from outside the home. At least I hope the BIL is going and chilling at his friends' houses and getting some much needed emotional support (or even just a moment of relaxation!).\n\nSuper classic control freak (or worse) behavior. OP has already torpedoed his relationship with the BIL (at 20 I don't expect BIL to give a second chance) and now is going to nuke his entire family because he's mad about it.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "The BIL sounds like a perfect roommate, to be honest. I kept waiting for the issues, but there were zero.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "No joke. At 20 I had jobs that didn't let me off until ten or later. If my house had a \"rule\" ~~curfew~~ of 8pm, I'd never be in adherence of that shit rule.\n\nYTA - OP is a major asshole.",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 911,
                  "content": "OMG yessss exactly what I was thinking!!! Lordy u said it, u took it right out my mouth! His kids will resent him and his wife will divorce him. I definitely see that coming if he don’t change his ways. He sounds controlling to controlling to the kids and I get a if it’s not my way it’s no way vibe from him and that is definitely not good. OP I’m sorry but we on ur wife side here",
                  "id": 16,
                  "comments": [
                    {
                      "score": 856,
                      "content": "ITA. I would not want someone raising my kids to adulthood with the amount of policing, control, arbitrary rules and projecting malice and bad intent on every random thing other people do. Also, casting  ill-will on others not constantly giving you attention and asking your leave/explaining when they come and go is classic narcissistic personality disordered behavior. I bet there are a lot of landmines of \"not okay to speak\" subjects that you can't discuss with OP if you don't agree with everything he says, like politics, religion, race, etc.\n\nOP also just makes up labels to justify his need control anything. It's not a \"curfew\", it's a \"rule\" that the other adult has to be in the house by 8 pm. Since it's a \"rule\" and not a \"curfew\" then it's okay for some magical reason. It's \"uncool\" to be on your phone or wear earbuds in the house. \n\nIf OP can come up with an ugly label for something, then apparently he thinks it's okay for him to ban other people from doing it. Likewise, if he can come up with a nice label for something he wants to do, then it's perfectly okay for him to do that thing to others.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I really cannot imagine how his kids will behave once they are out fo the house if OP  think \"reckless behavior\" is staying out until 10 pm and eating at \"random\" times.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 561,
                  "content": "I feel like OP is probably LE, or in service/was in service. They need to control everything, and if you don't live by their ways, they'll do anything and everything to make it seem like you're an asshole.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 795,
                      "content": "I read \"LE\" as Lawful Evil instead of Law Enforcement. Which... I mean.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 208,
                      "content": "Agree OP has a fragile ego that actively seeks control over others and placating towards him. OP likely feels in control, while he is actually the weakest link for continuously needing attention, energy, ego-stroking and stuff from others.  YTA OP",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 202,
                      "content": "Ex-active duty personnel spouse here.  Can 100% confirm that service fosters narcissism and control freak issues.  They \\*never\\* self evaluate either, they just issue orders and expect the good little soldiers in their house to salute and follow them.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 140,
                      "content": "[deleted]",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 202,
                  "content": "God, I hope it's sooner than that. The fact the the wife had clocked that he is overbearing is a good sign. Hope her, her brother, and those poor kids are out by the end of the year.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 191,
                  "content": ">Those children must fear this man. He is policing everything about their life. There is a difference between parenting and policing. What OP is doing is going to lead to a lot of anxiety and resentment on his children’s part.\n\nyup! my dad is just like op. i am thirty with severe complex ptsd and have no relationship with him and literally plan to throw a party when i learn he's dead",
                  "id": 25,
                  "comments": [
                    {
                      "score": 22,
                      "content": "I'm a little bit older than you, and I have the same plan. I told my mom that I plan to be at the funeral just to make sure that he's actually dead.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "My kids have had the same plan for their dad since they were eight years old.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "I'm in my 40s, currently hit by some financial setbacks and considering moving in with my sister (who also let's our mother live with her) and had to have a serious conversation with my sister about not wanting to deal with my mother treating me like a teenager again, like she did when I would visit home as a 30-something year old (before she moved farther away to live with my sister). She basically said \"I'm a mom and I own this house and she still treats ME like a teenager so you should expect it but also be prepared to completely ignore it.\"  GREAT!",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 178,
                  "content": "[deleted]",
                  "id": 29,
                  "comments": [
                    {
                      "score": 227,
                      "content": "Why do I get the feeling OP will soon have another post along the lines of \"AITA for removing my children's bedroom doors?\"",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 73,
                      "content": "i can hear him now. “it’s uncool to keep secrets from your dad, now let me read all your text messages”",
                      "id": 31,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "This was my dad. As soon as I graduated college I moved away to the farthest place I could that was still in the country. And it still gives me extreme anxiety to be back in his house to visit. OP has some estranged kids to look forward to.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 76,
                  "content": "I was raised like this and moved out because of it in my early 20s. This isn’t even his child, how could this be justified?",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "This just makes me wonder what happens if the kids are hungry at a time that isnt dinner. Will op get mad at them for midnight snacks, or eating dinner early? What is he going to do when the kids are teenagers and basically constantly eating? Dude is nuts if he thinks policing his kids food is going to get him anything but resentment",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1027,
              "content": "Lets not overlook this little tidbit:\n\n> I explained to her that I'm just making sure the kids won't be influenced by her brother's reckless behavior and she laughed asking if I think Sean being on his phone was reckless but that is besides the point. \n\nSoooo, he raises what he thinks is a valid point, his wife asks him if this _really is the point he's making_ because its obviously idiotic, and so he moves the goal posts and says that's _not_ the point.\n\nOp sounds like a great husband.",
              "id": 35,
              "comments": [
                {
                  "score": 436,
                  "content": "Reckless behavior AKA coming home after 8pm.   Lord in heaven.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 623,
                      "content": "Also kids need to learn there are different rules for people at different levels. \n\n\"Why does Uncle So-So get to stay out 'til 10?\" \n\n\"Because he's an adult. When you're an adult you can do the same.\" \n\nIt's really that simple.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 168,
                      "content": "Are. You. Serious? \n\nEveryone knows only prostitutes and murderers walk about after 8pm!",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 144,
                      "content": "BIL was also wearing earbuds!  That's a horrible thing for impressionable children to see- suppose they decide to wear earbuds, too?  OP won't be able to monitor them to see if they're listening to music that's not on his list of approved songs.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 127,
                  "content": "Yeah, and like, even if he sounded reasonable about his kids… You learn pretty early that there are different rules for adults than there are for children, and there are plenty of explanations to give for this. Have the parents not been on a date since the kids were born? Had alcohol or coffee? Watched or read things not meant for kids? \n\nYTA",
                  "id": 40,
                  "comments": [
                    {
                      "score": 8,
                      "content": "[deleted]",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 588,
              "content": "Most of those rules are just plain ridiculous for a 20-year-old man. Opie is a ten-years-older brother in law and has no reason at all to see a 20-year-old man as one of his children.\n\nAn 8pm curfew? Telling him when he can eat? Nah.\n\nThere are certain house rules that do apply regardless of age. Such as, No Shoes On the Carpet or No Food In the Living Room. Things that apply to the parents too. THESE are house rules. Telling an adult that he has to remove his earbuds because Opie has chosen to sit next to him is not.\n\nCase-specific rules could be a thing, too. Such as, \"I need you in the house by 10pm because that's when I go to bed and when you wake me up coming home at 1am, it prevents me from getting enough sleep.\" That's fine and reasonable if there's a legit reason.\n\nOpie needs to stop micromanaging everyone and relax. The entire household would be much happier. Maybe some therapy for recognizing reasonable boundaries and respect for others? (Yes, children are owed courtesy/respect too. It's necessary for good self-esteem and good mental health, as well as recognizing when someone is treating them badly/maintaining healthy boundaries.)",
              "id": 42,
              "comments": [
                {
                  "score": 364,
                  "content": "Your first point is what really gets me - OP is 30! His BIL is 20! How did OP get so high up on his horse that he can’t understand that he’s not in charge of his adult BIL who is grieving and is an adult peer. \n\nAlso, 30 is way too young to be this rigid and unrelenting - an 8 pm curfew for everyone in your house?! Wow.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 104,
                      "content": "I can see an 8 pm curfew for like...a 9 year old.  But someone who's old enough to enlist in the military and vote?",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 59,
                      "content": "Also, when it's summertime, sitting outside enjoying summer evenings is one of life's simple joys. It's still light outside after 8pm in the summer. 8pm is a ridiculous curfew time for adults. Poor BIL.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 174,
                  "content": "This!  Telling an adult to be home by 8PM is nuts, the BIL needs to be treated like a responsible adult not a child with ridiculous rules.\n\nIt's okay to say \"absolutely no drugs or illicit activities in the house\" but be home by 8PM and eat when we do?  Seriously?\n\nIf BIL chose to eat with the family then okay to ask him to be respectful and remove his earbuds and if he refuses then take him aside and explain that you are working on teaching your children that when eating dinner as a family they should be engaging in conversation or some such thing.\n\nAlso, OP should be partnering with his wife to identify reasonable expectations.\n\nOP = YTA",
                  "id": 46,
                  "comments": [
                    {
                      "score": 9,
                      "content": "When I was 16 and worked part time in retail, my shift didn’t end till at least 930pm. I would imagine the 20 year old probably has a job or maybe goes to school, what if he has night classes? That’s is such an insane rule to impose on an adult. I’m pretty sure that even when I went to church on Wednesday nights it didn’t get out till 8pm. What a weird thing to ask an adult to do. I could understand not wanting him coming home past 12am every night, but I wouldn’t care as long as he’s not bringing friends over or being loud and waking people up when he comes in. I would expect a 20 year old to have some sort of social life.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 135,
                  "content": "Right- there's a big difference between 'please don't smoke pot in the living room' and 'you have a curfew'. This person is an adult, curfews are unnecessary. If he's coming in hammered at 2am every night and waking up the whole house that's a conversation, but otherwise just let the man be.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 12,
                      "content": "And the conversation is about waking everyone up, not about what time an adult is required to be home.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Even case specific rules should be negotiable with other adults.  You can't just demand some other adult never be out past 10.  It could be \"you need to come in the back door if you get home past 10, because the front door opening wakes me up.\"  That's specific, but it doesn't demand obedience from the other adult, just a little compromise.  Or even better, \"Can you please be home by 10 on Sunday nights since I have trouble falling asleep first of the week?\"  That's reasonable.  But arbitrarily setting a curfew with another adult who has literally never been under your authority just doesn't work.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Yeah, it's a given that if you live with an additional adult, compromises on both sides will have to be made. Opie doesn't seem to realize that letting Bro move in doesn't make him Bro's boss.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yes! Although I can kind of see the earbud thing if they are eating together, it is a bit rude, but BIL probably doesn't feel welcome so why would he stop? But I would ask politely, \"hey would you mind removing those when we're having dinner at the table? We like to talk as a family about our days and would love for you to participate.\"",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 116,
              "content": "OP definitely was a hall monitor.",
              "id": 53,
              "comments": [
                {
                  "score": 4,
                  "content": "And he for sure did not give out any free passes",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2377,
          "content": "Also a curfew of 8pm! Like Christ that’s early. He came back at 10 which is still early in my book, I’d understand if it was 1am and he was making loads of noise. If kids have questions then they can say when you reach X age then you’ll be able to be out until 10 too.",
          "id": 55,
          "comments": [
            {
              "score": 1330,
              "content": "Right? It’s that easy. I have a much younger step-brother. When our parents married each other he was 11 and I was 19. Because he was 11, he would pull the whole “why do I have a bedtime when she gets to stay up?? That’s not fair!” And he would be told “because she’s 19 and you’re not.” They didn’t force me to live like an 11-year-old to avoid having to parent him.",
              "id": 56,
              "comments": [
                {
                  "score": 486,
                  "content": "Thing is, OP didn't even mention that his kids are being influenced, just that they might be. He is working himself up over nothing. I wonder if soon he will want to start policing what his wife does since he is so overbearing.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 336,
                      "content": "OP is definitely worried about his kids being influenced... Influenced by seeing someone who OP doesn't control might give them ideas!",
                      "id": 58,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 70,
                      "content": "Start? That’s rather optimistic of you, to assume he isn’t already doing that.",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 28,
                      "content": "They might be influenced to * checks notes * eat",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": "Exactly…seems like a pretty simple conversation to have with his young kids. “Respect the homeowner”..man this guy is a real special AH. Has he even had a second to consider that his BIL is also grieving right now?",
                  "id": 61,
                  "comments": [
                    {
                      "score": 66,
                      "content": "Not to mention his wife is the homeowner too! No mention of that!",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Exactly. Imagine if instead, when you were 16-18 you were always told that you had to be in by 7pm and in bed with the light off by 8pm.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 485,
              "content": "When I was 20, I wouldn't even LEAVE the house until 8 pm.",
              "id": 64,
              "comments": [
                {
                  "score": 111,
                  "content": "Thank you! One year from now he can go to bars, is OP expecting him to comeback at 8?",
                  "id": 65,
                  "comments": [
                    {
                      "score": 185,
                      "content": "Of course not! He will be 21 then. His curfew will be extended to 8:30",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "If they're in Europe or Canada or anywhere else but the US, he's already old enough to go to bars.",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 100,
                  "content": "Same, and once I finished high school I didn’t have a curfew. The only “rule” related to going out was to be quiet coming in so I didn’t wake my mom",
                  "id": 68,
                  "comments": [
                    {
                      "score": 49,
                      "content": "That was the same for me when I turned 18 22 years ago. Also I had the if your going to stay somewhere over night call or page us just to let us know your not coming home that night.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "That’s reasonable, in my opinion. My kids only rules after high school were pick up after yourself and don’t aggravate me (such as being loud late at night like you described)",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 30,
                  "content": "And 8 pm is still early! I used to have dinner at home at 9 pm and then leave at like 10 pm.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "OP would have hated me at 22.   Lets leave the house on Friday at 6 pm meet 7up with friends head out at 9pm  Return on Sunday some time around noon",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 187,
              "content": "Exactly what me and fiancé say to his kids when they start questioning certain things “adults do”. I feel bad for OP’s kids and wife for sure \n\nYTA.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 166,
              "content": "No kidding. I had a later curfew when I was 16.",
              "id": 74,
              "comments": [
                {
                  "score": 152,
                  "content": "I was going to say, the rules this guy is trying to impose on a 20 yr old grown man are more strict than the rules I have for my 17 yr old. Curfew is midnight. If you're going to be late, call before midnight & explain because shit happens man.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 67,
                      "content": "8pm is earlier than my 9 year old’s curfew. My 4 year old’s baseball practice ran until 8pm. My 9 year old comes inside at 8:30 and my 11 year old can stay outside until 9pm.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I had a curfew at midnight when I was 17 and this was before I had a cellphone and I didn’t have a driver’s license. I was also living in a foreign country and barely spoke the language. How I didn’t get kidnapped or died is beyond me. I would be out like an hour from my house at 11pm trying to get a taxi or train to get me home while also trying to find a pay phone to call my parents. Wild times.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 86,
              "content": "Most 20 year olds I know don't even *go out* until after 8pm. What a control freak. Leave that man alone.",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 65,
              "content": "Right, I grew up with very strict parents, and my “school day” curfew was 10pm in Highschool, weekends it was 1am. Weekdays during the summer it was 11. \n\nI mean the ONLY thing reasonable in this post is no electronics while eating dinner. And ANY curfew is insane, but the one he imposed is straight up nut job. My 10yr old nephews hockey games run past 8pm for crying out loud.",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 34,
              "content": "I agree, he still go home early for an adult, op just want to control him",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "At 16 my curfew was midnight, this is a grieving grown adult… OP YTA",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "I can almost guarantee you that OP was not a 20 y/o that was home at 8, couldn't eat when he wanted, and was barred from personal entertainment when he was around other family members...what a tool...",
              "id": 82,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1067,
          "content": "A curfew of *8 pm!!!!* \n\n\nMy curfew at *SIXTEEN* was fucking MIDNIGHT!!!! 1 am on weekends!!!!\n\n\nYTA, OP, for treating a grown ass man like a middle schooler. Do YOU have to be home by 8 pm?!?!?!",
          "id": 83,
          "comments": [
            {
              "score": 297,
              "content": "I’d like to just say that my 12 year old middle schooler gets to stay out till 10:30pm on weekends (within reason, of course) and this guy is making his 20 year old BIL be home by 8pm?!? Holy shit, he needs to let the grown man be the adult he is and stop treating him like an actual child. So disrespectful and condescending!",
              "id": 84,
              "comments": [
                {
                  "score": 48,
                  "content": "I remembered back in 80s and 90s. My friends would grab bite to eat and then to see a movies. We be like 12 to 17… many of times we don’t get out of movies around or sometime to 11pm when we get home. Parents always knew.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Yeah and like for that age range, Applebees and the movies is a great night that parents can generally not have to worry. They're not a party, or otherwise getting into trouble or whatever, and hanging out and doing the dumb shit kids do in packs.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "I would say that his wife/kids are probably grateful for every single moment this man spends outside the house vs. policing them.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Wish I could stay out that late when I was 16. In my state you couldn’t stay out past midnight unless you were 18. Police only gave exceptions if it was a job or some other event was going on and you were going home immediately afterwards.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 669,
          "content": "YTA\n\nHe is 20, he is an adult, and it isn’t up to Op what he does regardless of living situation.\n\nTo be grieving on top of that?  Makes the Op a SUPER AH.",
          "id": 89,
          "comments": [
            {
              "score": 376,
              "content": "It’s the grief part of this that hit me sideways this morning. I lost my mom on Jan 1. I’m in the process of making arrangements and just dealing. I am not myself right now. How could I be? I don’t know what normal will look like 2 weeks, 2 months, or 2 years from now. \n\nHis behaviors aren’t “uncool” They are typical 20 year old behaviors. My 17 year old daughter has less restrictive rules than he does. Never mind that I expect her with the nature of her job to eat and care for herself when she works weird hours 1) because she’s almost an adult and it’s time to learn these things and 2) because I’m not her maid. You work late? Figure out dinner. I make sure there is a ton of easy options but I am not trying to make my life or hers harder. Food is not something we control in our house. \n\nFinally, you said you’re worried about the example he’s setting for your kids. I want to offer another perspective. You are setting a terrible example for your children when it comes to empathy. This is a real teachable moment for an impressionable mind about how to deal with someone who is hurting and how to actually help them. And quite frankly you’re fucking blowing it big time. And if in your head you think that you're being magnanimous enough to allow family to move in then I would really consider where you set the bar for yourself. Because for me that’s a real low bar to clear.\n\nYTA. A really big fucking asshole",
              "id": 90,
              "comments": [
                {
                  "score": 24,
                  "content": "I know its completely off topic but I am so sorry for your loss. That must be very hard for you. I lost my best friend suddenly a few month ago. She lost her mother early so she was often the grief counselor in our friend group, so in an unfair twist the one person I’d talk to about it is the one that is gone. Anyway, she always had this great bit of advice that I found helpful. She would say “dont worry about getting back to normal, you settle into a new normal. Kind of like jumping into a cold lake. The water doesnt get warmer, but your body slowly gets used to feeling it” i know grief isnt universal and nobody experiences it the same way. But for me Ive used her advice like a mantra on the days that feel especially heavy these last few months. Sorry if i overstepped, as im a total stranger and probably made it super fucking weird with unsolicited grief advice.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Absolutely not an overstep and I appreciate it. And you said what I was trying to get to for this poor kid. His dad may have been his person to talk to. We don’t know, but grief is such a personal experience and journey. Either way nothing that this kid is doing is a red flag. It could be grief it could just be his routine. Either way hes a 20 year old that lost his dad and is now dealing with someone who is being a jerk. I want to give him a hug honestly.\n\nAlso I am sorry for you loss and I hope you find healing. Thank you for sharing.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Right? This Dude just lost his father, who he lived with at 20.  I know someone that lost their father at that age and still has major trauma, and that person is currently *68 years old*. All OP can do is get upset about how this guy doesn't follow his tin-pot dictator edicts and kiss his ass.\n\nI hope Uncle does set a good example for his nieces and nephews - by standing up for himself against their jackass of a father. That way they'll know who to talk to in 10 years when they have dad all figured out.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "1. Great points. 2. I'm so sorry for the loss of your mom.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This is what struck me, too. Let the BIL grieve ffs. We all go through traumatic situations differently and losing a parent, regardless of the circumstances, is a traumatic experience.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "What a terrible loss! You just be gutted.     Make sure the funeral home does it’s job and helps with closing accounts, and such.   You’re paying them  exorbitant fees, make them work for it.      See that you’re doing some self care too.    Finding distractions helps.    Much love and strength to you at such a tumultuous time. 💙",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "So heartless to treat a grieving young man like a 12 year old. No respect, compassion or dignity from the OP.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 546,
          "content": "If OP thinks that coming in at 10pm, eating freely, and using one's phone in the house are \"reckless\" behaviors then it'll be interesting to see how he feels when one or more of his kids inevitably rebel against his controlling behavior and actually goes wild. Good grief.\n\nI feel bad for OP's wife and kids, and if he acts this way towards his wife I hope she takes this for the red flag it is.",
          "id": 98,
          "comments": [
            {
              "score": 40,
              "content": "I’ve seen those videos.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "The “reckless” thing made me LOL.  My man here could have this kid sneaking illegal drugs into the house or coming home wasted at 3 AM each day and covering the living room in projectile vomit, but no, kid dares to snack on some chips at 2 PM.  😂 Bonkers.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 348,
          "content": "He also seems to see their house as HIS house, not his wife’s.",
          "id": 101,
          "comments": [
            {
              "score": 161,
              "content": " Gosh, yes, the  \"certain house rules I have and how he was violating them \"  \n\nThe guy comes home at 10 and is treated like he is a criminal..\n\nHuge YTA... poor wife and children",
              "id": 102,
              "comments": [
                {
                  "score": 112,
                  "content": "“Disrespecting the homeowner and the rules” this guy is beyond controlling, it seems pathological.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 8,
                      "content": "So agree, totalitarianism is never a good look in a family nor partnership...",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 291,
          "content": "His kids are also going to end up complete trainwrecks the instant they go to college and have an inch of actual freedom. This is not only an awful way to treat his BIL but also an awful way to parent his actual kids.",
          "id": 105,
          "comments": [
            {
              "score": 50,
              "content": "Exactly and i won’t be surprise if his kids cuts contact with OP once they moved out. This is the best parenting style if you never want to see your child again loll \n\nYTA op, ans by far",
              "id": 106,
              "comments": [
                {
                  "score": 9,
                  "content": "Yes !! And then he will be all like \"but I have no idea why they don't want to see me, poor, poor ME !!\"",
                  "id": 107,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I was raised that way and that's exactly what happens",
                      "id": 108,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Agreed. If this is what dad thinks of as a “bad influence” then he will be shocked to see how middle schoolers act these days. If my adult kids were “bad” like his BIL, I would be a proud parent. Yeesh, dad sounds like he has really bad uncontrolled anxiety.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Honestly, there's a chance they could kick off before that. Definitely known a person or two who grew up under strict parents immediately rebel once they hit their teenage years. Freedom and trust are good and necessary things to show your kids, ffs.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Can confirm.  I had a helicopter nmom and once I got freedom I took it to an extreme.  Lead q life of drug addiction and extreme partying.   Finally got cleaned up in 2013 but I was well into my 30s by then.\n\nYTA",
              "id": 111,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 214,
          "content": "FR. I literally snorted and laughed out loud when I saw the 8pm curfew. My 18 yo doesn't have an 8pm curfew. \n\nLeave that boy alone. Not only is he an adult, he is grieving the loss of his father. \n\nAt 20, the only *rules* should be no drugs, and if you are coming in super late, be quiet. \n\n*IF* you were a reasonable person, you might encourage letting people know where you are in case of emergency or for safety reasons (like he's been gone for 3 days with no contact and we need to know where to start if we need to look for you), but you're not reasonable, so he would probs lie anyway. I would. \n\nOp, yta",
          "id": 112,
          "comments": [
            {
              "score": 9,
              "content": "I have an 18 year old too. He doesn’t have a curfew but, I asked he just tell me if he’ll be really late or not coming home. He’s a good kid, it’s just an FYI. Seems pretty normal and reasonable to me. I mean, he could go join the army or peace corps, he can’t stay out til 1am? 🤣",
              "id": 113,
              "comments": [
                {
                  "score": 5,
                  "content": "I never had a curfew but it was the same kind of thing - just let them know when I planned to be home so they wouldn’t potentially be up all night worrying. My parents were really good at giving us independence and trusting us to make smart choices, the way they raised us. And if we did make a bad choice, they were always there to help. \n\n(Except that one time I tried to hide a litter of kittens in my room…)",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 193,
          "content": "But hey he is the ✨homeowner✨ his wife and kids apparently are just props inside the house cause the only opinion that matters is his... YTA",
          "id": 115,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 171,
          "content": "Yeah the only point that had half a leg to stand on was using his phone during meals or “family time” if he’s chosen to engage with the family during them. BIL doesn’t have to participate in family time or eat with them, but if he does it would be decent of him to respect the rules of the “family engagement” so the kids don’t feel like it’s special treatment, which I would do if I were living with someone with kids, if the kids weren’t old enough to understand.\n\nAt this point as long as BIL is picking up after himself when he cooks, uses the bathroom, etc. and not swearing, drinking, smoking, etc. in front of the kids then OP is a huge AH.",
          "id": 116,
          "comments": [
            {
              "score": 13,
              "content": "Oh yeah, I definitely agree if BIL is eating with them, it's not too much to ask him to put down the electronics. It's really a good habit for anyone to have - child or adult - to just not engage in personal electronics during meals.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 23488,
      "content": "Try this parenting tactic: \n\n\"Hey kids, if you're wondering why Sean doesn't have to obey the rules that you do, it's because he's an adult and not my child. When you are an adult, you will get to come home later than 8pm too.\" \n\nYTA.",
      "id": 118,
      "comments": [
        {
          "score": 5600,
          "content": "Yeah. How hard is it to explain that there are different standards for a grown man than there are for an elementary school age kid?",
          "id": 119,
          "comments": [
            {
              "score": 1607,
              "content": "Exactly and unless the two kids are twins, there should be times they have separate boundaries too. Eg my eldest got a phone and the younger ones weren’t old enough yet. They have different bedtimes. One of them is too young to stay at home without a parent. They all understand that rules apply differently depending how old you are and if OP isn’t teaching his kids that, he’s not parenting very well.",
              "id": 120,
              "comments": [
                {
                  "score": 198,
                  "content": "Exactly- you are so right. Geezus it's not rocket science!",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Excellent point of different boundaries appropriate for different ages. Part of what screwed up my relationship with my stepmother is that I was 2 years older than her oldest child, so she was only interested in setting rules (that changed constantly) that would be appropriate for someone two years younger. This really came to a head when I started high school and wanted a little more freedom to hang out with my other overachiever good kid friends (no bad influences). And yes, she was a horrific parent, brought my father on board whole hog, and so I ended up moving out at 16 and haven't had a relationship with my father for 20 years (and that won't change).",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "You’d be surprised. My partner has two half siblings who are 13 and 9, and they have forever had the same rules. 9 will still flip like a toddler not getting gifts on someone else’s birthday because of it, and 13 goes to bed at 7:30pm because it’s “fair”. We’ve told her parents if we can’t celebrate each child individually, we’re not celebrating. We were met with “don’t tell me how to parent!” and we haven’t been back stoking that fire since.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 14,
                      "content": "17 year old brother: \" can I take my driving test, yet?\"\n\nParent: \"Well, your sibling is only 13, so they can't legally drive. In 3 years, when you're 20 and they're 16, we'll talk about it.\"",
                      "id": 124,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "That’s so short-sighted and will just result in 13 leaving home as soon as possible and 9 having no friends because they’re so entitled. Some of parenting is really really hard, but I try to remember all the stuff I thought was unfair when I was a child and not do the same things, or to at least explain when it’s appropriate. It’s also sad for 9 that they’re being robbed of all the joy that comes with giving gifts as well as receiving.",
                      "id": 125,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I wish my parents did that. My younger bro was always annoying me and wanting to do whatever I did. Which is whatever, but I still remember when I finally convinced my parents to extend my bedtime to 10 instead of 9 and my bro threw a tantrum and said it wasn't fair that he didn't get to stay up and I did so they caved within a day and we were back to having the same curfew. \n\nWhen I got a phone for the first time, he did as well within a month. \n\nI started to get more time on the family computer, guess who else was given that privilege? \n\nIt would be more acceptable imo if I didn't have 3 older sisters who they enforced rules with, there were specific rules lifted at specific ages and they wouldn't make any exceptions for them.\n\nSorry for the rant but that said, I agree, OP should be able to teach his kids he has different rules because he's an adult, it shouldn't be that complex. They'll think it's not fair and at first may try to rebel but they'll let it go pretty quick.",
                  "id": 126,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 351,
              "content": "Exactly. I have a 12 and 16 year old, the rules are different for THEM. Does the 12 yo whine sometimes? Yep but that's life, older brother has more freedom.\n\nAnd 8 pm!?!?! WTF. My 16yo is midnight on weekends.\n\nYou can't force a 20yo to behave like a small child because they are in the home.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 267,
              "content": "[removed]",
              "id": 128,
              "comments": [
                {
                  "score": 69,
                  "content": "lmao OP can barely write, obviously insecure",
                  "id": 129,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 196,
              "content": "Especially when you keep in mind that an elementary school kid will not even question why an adult gets to come home late at night and they don't.",
              "id": 130,
              "comments": [
                {
                  "score": 16,
                  "content": "Right? Jesus I went out at 9Pm the other night to a friend's house to watch the rest of Monday night football. Think my 11 year old wonders why daddy is allowed out at 9?",
                  "id": 131,
                  "comments": [
                    {
                      "score": 14,
                      "content": "The kids probably can't tell a difference between a 20 year old and a 30 year old anyway. When I heard \"bad influence\" I thought he was coming home drunk at first!",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "My thoughts exactly. Either they're young enough that things like this won't even register to them, or they're old enough to understand that adults don't have to follow the rules because rules are made to protect kids.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Considering the elementary school kid wouldn't even be awake at 10pm to question it.\n\nAnd 10pm is early. In my 20s I'd regularly be out till the early morning hours. And I was a straight laced nerd.",
                  "id": 134,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Because he wants to be able to treat them like children even when they're adults and have them not question it.",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "Mah, can't be bothered to parent, so to make it easier for himself,  everyone has to follow the rules, because it's too hard to explain why some rules apply to children but not adults.",
              "id": 136,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "My brothers are 14 & 12 years older than I am. I never once thought I should be allowed to do all the things they did, because even as a toddler I understood that adults, big kids, and little kids all have different rules. Sounds like OP doesn't respect anyone else in his house. \n\nAlso huge eyeroll at \"respect the homeowner.\" If they were renting, would the landlord get to tell them when to have dinner and use their electronics?",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 898,
          "content": "LOL!  We say that all the time. \n\nThem: \"Mommy, why can you eat on the couch and we cant?\"  \nMe: \"Because I paid for this couch and don't get crumbs on it, when your older and buy your own couch, then you'll get to make the decisions about it.\"\n\nThem: go back to doing whatever they were already doing.",
          "id": 138,
          "comments": [
            {
              "score": 125,
              "content": "I love that you give a detailed response. My least favorite reply from my mom was “because I said so.”",
              "id": 139,
              "comments": [
                {
                  "score": 128,
                  "content": "YES. FUCKING THIS. Parents of Reddit, if there's one thing you learn from this thread, let it be this: EXPLAIN YOUR REASONING TO YOUR KIDS. \"Because I said so\" will only create resentment. It tells your kids that you don't think they're smart enough to comprehend your logic, or that you just don't respect them enough to provide a real answer.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 17,
                      "content": "This is why I love my mom. Growing up her number one rule was that she wouldn’t make rules for no reason. Each rule she had had a reason it was there and we where allowed to ask why and got a good explanation. Never has my mom told me “because I said so”. I’m 23 now and I respect and trust her more then anything.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "My rule was offspring got 3 chances to ask why I wanted them to do something, then it was because I said so. I wanted them to be curious and to trust me but my eldest especially would have still questioned a decision 20 questions in if I kept answering and ain't nobody with small children got time for that!",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Tbf, when it's the 20th time in 4 hours that you've answered the same question, \"because I said so\" is the only answer the kid will take. MOST of the time a whole explanation is sufficient but sometimes...\n\n\nSource - my daughter who finally understood after looking after a 10yo repeatedly. She hated it when I told her that as a kid, but as an adult she asked me \"did I repeat questions like that?\" Yes. Yes you did.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My line is something like \"If I [screw this up], I'm going to be mad at me. If you [screw this up], I'm going to be mad at you. So, I get to risk it because it only affects me, but you don't.\"",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 672,
          "content": "Except I don’t think OP will ever let his kids come home later than 8pm, then will be like, “Why are my kids all moving out on their 18th birthday?”\n\nGrow up OP. I bet you and your wife don’t  have an 8pm curfew. Why should he?",
          "id": 145,
          "comments": [
            {
              "score": 492,
              "content": "\"Why is my 16 year old asking to move in with my BIL?\"\n\nFixed it for you.\n\nAnd I bet his wife does have a curfew.",
              "id": 146,
              "comments": [
                {
                  "score": 173,
                  "content": ">And I bet his wife does have a curfew.\n\nThis is exactly what I was wondering.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I was gonna say... this guy is supposedly worried about BIL modeling \"bad behavior\" for his kids? OP is modeling the behavior being a controlling, cruel, unreasonable psycho to another adult he lives with. That's priming your kids to normalize abusive relationships, but I doubt OP is the type to care.\n\nStill, from the sound of it, his wife isn't taking it lying down. But if OP doesn't come to Jesus about how horribly he's treating *everyone else in the household*, I hope she has the support and resources to GTFO.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "I doubt his wife has a curfew. That would imply she can go out freely.",
                  "id": 149,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "I hope he doesn't police what times she eats too. What does \"eating at random times\" consist of anyway? Any time outside of the regularly scheduled meals? No snacks ever? Sounds like a joy to live in that house 🙄",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "100% phrased as though this 8PM thing applies to everyone in the house.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "\"Why did my wife move out with the kids?\"",
              "id": 152,
              "comments": [
                {
                  "score": 6,
                  "content": "Why did my wife leave me! I assigned her a full 1500 calories every day and allowed her to cook meals of her choosing, from a list I prepared.",
                  "id": 153,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 233,
          "content": "IKR? My aunt lived with my family for about a year when she was 22 (I was 6 and my sister was 4). She was another adult in the house who helped take care of us (and disciplined us as appropriate). I think it would have been more confusing if she were following our rules instead of the adult rules.",
          "id": 154,
          "comments": [
            {
              "score": 22,
              "content": "My sister moved in with me at when I was 18 with her two kids that I helped take care of during her substance abuse issues. I wasn't even 1% controlling as this dude is and there were actual freaking children.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 108,
          "content": "I explained it just like this to our niece and nephew when we went to visit. My partner and I had our phones out at the dinner table and the kids were like, \"you can't do that, it's not allowed.\" I explained that when you're an adult and pay your own bills, you get to do whatever you want. It's that simple.\n\nEdit: Yikes! I didn't know how many of you were going to take this so personal. I didn't mean anything bad by it, just that they shouldn't be reminding me of their parents rules that don't apply to me. Hope you guys have a great week!",
          "id": 156,
          "comments": [
            {
              "score": 68,
              "content": "When I stayed over at my friend’s house, his son told me that I was able to take my phone into the bathroom with me, because adults get to take electronics into the bathroom, but kids don’t.",
              "id": 157,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "This!!\n\nYTA. \n\nI think you need to look inside yourself and try to understand why you feel the need to be so controlling.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "He’s also 30 how old could his kids be? 6?  10?! \nVastly different than if he had teenagers complaining about it, but still wouldn’t make a difference.",
          "id": 159,
          "comments": [
            {
              "score": 7,
              "content": "I'd want to think not older than 10....but the year I graduated high school, I knew a sophomore girl pregnant with her second child. It's scary to think.",
              "id": 160,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": "Lol. Harsh!",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "'He recommended this one simple tactic and now assholes HATE him!'",
          "id": 162,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 14,
          "content": "lol kinda as i told my nephews: „if i had kids, i wouldn’t let them eat icecream for breakfast as long as i‘m parenting them. on my birthday though, i might eat ice cream for breakfast since i can because i‘m an adult and live on my own. i could even do it everyday but i don‘t because i‘m an adult“",
          "id": 163,
          "comments": [
            {
              "score": 9,
              "content": "Essentially, being a kid is wanting to eat ice cream for breakfast but not being allowed to, while being an adult is being allowed to eat ice cream for breakfast but not wanting to because it’s gross.",
              "id": 164,
              "comments": [
                {
                  "score": 6,
                  "content": "That or wishing you could but you don’t because you’d have to buy the ice cream yourself.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17380,
      "content": "YTA. \n\nGiving an adult a curfew of 8:00 is INSANE, as is trying to dictate when he eats.    Wearing AirPods at the table is rude, but I completely understand why he would want to tune you out so he gets a pass on that.\n\nWhy are you trying to parent a fully grown adult?",
      "id": 166,
      "comments": [
        {
          "score": 4199,
          "content": "I wouldn't call this ''parenting''. 100% chance this man also controls his children in unreasonable ways under the guise of \"respect\".",
          "id": 167,
          "comments": [
            {
              "score": 1579,
              "content": "Is it even normal to have a rule for kids that dictate that they can only eat at the set times? What if they're hungry for a banana at a 'random time', can't they get one then? I don't have kids so I might be ignorant, but that on itself seems a bit too controlling for my liking. \n\nOff topic, OP: YTA. You're just trying to assert dominance over your BIL.",
              "id": 168,
              "comments": [
                {
                  "score": 795,
                  "content": "It seems awfully controlling. \n\nWe have an “we eat together when possible” rule and keep semi regular meal times but exceptions exist (sickness, work, just plain not hungry). Kids are not stupid, they know we have routines that happen most times but are not written in stone and we can easily explain when things don’t happen as expected. \n\nIt sounds like OP is setting up an autocratic parenting style where only his word goes and no deviation is allowed. Cause we all know life is always perfectly aligned /s. \n\nHe falls firmly is YTA.",
                  "id": 169,
                  "comments": [
                    {
                      "score": 206,
                      "content": "I very much agree with having main meals together as a family, or at least dinner for example. (However I never liked the mornings so breakfast wasn't always a party with siblings who were wildly energetic in the morning.) But what about snacks you know? \n\nI wonder how old OP's kids are. If they're toddlers it's reasonable their eating habits are still being controlled kinda. But still if they're hungry, they're hungry, y'know. But if they're in school already you'd think they can get a little freedom. A little trust from their parents, if you will.",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Also, if any good reasons for exceptions exist, wouldn't a parent dying and still being in the first most acute stages of grief be like one of the top ones? I know when I was losing family members left and right I went through phases of not eating for days, eating constantly, only eating half a meal at a time, grazing, and so on - nothing was constant. I kind of let it happen because it just wasn't as important as everything else going on.",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 106,
                  "content": "[deleted]",
                  "id": 172,
                  "comments": [
                    {
                      "score": 68,
                      "content": "Thats understandable but I'm sure you are not so rigid you let him starve. \n\nJust a comment about \"his house his rules. It's not just his house though, it's his and his wife's house. It seems OP has made unilateral decisions as in \"certain house rules I have and how he was violating them\"\n\nHis wife does not agree to his rules for her brother. \n\nThink we have a little dictator in OP.",
                      "id": 173,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "That's reasonable, because the boundaries are flexible and so your child can eat when he's hungry.\n\nI grew up in a \"you can only eat what I give you, when I give you\", and surprise surprise! I have incredibly bad anxiety when I'm hungry so I always hurry up and eat whatever's in front whenever I get hunger pangs.\n\nUm, yeah, so I have a *great* relationship with food. /s\n\nAnd honestly, I wouldn't be surprised if one of OP's kids gets an eating disorder out of his overly rigid nonsense around food.",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 87,
                  "content": "I'm scared for how a rule like this is enforced, Im hoping OP isn't one of those parents who lock the fridge at night...",
                  "id": 175,
                  "comments": [
                    {
                      "score": 80,
                      "content": "I didn't even think about how this rule can feed into developing disordered eating for the kids. Yikes.",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Oh my gosh, do parents really do that? That's deranged.",
                      "id": 177,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 64,
                  "content": "Meals are a balancing act. Some structure is good for kids, and predictable mealtimes are comforting and make the whole family run more smoothly. But if a kid is hungry and it’s nowhere near a set mealtime, yeah, you should absolutely allow snacking! And obviously the older the kids get, the more control they should be given over when and what they eat. Having one set of rules from infancy all the way up to adulthood with zero breathing room is a bad idea.",
                  "id": 178,
                  "comments": [
                    {
                      "score": 17,
                      "content": "It's almost like the whole point of raising a child is to ensure that when they're on their own, they'll be able to make the right choices for themselves without someone else butting in and telling them how every single time. YTA, OP.",
                      "id": 179,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Forcing kids to eat only at mealtimes has been shown over and over as a terrible idea. They never learn to eat when hungry and stop when full.",
                  "id": 180,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I understand being strict around eating meals at a set time, especially if they’re young, routine is important. But as they get older, those kinds of rules should slowly relax as they gain independence and start to mature to be able to take care of themselves. And at no age should you be policing exactly when someone is allowed to eat, period. “No snacks just before dinner” sure. “Don’t eat all the food in the house in a day” sure. “Dinner is at 5pm specifically” sure, ok, bit much but as long as everyone is fine with it, why not. “Don’t eat a bite of food any time but 8am, 12pm, and 5pm, and only with the entire family together with zero possible distractions,” completely unreasonable.",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "We had a general dinner time when our son was younger, but if he wanted a snack, my husband or I would get him a snack. When he was old enough, he knew where snacks were kept, but our reason for a dinner time at the table was so he'd get used to the idea of sharing a meal with others while taking time to converse with family. \n\nKiddo is a young adult now, still living with us, and he contributes to the house. I can't imagine telling him he has a curfew and meal time now. The OP is weirdly controlling.",
                  "id": 182,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I've had family that had \"meal\" times but if they wanted a fucking hot pocket because they were running around the neighborhood for a few hours they were allowed to eat. Meal times was the cooked food.",
                  "id": 183,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 461,
          "content": "Yeah, I bet if he said something like, \"ok I was being an ass about other things. Would you mind removing your earbuds at the dinner table do that we can enjoy conversation with you?\", he'd get a different response",
          "id": 184,
          "comments": [
            {
              "score": 180,
              "content": "With the condition he can take no for an answer, because this guy sounds like the type that can't",
              "id": 185,
              "comments": [
                {
                  "score": 15,
                  "content": "True.",
                  "id": 186,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Yeah I would just never be there for dinner.",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 159,
              "content": "OP didn’t even say it was at the dinner table but just when they are chilling together with the kids. He doesn’t understand that his house is also just a new environment for Sean who is grieving and just trying to figure out where he falls within the household. Yet the control freak that OP is he has been planning this whole time how to fit him into his control territory. YTA",
              "id": 188,
              "comments": [
                {
                  "score": 14,
                  "content": "That’s how I I interpreted it, like they were just hanging out in the living room but OP demands “family time” only on his terms",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yup. My dad had a rule like this for a while,  no electronics outside of common rooms, and if anyone else was in the room they needed to be turned off to socialize. It was incredibly dumb as a 14 year old.",
                  "id": 190,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "Yeah the AirPods are the only thing I can see as a reasonable rule but as you said…if he has to suffer at the table with OP…",
          "id": 191,
          "comments": [
            {
              "score": 14,
              "content": "He’s probably wearing the airpods in the first place because OP is so insufferable",
              "id": 192,
              "comments": [
                {
                  "score": 7,
                  "content": "My parents made it so that I actually enjoy their company so it was never an issue, but a grieving young adult moving in with a controlling AH, yeah, I can see why he'd want to tune all of that out.",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "I could be wrong, but OP doesn't mention wearing them at the table, just \"while people are sitting with him.\" Personally, I read that as him listening to podcasts or whatever in the living room (instead of locking himself away, which OP is also mad at), and OP expects him to interrupt whatever he's doing whenever someone comes into the public area.\n\nI wonder if the kids have to turn off the TV whenever a new person enters the public area too...",
              "id": 194,
              "comments": [
                {
                  "score": 5,
                  "content": "Yah when I was a kid my family had a rule of no headphones at the dinner table but headphones in common spaces while doing your own thing was entirely fine and expected. We also ended up living with one of my uncles for a while and the rules were pretty much the same- no headphones at the dinner table if we were all eating together, but other than that headphones were fine. My uncle would often eat in his room and would go out and come home at all sorts of different times and generally acted like an independent adult, and that had zero negative effect on my brother and I. As others have mentioned, it's pretty damn easy for kids to understand that adults have different/more flexible rules.",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I’m curious if OP would include him in the meals or expect him to cook his own/ force him to pay for meals he doesn’t want",
              "id": 196,
              "comments": [
                {
                  "score": 7,
                  "content": "Oh dear.\n\nI keep thinking the brother is grieving. If under normal circumstances these rules are horrible, then how much worse OP’s making it for him :(",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "OP's brother in law just lost his father. Maybe he's wearing earphones at the table and tuning the world out because he's still processing his grief, and then along comes OP with this petty garbage.",
          "id": 198,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "\"Wearing Airapods at the table is rude, but I completely understand why he would want to tune you out so he gets a pass on that.\"\n\nMy dude, this had me rolling with laughter. Thank you.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Seriously. 8pm???? In high school my curfew was 11pm and my parents were strict AF. 8pm is ridiculous.",
          "id": 200,
          "comments": [
            {
              "score": 6,
              "content": "Honestly when I was in highschool I don't know if someone with a 8pm curfew could even be part of my friend group. \n\nBoardgame nights often went later then that so they couldn't really play. Movie nights at home or a theater would start to late for them to finish the movie so they couldn't go. Or I think a dozen other things that there 8pm curfew would get in the way of. It just doesn't sound like they could be one of the gang. At that is me at 14. I can't imagine trying to have a social life at 20 with that curfew.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "When the post said he came home late... I was thinking like 3 or 4 in the morning. It would be reasonable (at least somewhat) to ask him to be home a little earlier... say if he were waking up the kids or even the adults who work early at that time. 10 PM? It is insane to say he needs to be home at 8 PM. Adults can eat whenever. Also, if he isn't eating with the OP, then it doesn't matter if he is wearing airpods or whatever. \n\nThe only \"rule\" that seems even somewhat sane and logical is asking him to not wear airpods at the table when everyone is eating. Otherwise, this is an adult.",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "100% this. OP is (I'm guessing) trying to make life there so miserable that the brother will move out, without having to be the guy who kicked him out.\n\nThis kid's father just died. He's 20 years old and you're going to fault him for coming home at *ten*?! So long as he's reasonably quiet and respectful this should be a non-issue.\n\nIf you don't want him in your house kick him out and deal with the consequences, but what you're doing is bonkers insane. YTA.",
          "id": 203,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9032,
      "content": "YTA.\n\nYou're not his parent. You're not his guardian. \n\nHe's 20 year old and is not doing anything wrong.\n\nGet over yourself. Stop wanting to control him.\n\nWould you have the same rules if your parents were coming to stay with you ?",
      "id": 204,
      "comments": [
        {
          "score": 1344,
          "content": "Surely this can't be a real post. If it is real, then wow. An 8pm curfew for an adult is absurd. Just ludicrous.\n\n**edit**\n\nI appreciate the many replies, but it's also depressing to find out how realistic this actually is. Geez, and I thought my parents were a little overly cautious. Apparently not!",
          "id": 205,
          "comments": [
            {
              "score": 398,
              "content": "I see comments like yours now and then that a post cannot possibly be true. I've thought some were pretty crazy but I've also seen ones exactly like my childhood with people saying it must be fake because of how over the top it is. \n\nWhen you are raised with something messed up being normal it doesnt set off red flags for you.",
              "id": 206,
              "comments": [
                {
                  "score": 140,
                  "content": "Yep this guy could be my dad. I don't talk to him anymore. OP is a lost cause.",
                  "id": 207,
                  "comments": [
                    {
                      "score": 24,
                      "content": "Sounds like the same attitude my dad has.  Not sure I’ll go to his funeral when he passes. Hope OP knows his family will resent him.",
                      "id": 208,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "Yep my mom is like this, I also don’t speak to her anymore.",
                      "id": 209,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Yes I agree, I feel like this is actually pretty realistic honestly. My family is very strict and though I can’t cut off complete communication I do make sure not to spend too much time with them because of that. When I was 25 I went to stay with my uncle in another state, my bf also went there and got his own Airbnb so I can stay with family. Then one night I went to go stay with him and my uncle was pissed. He didn’t come to the airport to say bye and while I was waiting for the plane he sent me this huge long text about how disrespectful I was being and that I’m being a bad example for his daughters. They were old enough to understand I’m an adult and can’t possibly have the same rules as them. Literally an adult with a whole ass child and he still was beyond mad about this. Trust me this scenario is totally possible. \n\n\nAlso YTA OP. Your kids are not going to want anything to do with you past 18 if this is how you’re going to treat them. You’re being unreasonable and he’s adult. You need to be able to explain to kids that there are different rules for everyone.",
                  "id": 210,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Same - I had the same BEDTIME at 17 the same as the younger children at my biological father’s house. 9pm on the weekends. And then they wondered why we cried when we had to visit their house.",
                  "id": 211,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": "Oh, trust me...this is entirely feasible. Parents did this to me.",
              "id": 212,
              "comments": [
                {
                  "score": 14,
                  "content": "I never had a set curfew mostly because I was painfully introverted and didn’t get my license till 18. But even as an adult my mom was a control freak and would threaten to call the cops if I didn’t text her every hour on the dot. I laughed at her when I moved out and she still expected to know where I was going, with who, when, etc. \nFor the record, her being controlling just made me a better liar",
                  "id": 213,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Wow. I’m sorry to hear that.",
                  "id": 214,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I started dating my wife when she was 22. She still lived at home and her dad gave her a curfew of 9:30 on the weeknights. He moved it to 9 because she kept coming home right at 9:30. She moved in with me the next week.",
              "id": 215,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Imagine having to explain to your peers your 8pm curfew hahahah",
              "id": 216,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "it can happen, i was an adult (24) college graduate living with my mom and she would want me home at 8pm 8:30 the latest and she would lose it if i came home later than that. I moved out as soon as I got engaged",
              "id": 217,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Exactly, if he is in college there are some classes that at end at 8 pm. Also what about working in the evenings like that is so crazy of an expectation.",
              "id": 218,
              "comments": [
                {
                  "score": 9,
                  "content": "When I was in college I had classes that ended well after 8, to say nothing of study sessions or group project time. 8pm is ridiculous.",
                  "id": 219,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 36,
          "content": "> Would you have the same rules if your parents were coming to stay with you ?\n\nBang on. An adult is an adult. OP is clearly a nutjob.",
          "id": 220,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "You might have gaslit your wife and kids into believing that load of crap, but not the majority of the commenters here. \n\nYou came to find out if you are TA and the people have spoken.",
          "id": 221,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "Dude just lost his dad too, wtf",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "By that logic, I wonder if he thinks his wife has a curfew too 🤔 \n\n100% YTA",
          "id": 223,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "You are delusional man and everyone here can see it. 10pm late lmao what are you an 85 year old grandma?? Holy f man try not being such a boomer ass loser.",
          "id": 224,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5951,
      "content": "YTA\n\n\nTo me this sounds like \"I don't want her brother here, but I cant say that, so I will just makenup other stuff.\"\n\n\nYou children witness behaviour they aren't allowed to particioate in all day long. Do you not drive, because you children cant? Do you never ever drink a glass of wine or a beer infront of them because they cant?\n\n\nI get that his use of electronics is a bit rude, but telling an adult guest when to be home, when to eat and so on is controlling.",
      "id": 225,
      "comments": [
        {
          "score": 1144,
          "content": "He uses electronics while a Dad harps on about his own kids, while the 20yo just lost his. Probably trying to distract himself from his loss.",
          "id": 226,
          "comments": [
            {
              "score": 476,
              "content": "he's probably trying to drown out the inane chatter. I do it sometimes too, as does one of my kids who has ADHD and it helps stop them being so jumpy. There are a lot of reasons to wear earbuds and they're not all antisocial",
              "id": 227,
              "comments": [
                {
                  "score": 70,
                  "content": "[removed]",
                  "id": 228,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I have tinnitus and sometimes it's just to much. with air plugs I have my sounds, but at least not others too. Might seem strange but I find it relaxing.",
                  "id": 229,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Not to be annoying but antisocial is a psychiatric disorder (linked with sociopathic and psychopathic tendencies).. you mean asocial. \nI know I’m being super annoying correcting you like that, but terminology like antisocial and asocial is important when describing behavior and they are VERY different and NOT interchangeable. \n\nBut otherwise you are completely right and I def agree with you",
                  "id": 230,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 122,
              "content": "Exactly, he wants Sean to pretend like nothing happened and they are just this happy family",
              "id": 231,
              "comments": [
                {
                  "score": 145,
                  "content": "He's treating a 20 year old who lost his father like a kid, it's... Weird",
                  "id": 232,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "This.. Probably the most spot on comment.",
              "id": 233,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 194,
          "content": ">To me this sounds like \"I don't want her brother here, but I cant say that, so I will just makenup other stuff.\"\n\nDead on my first thought. This is just OP harassing a grieving adult.",
          "id": 234,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 113,
          "content": "[removed]",
          "id": 235,
          "comments": [
            {
              "score": 24,
              "content": "That’s actually very sweet that you figured out a way to spend more time than usual together due to extenuating circumstances while still allowing everyone to do their own thing",
              "id": 236,
              "comments": [
                {
                  "score": 16,
                  "content": "Sounds like an introvert heaven instead of the HELL that is OP and some other commenters here.\n\nButthurt extroverts, those that get offended because some people don't want to socialize but still try to force socializing on them, are the worst.",
                  "id": 237,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "OP YTA.  \n\n\nThis sentence says a lot: \"brother in law M20 \"Sean\" moved in with me and his sister my father in law passed away\"  \n\n\nLike. Holy shit. Moved in with \"me and his sister\" not \"our family\".\n\n\"My father in law\" as opposed to *\"his* father\"\n\n&#x200B;\n\nSound like a real dickhead.",
          "id": 238,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "Sure the electronics thing is a bit rude, however:\n\n1.) his dad just died maybe he’s feeling a little sad\n2.) maybe he doesn’t wanna fucking interact with this lunatic OP",
          "id": 239,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I’m surprised this comment isn’t higher. This is exactly the issue. He doesn’t want him there and is trying to make it as uncomfortable as possible. Top that with a massive control issue. Her brother is an adult. There’s no reason for this. I’m sure he doesn’t want to be there either. He’s obviously trying to make himself as scarce and unobtrusive as possible. Can you imagine losing your father and home then having to move in with a controlling YTA?!?! Don’t worry OP. I’m sure he’s making his exit plan. If your wife is smart, she is too. Then you can control and worry about yourself.",
          "id": 240,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "That's the first thing I thought, this is a constructive dismissal",
          "id": 241,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "from what i got, OP is irked BIL uses electronics around him period. my belief is that unless someone is actively speaking or trying to speak to you, it does not matter. some people think you have to be talking 24/7 if you’re around others and it’s so not healthy. people can just exist near one another",
          "id": 242,
          "comments": [
            {
              "score": 7,
              "content": "I also try to keep in mind that just because someone starts speaking to you, does not mean you owe them your attention. Some people will just start talking at you with zero regard for what you were already doing/have going on. You’re not obligated to drop everything just to indulge them.",
              "id": 243,
              "comments": [
                {
                  "score": 5,
                  "content": "oh agreed 100%, unfortunately grew up in a home where it was expected to drop everything immediately if a parent needed me for absolutely anything, no matter how small. it’s super inconsiderate and took me much too long to realize. thankfully i didn’t absorb that and do it to others",
                  "id": 244,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3903,
      "content": "Bro, you insane.\n\nEDIT: Oh! My first award! Thanks guys.",
      "id": 245,
      "comments": [
        {
          "score": 779,
          "content": "IKR - it’s unhinged. Even my mother, who was extremely strict, wasn’t this ridiculous. An 8 pm curfew for a 20 year old is just nuts.",
          "id": 246,
          "comments": [
            {
              "score": 289,
              "content": "The streetlights wouldn't even be on in the Summer.",
              "id": 247,
              "comments": [
                {
                  "score": 18,
                  "content": "Haha good point! 😂",
                  "id": 248,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Where I live, in the summer it's still light out until at least 8pm and there are children under 10 years old still playing at the playground near me up to that time (and they'd stay longer but the playground closes when it's dark out). An 8pm curfew is insane.",
                  "id": 249,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "My dad tried this when I came back from college and it did NOT go in his favor. My mother was always telling my dad to leave me alone. I had a full time job and a car and he wanted me to be home by 9 on weekends. Yeah, no.",
              "id": 250,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "and enforcing strict eating times fuck you up later in life. my mom did that to me and i still have trouble snacking if im hungry and I finish my plate even though i dont want any more.",
              "id": 251,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "Yeah, I could write a lot on this but you've pretty much summed it up. OP is insane",
          "id": 252,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "My father was like this and it got worse as I became a teenager (ie no dinner if he couldn'tbounce a quarter off my bed after I made it). I no longer have a relationship with my father.",
          "id": 253,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2617,
      "content": "YTA. This isn't only your household, but your wifes too. Your BIL is still grieving and it is NOT unreasonable for an adult to ask not to have a curfew, or eat when he is hungry. He can make those decisions himself and you are overstepping trying to enforce this. The earbuds while eating I get, but he just seems stressed out. Staying out to ten is not unusual for a twenty year old and not at all reckless behaviour - you are treating him like a child.\n\nAlso, your children aren't learning any reckless behaviour. They learn that you are insanely controlling and will continue to do so well into their adulthood. You should reflect on that here. He's an adult and you are on a power trip!\n\nDo you stick to all those rules yourself? Cause I sure hope so.",
      "id": 254,
      "comments": [
        {
          "score": 376,
          "content": "lol ofc he doesn't - he's 'the man of the house' - OP is AH big time. Once my own kids hit 18 we removed curfew times so they could learn how to balance their own lives. All we asked was certain chores be done, (keep rooms tidy, take out trash if asked), and they let us know if they'd be around for food so we could cook extra (or if they didn't want what we had, which was always an option, they had to cook their own food and not expect us to make it).",
          "id": 255,
          "comments": [
            {
              "score": 31,
              "content": "Yeah, when I brother and I get and got home, the one rule was not to slam the doors and be quiet. That's reasonable. ~~And my brother ignored it all the time.~~\n\nBut a curfew for an adult not even in your direct care is super weird.",
              "id": 256,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "> take out trash if asked\n\nRandom thought: but looking back, I'm not sure what all the fuss is about with taking the trash out. It's got to be one of the easiest chores there is to do lol.",
              "id": 257,
              "comments": [
                {
                  "score": 13,
                  "content": "Seriously! Taking the trash out is the easiest chore, followed by getting the mail.",
                  "id": 258,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "This is me too, except even my high school age kids get to mostly decide when to go to bed as long as they don't miss the bus because I don't want to drag myself out of the house any earlier than I need to🤣\nThe two of them have missed the bus a grand total of twice- once because my son is a bonehead and set his alarm wrong 🤣",
              "id": 259,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "> Staying out to ten is not unusual for a twenty year old and not at all reckless behaviour - you are treating him like a child.\n\nI used to deliver pizzas until 3am as a 18 year old. Luckily my parents were reasonable and said \"If we trust him out working til 3am, there is no real reason to instate a curfew on him either,\" I think they also recognized that if they tried, I would just claim I'm going to work and leave in my uniform and change at a friend's house.",
          "id": 260,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Also, his WIFE is also grieving during this time and her husband is pulling this shit? Like??? YTA OP.",
          "id": 261,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Calling 10 oclock unreasonable hours is hilarious.  I was expecting him to say like 4am or something.  10 is a very responsible time for a grown ass man to come home lol",
          "id": 262,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1256,
      "content": "YTA -- an 8pm curfew is insane. It's not that hard to explain to your kids why Sean (an adult) can stay up later than children\n\nI understand having some sort of boundaries, but as it is some of your rules *are* unreasonable for an actual adult. I'm sure he'd be more willing to follow the most important rules if you weren't policing his every move",
      "id": 263,
      "comments": [
        {
          "score": 434,
          "content": "See, this is my take.\n\nYes, having some general rules are good. but those rules should be:\n\n1. Be home at a reasonable time OR don't make a ruckus coming in (ie don't wake up the household if you are staying out past 10 or 11 PM and you come home)\n2. Clean up after you eat, including washing dishes or putting them in the sink for sister if she is okay, OR eat with the family. (IE, don't create a ton of extra work for the sister to clean up after the brother)\n3. If we are in a family setting where talking is expected, please don't use earbuds. \n4. basically be respectful that you are living in a house with other people, including children, so don't create a huge mess/noise.",
          "id": 264,
          "comments": [
            {
              "score": 558,
              "content": "Way to assume that is the wife's responsibility to clean up there....",
              "id": 265,
              "comments": [
                {
                  "score": 310,
                  "content": "Mainly from OPs attitude. I assume that it is his wife doing the cleaning, because OP honestly doesn't sound like he would.  He sounds like 'I am the man of the house, make the rules and people better to obey me'. \n\nSince he didn't mention anything about cleaning, I assume either BIL cleans up after himself, or the wife does all the cleaning. Or both. \n\nI would think that if the issue was that BIL was making more work for OP, by not eating with the family when OP cooks, or OP needing to clean up after BIL, then OP would have mentioned it.  Since he didn't, yeah, I assumed that OP's wife was doing that particular work. \n\n&#x200B;\n\nI do realize that not all relationships work like that, but many do, and often OPs will mention the division of labor if they consider it important.",
                  "id": 266,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 135,
                  "content": "If he’s this controlling I doubt he’s doing the dishes",
                  "id": 267,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "It's probably one of the house rules... /s",
                  "id": 268,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Oh god imagine what gross rules he has for the wife? If she’s a SAHM I’m legit afraid for her. This post for some reason is extremely unsettling. OP sounds like a psycho.",
                      "id": 269,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "I don’t think that is a big leap given the original post…..",
                  "id": 270,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 810,
      "content": "…you give your adult housemate a curfew? That’s beyond absurd.",
      "id": 271,
      "comments": [
        {
          "score": 69,
          "content": "But him coming home after 8 is a slippery slope. Next thing you know he will be eating when he isn’t allowed to",
          "id": 272,
          "comments": [
            {
              "score": 8,
              "content": "Then it's just a hop skip and a jump to listening to JAZZ!",
              "id": 273,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 789,
      "content": "YTA and a control freak.\n\nYou expect a 20 year old to not be on their phone, eat to your time schedule and be home at 8pm.\n\nYou’re totally unreasonable, get a grip. Jeez.",
      "id": 274,
      "comments": [
        {
          "score": 70,
          "content": "[removed]",
          "id": 275,
          "comments": [
            {
              "score": 14,
              "content": "Shoot my 19 year old still tells me where he's wandering off to...and texts me random dumb stories while he's out and about.\nI ask \"when will you be back?\" He gives me a time...or sarcastically asks what his curfew is...to which I reply \"when do you work again?\"\nHe'll answer and I'll say \"an hour before that\"🤷🤣",
              "id": 276,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "The curfew thing is out of line, I’m about Sean’s age and if I had a curfew of 8:00 pm I wouldn’t be able to do a lot of the things I can do now. The OP is treating him like a nephew more than a BIL.",
          "id": 277,
          "comments": [
            {
              "score": 8,
              "content": "Man my curfew was 8 all the way back in middle school.  As soon as I hit high school it was 9 when I was a freshman 9:30 as a sophomore 10:30 as a junior and I didn't have one as a senior because I was 18. The rule was changed to \"I would LIKE you home by midnight but just try to be quite and lock the door when you get home so I know you are home.\"",
              "id": 278,
              "comments": [
                {
                  "score": 5,
                  "content": "Yeah I live with my mom as I go to a college close to home and I mean she wants to have an idea of when I’ll be home but she’s not gonna say “come home no later than 9:00” or something as I have a job and I do stuff at school so enforcing a curfew would cause me to not be able to do a lot of things.",
                  "id": 279,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}