{
  "post content": "So me (26M) and my Girlfriend (22F) have been dating for around 2 years now. We've had our ups and downs but overall we have a great relationship, and I definitely see a future together! We really love and respect each other and connect well! But the thing is we come from different backgrounds. I come from a Muslim Background (I'm not 'that' religious tho) and she is White. However, we have still made it work and our similarities are much more than our differences.\r  \n\r  \nNow my gf does like wearing a bit short clothing when out and about, which used to bother me at first and made me uncomfortable and we did have a few minor fights over it, but eventually I came to terms with it.\r  \n\r  \nHowever, recently an embarrassing situation happened. There was a pool party at my cousin's house, and my parents were there too. I had recently introduced my gf to my parents as well, so this was a good time for to meet family and relatives. I specifically told her to please pack something more on the modest side, as my family would be there (and most women usually don't wear such revealing stuff in our culture). She didn't give much of a response and just nodded.\r  \n\r  \nBut what did I see in the pool? Her wearing a two piece bikini (with kinda cheeky bottoms too)! Even one piece would've been more better, but nah she went all in this time! She was probably the one the dressed most immodestly.\r  \n\r  \nNo one said anything but afterwards, I was so embarrassed I couldn't show my face to my parents and all.\r  \n\r  \nI did talk to her about it and scolded her a bit, and she told me \"She can wear whatever the hell she wants, whenever she wants.\"\r  \n\r  \nI couldn't say anything afterwards. We've been quiet to each other for a while but slowly making up now.\r  \n\r  \nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 22182,
      "content": "YTA. She can indeed wear whatever she wants and it’s inappropriate for you to dictate otherwise or scold her about it.",
      "id": 2,
      "comments": [
        {
          "score": 24980,
          "content": "It's also inappropriate for her to go to her Muslim's bf's families house and disrespect their culture, rules, and religion *in their own home*.\n\nJust because she *can* wear whatever she wants whenever she wants, doesn't mean it's appropriate to do it *wherever* or *whenever* she wants. The least she could have done is understand and respected them by at least wearing an oversized t-shirt.",
          "id": 3,
          "comments": [
            {
              "score": 11505,
              "content": "I have a Muslim family. I grew up in the NL while my family is in Turkey. \n\nHere is my advice, don't date someone and then change them whenever it doesn't suit you. Its a typical case of having your cake and eating it too. You discuss these things beforehand especially if you have a cultural difference. If your morals don't align you break up. This is not going to get any better when the relationship continuous. How are you going to raise the kids? It's not disrespecting them in their own home, it's values not aligning. \n\nAlso don't have a pool party if you don't wanna see skin.\n\nEdit: Both individuals are adults. You cannot change someone, you cannot force a concessions. This only happens because the other side is willing to do so. This is just as true for OP as for his GF. Every single comment in the thread, is true for both sides. Why isn't he respecting her or why isn't she respecting him. People think my immediate response is to break them up, which is not my intent. But it is time to have a good chat and to take a good look in the mirror about whether your values in life align. About how much of a concession both of you are willing to make - and yes this means both OP and his GF. Cause if both don't wanna make any then yeah ill say it, it's doomed to fail. What is normal for OP might not be normal for GF and the other way around, so communicate.",
              "id": 4,
              "comments": [
                {
                  "score": 1304,
                  "content": "This is it. I don't wish to get into a whole 'this religion is oppressive or not oppressive or whatever' because in many ways even though it is relevant, in many ways it isn't. \n\nLike you said, we all have specific ways of life that we want to live by and the bigger the gulf between you and your partner culturally, the more you have to find compromises you are happy with.\n\nOP comes from a cultural background where he and his family are more sensitive to how much skin is shown, GF isn't. Sure, she has freedom to technically wear what she wants, but that freedom is also to say, you know what, I don't want to have to feel bad about this when I'm around you or my potential in-laws, so maybe we shouldn't date anymore. \n\nNAH - sometimes cultural gaps can be hard to overcome and everyone has the right to feel what they feel and act accordingly. I honestly think OP and GF would be happier with other people long term. \n\nRandom note: some people here haven't been to pool parties where the code of modesty is so strict that people are basically dressed head to toe in the water. Full bathing suit dresses etc. OP might be more familiar with that while GF isn't.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1291,
                      "content": "Nu-uh. OP says himself that he scolded her for her clothing, that makes him an AH.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": ">NAH - sometimes cultural gaps can be hard to overcome and everyone has the right to feel what they feel and act accordingly. I honestly think OP and GF would be happier with other people long term.\n\nI agree with most/all of what you wrote, but just want to emphasize that relationships aren't *doomed* by cultural differences. If discussions are had, ground rules are set, and both parties uphold their shared value system (even in the face of unhappiness from others in the family / culture), everything can be fantastic.\n\nI saw a comment on a post the other day about someone's partner being grossed out by one of the cultural dishes they ate (baby birds IIRC). The commenter said that's why people should date within their own cultures. I called bullshit: I can eat all the meat I want, but I'm not going to serve steaks to my Hindu inlaws. I mostly quit eating beef in response to my inlaws (for many Indians, eating a cow would be the same as eating a dog for those of us in the west). If hamburgers were more important to me than keeping a good relationship with the family of my true partner in life... Then he could do better than me.\n\nOP's situation sounds like if my Hindu inlaws invited me for a potluck, and I brought rib eye steaks to grill. Am I wrong to eat steak? No. Is that immature, disrespectful, and invalidating beyond words? Absolutely.\n\nNTA. Find a partner who's willing to stand their ground on issues that matter to them, and follow your lead on issues that matter to you.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yes, this is the answer. He wants to date a white non Muslim woman but make her behave like a Muslim woman. That makes him an asshole. If you want to date a modest Muslim woman, go find one. \n\nYTA.",
                  "id": 8,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Dit dus! \nWhy is my man out here tryin to fit a round peg into a square hole. If she doesn’t want to be modest that’s her right. If he wants someone who is he should go out and find that woman. I know a lot of single conservative modest women looking for the right men. Why can’t conservative men date conservative women? For some reason they date progressive ones and then try to change them into exactly what they want them to be. It’s WEIRD!  It’s like he is trying to prove something to himself or his buddies and be like: “gimme that 🏆 for changing controlling and dominating this wild female until I got my very own stepford wife. Yeah, YTA.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "He's even said no one said anything and it seems that it was an all him issue",
                  "id": 10,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "What’s hilarious is my husband is Turkish, and I’m more comfortable in a one piece and his sisters wear bikinis. Our daughter wears a bikini both here and in Turkey, except if we go to the village. We all dress different for that place.",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Right? These guys out here trying to wife up ladies who's unveiled and then pressuring her to veil after marriage. And yes these couples I'm talking about are all Muslims. It's just funny to see these guys suddenly scratching their head at why they aren't attracted to their wives after she acquiesced to their demands. \n\nGet a clue. Sabotaging your relationships out here just to \"save face\" for family.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Exactly. If he can't accept that she might wear a bikini at a pool party with his family, then maybe he shouldn't be dating her. At least they aren't engaged or married yet.",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8596,
              "content": "[removed]",
              "id": 14,
              "comments": [
                {
                  "score": 4202,
                  "content": "You're missing the point. There's clearly all sorts of situations where how you dress matters. I wouldn't go out with my wife dressed as a chicken.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 5569,
                      "content": "But a bikini at a pool party is perfectly normal so I’m not missing any points here",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 166,
                      "content": "Maybe if she was attending mosque with them, but this was not the case.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 163,
                      "content": "A bikini, at a pool party....",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 112,
                      "content": "Are you kidding me? I would absolutely go out with my boyfriend dressed as a chicken. Or me dressed as a chicken. It would hilarious",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 100,
                      "content": "If you were going to the opening of chicken restaurant it would be totally appropriate... \n\nOr if you were wearing sneakers to the opening of a new store that only sells sneakers. \n\nOr, you know, like how it's appropriate to wear a bikini to a pool party.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "I bet your wife looks hella cute in a chicken suit though",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1743,
              "content": "No. Sorry it’s a pool party with women invited. \nThat’s not a Muslim cultural event \n\nYTA",
              "id": 22,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1322,
              "content": "But he gave her NO guidance on expectations or cultural norms to follow, other than -checks notes- “something more on the modest side.” \n\nThat leaves A LOT open to interpretation! What if that WAS the most modest suit she owns?? \n\nBesides I’m getting vibes OP is quite a hypocrite- I wonder if he is following the no sex before marriage rule, or only the rules that impact the women negatively like the ones about modesty….",
              "id": 23,
              "comments": [
                {
                  "score": 755,
                  "content": "He is only concerned with following  'the rules' that his family can see. It's just performative hypocrisy.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 212,
                      "content": "He forgot the he can’t date rule* then",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 108,
                      "content": "Oh lets fully call that fig a fig....its performative, misogynistic hypocrisy.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 86,
                      "content": "He’s concerned with following ‘the rules’ when policing her, but not when they would stop him from doing something. I expect his “not ‘that’ religious” attitude is very permissive when it comes to himself.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "He also got butthurt that she dresses in shorter tight clothes in public and it lead to fights between them, how I interrupted that sentence was, he gets jealous and weird seeing his gf dress how she wants to dress and other guys check her out, because he is insecure.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Hope the men at this event, like OP were also dressed modestly and covered up.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "Yeah if someone invited me to a pool party and asked me to dress more modestly, I only own bikinis so I'd show up in the bikini I thought was the most conservative of the 3",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Like so many people from conservative religious backgrounds live, those rules are only meant to tether women.",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "As a card carrying nudist...yeah. like I own a swimsuit...it's somewhere in the house but..where?? I hate to wear anything in a pool",
                  "id": 32,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "Yes. Moreover, he’s more concerned about his image with his family than he is with his girlfriend’s happiness and comfort. That is a theme that will only grow as the relationship continues, Muslim or not.",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1179,
              "content": "THEIR religion doesn't dictate HER actions. Practice whatever fucking religion you want but the second you think your religion gets to dictate others actions you can fuck right off\n\nEdit: thank you for the awards!",
              "id": 34,
              "comments": [
                {
                  "score": 76,
                  "content": "YES. Imagine if OP's gf wrote how her bf's conservative family made her uncomfortable for wearing oversized t-shirts at her pool party?   \n\n\nThis annoys me soooo much. I'm really petite with a big chest. I wear bikinis and IDC. Why should I hide my body. If it makes you feel uncomfortable, DON'T LOOK.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Agree,  their religion doesn't dictate her actions and it doesn't mean that the owner of the property can tell her to dress a certain way.",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 824,
              "content": "she isn't muslim. they are. she doesn't have to follow anything, & a non muslim person dressing the way they want around muslim people dressing the way they want is not disrespectful. it's their rules, their culture, their religion. not hers.",
              "id": 37,
              "comments": [
                {
                  "score": 10,
                  "content": "Unless she converted, she shouldn't have to follow their rules. And even if she did, what she wears when they aren't around still wouldn't be any of their business.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Truth.\nI've had friends from every religion, and they haven't cared if their partners didn't \"follow the rules\". Even their parents didn't care, because they could see the reason of \"x doesn't share our religion, and we respect the one that they follow\"",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 621,
              "content": "No, fuck that. You don't placate misogynists.",
              "id": 40,
              "comments": [
                {
                  "score": 331,
                  "content": "“No, fuck that. You don't placate misogynists.”\n\nYou shouldn’t date them either.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 35,
                      "content": "I have a feeling OP’s girlfriend won’t for much longer.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "so. much. this.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 560,
              "content": "And yet, the only person visibly perturbed by the situation was OP. No one in his family said they felt disrespected or like she was being inappropriate.",
              "id": 44,
              "comments": [
                {
                  "score": 24,
                  "content": "yep",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Not sure that’s a solid argument in a culture that takes hospitality very seriously",
                  "id": 46,
                  "comments": [
                    {
                      "score": 43,
                      "content": "OP admits no one said anything to him either.",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 435,
              "content": "She was in a pool. You want her to wear an oversized t-shirt?  Absolutely ridiculous.",
              "id": 48,
              "comments": [
                {
                  "score": 20,
                  "content": "Nevermind the fact that wearing that oversized t-shirt IN THE POOL will even MORE effectively show off her body is a scandalous manner. There's a reason why wet t-shirt contests are a thing. OP is a nincompoop.",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 357,
              "content": "Maybe but if op said “modest side” then the GF might have thought that meant more covered bikini would be fine. \n\nThere is no one definition of modest.  \n\n“Modest” and “modest side” don’t have the same implications. But then also “modest” at the pool party is not very descriptive. For some it might be rash guard and swim shorts, some a one piece, some a tankini.",
              "id": 50,
              "comments": [
                {
                  "score": 165,
                  "content": "This situation could have been avoided if he had been more specific. Bikinis are the norm I would say in western cultures, so if he specifically wanted her to wear a one piece he should have said that. Then of course she would have every right to refuse. Some people may not see it as a big deal (I already own a one piece), but others may not agree with it on principle which I think is totally fair. I would say OP is TA because he did not communicate effectively and then shamed her after the fact saying she embarrassed him.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 10,
                      "content": "The semantics around exactly what \"more modest side\" mean aren't relevant here - OP is TA because he tried to control what she wore, and his misogynistic religion doesn't excuse it",
                      "id": 52,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 409,
          "content": "Agree. Like I really want to lean towards an e-s-h here- because like it or not, people have the right to request dress codes at their house (in this case OP’s family). But that’s a conversation. That’s “I understand and respect you wearing whatever makes you happy, whenever you like. My family has some opinions about modesty and would request/require a more modest bathing suit. If you aren’t comfortable enough with this to join me, that’s okay.” It’s not shaming and scolding a whole ass woman. It’s not a command. \n\nConversation and compromise, not control and castigation.",
          "id": 53,
          "comments": [
            {
              "score": 167,
              "content": "This. I’m going with YTA because he was not clear in his communication and then shamed her.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "No, no one has the right to be misogynistic.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "But here's the thing that everyone keeps seeming to forget: It wasn't held at the parents' house; it was held at OP's cousin's house. OP gives us no indication as to how religious his cousin is, just his parents, who are guests at this party. As guests, they have no right to dictate what anyone wears.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 377,
          "content": "If you need a Muslim girl to appease your family Marry One",
          "id": 57,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 183,
          "content": "I came here to see if he payed for her to have a more modest bathing suit. OPs a total AH for not doing that imo. Especially from an American standpoint not many women even have 1 piece suits. Plus they are kinda expensive to just buy to pretend you are more modest than you are.",
          "id": 58,
          "comments": [
            {
              "score": 120,
              "content": "This. A one piece isn’t even really a whole lot more modest than your average bikini. Her booty cheeks are still going to be out, the same as a bikini, and most one pieces I see are low cut.",
              "id": 59,
              "comments": [
                {
                  "score": 10,
                  "content": "Clearly you haven't seen my swimsuits.  I have a little skirt and my shoulders are covered.  \n\n/I'm pale and fat",
                  "id": 60,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Yeah I actually prefer to dress modestly in front of my in-laws because they have zero boundaries and it wouldn't make a difference if it's a one-piece or a bikini if there isn't a skirt around the bottom lol",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 140,
          "content": "[deleted]",
          "id": 62,
          "comments": [
            {
              "score": 36,
              "content": "Yeah, I’m tall and a one piece shows half my lady bits",
              "id": 63,
              "comments": [
                {
                  "score": 30,
                  "content": "I always feel like I’m about to slingshot to the moon LOL",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "As long as it’s two-piece, you can mix and match any top to any bottom. I have a longer swim dress top and swim shorts that I purchased as separates on Amazon, and it’s even more coverage than a one piece. A bikini is not the only type of two piece swimsuit out there.",
              "id": 65,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 61,
          "content": "In general yes, but it’s courteous to respect someone’s customs in that person’s home or house of worship.\n\nHowever, it’s grating that this guy says he doesn’t LET her wear a bikini.",
          "id": 66,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "You need to date in your own religion. You are never going to control her. As you age, it will wear on you. What if she wants the children to be a different religion? Or eat bacon? How will that sit with your parents? You can't force your religion on her.",
          "id": 67,
          "comments": [
            {
              "score": 3,
              "content": "Oh yeah, bacon is definitely a deal breaker. \n\nI’m not even being sarcastic.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "The language OP used in the title alone bothers me \"let her wear a bikini\" and it's contradictory anyway, he can't both encourage her to wear more \"modest clothing\" and at the same time \"let her\" wear a bikini as he implied in the title.",
          "id": 69,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "I hope his girlfriend gets tf out of that relationship",
          "id": 70,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9613,
      "content": "\"I'm not that religious though\" then proceeds to act like someone that religious.",
      "id": 71,
      "comments": [
        {
          "score": 2333,
          "content": "This doesn't sound religious to me, though it is cultural. \n\nMy family isn't religious at all, and we don't wear cheeky bikinis around each other. Those bikinis are for romantic vacations.",
          "id": 72,
          "comments": [
            {
              "score": 6737,
              "content": "I have always found it hilarious when people attempt to downplay the intersection of religion and conservatism.  I'm not going to entertain discussions that even remotely pretend that religion doesn't inform culture because its a ridiculous position that is unworthy of any serious consideration.\n\nAgain, for the few people who are secular like myself and somehow feel the need to point out that they don't wear bikinis around their families - good for you?  What you choose to do around your family is your business, but it's just that, YOUR CHOICE.  \n\nThe OP is mad about the choice his girlfriend exercised in this scenario and is so indoctrinated by the culture that he feels ashamed about her exercising her bodily autonomy and is enforcing the shame that is inherent in Abrahamic Religious practices with respect to women when they do not present modestly.  The fact that I have to explain this in 2023 is insane.",
              "id": 73,
              "comments": [
                {
                  "score": 751,
                  "content": "I know OP brought the religion into this but this kind of conservatism is true of other cultures that are not Abrahamic. It’s about patriarchy. Many Asians ~~and Africans~~ are very conservative in this exact same way and nary a word about God or gods or deities comes into it. I know atheist families who have these cultural norms. My friends who live in bikinis when on vacation with SOs or friends absolutely have one pieces they wear when on vacation with their parents/relatives/in-laws. Maybe they wouldn’t if it were an all female trip, but some older generations feel this way even when not in mixed company. Like another commenter said, this is about a mismatch of values, not just about clothes or this one party or even his parents.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 492,
                      "content": "I agree that patriarchy has many avenues in different cultures, but it's literally baked in to Abrahamic Religions which is the topic of discussion. \n\nAbrahamic Religion makes up approximately 90% of the people in Africa, with Christians making up about 60% and Muslims making up about 30%:\n\nhttps://www.statista.com/statistics/1239389/share-of-christian-population-in-africa-by-country/\n\nAccording to Pew Research, approximately 9% of atheists are conservative.  That's a very small portion:\n\nhttps://www.pewresearch.org/religion/religious-landscape-study/religious-family/atheist/party-affiliation/\n\nAtheism says NOTHING about their culture, it only informs a person about their lack of being convinced in the existence of god(s).  Thus, saying you \"know atheists who ________\" isn't relevant in the conversation. \n\nAlso, your anecdotal fallacy about what your friends do on vacation with family isn't helping contribute to the discussion. 👀",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 181,
                      "content": "Alot of atheists are still morally lead by religious values, whether they realize it or not. There is no escaping it as it is ingrained in many cultures. \n\nThe fact that we even have discussion about how much of your human body is okay to show is a mark of religious modesty. We all have bodies, we all know what they look like. Bodies do not HAVE to be sexualized. Religion says you must cover up to not incite lust. But flesh is flesh. The flesh of my breast is no different than my arm. The only difference is how those on the outside choose to perceive them. And if you say we must live our life bound to other people's morality, and how they choose to view you, that's very much in line with religious policing.\n\nI'm not advising we all be nudists, but gasping at a two peice bikini is ridiculous.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "When you look at the history of African Traditional Religions this was not a huge point until Abrahamic religions colonized (namely Islam and Christianity). It's disingenuous to pretend these places in Africa weren't colonized which totally changed the culture and resulted in the conservatism, modesty, homophobia, and other obvious signs of Abrahamic religious culture.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "[deleted]",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "on the other hand, my family is very used to small \"cheeky\" bikinis, and they find it weird if i want to wear something that covers up a bit more. different families or cultures have different ideas of what is appropriate to wear and when. Also, a large part of my family is very religious and that doesn't change their thoughts on swimwear",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Omg 🤦 \n\nBikinis are not reserved for romantic vacations. A bikini is perfectly normal bathing attire in any setting. It's not 1820.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "We don’t know what his perception of a ‘cheeky bikini’ is though. She was at a pool. Wearing a bikini. Don’t have a pool party if your eyes are so offended by the female form.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Define cheeky.",
              "id": 82,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 537,
          "content": "It sounds like he isn't that religious when it comes to *himself* following rules or making sacrifices, bit he is when it comes to controlling *other people's* bodies.",
          "id": 83,
          "comments": [
            {
              "score": 367,
              "content": "From what I've been told from Middle Eastern women allies who were/are in Islamic circles and doubting or left (please correct me if I've misunderstood) men are given significant amounts of leeway in their circles to do things they ought not be doing while women are held to a much higher standard.  Men can and have dated outside of their faith, occasionally drink, have premarital sex etc and don't even get a slap on the wrist but if a woman does any of those things all hell apparently breaks loose so they have to be extremely secretive about it.",
              "id": 84,
              "comments": [
                {
                  "score": 230,
                  "content": "It's not only in the middle east, it's pretty much the same in any abrahamic religion. The USA and their recent wave of conservatism can be an example: who their new laws affect the most? Women and lgbtia+ people.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 49,
                      "content": "These were Middle Eastern women that I went to college with in SF, I should have been more clear.  I agree with you 100% though.  The effort to control women's bodies and to, for all intents and purposes, kill trans people by denying them gender affirming care regardless of what peer-reviewed evidence of the matter demonstrates is the point of religions and it says so in their texts.  Cruelty is the point in my observation and there's a plethora of historic evidence to support that conclusion.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 159,
          "content": "[removed]",
          "id": 87,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "I also find it strange that we have no info on how his family reacted, except: “No one said anything.” ….sounds like no one gave a shit? So why does OP?",
          "id": 88,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8998,
      "content": "INFO: why did u start dating someone who you wanted to change?",
      "id": 89,
      "comments": [
        {
          "score": 2069,
          "content": "I swear, this is such basic stuff and they ought to teach it in school.  It's so simple.  If you  meet someone and see something about them you think needs changing in order for you to be with them, DON'T BE WITH THEM.  Why is this so hard for so many people to grasp",
          "id": 90,
          "comments": [
            {
              "score": 1065,
              "content": "“I’m not religious I just want to mold someone into a partner who fits my strict religious archetypes.”",
              "id": 91,
              "comments": [
                {
                  "score": 610,
                  "content": "“We respect each other” but I want her to conform to my ways and culture and will scold her for not changing for me",
                  "id": 92,
                  "comments": [
                    {
                      "score": 133,
                      "content": "It never fails. There are SO MANY people available who follow their religion willingly, but somehow these people feel righteous seeking out a secular partner and shaming them into submission of their incredibly strict religious values!",
                      "id": 93,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "\"And I tolerate how she is, rather than actually loving her for it\".\n\nI get the impression he WANTS to go against family expectations and date outside his religion and culture, but hadn't really thought what that would mean in reality.\n\nBeing with someone who doesnt share your core values means accepting they do things very differently.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 908,
          "content": "Probably because OP started dating her when she was 20 with the intention he could mould her into the ‘perfect’ partner that goes along with his ‘culture’",
          "id": 95,
          "comments": [
            {
              "score": 276,
              "content": "Ding ding ding lol this is exactly why people point out age gaps in these types of posts. They can lead to stuff like this.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 599,
          "content": "- he had “issues” with her short clothes early on in their relationship 🚩\n- he asked her to “dress modestly” for a *pool party*, with no apparent indication of what specific articles of clothing/swimwear would suffice 🚩\n\nGuy doesn’t love *this girl*, he loves the idea of a white Western girl who easily & intuitively fits in his culture norms. YTA",
          "id": 97,
          "comments": [
            {
              "score": 215,
              "content": "I've heard what muslim guys do when they have issues with short clothes on their gf. \n\nTheir GF gets called a whore, a slut and degraded. When he later when on to say he \"scolded\" her .... like a child... I'm picturing alot of humiliation and slut shaming.\n\nHe's loves his white horse because he probably acts just like her outside of his family home and expects her to be secretive from his parents like he is.\n\nI hope she leaves him and he prays for his sins for slut shaming the woman who he's supposedly loves.",
              "id": 98,
              "comments": [
                {
                  "score": 15,
                  "content": "Op has said that she had been his dirty secret for 2 years ...",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Agreed! Such an AH... Major red flags.\n\nSay hi to Pickles for me!!",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "•He scolded her when she didn't do as he asked 🚩",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 223,
          "content": "Also INFO: why didn’t you ask your family to respect her culture of being comfortable in the pool on a hot day?",
          "id": 102,
          "comments": [
            {
              "score": 64,
              "content": "Doesn’t sound like his family had the issue, only him.",
              "id": 103,
              "comments": [
                {
                  "score": 13,
                  "content": "Which is why I asked the question of him. Respect goes both ways, something dudes like him never seem to consider!",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 188,
          "content": "Exactly this should be more upvoted and at the top. As an Indian woman I'm tired of all these men who want sexy gfs but the moment it comes to commitment or introducing to the family then insist she should be modest, demure, \"respectful of his family\" blah blah.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 59,
          "content": "Because he wants someone who wants to fuck him before marriage, but doesn't wants his parents to know",
          "id": 106,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "Yes. These two aren’t compatible. There are plenty of conservative dressers out there, and given his feelings, those need to be the women he seeks out. She very understandably doesn’t want to change the way she dresses, but she needs to see the writing on the wall and end it rather than continue these power struggles with him.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "The number of men who date someone not of their religious faith for yearrrrssss While trying to change her is so ridiculous. Then they either convince her to convert, wanting her to be more religious than even people born into the religion, or unceremoniously dump her to marry someone “their kind.”",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "She’s probably hot, young and skinny. My average-sized 35-yr old ass isn’t getting into no cheeky bikini.",
          "id": 109,
          "comments": [
            {
              "score": 10,
              "content": "My average sized 35 year old ass would hang out of a cheeky bikini VERY cheekily. As would my boobs 😂\n\nPersonally I could not hang out like that with my partner's family 😅. But no shade on her for wearing what she likes.",
              "id": 110,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "Fr don't date someone who has different values than you if you want your partner to agree with you always. You want your values to be respected and then you proceed to control hers. She's younger than him too. OP is trying to control and gaslight her into believing his morals. It is not right. OP needs to reevaluate his choices. Especially when it's causing frequent disagreements with his partner.",
          "id": 111,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5936,
      "content": "YTA - You scolded her? WTF!?! She is a grown woman, not your child. And she is 1000% correct, she can wear whatever the hell she wants to. It is HER body, not yours. Let her?? You can't 'let' her do anything as, again, she is a grown woman.",
      "id": 112,
      "comments": [
        {
          "score": 1127,
          "content": "This is the correct response. Also: he and his family are definitely allowed to have their own religious and cultural traditions and beliefs, but forcing OTHER people to follow them is the problem. Trying to control and police other people’s bodies is not ok.",
          "id": 113,
          "comments": [
            {
              "score": 366,
              "content": "100% if THEY were bothered by the clothes she wore at THEIR home, it's up to THEM to speak up. If something is such a horrific blow to your culture, religion and moral beliefs, allowing it isn't \"good behavior\" (as some other commenter repeatedly called it while defending OP), it's prioritizing someone elses comfort/wants over your own. But the only one to speak about it was OP. Which really speaks to the dynamic of their relationship. Toxicity overload 🚩🚩🚩",
              "id": 114,
              "comments": [
                {
                  "score": 36,
                  "content": "And why couldn’t his family respect her culture of wearing whatever she damned well wants in the pool? This kind of “respect” only ever goes one way.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "Seems like his parents DIDN'T even say anything so I don't know what he's on about.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": ">Trying to control and police other people’s bodies is not ok.\n\nTHIS! Your beliefs end at the tip of your nose, as they say. OP, YTA.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Looks like the family didn't even have a problem with it (and op implies that there were other \"immodest\" women there), op just imagined this scenario where everyone was silently judging his gf specifically, when in reality, everyone was just having a good time, YTA",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "She also has her own traditions, culture and beliefs. Like being able to wear whatever she wants and not being ashamed of her body. Why should his customs take precedent over hers???",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yeah she should've gone topless",
              "id": 120,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "_\"No one said anything but afterwards, I was so embarrassed I couldn't show my face to my parents and all. I did talk to her about it and scolded her a bit, and she told me \"She can wear whatever the hell she wants, whenever she wants.\"_\n\nExactly. It was also a pool party, everyone else had on switsuits or swimtrunks, and no one else said anything about the GF's attire.... probably because it was a pool party and she wore pool party attire! It sounds like OP has a personal problem and hid behind religion to justify his arbitrary personal preferences.",
          "id": 121,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4300,
      "content": "ESH.  Contrary to what you posted it does not sound like either of you respect the other.  She should have been more conservative out of respect for you and you should not be embarrassed by her.  Cross cultural relationships are hard.  Wishing you luck.",
      "id": 122,
      "comments": [
        {
          "score": 1413,
          "content": "She may have thought her bikini was on the modest side, especially if she usually wears barely there swimwear. OP’s ask was extremely vague.",
          "id": 123,
          "comments": [
            {
              "score": 811,
              "content": "Idk from her reply I kinda think she knew she was immodest and was fed up with him. Understandable, but potentially making the family uncomfortable in their home was a jerk move.",
              "id": 124,
              "comments": [
                {
                  "score": 597,
                  "content": "It could be that she responded that way because she’s sick of him policing her wardrobe as OP said he did a lot.",
                  "id": 125,
                  "comments": [
                    {
                      "score": 71,
                      "content": "I hear you. It kinda comes down to whether she thought she was ok and just responded that way because he’s a control freak or whether she knew it wasn’t okay but wanted to rebel against his control freakdom. If the former, YTA. If the the latter, I’m all for rebellion as long as it doesn’t make the family uncomfortable, so I’d go ESH.\n\nThen again, dude even said his family didn’t say anything… 🤷‍♀️",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Honestly, I don't even know why they are together. OP is a hypocrite. If he wanted a girlfriend who was more conservative, thats who he she should have had as a girlfriend. This whole I am religious in front of my parents but not in front of my friends, does not sit right. Instead he seems to want the power rush he will get by \"reforming\" his girlfriend. I have seen some people comment that this disrespectful behaviour will escalate, and I certainly agree with that.",
                      "id": 127,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "I'm confused about OP's statement that she was \"probably\" the least modestly dressed person there.  If it wasn't obvious, there must have been others in bikinis.",
              "id": 128,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "The “even a one piece would have been better” line is throwing me off. Like, what else would she wear to a pool that’s more modest than a one piece? The wording is so bizarre, as if a one piece is a compromise.",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 399,
          "content": "Definitely an ESH, not sure why there's so many Y T A's!\n\nYes, you can wear whatever you want, you don't have to conform to someone else's religion / culture - but. This is a specific location / event, and has a dress code.\n\nIf someone says \"hey, this is a pool party but it's with my parents\", I don't wear some tiny bikini. If they say \"hey, this is a romantic resort getaway\" then maybe I will!\n\nI'm not religious, but if someone says \"you can come into this temple / church / etc. but you have to wear X\" then my choice is to wear X or not go in. This is the choice GF was being given, and I'm not sure she realised that?\n\nOP needs to be more understanding of his GF's boundaries, and how he talks to her about his family's expectations (clear about dress codes, allow her to decline, etc.) and I don't think he was: she needs to be more willing to meet him part-way. Otherwise, this relationship is not going to make either of them happy, and they should end it. As you said: respect needed here from both parties, towards each other and each other's families.",
          "id": 130,
          "comments": [
            {
              "score": 290,
              "content": "There was no dress code. His family made zero comments. **HE** decided she should dress a certain way as to not make him uncomfortable. She upset him, not his family.",
              "id": 131,
              "comments": [
                {
                  "score": 147,
                  "content": "If you know middle eastern culture you would know why they didn't say anything to his face, his family will hear about this for years.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Sounds like Middle Eastern culture is the asshole then",
                      "id": 133,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 129,
              "content": "The dress code for a pool party is generally swimwear…which is what she wore. Given OP’s own admission of policing her clothes prior I don’t think he’s the most reliable source on how immodest her bikini actually was.",
              "id": 134,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 28,
              "content": "I gave a YTA because he's a controlling A. \"Let\" \"Scolded\" screw that guy.   \n\n\nHis language is controlling and abusive.",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I can't help but look at it from a financial side, in that what if she doesn't own a swimsuit that isn't a bikini? Should she go out and spend $30-40 on a new swimsuit she won't wear anywhere else but this one party? I would think it would be frustrating for someone to tell me to just show up with a \"modest\" swimsuit (those words really don't go together) when all I own is a bikini.\n\nAlso, I don't think she needs to be conservative for him, just the owner of the house she was a guest at--- if they cared at all it's not mentioned in the OP.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2969,
      "content": ">***I .. scolded her***\n\nYTA BIG TIME.    Any guy who states that he scolds his female companion and likes to show how he is the one in control is a big red flag AH.",
      "id": 137,
      "comments": [
        {
          "score": 400,
          "content": "I also have a feeling OP uses “their family” for lots of things but in reality it’s his hang ups. Wtf is he even doing with her",
          "id": 138,
          "comments": [
            {
              "score": 34,
              "content": "Right! like he says in the beginning that he found her going out clothes “too short” and they fought about it.  If he’s “not that religious” as he claims he shouldn’t care what she wears. Like he is not religious enough to date-many Muslims don’t date- a white woman and probably have premarital sex; then he should be not religious enough to understand that women can wear whatever they want.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2101,
      "content": "ESH. Dressing appropriately for the occasion seems to be a lost art. A pool party in a conservative Muslim home is different than a pool party at a hotel in Miami. It’s really not hard to be respectful of the situation. I recently traveled to a Muslim country, I didn’t have to be fully covered but I did make sure to dress more modestly than I would have at home, out of RESPECT for their culture. Being embarrassed and “scolding” your GF for her choices is also not a great move. Further discussion before hand to make sure you were both on the same page and okay with the situation could have prevented an issue here.",
      "id": 140,
      "comments": [
        {
          "score": 525,
          "content": "[removed]",
          "id": 141,
          "comments": [
            {
              "score": 1210,
              "content": "So, most cultures, then.",
              "id": 142,
              "comments": [
                {
                  "score": 136,
                  "content": "Oh man that was great. Kudos to you.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "Yeah, exactly.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 334,
              "content": "I don't respect the USA either, totally agree",
              "id": 145,
              "comments": [
                {
                  "score": 7,
                  "content": "A lot of us Americans don’t either dw mate",
                  "id": 146,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "That’s fine. Then don’t attend the event. \n\nJust because someone has a right to something does not mean they aren’t an asshole for exercising their right.",
              "id": 147,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 270,
          "content": "She may not own other swimsuits. Some people maybe only have 1 or 2. It's a pool party so it makes sense she'd bring what she owns.\n\nI have two swimsuits that fit - a pink bikini & a green bikini. Any others don't fit/got stretched out.",
          "id": 148,
          "comments": [
            {
              "score": 277,
              "content": "And he asked her to dress more conservatively with no guidance.\nPerhaps the swimsuit she wore was more conservative than any other she currently owned.  Maybe (despite being a two piece) this one had wider straps?  Technically that’s more conservative dress.\nNot to mention he scolded her.\nOP is definitely TA",
              "id": 149,
              "comments": [
                {
                  "score": 263,
                  "content": "Yeah his weird line about “even a one piece would have been better” makes me wonder what would have actually even been acceptable, if a one piece is his desperate compromise?\n\nAnd then he says “she was probably the most immodestly dressed” well like, was it close? Or was it everyone else was covered from knees to elbows? The context here is not great.",
                  "id": 150,
                  "comments": [
                    {
                      "score": 132,
                      "content": "“Probably the most” was a big flag for me too, she clearly didn’t dramatically stand out as the one morally bankrupt heathen guest",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 61,
                      "content": "The ‘probably most immodest’ part raises eyebrows. So she wasn’t the only one in a bikini by the looks of it.",
                      "id": 152,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 34,
                      "content": "I worked at a conservative Christian camp and rewrote the dress code (of course with plenty of male leadership guidance, since I'm a woman and can't think for myself /s), and I scrapped the one piece rule because as a larger girl, I found them generally unflattering for larger body types, and it was or intention (at least not explicitly mentioned) that girls go home with body dismorphia, and because by and large, I see a lot of one pieces being less \"modest\" than two pieces. It's getting better, but it always seemed the options for one pieces were either sexy monokini, sport swimsuit, or granny suit.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "This.\n\nIf they were all in full chador covered head to ankle then she would be CLEARLY the most modestly dressed by far.\n\nThe fact that he states it was in debate suggests there were other women in swimwear there. And that maybe his real hangups us feeling self conscious because he is desperate for his parents to approve of who he fucks, but is super aware he is dating outside cultural expectations. And feels very self conscious about that. I knew a heap of guts like him at uni - they all fucked around but ended up marrying \"good girls\" from their culture that hltheur mums chose or approved of. The friends I know who married outside their culture (myself included) all understand that you take someone ABD their culture and you ask your parents to accept that they do things differently.  \n\nAnd a realistically, relationships will ONLY work if you are prepared to respect your partner and put them before your parents' expectations.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "OP's being specifically vague because he *knows* he's TA",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Yeah I really wish we knew what all the other bathing suits looked like, but I think OP is TA no matter how you slice it for being so vague. If every other woman was fully in a burkini then OP didn’t prepare his gf enough on what to wear. If they were in one pieces and tankinis, then he’s probably overreacting. Either way, “scolding” her is completely out of line.",
                      "id": 156,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "As someone who owns some incredibly risqué bikinis, it's entirely possible this is the one she had which provided the most coverage in the bottom region as well.",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Yep.  I have never owned more than a single fitting swimsuit at a time.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "Maybe that was the modest option for her? You dk. Also his family didn’t seem to be as bothered about it as he was. He’s TA.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "You should have a talk with your parents to ask what they expect of non-religious guests at their house, to determine whether or not there is a preferred guest policy that would apply to any guest who appears at their house. If they would not make a special clothing request for friends than they should not make one for girlfriends.  Your girlfriend is not a member of your family and should not have to dress the same way your family does, unless it is specifically requested of her by the person whose home she is visiting, In which case I think she should wear what is requested out of respect. But you don't just go in and assume that a two-piece suit is disrespecting your parents and family",
          "id": 160,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1069,
      "content": "YTA, hope she finds someone better who is not controlling and doesn't have all these definitions of modesty in his head. She is free to wear whatever she wants to. Her body, her choice. Your thoughts, your problems.",
      "id": 161,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1052,
      "content": "YTA\n\nYour girlfriend is right. I’m curious though did your family actually have an issue with it? Because in your post you point out that they haven’t said anything so this seems more like a you problem. You also don’t get to force your religious or cultural beliefs onto others.",
      "id": 162,
      "comments": [
        {
          "score": 247,
          "content": "My family would never say anything to a guest, but some of them would sure be quietly judging.  No one has to care what they think, of course.  Just pointing out that a host/hostess not saying something to a guest does not mean they are fine with everything.",
          "id": 163,
          "comments": [
            {
              "score": 137,
              "content": "But they haven’t said anything to you in private either so they probably don’t care as much as you think.",
              "id": 164,
              "comments": [
                {
                  "score": 40,
                  "content": "Sadly, as someone living in that culture rn, it's not that simple. They might gossip about it and talk ill about it for as long as this person dates this girl, shaming him and her behind her back",
                  "id": 165,
                  "comments": [
                    {
                      "score": 11,
                      "content": "100%",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "But would he ever know? \n\nLike if they gossip behind both of their backs they would never find out right?",
                      "id": 167,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Talking behind someone's back isn't the virtue that you seem to think it is.",
              "id": 168,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 690,
      "content": "Just break up. You have different value systems. You’re not compatible.",
      "id": 169,
      "comments": [
        {
          "score": 50,
          "content": "I almost feel like they’re missing a key element in their relationship, they don’t seem to like each other.",
          "id": 170,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}