{
  "post content": "My husband and I are expecting our first child and we are both really excited. Despite the excitement, I am really struggling: episodes of depression, morning sickness, tired but crazy insomnia, and altogether just not feeling like myself. I do the best I can with it (still working 12 hour shifts in healthcare, cleaning, cooking, etc). My husband is a very supportive partner mostly BUUUTTTT I had a mood swing where He said something small that hurt my feelings causing me to cry. It usually wouldn’t make me cry so I said “I’m sorry I’m crying these hormones are insane” and my husband stated “pregnancy hormones aren’t real, and pregnant women use them as an excuse to act crazy”. I have explained it to him, sent articles to him, and tried to have honest conversations about how I’m feeling with him but he has made it clear this is an opinion he stands by. We have an appointment today and I want to ask my doctor to explain it to him hoping that hearing it from a male obgyn might give him some clarity. However, I don’t want to make him upset or cause more problems (we are military so it could open up some problems for him…. IYKYK). So will I be the ass hole?",
  "id": 1,
  "comments": [
    {
      "score": 12365,
      "content": "NTA,\n\n>“I’m sorry I’m crying these hormones are insane” and my husband stated “pregnancy hormones aren’t real, and pregnant women use them as an excuse to act crazy”\n\nBut i fear for your child if your child is a girl....",
      "id": 2,
      "comments": [
        {
          "score": 3648,
          "content": "If my partner said such thing I'd straight up get an abortion. \n\nIf he doesnt understand the female body HE HAS NO RIGHT TO REPRODUCE",
          "id": 3,
          "comments": [
            {
              "score": 2172,
              "content": "Why would you get an abortion and not a fucking divorce??",
              "id": 4,
              "comments": [
                {
                  "score": 2864,
                  "content": "If a person’s character is so underdeveloped that you feel it’s necessary to divorce them, why would you want them raising your child?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 474,
                      "content": "I would not want them and do you honestly think he will coparent with her? \n\nOP has said this is not the first thing and she decided to have a kid with him anyways so probably ask her that. \n\nI would have dumped him a long time ago. Not even getting close to marriage and having a kid.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "That why you get the divorce dumbass",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Mother usually gets strong custody. It would be her raising the kid in 90% of situations. If she wants a kid theres no reason to get an abortion. That's a massive jump.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 78,
                  "content": "Because an abortion has a time limit, after that you seek divorce 🧏🏻‍♀️",
                  "id": 9,
                  "comments": [
                    {
                      "score": 29,
                      "content": "lmao doing a little urgent/important square",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": "Pretty sure it would be abortion and divorce. Its better than being tied to a willfully ignorant, misogynistic asshat for at least the next 18 years.",
                  "id": 11,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "Abort the husband.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 8,
                      "content": "120th trimester abortion please",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "por que no los dos?",
                  "id": 14,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 46,
                  "content": "Dibortion",
                  "id": 15,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 34,
                  "content": "I'd abort the husband. No laws against 80 or 90 something trimester abortions 🤷😂",
                  "id": 16,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Agreed. That was a very odd response.",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Why not both?",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Seriously. Shows how much she wanted that kid.",
                  "id": 19,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 129,
              "content": "Also I hate this new thing where people are allowed to deny actual factual science and just be like well that’s my opinion. Motherfucker that’s not how opinions work like I can’t just go up to someone and tell them they have no dick even though biologically they do and just be like no that’s my opinion. Opinions are for flavors of ice cream and not for fucking research",
              "id": 20,
              "comments": [
                {
                  "score": 8,
                  "content": "Too many people forget that opinions *can be* straight up, plain old WRONG. Just having an opinion doesn't make it a valid one anymore than believing in the tooth fairy makes it real!",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "Well, that escalated quickly.",
              "id": 22,
              "comments": [
                {
                  "score": 4,
                  "content": "Maybe we should all go to medical school before we procreate.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Apparently.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 43,
              "content": "Or he can learn about the female body?? People on reddit are so dramatic",
              "id": 25,
              "comments": [
                {
                  "score": 39,
                  "content": "OP says that she has sent him research articles and tried to teach him about the female body. And he still is adamant that his \"opinion\" that pregnancy hormones are not real is correct. He is not willing to learn about it",
                  "id": 26,
                  "comments": [
                    {
                      "score": 15,
                      "content": "OP tell him to control morning boner, it's so easy to mentally control our own hormones right?",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -2,
                      "content": "Yeah so let him talk to the dr and go from there. Talking about divorce and abortion like they’re casual things.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 41,
              "content": "wtf is wrong with you? why would you even share this and why does it have 2.6K upvotes? even OP called this comment out",
              "id": 29,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 35,
              "content": "Wow this right here kids is why you always take advice from reddit with a grain of salt.",
              "id": 30,
              "comments": [
                {
                  "score": -7,
                  "content": "It's not advice it's it's opinion they stated.",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "To be fair we have no idea how far along OP is or where they live. That may no longer be an option for them especially in light of recent US laws in some states.",
              "id": 32,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 21,
              "content": "That’s a little drastic.",
              "id": 33,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "An abortion for that reasoning alone sounds like a massive overreaction",
              "id": 34,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Pretty toxic and nuclear response\n\nOP NTA, you however...",
              "id": 35,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 305,
          "content": "“Pregnancy hormones aren’t real” falls into the same category as “why don’t you just hold in your period until you reach a bathroom” and “women pee out of their vagina”\n\nLike Jesus *Christ* mate",
          "id": 36,
          "comments": [
            {
              "score": 47,
              "content": "My favorite horrible women’s anatomy misconception is that the hymen is like a stay fresh lid that covers the vagina and pops when it’s broken. Fuckin morons",
              "id": 37,
              "comments": [
                {
                  "score": 6,
                  "content": "I laughed way too hard at “stay fresh lid”",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "LOL My fiancée is 43 and has a vagina that she's had her entire life. Until I informed her that we don't pee out of our vaginas she 100% thought that. Like...my dude...how did you not know this?!",
              "id": 39,
              "comments": [
                {
                  "score": 2,
                  "content": "This is why sex education is important lmao",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 106,
          "content": "Yeah if he doesn't believe in pregnancy hormones what about hormones related to the menstrual cycle and puberty hormones. There are plenty of times the body does weird things that effect your mind and body.\n\n\n\nIf he can't accept the science involved in that, what other parts of science does he have a different 'opinion' about?",
          "id": 41,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 38,
          "content": "I just sometimes wish men could get pregnant and go through this shit. Your body changes when you grow a whole new human, asshole. Between this and the other things I’ve read about how men believe periods work the last few weeks, I’ve had enough.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "For real. Nta. And yes would ask the doctor to explain it nicely to him. Hormones are in everybody. And woman feel them more cause uterus. Yaaaay/s. Your future child who may be a girl and when she is on the rag she could cry about something so obscure and such that normally she wouldnt cry at. He needs to learn that pregnancy hormone is real and can be extreme cause of the body changes and such. If he cant learn that bodies have hormones (thyroid and other body areas that control our normal hormones) especially woman and pregnant woman then maybe it might be a good time for couples therapy. Just in case theirs other stuff you both have issues with while having a kid and raising one.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Can you imagine. Our bodies are full of all kinds of hormones. How does he not think we would have changes in hormones while growing a fucking human, making milk. Widening our hips etc. How does he think this all happens. He sounds like an uncaring ass and needs to get his shit together and get on board or he can get kicked to the curb!",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Period hormones aren’t real girls use them to act crazy.\n\nPeriod cramps aren’t real girls use them to get out of things.\n\nHold in period until after class/dinner/family time.\n\n-OPs husband in 13 years if the baby is a girl probably.",
          "id": 45,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "Agreed. But call the doc and ask them to explain in advance, so it doesn't sound like you're soliciting the doc. Set it up so that the doc will ask how you're feeling and you'll mention you've had mood swings, and the doc can then say that pregnancy hormones will do that to you.\n\nYour husband's winning the \"never have another child wiht you again\" contest. Lock him out of the house and make him read and take a test on \"What to Expect When You're Expecting\" or similar before he can get the new keys. (kidding not kidding.)\n\nNTA.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "And welcome to 2021 where science means nothing and opinions mean everything because everybody and their mother is a Facebook news self-certified expert. Honestly, I think if you had your doctor say that to your husband's face he would either double down (\"doctor is a quack\") or come up with a new way to gaslight you.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Nta this guy has been listening to too many jerky men on the internet/in real life.\n\nHaving read some of the Other responses it is quite common for abusive behaviors to ramp up during pregnancy so that’s certainly something to look at as well.\n\nWhat was the thing about not wanting to get him into trouble?",
          "id": 48,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3697,
      "content": "I was shocked reading this. Honestly. \n\nYou certainly would not be the asshole in this situation but I doubt it will do any good. It's difficult to debate such illogical attitudes. \n\nPlease take this with a pinch of sarcasm...instead of taking him to the doctor's to have them explain hormones, take him to a relationship therapist and have them explain why its attitudes like his that cause divorces. \n\nI really don't get his logic. I'm sorry. I'm sure he is lovely and you love each other dearly. You must feel so hurt and completely unheard, especially when you are coping with the rollercoaster of hormones and the emotions of being a parent.\n\nPerhaps kick him in the balls and tell him testicular pain doesn't exist it's just made up so men can be wimps? (I'm joking, please don't do that)",
      "id": 49,
      "comments": [
        {
          "score": 2431,
          "content": "This is actually really funny and truthful! The other day he had some heat exhaustion and came home horribly ill… throwing up, diarrhea, headache etc. and I almost told him “what you are feeling isn’t real and you just needed an excuse to act like a wimp”. Lol. I definitely resonate with that you said!",
          "id": 50,
          "comments": [
            {
              "score": 1080,
              "content": "He also indirectly said you were acting crazy. Nip this in the bud one way or the other.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 393,
              "content": "I'm pregnant with my first and the hormone changes are wild. It's all so new and no matter what you read and try to prepare you can't really understand it. It's not like you yelled at him and was mean to him then just said \"suck it up I'm pregnant.\" You cried and even explained it. He's a jerk. \n\nI cried the other day because the store didn't have the soup I wanted. I was laughing as I cried as I knew it was the hormones.",
              "id": 52,
              "comments": [
                {
                  "score": 240,
                  "content": "Currently 20 weeks, and a couple of weeks ago I started sobbing because a kitten was *so* cute that my system overloaded. I’m also gagging at the thought of cheese lately, which has been my favorite food group since forever. But hey, pregnancy hormones aren’t real…",
                  "id": 53,
                  "comments": [
                    {
                      "score": 249,
                      "content": "I sent my pregnant sister a picture of a piglet in rain boots. She called me sobbing because it was so cute. We’re going to paint it on the nursery wall next weekend.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "I cried at SO MANY adorable commercials when I was pregnant. So many. Like, if there was puppy anywhere to be seen, I was in tears. the Dawn dish soap ones where they clean off the oily ducklings and they turn all fluffy and cheerful? Destroyed me. And friends I am NOT generally a crier. I remember sob-laughing to my husband being like \"what is even happening to me right now?\"",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "To be fair, I’ve never even been pregnant and cute kittens get that reaction from me all the time😂",
                      "id": 56,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Ugh the nausea. I'm 30 weeks and still gagging everyday. I would be very sad if I couldn't have cheese. All I eat right now are ritz crackers, cheese, and cup noodles. Everything thing else makes me green.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Ah, this reminded me of the forst time i went on the pill, and my hormones were re-adjusting.\n\nI saw a city rat run smack into the side of a wall, and i burst out crying for 'that poor little mouse!'",
                      "id": 58,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "I bought an old chair, recovered and painted it beautifully for the nursery. When I sat back to admire my work, I was overcome and sobbed unconsolable for a good 2 hours. I couldn't even explain why I was so sad and when my partner tried to get me to talk to him between sobs. We managed to piece together that it was such a pretty chair, not only would I be sad that I don't get to see it as much as the other chairs, but surely the chair itself would also be sad it was being neglected.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "My friend showed up after I told her I was pregnant (after trying to hint for like 3 weeks that she missed) and she said her mom made me a cupcake to congratulate me but their dog ate it. \n\nKid is now 3 and we still laugh at how I mad I got about that (not even THAT mad but I am usually suuuuper chill).",
                      "id": 60,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Early in my pregnancy, I cried my heart out at a character dying on a soap because he reminded me of my Dad. NTA, OP.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 81,
                  "content": "I cried because I had a dream I made meatloaf and when I woke up there was no meatloaf. \n\nBut even beyond the hormones, I've been nauseous, tired, haven't been able to drink a nice Friday night beer, not allowed sushi, weird cramps that feel like period cramps that scare me even though they're normal, not allowed to take a nice hot bath, constipated, and coffee is turning my stomach. \n\nTwo months of that already, maybe, just maybe, there's additional reasons I'm in a goddamn mood. Because I can't remember the last time I felt good.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 45,
                  "content": "Hell, I am not even pregnant but my mood swings on my period are CRAZY. My bf literally throws chocolate at me and just hugs me when it gets bad. I've also warned friends on the day off, when I knew I might be bitchy I just said \"Hey, don't mind me if I act a bit weird today, I am on my period\" and no one batted an eye, one even was like \"Aaaw she must like me, she warned me before everyone else\".",
                  "id": 63,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Funny enough one of the first signs I knew to take a pregnancy test was the idea of chocolate was disgusting a few days before my period was supposed to start and I usually love chocolate at that time.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "I assume hbc isn't as bad as a full pregnancy but even that can bring it up. Had to stop taking the pill because it made me start sobbing constantly for literally no reason.\n\nETA: Congrats on the little one!",
                  "id": 65,
                  "comments": [
                    {
                      "score": 4,
                      "content": "It can vary wildly - I was a sobbing mess on one birth control and oddly mostly even-keeled during my pregnancy (which was wholly unexpected) and then had a roller-coaster for my first week post-partum (I blubbered through the whole beginning of Up among some other times of full fits of sobbing just because).  Hormones obey no laws or logic - different amounts in different combinations can cause very different results.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I remember crying because I missed the subway. There was another coming in literally 2-3 minutes but I was aiming for this one and the doors closed right in front of me.\n\nIt is so strange to cry, knowing it is riduculous but not being able to stop.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "When I was pregnant with my first, there was an organ donation PSA commercial that was on TV a lot. It's a child throwing a ball up into the air, and then it comes down into the arms of another child, and you know the first child died and gave life to the second... Anyway, it made me weep buckets every time it came on. \n\nIt's been 15 years and I still tear up thinking about that commercial. I think it's the memory of the feelings those pregnancy hormones gave me. They are no joke!",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I once cried because my corn dogs rolled into my ketchup and mustard near the stick while I walked to my room..... \nMy husband and our roommates ran to me sobbing on the ground to make sure I didn't trip and laughed when they found out what happened.....leading me to cry even more.\n\nI also cried when a roommate gave me a cookie.\nAnd I have many more stories.",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I cried because I wanted chips, but couldn't get them because I'd eat the whole bag and feel horrible.  So I laughed/cried at checkout while my husband looked like a deer in the headlights like \"what have we done\" lol",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "Ok so I just had my first kid 3 months ago and my opinion is probably going to be down voted but here it is anyway.\n\nFirst: WTF. How are pregnancy hormones \"not real.\" Pregnancy is 90% hormones, 10% fetus if you ask me. The test is literally testing hormones in your pee. The idea that your body *isn't* flooded with absurd levels of hormones which are scientifically proven to affect mood and behavior during pregnancy is asinine. You would not be TA for having the doctor explain this, though I doubt it will do much good if he truly believes what he said.\n\nNow here comes the part that will probably get me downvoted.\n\nHaving recently been pregnant, I have seen a lot of women blaming \"pregnancy hornones\" for being outright abusive to their spouses. Think alone the lines of \"Just cussed out my husband for not running the dishwasher over night and made him cry. Hahaha! Anyone else? #pregnancyhomeones\"\n\nThis is not good. I don't think anyone should say that hormones make it ok to treat people shit, and i hope he actually means he's observed this kind of behavior before and he's just not good at describing what he saw.\n\nThe big issue I see is you were not teating him like shit. assuming he's referring to that \"abuse is ok because I'm pregnant\" attitude, he has conflated it with expected emotional roller coaster. He invalidated your experience, called you crazy, and was all around a jerk. He owes you an apology.",
              "id": 71,
              "comments": [
                {
                  "score": 35,
                  "content": "I'm pregnant, and you'll get no argument from me on either of your points. I was sick for most of my first trimester, and I definitely felt more short-tempered than usual. But I never thought that was some kind of excuse to yell at my husband or be an asshole to my colleagues at work. Did I at one point cry because I really, really wanted a gooey peanut butter sandwich on soft white bread but couldn't have it because I have celiac disease and that kind of bread just doesn't exist in gluten-free form? Yes, yes, I did. Did I give my husband puppy dog eyes to get him to go out at 9:30pm and pick up the grape juice I suddenly had to have? You bet. That's the sort of thing that's acceptable to blame on pregnancy hormones. Taking out your temper on other people is not acceptable, the discomfort and hormonal craziness of pregnancy may be an explanation, but it's not an excuse.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Exactly.\n\nAlso, I sobbed to my husband because \"I brushed my teeth already but can't stop tasting onions.\" That peanut butter sandwich tragedy is real.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "How a person feels and how a person acts are two very different things. Bursting into tears because you saw a picture of a duck with its head tilted quizzically? Fine. Yelling and throwing things at the people you love? Not fine. \n\nIf someone is feeling hostile because of pregnancy then they need to ask for space until they feel better. \n\nFor what it’s worth you have not been downvoted, but if you had been I’d have gone down with you on this one.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 2,
                      "content": "It’s like I tell my toddler ‘it’s ok to be upset/angry etc, but it’s not ok to throw things/yell at your sister etc’ \nThe feelings and hormones are absolutely real and crying and being upset are completely fine and appropriate, which is what it sounds like is happening in this case. I’m sure there are some cases where people do the second part as well and that yes is definitely not ok!!",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Your HCG levels literally double every two days in the first trimester. It's completely wild and overwhelming. I suggest you barf on him at every convenience to get him ready for the realities of having children.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 306,
          "content": "I do get his logic.\n\n“pregnancy hormones aren’t real, and pregnant women use them as an excuse to act crazy”\n\nNot only is he 100% right - he hasnt gone nearly far enough.\n\nPregnancy itself is fake. Its purely an attention-seeking device. Its all done with cushions and mirrors. \n\nI'm not entirely convinced 'women' are real either tbh. I suspect they are a social construct invented by those with insufficient moral fibre.\n\n/s\n\nImpressive levels of willful blindness by the husband! \n\nI love conspiracy theories but this one is new to me. Even google gives me nothing. And when the internet isnt interested in your crackpot theory, you have likely strayed a little too far from the pack.\n\nBe interested in an update on the reaction to the explanation. Although I'm a bit concerned the reaction might be \"Thats what they WANT you to think\".",
          "id": 77,
          "comments": [
            {
              "score": 78,
              "content": "You got me in the first part haha, I was so ready to downvote till I saw the /s",
              "id": 78,
              "comments": [
                {
                  "score": 2,
                  "content": "Same! 😆",
                  "id": 79,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "I have to take exception with \"I'm sure he is lovely\". I'm sure he is not. He sounds like a macho military asshole who probably gets all his information from Facebook and other white guys who don't believe in science.",
          "id": 80,
          "comments": [
            {
              "score": 5,
              "content": "The military is a unique blend of diversity amongst its members. That said as a female having spent 7 years in that 'man's world'. I can say from experience the macho military asshole syndrome is widespread across all its male members regardless of skin color.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1522,
      "content": "NTA, but your husband is a giant AH. Definitely have your doctor explain it to him, because pregnancy hormones are no joke. \n\nAs an aside, It’s concerning to me that he just dismissed and disrespected you like that. Does he do that often or is this an isolated incident?",
      "id": 82,
      "comments": [
        {
          "score": 679,
          "content": "In regards to life he isn’t like that ever. In regards to this pregnancy, it’s not an isolated incident. Am I making sense?",
          "id": 83,
          "comments": [
            {
              "score": 708,
              "content": "Are you guys having a girl? Actually even if it's a boy I would be worried about how dismissive this behaviour is of your partner. Does he really need a man to explain rather than trusting you? Seems sexist.",
              "id": 84,
              "comments": [
                {
                  "score": 13,
                  "content": "Sounds like she’s still in the first trimester. Maybe early into the second, but likely to early to know either way.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 4,
                      "content": "You can find out with a blood test around 9 weeks. Still early in the 1st trimester before it's even officially a fetus yet.",
                      "id": 86,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 587,
              "content": "[deleted]",
              "id": 87,
              "comments": [
                {
                  "score": 198,
                  "content": "Exactly. It will end up being very dangerous if OP gets PPD or PPA and he's just like you're fine, there's no such thing as that, stop being a wimp.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 109,
                  "content": "I don’t even feel like you should need to provide logical arguments or articles. If she’s feeling it, she’s feeling it. He doesn’t need to fully understand the science of hormones, he just needs to trust that she’s struggling with something. That should be enough!",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 51,
                  "content": ">This is a big problem because postpartum hormones hit even harder.\n\nNot to mention the physical challenges of late pregnancy and the postpartum time.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Agreed re: post-partum. I was pretty even-keeled emotionally during my first pregnancy, maybe a little more sensitive and quick to tears than usual and definitely sick as a dog for pretty much the whole thing. I didn't even get the famous hormone crash on day 3...no, I got it on day 5 when I literally just sat on the couch dripping tears for no reason for at least an hour while my husband spoonfed me while I was breastfeeding. My body was re-regulating my raging hormones and I was just a mess. It is vividly burned in my memory.",
                  "id": 91,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 138,
              "content": "You could just say to the doctor, \"I cry about everything lately, can you explain this for me? I feel like I'm going crazy\" and then maybe he won't feel singled out.",
              "id": 92,
              "comments": [
                {
                  "score": 16,
                  "content": "I wouldn’t sugar coat it or tiptoe around him like this, personally. He needs to hear the info straight up from a doctor.",
                  "id": 93,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 115,
              "content": "This is how my partner was after I got pregnant and believe me when I say it’s a red flag and people CAN change in bad ways after parenthood.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 107,
              "content": "Unfortunately, it's super common for people to start showing their true colors once they believe their partner is in too deep to leave. I would be seriously considering if you want to raise a child with this man.\n\nWhat happens when you have a daughter and she's in crippling pain from periods? When you have a son that dares to cry or show emotion?",
              "id": 95,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 66,
              "content": "You need to have your obgyn talk to him NOW. I just had my kid two months ago and the first two weeks after were WILD. My wife told me my shirt was backwards one day and I broke down sobbing. I thought it was funny! I had no idea why I was crying! The baby cried in public once and I did too. Nothing was wrong with her and I knew that!\n\nMy obgyn was great and really clearly laid out for me how bad the hormones were going to be, but thinking back, he never talked to my wife about it. I would ask the obgyn to talk about it today, AND ON OTHER VISITS. Beat it into your husbands head now because you are going to need him after the birth, to help you navigate stuff you can’t control and doesn’t make sense to you.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "How long have you even known him for? When you say \"ever\" does that mean 2-3 years? Because me not having gone out of the country in 2-3 years or not having had lamb for dinner in 2-3 years does not mean in life I haven't ever left rhe country or had lamb.",
              "id": 97,
              "comments": [
                {
                  "score": 42,
                  "content": "I’ve known him for about 5 ish years, we’ve been together for about four of them. Married for close to one.",
                  "id": 98,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 57,
              "content": "That's worrying. Please let the other people in your life know about this.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "[deleted]",
              "id": 100,
              "comments": [
                {
                  "score": 90,
                  "content": "I had mood swings (crying during a commercial, tired, cramps) and horrible periods. I had the copper IUD so my bleeding was absolutely awful. He has always been super supportive and almost coddling during my periods.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 81,
                      "content": "[deleted]",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 32,
                      "content": "Why is he understanding with periods but not when your body is building and growing a baby???",
                      "id": 103,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "This to me signals even more than he is showing true colours. If he was understanding and able to comprehend hormones before, why not now?\n\nBecause you’re trapped. Please acknowledge the person he’s showing you he is.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 33,
              "content": "It’s been noted that when partners switch up like this, it mostly comes out during pregnancy. Either because of the high stress and change (if it’s unintentional) or because they feel like they really have you where you can’t leave them (if it is intentional).",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I actually think it could really be that just has NO IDEA about womens bodies and hormones. That he never learned it from his parents or sex ed (or friends etc.).",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1296,
      "content": "OP, if you are genuinely worried that your husband is going to react so badly that it will negatively impact his military career or yours, you need to talk to someone NOW.  That is not normal, and I say that as someone who has lived under the strictest military restrictions on personnel behaviors and mental and physical health.\n\nPM me, I will get you in contact with folks at your base who can help you.  Even if it’s just to talk to a new parent coordinator or help you get in touch with an MFLC.\n\nNTA.  Not even close.",
      "id": 107,
      "comments": [
        {
          "score": 477,
          "content": "This needs to be higher. To be entirely honest, the fact that a simple question posed to her doctor (whether it’s a military doctor or not), along the lines of, “I’ve been having mood swings, depressive moments, and other symptoms of fluctuating hormones. I feel like I’m going crazy over here because while my husband understands the morning sickness and my tiredness, the mood swings seem to be totally out of left field to him. Do you think you could help us talk through how these early stages of pregnancy can be very emotionally and mentally difficult due to the hormonal changes in the body?”\n\nIf THAT question raises red flags that he is *ABUSING HER* then I have a feeling that he has a history the military knows about that hasn’t exactly been disclosed here. Perhaps he’s been talked to for having a quick temper, or not accommodating people while they were badly ill. If either of these are the case, then this isn’t *just isolated to the pregnancy* the way OP is insisting — it’s a sign of a pattern of behavior that her husband demonstrates anytime someone annoys him or doesn’t act exactly as he thinks they should. That kind of behavior would worry me around a small child who is going to be prone to accidents and annoyance.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 119,
          "content": "Yeah what the actual hell is she talking about with problems in the military, *if you know you know*, are military women not allowed to experience pregnancy hormone related moods?",
          "id": 109,
          "comments": [
            {
              "score": 95,
              "content": "I *think* she’s trying to give a little wink wink to the fact that at every appointment at a military facility, they ask you if you’re feeling “safe” at home.",
              "id": 110,
              "comments": [
                {
                  "score": 55,
                  "content": "Somebody let her know that they do that at pretty much every doctors appointment ever",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Right? That part really worries me.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "Everyone with a free award needs to give it to this comment right now for visibility. If OP listens to one comment, it should be this one.",
          "id": 113,
          "comments": [
            {
              "score": 30,
              "content": "I hate spending money on reddit coins but I did it because I’m out of free awards right now and this is worth it.",
              "id": 114,
              "comments": [
                {
                  "score": 6,
                  "content": "Is your username a reference to my all-time favorite SNL pre-tapes “Back Home Ballers” and “(Do it on my) Twin Bed?”",
                  "id": 115,
                  "comments": [
                    {
                      "score": 6,
                      "content": "yesss I’m so happy you picked up on it!",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I love those as well, and I’ve never heard anyone else reference them!! Bowls, bowls, all types of bowls…",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "Just claimed and gave one, because of your comment",
              "id": 118,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "MFLC is AWESOME! And I don’t think enough people know that.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Reply to boost this one. I hope OP reads this.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 603,
      "content": "NTA, but perhaps  can be clever about it. Ask the doctor - \"I'm getting mood swings, and sometimes feeling sensitive and burst into tears at small things which usually wouldn't bother me. Is this normal? Should I be worried that something is wrong?\" and then let the doctor explain about pregnancy hormones. And you can exclaim at your husband \"Oh honey! We can be so relieved that this is normal. Thank you for being supportive and being understanding whilst we go through this together.\"  \n\n\nYou might want to think about having plans in place for a support network in case you get PPD as it sounds like your husband won't be understanding or supportive.",
      "id": 121,
      "comments": [
        {
          "score": 335,
          "content": "A grown adult shouldn't have to be so indirect to get factual information to another grown adult, tho.",
          "id": 122,
          "comments": [
            {
              "score": 176,
              "content": "Agree, but sometimes \"shouldn't have to\" can take a back seat to \"what works.\"",
              "id": 123,
              "comments": [
                {
                  "score": 22,
                  "content": "I'm just saying, it's pretty red flaggy.  Is this how she's going to have to 'manage' him the rest of her life?",
                  "id": 124,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Oh yes, a huge red flag. I think this is a battle vs a war situation. Following this commenter’s advice would win her this battle. As for the war… she pretty clearly needs to leave him",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "I agree. It might be more effective short-term, but long-term this guy needs a reality check on par with a hard slap to the face. (Not a literal one, tempting though it is)",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 61,
          "content": "I think there’s a high chance he could then go ‘the doctor was just saying that to placate you. Pregnancy hormones aren’t real’ when they get back home.",
          "id": 127,
          "comments": [
            {
              "score": 7,
              "content": "100% he would do this.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 388,
      "content": "NTA but your husband sucks and I don’t think a doctor is going to convince him not to suck. If your only idea of getting through to him is to have him be explained SCIENCE by another man, he clearly just doesn’t respect women (or you) to begin with.",
      "id": 129,
      "comments": [
        {
          "score": 46,
          "content": "Exactly — she shouldn’t have to fight to be heard or considered. The fact he’s so quick to dismiss her lived experience and refuses to do any actual research to educate himself about the cold hard facts is infuriating. He isn’t even willing to question his opinion, let alone trust that his wife might actually know what she’s talking about — when it comes to her own damn body, no less. It’s condescending, misogynistic, disrespectful, hard-headed, deeply arrogant, and immature. It makes me so sad for OP that she thinks the only way to get through to him is to get another man to say it. (Because clearly, women don’t know anything about their own bodies, right?) This alone is enough to make me think his sexism and arrogance must extend into other aspects of their lives together. Time for marriage counseling. NTA.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 242,
      "content": "NTA if he needs to hear it from a man to believe it then  you have problems. He believe that hormones are some kind of fairy tale made up by women to pick on men? What’s his excuse for being crazy?",
      "id": 131,
      "comments": [
        {
          "score": 55,
          "content": "Oh yeah if there is this issue now I can see problems down the line with ppd which like 50 to 85% of women get. Also I don't think he would be a compassionate person towards the kids while raising them. If its a girl she's going to be suppressed, if it's a boy he's going to pressure and indoctrinate him into a very toxic mindset..",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "What if the doctor is a woman? She'd be lying too?",
          "id": 133,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 210,
      "content": "NTA\n\nDo what you're thinking.... Subtlety mention your hormones AND sickness and ask how it changes throughout pregnancy AND after birth. You might need a refresher of this at each appointment to get some more information into your hubby's head \n\nBut wtf..🚩🚩🚩🚩. That's a huge red flag OP. What's he going to be like when the baby is born?? Is going to freak on you while in labour?? Babies cry for no reason sometimes..is he just going to be dismissive?? Postpartum is huge OP. You will be wrecked... .both good and bad after giving birth. Do you have other family for support?? You're going to need it.",
      "id": 134,
      "comments": [
        {
          "score": 91,
          "content": "Honestly not really. I live in Georgia and have only lived here a couple of months. My family and friends are in New Mexico. I also think this could be why it’s weighing so heavily on me, I don’t really have anyone to vent to or I guess get validation from besides him. I haven’t had the chance to make friends yet and with me feeling so crummy I’m not the most social.",
          "id": 135,
          "comments": [
            {
              "score": 126,
              "content": "This isn't a problem that's just going to go away. It's not a matter of who is medically right or wrong but of respect. He's completely dismissing your very real feelings and insulting you (\"acting crazy\"). You are pregnant and at your most vulnerable and instead of showering you with support and love he's tearing you down. Some emotionally manipulative men see having a baby as almost an excuse to quit pretending to be caring because they figure you won't leave them. These comments are a huge red flag that he'll grow more and more controlling and disrespectful the older your baby gets.\n\nI would address the issue now and let him know he's attitude towards you and your pregnancy are not acceptable and if he's unwilling to be a loving and supporting partner I would go back to New Mexico and surround myself with people who are.\n\nEdit. Depending on how he handles anger and rejection I wouldn't necessarily tell him I was leaving. I would just go.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "So now you're isolated from your support system and you're pregnant. To echo the million other comments, abusers tend to start being abusive when they feel they have you trapped. Sounds like this behaviour is recent, it lines up. He thinks you won't leave now. You need to let the people you trust know what is going on.\n\nAlso, forget about the military repercussions, ok? If they want to investigate if he's abusive, that should be fine? If he isn't, he'll be cleared. If he is, good for you and your child to deal with it now. \n\nLastly, you've implied a couple times that there has been more bad behaviour from him lately. I noticed you haven't said what exactly. Could it be that you don't want to say it, to make it real? Because you know it's bad? And you know this sub will double down on \"NTA - leave him\" and maybe you're not ready to admit that to yourself. We're here for you, OP. <3",
              "id": 137,
              "comments": [
                {
                  "score": 22,
                  "content": "Just him swearing that hormones don’t exist when I send him articles or try to talk to him about this incident. He hasn’t done anything else unsupportive, but this incident has made way in our house several times.",
                  "id": 138,
                  "comments": [
                    {
                      "score": 62,
                      "content": "He gets upset even you try to talk about it, though? That's not ok, you should be able to discuss problems calmly. And he swears at you? That's not okay. Both of these things are abusive (emotional/verbal)",
                      "id": 139,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 37,
                      "content": "But he is being unsupportive by not listening at all to you on a topic that you are currently going through.",
                      "id": 140,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 36,
                      "content": "You (and your baby) will be in real danger if you experience postpartum psychiatric illness, as [50%-85% of postpartum women do](https://womensmentalhealth.org/specialty-clinics/postpartum-psychiatric-disorders/), because this man will not believe you or support you when you are ill during such an incredibly vulnerable and stressful time.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "He's expecting you to work full-time, do all the housework and not mention the effect your pregnancy is having on you - and not have mood swings or other side effects.   \n\nThat's not supportive. Seriously",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "But you said in another comment that he was very caring when you had your period...? I just don't get why he believes in one hormonal circumstance but not the other.",
                      "id": 143,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Do you guys live on base? There are support groups for spouses on base. Also look for local support groups on FB etc..I know covid has changed meet ups and what not, but connecting with someone local would be helpful. Also any activities that perk your interest might help as well. Get on the phone with your family and friends back home as well. Talk... Don't isolate yourself.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Please reach out to other military spouses, or even Facebook groups in your area! You need support, especially being so far from home. Maybe your doctor knows of local mom groups you can link up with? Even virtually?\n\nI’m worried for you, OP, I’m not going to lie. You’re pregnant, isolated, and your husband is being a total butthead (am I allowed to say that? Is that considered civil? I want to call him something worse). I’ve seen people in your exact situation have things turn out completely fine, but I’ve also seen even more turn out *not* fine at all.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "You said in your post that asking your doctor about the hormones+your husband could cause problems because you’re in the military, what did you mean by that? \n\nMaybe he should take a look at /r/daddit and /r/Predaddit  to talk to other men and read the experiences of other men with pregnancy and the postpartum period. \n\nI do believe your husband’s point of view is rooted in misogyny and that’s a problem. Women are often not listened to or believed and the US has a fairly high maternal death rate compared to other developed countries. You need a partner who is going to advocate for you at the hospital, who understands what’s happening during labor, who knows what you want and need if you can’t advocate for yourself. It doesn’t sound like he’s going to be that person. You might want to look into hiring a doula for the birth, someone who will advocate for you if you need it and as a coach/support during labor.",
              "id": 146,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Could you get your Mum to come and stay with you for a few weeks after you’ve given birth ? It would make all the difference.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Oh man, I know that feel. New station, no friends yet, it suuuucks. \n\nIf you're on Facebook, there are almost definitely some mom/spouse groups for that base and if they're doing any covid-safe meetups, that could be a good way to meet potential friends. I promise there are others feeling the same way.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -2,
              "content": "Aaaah, Georgia...that explains it.",
              "id": 149,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "This is my concern 100%.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 128,
      "content": "NTA. Also what more problems would it cause with being military? Is it common for the military to have sexist views or suppress women. Yes encourage your husband to sit in the doctor's office and have him explain it to your husband. There are already reg flags. Be careful in that environment.",
      "id": 151,
      "comments": [
        {
          "score": 68,
          "content": "With the military it could raise concerns of him being emotionally or verbally abusive, resulting in him getting in serious trouble.",
          "id": 152,
          "comments": [
            {
              "score": 249,
              "content": "That is exactly what should happen of he is. The military has a huge issue with misogyny and depending on where you live can be a horrible environment for wives. Hopefully your not in Texas cause there would be a chance you would get punished for not being obedient. His attitude is more likely to get worse than it is to get better.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 202,
              "content": "why are you worried about him, when he isn't worried about you?",
              "id": 154,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 154,
              "content": "Hon, if he's getting in trouble for the way he is behaving, the problem is the way he's behaving, not what you are or aren't doing to hide it.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": "It kinda sounds like that's exactly what he's doing",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "He *is* being emotionally abusive though. He’s fucking gaslighting you.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "While it's possible that his recent behavior is related to stress or something correctable, it's also possible that this pregnancy is what will trigger him into being an abusive asshole (or he feels that he has you trapped and can show his true nature). Don't worry about it raising concerns, it SHOULD raise concerns! Have this conversation with the doctor. Lay the groundwork for documenting his abusive behavior in case things well and truly go pear shaped.\n\nNTA",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "So what you’re saying is if he starts becoming abusive, people might find out he’s being abusive? And you’re worried about this? It sounds like the best place to find out you have an abusive partner is in a safe space like a doctor room with a witness whose only goal is to protect you and keep you safe, and who will make sure any abuse does not go unpunished.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "If he gets flagged as such, it's for a good reason. If he gets so upset that a professional is concerned for you and your child, that's not something you want to sweep under the rug.\n\nWhat're you going to do if you end up with worse side effects later or PPD after the baby's born? How are you going to cope if he's saying it's not real and you're just \"acting crazy\". How's he going to react and treat you if you end up needing real help and he genuinely believes it's just you hamming it up?",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Do you share the same concerns?\n\nStatistically, the biggest threat to pregnant women's safety is their partner. Do you feel emotionally and physically safe with him?",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "So, the reason why it raises these concerns is because it *is* abusive to make a “joke” that makes you cry and then, instead of apologizing, to say that you are lying about what is happening to your body in order to control your response and shame you for emotions you cannot control. If you broke your arm, and he bumped into your broken arm on accident, and then instead of apologizing he said that women lie about broken arms, they don’t experience pain, and bringing it up is a manipulation tactic, you wouldn’t stand for that, would you? Because it would be plainly, unquestionably cruel and selfish. So why is it okay when it’s his baby in your body?",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 91,
      "content": "NTA. Sounds like you're not going to have a lot of support during and after the pregnancy.",
      "id": 163,
      "comments": [],
      "relation": "Support"
    }
  ]
}