{
  "post content": "Uh ok so I know that the title makes me seem like an immediate asshole, but I swear it isn't ass petty as it sounds.\n\nlast year was my sophomore year of high school. In the district I live in, we have so many kids that the 8th graders and the freshmen go to a completely separate school than the rest of the high school, so my sophomore year was my first year of real high school. Because there are MANY more kids in the high school than in our other school, we didn't have many classes together.\n\nOne of my closest friends who we'll call Ashley (F16) was nervous about not having her classes with any of her friends. First semester was fine, but come second semester, she knew practically no one in her classes. Ashley was talking to me (M16) about how she didn't know what she was going to do about PE (you need friends in that class, trust me), and I was just telling her that she needs to put herself out there and try and meet new people. And so she did. She became quick friends with who we'll call Addison (F16). Eventually, Addison kinda becomes a part of our larger friend group. \n\nHere's where we run into some trouble. Addison and I have very different world views, because we have different perspectives. She's a young black girl and I'm a gay white guy. pretty different. She is extremely liberal, whereas I lean more conservative, and we have many differing opinions. I have zero problem being friends with someone that has a different opinion than me. But Addison likes to argue. It was fun at first, getting into little arguments, but it always leads to a heated debate where she gets REALLY emotional. Like, almost crying emotional. So that kind of got on my nerves.\n\nThe big thing though is this. I have this mental illness called OCD. My personal form of this is that I really like fives, I need to be even, I hate germs, and I like for things to be complete. Anyways, as Addison and I become better friends, I share this with her. She proceeds to be one of those assholes that's like \"oh? you obsess over germs? What happens if I touch the lid of your water bottle? ahaha\". usually, I try to not get too mad over this stuff. I just tell the person to not do that, they usually are like oh shit ok and we move on. But she will not listen. I can't even count how many times I've told her that I suffer from a real mental illness and that that she needs to stop, but she doesn't listen. Aggravating my OCD has caused problems for me outside of school too. It sucks. Even other friends of mind have tried to tell her, but she just does not get it. She tells me I just need to \"love myself\" and I'll be ok, but that's just so ignorant. \n\nAfter this shit, one day I snap. I tell her that I'm fucking over her shit and that I'm completely done with her. I also call her 'ignorant' and 'fake woke'. She cries. A lot of people in my group are mad at me. She texts me saying that what I did to her was \"not ok\". What the fuck. But it kinda made me think? Like am I overreacting?\n\nReddit, AITA?",
  "id": 1,
  "comments": [
    {
      "score": 26,
      "content": "ESH.  She clearly doesn't respect your boundaries and doing what she did, knowing that it would set you off, is messed up.\n\nBut you did go a bit far in telling her off.  You could have done without the \"fake woke\" part.  You were in the right in having tried to speak to her before and basically saying you were done putting up with this, but saying that seems unrelated and a bit much.",
      "id": 2,
      "comments": [
        {
          "score": 14,
          "content": "I think “fake woke” is valid. If she claims to be tolerant and accepting of people, then she should be tolerant and accepting of some people’s triggers. Bullying someone for something they can’t control is very “un-woke”.",
          "id": 3,
          "comments": [
            {
              "score": 3,
              "content": "Yeah, I guess that's a fair point.  It wasn't clear if he explained himself when telling her off or just called her fake woke.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 19,
      "content": "NTA. \n\nAddison is a piece of shit. She should have respected your boundaries, regardless of any differing philosophies. \n\nIn a perfect world you wouldn't have snapped, but it's understandable. She was looking for a response. She got one. \n\nNow that the heat of the moment has passed, you should consider if you said anything you didn't mean. Apologize if you think it's warranted, but make clear that you still consider her behavior entirely unacceptable.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 17,
      "content": "ugh. NTA but you're a bit of an asshole for the clickbait title that didn't really have anything to do with why you cut her off. she harassed you over your mental illness, which is the opposite of what a true leftist should ever do.",
      "id": 6,
      "comments": [
        {
          "score": -12,
          "content": "Modern leftists are the people who talk about tolerance and then don't tolerate any difference of opinion though. They often resort to shouting instead of reasoning and can't have a civil discussion about serious issues. This girl seems perfectly woke because she dishes out vitriol and then can't take it back without crying and throwing a fit.",
          "id": 7,
          "comments": [
            {
              "score": 8,
              "content": "sweetheart just because one person was mean to you doesn't mean the left is intolerant lol\n\nkeep your bad takes to yourself",
              "id": 8,
              "comments": [
                {
                  "score": -1,
                  "content": "Lol the left isn’t intolerant??? Just watch the latest Donald Jr. episode of the View. Whoopi was so intolerant of the crowd applauding Trump Jr she clapped at them while calling them children and told them to shut up. Don’t act like they are tolerant of other views.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 4,
                      "content": "i'm sorry people don't want you to hate poor people",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": -4,
                  "content": "Cool, so instead of trying to logically argue any points I've made you go straight to vitriolic insults with your \"sweetheart.\" Thanks for making my point.\n\nTo further analyze what you said, you assumed my opinion must be because someone was mean to me at some point, which is your way of trying to invalidate an opposing opinion, and you conclude with telling me to not speak my mind, which is you trying to silence me. Very tolerant.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 5,
                      "content": "we get it you watched 2 jordan peterson videos now you've achieved maximum galaxy braindom\n\nlook g this isn't the place for debate, you're welcome to pm me anytime if you want to have one of those \"civil discussions about serious issues\" you love so much. have a good one 😘",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NTA The clickbait title was unnecessary. This isn't about her being fake woke, it's about her being a straight up bully and thinking that it's at all ok to be an absolute dick. \n\n> She texts me saying that what I did to her was \"not ok\". \n\nNo, it was ok and clearly necessary. Repeatedly saying stop didn't do shit. Being nice didn't do shit. Telling her that OCD is very real didn't do shit. No, what *she* did was not ok. Her being an asshole bully was not ok. Her getting upset at you for no longer being nice about her being a bully is not ok.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA . She shouldn’t have DELIBERATELY triggered a genuine mental illness repeatedly.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "ESH but what does her being a leftist have to do with anything? Or her race? Or even the fact that you're gay? Y'all are 16, she pushing your boundaries and thats shitty but it looks like youre just fishing for some other people to dog on this chick cause shes a leftist. I think this friendship has other issues...",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA. It sounds like you tried to establish boundaries and she didn't respect them.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA she doesn't take mental illness seriously so you know she isn't very woke",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. I have misophonia which is a serious phobia of certain noises. I have many that bother me but mouth noises trigger my fight or flight response and I get extremely fearful, shut down and have a panic attack. It’s extremely embarrassing for me to live with so I only tell people when I know them really well or am in a situation where I have no other choice.\nI have no respect for people that upon hearing my confession smirk and go “oh, like this?” And makes noises in an attempt to trigger me just as an experiment to see what happens. \n\nSounds like Addison is extremely naive and doesn’t understand mental illness. You did the right thing. You have every right not to tolerate her bs. That’s crossing the line. I’m an adult and cannot imagine how much worse high school would have been if I had a panic attack while at school. People would have treated me like even more of a pariah. If she can’t respect your boundaries, then I fully agree. She isn’t very “woke” after all.",
      "id": 18,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Ugh. I’m too tired for this. \n\nI guess NTA? \n\nYou can cut out anyone you wish. Slight Y T A for exploding at her after tolerating it and enabling it, but it’s an N T A",
      "id": 19,
      "comments": [
        {
          "score": 0,
          "content": "Him telling her to stop countless times isn't him tolerating and enabling it.",
          "id": 20,
          "comments": [
            {
              "score": 1,
              "content": "Them getting in such heated arguments that she’s nearly crying tells her there are no boundaries.",
              "id": 21,
              "comments": [
                {
                  "score": 0,
                  "content": "More like she doesn't respect boundaries, since \"stop\" isn't in her vocabulary.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}