{
  "post content": "I (38F) just got married to (45M) Jim. He has two children with his ex-wife, twin girls 15 years old who live 5 hours away. I have no children. I have a great job, I have a rental property, & I have two other side hustles that adds to my income. Jim works full time but doesn’t make as much as me. He takes care of the kids & the mortgage. I take care of all bills, car notes/insurance, & major purchases. I have plenty left over to spoil myself & Jim. His relationship with the girls is great, & my relationship is pretty good. We get them for a weekend every month & most breaks. We also try our best to attend extracurricular events.\n\nJim pays child support half of extracurriculars & health insurance costs, but also gives allowance, purchases most of the girls’ clothing, pays for their hair to get done, & more. Their mother does not think it is enough & constantly berates him. She says she barely makes ends meet. I believe her, she is on disability for her asthma, & refuses to work. She has two degrees but says that because she has not worked in 16 years she won’t now.\n\nLately she has been commenting on my lifestyle. She tells Jim that I should help more financially with the girls. He lets her know that the girls aren’t my responsibility finically & that I support them in other ways. He lets me know that he is fine with me doing the extras for the girls (gifts, vacations, nails & such when they are with us).\n\nFor xmas she wants to do as they “always have” where Jim provides $1000 & she buys xmas gifts “from mom & dad”. I let Jim know that this was not ok now that we are married & a family. We can take the $1000 & buy the girls gifts from him & I. He is on the fence & does not think she will have money to buy the girls gifts. I think it is not our problem. Note: the girls will be with us on Christmas\n\nAlso, their birthday is coming up & they are turning 16. Jim wants to buy them a car & put it in our name & on our insurance. I think it is a bad idea because there are 2 other adults in the mom’s home that don’t work /don’t have a car. I think they will bully the girls into “borrowing” the car & it will be more of a communal car. I don’t want Jim & I to be responsible for anything happening if anyone other than the girls drive it. Jim understands & shares my concerns. My compromise is if we could go half on a cash car & their mother pays the other half, put the car in her name & on her insurance. He does not think their mother will be able to come up with the money & he feels bad because if we don’t buy the car, they won’t get one.\n\nI am starting to think that I may the a-hole because I don’t help financially with the girls needs only their wants when they are with us, & I keep saying no to Jim.\n\nAITA because I don’t want Jim to give his ex-wife money for xmas gifts from “Mom & Dad” Also, AITA because I don’t think it is a good idea to buy the girls a car in which I would have to help pay for.\n\nUpdate:\n\nA lot of people are asking if I have a prenup, yes I do.  We are keeping finances separate at least until after the girls turn 18 and child support obligations are over.\n\nWe have talked about getting custody of the girls. They don’t particularly care for their home life but they don’t want to leave their friends, school and activities to “start over” here when they only have two years of school left. They know that they are more than welcome here at anytime.\n\nChristmas money. A lot of people think I have an issue with the amount of money. I absolutely do not. I have a problem with Jim facilitating Xmas in another household.  And then Jim and/or I will still need to facilitate a Xmas here in our household as we will have the girls. I like the idea of the send $500 to their mom and keep $500 to get gifts from us.\n\nThose that say I should just let it be because this is the way it’s been done. Well I usually go on a solo Christmas trip. Should I pack up and go on my trip, because it’s the way it’s always been done or should I change things because I have a new family?\n\nI am not trying to bash their mother. She does have really bad asthma. But she also refuses to work in any way shape or form to make sure her children have what they need. She truly thinks it is Jim’s responsibility to take care of her household. I don’t know and really don’t care what she is going to do after the child support payments stop in two years. \n\nThe car, I’ve pretty much told him that the car is a bad idea. Jim and I talked it over last night and settled on that if their mother isn’t willing to insure the car then we would wait until they are 18 before getting them the car. ",
  "id": 1,
  "comments": [
    {
      "score": 1078,
      "content": "NAH.   word of advice, unless you and Jim are planning to go the full custody route (and if your description of the mother's house is correct you probably should)..  married or not, stay out of it, you have no horse in that game.\n\nAs long as he's not giving any of your money.. you don't get an opinion on the 1000.  \n\nThe car insurance you have a point, but he can get them the car and have them get their own insurance to teach responsibility.",
      "id": 2,
      "comments": [
        {
          "score": 137,
          "content": "If they’re married, isn’t her and his money “their” money? To me, it sounded like their finances were shared which is why OP was originally not wanting to be financially liable if something happened to the car and the girls weren’t driving it.\n\nEdit: corrected a misspelling",
          "id": 3,
          "comments": [
            {
              "score": 222,
              "content": "She explained what they both pay , u can be married and have separate finances",
              "id": 4,
              "comments": [
                {
                  "score": 13,
                  "content": "I get the feeling that many of the people upvoting this comment and replying about separate money would be very shocked by what goes on in divorce court cases lol.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 26,
                      "content": "What happens legally when a marriage is dissolving does not have any bearing on how OP and her husband have agreed to handle their finances. This is a non sequitur.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "My husband’s field is family law and we have separate finances.  Unless there is a divorce married couples can have separate finances.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "She said she has a prenup",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 92,
              "content": ">He takes care of the kids & the mortgage. I take care of all bills, car notes/insurance, & major purchases. I have plenty left over to spoil myself & Jim.   \n>  \n>He lets her know that the girls aren’t my responsibility finically\n\nHow could you possibly read this and think her and his money is \"their\" money?\n\nNo being married does not make his and her money \"their\" money.  That would be a choice, a choice they very obviously have not made",
              "id": 9,
              "comments": [
                {
                  "score": 46,
                  "content": "Though, if buying the car, paying the insurance and upkeep impacts his ability to make the mortgage payments then it's absolutley her business.",
                  "id": 10,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yes it does. My wife and I have separate accounts, separate bills, and while we each get a bit of individual play money, everything else is still \"our\" money because it impacts us as a couple, and bills/debt impacts each other's credit.",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "Why are you privately messaging your disagreement with what I said? You're making a blanket statement that it's not \"their\" money just because they're married, and I said it is. What my wife and I do is relevant as it contradicts you, and every other *solid* marriage I know is the same way. Once you're married it is absolutely shared money.",
                  "id": 12,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -1,
                  "content": "If that money was ever in a joint account it can be argued in court that it is both of their money. Anything that even slightly affects a marriage can and has been awarded in divorce court, even if the person rewarded didn't make that money.",
                  "id": 13,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -4,
                  "content": "[deleted]",
                  "id": 14,
                  "comments": [
                    {
                      "score": 1,
                      "content": "First off, I don't think so. \"I’d they’re married, isn’t her and his money “their” money?\" is the attitude and ridiculous assumption that can be lost. By you.\n\nIt is very obvious they have seperate money. When people have one account and one pot of money they don't even know where the money that goes to each thing comes from. It goes in one pot and mixes. The only way to interpret that the way you said is a massive stretch trying to make it fit the way you want it to. OP did explicitly state he pays for x and I pay for y. That is seperate money. Obviously seperate.\n\nShe also has a comment saying he wouldn't be able to buy the cars alone she would have to help. Seperate money confirmed. As if it wasn't already.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 31,
              "content": "I was just following her lead with the  \"i pay this' \"i pay that\" instead of \"we\"",
              "id": 16,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "That sounds good in the abstract-- but how are 16 year old girls supposed to afford car insurance--not to mention the liklihood that the mom or other people living in the household will drive the car without insurance??",
          "id": 17,
          "comments": [
            {
              "score": 25,
              "content": "According to a friend who used to work for attorneys, she saw cases all the time where someone would drive a car, not be the owner, have an accident and if the injuries and damages cost more than insurance limits, the car owner would be sued to recover costs despite not being the at fault driver. OP is smart to not want her or her husband’s name on the title. \n\nI don’t know if a teen could make enough anymore working part time and be able to afford car insurance. I guess it would depend on where they live? Then with only one car and two people, you have to coordinate schedules so likely no dice there.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I mean- I have friends who worked exclusively to pay for insurance but they were able to work in the summers using existing skills to do that. They did stuff like play tennis so were able to work at local tennis camps for enough to cover their portion of insurance for the year.\n\nBut obviously their parents had financially supported them learning to play tennis before that. (And you didn't have the added insurance issue that exists here.)",
              "id": 19,
              "comments": [
                {
                  "score": 32,
                  "content": "By “summer jobs working tennis”, I’m hearing a lot about their socioeconomic status that probably doesn’t apply to the children of an unemployed woman on disability and her two equally unemployed housemates.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 3,
                      "content": "a mix. \n\npart of it was that she lived in a pretty rural area. like public school had 50 kids in the graduating high school rural.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "And how will sharing work? Siblings are not always great with that…",
              "id": 22,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "I mean, it’s NAH between OP and her husband, but the ex is a massive asshole and way out of line with her expectations that OP fund more..",
          "id": 23,
          "comments": [
            {
              "score": 4,
              "content": "my understanding is this is the same christmas amount they've done every year..?",
              "id": 24,
              "comments": [
                {
                  "score": 32,
                  "content": "I'll bet the mom doesn't contribute to the 1000. She just pretends to.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 32,
                      "content": "The post pretty explicitly spelled that out, yeah. Jim funds the entirety of the purchase and the ex puts her name on it",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "That was what the post had indicated.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "She said she doesn’t.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "My comment was in response to “Lately she has been commenting on my lifestyle. She tells Jim that I should help more financially with the girls” in the post. \n\nIt’s not just about the regular $1000 that her husband has been giving his ex for Christmas, it’s about the ex’s generally shitty attitude and expectations of OP. I wouldn’t want to contribute anything either and OP’s husband’s ex is a massive asshole for those comments and expectations.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Nor should see, which is why my comment specifically said \"not giving any of your money\"",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "As minors, they probably can’t get their own insurance and they’d be even more vulnerable to exploitation by the other adults in the house.",
          "id": 31,
          "comments": [
            {
              "score": 23,
              "content": "Yeah, I’d say before buying them the car, sit the girls down and see what house they want to spend most of their time in for the next two years. They’re old enough to have an opinion, and that would help you know if you need to redo the custody agreement. \n\nThe car comes later, after this mess with the mother is sorted.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "They’re 15, how do you intend for them to get their own insurance legally?",
          "id": 33,
          "comments": [
            {
              "score": 2,
              "content": "In my state, I was able to get my own insurance at 16.",
              "id": 34,
              "comments": [
                {
                  "score": 1,
                  "content": "In my state I was barely able to get it at 20 since all the insurance companies dipped out",
                  "id": 35,
                  "comments": [
                    {
                      "score": 1,
                      "content": "its cheaper for my college kid to take ubers than to pay his insurance/car maitenance/gas. How much these kids need to drive around? get them an uber account with $$ on it.",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Separate insurance policy for two 16 year-olds on their own?  good luck with that.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -9,
          "content": "This is the correct answer \n\nNAH but you are drifting into AH territory",
          "id": 38,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 376,
      "content": "NAH. \n\nThis is a tricky situation. \n\nIf your finances and Jim's are separate, and it's Jim's $1K that buys the gifts, then you don't get to say how those gifts are presented. If you're contributing any part of that $1K, then you should get a vote, though. If you want to buy your own gifts for the girls, of course, you can do so. \n\nYou make good points about the car insurance situation. While you can't control how Jim spends his own money (again, assuming finances are separate), the kids being on your (plural) insurance makes the car thing your business too. Jim could try to get mom to pay for the insurance - and probably should do that.",
      "id": 39,
      "comments": [
        {
          "score": 59,
          "content": "I agree. But I also see where OP would want to give the girls separate gifts from dad and stepmom as a family unit. Why not split the usual $1k. Heck - give their mom $200 to buy them each a gift from her. Then OP and their dad can buy their own separate gifts for the girls.\n\nI would also be more inclined to offer cash towards a vehicle and let the girls title and insure it themselves or with their mom.",
          "id": 40,
          "comments": [
            {
              "score": 12,
              "content": "I agree on giving the mom something because he’s done it for years but unless the girls move in with them, I’d hold off on the car until the girls go away to college.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 260,
      "content": "NTA.  Since when do you get disability for asthma?\n\nDo not put the car in your name and insurance.  You know damn well those girls are not going to drive that car, and you will be liable for any accidents.",
      "id": 42,
      "comments": [
        {
          "score": 116,
          "content": "My thoughts exactly, my mother has severe asthma, they've had to resucitate her 3 times in her life, each time she spent months in rehab, and apart from when she was in hospital she worked full time.  \n\nOP is NTA.  Imagine how much her insurance would go up after the others driving the car have accidents.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "You’d be surprised the lengths people will go to get on disability. My SIL is trying for migraines. She lies, exaggerates, and has even refused to drive for the last year to bolster her case (she’s on her last appeal this month, she’s been denied like 4 or 5 times). \n\nI’m on disability for a horrible blood disease where my organs will literally fail in the next 10 years and it pisses me off to no end when people manipulate the system. And yet my SIL thinks we’re “the same”.",
          "id": 44,
          "comments": [
            {
              "score": 30,
              "content": "I mean. I have chronic migraines and I'm disabled. I cannot work full time, and most part-time jobs don't give me the flexibility I need (either in picking hours where I'm not sick, or being able to work from home where I'm not being triggered by lights and smells and whatnot). Am I as sick as some others? No. But I am disabled and unable to work in the standard way work is done in my country. \n\nMigraine is one of the most common disabling ailments in the world. \n\nAnd for the record, I also avoid driving very frequently because aura and vertigo make it dangerous.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "That makes me angry. I have migraines that put me in the hospital, the kinds that literally make me blind with pain, and I still work. I should try for disabilities because some days I can’t move with feeling sick (and I’ve definitely lost jobs over my migraine severity/frequency) but I refuse because I prefer to save those benefits for people who truly can’t work and need it. I have a lot of migraine days (15+/mo) but I can still work. Shame on your friend.",
              "id": 46,
              "comments": [
                {
                  "score": 34,
                  "content": "Honestly shame on you for thinking just because you can manage work with migraines means everyone else can/should. Your suffering isn't noble. It's just suffering, and it's not anyone else's fault that it's happening. I am truly sorry you have severe migraines. It is a shitty fucking disease.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Thank you lol.\n\nAre there people who game the system? Absolutely! But MOST people on disability had to fight for it for years, they would gladly trade the pitiful amount of money to be healthy, and they have intense shame about it. I'm disabled but still trying to work. I worked consistently for over a decade before I was laid-off in August. It's so difficult to find work when you're disabled. And between your very real symptoms and specialists and tests and bloodwork, it can be a challenge to stay employed. Nobody when asked as a kid said \"I wanna be on disability when I grow up\". Nobody means to be here, we're all just trying to survive.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "I think they were referring to the SIL who keeps trying to game the system by faking migraines.",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Those benefits are paid for by us and they are for us. It isn't noble to suffer and hold people to a ridiculous standard. If you are ahving actual migraines more than half the month, maybe you shouldn't have to force yourself to work through it.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "No seriously I have an aunt that has been on disability for YEARS for, I kid you not “sick arms” it’s a running joke in our family but in all seriousness she is a burden on society",
              "id": 51,
              "comments": [
                {
                  "score": 5,
                  "content": "You can have debilitating asthma. I’m not impressed with OP saying the mom “refuses” to work. As a blind person who has been out if the workforce for years I am well acquainted with how hard it can be to get any employer to hire a person on disability. Further you can lose disability with a lot of jobs even ones that don’t pay enough to cover espenses without assistance. \n\nThe mom could be a deadbeat but I wouldn’t be surprised if she wasn’t too.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I knew a girl once, both her parents were on benefits because they claimed they could not read. They could read a drive-thru menu well enough. That girl graduated high school, then also got on the same benefits because she \"couldn't read\". She graduated high school. I know she could read. I think her parents purposefully hindered her education so they could get a bigger check, bc they knew her check alone wouldn't enable her to move out. Such a sad situation all around. I'm all for supporting people, but my god I would think they'd have to enroll in adult education classes or something, but nope! They just stayed at home, doing nothing, and encouraging their children to do the same.\n\nLast I heard, she got a job despite their wishes, got promoted to manager at KFC and moved out. I was so proud of her. Her life is forever altered by her parents, but she's hard-working and trying to make it in the world with little education or opportunities. I was so fucking proud of her.",
              "id": 53,
              "comments": [
                {
                  "score": 5,
                  "content": "You’d be surprised how many patients are setting their kids up to get on disability. It’s ridiculous. And for all the migraines sufferers…go to your neurologist…the new treatments and medications are fantastic.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Yeah that’s the thing that irritates me about my SIL - she is successfully treated with Botox and medication. She only has a bad day every 3 months or so and then she’s back to driving me crazy.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": ">NTA. Since when do you get disability for asthma?\n\nYeah I call BS on that and either the post is fake or OPs husbands EX is lying and i would be asking hubby to discuss with a lawyer about whether or not they can look into that and adjust CS especially if he is paying that more than the court ordered amount already and she is still needing more.\n\nAs for the car, insurance and gifts, OP is NTA, but if OP did put them on the insurance make it so that only named drivers are covered and ONLY NAME THE KIDS, OP and Husband, keep the cars in OPs name and report the car stolen if husbands ex or her partner drive it (although that would depend on the kids informing OP if that happens)",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "She might have COPD. My cousin's MIL developed COPD after a lifetime of asthma and was on oxygen for the last decade of her life. But she was in her 70s by then.",
          "id": 57,
          "comments": [
            {
              "score": 5,
              "content": "I have COPD. I have had to change my job so that I am in less contact with people ( cigarette smoke, perfumes, etc) but have never not worked because of  it.",
              "id": 58,
              "comments": [
                {
                  "score": 3,
                  "content": "Okay. Some people with COPD are worse off than you.",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "It must be really bad, like COPD on oxygen bad.",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Especially now that there are a lot of WFH opportunities, if her issue is not wanting to go ou5 and be exposed to allergens or infections. NTA",
          "id": 61,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I have asthma and am 64 and still work.",
          "id": 62,
          "comments": [
            {
              "score": 12,
              "content": "Maybe hers is a lot worse than yours.",
              "id": 63,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -3,
          "content": "You can get disability if your asthma progresses to COPD....but this happens to a woman   in her late 30s or late 40s from congenital disorders, or bad drug/alcohol/nicotine use. She's grifting.",
          "id": 64,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 83,
      "content": "INFO: would Jim be buying the car and paying for insurance, or would it be you?\n\nAlso, a car is not a right or entitlement. Do they have part time jobs to help pay for gas and repairs?",
      "id": 65,
      "comments": [
        {
          "score": 110,
          "content": "Jim and I would both be buying the car. I would be paying for the insurance. I already pay for our two cars.  \n\nThe girls are really good girls they are straight A students, never in trouble. They do plan on getting part time jobs, if they are able to get a car to get them back and forth.",
          "id": 66,
          "comments": [
            {
              "score": 140,
              "content": "The legal liability that you would have if something bad happened while any of them are driving the car is unlimited.  There is no logical reason for you to purchase or insure the car. Jim needs to separate his finances from his ex wife. Your idea of the $1000 for Christmas from the two of you is the right approach.  Jim isn’t responsible for his wife’s Christmas presents from his ex.",
              "id": 67,
              "comments": [
                {
                  "score": 24,
                  "content": "That’s why they exclude anyone but the daughters drive the car from their policy",
                  "id": 68,
                  "comments": [
                    {
                      "score": 53,
                      "content": "The car would be in OP’s name with an uninsured driver. She would be liable and insurance wouldn’t cover any of it. How would that be better for OP?",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "That doesn’t mean they won’t drive it.",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "You actually think that would prevent others from driving the car. Based on this scenario I don't.",
                      "id": 71,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "and reconsider a car (or cars) for when the girls go off to college. (with an explanation to the girls at that time about who the insurance covers driving their car and who it doesn't. and what will happen if someone who isn't them gets into an accident in their vehicle.)",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Don’t do it! The $1K, if that is from Jim’s money outside of the financial agreement you both have, stay out of that. Put your foot down on the vehicle. You are 100% correct that the other adults will use the car and you and your husband will be on the hook legally.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "This is a tricky one. I agree that the adults in the other house would probably try to use the car. Could you make it crystal clear that if you two got the car, that anyone other than the twins using it would be reported for theft or twoc? I’ve heard of some people protecting their cars with a PIN code, might that be something you could do?",
              "id": 74,
              "comments": [
                {
                  "score": 4,
                  "content": "You can exclude other people living in that home from your insurance policy. I’ve done it.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 48,
                      "content": "That won't physically prevent them from using the car. They would just drive uninsured.",
                      "id": 76,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I’d stay firm about the car situation. Maybe compromise that when they move out from their mom’s house that a car can be purchased so it removes the liability of other people driving the car.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "What also jumped out to me is Jim paying the mortgage. Are you on the deed?",
              "id": 78,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Are you willing to call the cops if their mother or someone else is taking the car for a drive and report the theft? \n\n\nCause if you buy the car that's what's you are going to have to do to stop them  very probably.",
              "id": 79,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "/u/mspooh321",
              "id": 80,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "I think your objections are reasonable and your concern about use of the car is valid, but also if it were me I would probably just suck it up and give the girls whatever they want.  They are stuck in a tough situation and I don’t think you will regret prioritizing their happiness years later.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I feel bad they won’t get a car and miss the opportunity to work. Is it possible to buy a car that is trackable and track it along with their phones? For example, I have a used Mercedes that has a tracking system built in I activated. My husband and I can track it on an app. We also can track eachothers phones. Right now both apps would show my phone and car at my house. It would take some work but in theory you could track them by phone location with “find my” or some other app and track this car to check that at least one of the girls is with the car? I get this is time consuming and not a perfect solution but it’s worth considering.\n\nETA: NTA for feeling this way but it may be best to compromise for the girls. I’m sure they see it and appreciate it. It sucks his ex is a dead beat and a leech. If the genders were reversed that’s what everyone would be calling her. I’d feel bad for someone who was actually disabled, and wouldn’t so much fault him for helping support his kids’ mom, but from your description her “disability” is suspect. With two degrees and the WFH culture I find it hard to believe she can’t manage ANY work at all. The fact she’s shacking up with two other unemployed adults is odd. I suppose I’d begrudgingly suggest that there 3 parents here. He can give the ex $500 to buy gifts, keep $500 to spend himself, and you should spent $500 for gifts from you (or combing yourself and his as together). This way it *is* kind of the same as it’s always been as he’s spending $1k on gifts but just shifting his half to your household. It’s not wrong to dislike this, it isn’t fair. But it sounds like you really care about your stepdaughters, and you may want to try snd be the bigger person with a reasonable compromise.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "This is where i am probably an asshole, but here goes. \n\n\n Sure, a car isn't a right, and no one is entitled to a car, but i gave my kid a car, and i pay 100% of all the costs....gas, insurance,  repairs. Because i can. And my kid is a good kid.  She does great in school, volunteers, extracurriculars, and so on. She doesn't have a job because she needs to focus on school.  Is that privileged. Absolutely. So?  \n\n\n\nIf jim can afford it and wants to do it for his kids, that's Jim's business. It is his money and his kids. If all his obligations are met, and he has the cash. It is his business. He can and should do whatever he wants in regard to how he provides for his kids.",
          "id": 83,
          "comments": [
            {
              "score": 40,
              "content": "I hear you and I think that’s a healthy outlook. I will say that I don’t think Jim can do any of this without OP. Sounds like Jim hit the jackpot.",
              "id": 84,
              "comments": [
                {
                  "score": 2,
                  "content": "It does doesn't it? He needs to do it 100 percent on his own.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Except the Car Insurance will come from OP’s money. And given the attitude of ex-wife towards her..I wouldn’t risk it.",
              "id": 86,
              "comments": [
                {
                  "score": 1,
                  "content": "And that she shouldn't do. He should be the only person responsible for a car.",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "But are there random adults in your home that would be able to bully your kids into letting them use their car? Didn’t think so. Also Jim cannot afford to do this. The post was clear that this would be a joint financial venture between OP and spouse. But even if it was only Jim doing this, if both he and OP are on the deed to the home they share, this can still come back and indirectly screw the OP if there is an accident and subsequent damages or a lawsuit. They can come for their house. So no matter which way it is sliced, no they should not put a vehicle or insurance in their names unless the girls live with dad and his new wife.",
              "id": 88,
              "comments": [
                {
                  "score": 1,
                  "content": "Oh he needs to do it on his own entirely.  Op should not be on the hook for anything.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "OP would be paying for the insurance.",
              "id": 90,
              "comments": [
                {
                  "score": 1,
                  "content": "Yep and it is expensive and it would need to be him on the hook not op.  It can be done without op. But it is pricey.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "An opponent and people wreck that car it’s going to be on her too",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Except she’s helping to buy the car and would also pay the insurance. And there’s no way those girls will have exclusive use of the car.",
              "id": 93,
              "comments": [
                {
                  "score": 1,
                  "content": "She shouldn't. He should do it on his own or he cant do it.",
                  "id": 94,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Privileged would be your lackluster student, not trying to be involved, self absorbed jerk of a kid getting a car with no responsibility for its upkeep. Sounds like your daughter has earned it.",
              "id": 95,
              "comments": [
                {
                  "score": 1,
                  "content": "The only real big issue I see is that you can lose disability if you get a job. And OP says she is on disability. You can work with asthma, you can work while blind (my disability) but employers can be resistant to hire you and you can lose benefits and the job may not cover all those. Like say being booted off Medicaid when you lose disability but your job doesn’t have insurance and doesn’t pay enough to cover it. It’s a balancing act. That being said OP has no obligation to cover these kids if she doesn’t want and should not have to use her own money to do so.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 1,
                      "content": "No she she shouldn't. It should be him entirely.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 72,
      "content": "NTA. The mom is using your husband and by proxy you for money. If she can't afford to live on what she currently is given/earns she should see a lawyer and get child support or something reassessed. There is a difference between ensuring your step children are taken care of and subsidising the mother. Giving her money so she can buy her children Xmas gifts is subsidising her. That might be an unpopular opinion but it is true. I completely understand why you would expect and want yourself and your husband to buy gifts together for the girls. You're expected to help find their lifestyle/ wellbeing, you want to be included. That is completely fair. If she cannot afford presents herself and this is something your husband won't budge on, then the presents should be from the 3 of you. Or she gets given less money from your husband to buy them presents from her, and you two can buy the girls gifts for Xmas day.",
      "id": 98,
      "comments": [
        {
          "score": 31,
          "content": "‘If she can't afford to live on what she currently is given/earns she should see a lawyer and get child support or something reassessed.’\n\n\nOr she can get a damn job, right?! Plenty of people with asthma work. What is she going to do in 3 years when child support stops?! I really don’t understand such mums who refuse to work after a divorce, although sounds like she may have a new partner to depend on.",
          "id": 99,
          "comments": [
            {
              "score": 6,
              "content": "I agree, I just didn't want to get into a \"she can't work she has health issues\" argument with anyone lol",
              "id": 100,
              "comments": [
                {
                  "score": 3,
                  "content": "Haha don’t worry there people on here with bad asthma who are like ‘thats bullshit, I work!’!",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": ">Plenty of people with asthma work.\n\nNot the people whose asthma is so severe they were approved for disability benefits.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Asthma can be very disabling in some cases. \nI struggle to concentrate at work with my asthma, because I feel unwell every day. \nIf I didn’t work, my visa would be scrapped though, so I must suffer.",
              "id": 103,
              "comments": [
                {
                  "score": 1,
                  "content": "Oh I know asthma can be debilitating - Im a doctor so I would know, but yet one can still work like you do because you have no choice sadly. And this woman can too like do an admin job from home or something but she just chooses not to as OP said! Lets see what she’ll do in 2 years when her child support runs out. I had a colleague going to work whilst having daily radiotherapy for prostate cancer that was debilitating & patients with much more debilitating neurological conditions that still work- if theres a will, there’s a way, but this lady just refuses to work 🤷🏽‍♀️! I hope your asthma is ok this winter btw!",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "This ^^^^^^^^\n\nDo not , out of your money, buy/insure a car that goes home to their mother’s house. The girls will not drive it, their mom will. She’s unemployed, I’m assuming at home all day, while the girls are at school. Do you really think their mom is going to let that car sit in the parking lot day. She’s going to be running all over town in her new payment free car. \n\nYou need to draw the line that you are Jim’s family now. If you are pitching in money your name goes on the gifts. If not you buy a small gift just from you to them, to open at your house on Christmas",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 62,
      "content": "Jim has nothing but liabilities. I hope you have a prenup.",
      "id": 106,
      "comments": [
        {
          "score": 16,
          "content": "I hope they have prenup or atleast a separate account that his husband can’t easily touch. Sometime i wonder why people marry into this situation and it baffles me how ex partners demands so much from the step parents (who have money)..",
          "id": 107,
          "comments": [
            {
              "score": 1,
              "content": "I was wondering this myself 😭",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 47,
      "content": "I see a lot of comments calling OP TA for wanting to give the girls gifts with her husband and not wanting the gifts to be from “mom\nAnd dad.” Honestly, I think OP is correct with this. The girls know OP is now married to their father and they would be hurt if there were no gifts from her. They are also old enough to realize the dynamics have changed as a result of the marriage. This isn’t some tradition that should be kept up indefinitely. It’s something OPs husband did out of kindness to his ex, and with love for his daughters. It’s honestly time he also includes his wife in his family, especially considering how she is also financially supporting the girls.",
      "id": 109,
      "comments": [
        {
          "score": 3,
          "content": "Right! They're not 6. This isn't \"I don't want to put from Santa on the gifts, they're from me\". The family has changed, the traditions can change. It's not like this is a tradition passed down through the generations, this was something Jim did so his ex-wife could save face to the kids, and he is more generous than I would have been about it.\n\nThose saying \"it's Jim's 1k, you don't have a dog in this fight if finances are separate\" don't make sense to me. OP pays a vast majority of the money in the household. Jim wouldn't have that 1k to give to baby mama if OP wasn't funding their life in majority. If they split everything 50/50, he wouldn't have that money to give, so yes, OP is paying for it.\n\nIt's like living with your parents and not giving them money for household expenses but then turning around and buying an expensive car. You wouldn't have that money to spend if it wasn't for the grace and kindness of others.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 41,
      "content": "NTA. Let your husband pay your car insurance from now on. Let’s see if he’s still okay with the idea.",
      "id": 111,
      "comments": [
        {
          "score": 3,
          "content": "He can't afford it",
          "id": 112,
          "comments": [
            {
              "score": 11,
              "content": "That’s… the point.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 29,
      "content": "NTA.  The ex-wife needs a swift kick in the posterior to get off her butt and stop being a drain on the OP's husband and on society.  It sounds like she could work, but prefers to milk what she can get.\nEDIT:  I wasn't trying to claim she doesn't have bad asthma.  However, with her education, I would think she is capable of some job that would not be physically strenuous and could be worked from home.\n\nI also see where buying the kids a car is likely to open up a whole can of worms.  The Christmas gift thing is tougher, but I could see room to split the largesse where $500 goes the traditional route and $500 goes the new route.  \n\nIs there a chance your husband could get full custody instead?  What would the kids prefer?\nEDIT:  I understand the kids not wanting to relocate schools so close to graduation.",
      "id": 114,
      "comments": [
        {
          "score": 2,
          "content": "Kinda random, but I love the word largesse bc when I first heard it, I thought it was large ass and didn't get corrected until like a decade later.",
          "id": 115,
          "comments": [
            {
              "score": 2,
              "content": "On that topic, that is also why the name Gladys is humorous.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 19,
      "content": "NTA.  You and Jim are a family now.  You and Jim and his daughters are your own unit when they are with you.  It is possible to keep the car in Jim's name only, have the girls covered on Jim's car insurance and specifically exclude all other drivers in the household the girls stay in while they are with their mother.  There could possibly be technology (biometrics) which would exclude others besides the girls from driving the vehicle.  It is worth exploring.  As far as Christmas, at almost 16 the twins are old enough to see through the 'mom and dad' Xmas gift lie.  Make sure Jim educates his ex that tradition is done.",
      "id": 117,
      "comments": [
        {
          "score": 22,
          "content": "Jim doesn’t even pay his own insurance according to a comment by OP.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}