{
  "post content": "So earlier this week I had a very unsettling human exchange with someone on my flight from Los Angeles to New York and it’s been plaguing me that I still feel so annoyed by it. Looking to calm myself down by someone either confirming these women were rude or telling me I’m the a-hole. \n\nGot a flight from LAX to JFK this past Wednesday. I have a deeply sprained ankle and am wearing a giant aircast. Everyone sees me and my cast hobbling along to aisle to my seat (hard to be subtle with a giant plastic boot) because I was the literal last person to board. \n\nI take my seat next to a nice gentleman. I’m ready to pass out for the flight by reading my book. Right before we take off, a female runs back to the man sitting next to me and says “no one is sitting next to me! They never showed up - come sit with me!” So the man leaves and sits next to who I can only assume is his girlfriend or sister. \n\nI’m thinking I must’ve done something great in my past life to have deserved such luck!! Now I have no one sitting next to me and can elevate my foot during the flight, since I’m prone to blood clots and was worried. \n\nHowever, almost immediately once the gentleman leaves, the woman across the aisle leans over and asks “did that man just leave?!?”, so I nod curtly and begin spreading my leg out, aircast and all and nodding off to sleep. I was hoping she would get the hint that just because there was an open seat next to me, didn’t mean I wanted to share it. \n\nI’m awoken by this woman’s friend standing above me, with the women across the aisle, staring straight at me, saying “my friend is going to sit here.” \n\nI was super disorientated upon waking so I just started adjusting myself and the woman took her new seat without a word. Once she is settled, she points at my boot and asks “did you just have surgery?”  \n\nI’m so irked by her audacity to recognize my cast and my discomfort and also bluntly disregard her contribution to my discomfort. \n\nEdited to include here: once I full woke up, I leaned to the woman across the aisle and told her she was rude for not asking me if her friend could sit there and for disregarding my leg and cast. She simply said “okay” and I didn’t push it any further. \n\nI’ve spent days so taken aback by this exchange. I know I was always going to have to sit next to another person, but I feel as if I had a stroke of good luck that someone stole from me. \n\nAm I being the asshole or am I right for thinking those ladies should have minded their business and let me have my seat to myself?",
  "id": 1,
  "comments": [
    {
      "score": 769,
      "content": "NAH. While it definitely would have been nice for the woman to leave you with the extra seat, it also wasn't yours.  I think the most important thing is for you to let it go.  I know what it is like to let little things bother me in the future. It won't do you any good unfortunately.  Don't sweat the small stuff!",
      "id": 2,
      "comments": [
        {
          "score": 205,
          "content": "It didn't belong to the other lady either. OP was using it first. Since the seat taker already had her original seat, what gave her the right to demand that an open seat belonged to her?",
          "id": 3,
          "comments": [
            {
              "score": 66,
              "content": "Because the woman abandoned her seat to use this one. One seat per person.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "People shouldn't be switching seats willy nilly without permission from the flight crew. In case of a crash they want to identify the bodies based on the seating.",
              "id": 5,
              "comments": [
                {
                  "score": 9,
                  "content": "Is this a real thing, or just a myth? Commercial airlines don't really have accidents, and if they did, there are certainly loads of other ways to identify people than which seat they are in.",
                  "id": 6,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "The flight crew doesn't actually track seat swaps on US airlines.  They generally allow them except to a different class (or tier within a class), or when the weight balance is a significant concern.  On large passenger jets, that's pretty rare.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 1,
                      "content": "International flights are a different matter, of course.  I just flew international over the weekend and because it wasn't a full flight, before boarding the ground crew ended up having to change a handful of people's seats because of weight distribution.  There were too many empty seats on one side of the plane.  But once boarded, the flight attendants repeated several times that due to it being an international flight, people must sit in their assigned seats, unless otherwise told by the flight crew.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 109,
          "content": "I say NTA cause OP was using it first and they decided to wake them up to get them to move. that is extremely rude imo.",
          "id": 9,
          "comments": [
            {
              "score": 4,
              "content": "I hear where you’re coming from.",
              "id": 10,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 248,
      "content": "ESH- yea maybe they should have respected the space. But at the same time you did not pay for the extra seat.",
      "id": 11,
      "comments": [
        {
          "score": 96,
          "content": "With your reasoning that the OP didn’t pay for the seat, neither did the woman that took it.  NTA.",
          "id": 12,
          "comments": [
            {
              "score": 195,
              "content": "Actually, OP was trying to score an extra seat for free. New seatmate was only looking to use one seat, albeit in a different location. He was scamming something for free and they were making an even 1 for 1 swap.",
              "id": 13,
              "comments": [
                {
                  "score": -53,
                  "content": "But it also gives the friend of the woman who moved an open seat next to her.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 14,
                      "content": "What",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 49,
              "content": "Then he should have flagged down a flight attendant and have everyone go back to their original seats instead of a passive aggressive comment.",
              "id": 16,
              "comments": [
                {
                  "score": 10,
                  "content": "In which case OP wouldn't have the free seat either because the man was occupying it.\n\nIf I'm reading this correctly OP was taking up three seats, the end one that was their own, the free one in the center and then the other end one that the man was sitting in.\n\nI think these women were hella rude and inconsiderate to a person with an obvious disability, but since it wasn't OP's seat to begin with it's not much that OP can say about it.",
                  "id": 17,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": "The other woman paid for a seat.  She got a seat.  OP paid for a seat.  S/he got a seat.  S/he did not pay for two seats.\n\nIt would have been a kindness to let OP have the extra seat to elevate their leg. \n\n(ESH)",
              "id": 18,
              "comments": [
                {
                  "score": 17,
                  "content": "You know the word “they” exists, right?",
                  "id": 19,
                  "comments": [
                    {
                      "score": 22,
                      "content": "You know not everybody is a native English speaker, right?",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "It's the same amount of characters, so you didn't have to read any extra, don't worry.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "You know the same thing can be phrased in more than one way, right?",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "Yup, I do.",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "That woman paid for one seat. \nOP paid for one seat. \nThe woman only used one seat.",
              "id": 24,
              "comments": [
                {
                  "score": -3,
                  "content": "The person who switched seats did not pay for the seat she switched too. She should have sat in the seat she paid for and left the OP alone.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I wasn't aware that the seats had different prices.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "The woman that took the seat also gave up one seat. OP gave up none, and was territorial over the adjacent one. In other words, OP tried to control 2.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Hence the ESH.",
              "id": 28,
              "comments": [
                {
                  "score": 1,
                  "content": "I see it as NTA",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -3,
          "content": "[deleted]",
          "id": 30,
          "comments": [
            {
              "score": 10,
              "content": "Everyone sucks here.",
              "id": 31,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -35,
              "content": "Next time as hard as it is to do stand up for yourself and say no!!",
              "id": 32,
              "comments": [
                {
                  "score": 39,
                  "content": "Say no to what though? No one asked OP anything, and they don't have the right to prohibit use of something that they have no claim over. It's unfortunate that the stroke of luck was just temporary. NAH",
                  "id": 33,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -26,
                  "content": "Ugh I know, this is the real reason this is haunting me. 😭 thank u for getting me lol",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 171,
      "content": "YTA. \n\nYou had no claim to that seat, you didn’t pay for it. You were trying to take up 2 seats but only paid for one. Your new seatmate swapped seats but wasn’t using more than what they paid for.\n\nIf you needed additional accommodations for your leg you should have handled that ahead of time with the airline. \n\nSure, I would have also taken advantage of the lucky empty seat but I also wouldn’t pretend to have a leg to stand on (no pun intended) if someone else wanted to sit there. \n\nYou were not due the request you demanded or an apology.",
      "id": 35,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 115,
      "content": "YTA - you have claim over the seat you paid for and that’s it. You have zero say over who sits next to you on a flight. Why would anyone have to ask you your permission to take an empty seat on a flight that is not yours and you did not pay for?",
      "id": 36,
      "comments": [
        {
          "score": -11,
          "content": "[removed]",
          "id": 37,
          "comments": [
            {
              "score": 7,
              "content": "Yeah, okay troll",
              "id": 38,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "I bet you’re fun at parties…",
              "id": 39,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 90,
      "content": "NAH - it’s so nice when it works out and you get the row to yourself so I get why you were disappointed, but as others have said, you didn’t have claim to the seat any more than the other passenger who took it. \n\nI’m a flight attendant based out of LAX and if guests ask me, I couldn’t care less where they sit. I help them move seats all of the time during boarding so next time, find one and they can pull up the seating map and tell you where there are open rows or seats available. Also, sometimes the apps will let you pick your seat for free (depending on who you are flying). Just an FYI for anyone who cares, if there’s a two row exit row, the first row won’t recline and neither will the row in front of it ;)",
      "id": 40,
      "comments": [
        {
          "score": -5,
          "content": "I work for an airline. Passenger pay extra for better seats. I cant give u abetter seat that u didnt want to pay for. When someone else did.  We move the people who are the most crowded mot the most aggressive. And no free exit row",
          "id": 41,
          "comments": [
            {
              "score": 21,
              "content": "At my airline, we’re encouraged to make a difference when we can to make sure passengers have a good experience. Air travel can be challenging enough and by the time people get to the plane after traffic, parking, security lines - they’re often times crabby. If I have the power to make someone’s flight better, why wouldn’t I? If I see a mom or dad flying alone, they get extra attention and I’ll move them to a seat with more room. If it’s economy, cool. If it’s premium, even better. It’s no money out of my pocket so I’m not going to flex my muscles just because I can. My airline is totally fine with comping as long as we can justify it.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 53,
      "content": "I’m gonna get downvoted, but NTA. Everyone is right to say that neither of you paid for / deserved that seat - correct. But when there’s a shared resource open, it goes to either the first person who gets to it or the person who needs it the most. OP is BOTH of those! And waking up an injured person to take an extra seat they laid claim to? That’s some A behavior.",
      "id": 43,
      "comments": [
        {
          "score": 26,
          "content": "Yes, it’s the waking OP up and trying to take the seat after OP claimed it with her leg up — in a cast — that makes the other passenger an asshole.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 50,
      "content": "Gentle YTA. The seat didn't belong to you.\n\nEveryone on the plane bought exactly one seat, and had the right to exactly one seat.  You started with someone in your row. So even if you pulled aside a flight attendant and demanded they step in and force everyone back to their original seats, you still would have had some next to you. It would have been nice\n\nEven if you'd started with the entire row, which you did not, the airline is also at perfect liberty to put someone next to you. People get moved around all the time for various reasons, including allergies, discomfort, mobility issues. As a matter of fact, depending on how full the flight was and how nicely you asked, you might have been able to ask a flight attendant to move you to an empty row. But instead you chose to take it out on some random woman.",
      "id": 45,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 35,
      "content": "YTA\nYou always knew you were going to have to sit next to someone but you are pissed and telling the other passenger off because “I feel as if I had a stroke of good luck that someone stole from me”\nNot how it works",
      "id": 46,
      "comments": [
        {
          "score": -17,
          "content": "[deleted]",
          "id": 47,
          "comments": [
            {
              "score": 28,
              "content": "The empty seat wasn't yours to give or not give away.",
              "id": 48,
              "comments": [
                {
                  "score": -8,
                  "content": "[deleted]",
                  "id": 49,
                  "comments": [
                    {
                      "score": 16,
                      "content": "No one had it and it was free for anyone to take.  She then took it and gave up her old one.\n\nYou couldn't had taken the previously free seat because you were still occupying the one you were sitting in.",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 34,
      "content": "YTA. It wasn't your seat either. You didn't pay for it, and that person had the same right to be excited for the opportunity/move as anyone else on the plane.",
      "id": 51,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 32,
      "content": "Wow this is so hard I’m not sure I have a judgement. I agree with everyone who said you had no RIGHT to the seat. Neither did the woman. I think it comes down to the lack of consideration in the exchange. Was it more important for someone to sit near their friend than to help a person clearly in pain? Obviously not. And unkind. So I think she was inconsiderate and rude enough to be a bit of an asshole. On the other hand, I’m not sure you should have clapped back. I think this leaves me at ESH but very gently. Really, can’t we all be more courteous?\n\nEdit- typo",
      "id": 52,
      "comments": [],
      "relation": "No"
    }
  ]
}