{
  "post content": " My husband and I began looking at getting away from the city a few years ago. We had a small checklist: husband wanted permanent running water, I wanted a house. We looked at many properties before we stumbled across this one by a fluke. It has two permanent creeks and a small house and is absolutely perfect. The property runs adjacent to a national park so it will always remain secluded. We both instantly fell in love and even though it was quite out of our budget, our parents both loved it as well and helped us purchase it. The property itself is almost 100 acres and is the very last house on the dirt road. (Also, I should mention that the seller of the property was an elderly man who only used this place as a weekender and owned his permanent home in the city)\n\nOne of the main things that drew us to this place is the permanent creeks. They are full of swimming holes and one of the best ones even had a rope tied to the tree. Real estate agents said that a few local kids had used it because previous owner was never there and didn’t mind. \n\nThe road turns into an easement to get to the national park entrance and the creek line is the boundary of our property to the national park. The swimming hole in question is about midway between the easement and our house. Over the years, this swimming hole has become well known to the locals and there is a path that has been made to get to this swimming hole that is on our property.  \n\nWe certainly didn’t like the idea of strangers walking so near the house so Husband puts up a wire fence across the path and a no trespassing sign. Within days of putting it up, a woman walks around the fence and to our house to yell at us saying that she has been walking this path and swimming for 30 years. We politely tell her that it is private property and just because the old owners didn’t mind doesn’t mean we do as well. Less than a week after this incident, somebody posts about the fence in our local suburb Facebook group and while many people were angry, many understood as well. We’re not asking people to not swim. We don’t own the water, we’re just asking people to go to the national park side to access the swimming hole (because we DO own right up to the waters edge). However, about another week later, our sign is stolen and the wire fence is cut. We have made it very clear what our reasoning is. We purchased this property for privacy and so far, people are more invasive than if we had purchased in the city. Just today, I was out mowing (we haven’t replaced the sign or fence yet) and 3 girls come walking from this path and walk directly across the front paddock, essentially our front yard. Am I the A-hole for wanting to protect my privacy? \n\nTldr; The access to a really awesome swimming hole, that has been used for generations, is on our property and we don’t want people trespassing to get to it.\n\nEdit: I tried to sketch the layout. Sorry it’s not great \n[bad sketch](https://imgur.com/gallery/x1vaKkL) \n\nDidn’t really want to say this but I am 26F and my husband works away for 2 weeks at a time. And there is no phone reception at all. Safety is a valid concern. We haven’t sought any legal advice and I doubt we will. We’ll try a few more peaceful resolves (signs, clearing a new path on the other side and planting plants on our on path) and if nothing works then that’s it. They win. It’s not a war I’m willing to wage because I do actually want to continue living here.",
  "id": 1,
  "comments": [
    {
      "score": 5123,
      "content": "NTA. Letting people access the water from your property also would proooobably be an liability for y'all, if something bad were to happen. It is on your property, and you are within your right to prevent access.",
      "id": 2,
      "comments": [
        {
          "score": 1176,
          "content": "NTA - Absolutely this. You owe it to yourself to protect your new investment. You could potentially be liable for any injury on your property, even if the person is trespassing. These laws vary locale-to-locale. Consult a lawyer and/or the police. And once you've sought proper legal advice, make sure your homeowner's insurance has ample coverage.\n\nEdit: just to clarify, get advice about insurance coverage from a lawyer. If you go blabbing about how people are always on your property to the insurance company, you're giving them an excuse to raise your rates.",
          "id": 3,
          "comments": [
            {
              "score": 274,
              "content": "am an adjuster. if you intentionally misrepresent how your property is used and then your insurance company finds out because of a claim related to the usage of your property, they may simply void your policy effective the day of its inception. a condition of most policies is that coverage is not granted on a policy that was obtained through material misrepresentation. in this case, you're intentionally preventing them from accurately assessing the risk of insuring you, which is a main driver of rate calculation.\n\ndon't commit fraud.",
              "id": 4,
              "comments": [
                {
                  "score": 183,
                  "content": "This is precisely why the OP should speak to a lawyer before speaking to anyone else. Obviously I wouldn't advocate fraud, and the lawyer would know what the OP is required to disclose. They'd also know what steps required to take about warning trespassers or removing rope swings (as another commenter wisely brought to attention).",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4,
                      "content": "something something easement-because-its-been-like-that-for-30-years. \n\nyeah this is a big fucking deal. OP needs to take your advice very, very seriously. Ignoring it could potentially land OP into a complicated battle for her own land.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "A side question then - how would \"damn kids keep sneaking into my watering hole\" factor into the insurance, seeing as they are on the property uninvited?\n\n[Edit] also, voting NTA, though I do want to vote nah as a former southerner who has enjoyed his share of diving into strange waters.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "So you put up fences, signs, etc but someone ignores it then gets hurt, it doesn’t sound like misrepresentation to me.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Isn't the misrepresentation here hiding the fact that these things happened?",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Fraud schmaud, insurance companies are crooks.",
                  "id": 10,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "What exactly are you referring to? How has the OP intentionally misrepresented how the property is used?",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Agree IAAL",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I was an underwriter and an agent. That isn't how rates are raised. Speaking to an attorney is a good idea, but also speak wth an  insurance agent. Attorneys are not always versed in insurance statutes to the extent of an agent. Agents have to be licensed within their state and keep up with any state mandated ISO changes along with the specific companies they write with.   They will work to find an insurance company who can best fit your situation. True, the rates are going to be higher than your average land because of the inherent risk, but don't commit fraud by hiding hiding those risks from your agent/insurer. They will also advise you in ways to better protect yourself from being held liable and mitigate potential damages.\n\nKeep that fence up and keep putting those signs up. Document that you have done your best to mitigate people coming on to your property until you speak with someone who can assist in determining your level of liability.",
              "id": 13,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 244,
          "content": "Is the rope swing on your property?  Some can get seriously injured on those and you would be sued.  I'd cut it down.  Sorry.",
          "id": 14,
          "comments": [
            {
              "score": 42,
              "content": "Yup. Attractive nuisance.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 221,
          "content": "NTA \n\nMy first thought was how this could be a crosspost to /r/legaladvice asking about liability. Im sure the people who are complaining about access being blocked would be the first ones to throw OP under the bus if they got hurt.",
          "id": 16,
          "comments": [
            {
              "score": 43,
              "content": "Also about whether or not the use over the past 30 years creates some type of easement. OP may have a legal issue either way.",
              "id": 17,
              "comments": [
                {
                  "score": 6,
                  "content": "If I understand easements correctly, they only come into play if there is no other means of access. People can still get to the swimming hole, they just need to come at it from the National Park side, not from OP’s side.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "THIS!!",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "This. Easements are a real thing.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "OP is definitely NTA, but I do have to quibble with your last point. At least in my area, this stuff gets really complicated when it comes to generational access, and a lot of the people who feel entitled to keep using the land as they always have are actually good people who wouldn't sue over an injury. And depending on where they are, that entitlement might be justified. There's actually a big lawsuit going on in my area about a very similar issue, a ranch used to provide informal access to public land and allow camping in certain privately owned pastures for generations, then it was sold to new owners who cut off that access. It's a class-action suit filed against the landowners by a mix of recreational groups and private citizens, and they've got a good enough claim that one of the best real estate attorneys in the state took it and it made it past all the preliminary hearings and is supposed to go to trial in a few months.\n\nI sympathize with both sides, honestly. Though more with the OP in this particular situation since it sounds like it wouldn't be a major inconvenience to cross over from the NPS side.",
              "id": 21,
              "comments": [
                {
                  "score": 4,
                  "content": "Thats when i bulldoze the land and turn it into a concrete paradise.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 4,
                      "content": "If you're referring to the lawsuit I'm talking about, that would cost hundreds of millions of dollars and also likely be illegal due to violating existing easements or potential easements (which is what the lawsuit is based on) as well as interfering with wildlife corridors, wetlands and other protected natural features. Not to mention you'd never get a zoning permit to do it, so it'd be illegal on that front. And this is a state with extremely lax zoning laws, and in the US which has pretty lax laws in general about this kind of thing compared to a lot of European countries at least.\n\nIf you're talking about the OP's situation, I can't speak to the laws since I have no idea where they are but it'd likely face many of the same issues.\n\nPrivate property is still subject to a lot of laws and restrictions in most places, so you have a lot of freedom but you can't just do whatever you want with it. That's just how it is.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "Agreed. Also, invest in a sturdier fence that people can't easily break, like wrought iron. Also install some hidden video surveillance, and aggressively prosecute vandals. It will save you a lot of grief.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2503,
      "content": "[deleted]",
      "id": 25,
      "comments": [
        {
          "score": 375,
          "content": "[deleted]",
          "id": 26,
          "comments": [
            {
              "score": 766,
              "content": "I'm pretty sure OP is also a local now considering the fact that they own the property and seem to live there.",
              "id": 27,
              "comments": [
                {
                  "score": 883,
                  "content": "You've never lived in a small town, have you? The local vs come-from-away discrimination can last for decades. Owning property means nothing to some people.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 348,
                      "content": "I live in a small country town and owning property means everything to these people. If you own the land then you are a neighbor. Very different from actual out of towners who don’t belong. We all look out for people trespassing on each other’s properties and we all look out for suspicious cars and people. I moved in a year and half ago and I have been welcomed into my community and made some lifelong friends.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "I come from a town of 120, and that's bullshit. Maybe a few long-time locals discriminate but nowhere near what you're implying.",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "My grandpa moved to a small town in his retirement and was never considered a local all the way up til the day he died.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Are you from Maine? Everyone says you’re “from away” no matter how many winters we survive.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "I knew a town where a woman who had moved there spent almost a decade building up a community group for kids. When she won a regional award for it, some of the townspeople boycotted the sponsor - because she \"wasn't really from there.\"\n\nNever mind that the award money was for funding the community group, not personal prize money, and the town never would have seen a dime of it otherwise.",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 179,
                  "content": "Ha ha ha ha ha ha “local.” \n\nMy parents are still considered “new people” in the small New England town where I grew up. They moved there in 1977. \n\nThe “regular” town people have had family living there since the 18th century.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 49,
                      "content": "This reminds me of Southern Louisiana-especially the area on the River Road (road along the Mississippi from Baton Rouge south).\n\nMy wife went to Tulane Medical School and one of her classmates had married a coonass from a little town on the River Road.  Before they got married, he had never gone more than 15 miles from his home and the only restaurant he had been to was the po’boy stand at the local gas station.  They got married at one of the plantations further up the river and his family didn’t attend.  It was too far from home and they had never been that far before (it was 50 miles).\n\nIf you moved to the area, you were shunned.  Your grandparents had to have grown up with their grandparents to be someone that they would associate with.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "Yeah, my parents moved to a small Texas town around 1988/89. I was born there. I’m still an outsider.",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 21,
                      "content": "This made me chuckle!\n\nI can’t imagine living in the same place so long. Since the 1700s.. they really need to get out more.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 114,
                  "content": "Have you lived in rural areas? There's not much forgiveness for city people coming in and trashing local tradition. Doesn't matter how many years they've been there, they'll always be considered \"tourists\" to the community without finding a satisfactory solution for everyone.\n\nEdit: Hey, I didn't say I agree with the mindset. It's just how it is. Small-town pride is a thing.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 24,
                      "content": "yea i live in small town rural ontario and everyone knows everyone within a large radius and if youre new youre usually welcomed with open arms here until you do something considered offside, such as break a tradition. it would be expected youre aware of the tradition and if u dont agree with it that you dont move in, we are like one big family and property disputes dont happen unless someone decides that they have full control over open or wooded territory. as long as people are respectful and not damaging its usually welcomed. you arent the asshole its just a difference in mindsets is all",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "you can move it of the country but you can never go back.",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 87,
                  "content": "[deleted]",
                  "id": 41,
                  "comments": [
                    {
                      "score": 20,
                      "content": "That’s not the debate here. The debate is whether they are assholes to keep people from trespassing and destroying their property. \n\nIf you own a property, you have the right to decide who is welcome there, whether you are considered a local or not.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 36,
                  "content": "LMAO\n\nThis is the most yankee shit I've ever heard. You have no idea how it works. They will never be considered locals. Their kids might be, but even that depends.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 50,
                      "content": ">LMAO\n>\n>This is the most yankee shit I've ever heard. You have no idea how it works. They will never be considered locals. Their kids might be, but even that depends.\n\nAnd small town America wonders why it's slowly dying.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Go watch What About Bob, and you’ll get an idea of how locals treat people “from away”",
                  "id": 45,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 31,
              "content": "One woman said she’s been using it for 30 years. It was posted about on a local Facebook group. Seems like (at least some) locals.",
              "id": 46,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "They're not tourists... they bought the property.",
              "id": 47,
              "comments": [
                {
                  "score": 66,
                  "content": "😂 Great, that means they get a locals discount at the shops. People have lived in that area for generations. Recently purchasing a property doesn't make them a local to anyone there. They have no history in the area. No one knows them except as the people who came on and ruined a thing that everyone has used as long as any of them can remember. It may well be within OP's rights to limit and exclude use of their new property, but they certainly aren't doing themselves any favors for ever being treated like a local.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 84,
                      "content": "It's this mentality about being a \"local\" that really shocked me about small towns. They're nice and all when you visit but try and move into the are and change something then the nasty, \"you aren't even from here!\" finger pointing starts.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "[deleted]",
                  "id": 50,
                  "comments": [
                    {
                      "score": 11,
                      "content": ">They are tourists who bought some property.  Your not a fucking local\n\nLast time i checked the definition of \"tourist\", it didn't include \"people that bought property and decised to stay\".",
                      "id": 51,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "Let’s change the scenario. My dad’s receptionist is still the “new girl” to my dad’s patients. She has been there seven years. Most of the patients have seen my dad since he was in dental school which has been 20+ years. It’s their perspective. The locals are there so it holds weight in a discussion. Legally, the property owners have a right to privacy on their property. It’s a major responsibility to allow trespassing. Enforcing privacy is another matter.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "They're still outsiders. They aren't part of the community yet. Small town mentality.",
                  "id": 53,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 11,
              "content": "No they may not help but making sure to have cameras and signs up would probably protect OP if god forbid someone hurt themselves on their property.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "And that is when you file a complaint. They don't get to choose what laws to enforce.",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Take them to small claims court for property destruction and get the sheriff to enforce judgement if the sheriff won't do their job report them to the state AG.",
              "id": 56,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "I'm not sure I'm understanding your comment as you intend it. Please explain further.",
              "id": 57,
              "comments": [
                {
                  "score": 8,
                  "content": "[deleted]",
                  "id": 58,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "I dont know what you define as a local and a tourist but im pretty sure living there makes you a local.",
              "id": 59,
              "comments": [
                {
                  "score": 2,
                  "content": "[deleted]",
                  "id": 60,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yes he is also a resident who has the right to not be sued over some idiot trespassing on his property and getting injured. Just because you are part of some made up group of locals does bot mean you are immune to rules. You can call him what you want but he did make the right call here by stopping people entering on his propert as he is responsible for them.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": ">Local law enforcement might not be willing to help\n\nJust let the local law enforcement know you plan on doing citizens arrests then and I bet that changes real quick.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 43,
          "content": "Local police won't do shit.  They chalk it up as a civil issue and claim that they can't do anything about it.\n\nSource: currently about to sue neighbor for destroying trees and property because she claims she has an easement that allows her to be on my property.  It was an easement that allowed usage of the road to get access to a back road. That back road is gone and the road (with the easement) has since become my driveway.  Because the easement is in HER property contract, there's apparently nothing I can do and police refuse to help even when I have video proof of here damaging my property.  She's probably done around $3000 dollars of damage to the gate, and fencing I've put up, and the trees surrounding the area.  She feels it's her right to walk up my driveway, and does it every evening just to fuck with me.",
          "id": 63,
          "comments": [
            {
              "score": 21,
              "content": "The police may not be willing to help, but that doesn't mean there's nothing you can do. Sue her. She could be liable for the cost to replace mature trees, which could be worth way way more than you are thinking.",
              "id": 64,
              "comments": [
                {
                  "score": 6,
                  "content": "I got a quote from a local lawyer.  They said they wouldn't do it for less than $10k.  I wouldn't even remotely break even.  I don't know.  I just feel defeated.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Chiming in to second the recommendation about getting an arborist quote. I'm not a lawyer, but I love tree law and if you're talking about the destruction of grown trees, damages could be astronomical depending on age, number of trees, what kind they are. There are cases where damages have been in the six figures. It's absolutely worth at least looking into.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Get an estimate of the damage from an arborist, you really don't know for sure. Depending on age and type if trees, some cost tens of thousands to replace, each.",
                      "id": 67,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "\"tree law\" is a popular topic on r/legaladvice, and in most cases the person cutting down trees is responsible for the *replacement* cost of the trees. This can be tens or hundreds of thousands of dollars depending on the maturity of the tree.",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Bro go on legal advice. You say tree law you get a deep analysis.",
              "id": 69,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 942,
      "content": "NTA\n\n>We’re not asking people to not swim. We don’t own the water, we’re just asking people to go to the national park side to access the swimming hole (\n\nPerhaps get a custom made sign that explains this?\n\nATTENTION SWIMMERS\n\nDO NOT ENTER HERE\n\n----PRIVATE PROPERTY----\n\nYOU CAN ACCESS *hole name* BY *path name/description*\n\n*picture of map to legal entrance*\n\nAlternatively, you could try to sell or donate an easement or slice of your property to the park.  Don't overlook donating, since you can claim it on your taxes AND be magnanimous towards the community.",
      "id": 70,
      "comments": [
        {
          "score": 260,
          "content": "This is the best advice on the thread. OP also mentioned that they have considered maintaining the other trail  as it’s over grown. \n\nThis sign would help anyone who may of heard of the watering hole through family or word of mouth.\n\nAlso, I think city dwellers think the country is a place for privacy. I grew up with grandparents who lived in the middle of nowhere farm country. The small town that was nearest to them had more gossip circling through it then The New York Post. My parents who lived “in the city” with neighbors had more privacy. No one was in our business but everyone was in grandparents business.",
          "id": 71,
          "comments": [
            {
              "score": 16,
              "content": "My town literally has a gossip website",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "May’ve.\n\nEdit: salty illiterates.",
              "id": 73,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 57,
          "content": "I also like the idea of talking to these people civilly. For example, the woman who had been walking that trail for forever? I’d explain that I completely understand, and that it must have been great growing up in such a beautiful place. I’d then tell her your reasoning and drop in there that she is welcome to use the trail, but that you would ask her to help spread the word/explain to locals that you are trying to minimize access and build up the national park entrance. \n\nIt sounds like what is happening here is country norms vs city norms. We would never dream of restricting access to a creek/river overnight. Old habits die hard. But you have to talk to us before you saunter in otherwise we might shoot you with a salt pellet for trespassing if you don’t declare your intentions (not really, but valid threat). Give it a couple weeks. Reach out on fb. Go out and join them. Befriend the regulars, and ask them to help you out. \n\nWe help out the ppl that ask us to here. It’s one thing to say “GET OUT OF THIS PLACE YOUVE BEEN COMING FOR DECADES” and another to say “hey y’all, I’m trying to reduce traffic on my property. Should we make another route? Where do y’all think it would work best? Can you help?”",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "As good of an idea as this is, most people don't read. It may help some, but it's not a solution.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Do this but in a much less legal jargon sounding way. Try to make at least a couple friends that may understand. Offer help and explain what you explained here. It sounds like you may be worried about sharing that your husband being gone at times, but that will not be a secret for long. That also may be a bit of saving grace, an ice breaker or help any other singles along your road help keep a lookout; depending on the neighbor and situation.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This should be the top comment",
          "id": 77,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "This.  Instead of \"don't use the watering hole\" make it \"use the watering hole this way.\"   Somewhat less likely to cause years of rage.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 914,
      "content": "NTA:\n\nYou're entitled to protect your own privacy, and I'd also recommend getting the police involved since your property was vandalized.",
      "id": 79,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 744,
      "content": "NTA\n\nI definitely understand why people are upset, its your property and you can block access if you want. Especially since people can still get to the swimming hole another way. Maybe you can post some signs, block off the path, and even help make the other access easier. Perhaps install a path at the edge of the creek to direct people a better way. Not really required, but it may help soothe hurt feelings.",
      "id": 80,
      "comments": [
        {
          "score": 230,
          "content": "Why should they be out more time and money on a new path? It's their private property the other side of the fence isn't their concern. The people who are coming on to their property are trespassing and also destroying and stealing private property. They are breaking the law not OP",
          "id": 81,
          "comments": [
            {
              "score": 305,
              "content": "Its not that they *should*, only that they *could* do something like that to cut down on people's anger and vandalism. I mean, I shouldn't have to put locks on my door, but I do so to prevent people from coming in. Its just an idea to maybe cut down on problems. They might also get the law involved, but that seems like a bigger hassle.",
              "id": 82,
              "comments": [
                {
                  "score": 36,
                  "content": "I'm just failing to wrap my head around the fact that OP and fam have to go out of their way because a bunch of entitled neighbours think they don't have to respect private property. \n\nIt's OP's land. They were nice and told people that the status quo had changed please don't do it anymore and then their property was damaged and stolen. So even if the could why would they want to go out of their way for people who've shown such blatant disregard for law and private property",
                  "id": 83,
                  "comments": [
                    {
                      "score": 134,
                      "content": "Again, I'm not suggesting that they have any obligation here, only that it might be a way to mitigate or prevent further acts of trespass and vandalism.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 105,
                      "content": "Considering how OP moved into a small town, which has many locals, they probobly should provide a different route to the water hole, because the \"your not even from here\" in reality means \"things were better when you were not here\"\n\nSo i would reccomend OP to make that path, so that they get to keep their privacy, while the locals start to appreciate the new people. \"The locals want it to be like it was before, but some out of town people wouldnt let them, however the out of towners made a compromise and made a path around their property, giving the locals a path, and keeping their privacy\"",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 42,
                      "content": "this is a really classic reddit response. life doesnt operate in \"shoulds\" a lot of the time. OP shouldnt have to do anything, but thats not going to get her her desired end goal.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "Op thinking they should not do this won't stop anything so either op has to do these things or just live with it as is. They knew form the real estate agent this was likely to happen (even though they didn’t know the extent of it) as well should have accepted the possibility they aren’t actually able to stop people by merely asking.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "[deleted]",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Its along the lines of 'the best way to get a man to take off his coat is to invite him into a warm room' or whatever the fable is.\n\nNotifying the police may do nothing more than pissing people off. Trying to avoid conflict by providing alternatives is likely a far better solution here.\n\nYes its annoying, but it could be the best solution",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Because some people enjoy being liked.",
                      "id": 90,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 91,
              "content": "There is no *should*. But if they value having a cordial relationship with the community around them, there are things they *could* do",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "The question is \"am I the asshole\" not \"is this legal.\" No one is seriously debating the legality of the action. But yeah, cutting off access to a feature that's been used for so long is kind of an asshole move. Doing something to make it more accessible in a way that doesn't negatively affect OP is a great way to not be an asshole, get along with their neighbors, have their privacy respected, and be generally accepted instead of having pretty much everyone around there call them an asshole.",
              "id": 92,
              "comments": [
                {
                  "score": 29,
                  "content": "But OP isn't cutting off access. People can still get to the swimming hole from the other side.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Which is probably way more inconvenient or else people wouldn't have issues taking that one.   \n\nSo yeah \"I'm not stopping you from doing this one thing, but I'm going to add an extra 20 minutes each way to get there.\"   Oh and you have to go through the national park now and pay to get in.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "That may not be the concern. In some areas it is not legal to block established trails, even when they are on private property.\n\nIf the claim of using the trail by locals for 30 years is true it is *possible* there are local laws protecting its existence.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Right? Of course OP can block access on her property. But does she want the entire town to think of her as the grumpy \"get the damn kids off my lawn\" lady? Because like it or not, that's going to be her reputation.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "Because being social is worth effort?",
              "id": 97,
              "comments": [
                {
                  "score": 16,
                  "content": "Lol, you know you're on Reddit, right?",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "And what if they don't want to be social except to invited family and guests. Should they just roll out the welcome mat for any random that walks by?\n\nYou don't but 100 acres in the country because you want to be all chummy with the locals is all I'm saying",
                  "id": 99,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Ok I mean, it's up to them what they do with the information that they're the asshole in the situation",
                      "id": 100,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "Life doesn't realistically work this way. Yes, the locals are wrong and OP is right - they shouldn't have to do anything, they *could* even get the police involved. Then they will be shunned in the community that they now have to live in, will anger the locals and will probably cause them to react in anger and spite. But helping to install a new path that doesn't cut through their property will probably go a long way to avoiding future issues because it's a reasonable, conciliatory response.",
              "id": 101,
              "comments": [
                {
                  "score": 2,
                  "content": "So they should go and do work on a national park site? As in government property.\n\n Now it might be different over the pond but over here we don't mess with government property. They tend to get a bit testy about it",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Their property insurance would have an absolute fit if they found out about that and would drop them so fast. Their new rates would be astronomical.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "My friends and I used to frequent a swimming hole near our neighborhood, and to get there we'd walk through the woods outside my front yard. The church that \"owns\" those woods didn't take too kindly to that, so we just started walking the extra five minutes to a different trail. No fuss, no fight.",
          "id": 104,
          "comments": [
            {
              "score": 5,
              "content": "If only everyone were so reasonable.",
              "id": 105,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 589,
      "content": "INFO\nIf people have been using the path for generations,it is possible that it has become a legal “right of way”. I know that this is a thing in England and that there are very vocal and active groups that fight to keep these open.",
      "id": 106,
      "comments": [
        {
          "score": 243,
          "content": "This is a thing in the the USA too, it’s known as an Easement by Prescription.",
          "id": 107,
          "comments": [
            {
              "score": 75,
              "content": "Aren’t easements usually only in cases where that is the only reasonable route?",
              "id": 108,
              "comments": [
                {
                  "score": 71,
                  "content": "There are many different types of easements but an Easement by Prescription means specifically:\n\n> Easement by prescription refers to an easement created by the open, notorious, uninterrupted, hostile, and adverse use of another's land for a period set by statute. State law, which varies by state, defines the time period required to acquire a prescriptive easement. For example, easement by prescription can be claimed by a person who travels across a parcel of land owned by another and continuously for five years or more without the owner's permission or consent.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 42,
                      "content": "Two things. \n\nOne, easements are generally specific to a person or a group. You generally can't have an easement for public but not government use of your land. \n\nTwo, the key words are 'without consent'. It sounds like the previous owner allowed the path to the swimming hole to exist, and that by itself usually eliminates an easement.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "And access to a lake for recreational use is a classic law school example.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Out of curiosity, does it count if the owner tries to stop people from using the path in the five years since they don't need permission? Also, does it have to be the same person using it consistently for five years or if it's a stream of people does it count? And I guess 'continuously' is up for interpretation, but if the path was only been used during the summer/warm periods do you think that that would count as consistently too?\n\nNot sure if anyone can answer any of these but cheers if anyone can. 🤗",
                      "id": 112,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "There are different types of easements, but the one being described below to you is not applicable here.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Tradition can absolutely count to legally create an easement. \n\nIt would also be to the property, *not* the owner. \n\nOP might very well not be able to legally impede access.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 108,
          "content": "In California we had some rich person that owned a really nice house that you had to walk by to get to a nice part of a public beach. There was no other way to get there & they tried to say no one could go there cause they have to cross their property. So essentially they had their own private beach within a public beach. They lost as far as I know, & everyone agreed they were rich assholes that didn’t want peasants on “their” beach.",
          "id": 115,
          "comments": [
            {
              "score": 76,
              "content": "Are you talking about [Martin's Beach](https://www.sfchronicle.com/bayarea/article/Supreme-Court-refuses-to-take-up-Martins-Beach-13271592.php)? That was actually a much more interesting case than what you're describing and has to do with a lot more than just access easements.\n\nBasically in California, anything between the mean high tide line and the surf is public property and can be accessed by the public. Furthermore, if there's a beach and the only way to get there from the public right of way is through your private property, you're required to provide an easement across your property to access that beach.\n\nBut in the case of Martin's Beach, the deed to the land, including the beach itself, predates California as a US state. There is a continuous path of private ownership dating back to the Spanish Alta California days. And what the property owner (co-founder of Sun Microsystems, billionaire and Disney villain Vinod Khosla) was arguing was that the State of California had no legal authority to nullify the ownership of the beach from that prior contract. And as a result that he should not have been required to provide an easement, as the beach itself was not public property.\n\nThankfully he lost.",
              "id": 116,
              "comments": [
                {
                  "score": 25,
                  "content": "I'm always torn on issues like these. \n\nIf his ownership predates the state itself I would say he basically owns that section of beach and taking it away is a form of eminent domain. His property rights shouldn't be taken away just because the state fucked up in not ensuring the beach wasn't owned.\n\nOn the other hand he could have just made an easement and called it a day.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 37,
                      "content": "I mean by the logic of his argument, we should have to return all land seized by European settlers to the Native Americans who we stole it from.",
                      "id": 118,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yes it is. I knew the details didn’t really apply to OP’s case, but the basic perception of the public did. Rich asshole lives on land that blocks access to pretty public place & decides to take away public access. Public perceives that as a fuck off my private beach/land you peasants & public is like fuck you rich person. \n\nRegardless of the details, fuck that guy.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "California doesn’t allow private beaches and attempting to prevent access to a public beach violates state law. OP already has an easement for access to the national park that has access to the swimming hole.",
              "id": 120,
              "comments": [
                {
                  "score": 8,
                  "content": "I know it doesn’t apply in OP’s case, but the way people felt in the case I described is probably how the people in OP’s case are thinking.",
                  "id": 121,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 43,
          "content": "This is also a thing in Australia and the United States, as they follow British common law.",
          "id": 122,
          "comments": [
            {
              "score": 63,
              "content": "No, Americans do not follow British common law, thank thor. Ours are based on it, but have veered pretty heavily",
              "id": 123,
              "comments": [
                {
                  "score": 53,
                  "content": "Property laws in the United States, especially adverse possession, are heavily, heavily derived from British common law.",
                  "id": 124,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "I don't think you're necessarily disagreeing with each other, just saying different things.\n\nWhen the US founded our legal system, we carried British common law of the time into our system with us. And that foundation is still what we follow today. So in that sense, the US follows British common law.\n\nBut it's also true that court cases which might result in adjustments to precedent in the UK for their justice system do not hold precedent in the US as a result. So the US and Britain have their own respective systems of common law. So in that sense, the US does not follow British common law.\n\nJust so happens that the precedent around easements in the US does derive originally from British common law.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 42,
              "content": "Property laws vary wildly by state in the US.",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "You act like Australia exists.",
              "id": 127,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "Also need to know where it is. My state doesn’t allow prohibiting access to any water source big enough for recreational use.",
          "id": 128,
          "comments": [
            {
              "score": 6,
              "content": "Would that be the case here though? Unless I’m reading incorrectly it sounds like there’s access to the swimming hole that doesn’t require people to walk through OP’s property.",
              "id": 129,
              "comments": [
                {
                  "score": 3,
                  "content": "I think you’re right and I read it incorrectly. I kind of assumed people were walking down a streambed to get to it.\n\nAt least where I live putting a fence to cut off a river access is illegal.",
                  "id": 130,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "May I ask, what state is that?",
              "id": 131,
              "comments": [
                {
                  "score": 3,
                  "content": "Montana. You aren’t allowed go fence off or block off waterways at all. As long as they walk below the high water mark they can walk through private property.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I sort of love this.  No battles, and I'm guessing it's just accepted?  If you live there; it's just life.",
                      "id": 133,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "My state is like this too. We have a crap ton of creeks though. I can think of 4 within 30 minutes of me. Creek access is a huge fight around here. Some people bought land right on the river by a river access and get all bent out of shape about it's use. They can't stop it though and I understand a bit. People really should be respectful and clean up after themselves in public areas, they also don't own the creek and going down to public access swimming areas is a huge summer event. People grill, swim all day, it'll be so packed you can't park.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Yeah, there is a good chance OP does not legally own that right of way  if it has been used as public access for 30 years.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "thank god this reply was here. i was going insane with everyone else.\n\n&#x200B;\n\nmy grandparents fought a fight from the other wide and won. that said OP isn't entirely without a case here because what i gather is the biggest deal is if someone is doing potentialy dangerous stuff they could be held liable for. that shit shouldn't be ignored and they should defiently fight to not have that kind of responsibility.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 309,
      "content": "YTA. When it comes to city-life, it's perfectly reasonable to hunker down in your own flat or suburban house and protect your own interests to the fullest, if that's the kind of relationship to the wider community you're okay with. Rural life however has always been coming with a greater reliance on your neighbourhood, historically out of necessity and today often as a way of life. It's a give and take for the common good of the community, where the balancing towards everyones private interests of privacy and property has been settled through established practices and customs over the years. A well established path more than a football field away from your house is not an unreasonable expectation from the others in the given circumstances. Yet if you really feel it's a big no-no, consider reaching out to the your neighbours about organising the clearing of a good alternative path to the swimming hole. (if they don't wanna chip in, well, then their original claim is obviously less legitimate.)  \n\n\nMoving in as an outsider does come with a social and moral obligation to show some considerations for all of this, in a humble fashion. You should, obviously, over the time have a good say in what you're comfortable with in regards to your own property and your land but you can't disregard what others have built togheter in terms of community and established practices without being an asshole. It's not that different from how gentrification breaks up former urban-based communities. Although one might be perfectly fine within their legal rights to sweep in and change up everyones living condition in an area, consider their way of life might be one of the direct or indirect reasons to why the place was attractive to move into to begin with. If you can't comply with reasonable and established community expectations, don't buy up land which will significantly affect their settled way of living.",
      "id": 137,
      "comments": [
        {
          "score": 132,
          "content": "I LOVE your response. I think a lot of people don't understand that the culture/laws/established rules they are use to are completely different from rural to city. I read another post yesterday about whether or not it's ok to have an outside dog. It's funny how clear it was where people were from based off of their responses.",
          "id": 138,
          "comments": [
            {
              "score": 36,
              "content": "Ive lived in both worlds. I still dont like the idea of leaving my dogs out 24\\7. Especially in rural reas where there is predators and bear traps hiding about. Farm dogs are always all fucked up, missing eyes and shit from the time they got ran over by the plow.",
              "id": 139,
              "comments": [
                {
                  "score": 3,
                  "content": "Better than them not having anywhere to go. Some dogs are just outside dogs, man. Of course, you provide reasonable shelter from elements and inclement weather.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Lol I’m gonna be honest \n\nI have 5 dogs outside that are farm dogs. People drop them off and I took them in. They’re all 10+ years old and they can all move around really well. One of them is 16 years old and can still run like a bat out of hell. I feed them a 50lb bag of ol Roy a week. Never taken them to the vet. They’re healthy happy and okay. Yes sometimes they get into fights with wild animals, but they’re dogs and it’s their territory + there’s 5 of them. They keep my farm animals safe too. \n\nI bring them in when it’s really cold, but most of the time they sleep outside in dog houses with covers and things to keep them warm. Why? Because all day they run around outside getting dirty rolling in poop/dead animals and I don’t feel like giving them a bath every time they want in.  \n\n\nPeople in the city think it’s okay to have these obese little chonkers running around, if we want to talk about animal abuse lmao",
                      "id": 141,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "[deleted]",
              "id": 142,
              "comments": [
                {
                  "score": 14,
                  "content": "Didnt op say that there was a different way to go to the swimming hole?",
                  "id": 143,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Ive lived both city and rural. And ive actually even had a pathway to a local small pond also be taken out because new owners.\n\nGive it a month or two and no one cares, especially since there are other paths.\n\nThere is a legitimate liability concern with owning property where people can do swimming from or could twist/break ankles, etc because they are liable then.\n\nAlso, OP mentioned that her husband is gone for two weeks at a time, for her own safety she can cut off her property from people she doesnt know because that can actually be scary.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I lived in a big rural town and we had / have a situation (actually I'm wondering if it's the same place but I won't question it) like this. The owner used to let people cross his property to access the water hole. Did this for decades, I ever going there for swims as a kid. Until someone got hurt (many people got hurt in the past) and decided to sue him for not blocking access across his property (no one in the past tried to blame him for their idiocy). I'm pretty sure they weren't successful but he didn't want to take any future risks so fenced it all off and no one can access it now as you're looking at a full days hike to go the public way and not many are willing to do that. All it takes is one asshole and a lawyer to ruin your entire life even though you're just trying to be a nice guy and let people walk through your property to go for a swim.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "My uncle owns a hundred acres next to a state park. People ride horses and jump the fences to get on his property, they leave trash and horse poop everywhere and one time broke into his hunting lodge. Then there is the problem that he hunts and the horses scare the game and he doesn't want to worry about shooting people. \n\nI also think small town cultures are different depending on where you live. I knew OP wasn't from Kentucky was no one was threatened with a shotgun for trespassing. But OP should want to get along with the locals, even if they are trespassing and vandalizing her property",
          "id": 146,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "OP owns this property. She has no moral obligation to the people living nearby that do not contribute to her mortgage.\n\nIt's not as though these people can't get to the swimming hole now. They just have to use the public pathway.\n\nIt doesn't matter in the slightest that OP moved to this community from the city. She bought the land, and is free to mind her own business on it and expect that others don't literally use her private property without permission.\n\nThe possibility that these other people happened to grow up there/have lived there longer than OP does not mean that OP has to accommodate them. She is as entitled to her property as everyone else there.\n\nEveryone's lifestyles are different. No one is morally obligated to prioritize community. It's clear from the original post that she values privacy, and there is nothing immoral about valuing privacy over community.",
          "id": 147,
          "comments": [
            {
              "score": 99,
              "content": "Is this sub “Am I in the legal right?” or “Am I the asshole”? \n\nTo everyone in the community where OP lives, they are the asshole. That’s not an opinion, it’s clear from OP’s story that it’s a fact. I’m super disheartened at how everyone here, and specifically you, are being so cold and callous.",
              "id": 148,
              "comments": [
                {
                  "score": 38,
                  "content": "I don't think that OP is morally right just because what she's doing is literally legal. I just think it's bananas to suggest that because she doesn't want to accomodate people that happen to live nearby that she doesn't even know, she's an asshole.\n\nShe deserves to live the life she wants if she paid for that life. If privacy is important to her, and she bought property that grants her privacy, why would she have to sacrifice that because other people want to use what isn't theirs?\n\nIt would be one thing if there was no other path to the swimming hole, but there is. Why is she morally obligated to let others on her property for their convenience, when they could easily use public property to achieve the same thing?",
                  "id": 149,
                  "comments": [
                    {
                      "score": 32,
                      "content": "imo she's the (soft) asshole because she is a new person within a rural community, and the first thing she does is drive a wedge between herself and the community, by disrupting a tradition that was established before her. I think she is also being unreasonable because she even said she has 500 feet between where her house is and the path to the watering hole. \n\nSure she's not obligated to accommodate people trying to use her property, but it's the neighborly thing to do. She's kinda an asshole for being selfish and unaccommodating and using \"I'm not legally required to be nice\" as an excuse.",
                      "id": 150,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "And OP can continue being hated and being called an asshole for it.\n\n&#x200B;\n\nThis is why people in the country rag on city folk. They don't know the culture of rural life and think every person is out to get them. News spreads fast in smaller communities because everyone knows each other. If this happened in my town I'd just think of OP as a dumb city girl that thinks fences and signs are gonna stop our way of life.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Just because to someone else you're an asshole doesn't mean you're an asshole. In every single post on this subreddit everyone would be an asshole then because to the person or people mentioned in the posts they're the asshole. In a general sense tho they're usually not the asshole. Here they are definitely not the asshole. It's their property and they don't need to let anyone use it. Everyone has a public path available to use and letting people use their property can become trouble for them as well. One being people might drop trash or something like that, but more importantly if someone happens to get injured, OP could be sued. Totally NTA.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "“To everyone in the community where OP lives, they are the asshole.”\n\nActually, if you read her post again, the responses were pretty evenly split when someone posted about OP’s fence in a local Facebook group.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Just clarifying that OP claimed *many* were mad but *a few* understood. No where does it say 50/50, or imply anything close.",
                      "id": 154,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Until someone sues you for getting injured on your property.",
          "id": 155,
          "comments": [
            {
              "score": 5,
              "content": "OP isn't in America.",
              "id": 156,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "BS.  I grew up in a very rural area of Kentucky.  The kind of place where the nearest Hospital, McDonald's or Walmart is an hour away.\n\nPeople get shot for trespassing and and the sheriff shows up 2-3 hours later to do the paperwork and take the body.\n\nSure, there is a sense of community and helping one another.  But that doesn't mean your free to use everyone's land as you see fit.",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Eh, I disagree. I think it depends on the culture. I live in rural Texas and we’re taught from an early age not to trespass, climb fences or open gates. It’s understood that folks are armed, it’s understood that there could be a shooting range or dangerous livestock or that an expensive horse or bull could get loose.  We take property boundaries seriously here, small town or not. I think this generalization of “country thinking” isn’t right across the board. To me “country thinking” is that I get to limit and use my property as I see fit and don’t owe anyone access.",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "As someone growing up in the rural mountains of California, I could not disagree more. You go deeper into woods, buy more land, especially on the edge of a national park to have as much distance from your neighbors as possible. Privacy is important and we're not obligated to become a familial community just because this house in your area happened to be on the market when I was looking. Yuck the idea of my neighbors expecting anything from me other than respect for communal spaces is so off-putting and burdensome.",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 2,
          "content": "I really want to agree with you, especially because of the parallel you drew to urban communities being broken up by gentrification. That said, I'm leery of your argument that a rural way of life should be protected. Part of my objection is due to the prevalence among rural folks of the attitude that it's okay to shoot people who wander onto your property. I can't count how many times I've heard people from rural communities harp on and on about how they have the absolute right to keep trespassers off of their land by threat of lethal force. I can't help but think that OP's situation may represent those same rural folks getting a taste of their own medicine.",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 247,
      "content": "NTA tough shit for random strangers who think that they should be able to tresspass because the people who owned it, and don't own it anymore, were ok with them on the property.\n\nconsider this: someone gets injured or drowns in one of these swimming areas. that's a homeowners claim or lawsuit. sure, you didn't hurt anyone, but depending on the case law in your state, you may lose that suit or your HO insurance may pay the claim.\n\nyes, i have personally seen, first hand, those suits and claims happen. i have seen them be paid.",
      "id": 161,
      "comments": [
        {
          "score": 85,
          "content": "The swimming hole isn't on OP's property.  There's no way they would be found liable for something that happened in a national park.",
          "id": 162,
          "comments": [
            {
              "score": 13,
              "content": "ah, i misread that",
              "id": 163,
              "comments": [
                {
                  "score": 29,
                  "content": "Consider the scenario where someone walking back from the swimming hole slips, falls and hits their head on a rock on OP's property because they are wet from swimming. They could go after OP for something like that.",
                  "id": 164,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Consider that this attitude is rightly mocked around the entire world as being uniquely American and wrongheaded.",
                      "id": 165,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "You did not misread, these people misunderstood. She said she doesn't own the waterhole itself. She did say she owns the property on one side leading up to the water's edge.\n\nThis family can still be found liable if someone were diving off their side of the property and got hurt. Since it's a water hole that's incredibly likely. People can slip when diving near rocks, people can land in shallow areas, etc.\n\nFrom a liability standpoint alone I'd deny access as you said. Even if you won the lawsuit you'd be drained defending yourself in it, been there, done that, wouldn't recommend.\n\nEdit: In response to someone else OP states she's in Australia. She needs to consult a local lawyer on any potential risk and liability.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "The access point is on their property.    Considering the stupidity of attractive nuisance liability in the first place, that may be enough. IANAL though",
              "id": 167,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "According to the OP their property goes up to the waterline on that side of the water, so they very well may still be liable.  There's also the entire trip to and from it through their property, for which they are definitely liable.  They need to put a stop to this 100%",
              "id": 168,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "No, but if the person suffered a debilitating accident jumping/falling from the swing on OP's property into the water... liability is less clear.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "It sounds like OP doesn't own the watering hole, but the walkway to it crosses OP's land and they're uncomfortable with random people walking so close to their house, which is fair, especially given that OP also states there is another path to the hole via the adjacent park.",
          "id": 170,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 205,
      "content": "I kinda wanna say YTA, but a small one. I mean, you have 100 acres of land but you can't let these people use a swimming hole that's spanned generations?",
      "id": 171,
      "comments": [
        {
          "score": 120,
          "content": "The path is about 500 ft (a football field and a half) from the house.  Op is definitely being more TA than not.",
          "id": 172,
          "comments": [
            {
              "score": 77,
              "content": "I didn't see where OP said the path is 500ft from the house! Give me a break. People can't walk 500ft from your house without you causing an issue? He's most definitely TA.",
              "id": 173,
              "comments": [
                {
                  "score": 14,
                  "content": "I wonder if OP has considered putting up a fence on the edge of the path. Putting a barrier between the path and their house. That seems like a perfect solution to me. Then, they could put some sort of gate with a lock on that fence in case they need access that side of the property. Just an idea of course.",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "[removed]",
              "id": 175,
              "comments": [
                {
                  "score": 2,
                  "content": "In another comment farther down.  Check OP's post history.",
                  "id": 176,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 68,
          "content": "1. Why does it make OP an asshole not to let people walk on his property?\n2. *They can still get to the swimming hole and use it*. They just have to walk a different way that doesn't go across OP's property.",
          "id": 177,
          "comments": [
            {
              "score": 35,
              "content": "He knew people did that when he bought property. He doesn't say their making a mess or anything either. He's being a party pooper for his \"privacy\" which I don't understand how its being violated. \n\nHe says he bought the place for privacy, but if thats the case it's weird that people coming by all the time didnt seem like an issue when purchasing.  \n\nI think hes being weird about it unnecessarily",
              "id": 178,
              "comments": [
                {
                  "score": 5,
                  "content": "It doesn't matter if they're not making a mess. It is now OP's property, and she and her husband are well within their rights to want it to remain private.\n\n&#x200B;\n\nNot to mention, liability is *always* something to think about when allowing others to access your property. If someone gets hurt on that trail, OP and her husband can be held liable.",
                  "id": 179,
                  "comments": [
                    {
                      "score": 4,
                      "content": "We aren't r/legaladvice. You can be within your legal rights and still be a bit of a jerk. Also, liability isn't really the issue here and they live in Australia. If their neighbors get hurt walking on a path, I don't think they're suited for the country.\n\nSocially, they're in trouble for how they handled it. But, yes, legally speaking, they are totally in the clear.",
                      "id": 180,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Not to mention the whole \"privacy\" thing makes no sense. The swimming hole is *500ft from their house.* That's the length of one and a half football fields.",
                  "id": 181,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "Where in the post did OP say that they don't want people using the swimming hole?",
          "id": 182,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "He's still letting them use the swimming hole. He just doesn't want them crossing his property especially given that there is another path. And also his property has been vandalized and destroyed.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 133,
      "content": "I'm going to go with an unpopular (soft) YTA... and the reason is, these people may have a legal right to use that path.\n\n[prescriptive easement, which is similar to, but distinct from, adverse possession] Adverse possession is basically where someone has been using property that doesn't belong to them openly and continuously for a period of years, and after that period, they obtain certain property rights, because they've been using the property that doesn't belong to them for so long, and no one told them to stop.\n\nI say may, because although a quick google search shows that Australia does recognize some adverse possession law ( [https://www.theguardian.com/australia-news/2016/jun/09/home-free-when-adverse-possession-can-mean-good-news-for-squatters](https://www.theguardian.com/australia-news/2016/jun/09/home-free-when-adverse-possession-can-mean-good-news-for-squatters) ) I'm not going to do the research to see if it applies in this particular case.\n\nI can say that where I live, in the US, there was a similar case just recently (a walking path that went around a lake and through everyone's backyards) where people who had been walking around the lake for decades were found to have a legal right to their walking paths. \n\nIANYL, but it may be a good idea to come up with a compromise path that you are comfortable with people using.",
      "id": 184,
      "comments": [
        {
          "score": 29,
          "content": "It’s not Adverse Possession, what you are describing is Easement by Prescription.",
          "id": 185,
          "comments": [
            {
              "score": 2,
              "content": "[deleted]",
              "id": 186,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}