{
  "post content": "Long story short, Signed up for an investment program through a friend, unfortunately due to paycheck, having to cancel after a few months.  The guy, instead of giving me back my money states that I should just try and sign a few people up instead which would net me a small amount per month, something my friend conveniently forgot to mention.  Upon realizing this, I cancelled my investment and now demanding a refund as I feel used by my friend for money. AITA for basically putting an end to friend's secret gravy train? Thank you.  \n\n\nEDIT: I was buying stocks and trades, I'm not mad at the program itself, I am mad that my friend recommended me without mentioning that she would've financially benefited as well, Hence why I feel used by my friend, It's not a one time behavior with said friend.  \n\n\n&#x200B;\n\nJudgment                                                                 Abbreviation**You're the Asshole** (& the other party is not)    **YTA**\n\nYou're **Not the A-hole** (& the other party is)       **NTA**\n\n**Everyone Sucks Here                                             ESHNo A-holes here                                                      NAH**\n\n**Not Enough Info                                                     INFO**",
  "id": 1,
  "comments": [
    {
      "score": 7,
      "content": "ESH - You for falling for an obvious pyramid scheme. Him for roping you into it.",
      "id": 2,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "NTA sounds like a pyramid scheme",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. Why does this sound like a MLM scheme instead of an investment? There is no legit form of investment I know of that’s predicated on getting others to invest as well.",
      "id": 4,
      "comments": [
        {
          "score": 0,
          "content": "it was with a broker to buy stock.... Now that I've found out that you can get a stipend for signing people up... I'm pissed the hell off.... Just be upfront with me dammit... So it's no worries... now It's payback.",
          "id": 5,
          "comments": [
            {
              "score": 1,
              "content": "I’ve seen a *small* one time referral bonus ($25-50) for signing up a friend for some online investment services, like Betterment for example, but not an ongoing “stipend”. So it still sounds shady as hell to me.",
              "id": 6,
              "comments": [
                {
                  "score": 1,
                  "content": "Yea, and that's why I'm very suspicious and pissed the hell off...  No worries I will be stopping this and  basically telling the friend to fuck off... done with her shit at this point.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "YTA.\n\nYour friend didn't make you pay or sign up for anything. That was all you. And considering it's an \"investment\", you shouldn't have given anything you weren't okay with losing.",
      "id": 8,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited.***\n\nLong story short, Signed up for an investment program through a friend, unfortunately due to paycheck, having to cancel after a few months.  The guy, instead of giving me back my money states that I should just try and sign a few people up instead which would net me a small amount per month, something my friend conveniently forgot to mention.  Upon realizing this, I cancelled my investment and now demanding a refund as I feel used by my friend for money. AITA for basically putting an end to friend's secret gravy train? Thank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "ESH- you suck for being roped into what sounds like a MLM scheme, and your friend sucks for not mentioning the fine print to you in the first place.",
      "id": 11,
      "comments": [
        {
          "score": 0,
          "content": "I read it over and checked it out, it was for buying legitimate stocks, however I would've appreciated some heads up from said friend.... No worries, This won't go unpunished......",
          "id": 12,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA However you are an idiot for getting roped into a pyramid scheme and tbh idk if your friend is obligated to pay you back",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "I'm not trying to get paid back.. it was for buying stock..",
          "id": 14,
          "comments": [
            {
              "score": 1,
              "content": "Ok so he is obligated to give you money back your still NTA and an idiot",
              "id": 15,
              "comments": [
                {
                  "score": 1,
                  "content": "Fair enough, Was trying to invest in stocks, It's an investment company, would've appreciated friend at least telling me she was getting money for it. She made it seem like she was trying to help me out with investments... but nope. .. sigh..",
                  "id": 16,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Classic hun",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "[deleted]",
      "id": 18,
      "comments": [
        {
          "score": 1,
          "content": " It was for buying stocks .. I don't need to ask her what her intentions were... I've known her long enough to know that this was so that she could get extra money every month without telling me. If I didn't quit it, she would've been making money off of me for month or even years.",
          "id": 19,
          "comments": [
            {
              "score": 1,
              "content": "[deleted]",
              "id": 20,
              "comments": [
                {
                  "score": 1,
                  "content": " I don't think she signed me up to help me in any way, she signed me up so she could get money in return. While she is not obligated to tell me that she receives a  bonus, It just makes it clear that it was not a genuine referral.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 1,
                      "content": "[deleted]",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "She didn't forget, she knew exactly whys he recommended me.... why else would she have handed my phone number to the investor and give me a brief introduction instead.  I know her well enough to know it wasn't an oopsie moment of forgetting. I've invested for a few months and still she said nothing...  but certainly collected those checks though.",
          "id": 23,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA: this is clearly a pyramid scheme. You're a dumbass at worst for falling for it, but he's the asshole for taking advantage of your naivete.",
      "id": 24,
      "comments": [],
      "relation": "Attack"
    }
  ]
}