{
  "post content": "Long story short, I have a house on 3 acres that backs up to 4 individual back yards. Two of the four do not mow and the fence separating the 4 and me is chewed up from them letting things grow into it. They let it go for years and no one seems to care. The neighbor on the end is on the right of one that doesn't mow and they have crap growing through the fence just wrecking it.\n\nI was mowing one day and went to avoid a turtle and my finish mower clipped the fence. I didn't realize it even hurt it. Today I go outside to mow and I notice my finish mower missing two spacers that hold one spindle on. I know they were there when I left it. I look up and the back neighbor on the north end had a chair and was sitting in his year facing me like he was waiting on a show. He had some teenager with him and eyes were glued over to my side and I am thinking what are they up to. \n\nI look over part of the yard for my spacers and no where to be seen and it's 3 acres so better to order new ones. Next think I know there is a big reflective sign on the back fence that says, \"Please be more careful\" And I just think it is the most passive aggressive petty thing in the world. I look over the fence and it is in the same shape it's always been. There is a chain link piece that had already been broken that was bent out a little, but I could bend it right back no issue. If he had waved me over or came over I'd have offered to just go fix it no issue.\n\nAm I an asshole to think he is being passive aggressive and petty? I just wrote a note back (because I thought it was a little funny / ridiculous that grown man was communicating this way and I was kind of making fun of him in my own way plus I wanted to do the whole kill him with kindness.) that read, \"My fault. Thanks for keeping your fence row clear. Appreciate it. Tom\" I've never met him but I always end anything I write in my life to own it. So anyone knows I wrote it. His fence row is the cleanest besides mine but that's because I cleaned it up and sprayed it then he just kept it mowed from then on out. That why I was more annoyed than I should have been. Because I'm the one neighbor he has doing what they are supposed to and he is on me. My initial instinct was to just ignore it completely, but I am the newest here and everyone is all buddy buddy and I don't want to be that one guy everyone hates because one guy doesn't like me and spreads the hate. Plus I didn't want to have a conversation with a 60 year old man who sits in his yard waiting to get satisfaction from their neighbors reaction to a big reflective sign put up to attract everyone's attention.\n\nThanks, again. Am I an ass hole to think he is petty and childish?",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited.***\n\nLong story short, I have a house on 3 acres that backs up to 4 individual back yards. Two of the four do not mow and the fence separating the 4 and me is chewed up from them letting things grow into it. They let it go for years and no one seems to care. The neighbor on the end is on the right of one that doesn't mow and they have crap growing through the fence just wrecking it.\n\nI was mowing one day and went to avoid a turtle and my finish mower clipped the fence. I didn't realize it even hurt it. Today I go outside to mow and I notice my finish mower missing two spacers that hold one spindle on. I know they were there when I left it. I look up and the back neighbor on the north end had a chair and was sitting in his year facing me like he was waiting on a show. He had some teenager with him and eyes were glued over to my side and I am thinking what are they up to. \n\nI look over part of the yard for my spacers and no where to be seen and it's 3 acres so better to order new ones. Next think I know there is a big reflective sign on the back fence that says, \"Please be more careful\" And I just think it is the most passive aggressive petty thing in the world. I look over the fence and it is in the same shape it's always been. There is a chain link piece that was broken that was bent out a little, but I could bend it right back no issue. If he had waved me over or came over I'd have offered to just go fix it no issue.\n\nAm I an asshole to think he is being passive aggressive and petty? I just wrote a note back (because I thought it was a little funny / ridiculous that grown man was communicating this way and I was kind of making fun of him in my own way.) that read, \"My fault. Thanks for keeping your fence row clear. Appreciate it. Tom\" His fence row is the cleanest besides mine but that's because I cleaned it up and sprayed it then he just kept it mowed from then on out. That why I was more annoyed than I should have been. Because I'm the one neighbor he has doing what they are supposed to and he is on me. My initial instinct was to just ignore it completely, but I am the newest here and everyone is all buddy buddy and I don't want to be that one guy everyone hates because one guy doesn't like me and spreads the hate. Plus I didn't want to have a conversation with a 60 year old man who sits in his yard waiting to get satisfaction from their neighbors reaction to a big reflective sign put up to attract everyone's attention.\n\nThanks, again. Am I an ass hole to think he is petty and childish?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 0,
      "content": "NAH. Neighbor could have been too introverted to confront you, or didn't want to come off as rude, the sign was a bit much but nothing harmful. Nothing wrong with wanting nice surroundings. Your response was in good fun and seems like a good way to say \"I know, I don't need to be reminded.\"",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": -1,
      "content": "ESH - Although it’s a bit extreme for this situation, as it’s such a small thing. Here’s my point of view though; yeah, your neighbour could have handled things differently, but you also didn’t go to him when ‘the incident’ occured.",
      "id": 5,
      "comments": [],
      "relation": "No"
    }
  ]
}