{
  "post content": "My ex husband and I share custody of our 10 year old daughter and 12 year old son. We have a 2-2-3 schedule which usually looks like I have the kids Friday after school and then he gets them Monday after school. I get them back Wednesday after school and then he gets them Friday after school and then the week flip flops. We've done this since our divorce 5 years ago and it works well. I'm a nurse in the OR so I schedule my shifts for the days during the week when they are with their dad and my one call weekend every 6 weeks is a weekend they are with their dad. \n\nRecently, the kids said they want to try splitting up on the weekends, so instead of both of them being with one us during the weekend, one will go with dad and one will be with me. My son said he would make sure he was with me on call weekends because he can stay by himself if I have to get called in or can hang out at the hospital until I'm done. My ex is on board with this because he says it will allow us to spend one on one time with the kids and will allow the kids a break from each other (they squabble occasionally and annoy one another). While they have a point- sometimes it is hard to not feel like you are disappointing one by trying to accommodate the other, I do not want to give up my free weekends. It took me a few months to get used to not having my kids all the time after the divorce but now my weekends without them are filled with activities or travel. My ex agreed if there was a weekend trip I wanted to take he would be fine having both the kids that weekend but I honestly don't want to have to take his schedule into consideration when planning my trips, and sometimes they are spontaneous trips. \n\nI was talking to my family about this at breakfast this morning and they are all kind of appalled by me not wanting to do this. My sister pointed out that if I was still married, then I wouldn't have all the child free time I have now and many mothers don't get a break from their kids like I do. My mom said she can't believe I'd deny my children quality time with their parents for selfish reasons like not wanting to give up my weekends. My SIL seemed to understand where I was coming from but said that she would still do it and just incorporate the child into whatever I was doing and pointed out my daughter would love to go on the NYC shopping trip I had planned for December and my son would happily join me for my Saturday morning spin classes. I considered that but my SIL loves taking her kids everywhere so I don't know that she is aware of how nice it is to just be an adult without the responsibility of a child wherever you go. They were really making me feel like an asshole though. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 30413,
      "content": "YTA- I know it feels great to have your time alone but you decided to have your kids and they need to feel loved by you. It is sad that you'd prefer to do things on your own and not have obligations. Not gonna lie, it would make me really sad if my mom told me this. You just have to make do with the time that you do have and take into consideration your ex's schedule when planning stuff.\n\nEdit: Thank you for the platinum, gold, and silver kind strangers!",
      "id": 2,
      "comments": [
        {
          "score": 9617,
          "content": "I agree with you, and just want to add this - you *will* regret passing up this time. My kids are older now (23, 19, 15). Everyone tells you when they’re little and you’re in the thick of things “The years fly by!”, and I know it doesn’t feel like it day to day - but they do fly by. In my case, some days I wish I could magically go back and have just one hour with each of them as a toddler! I miss those little people! \n\nYour kids are only kids ONCE. You have the rest of your life to be an adult with adult children who are all off doing their own things.\n\nEdit: Thank you for the silver! Now go hug your little ones.",
          "id": 3,
          "comments": [
            {
              "score": 1849,
              "content": "My youngest has been living in another country with her father for the last 6 months. She wanted to finish 4th grade with her friends  Thankfully she decided she’d rather move here with me over Christmas break instead of waiting for the summer. I had her here with me for 2 weeks during the summer but man I’d give anything to spend every weekend with her. I can’t wait to have my girl full time! I can’t even imagine choosing me time over time with her. They grow up too fast. My oldest is newly engaged & my middle child just moved into her own apartment.",
              "id": 4,
              "comments": [
                {
                  "score": 184,
                  "content": "She is the asshole but I understand where she is coming from. I have no kids and never plan to because they are just a huge burden and the bad outweighs the good by an exponential margin. If you have kids love them because it is not their fault but kids suck.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 301,
                      "content": "[deleted]",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 83,
                      "content": "hahaha \"its not their fault they suck\"",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I think people are taking your comment critically because you state it as if its fact. Whether children are a burden and net negative or not is subjective. I'm not on the kids boat either but some get a lot more out of raising kids than others.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "I get what everyone is saying here, but I have a 15 month old and I don't think she should be shamed for saying she wants her Me time to recharge. I love my lil dumpling, but he is a pain in the ass and going anywhere with him is 100x harder than if I were to go alone. Like yes, your children are only children once, but she is also a person with needs. The children should be her priority, but having a child doesn't automatically mean you become a slave to them with no consideration for yourself. I can understand that she fell into a routine of having time for herself and now she is going to miss that time. Nobody is the asshole. I'm sure once she readjusts, things will fall into a routine again.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Yeah, but she did have kids.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 14,
                  "content": "I don't want to give up me time and that's one of the reasons we don't have kids and wouldn't keep one if my wife got pregnant. If you want to have kids you have to accept that for 18 years at the bare minimum your time isn't your own. I'm not willing to make that sacrifice so I will just rock being an uncle instead. Having kids should never be thought of as the default option.",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1343,
              "content": "Currently nursing my 3 month old and crying at this comment. I was just complaining to my husband how difficult it was to get anything done since one of us has to hold her or have her strapped to us often.\n\nI guess the sweeping and dusting can wait.",
              "id": 12,
              "comments": [
                {
                  "score": 831,
                  "content": "Don’t beat yourself up. You are a new mom and need time to yourself once in a while. This time will pass so quickly and it’s ok to acknowledge how freaking hard it is. Be gentle and with yourself. New babies are hard.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Dont feel badly. There's wanting me time and then there's needing one second to catch my breathe and maybe wash a dish before the baby needs me again. Newborns take up so much of your time and it's hard to even get potty breaks or shut eye beteeen changes and feedings.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 467,
                  "content": "[deleted]",
                  "id": 15,
                  "comments": [
                    {
                      "score": 364,
                      "content": "Just [fixing your link](http://holyjoe.org/poetry/hamilton.htm) because that was a beautiful poem",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 60,
                      "content": "That's beautiful. Thanks so much for sharing!",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I just made the last part as a cross stitched piece for my sister- she gave me a beautiful niece last month, and it's perfect for new mamas!",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "I have a cross-stitch of the last stanza of that poem that my aunt made for my mother when I was born. My mom gave it to me when I had my son. I never knew the rest of it. Thank you so much for posting this!",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Omg crying... this is so sad im going to go play with my kids",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 348,
                  "content": "Do not feel guilt about needing a break. Parenting is exhausting. Do not let anyone make you feel that you are less of a parent because you need to be able to put her down, or need time away. That us normal. That is human. It is necessary to be a good parent. \n\nWhen my daughter was 5 months, we were trying to move. I literally made my husband take days off work because I could not even pack a box of books. At 5 months, she was old enough to get bored but not old enough to entertain herself. And yes, we left her with  my inlaws a few times just to go be adults for an evening.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 23,
                      "content": "This. Kids are only kids once, but funnily enough, you're only in your 20s/30s/40s once. Being responsible for your kids doesn't mean and shouldn't mean not having a life.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "A break is once in a while. Not planning that every weekend or even every other weekend that you won’t have your kids because “meeeeee time”",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "My wife and I had a hard time with this as well... Every parent deserves a break, sometime you just gotta walk away for a bit. My wife felt she was abandoning the child when she'd need space while they needed her, but her health (mental) is just as important.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "This needs to be at the top! Its so unrealistic to expect a parent to give up their entire life for their kids. For the sanity of the parent, breaks are not only good, they’re necessary. I know I’m a better mom when i have some me time.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 140,
                  "content": "It can absolutely wait. Nursing is hard. But one day it'll be over and over forever. Sit. Snuggle. Rest.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "The first 6 months of parenting is literal hell on Earth with small moments of joy sprinkled in. It gets so much better, I promise. Just came in from shoveling the driveway with my kid, and now he wants to play Pokémon. :)",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Sweeping and dusting can absolutely wait. Trust me, when the cuddle days are over, most people would gladly live in the middle of a mess if it got them a little more snuggle time with their Littles.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "The sweeping and dusting is still there even when your kids have grown up and left home, just cuddle her and hold her close while you can, they really do grow up far too fast ☹️",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "You will learn new ways of doing things with the little ones around. You find the time in between other things and in some cases, you can do it with the young kids too. Don't beat yourself up about anything in your first year of parenthood, because the dusting can wait a little bit. Enjoy the time with your newborn instead",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "The sweeping and dusting can always wait.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Oh, mama! It can wait. Enjoy these snuggles. Yes, it is hard; it is so hard. You are not alone. It is okay not to love every single moment; it is okay to cry; it is okay to worry about getting it all done. But know that the things will get done, but right now, the most important thing is feeding and bonding with your sweet baby.\n\nBe kind to yourself. Be patient with yourself. Sending virtual hugs from an internet stranger who has been in your shoes.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 916,
              "content": "Since I had my son I’ve realized this is why people get so crazy about grandkids.\n\nThe years blink by. I already miss when he was tiny and he’s only a year old. It’s a magical time for all its hardship and you only get it once. Grandparents just want that one hour with their babies again. My son looks EXACTLY like I did as a baby. My parents literally get their hours with their baby back, but different and new and exciting because he’s his own person with his own self and explorations and discoveries and they don’t have to do the hard sleepless stuff.\n\nI didn’t get it. That there are so few things as purely human and loving and without guile as a child who just wants to be held by you, and most everyone looks back on those moments as the best part of parenting and some of the best in their lives (and I have a demanding fulfilling career whose high points also go on that list.) And it’s gone so fast, but you’re still the same adult who got trained to love that way. But now there’s no one who wants that love anymore. I feel for grandparents a lot more now.\n\nOP, 10 and 12 are almost to the point where they won’t want or need you much anymore. You’ll regret it. No one dies wishing they’d shopped or gone to spin class more. Be grateful they even want alone time with you now, a lot of pre teens don’t. \n\nIt’s precious. Childfree time is great, but you aren’t childfree. Don’t give up the good parts of being a mom or you’ll only be left with the bad parts.",
              "id": 33,
              "comments": [
                {
                  "score": 370,
                  "content": "And at 10 and 12 they are old enough to think 'but why' when Mom says that she doesn't want them to do this. They're old enough to ask  or wonder what she does on her weekends that she doesn't want to go along with this, and to be really hurt by it either now or later on when they're older. Does she plan on lying to them on what she's doing on these weekends??",
                  "id": 34,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Sooo much this, they're old enough to ask why you don't want to spend that extra time with them and to be hurt by your actions. They're also old enough that I don't see how you cant easily incorporate them into your future trips/activities. We aren't talking newborn or toddler here where it can be hard being a single parent taking super young kids out. They're 10 and 12. You should be happy to be able to invite them along and spend that extra time. YTA.",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Reminds me of my childhood friend. His mom lived a few hours away and could never \"afford\" to come see him or pay for him to stay with her. Then he got a postcard from her in hawaii.... we were only 6 or 7 at the time but it really crushed him.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Heck, I'm just out of high school and my family got kittens my senior year.  This is on a far smaller scale but man I always wish they were small enough to hold in one hand again. That was what really made me realize everything you said was true.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": ">No one dies wishing they’d shopped or gone to spin class more\n\nAsssoles do",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 392,
              "content": "The days are long but the years are short. \n\nIve found this to be very true when it comes to raising kids.",
              "id": 39,
              "comments": [
                {
                  "score": 13,
                  "content": "So very true.\n\nWith every hug and kiss, I always pause to look at my kiddo face-to-face, just to take it all in. I know my days of seeing that boyish face are short. For the majority of our lifetime together, I will be looking at the adult version of him (though, I'm sure, my heart will always see that little boy).",
                  "id": 40,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I love the Kurt Vonnegut thought to pause and say to yourself, \"If this isn't nice, I don't know what is\". I find myself saying it when baby is safely napping or sleeping with a full belly and a clean diaper. The house may be a mess, it may be tidy or in the process thereof. But knowing that our little human is cozy and safe and loved... Ahhhh there really isn't a feeling like it.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "My heart is the bitter buffalo",
                  "id": 42,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 196,
              "content": "This was my thought too. I would bet money that in 10-15 years when her kids are grown she’s gonna wonder why they have no interest in involving her in their lives.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 94,
              "content": "The phrase, \"The days are long, but the years are short\" is so true. My girls are only 6 and 3, but I feel like every week, they're a new person. When they go to grandmas over vacation or something, I feel like they're so much taller, even if it has only been a week. I try to cherish my time with them because I know it won't last forever.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Can we mention how the little boy is literally willing to spend hours on hours at the hospital waiting for his mom? That there just shows he wants that one on one time with her",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I’ve always liked the saying “the days are long, but the years are short” I have a 2 year old and a 6 year old, and I am already wondering where the years have gone.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "My nearly 3yo is laying across me sound asleep, testing my ability to not pee myself by being on my full bladder. And I was wishing she would get off of me so I could get up and do stuff. \n\nSince reading this I’ll just enjoy her cuddles a bit longer and be grateful for her love and affection.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "A phrase that I think illustrates it well is, “the days are long but the years are short”. I certainly find times where I feel overwhelmed with my kids and my wife and I can almost feel like it is just survival, but it is shocking when I think back on how fast the years went by.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1156,
          "content": "I will add to this and say this is not about you 'having to take your ex's schedule into consideration'. This is taking your children into consideration, which you absolutely SHOULD do as a mother.\n\nNot to mention how incredibly accommodating your ex and your son sounds about this towards you.",
          "id": 49,
          "comments": [
            {
              "score": 386,
              "content": "Yeah, I feel sorry for her kids, as a kid I never even questioned that I was basically the priority, it would be crushing to be second best to mum's me time. They get way less time with mum than most kids anyway.\n\nIf anyone sympathises with her, I feel they should think twice about having kids.",
              "id": 50,
              "comments": [
                {
                  "score": 312,
                  "content": "I feel like everyone should think twice about having kids rather than accepting it as a default goal.\n\nThe thought that every waking hour and whim needs to be dedicated to someone else for 18 years is a bit excessive. People are painting OP out as a poor parent for simply wanting to have free weekends every other week. \n\nSeems pretty rough-- no matter how much you give your children, other people will always expect more from you.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 202,
                      "content": "You can go to a spin class alone, or take an evening alone while your kids are out with friends. It doesn't need to be every waking hour. \n\nBut OP already regularly gets breaks to have time just for her every few days when they're at their dads.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Yeah, never getting enough me time is how you get parent burnout,  and that's no good for anyone either. I wonder if they could work out a rotating schedule where like, it could be kid a weekend 1, kid b weekend 2, both kids weekend 3, no kids weekend 4? I know the on call weekends would make that hard,  but it would at least give each parent a potential weekend to themselves.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "\"I feel like everyone should think two, three, four, and five times and then think again about having kids rather than accepting it as a default goal.\"\n\nThere, had to fix that. \n\nI would advise anyone who might be on the fence about having kids not to have kids until they're positive they actually want them.  If you're not sure you want kids having one might make you glad you did.  On the flip side it may also make you resent your loss of freedom for the next decade or more. It's a gamble with a major downside if you happen to decide it's not for you after the kid is born.  Despite what a lot of people say, there's no guarantee you'll love your kids or that \"they'll make all the trouble worth it in the end!\" or whatever other platitude some people say about having kids. \n\nWritten by a father of two young children that I love very much and wouldn't trade for anything, but man are they a ton of constant work! But it's what I CHOSE.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I sympathize and have three great — barely — adult kids.  They were always my priority but I had my alternate weekends free.  My dauber is a new mom and she completely understands why it’s important to have some downtime for yourself.  Set boundaries.  Everyone deals with day to day life differently the stress and commute will wear you down if you don’t get a real and make it so you aren’t there for your kids — even when the kid is in the room.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Yep, this. I will tell my friends I need me time, I let my kids think I would prefer to stay with them than go out with my friends.",
                  "id": 56,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": ">If anyone sympathises with her, I feel they should think twice about having kids.\n\nIMO, parents who make their children their whole world eventually end up shells of their former selves and often co-dependent on their children. The welfare of the children should come first, no doubt about that, but parents need to take time for themselves, keep up a hobby(s) or interest(s) that do not revolve around the kids. I hate the perception that parents who maintain a life or personality outside of \\[child\\]'s mommy/daddy are selfish. They're *not* selfish. It's called self-care and it's healthy for both the parent and the children. \n\nWhen you make the children your identity and they eventually grow into independent adults, what will you do? Will you pick up the withered remains of the life you abandoned 2-3 decades ago? Or (more likely) will you cling to your children and view their every achievement as your own? Where will you find your pride or your purpose in life? Is it to badger your children to have grandchildren so you can start this whole cycle again? \n\nWhat about your husband/wife? After the children leave, will you still remember what it's like to be lovers? Or are you just parenting partners now? If it's the latter, you'll find yourself living with a stranger after the children leave. I witnessed so many divorces when my friends and I left for college.\n\nIt's a pathetic existence and it's not necessary if people like you would stop insisting that any mother/father that wants some time away from their kids are horrible unfit parents.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I'm staunchly childfree and I still think she's TA. Your kids are your priority, always. Too bad you want to go to spin class by yourself, you made the decision to have children and that's that.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 3,
                      "content": "That makes sense. I don't have children, but I probably will at one stage. If I do decide to have children, it will be on the understanding that I can't just have my spontaneous trips without them anymore. Being a good parent involves personal sacrifice.",
                      "id": 59,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 84,
              "content": "Definitely what I'm thinking with the ex, totally sounds willing to work with things. And I wouldn't be too surprised if he ends up missing his free weekends as well, so even though the offer stands for out of town trips why not amend the new arrangement so that either party could call in the occasional mental health weekend or something? The whole set up sounds pretty flexible already.\n+These kids are getting older and are going to start to seek out more alone time on their own accord. I know it's not the same as having the entire place to yourself but some form of alone time still sounds perfectly attainable.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 537,
          "content": "YTA. As a kid who was sorta ditched by one of their divorced parents because I moved to Florida with the other, it actually cause serious psychological scarring to not feel wanted by one of your parents. \n\nAlso, a side note, at the time that you had your kids, you didn’t plan on getting a divorce, right? If you had stayed with your family you’d have your kids literally every single day, which is the way I think you should INTEND to raise a family if you decide to have kids. Divorce shouldn’t be an easy way out of caring for your offspring every day, otherwise maybe you shouldn’t have had kids.",
          "id": 61,
          "comments": [
            {
              "score": 32,
              "content": "I wish there was a hug or something and not just an upvote, but I gave you the upvote. My ex terminated rights to our kids and it breaks my heart because I know it does theirs. I feel so much for you. I'm sorry one of your parents did that.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I feel this comment. My husband’s father moved away after the divorce because he couldn’t be around his ex without hurting. He moved two states away back to where my husband had grown up 10 years prior. He immediately married his high school girlfriend 18 months later and set up a home with her.\n\nMy husband was 14 with an older sister 10th grade,  and a sister in elementary school. He talks about needing his dad and the choice his dad made to leave. His dad likes to say, You could have come to Texas. I would have had you.\n\nMoving was never a choice for husband. As soon as he could, he got a job to help support his mother and sisters. His older sister pitched in too. Together they lived in a little single wide owned by his grandma. \n\nMy husband, who is such a good dad to our three (14 y, 13y, and 11 y) says his dad dipped out during some of the most challenging and formative years. He left his mom to work a minimum wage job to support 3 kids. He didn’t pay child support. \n\nBasically, his dad was not particularly attached to the kids. He left to start a new life. Today, he tries to rewrite/spin the fact that he left.  However, if you listen closely to his stories about my husband, they always have one thing in common— they all end when he was about 13. There are no other growing up stories. \n\nParenting is hard. It’s probably the hardest. But the thing is, kids know when you don’t want to be with them. They know it now, and they will think about it their whole lives, especially if they become parents.\n\nMy husband more easily forgave his father when we were younger, but his anger has only become more acute as our children reach the same age as he was when his dad left.\n\nHis dad always says that they were almost grown when he left. My husband rolls his eyes. Yeah, in like 7 more years. If it makes him feel better. Who needs a dad when you’re 14? Oh, most people.\n\nTLDR my husband is still angry with his dad for dipping out when he was 14.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "She never said she didn’t want kids. She wants them at the same time. No time is being diminished.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My wife and I spent weekends with a kid (friend of our son) at our house because the mother was working and the father was pretty much a POS with a new younger wife.  My wife also picked up groceries at the food bank for her, and we augmented those supplies with other things we bought.\n\nOne of the things I remember is going with the kid and our youngest son to get  Mother's Day presents.  I paid for my son's gift and made sure to have kid purchase something for his mother which I also paid for. \n\nWe've also paid for orthodontics and prosthetics for kids we know, but choose to remain anonymous.\n\nOne world,  you can choose to make it better or not.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Have my updoot. \n\nI’m sorry that this happened to you. Honestly, sometimes I have an errant thought of wishing that my son’s dad didn’t want him so that I could have him 100% of the time and I think that I wouldn’t even care if he didn’t pay child support. But that’s always the selfish part of me and I have to shake myself out of it and remember that I’m not sharing time with my ex because my EX deserves it. I’m sharing time with my ex because our SON deserves it. He deserves to feel the love from both of his parents and even if we don’t always get along privately, we always are polite and nice to each other when our son is around. He should never feel unwanted. Even if I hate spending any kind of time apart from him, as long as his dad treats him well and loves him and cares for him then HE deserves to have his dad in his life and it shouldn’t be my choice to take that away from him. (Now if his dad were to turn into an asshole in the future and my son made the decision not to want to see his dad for long periods of time, I wouldn’t force it on him.)",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 211,
          "content": "Sounds like your tired of your responsibilities.... YTA. But honestly you might need to as your kids might see you getting tired of having them around and do irreparable damage.",
          "id": 67,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 173,
          "content": "I had shared custody of my kids when I split with the ex. After a short time, my youngest daughter wanted to stay with me full time. I didn't have family or friends able to babysit, so for a decade, I didn't have any child free days, let alone weekends. \n\nWas I bothered? sure, sometimes it would have been nice to go out and socialize, but at the end of the day, my daughter came first. As a parent, you put aside some things to give your children the best start in life, and part of that means missing out on spontaneous weekend trips and nights out. \n\nOP needs to either be an actual parent, or give her ex full custody and be the deadbeat parent she seems to want to be.",
          "id": 68,
          "comments": [
            {
              "score": 34,
              "content": "Honestly this is the biggest reason why I chose not to have kids. I know myself, I wouldn't be able to maintain the level of personal sacrifice needed to be a good parent. \n\nIt's possible I might have learned how to handle it if I was forced to, but there's absolutely no certainty of that happening. And if it doesn't happen then I've gambled and it's the *kid* who'd wind up paying the biggest price for it.",
              "id": 69,
              "comments": [
                {
                  "score": 12,
                  "content": "I never wanted kids. Had em by accident (though not so much an accident for my ex I suspect) and, to be honest, was bored as fuck in the delivery room and all through the pregnancy. \n\nBut... as frustrating as they can be, children can be entertaining. Watching them grow into incredible people is quite rewarding and knowing that I have people who will take care of me when I am old can't be understated. \n\nIt's a lot of work, and if you start young as I did with little money and a crazy, lazy, partner who refused to work, it can be bloody hard. But, there are a lot of great times to be had too. \n\nBoth my daughters slept on my chest as babies, and cuddled up against me when they were older. They are two people who, without a doubt, love me. As a father, and a man, who was raised in a rather old fashioned way, it allowed me the chance to be protective. There were two lives in the world that were mine to protect, to nurture, to raise. \n\nIt was rewarding and will no doubt continue to be so. It's one of those things where you don't know until you try it, but I can tell you one thing. If you are worried about it, you will likely be a good parent. It's the one's who don't think about it, or just assume they will be great parents, that tend to fuck up their kids.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Assuming that I worry about it requires first the assumption that I want kids, but am avoiding it because of fear or anxieties.\n\nI don't *worry* about how I'd do as a parent because I don't want kids. And because I don't want them, I wouldn't be able to shoulder the responsibility of always putting their needs before my own. \n\nAlso the phrase \"you don't know until you try it\" is meaningless, quite frankly. Sure it's *possible* that I could somehow develop a maternal instinct where I've never had one before, but I feel absolutely no curiosity or obligation to find out whether or not that's what would happen. So I'm not going to, which means theorizing about it is totally moot.",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "> It's one of those things where you don't know until you try it\n\nWhy do people who came to terms with their mistakes always use this stupid argument? By that logic are all straight people just gay people who haven't tried. Come on, you can know.",
                      "id": 72,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I also ended up with full custody of my daughter.  There is never any free time.  Full time job, all house responsibilities, full time dad.  Exhausting but she is my responsibility. No regrets.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 146,
          "content": "OP is TA to the fullest. She can't just decide to check out of being a parent when she feels its convenient. Also, concur, as a kid, hearing my parent doesn't want to spend time with me would break me",
          "id": 74,
          "comments": [
            {
              "score": 9,
              "content": "My mother got shitty at me in my early teens because I really wanted to do a dance class she was going to sign up for with her friend. She let me go to 3 or so classes with them, then said \"This is MY thing, you need to find your own thing, I didn't think I'd have to share this with you\"\n\nAs an adult now, yeah, true, but as a 14 year old in a country town I didn't have the means (financial and transport wise) to \"find my own thing\", and damn did that rejection sting.\n\nOP, YTA. Go do a spin class with your teenage kids.\n\n*Edit for typo",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": "*make do, not make due",
          "id": 76,
          "comments": [
            {
              "score": 51,
              "content": "Thank God someone said it.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "*make doodoo",
              "id": 78,
              "comments": [
                {
                  "score": 5,
                  "content": "Also important",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 98,
          "content": "If I am reading this right it sounds like the main difference between the current t arrangement and the proposed arrangement is that you will have a little less flexibility for spontaneity for the duration of your parenting years. YTA and then some! I can’t even believe that you’re really asking us to weigh in on this. In what world is your desire to maybe take spontaneous day trips every weekend completely alone outweigh your children’s need for one on one time with their mother? \n\nI almost cannot believe what I just read. You are free to plan fun trips solo and you are free to be spontaneous day trips with your kids while they are still interested in spending time with you. It’s a good life. Take it.",
          "id": 80,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "YTA. As a single mom who is always trying to find special time with each of my children I think you should consider yourself lucky that you have a willing ex. My ex refuses to take one at a time to allow us some one on one time. This would be a great opportunity for your children to bond with you individually. They could share in your experiences, and you could plan some things that they don’t get to do when the other sibling is around. \n\nLook, I get you deserve to unwind and do things for yourself. This is important too. Could you work out a schedule where maybe you get one for Friday night and then drop the off mid day on Saturday so you still have one night and all of Sunday free?",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": ">My ex agreed if there was a weekend trip I wanted to take he would be fine having both the kids that weekend but I honestly don't want to have to take his schedule into consideration when planning my trips, and sometimes they are spontaneous trips. \n\nI was about to rule N-AH but then this statement caught my eye. She is absolutely entitled to have some quality time to herself, every parent deserves to get away once in a while. But she wants to take spontaneous trips without planning for any sort of childcare in advance. It sounds to me like she wants to live like she doesn't have kids half the time when the reality is that you give up that level spontaneity when you become responsible for fragile, small human beings. YTA OP",
          "id": 82,
          "comments": [
            {
              "score": 8,
              "content": "I think that’s what moved it for me too. Commenters are focusing on the kids wanting to be apart bc siblings squabble and that’s not a good reason but OP didn’t include anything in her reasoning about  that- her entire reason for saying no was bc she didn’t want to work with her ex’s schedule",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14485,
      "content": "Oh YTA without a doubt and your family was being nice to you.\n\nLike seriously you're treating and TALKING about your kids like they're some  \nacquaintance. Your SIL offered you solutions , but because they care enough to bother to be around their kids you don't think they really count?\n\nAnd before people start insisting \"you're forcing her life to be kid centered!\" This literally isn't that, it's a fuckin weekend. Grow up and actually be a mom and stop pretending your trips are more important.",
      "id": 84,
      "comments": [
        {
          "score": 5653,
          "content": "I agree!\n\n> my SIL loves taking her kids everywhere so I don't know that she is aware of how nice it is to just be an adult without the responsibility of a child wherever you go. \n \nThe fact that OP is aware of \"how nice it is to just be an adult without the responsibility of a child wherever you go\" translates to OP is aware of how nice it is to be child-free. But she's not child-free.",
          "id": 85,
          "comments": [
            {
              "score": 3240,
              "content": "I have to really support this comment - I was a lot more in the fence than a lot of these comments, as someone who doesn't want kids and hates having it forced upon me all the time by family.\n\nBut OP literally has kids. That ship sailed a looong time ago, and she's wanting to guiltlessly slip out of that responsibility for her benefit and her kids detriment. Thanks for phrasing it this way.\n\nEdit: my first silver, thanks stranger!",
              "id": 86,
              "comments": [
                {
                  "score": 1151,
                  "content": "Agreed 100%\n\nThe point about how if she wasn't divorced she wouldn't have any kid free days was also spot on.  She's already got more \"me time\" than she did 5 years ago.  This isn't a woman who's working all day and caring for kids all night every night.  This is someone who has strings of days at a time with no children.  And that's not enough for her somehow.\n\nI'm in a situation where someone passed away and I found myself in my early 30s raising two teenagers.  This wasn't exactly my choice, but I agreed to it, and that means agreeing to put the kids first regardless of how convenient it is.  OP made the choice to have kids, that means signing up for 18 years, *minimum*, of putting the children first.  Sorry, that's just what being a parent is.  Kids aren't cars, you can't take them back if you suffer from buyer's remorse.  This is her life now, by her choice, and she needs to adapt to it.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 837,
                      "content": "I'm surprised more people aren't pointing out the fact that she stated that she has had five years of child free weekends. She even pointed out that her ex would be willing to accommodate her schedule on weekends when she plans to travel solo. It's a major obvious YTA for me.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 423,
                      "content": "Not to mention, the kids are 10 and 12. They're not toddlers who will be up her butt all the time.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 97,
                      "content": "Absolutely agree. My youngest just turned 17 and I have been counting down the days these last few years to a time when I will be a little more free to do things that everyone around me seems to get to do. \n\nI never had child care options or family to help, was just me and the kiddo for the past decade and as much as I've enjoyed it, I have missed out on social events, friendships have fallen away and I haven't had a childfree day in years. \n\nNow she is in college, I can actually plan a week away with my brothers, or even just random weekends away. I don't regret a single second of letting her live with me instead of her mother for the past decade, but it will be nice to go do adult stuff.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 52,
                      "content": "I know lots of married parents where one partner will let the other one off for some weekends, in fact I don't know any who dont",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 290,
                  "content": "Honestly. If I was the ex husband, I'd be talking to a judge about getting full custody. Like, you wanna be child free? You wanna go on your oh-so-important trips? Fine. Relinquish all rights to the kids. Have fucking fun being \"child-free\", but don't you dare come crawling back when you start feeling guilty about it. OP is really selfish.",
                  "id": 92,
                  "comments": [
                    {
                      "score": 176,
                      "content": "This. YTA OP. Going back and forth between living spaces is hard enough for a kid, but the ones who come out okay have loving parents who put them first, always. If you aren't going to put your kid first, you don't deserve the time with them.\n\nSpontaneous trips are only a couple years away, so be patient and put your kids first ASAP, if it's not already too late. I had a dad who put his mistress before his kids. I don't speak to him now.",
                      "id": 93,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "He won't do that, because he cares about his kids.",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "Exactly. This is why people need to think more before they have children. Having children is literally a full time job, meaning 24-7. If you’re not up for that, don’t have kids! And if you love kids so much, consider getting a job working with kids, or volunteering with kids, or literally anything else. Don’t bring children into the world that you don’t actually want to take care of for at LEAST 18 years. It’s even more infuriating in this case since the kids are preteens, meaning they can mostly look after themselves and are their own little people, and still OP wants more “me time”. Sorry, you actually did kind of give that up (to the extent that you want it) when you decided to have children.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I can’t even imagine being a mom of kids this age and not wanting to use this as an excuse to travel with them. What a luxury to be able to cater to one child and plan a trip with them and have no anger because the other kid knows they will get their turn.\n\n10 and 12 is a great age for travel like this and OP doesn’t want to do it with them.",
                      "id": 96,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 152,
                  "content": "Seriously and she's had child free weekend for going on five years now. That's a lengthy break from her children and multiple opportunities for weekend  traveling. Either you want to be a mom out you don't, not when it's convenient for you. I think she should seriously consider this new arrangement by putting her children's needs first and  not her own selfish wants.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 126,
                      "content": "[removed]",
                      "id": 98,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 84,
                  "content": "I see my oldest nephew go through this. His dad never wants to spend time with him. He's a nerdy goofball. He just likes to hang out with his baby brother (different moms)and play Fortnite or read. But he still wants to hang out with my brother. Meanwhile my brother is focused on the baby, his own crap, or playing dad to the kid next door who likes sports and all that but has a broken home. Which would be great of he actually spent time with his own kid as well. Brother is trying to get more custody time. But it's only because he doesn't want to pay as much child support. Even though he pays next to nothing anyways. And it pisses me off. Fuck parents like my brother and OP. You decided to be a parent be a fucking parent. Not just when it's convenient to you. You literally signed up for this. They didn't.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yep, she wants to be child-free without actually being child-free. The ultimate 'have your cake and eat it too'. Big YTA.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "That's the thing if she didnt want the responsibility she should have had kids. If she didnt want to have to take into account her ex husband's scedual she shouldn't have had kids! No one forced her to do this. That being said I think it might revert back to normal.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Seriously, right? It grinds me. Why even have children if you're going to refuse the responsibilities of being a parent? If she ever voices her feelings to her kids, 10/10 they will be devastated.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 398,
              "content": "Exactly. I’m very aware of how nice it is to just be an adult without the responsibility of a child. That’s why I don’t have children.",
              "id": 103,
              "comments": [
                {
                  "score": 28,
                  "content": "💟👍",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 175,
              "content": "Agree with you here, I'm child-free and yes it is nice to have lots of \"me\" time but if I had children I would realize that parenting means making personal sacrifices. The kids didn't choose to be born, but mom and dad made that decision.",
              "id": 105,
              "comments": [
                {
                  "score": 14,
                  "content": "So much agree (Zied voice for any fellow 90-Day fans out there!) I mean, I’m CBC and I don’t want kids in part because I like my “me time,” and know that having kids would end that. OP chose to have kids and now finds them inconvenient, which makes her a major AH.\n\nYTA, OP.",
                  "id": 106,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "Seriously! This part stuck out to me too. Maybe SIL doesnt have much of a choice and has to take her kids everywhere because you know, they’re HER KIDS. And she’s accepted motherhood even if deep inside she might feel the same we you do (we don’t know, just a thought that you are assuming a lot).\n\nOP it sounds to me like you don’t actually want kids that much and that they’re a burden. But you know what, you had them, and now you’re asking this question. So YTA.",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Not to mention that it shows she only views her kids as a responsibility.  I view my kids as people and look forward to having their companionship  when I go places.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Maybe Mom should just have visitation rights.. it seems more like what she wants out of coparenting",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "When my mom left my dad she  didn't get any weekends off. So she took me everywhere. . I was exposed to so much messed up stuff as a kid. Drunken parties where my mom would pass out. Once a guy tried to have sex with her while I was asleep on the floor next to her. My mom didn't seem to care what she exposed me to. She was free of my dad and was gonna just act like a tramp while dragging me along",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I’d like to add: are you ever “child-free” as a parent? I’ve had shared custody of my child for years, and even those weekends away that I get, he is always still on my mind, always my responsibility, and I usually wish he was there to witness some of the things he’s missing! My phone is always on, I’m always on duty, and I can’t just “turn off” being his mom, even when I am truly having fun with girlfriends, seeing exciting new things and enjoying my “free” time. I think that’s just what parenting is...",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Right, if you prefer to live a child free lifestyle then remain child free.  People who don’t want to spend their free time with kids *shouldn’t have kids*.  \n\n\nOP’s kids will both be adults in 10 years.  That’s not long.  10 years goes by so fucking fast.  I can’t even fathom how my youngest is 10 1/2 years old already.  It goes by SO fast.  She needs to be a mom now.",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "What really got me is that SIL isn’t even saying “take your kid on every activity you plan” just hey I’m sure your kids would also enjoy some of the things you have planned or like to do too. \n\nIt’s one thing to want some alone time, but to not even want consider including your kids in some of the stuff you do is just actively excluding them, and those kids are gonna notice- if they haven’t already.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 724,
          "content": ">And before people start insisting \"you're forcing her life to be kid centered!\" \n\nI mean, she's a parent. Isn't that what parents are suppose to do?",
          "id": 114,
          "comments": [
            {
              "score": 250,
              "content": "Seems like it to me but I don't have children and that's exactly the reason why I don't want any.",
              "id": 115,
              "comments": [
                {
                  "score": 23,
                  "content": "and on the other side, i developed some serious mental problems as a kid due to op's style of parenting. the kids know when they arnt wanted around the parent, that kind of active neglect digs right into the core of their being and festers. for me it turned into 2 years of constant headaches at 13-14. i remember sitting on the stairs one day around that age and just feeling so thankful to the universe that i didnt have a headache for once, i just felt normal again for a day.\n\nbut the problem was never addressed and my situation kept getting worse until i numbed out and stopped feeling sadness all together. the headaches went away, but i didnt cry for myself for a good 10 years after that. also the anger and self hate that manifested when i no longer had an outlet to my sadness was pretty extreme.\n\non the parents side of things it seemed like i had a great childhood too, i didnt want for anything, i had 1 super loving parent, and one that dropped in to take me to movies every couple weeks or months, and i was doing well on my report cards. but i was completely closed off and didnt want to interact with anyone. i was convinced that no one but my mom liked me so i just stayed away from the other kids. i was rarely bullied, it was all fairly tame and half the time what i thought was bullying was just kids trying to break the ice. but to me at the time i thought i was constantly persecuted since i lived in a bubble.\n\nmost of this was caused just by my dad never paying attention to me, and then when he showed up to parent he would take us to a movie or mini golf while taking lots of pictures as if the pictures showed that he cared. i remember when i was 16 and helping him move again, i asked him where the pictures were and he had no idea. literally 1000s of pictures of my childhood that he forced on us and he lost them all. that caused some real anger/hate, only in the last 3 years did i properly resolve that :P\n\nanyway, my point is that the direction op is going is setting her kids up for my childhood. if they see her going off when it could have been their weekend with her every single time then it will crush them.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 208,
              "content": "There's definitely a spectrum there.  You see some parents whose lives revolve entirely around their children, so they don't have adult friends or any hobbies outside of things they do with the kids.  I've met plenty of women who were fully formed people before giving birth but once they had kids all they seemed to do or talk about was entirely around said kids. It makes you wonder where the person you knew before went.\n\nI'm not worried about that for OP, I think this one is a different problem. I just wanted to point this out because I see it all the time - people think your life has to stop and be all about the kids once you have them, but that's not good for your relationships or your own mental health.",
              "id": 117,
              "comments": [
                {
                  "score": 19,
                  "content": ">people think your life has to stop and be all about the kids once you have them, but that's not good for your relationships or your own mental health.\n\nWhich then extends to damaging your kid's relationships and mental health. Even if you want to be all about your kids, don't push yourself to the point of having mental breakdowns in front of them! It happened to my mother, and it can happen to you.\n\nHonestly, I think people are being a little harsh on op. She said having kid-free time periods was something she had to adjust to initially. I don't think she's such a bad mother because she succeeded in adjusting. Now her family is proposing she change her lifestyle *again*, and that is stressful. I'm inclined to say NAH.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I'm nowhere near the point of having kids but I agree. Kids are awesome and totally rewarding, but having your life revolve around them isn't necessarily a good thing. When I get married I fully intend to keep my wife my wife and not merely the mother of my kids. It's a delicate balance.",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 114,
              "content": "It’s okay to be a parent and need alone time.",
              "id": 120,
              "comments": [
                {
                  "score": 123,
                  "content": "Sure, but I don't know any parents who aren't divorced who get as much alone time as OP.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 6,
                      "content": "You don't know any parents who share their kids equally?",
                      "id": 122,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "She only has her kids 50% of the time, how much “alone time” does she possibly need? Parenting doesn’t work like this.",
                  "id": 123,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "She already has tons of alone time.  She needs to suck it up.",
                  "id": 124,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "What a lot of people seem to overlook though is that id rather have my mom 2 weekends a month than 4 weekends a month if it means she doesnt burn out. A burnt out parent is not gonna spend any time with their child in a qualitative way. I would rather have parents some of the time than not having them at all.",
              "id": 125,
              "comments": [
                {
                  "score": 10,
                  "content": "Burnt out from hanging out with a 10 or 12 year old an extra 20 hours a week? Come on. This isn't sleepless nights with a newborn. This isn't toddler temper tantrums. This isn't wiping another person's b-hole. Shit! This is barely cook an extra meal. At that age, you can sleep in while they pour a bowl of cereal and watch TV. \n\nHer kids are asking that she spend time with them, as people. Not put in hours as their slave.",
                  "id": 126,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Like I mentioned in another comment if you have a kid at 30 and they move out when you’re 50, assuming a typical female life expectancy of 80 that’s 60 years without your kids and 20 years with them. Only 25% of your life is “kid centered” and even that’s too much for OP.",
              "id": 127,
              "comments": [
                {
                  "score": 6,
                  "content": "The worst part is she doesn't even have her kids full time.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 366,
          "content": "Honestly, if you have kids, you kind of chose to have your life centered around the needs of the human being you gave birth to. Yeah everything should be in moderation, but your children should always come first. And I agree with you. It’s a fucking weekend. OP needs to grow up and be a mother.",
          "id": 129,
          "comments": [
            {
              "score": 4,
              "content": "Exactly. These are HER children, not some random kids she’s forced to spend time with. She doesn’t need to be with them constantly and do every single thing with them (and given that she’s sharing custody she won’t have to anyways). If you choose to have children you automatically have the responsibility of taking care of them and putting them before yourself. If you don’t want the responsibility don’t have kids.",
              "id": 130,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It’s not even just a weekend, OP’s husband is totally cool with giving her any weekend she wants. She’s mad she can’t just escape from life with no notice, which is something even child free people understand can’t happen whenever you want. OP needs to grow up full stop.",
              "id": 131,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 270,
          "content": "> you're forcing her life to be kid centered!\n\nWell, she did have the kids. Her life fucking better be kid centered. Once you decide to have kids you should be putting them before yourself pretty much always until they're self sufficient enough. This person is literally asking if they're ok to tell their kids \"nah, I don't really want to spend more time with you than the courts say I do.\" YTA, OP.",
          "id": 132,
          "comments": [
            {
              "score": 19,
              "content": ">\"nah, I don't really want to spend more time with you than the courts say I do.\"\n\nThat's the thing. This isn't a stressed-out parent who can't handle two toddlers at once - It is a parent who heard her self-sufficient preteens ask to just be able to spend quality time with her and the response was \"nah, I'd rather go shopping and spinning\".\n\nImagine being that kid who just wants to spend fun weekend time with mum and be rebuffed like that because you''re just not as fun as a spontaneous trip to NYC...",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 157,
          "content": "Also, at 10 and 12 they’re going to be doing their own thing a lot, and they’re only going to get older. The daughter will also be able to spend time by herself in a year or two so OP can go to her spin classes and stuff. Also, I’m sure if OP or dad wanted a weekend off or needed to do something for a weekend - like the trip to NYC, the other could take both for that weekend. They just need to have a flexible schedule. Maybe one weekend the kids will want to be together. \n\nI get it, breaks are awesome, but I mean, what does every other parent do? They still get breaks. It sounds like OP has week days off sometimes too.",
          "id": 134,
          "comments": [
            {
              "score": 41,
              "content": "Hell, OP even said Ex offered to take both if she had a trip planned.  She just didnt want to extra work of having to ask.",
              "id": 135,
              "comments": [
                {
                  "score": 12,
                  "content": "Right? Imagined being so entitled that you don't want to be bothered to make arrangements for your children while you go on a solo trip.",
                  "id": 136,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yes, she has shared custody so she is definitely getting time to herself.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "Her ex even was being really accommodating when we hear so much of the opposite on this sub! She can be an adult and plan her trips from now on or do things that include her son too",
          "id": 138,
          "comments": [
            {
              "score": 13,
              "content": "“I don’t want to worry about my ex’s schedule... 😩” That’s what adults do when they share custody and ESPECIALLY when one is being so damn accommodating of the others personal life. I wish my parents did better at sharing time and communicating about their needs when we were young... I felt like a chore sometimes and wish I’d had more quality time with each of them (not sharing time with my asshole brother would have been fucking amazing). I hope she puts some real adult effort in and makes this work, it’ll be so great for them.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "Right or spontaneous trip with one of your kids once in a while. Make them feel included and loved",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Foreal OP is selfish. I’m appalled.",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "She's on call a lot of the kid-less weekends as she's a nurse.  You make it sound like OP is some kind of spinster who hates her children.  \n\n\"Grow up?\".  Really?  Sounds like she's doing a good job in maintaining a good relationship with her ex and her kids.  I don't fault OP at all here.  \n\nAnd yes, I have a son.  I'm an \"ex\" as well and ex-wife is a great mother.  But she's on her own with him during the week and I have him on weekends.  Her weekends off make my ex a better mom.  Period.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8290,
      "content": "Yta. You are their mum, you made the choice to have them, whether or not you are separated from their dad you still have the responsibility of being a parent.\n\nYou can't pick or choose when you want to be a parent",
      "id": 143,
      "comments": [
        {
          "score": 810,
          "content": "you don't stop being a parent on days that you're not on visitation. That's an absurd notion. And even families that aren't split up by divorce will eventually have times where mom or dad do things by themselves. It's ridiculous to think that someone wanting to maintain a rather small amount of ME time would be an asshole for it.",
          "id": 144,
          "comments": [
            {
              "score": 1328,
              "content": "Except that she literally says this would be very good for the kids, both so they have one on one time with parents AND have a break from each other, and she doesn't care.",
              "id": 145,
              "comments": [
                {
                  "score": 705,
                  "content": "Also, the kids are older. They’re not going to need her constant attention on the weekends, and I’m sure they’re going to spend some weekends maybe out with friends or doing their own thing. You can still have me time with kids in the same building as you. Maybe it’s not as good but it’s still there.\n\nAlso, what does she think married parents do? Or single parents? You have your kids all the time.",
                  "id": 146,
                  "comments": [
                    {
                      "score": 286,
                      "content": "That’s exactly what I was thinking. It’s not like her kids are 2 and 4yrs and they constantly need snacks, naps, help on the toilet and complete supervision. She even said the 12yr old can stay home by himself so if she did want to go shopping for a couple hours or grab dinner with her friends it would be pretty easy to do that fairly regularly.\nAlso YTA",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 360,
              "content": "Small amount? The weeks she has them 3 days a week, they’re in school all day so she only has them from 3ish on and isn’t working those days so she has most of the day free. Plus she gets entire weekends without them. Technically in a 2-2-3 schedule during the school year 1-2 custody days is really only breakfast bc the kid spends the whole day in school.",
              "id": 148,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 93,
              "content": "[deleted]",
              "id": 149,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 86,
              "content": "I mean she doesn't have them for big chunks of time. She has a lot more me time than most parents.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "Sure but you don't get 26 weekends a year of uninterupted \"me\" time when you're a parent.",
              "id": 151,
              "comments": [
                {
                  "score": 13,
                  "content": "I'd settle for 26 minutes of uninterrupted weekend me time...",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "It doesn't sound like she wouldn't have any me time. There are already two days a week she doesn't have them and their dad is willing to take them both on weekends she needs to herself.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "She already has plenty of me time.",
              "id": 154,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Yeah, everyone needs me time, but most parents dont require 2-3 days a week of me time. She had the children, she needs to grow tf up and be a mom!",
              "id": 155,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "OP isn't asking for the occasional day off from her kids. \n\nShe currently only sees them 50% of the time and is upset that will be forced to see them more than that.",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "She gets me time. She doesn’t have them all the time. Read the damn post",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 185,
          "content": "Actually lots of people do choose when to be a parent like my ex did and now he doesn’t have our children they’ve cut him out of their lives since he didn’t understand how important it is to be there for your kids.",
          "id": 158,
          "comments": [
            {
              "score": 42,
              "content": "Well, right, so he's an asshole dead beat. As this OP is flirting the line. She's the obvious asshole, tipping her toe in the 'dead beat' water to see how it feels.",
              "id": 159,
              "comments": [
                {
                  "score": 12,
                  "content": "Yup he is and I agree she is definitely on the line!!",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "I think it's less of \"you can't\" and more of \"you shouldn't\". Sorry your ex is an asshat.",
              "id": 161,
              "comments": [
                {
                  "score": 6,
                  "content": "Thanks!! I try to keep my feelings about him away from my sons but they are old enough to see him for who he is now!",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Exactly. Your ex is labeled and viewed as an asshole because of what he did. The OP is asking if they are an asshole for doing the exact same thing. Fuck you OP. Piss poor parent.",
              "id": 163,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4955,
      "content": "[deleted]",
      "id": 164,
      "comments": [
        {
          "score": 1124,
          "content": "support soft rustic truck fuzzy many handle plough dull reply\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
          "id": 165,
          "comments": [
            {
              "score": 629,
              "content": ">OP doesn’t seem to realize that this time is shorter than she thinks it is, life isn’t guaranteed, and the relationship you have with adult children - which could be very long indeed - is the gift you earn with how you treat them as children\n\nThis right here just blew me away.",
              "id": 166,
              "comments": [
                {
                  "score": 13,
                  "content": "I know! So well said !",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "as someone who often feels guilt over cutting out one of my toxic parents, this made me feel better.",
                  "id": 168,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "It’s 100% correct. My parents aren’t perfect but they loved us to bits and did everything they could to help give us a good life, and as an adult my brother and I have a really close relationship with them. Can’t say the same for several of my friends, who have basically little to no relationship with their parents who were shitty and distant for most of their lives",
                  "id": 169,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 316,
              "content": "> the relationship you have with adult children - which could be very long indeed - is the gift you earn with how you treat them as children.\n\nSomeone should send this to my mother who doesn’t understand why we aren’t close now. \n\nHonestly, I was confused by all the YTAs in here. But you turned me around. Sometimes I forget my normal meter has been twisted by my own childhood because when I first read the post it seemed perfectly natural to me. But I also only talk to my mom when I have to, so. \n\nSo I suppose that’s the answer, /u/momasshole. What kind of relationship do you want with your kids when they’re grown?",
              "id": 170,
              "comments": [
                {
                  "score": 72,
                  "content": "jeans wrong unique snails wipe longing fragile long disgusted door\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
                  "id": 171,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Lol my family 100% does the matching shirts :) But yeah, it's definitely a result of my parents always, always putting us kids first, and we knew that.",
                      "id": 172,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "> And then I met a different family who does yearly get togethers\n\nDo people usually not hang out with their family, or is it because people live far away from each other in the USA? My family meet at least once a month with everyone's kids etc, but we all live within an hour drive from each other.",
                      "id": 173,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "> the relationship you have with adult children - which could be very long indeed - is the gift you earn with how you treat them as children. \n\nThis is so true. My parents split when I was 2; my dad had full custody and I went to my mom’s every other weekend, half the summer, and every holiday except Christmas. Sometimes my mom didn’t pick me up on her weekends, and when I was at her house we never did anything together. I just watched TV or played alone with my toys. I only have two memories of doing fun things with my mom. We live 1,000 miles apart now and while we talk on the phone a few times a week, I haven’t seen her in over 10 years.\n\nMy dad, on the other hand, was the complete opposite. So many memories of fun things as a kid. He was a great dad, despite being so young and working all the time. That’s why two years ago, when my dad got laid off from his job, my husband and I invited him to come live with us and start over in our state. My dad now lives less than a mile from us and he’s enjoying his new life and being a grandpa. \n\nHow you treat your kids when they’re young definitely impacts your relationship with them when they’re an adult.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": ">\tthe relationship you have with adult children - which could be very long indeed - is the gift you earn with how you treat them as children. Maybe not right away. But one day.\n\nThis is so true as I’m sure anybody with a not so great relationship with their parents can attest to. well said!",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Very well said. \n\nThank you for sharing your thoughts. Time certainly is the most valuable thing we have with each other.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">OP doesn’t seem to realize that this time is shorter than she thinks it is, life isn’t guaranteed, and the relationship you have with adult children - which could be very long indeed - is the gift you earn with how you treat them as children. Maybe not right away. But one day.\n\nSo very true. Every parent should take this into consideration.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 174,
          "content": "I know how precious a little alone-time can be for a parent, but I agree with your comment *so much*.  They're 10 and 12, not toddlers when the parenting can be just overwhelming.  In a few short years those kids are going to have their own friends and interests and then they're off on their own and you'll have time on your hands.  OP, YTA and you need to enjoy this time with them now.",
          "id": 178,
          "comments": [
            {
              "score": 78,
              "content": "Honestly by 12 I spent most of my free time watching YouTube, playing video games, trying out new recipes or reading in my room. All except the cooking I could do with or without my parents being home, and the cooking only required my parents to be in the house because that was their rule, I was doing it all myself. Also I get the feeling the older one wants this so they can get some more time home alone.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "The amount of time she is spending with her kids isn’t changing, but the amount of time she is spending to figure out her own new single life would be affected.\n\nPost divorce my mom put us kids before even thinking of trying to have a social life or weekends to herself so she always had at least one of us every weekend. Her ability to date or make friends or get hobbies was nonexistent.\n\nYears later all us kids are grown and my mom hasn’t dated in over a decade and she is alone, depressed, has no hobbies, and has no life. She works and goes to her apartment with her cats and watches romance novelas on tv.\n\nShe went so long without a weekend to herself that she never did anything for herself and now has nothing that is her own. \n\nOnce we were grown she tried her hand at dating but was so out of touch with the dating world that she didn’t  k ow where to start or how to even be in a healthy relationship.\n\nShe was so starved for partnership she ended up falling for a Nigerian American soldier love scheme and by the time we (her kids) discovered it she had already given him $20k worth of money.\n\nEven when we tried to explain it was a scam she refused to believe it and when she did finally acknowledge it was a scam she cried for days and then lashed out because she just wanted to feel loved and desired and feel like a woman, not just a mom and that illusion was now shattered.  She was no longer young and her only identity was her kids for so long that she didn’t know why a man would ever want her now or how could a man ever love her now that she was already this old and didn’t have her own identity. A year later she is still as depressed as ever from the one time she finally decided to put herself out there and she got caught in a scam. All the sweet things he told her that she had been waiting over a decade to hear and it was all to get money from her. \n\nKnowing what I know now about her life, young me would have gladly asked her to take more consistent weekends to herself to explore herself and rebuild a life, because she isn’t just a mom, she is a woman who had needs but never set boundaries to be able to build it. I’m so sad that she gave up everything for us and now is 60 and has nothing that doesn’t revolve around her children.",
          "id": 180,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3033,
      "content": "YTA- your kids clearly feel they are having too much moving And change. They clearly want to spend more quality time with you and your son has even considered your rota!",
      "id": 181,
      "comments": [
        {
          "score": 276,
          "content": "it seems more like as if the kids just want to be away from each other for a while. OP says they squabble alot and they are only 10 and 12. That kind of thing is common for kids at that age. OP can always just say no that's not reasonable but time to time she can take a kid solo for some weekend, if the kids want to. I am 90 percent sure the kids will change their minds in a month or two after the new pattern is implemented anyway. So OP can also just follow what the kids are asking for a few months. After which they can just revert back to the normal routine. NAH imo.",
          "id": 182,
          "comments": [
            {
              "score": 109,
              "content": "Honestly, I'm with you too. My brother and I never wanted to spend time together either-- Until suddenly our parents were separated and we were barely seeing each other (my brother lived with our dad because our dad lived in a school district with a high school program he specialized in, while I stayed with our mom). Then, spending time together became a lot more special, and less of something we complained about. I think there's a way to do this without completely changing the pattern though.\n\nFour weekends in a month. Weekend #1: Son with mom. Weekend #2: Daughter with mom. Weekend #3: Both with mom. Weekend #4: Neither with mom.\n\nThat way, mom still has some free time, the kids still spend some time together, and they all also get the space they were looking for when they want it. And yeah, no one's perfectly happy with that plan, but this is your family. You make compromises.",
              "id": 183,
              "comments": [
                {
                  "score": 14,
                  "content": "This is seriously the best solution for everyone to be happy. /u/momasshole this might be the best answer, especially with the points your family brought up with being able to have special bonding time with your kids. \n\nThey're at an age where they might even start wanting to help with the planning so you can all do fun stuff!  (Plus what 10 year old wouldn't LOVE to have a hotel room to themselves for a couple hours and watch a movie with a bunch of snacks like a grown up while mom checks out a cool cocktail bar around the corner?)\n\nYou have a huge opportunity to instill your love of travel in them to broaden their horizons, or support their existing love of learning about other walks of life.",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "honestly, yes that seems great too.",
                  "id": 185,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yes! Looks like I stopped scrolling two comments too early as I basically replied with the same thing.",
                  "id": 186,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I agree. I don’t think it would be a good idea to let the siblings never spend weekends together. The 4 week solution you’ve suggested is a wise one.",
                  "id": 187,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 97,
              "content": "I don't think most of the people continue to read that far down, but I agree too. Obviously kids want time away from each other as well, they're trying to become individuals. Seems like a lot commentors have forgotten what becoming a teenager and puberty was like, which is what everyone has to do in their lifetime. If they have discussed this as a family, whom here is important enough to say what they do or don't do as a family. It's not like the op is asking everyone if anyone wants to buy her kids from her on the black market because she doesn't want them at all anymore. Or implying the kids are like a dog that can be dropped off at the shelter.",
              "id": 188,
              "comments": [
                {
                  "score": 78,
                  "content": "If the parents weren’t divorced, the kids wouldn’t get time away from each other anyway. Just like how if they weren’t divorced, the parents wouldn’t get any “off weekends” from being a parent.",
                  "id": 189,
                  "comments": [
                    {
                      "score": 22,
                      "content": "[deleted]",
                      "id": 190,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "I disagree with that first part. I think it would be easier to spend time apart if the parents were still together. I say this because of the difference mentality the parents would have. When your kids are with you 24/7, its easier to just take one kid somewhere without upsetting the other too much (depending on what it is) but when they parents split up, it is harder to do 1 on 1 stuff with 1 child without the other feeling excluded. The only way to fix this would be to have one child spend time with friends while the other hangs out 1 on 1 with the parent. It becomes more complicated. The only way to fix this would be to split up the children between divorced parents every now and then.",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Alternatively, they could split the difference. There are four weekends in a month. If they each have one where they have both kids, one where they have neither, and the other two alternate which kid is with each parent. Then both parents still get one weekend a month that is free, the kids get two weekends a month apart with one-on-one time with each parent.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I’d argue they want to stop moving around. Constantly goin back and forth really does suck.",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 108,
          "content": "Yes! The kids definitely want time apart, like OP mentioned, but I don't think many people realize how hard this kind of schedule is on the kids. Even if they didn't say it, I'm sure these kids would love more consistency and the ability to stay in one place longer than three days.\n\nMy parents split time with me and my sister up like so:  Every other weekend and all Wednesdays we were with my dad, so we moved for one fucking day and every other weekend. And we hated it!! Having to pack up and move that often sucks, and that's LESS moving than what OP's kids are doing. They have a right to try and work out a schedule that works better for them.",
          "id": 194,
          "comments": [
            {
              "score": 13,
              "content": ">Even if they didn't say it, I'm sure these kids would love more consistency and the ability to stay in one place longer than three days.\n\nThis is a really good point. They're not toddlers anymore, why are they moving back and forth so often still?",
              "id": 195,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yep these kind of schedules suck.  When my parents first got divorced they tried to do a schedule similar to what OP has and I straight up told them \"I'm not doing that\".  Thankfully they listened to me and let my sister and I change our schedules to what we wanted.  About a year later my mom had to move to another state for work so we only lived with her on holidays and honestly 85% of the time I preferred that to the schedule we had when I got to see her more.  Having to move constantly is really stressful and I really wish more parents took that into account when determining custody arrangements.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 87,
          "content": "I know a lot of people who let their kids guide custody arrangements. Like they waited until the kids asked for one week on, one week off before they changed whatever they were doing. The kids asking for this is huge and the parents should really try it out",
          "id": 197,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2086,
      "content": "I'm sorry YTA. I get it, I've got kids and free time without them is awesome. But you don't get to prioritise your free time over theirs. When your kids are 15+ youll have all the free time you want, they won't want to hang out with you, they can be left home alone etc. But now, when they're still young but old enough to be social with you, you should be including them and enjoying or at least trying to enjoy the time you have with them. If you think they can't tell what a burden they are to you, you're mistaken. Please show your children with your actions that they are the most important people in the world to you.",
      "id": 198,
      "comments": [
        {
          "score": 555,
          "content": "Frankly, my mom and I had a ball doing slightly “grown up” stuff like city shopping trips and spin classes together when I was the age her kids are. I feel like kids that age don’t require such super kid-centric activities as younger kids do. It’s not like her weekends will be all Baby Shark and toys that go bleep-bloop.",
          "id": 199,
          "comments": [
            {
              "score": 207,
              "content": "The memory of my mom that I treasure most from growing up is when my mom let me spend the whole day with her, just us two. I had two younger brothers and she was pregnant with my sister, I never got alone time with either of my parents. She let me run errands with her and she took me to a little ice cream shop and we ate ice cream at a little table on the sidewalk in front of the store. She told me that she wanted me to have just a day with me and her because once my sister came things would be different. It's the best and my fondest memory of her. If I had been told that she didnt want alone time with me because she wanted her weekends to herself, I would have been devastated. Kids are perceptive and their feelings matter. Sounds like their dad actually wants to spend the time with them.",
              "id": 200,
              "comments": [
                {
                  "score": 27,
                  "content": "Part of the reason I cut out my dad last Christmas, I'm 32. \n\nDivorced parents when I was 2, every other weekend. I felt like a burden even at a young age. \n\nIn my 20s I really tried to form a relationship with him. He is not a bad man, just.....I don't know. I feel it shouldn't be the child's job to form a relationship with parent. Yet, I tried. \n\nAfter the last straw of \"you can come over if you stop disprespecting my partner\", which I had never done. I threw in the towel. Hurts, but is emotionally better. \n\nOP, fuck your weekends. Be there for your kids, please. I was I had been afforded that, you seem like you are on his path.",
                  "id": 201,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I relate. My parents divorced when I was really young, and my dad moved away with his new partner and kids, and as time passed, he made less and less of an effort to stay in touch.\n\nWhen I was 18 and moved away to college, I explained my situation to a close friend and she told me to reach out and try to build a relationship, because \"he's your dad\". So I tried to give him another chance and reconnect. Though he'd respond sometimes, I was always the one keeping things going. So I gave up. He should be trying to stay in touch with ME.",
                      "id": 202,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "[deleted]",
                  "id": 203,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Ahhhhh! My mom held me out of school on the release days of the Harry Potter. Somehow she also managed to get the authority to have my best friend out too. She’d get up super early to get us each a copy of the book, and we’d sit in the living room reading and occasionally checking in on how far the other two had gotten. It was amazing.",
                      "id": 204,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Totally. And weekend trips? She can do that *with* her kids! One of my most cherished childhood memories is the weekend I spent with my mom, just me and her, in NYC, when I was 11.",
              "id": 205,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Seriously this is prime weird kid age. Take the daughter on the NYC trip and just fool around with makeup, jewelry, and clothes (carefully, don’t break shit obviously). Get your nails done in some wacky design.\nIt really sounds like OP doesn’t enjoy time with her kids (negatively associated with responsibility) and is a bit dismissive of moms who do.",
              "id": 206,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": ">But now, when they're still young but old enough to be social with you, you should be including them and enjoying or at least trying to enjoy the time you have with them.\n\nEspecially considering they likely don't get any quality time during the week. OP's only opportunity for quality time is every other weekend right now, and her attention is split between the two.",
          "id": 207,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2001,
      "content": "YTA You literally KNOW why this would be good for them, they WANT this change, and you don't care because 'muh trips'. Selfish.",
      "id": 208,
      "comments": [
        {
          "score": 400,
          "content": "Those poor kids. Imagine growing up with a mom like this?",
          "id": 209,
          "comments": [
            {
              "score": 158,
              "content": "[removed]",
              "id": 210,
              "comments": [
                {
                  "score": 20,
                  "content": "Ditto, my friend. Both parents separately gave me up. Mum to my dad and then dad to foster care. My dad apologised and has since spent many years showing me the sincerity of his apology and has been making up for the lost time - whereas my mum hasn't bothered. No apology, no remorse, just too bothered about her own life and moving on with it. \nMy relationship with my dad is stronger than ever, but I'll probably never have a bond with that woman.",
                  "id": 211,
                  "comments": [
                    {
                      "score": 5,
                      "content": "[deleted]",
                      "id": 212,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Same, haven't talked to her in 10 years. Have zero desire to. For all I know she's dead.",
                  "id": 213,
                  "comments": [
                    {
                      "score": 4,
                      "content": "That’s probably the right choice. Spacer’s Choice.",
                      "id": 214,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Makes me wonder who might have caused the divorce 🤔",
              "id": 215,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "My stepkids mom is this way. Uses the kids as her personal benefit bank and shows up when she feels like she's been away too long and her mental and emotional influence over them is waning. She sucks and should not have been a mom but she did, 5 times.  Luckily some of the older ones see it for what it is but the younger one has pretty much never been raised by her and my oldest stepdaughter is turning into a spitting image of her manipulative, egocentric, selfish narcissist mother and it makes me sad.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 180,
          "content": "I feel like I like my dog more than OP likes her kids. I can’t wait to get home to be with him after work. I couldn’t even imagine having to split time if me and his “dad” lol ever split up.",
          "id": 217,
          "comments": [
            {
              "score": 4,
              "content": "I agree. It's hard to get through a work day without him.",
              "id": 218,
              "comments": [
                {
                  "score": 3,
                  "content": "I tell him I go to work so we have a house to live in lol.",
                  "id": 219,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 80,
          "content": "It's not even \"muh trips\" but \"but I have to bother with scheduling them ahead of time with the ex and I dun wanna.\"",
          "id": 220,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 67,
          "content": "[deleted]",
          "id": 221,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "“Muh trips” exactly. OP is an asshole and very selfish. The sentence where she said her ex husband would help her out by taking both kids if she had a trip, but that she didn’t want to consider his schedule when planning “her trips” just screamed selfish. Pisses me off and I’m not even involved.",
          "id": 222,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "Exactly. It's not just that either, it's the fact that she thinks coordinating with her ex would make her fun little trips \"less spontaneous\". Everyone's accommodating her and being incredibly considerate and she still wants to have her cake and eat it too at everyone's expense. Posts like these make me think that half of the posts on this sub have to be fake. It feels like someone posted this unreasonable scenario just so people would have a heated debate about it.",
          "id": 223,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "I can't stop laughing at \"muh trips\" lol lol lol I keep picturing a mama June type person saying it and it's hilarious to me 🤣🤣🤣🤣",
          "id": 224,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1579,
      "content": "NAH for *wanting* to keep the schedule as is, but you would be TA if you refused to make some revisions to give the kids 1:1 time with each parent or compromise at all because putting your desires ahead of everyone else's would be selfishness. Like why not suggest that the kids do two weekends apart and then two weekends together (m-d, d-m, m-m, d-d)? Then you would still have one free weekend and they would get the time they need. Find a new balance.",
      "id": 225,
      "comments": [
        {
          "score": 492,
          "content": "I’m glad someone else suggested this. \n\nLiving in a one parent household is hard. It’s not comparable to being a parent in a two parent household (and I am one). \n\nA degree of self-sacrifice is necessary, but being a good mom does not mean giving up entirely on yourself at the expense of others (although lots of people will tell you that it does.) \n\nFind a compromise that is somewhere between losing all your weekends and accommodating your kids desire for time apart/alone time with each of you\n\n(Edited to change single parent to “living in a one parent household”. I wasn’t suggesting she was single parenting without help, the whole basis of her story involves coparenting, but TIL independent coparents should not be called single parents. Outside of using the wrong language, I stand by my opinion.)",
          "id": 226,
          "comments": [
            {
              "score": 276,
              "content": "i feel like everyone in this thread that went full YTA is not a single parent.  it's a different ballgame.  The single parent has to consider a life single, alone. there needs to be free time to find another partner, for example.\n\nmy good friend is a single mom and she had a few weekend here and there, and she had to learn how to be an actual single, free person, and now with that time she's picking herself up and beginning to think about dating...  so she'll be a better mom overall in the longrun.",
              "id": 227,
              "comments": [
                {
                  "score": 68,
                  "content": "She's had five years of every other weekend, though. That's so many chances to do her activities and go on her trips, and now rather than work with her kids she wants to hold on to that. She needs to remember that her kids won't be this age for long, in a few years they'll be out of the house and gone. They may not even want to do this schedule for long, who knows.",
                  "id": 228,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yes! I feel like a lot of the posts here are crabs in a bucket - just because she had 5 years of rotating kid free weekends already she doesn't deserve to have any more? Parents are people too, and while every parent is going to try and put their kids first it isn't selfish to want to also have a life and to be able to keep being more than just a parent. It's not selfish of her to want to continue doing the rotation where she OCCASIONALLY has the weekend away from them. It's like people think she's expecting zero weekends with them and that's not the case, it flips weekly. She doesn't want to lose EVERY weekend she has free - that doesn't make her an asshole.\n\nIt WOULD be selfish of her to deny her children the one on one time with her they're asking for, but there are more options here than just splitting them up every single weekend (where are all the people exclaiming about siblings bonding if they are never together on weekends?). A rotating schedule the way the poster above suggested sounds perfect, provides 1-1 time with both parents and still gives each 1 free weekend a month. ^",
              "id": 229,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I think part of it is that she found a good routine, especially with a high stress demanding job. The idea of switching it all up is going to feel daunting af. The kids want time apart but shouldn't be dictating their parents schedules over it.",
              "id": 230,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 56,
          "content": "I think this is a good compromise.  It would be weird if the kids spent every weekend apart (unless I misunderstood)",
          "id": 231,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "I like this idea. Too many people give themselves up entirely for their children and it doesn't make them a better parent. \n\nRefusing would maker her TA but the fact that she's been able to make time for herself and is happy with the current schedule, doesn't make her an AH.",
          "id": 232,
          "comments": [
            {
              "score": 9,
              "content": "I am honestly surprised how many people said YTA when there is easily room to work with here. I completely disagree with this idea that parents lose any right to their own time because they have kids. This is how mid-life crisis happen. \n\nOP, you are only the asshole if you say no and refuse to figure something out with the rest of the family. It’s okay to want some you-time, but you do have to fully listen to and appreciate where your kids are coming from.",
              "id": 233,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Finally someone with sense and isn’t on some internet power trip of judgement.",
          "id": 234,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I love this idea! I am married but once a month my parents BEG to keep my son for the weekend and that one weekend a month where husband and I can either be together kid free or do stuff alone is amazing for recharging. It’s absolutely a luxury that we have family helping like that but I totally understand the value of being alone as a parent. However, I do think growing up my brother and I could’ve had a better relationship if we’d had a little time apart sometimes, and I absolutely loved the time I got one on one attention with my parents. This seems like a really solid compromise to me. Yes, OP would have to give up the spontaneity she loves, but she’d still have guaranteed alone time and so would dad. He sounds like a great parent too, and I’d bet having one weekend a month each would feel fair and refreshing to both of them after the initial adjustment period.",
          "id": 235,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Thank you for this perspective. The want is NAH.\nIt’s the execution of the situation that changes if it’s TA \nThis solution gives the kids what they are asking for as well as giving Mom and Dad a breather weekend. Everyone compromises but everyone gets the benefit.",
          "id": 236,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yeah, this was my thought too and I could not have put it better. \n\nA 4 week rotation sounds like a **better** solution than just alternating weekends, too. There are things you'll want to do as a trio that you can't during the week. Both parents get one weekend off each month or so, and the kids don't miss out on doing things together. It's a win all round.",
          "id": 237,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "THIS!\n\nBeing a parent means compromise, not complete and utter self-sacrifice! Seriously (to all the instant asshole comments), you're supposed to be there for your kids, but never to the point of erasing your own needs completely, that's not gonna help anyone in the family.\n\n&#x200B;\n\n(edit: removed the y-t-a, and added NTA )",
          "id": 238,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "It's unfortunate that I had to scroll so far for this. I don't think anyone is an asshole here. And as odd as it might sound, it's not selfish to take care of yourself. Parents need time to themselves and need to be able to put themselves first. \n\nIt's hard to express nuance online... especially on Reddit this \"bastion of enlightenment\". \n\nI had a two parent household and both of my parents would do things without us kids. Everytime they did, I felt like they came back energized and happy to see us! As an adult I can see why it was so important to them.\n\nWorking as an or nurse and raising kids by \"herself\" obviously makes her relish the time she gets to herself. I think your solution is a great middle ground and she doesn't have to seem like an \"asshole\" to anyone.",
          "id": 239,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "This is a great compromise.\n\nTime \"no free time tll your kids are 20\" gang can chill out.\n\nYour kids won't feel neglected or unwanted if you do it right. They're old enough to talk to rationally.",
          "id": 240,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 941,
      "content": "100% YTA. You chose to have kids and wether you want to give up your weekends or not, that’s what being a good parent is about. Involve your kids and appreciate that they actually want to be involved in your life.",
      "id": 241,
      "comments": [
        {
          "score": 136,
          "content": "She could easily include her kids in her plans but doesn't want to.",
          "id": 242,
          "comments": [
            {
              "score": 25,
              "content": "honestly that's why I was thinking she left out something like \"I want to go out with a date on long trips\"",
              "id": 243,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Kids also sometimes have plans on weekends, and them being 10 and 12, itll happen more and more. She just likes being a part time parent",
              "id": 244,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 817,
      "content": "YTA. Your sister is right, this is a privilege that you have, not a right - and your kids should come first. If you were still married this wouldn’t even be an option for you. You’re just going to have to plan in advance and take your kids into consideration like most parents have to. Your kids won’t be this age forever and you don’t know how long the split weekends will last so just go with it, eventually you will get your free time back. This is what you signed up for when you had kids.",
      "id": 245,
      "comments": [
        {
          "score": 188,
          "content": "This is soooo spot on! It is a privilege she’s had for 5 years but it is not necessarily a “right” she has. I’m all for mom’s having their own lives and what not and it sounds like everyone involved is committed to ensuring she still has time to herself when she wants. I feel like her reasoning boils down  to “I don’t feel like it”",
          "id": 246,
          "comments": [
            {
              "score": 66,
              "content": "I’m just like really, you want to say no to your kids for your “activities” and “spontaneous day trips”? Like I get it, I wouldn’t want to give that up either. But I would because kids should come first and in a few years they’re going to be out of the house entirely. Op is putting herself before a completely reasonable request from her kids.",
              "id": 247,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}