{
  "post content": "My 12-year old niece is really into arts and crafts, and recently got into crocheting. Before Christmas, she told me that she had a surprise gift for me, and seemed really excited about it. I told her I was really looking forward to it as well, and prepared her gift myself (which was actually art supplies). \n\n\nOn Christmas when we had our family gathering, she brought me her gift, and was super excited for me to open it. When I opened it, I saw a crocheted animal, but if I'm being honest, it looked REALLY REALLY bad. To give you an idea of what it looked like, imagine something from r/badtaxidermy but in crochet form. I couldn't help but burst out laughing, and I couldn't stop laughing no matter how hard I tried to suppress it, so I had to excuse myself to go to the washroom, where I locked myself for nearly 10 minutes. \n\nWhen I came out, my niece was in tears with her parents trying to console her, and I apologized profusely and told her that I really liked her gift, but she kept crying and shouted at me, calling me a liar and that she sucked at art. \n\nMy niece avoided me for the vast majority of the party after that. I tried to make her feel better by displaying her gift on my living room cabinet, but my wife pulled me aside later in the day and told me to take it down after the party because it was in her words, \"really ugly\" and made her uncomfortable.\n\n\nSurprisingly, all the adults was very understanding of my situation, but I feel really bad because I feel like I destroyed my niece's confidence, and I'm not sure how I can make it up to her.",
  "id": 1,
  "comments": [
    {
      "score": 39225,
      "content": "YTA. She's twelve and she worked really hard on something. Man, it breaks my heart just to think about her getting laughed at. Poor kiddo.\n\nEdit: OP if you see this, I bet there are a ton of us who would love to buy one your niece's crocheted creations if you can get her to start making them again, and help her with an Etsy shop. I'll buy the first one.\n\nEdit 2: Really wasn't expecting this to be the top comment. And a lot of people have rightfully suggested that maybe the next best step isn't the niece selling her creations on the internet. Point taken. But I'd still totally buy one of these crocheted animals, so hopefully someday I can.",
      "id": 2,
      "comments": [
        {
          "score": 13567,
          "content": "Oh man, this hurts. \n\nI was that kid and later that teen. I didn't have money for gifts so made my own....cooking, sushi making, sewing,  painting...\n\nI'm 42 and can still hear the mean comments/rude remarks/laughing. I honestly quit most hobbies from 20s til my 30s when my boyfriend (now husband) started supporting and loving me.",
          "id": 3,
          "comments": [
            {
              "score": 2524,
              "content": "I felt this hard. This was me too.",
              "id": 4,
              "comments": [
                {
                  "score": 1860,
                  "content": "Family really sucks sometimes",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1345,
                      "content": "They do. Which is why it is perfectly ok for adults to choose not to spend time with them, and to choose to spend time with better people who treat them right. The \"because they are family\" is nonsense. Enabling the behavior just encourages it.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 212,
                      "content": "Hard yup.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 43,
                      "content": "Agreed.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I wanted to be a writer. Used to love writing short stories and poetry. But my grammar wasn't the best so my parents kept telling me I could never be a writer. So I never wrote again. I am now, 30+ and I am not a writer.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "I actually have a good story about making things and family. I was 9 when I got my mom to teach me to embroider and crochet. I embroidered MOM on a piece cut off from an old towel and crocheted an edge on it. It was a hideous little doily thing that didn’t come out as I had envisioned. I gave it to her on Mother’s Day and said I was sorry it wasn’t very good. Bless her heart! She said she thought it was lovely . She kept on her bedroom dresser. I’ve been crafting ever since.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1461,
              "content": "This!  \n\nI always lived crafting but was always told how \"bad\" or \"tacky\" homemade things are.  I took up crocheting as an adult and my husband would say the same things to me.  Until my kids jumped him - they love crocheted blankets/afghans.  They were constantly asking for a new blanket for themselves and their friends.  Now he doesn't say a thing about it",
              "id": 11,
              "comments": [
                {
                  "score": 1183,
                  "content": "My secret Santa gifted me a crocheted scarf a couple years ago, and someone at work stole it and I'm still so mad about it.\n\nI personally LOVE homemade gifts, because it shows so much effort and happiness that someone put into it.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 707,
                      "content": "If you're comfortable with it pm me your favorite color,  the length and width you like for scarfs,  and address. I usually make scarfs to donate every year but haven't been able to do it yet this season.  :)",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "I'll happily make you a new one and ship it to you!!!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 433,
                  "content": "Omg! I LOVE homemade gifts! Knowing that someone put the time and effort in to making something for me is THE BEST. \nI took up knitting for a short time and made someone a scarf because he had just had neck surgery. It was the first one I’d ever made. There were so many mistakes but he LOVED it. He still wears it and it’s been well over 5 years since I made it for him. \nI also made one for my now ex husband. I worked really hard on it and it looked amazing. He refused to wear it because I purled when I should have knit….ONE STITCH. Never made him anything again. \nAlso I LOVE afghans. My grandma made me one and it was so nice to know she put that effort in for me.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 342,
                      "content": "Not wearing a handmade scarf because of a single misplaced purl? **Not Knit Worthy!**",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "When I was in early sobriety, I lived in a halfway house. The Methodist ladies who sort of adopted us made by us quilts for Christmas. These quilts were unusual. The squares were all cut from polyester pantsuits. You could tell from the wild assortments of colors and prints, they were vintage 70s era pantsuits. I put my quilt on my bunk right away. It stayed there and eventually went with me when I moved out. Although I no longer keep the quilt on my bed, I still have the quilt along with 25 years of sobriety.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Sounds awfully knit picky to me………",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "You know, master Persian rug weavers often include a mistake in their work because only God is perfect. So you were properly honoring your craft.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "My sister made me an afghan on her knitting machine. When she gave it to me she admitted to several \"glaring errors\" in the pattern. I do hand knitting and have never been able to find a single mistake. I still love it especially to cuddle up when I am sick, and I still keep looking! I love handmade gifts, especially knowing how much time goes into them. YTA- a soft chuckle is one thing, but laughing so hard you had to leave the room is cruel.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Your experience with your ex reminds me of mine with my dad. I'd draw or make something and gift it to him and the only responses I ever got were \"hmm\" or \"you're going to have to do better than that if you ever want to succeed\". What would hurt the worst is that some of the things I would create would be made with his encouragement, he'd give me books and other info on a subject I was interested in. Then when I had created something with my newfound knowledge I'd get the responses above. Like, why even bother trying to get your kid interested in something if you were going to shit on all their efforts? \n\nMy ex was similar as well, I guess I learned to accept that behavior from people. Eventually it killed my creativity completely. It took a long time for me to get back to the point where I wanted to try again.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Hand made afghans are the best. I got into a [really pretty mandala square](https://imgur.com/a/B59irpm) that makes [a really pretty blanket](https://imgur.com/a/jzlfcIN). I've made 5 of them in different colors and have been getting requests from almost everyone I know.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 98,
                  "content": "sorry ur husband sucks. hope your crocheting is going well! i crochet too and i love it.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I teach art classes to adults and it's heartbreaking how many people come in with their confidence in their ability to make something just wildly low. Unless you're there for professional training then the expectation of making something \"pretty\" is out the window, it's just supposed to be fun and engaging! Did you learn something? Did you enjoy the process? Did it make your hands dirty and lift your spirits? Then mission accomplished. Bonus points if you like how it turned out, but that's not really the main point of making things.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Man it sounds like your husband is maturing in reverse. I had no idea when I was a kid how much I would grow up to appreciate things like a crocheted blanket.  My mom has some that were given to her as wedding gifts or baby gifts that we always had as kids and I just thought of as any other blanket, but now when I go to her house and look at them I marvel over how much effort went into them and how long they’ve lasted and how so much more special they are because someone she knew took the time to make them.  \n\nI sincerely couldn’t imagine belittling that as an adult, I couldn’t make a blanket if my life depended on it!",
                  "id": 25,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I still have the blanket my grandmother crocheted for me when I was a baby. It is a cherished item now that she has passed. The same for the two blankets my husband's grandmother made us as wedding presents. I took up crocheting after my grandmother passed as a way to connect with her. She taught me the basics as a child, but I never kept up with it. Now, I think she would be proud of the projects I've made.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "My mom made me one for Christmas! It’s granny squares in pink, sage, blues, yellows, and purples. I admit at first I was disappointed because it’s the only present I got for Christmas this year but that only lasted a few minutes. I thought about how in 20 years, when she’s either no longer here or no longer making them, how much it’s going to mean. I still use the afghan her grandma made for me as a very small child. I think of her every winter I get it out",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Those are some quality kids there!",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I love handmade things. I can buy my own crap from Target. I can't buy a hat that Jill knitted just for me.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I’m sorry you were told those aren’t cool gifts. Crocheting is a talent and I love getting crocheted things. When I had my baby shower I asked that everyone bring a handmade gift instead of spending money (as we were fortunate to have what we needed already). I said I didn’t care if it was food, art, sewing, crochet, whatever, just something from their own heart and hands. \n\nWe got so many amazingly beautiful things, and I can’t tell you how many people later commented that they’d been told what you were and led to think their talents were useless. \n\nPeople are awful sometimes. Nobody should ever be shut down when they’re making what they enjoy making.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I crochet too and I'll never forget being excited one of my close guy friends was going to be a dad. I had started on a big baby blanket as soon as I heard the news and a few weeks later I told him that I was working on it (making it in his wife's favorite colors) and he rolled his eyes and said 'joy a another damn blanket'. That blanket is still in the back of my craft closet unfinished and the kid just turned 15.\n\nWhy is it so damn hard to appreciate handmade gifts? I hope OP feels like a huge ass and his wife is no better.\n\nEdit to add YTA",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I feel like crochet and knitting got a bad rap from all the absolutely horrible yarn that people used to use. Pre-2000’s, the only yarn that they sold at big box stores and the like was super cheap/scratchy and came in the most awful, garish colors. So if your grandma made you a sweater with yarn from Walmart, it was going to be fire truck red and itch so bad you would get a rash.\n\n\nWe went through a yarn renaissance in the early 2000’s, and now you’ve got people hand painting yarn that they’ve spun from the fibers they harvested on their yak farm on Etsy. Granted, some people are just really bad with picking colors, so homemade stuff can still end up ugly; but now you’re less likely to end up with acrylic so scratchy that you’re driven insane within thirty minutes of putting it on.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 813,
              "content": "Who are these people that laugh in the face of children/teens and their homemade gifts?? \n\nSeriously I don't understand it. My family is FAR from perfect but I can't imagine anyone doing that to a kid. I'm sorry that you experienced that.",
              "id": 33,
              "comments": [
                {
                  "score": 514,
                  "content": "My sister is developmentally disabled and she gives handmade gifts. They aren't good and she's in her 40s, nobody laughs and we all give her a lot of encouragement. She's learning crochet, and she gets books and stuff for Christmas. This is a child, and some jerk can't keep composure? Ridiculous.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 218,
                      "content": "I have about 10 scarves knitted by a disabled aunt. They aren't the right size or weight, and they aren't made with skill, but they are made with love. They show she remembers us and is thinking of us. None of us would dream of laughing at her or them. What kind of a creep laughs at a child for 10 solid minutes?",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 279,
                  "content": "Right. I was 10 when I learned how to crochet and did other things similar before that. One year I got a kit to make swans out of beads and styrofoam and gave it to my grandma. Those swans sat in her china cabinet as long as I can remember.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Bless your beautiful granny!",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "My granny kept the tiny,  misshapen, badly stitched pillow that was my first attempt at her teaching me to sew at 8 years old on a shelf in her kitchen until she died. I ran across it months later and sobbed like a mess clutching that dusty faded thing like a lifeline.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I learned crochet at about the same age and somehow accidentally ended up making a rat that looked a lot like the one my 4th grade teacher drew as her signature. I gave it to her as a gift and she kept it in her classroom until she retired. I was either in high school or had recently graduated at that time and at the retirement open house that the school hosted, she was excited to tell me about how she still had it. At age 10 it was awesome that she loved it so much. As a teenager/young adult, it was really interesting and meaningful to learn that she had kept it on display in her classroom for at least 7 or 8 years. \n\nI love that you are getting your swans back and can have all the memories associated with them live on whenever you see them!",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 57,
                  "content": "Oh, that would be my family.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Mine too\n That or the eww face and a drop on the floor",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "Ugh, I hear you. When I was a kid my mother *begged* me to draw a certain landscape for her. I was gifted a set of charcoal pencils and drew one. She gave it to my aunt. (To my aunt's credit, she hung it in her house for *years*.) Some people enjoy hurting kid's feelings.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "For real. One of my favorite wedding gifts was handmade by my 12-yo cousin. It was a little plastic “dish” in the wedding colors with a little heart design in the base. Yes it was a bit “tacky”, yes it was definitely wonky and mis-shaped, yes her mom basically *apologized* for it…but I absolutely adore it because of the time, the care, and the effort she went to to make a gift that was entirely personal and unique.\n\nLPT for handcrafters: Choose very carefully who you make gifts for. If they don’t appreciate the mental and physical labor involved, then you’re throwing your metaphorical pearls before swine.\n\nThis poor kid. I sincerely hope she keeps crafting her “bad taxidermy” toy designs…there’s an actual market for that and people out here, like myself, who will love and appreciate them.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I have three grown daughters and three young grandsons. Homemade presents were always preferred by me over anything bought. I don’t understand OP at all.",
                  "id": 44,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "One year my mum spat wine in my eyes then cackled",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I gave one of my brothers a home made pair of binoculars that were made out of toilet rolls as a gift (it was our thing lol) every year for like 6 Years for both birthdays and Christmas. He had a little collection and genuinely looked after them and had a big smile everytime I gave him his gift. I was young, he understood and usually he was an ah lol. If a teenage boy can have some compassion adults can.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yesterday, I drank tea out of a hand painted cup my eldest gave me when she was 7. Objectively, it is not a work of art. But I treasure it because of the love put into the gift.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 638,
              "content": "I guarantee, in a few years, he'll be back on reddit posting how his \"talented\" little cousin didn't make a blanket for his kid like she had for everyone else's baby and how his wife feels like their child is being \"excluded\" by his extended family... 🙄\n\nOP and his wife are both stark raving YTAs. Sheesh. With family like that, who needs bullies?",
              "id": 48,
              "comments": [
                {
                  "score": 59,
                  "content": "Oh no kidding.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I really want to give him room to grow and change, but dangit, you're likely right.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "His wife almost makes me even angrier. What a couple of shit-heels.",
                  "id": 51,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "You would be surprised at how many people fall under the psychopathy spectrum.",
                  "id": 52,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 366,
              "content": "I took up crochet a few years ago and I made little animals for friends and family. I recently saw one of my first efforts again. I remember being super proud of it, but now I was surprised at how many mistakes I could see. But you know where I saw it? In the keepsake cabinet at my parent's house. \n\nI was in my 20s when I made it and can't imagine how hurt I would have been if it had been laughed at. At 12? That's the kind of thing that puts kids off the hobby.",
              "id": 53,
              "comments": [
                {
                  "score": 263,
                  "content": "I’m a potter and years ago when I was starting out I gifted my dad a mug. It was super heavy and clunky but he uses it every day. It’s his favourite mug. My sister picked up knitting and gifted us all scarves which we still wear. When someone gives you something handmade they’re not only giving you a handmade item they’re gifting you the time and thought that went into making it.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 257,
                      "content": "One of the most heartwarming moments I've experienced as a potter was when I gave my uncle (who enjoys miniatures) a little boat to add to his reptile enclosure. He hugged me and said \"yer a lizard ferry potter\"",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "That's why I don't buy the \"I couldn't stop laughing\" bit. Either OP is truly a cold-hearted asshole of the lowest order, or all they would have had to do was look at the face of the *CHILD* that made the gift. You know her expression just shattered when an adult she cared so much about laughed *at* her, to her face. If you can laugh at that, just chuck in the towel, because you are a shit person. \n\nAlso, what kind of mushy toadstool can't figure out how to channel laghter into something a kid will buy? Laugh > exclamation, \"Ha! Wow, I knew you were excited to give this to me, but I didn't know you were putting this much work into it!\" Fucking *something.* Wife is also awful, it can't sit on the fucking shelf for a day as damage control? WTAF.\n\nP.S. Glad your family is better at recognizing the purpose of gifts than OP.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "My son made an animal mug at a holiday pottery class when he was 11 - you can't drink out of it because a giraffe's head pokes you in the eye - but it's a great toothbrush holder and sits proudly in our bathroom.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "My granddad has a present of a mug from me when I was about 3. I'm 19 and he has drank his morning coffee out of it every day ever since he got it 🥹 my mum also has many clay things that my sister and I made as kids on the windowledges in her bedroom and a box with the stuff we made in nursery still",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 218,
                  "content": "I think I saw one of my favorite quotes on AITA (or similar) which was 'The axe forgets, but the tree remembers.\"\n\nFits perfectly here.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 14,
                      "content": "How painfully true an expression.  \nSimilar to Maya Angelou in regards to someone not recalling precisely what you said or did but remembering exactly how you made them feel at that moment.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 110,
              "content": "Same here. I was actually never encouraged to do something that I wanted to try out as a kid and my husband loves making models and founded out that I always wanted to do them and learn to paint them with an airbrush and such. Found out that I wanted to do Legos and has gotten me Harry Potter sets to do.",
              "id": 61,
              "comments": [
                {
                  "score": 12,
                  "content": "My grandma & aunt were both very into \"try all art/crafts/etc\". My mom forced us to do stuff (for the fair, things we had ZERO interests in) because it would mean that we MIGHT win best in show, and THAT was something she would brag about...not for us, but for her own personal reasons. So if it was something I was interested in (like painting) then no luck, but she made me make dolls that she picked out the stuff for and I hate dolls, so I hated that hobby.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 11,
                      "content": "That's messed up. My oldest wanted to try wrestling club in kindergarten. Was a bonding time for him and daddy. We asked if he liked it. He said no, but we talked to him and explained that he was a newbie and that the following year he might enjoy it more then. So he did it again in first grade and really liked it more, but it was never for bragging. Win or lose, we cheered and took him out to eat after",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I can hear every mean and hurtful thing my parents ever said or did to me as a kid and I’m 49. This hurt my heart so much for the niece, she was obviously proud of her work and deserved to feel good about her efforts, not be laughed at.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Same. I stopped making anyone anything bc no matter how actually beautiful something came out,  people were still shitty about me not spending a bunch of money. Fuck those ingrates. I make for myself now.",
              "id": 65,
              "comments": [
                {
                  "score": 8,
                  "content": "I did pictures for my aunt, since she loved them. (Photographs, not paintings). They were all over her house, framed with whatever frame she thought best. \n\nMy mom got all hurt because I never did any for her....like yeah, you told me that I was a failure of a daughter for pursuing photography in college and not going to amount to anything.",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Cue threads on AskMen about why don't women have hobbies?",
              "id": 67,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Yep. I got a box of soaps my aunt got me one year because I loved how the one smelled and instantly my mom asks “why did she give you those? It won’t help you smell better.” I was 9 when I got them. It still resonates with me today. I am constantly asking my fiancé if I smell or if he thinks the perfume I’m wearing smells okay. Words and actions- no matter how harmless you THINK they are, can hurt. \n\nOP-YTA.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6322,
          "content": "For over ten minutes straight… holy shit. YTA and so is your wife. \n\nBTW if you actually want to fix this this is what you do. \n\n1. You look up “amigurumi” (which is what she was doing and you find a class or a book that makes something your nice would like. YOU BUY IT. You look at the supplies needed for the project and you make a shopping list. \n\n2. You call your niece (not her parents, her) and you apologize profusely. You tell her you know you behaved rudely and hurt her and that was wrong. Then you tell her that you learnt that making crochet animals is called amigurumi and that you now know it’s actually really challenging. You tell her that you don’t want her to feel discouraged from making art, and that sometimes learning something takes more time…. \n\nThen you tell her that to apologize and show her that this is about learning and practice, you’d like her to teach YOU how to make one. Tell her you bought the book/class and you’d like the two of you to do it together and she’ll be your tutor (because she spray knows the basics). Tell her that it’s only right you experience how hard that animal was for her to make so she knows your apology is sincere. \n\n3. Send the shopping list to niece + parent so they can tell you what niece sissy has and what you’ll need to buy two of. Buy the shipping list. \n\n4. Make a date to work on the project together and actually follow through. \n\nTHAT’S how you sincerely apologize and help her to know she doesn’t suck at art and encourage her to keep going. It’s also how you gets some perspective on what it took for your niece to make what she made.\n\nETA: thank you so much for the awards. Fingers crossed OP sees this and follows through",
          "id": 69,
          "comments": [
            {
              "score": 584,
              "content": "I LOVE this! Do this, OP! Also, YTA.",
              "id": 70,
              "comments": [
                {
                  "score": 252,
                  "content": "[removed]",
                  "id": 71,
                  "comments": [
                    {
                      "score": 117,
                      "content": "Right. At first I thought it was maybe a nervous giggle - followed by a sincere apology and thank you. Ten minutes is cruel :(",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Exactly!",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "OP should take her out after doing this too. Kill her with kindness so she knows you're a fuck up.",
                      "id": 74,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 320,
              "content": "This is so kind and SO well-thought out (and researched!). If I might say, you sound like very good people.\n\nBut of course, OP and his wife have a ways to go.\n\nYTA",
              "id": 75,
              "comments": [
                {
                  "score": 235,
                  "content": "I make amigurumi, I know how hard it can be… and how much time each piece takes. Also I currently really dislike OP so I’m hoping he’s sincere in wanting to fix what he broke.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Amigurumi is so hard. I always follow the pattern as best I can and it still ends up not looking right. It takes a lot of patience and practice. I bet it took OP's poor niece so long to make that.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "My first amigurumi was a penguin. My daughter insisted it was an owl. She was 3 at the time. lol",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "A friend gave me an amigurumi kit and I am fully intimidated by it. Give my my chunky yarn that will hide mistakes!\nEdit: I am well into my 40s and scared of this kit bc of relatives like this OP",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "This is a super rad response and I hope the massive AH /u/supportivehusbandnot will take this advice. \n\nI just reread the post and saw that the little girl screamed that she “sucked at art” and that actually made me feel physical pain in my chest. I’m an artist and it’s the only subject I really gave a shit about in school, and I actually studied in both college & grad school. But luckily there was no one that shit on my soul like OP did. If someone had, my whole life today might be different because I might not have had the confidence to keep going with my creative endeavors.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I would be stoked is someone gifted me amigurumi! Even if it wasn't quite perfect. Those things don't come cheap and I'm not about to try and learn crochet from scratch and work on it enough to get good at it.",
              "id": 81,
              "comments": [
                {
                  "score": 19,
                  "content": "My husband loves to collect up all the ones that suck. He calls it his misfit island collection…",
                  "id": 82,
                  "comments": [
                    {
                      "score": 7,
                      "content": "I have a coworker who makes a few things that she sells for 5 bucks so i give a little tip lol. I have bought some from etsy and at comic con. I don't have a problem paying a crafter because they take time and effort and however long that person worked on their skills. I might need to find some that a a little janky.",
                      "id": 83,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "If I had an award I'd give it. I really hope OP sees this.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "A really great answer!! I crotched myself since about being 12 as well. It's SO hard in the beginning! OP should give it a try and see!",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "The aspect of this awesome reply of yours that hits the best with me is the OP making it themselves to know how hard it is to pull off. After I started making art in my 30's, I had a flash back to helping my son with his 1st gr homework and being critical a of a giraffe he did instead of loving that adorable little scribbly 3 legged giraffe as much as I could and encouraging him to keep doing more.\n Before trying to draw things myself as an adult (and being bad at it) i  had been thinking my criticism would \"help\" him like if he had been doing math and instead it made it a negative experience that he pretty much never wanted to do again. \nAnd all my regret and trying to make up for it by encouraging him later on as a teen didn't make any (positive) difference. It's like \"cat's in the cradle \" song 🥹😥 thankfully he took up music and accomplished things in marching band and symphony that I could never imagine being able to do, so he found something he loved on his own. And hopefully OP will see the wisdom in your advice and will Do It!",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yes! So much this! YTA op, listen to this person, and be better. Also your wife is TA too…you may not have asked, but she is.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This is a much better and kinder response than I was going to leave. OP YTA,  cannot believe how cruel you were to your niece.  I hope you follow the above advice.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Yes OP AND wife are TA",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1554,
          "content": "Seriously, even if it was hideous what kind of adult behaves like this? I’m just shocked at the complete lack of self control. I can understand an initial chuckle but then “oh it’s so cute! Thank you” is not that hard to fake. If you don’t want to lie then “Thank you for working so hard on this for me” is fine.",
          "id": 90,
          "comments": [
            {
              "score": 565,
              "content": "That’s what I was thinking. By the time you’re an adult you should absolutely be able to fake liking a gift. My brother gave me the most hideous watch I’ve ever seen one Xmas, but he’ll never know I hated it because I acted like I loved it. (I have no training but my gift receiving acting skills are amazing apparently.) \n\nGotta go with YTA here, OP. You were unnecessarily cruel to your niece and you’ve probably destroyed whatever confidence she had in her abilities. I’m not sure there’s anything to be done other than you learning to control your outbursts before you hurt someone else.",
              "id": 91,
              "comments": [
                {
                  "score": 15,
                  "content": "Maybe hurting is the goal.",
                  "id": 92,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "I knew it!",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "My aunt has given me hideous shirts before. You just smile and say thank you. If you haven't learned how to gracefully accept a bad present by your teens, something is wrong with you.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My brother once got me an umbrella making kit. And because I am weird and crafty, it was not hard for me to go, \"Oh, this is actually really cool! I use umbrellas all the time. I wonder if you can customise the fabric?\" Only for me to look closer and realise the box was actually a gag box, and you're actually not meant to like it haha. The real gift inside was some console games. So yeah, not hard to appreciate any gift, but in that case it backfired on me XD (not gonna lie though, I still would like to make a cool umbrella - most of the ones you can buy are either really boring or really expensive for anything fun).",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 362,
              "content": "[removed]",
              "id": 96,
              "comments": [
                {
                  "score": 34,
                  "content": "Yes! Sometimes you can’t help laughing at something surprising or funny! But make it a joyful laugh.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Exactly. It's not difficult to cover it up or redirect to something positive.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I would have hugged her while laughing and made up a story about why it made me laugh, and tell her I love it while laughing.\n\nEven if they couldn't control the laughter which is bs, they could have avoided hurting a child",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 114,
              "content": "This is what I was thinking. 10 minutes? I have the awful habit of finding prat falls hilarious and Christ I’ve seen some horror falls before where I KNOW it’s bad, I rush over to help, but I’m still laughing! I apologise but it clears the hell up after like 5 seconds. I think you were just mean and feel bad about it. Which is right.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I cleaned out my elderly dead relative's apartment and found an item I made when I was about 7 in the curio cabinet.  It was ugly, too.  <3",
              "id": 101,
              "comments": [
                {
                  "score": 10,
                  "content": "It was in a prized place, no less! Lovely!",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "I can not stand the \"I couldn't help it\" excuse, it's just a cop out for taking responsibilities for your actions.",
              "id": 103,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "A smile with \"this must have taken you so much time!!! Thank you for making something just for me.\"\n\nOP is a big YTA.",
              "id": 104,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "I used to teach second graders, and they’d give me drawings all the time. Sure, some of the art was hilariously hideous, but that was part of the charm!! Where else am I going to get lopsided, inaccurate crayon portraits of myself? I can’t imagine laughing for 10 minutes in front of the child who gave their own artwork to me",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Yeah like, from my experience (I'm the \"black sheep\" of the family, with \"niche\" interests like cartoons, books, art, writing, video games, etc.) I've had to deal with a LOT of bad gifts. Think really shitty anime related stuff (for shows I don't watch), the cheapest of cheap art supplies (think school supplies, basically, from people who gifted others much nicer and in their wheelhouse kinds of gifts, and there's always the gifts that literally have nothing to do with anything I'm interested in. \n\nAnd yet, I have never once laughed like this at bad gifts. Like first off, you never know what their money situation is AND if it could even vaguely be a homemade gift, you never know if they might have put a lot of effort into it! If you did that in my family, you would have gotten a mouthful for disrespecting the giver, and rightfully so! \n\nI saw another post outlining a way to go about apologizing by engaging and participating in her hobby with her, and I really hope op takes it seriously! YTA op, do better.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1202,
          "content": "Any normal adult knows a kid MADE THEM A GIFT braces for the worst with a smile on their face.\n\nThe fact that it took you over 10 mins to pull it together says a lot about you.\n\nYou tell people their babies are ugly too, don't you?\n\nAbsolutely YTA  \n\n\nETA: thanks for the reward <3",
          "id": 107,
          "comments": [
            {
              "score": 717,
              "content": "Idk, for me when a kid gives me a gift the worse the better. I don't want a perfect item, I want a dinosaur with sloth from the goonies eyes, a crocodile that looks like a penis.",
              "id": 108,
              "comments": [
                {
                  "score": 420,
                  "content": "The thing was probably so ugly it wrapped around to cute again and OP and his wife just suck.",
                  "id": 109,
                  "comments": [
                    {
                      "score": 145,
                      "content": "Yep, she's going to hate those 2 for the rest of their lives.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I know. OP, I want a picture. I love awkward handmade things so much.",
                      "id": 111,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "The actual only horrendous thing in this story were most of the adults in the scene man",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I wanna see a pic of it so badly. It sounds wonderful.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 172,
                  "content": "Right? I mean, if you don't own at least one thing in your \"grab in a fire\" from a small child that you have to tell people \"No, it's a GIRAFFE not an otter\" type deal you're missing out.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 12,
                      "content": "My little cousin once drew me an octopus because it's my favourite animal. Does it look like a tennis ball with eight penises? Yes. Do I still have it framed to this day? Yes. \n\nHe's 30 now. I'm still his favourite lol.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "Exactly. I have a piece of artwork on my wall at work that looks like a child’s interpretation of the girl from the ring. A patient (I’m a doctor) drew it for me during a visit and told me it’s the two of us so I kept it. It’s ugly and vaguely terrifying but she’s 4 and made it for me.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Right? I was in a kindie class recently and a kid drew a picture and proudly handed it to me. Legit looked like Tommy Pickles from Rugrats. It’s now proudly displayed on my fridge with other drawings kids have made me.",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 687,
          "content": "Dude wtf.\nNo.\n\nDo NOT DO NOT send a 12 year old to *post their craft on the INTERNET for MONEY while they are STILL LEARNING*\n\nLike it's sweet that you would wanna get one, without ever having seen what it actually looks like, but I guarantee if you didn't know her age and sad backstory you wouldn't think twice about it.\n\nYou wanna talk about destroyed confidence, god, can you imagine the shitty things anonymous strangers who *for safety reasons will not know her age* would SAY to unprofessional, unpolished, kind of weird looking art for sale.\nNot as a free gift, but to someone expecting money in exchange for it.\n\nNo no no no that is the worst possible idea do not *do* that to a child.\nYou don't post your shit onto the internet until you're ready for the nasty people of the world.\n\nBest case scenario, she just, doesn't sell anything and gets no comments, which doesn't do anything for her confidence. Worst case... well, have you ever worked in customer service.\n\nNot to mention the inherent responsibility of actually filling and sending out any orders that do come in in a reasonable amount of time and just.\n\nThis is fine for an adult or older teen to take that risk, but *twelve*, absolutely not.",
          "id": 118,
          "comments": [
            {
              "score": 283,
              "content": "Not only that but we shouldn't be throwing money at poor craftsmanship just because a sad child made it. She should be encouraged to learn and do better, not be told it's good enough to be pro. Then yeah, everything you said. She'll find out she was a pity princess and that'll mess with her.",
              "id": 119,
              "comments": [
                {
                  "score": 69,
                  "content": "This sub is ridiculous sometimes when it's about art.",
                  "id": 120,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 197,
              "content": "I was dyyyying at this wtf an Etsy shop? No. Such a random and terrible suggestion. You and u/LMGooglyTFY are so right. \n\nOP’s niece can keep practicing and get better or realize it’s not her thing and give up. No reason to pretend she’s some kind of professional.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "I’m so glad I realized I’m not the only one who thought how weird of a suggestion that was.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I had to tell to a 12 years kid to do not open for commissions, not only because they're young and still have a lot of time to practice, but also because entitled customers (or customers that would ask them to draw stuff they wouldn't even dare to) are still there. Let the kids being kids and that means do not earn money from their crafts.",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This. Internet can be a really toxic place. For a professional at this art, sure, try to sell your art online, there is a niche for almost everything. For a 12yo that is just starting? NOPE. It's a bad idea. Only ppl who know her sad backstory would buy and tell how lovely it is. The rest would flood her with bad reviews and ppl who know more about what she does would make a big message telling her how amateur her work is, how she sucks at it and would say that even for free, it still expensive. Selling online when you are a 12yo that just started to learn about something is terrible. This would break her confidence forever. And she would feel even worse that ppl who are buying and saying it's lovely are ppl who feel pity for her.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Agreed,  when I was a kid my friends and I would do things like sell painted rocks to the neighbors for 50 cents or whatever,  people will humor kids in that situation.  But Etsy is full of skilled artists, and people aren't going to buy things just to be nice.",
              "id": 125,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 619,
          "content": "For real, this is the kind of thing that a kid remembers forever. Their spirits are so tender at 12, and it’s so easy to break them. I wouldn’t be surprised if she quits crochet and her relationship with her uncle.",
          "id": 126,
          "comments": [
            {
              "score": 257,
              "content": "Yeah. I think he ruined his relationship with her and there is nothing you can do. It was cruel and your wife’s comment was not necessary. I hope someone in her life is building her up because this can be devastating to a young person.",
              "id": 127,
              "comments": [
                {
                  "score": 87,
                  "content": "Op and his wife are made for each other.",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "She will NEVER feel the same way about him or his wife...and will rightly never bother doing something special for them again.\n\nMy heart breaks for her.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I agree. And the fact that his family didn’t think he did anything wrong. I mean really? I hope she doesn’t do anything for him. He doesn’t appreciate it or deserve it.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "I hope someone sends her some \"knitworthy\" memes so she sticks with it.",
              "id": 131,
              "comments": [
                {
                  "score": 7,
                  "content": "That's the first thing I thought of.  OP is not knitworthy.",
                  "id": 132,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 444,
          "content": "Ever seen Inside Out? You just created a core memory. Hopefully she has someone in her life to help undo the damage you did.",
          "id": 133,
          "comments": [
            {
              "score": 78,
              "content": "Omg yes!! Beautiful comparison. Heartbreaking 🥹",
              "id": 134,
              "comments": [
                {
                  "score": 8,
                  "content": "I still think at least once a week about the time my mom, in a raging fit, tore all my drawings I'd made for her from our homeschooling bulletin board, tore and crumpled them, and trashed them, saying they were just there to take up space. I never drew much after that. I was around 10, and I'm now in my MID THIRTIES. Core memory indeed.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "When my daughter was about 4-5, I bought a Rock Star game for all the kids to play with. My friends and I were having a chat in the living room while they played and when she started singing we got into a laughing fit. \n\nNot because she was doing a bad job, but it was cute as hell. She put her body and soul into it (growls and all) and we overloaded on adorableness. Kind of like when you involuntarily join in when you hear a baby squealing with laughter.   \n\n\nI explained it right away, and we all gave her a standing ovation when she was done. It wasn't until years later that she brought it up when we were talking about her anxiety. And it wasn't until a few years after that, when she was in a fit of laughter over something a toddler did, that she finally understood that she wasn't being mocked.   \n\n\nThe poor girl in OPs story was being mocked. For putting her heart and soul into a gift. I can understand spontaneous laughter against your will, but you'd usually explain your non-malicious intent afterward. OP can't even do that, because he WAS blatantly mocking her.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 266,
          "content": "This story makes me appreciate my family all that much more.  My 12 year old likes making things out of cardboard.  For the family this year, she made mid-evil weapons for them all.  I was not sure how this was going to go over and was concerned because no matter how silly the idea may sound, she put a lot of work into them and spent a lot of time figuring out who should get what.  Better than the weapons themselves was the way she wrapped them.  To my delight and hers, the family loved them.  The image that will stay with me forever is Mom trying to stab my nephew with her sword and Dad swinging the mace she made him.  The only thing better was the look on my kid's face.",
          "id": 137,
          "comments": [
            {
              "score": 99,
              "content": "Your twelve year old sounds *delightful*. I love that she put work into matching the weapon with the person 😍",
              "id": 138,
              "comments": [
                {
                  "score": 10,
                  "content": "It was driving me a little crazy, like how do I know who would want daggers over sabers?!",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "My 12 yr boy just built himself a nerf shield out of ikea package cardboard and a gallon ziplock bag. Your girl sounds like his people, and I'm glad to hear of such kids. 🥰",
              "id": 140,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Those mid-evil gifts don't sound half bad.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "> mid-evil\n\nThis is the most awesome typo, lmao",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "I agree. That was uncalled for. She is twelve and you are an adult. The op couldn’t control themselves for over 15 minutes? I call bill and you have destroyed your nieces confidence and trust. I wouldn’t expect a relationship after this. That poor girl.",
          "id": 143,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "My heart is broken for her. I would be devastated if I worked hard on something, was very proud of it and then someone just laughed at it.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 14628,
      "content": "YTA, she's a child and you made fun of her work. Furthermore, you laughed for *10 minutes*, what is wrong with you.",
      "id": 145,
      "comments": [
        {
          "score": 4874,
          "content": "That's what blows my mind - even if it was laughably bad, what adult can't control themselves to the tune of needing to lock themselves away for ten minutes to get under control?",
          "id": 146,
          "comments": [
            {
              "score": 1174,
              "content": "That's what I was thinking too. I really hope that if OP works, his CEO doesn't walk out of the bathroom with toilet paper in his shoe or something like that. OP could get himself fired for his inability to control his emotions.",
              "id": 147,
              "comments": [
                {
                  "score": 398,
                  "content": "OP should work on their self-control. That poor kid having to grow up with people like that.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 313,
                  "content": "Nah, OP doesn't have a self control problem. He'd never do something like this to someone whose opinion or feelings actually matter to him.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 88,
                  "content": "Somehow, I expect he can magically control himself around his boss. Like people who treat waiters like shit or scream at underlings, but are somehow able to control themselves around people with more power than them.",
                  "id": 150,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Did you mean half of all boomers?",
                      "id": 151,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 387,
              "content": "Or that fucked up wife who said the damn toy made her UNCOMFORTABLE. This is a new level of low, what kind of fucked up adults are these? That poor kid, she will remember this moment for the rest of her life.",
              "id": 152,
              "comments": [
                {
                  "score": 150,
                  "content": "Came here to say this. Humiliating a child and breaking her heart doesn’t bother them but they can’t stand being in the same room as a weird animal toy? WTAF.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 13,
                      "content": "We’ve had some weird-looking things displayed in the cabinet over the years, from portraits of us that looked like dinner rolls with eyes, to clay figures with an extra leg here and there. It’s the love that goes into them, you can buy perfect anywhere, but those gifts of love are irreplaceable. These two are heartless and immature.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "Sounds like they're made for each other!",
                  "id": 155,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "Exactly. Even if it was awful, the worst it could look like is a crappy ball or tangle of multicolor yarn. It doesn’t look like a demon.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yeah, there is only so much that a 12 year old beginning crocheter can do.",
                      "id": 157,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "The wife at least had the decency to wait until she left.",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "As a goth kid, I really want the uncomfortable plushy, if it is in fact uncomfortable",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I really want to see it at this point",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 363,
              "content": "Yeah, I can see myself letting out a reflexive chuckle but then stopping myself by fake coughing. Sometimes a spurt of laughter just kind of happens.  But ten minutes of laughing is bananas.   I'm a goofy-ass person but I've never laughed that long over anything in my entire life.",
              "id": 161,
              "comments": [
                {
                  "score": 121,
                  "content": "Even DRUNK I’ve never laughed that long wtf",
                  "id": 162,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Even high as fuck id be able to gather myself after 45 seconds lol",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I've laughed that long sober but it's only with other people, when you're crying laughing and just looking at each other sets you off. It's actually really painful!",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "Or you say your chuckle was because it’s cute.\n\nI’m just picturing OP laughing like Christopher Waltz in Inglorious Basterds about the mountain climbing incident.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Also not like itd be hard to turn the laugh into a complement. \n\n\n\"Hahaha this is awesome! Thanks!\"\n\n\nnow your laughter is just a laugh of joy, not of mockery.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Once when I was in college, I was sitting in class while the professor described an absolutely horrific medieval execution method. For reasons I still do not understand, I started laughing uncontrollably, like hysterical, tears-streaming-down-my-face laughing and couldn't stop. I put my hands over my face and ran out of the room while the other 150 people present stared at me. Fortunately, everyone assumed I was just overwhelmed by the subject matter and actually crying, but 15 years later it still haunts me.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Laughter is a natural response to discomfort as well as humour. No need for that to haunt you; you did nothing wrong.",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "LOL.  That is hilarious.",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "This. Having to excuse yourself over a crocheted animal is nutty. Feels like an extremely exaggerated or made up story.",
                  "id": 170,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I once laughed at the most stupid thing you can imagine, it was like some switch was flicked in my brain and I couldn’t stop laughing to the point of tears for probably around 10 minutes, and this was in class",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Part of the joy of art from kids is it isn’t perfect.  If my niece told me she made me a special gift and presented it in Christmas, I don’t care what it looks like: I love it and it is amazing.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 707,
          "content": "[deleted]",
          "id": 173,
          "comments": [
            {
              "score": 215,
              "content": "Shoot, it's been nearly 20 years for me and I still remember my art teacher saying, \"It's okay, sweetie, we grade on effort.\" Wasn't even super into art and it crushed any interest I had.",
              "id": 174,
              "comments": [
                {
                  "score": 28,
                  "content": "My art teacher berated me for not knowing what a boat should look like from a specific angle (perspective and such) and made me sit and draw boats until he was satisfied. Complete with frustrated laughter and groans.  \n\nI was 10, I think. Never went back again.",
                  "id": 175,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I am so sorry. Cruelty to children is abhorrent. That was a bully and a creep. Xx",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I still remember when i had a question to my language teacher and she answered \"will i need to draw for u? Don't you understand what *insert term here* means?\". Even my classmates heard. \n\nThis was 10 years ago.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I made something for my dad for Christmas when I was 8 years old and I still remember when he said, \"What am I supposed to do with this?\" It's been 30 years.\n\nOP needs to apologize and have that crocheted animal on display forever.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Yeah, my dad rejected my homemade Santa as “ugly” when I was 9 and the memory of being rejected by my parent is the number one thing I work on in therapy as an adult, along with my tendencies towards perfectionism and anxiety. Gee, wonder where I got that from. I’m in my 40s. \n\nYTA OP.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 210,
          "content": "My first thought was \"maybe he needs to see a doctor?\" That can't be normal right?",
          "id": 180,
          "comments": [
            {
              "score": 182,
              "content": "he’s just an asshole, sadly nothing a doctor can do about that.",
              "id": 181,
              "comments": [
                {
                  "score": 14,
                  "content": "Sometimes doctors can help with assholes. Stick a tube up there and see what’s wrong",
                  "id": 182,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "[deleted]",
              "id": 183,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "I learned over the course of reading various AITAs that a large amount of people don’t have *basic* levels of tact and diplomacy.\n\nI wonder if the other adults were “understanding” of OP or if the dude just couldn’t read the room like he can’t read that “laughing at a 12 year olds gift is bad.”\n\nId be super pissed if a relative/in-law/etc laughed at a kids homemade gift.",
          "id": 184,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "The laughing for 10 minutes is what clinched it for me. The laughing could *easily* have been swiftly twisted into \"OMG niece, it's so cute, I can't believe you did this! Are you sure you wanna give this to me? Thank you so much!!\", some bullshit like that. OP didn't need to like it, absolutely, but **what the fuck was this reaction**.",
          "id": 185,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": ">you laughed for 10 minutes, what is wrong with you.\n\nThis is what got me too. It would've been bad enough if OP laughed for a second, but maybe stopped himself. But the OP had to excuse himself to go to the bathroom and continue laughing for 10 minutes? There's something very wrong with OP. \n\nYTA.",
          "id": 186,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "No kid starts out good at anything. She might feel like quitting after this. \n\nWhen you encourage them and make them feel good, they’ll keep going and get MUCH better at it.",
          "id": 187,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "This is the MEANEST shit. \n\nI would probably cry if my niece made me anything at all, much less a wholeass crochet animal!! \n\nThis person is a horrible Jerk. /u/supportivehusbandnot you should feel really bad about this. Even if she crocheted you a turd, she gave it to you with love. And you basically shat all over it. Shame on you.",
          "id": 188,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "I remember in HIGHSCHOOL my classmates gathered around me while I was practicing drawing hands and trying to get correct proportions for the arms. They started laughing and pointing out every mistake then walked away. Now that I think about it I haven't really taken the time or effort to try and draw again. I just threw crap together so I passed the class and moved on from art classes. \nThat was peers... Yta your this girls family. So devastating.",
          "id": 189,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8836,
      "content": "YTA. Laughing at a gift somebody was looking forward to giving you is just mean. You've likely permanently damaged your niece's self-image with your inappropriate reaction.",
      "id": 190,
      "comments": [
        {
          "score": 2105,
          "content": "He knew she was making something, it is not like he was surprised when he opened it.  Just absolutely cruel to crush that little girl who was so excited to make the gift.",
          "id": 191,
          "comments": [
            {
              "score": 1165,
              "content": "This is the reason why a majority of people quit art before they even start - they get laughed at or mocked for making something that doesn’t par up to what takes actual decades for people to master - and believe that they aren’t ‘gifted’ or ‘talented’ to pursue it. What a shame. A little encouragement goes a long way. Some people just lack sense and basic empathy unfortunately.",
              "id": 192,
              "comments": [
                {
                  "score": 223,
                  "content": "Ain't that the truth. I grew up being belittled in art by family and always compared to my older sister who was better at it because she had the practice because she had the time. I didn't get as much time to practice because being the middle kid, I was often either ignored or called in constantly to do shit around the house.\n\nThat definitely crushed myself confidence in art in general. I was decent but not the best, like I couldn't make basic poses look good let alone dynamic poses.\n\nFamily really sucks at support.",
                  "id": 193,
                  "comments": [
                    {
                      "score": 9,
                      "content": " I can definitely relate to that. I played guitar when i was younger, or at least was learning it. I just got told that whatever i played was \"not real music\" by my parents. When I tried showing them some cool chords I learned or a little song or melody I'd written I got ignored. i was often compared to other kids at my school or neighbors who had a lot of more experience than me at the time. Eventually i just stopped playing which only made them bother me all the time about how I don't play it anymore.",
                      "id": 194,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Yes! I have quite a talent for it but stoped and started so many times when I was younger because people can be so mean. Idk if it’s jealousy or a lack or appreciation for the time and practice it takes to get good. Maybe they think you just paint a masterpiece the first time otherwise it’s worthless.",
                  "id": 195,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I got a degree in art - painting specifically - and even though part of the whole thing was critiquing each others work, i *still* get nervous to post my stuff online and feel like everyone else is better than me! And that’s with a supportive family.",
                      "id": 196,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My middle school art teacher is the reason I didn't have the confidance to draw. I always loved to draw, but she gave the good grades to her nieces, whom where my classmates. I wasn't one of her family, so I always got lower scores. I crochet now, but still don't have the confidance to sell my work, because of this. :/ And I'm 34 now... It never goes away. \n\nOP- YTA",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Focusing on perfection also kills any enjoyment, I’ve always really enjoyed doodling and colouring, I find it very soothing, but I stopped doodling for a while in high school after some classmates made fun of my little doodles.\n\nAlways question whether your commentary is necessary or needed; I was drawing fun, many people crochet for fun, there’s no harm in being “bad” at it as long as you’re enjoying yourself.",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This is what happened to me with not just my art but my writing as well. I tried to write poems growing up as a kid but I didn't get much encouragement from my family. My mom and grandma acted like you had to be an award winning author right from the start. Either you had it or didn't.\n\nSame thing with art. I wasn't good but I enjoyed doing it. Growing up in a very conservative church, I was told that God gifted us special talents so we could use them for his glory. I had it stuck in my head that God didn't \"bless\" me with creative talents so I pretty much stopped trying. \n\nI saw other girls who were more outspoken and outgoing than I was dabble into things I wasn't really comfortable with like singing, speaking, putting on plays, and Bible competitions. Everybody always put the focus on the more extroverted crowd and since I was so quiet and shy but at the same time, attractive, I just ended up being the shy, pretty girl that didn't talk much and didn't have much to offer. That really crushed my self esteem.\n\nI thought that my measly writing and crappy drawings didn't even come close to the other girls talents. I also figured God didn't bestow those gifts on to me for a reason so there was no reason to pursue those endeavors. Just another reason why I gave up on religion because all it did was cause resentment. \n\nIt didn't help that I was a serial procrastinator that pretty much gave up on projects the minute I got overwhelmed or too focused on trying to make my writing and art \"perfect.\" It wasn't until years later that I figured out that you don't have to be freaking Shakespeare to enjoy art.\n\nRecently, I've been writing, drawing, and painting a lot more than I used to. I decided to let that resentment go. If it's a hobby that you genuinely like, then go for it! Don't be like me who wasted too many damn years on worrying whether or not my work was good enough to be on par with Ernest Hemingway or Pablo Picasso.",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 405,
          "content": "The niece is never, ever going to forget this. I wouldnt be surprised if this was the last handmade gift she ever gives.",
          "id": 200,
          "comments": [
            {
              "score": 112,
              "content": "It'll be the last one _he_ gets for sure and I'm honestly wondering if he'll ever understand why.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I was a creative kid. I always gave everyone handmade gifts. I remember throwing something away after giving my father something and seeing something I poured my heart and soul into making him sitting on top of that pile… he never got another handmade gift. Not until years later when he started complaining about not getting handmade gifts, and I gave him a crappy tester I made. People remember the reactions they get.\n\nI’ve got nieces and nephews and I cherish the things they make me now. They aren’t ‘good’ by any typical standard… but they’re perfect to me. They sat down determined to draw something they knew I would like. What gets better than that?!",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "To steal from the movie Inside Out, this is likely a \"core memory\" that could legitimately change this child going forward. The fact that it was a 12 year old makes it even worse - they are fully aware of what just happened and it can't simply be brushed off.\n\nHopefully OP can realize how insanely selfish they are and consider reflecting on how many other people they've hurt by making it this far in life. \n\nAs for the other adults, I'd be livid if it were my kid. I don't think they were understanding, they just didn't want to cause conflict because it had already been enough of a scene.",
              "id": 203,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "Agree. When I was a kid, I showed a family friend my sketchbook. Literally drawings made by a child. She decided to just say “have you ever drawn from life before?” which as an adult I understand, but young me had a whole meltdown in the next room. OP has that same energy.\n\nEdit: thankfully, spite and no friends at the time helped me continue to make art haha. Most recently same family friend enjoyed the drawing I did of her dog for Hanukkah.",
          "id": 204,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I painted a portrait of my sister for Christmas one year when I was young. I spent hours on it. She laughed at it in front of my whole family and made fun of it for years. Thinking about it stung for a long time.",
          "id": 205,
          "comments": [
            {
              "score": 6,
              "content": "I'm so sorry.",
              "id": 206,
              "comments": [
                {
                  "score": 7,
                  "content": "It’s alright. I feel for the little girl in the post. OP is not a nice person.",
                  "id": 207,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "CORE MEMORY",
          "id": 208,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "This is what really hurts me about this whole situation. That poor little girl will probably replay this in her head for years and I don't think that can be fixed now.",
          "id": 209,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6312,
      "content": "YTA. 10 minutes?? How could it be THAT hilarious?  She made you a gift, told you how excited she was about it, and you just laughed at her. Congratulations on hurting her feelings and crushing her confidence.",
      "id": 210,
      "comments": [
        {
          "score": 1557,
          "content": "I used to teach sewing classes for kids, and one time a girl around 10 years old tried to make a stuffed animal that objectively turned out badly and she hated it. It was supposed to be an elephant but just looked like a weird blob. She refused to take it home because she hated it so much. I told her I thought it was great, and if she wouldn't keep it I would. I took it home and named it \"derpy elephant\" and had it on a shelf for like 5 years. OP can't say enough YTA",
          "id": 211,
          "comments": [
            {
              "score": 622,
              "content": "I hated a piece of art i made in HS. Thought it looked ridiculous compared to the much more realistic stuff my classmates made. Told my teacher I didn't want it & to toss it. She asked if she could keep it. She ended up glazing it (in black, which was a stellar choice), and took it home and has it displayed in her home. She ended up making me a watercolor painting as a thank you (it's still with me, despite several moves and a house fire where I lost a lot of my own art). That teacher was a rockstar, just as you are. I still make art and two decades later still have immense respect and love for my HS art teacher.",
              "id": 212,
              "comments": [
                {
                  "score": 80,
                  "content": "That's so great that your teacher did that!! I now sew and do art for a living, and I'm only able to do that because my family always valued and appreciated art and encouraged me even when I wasn't very good. Some of the things I made and wore when I was 12 years old were truly ugly and terribly made, and at the time I knew they weren't very good, but I was proud of my work and people in my life were supportive. Now I try to be as supportive as possible to anyone learning a new hobby or skill. I never would have become talented at what I do if I didn't have people encouraging me through all the failures while I was still learning.",
                  "id": 213,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Right? If OP didn't like it, he could just act like a damn adult, tell her it was good and use it as a reminder that his niece cared enough about him to dedicate her time to making him something",
              "id": 214,
              "comments": [
                {
                  "score": 8,
                  "content": "Also OP's wife said it made her uncomfortable to display it??? I don't know anyone with kids in their life that they care about who doesn't have weird/ugly kid art displayed in their house. Most people are proud of it because like you said it shows the kid cares about you.",
                  "id": 215,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "That's actually pretty sweet and cute of you to do.",
              "id": 216,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I remember when I was younger I painted a tote bag in school. I hated it, and iirc because I didn't want it I think I offered it to my teacher. I **did not** think she'd actually do anything with it, but then a year or two later I saw her use it. Seeing that she not only kept it, but actually used it made me so incredibly happy :) it still looked like shit, but it made me feel good about making it, and encouraged me to do more artsy stuff",
              "id": 217,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "When I turned 21, two of my friends (with little to no crafting experience) hand sewed me a little teddy bear. It turned out sooooo derpy and ridiculous. They apologized the whole time I was unwrapping it. I absolutely loved it! I loved that it was lopsided and mismatched. I loved its crooked smile. And, I especially loved that they'd made it for me! No matter the age, always respect someone's effort to make you happy. Nearly 15 years later, I still have that goofy little teddy bear!",
              "id": 218,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I hope you know what a massive impact that had on that 10 year old girl. It probably meant so much to her and I hope she continued to sew because of it.",
              "id": 219,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 324,
          "content": "I'm curious as to what it really looked like. I thank the OP for pointing me to r/badtaxidermy, as I was unaware of that sub. It is odd though, as most of those are funny in a cute way, but not necessarily bad. That said, OP was definitely major league AH.",
          "id": 220,
          "comments": [
            {
              "score": 110,
              "content": "[deleted]",
              "id": 221,
              "comments": [
                {
                  "score": 62,
                  "content": "I don't know if I could control myself with this one - https://old.reddit.com/r/badtaxidermy/comments/zelp1z/when\\_a\\_simple\\_no\\_just\\_didnt\\_work/",
                  "id": 222,
                  "comments": [
                    {
                      "score": 15,
                      "content": "I’m a huge fan of the [derpy kitty](https://i.redd.it/mcxw44jtezi41.jpg)",
                      "id": 223,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 266,
          "content": "Yeah, this one hurts my heart. Anyone who crochets will have their first few creations look super derpy.  It takes a fair bit of practice for things to look good. I hope neice doesn't give up. Maybe OP can help the apology with some crochet books and supplies (like a nice set of hooks, stitch markers, safety eyes for toys, stuffin, yarn) and say not to let OPs stupid reaction deter her.\n\nOP is now public enemy no.1 over at r/crochet lol",
          "id": 224,
          "comments": [
            {
              "score": 95,
              "content": "This is so true. In case people don't realize just how derpy the first couple of toys look, here's what I made for Christmas this year:\n\n[\"Panda\"](https://imgur.com/a/MgJOz5Z)\n\nWe all had a good chuckle about it when my mother unwrapped it but nowhere near the reaction OP is describing. That's just mean, especially when the gift giver is a kid.",
              "id": 225,
              "comments": [
                {
                  "score": 26,
                  "content": "I crocheted a beautiful candle on a stand with a flame, in jr high. Showed it off proudly. \n\nDidn’t realize til years later it looked like male genitalia complete with um, discharge 😂",
                  "id": 226,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 25,
                  "content": "The first stuffed animal I crocheted was a \"begginers\" frog. It looked sooooo bad and I worked super hard on it. It was like this horrible goblin looking thing with scary feet. My son who was probably 4 at the time absolutely loved it and he still has it, so I kept at it. \nAlso I started amigurumi patterns for stuffed animals since it's more small and cutesy rather then looking realistic.",
                  "id": 227,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Aw panderp. Overall your stitches look pretty consistent, good job! Thats a good yarn to start / practice with, nice n chunky!\n\nI've always found sewing the parts together to be the hardest part, lining them all up and pinning them so it doesnt look wonky. Lots of pins and patience is the key.",
                  "id": 228,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Oh my god that panda is precious I would laugh  and cry and hug it so hard",
                  "id": 229,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I love it so much!  I have crocheted for years and never had the courage to try animals.   I'm gonna do it now.  Thanks!!!",
                  "id": 230,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I LOVE HIM SO MUCH. He's adorably derpy. I just got my mom a couple of amigurumi kits for Christmas and I hope she makes something derpy that my kids will absolutely love.",
                  "id": 231,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Oh my god that's so cute. I love the little half smile.",
                  "id": 232,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I'd argue that most crocheted toys are SUPPOSED to look a little silly - I'm experienced and I made a dolphin that looks like a smooshed sock.",
              "id": 233,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Ah of course it is already posted. \n\nWe should get the knitters in on it too. They can stab...",
              "id": 234,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 72,
          "content": "I feel like we need to see a picture of it.",
          "id": 235,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Yeah. I relate to the niece, because I’ve had this happen to me. It’s not funny, shit hurts. YTA OP (and your SO + the other adults who use did nothing???).",
          "id": 236,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "What blows my mind is that his wife also felt like his niece's art is ugly to the point of removing it from shelve. \n\nI don't know guys, these two probably are made for each other",
          "id": 237,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yeah ten minutes is leaning towards intentionally cruel. YTA, Jesus christ.\n\nI'm surprised he has enough shame to even wonder if he was wrong. If the kid had just swallowed her hurt he wouldn't even think about it twice. Instead he's complaining on here that SHE is being mean to HIM for NO REASON like laughing for ten straight minutes was totally involuntary don't even worry about it what a MEAN CHILD",
          "id": 238,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "The thing is, even if you start to laugh you can save it. Even while laughing you can say \"oh my gosh, I love this so much! It's so silly and fun! It makes me so happy just to see it!\"\n\nI also have a 12 year old crafty kid and I know first hand that this works when a laugh is startled out of you.",
          "id": 239,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "He could have at least hugged the crochet and said that he loved it and said it \"just so cute\" while laughing. There are ways to play off laughter at a goofy-looking gift made by a young family member. I personally would love to receive such a present.",
          "id": 240,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5582,
      "content": "Not only are YTA .. but your wife majorly sucks as well. It made her so uncomfortable she needed you to take it down!?   \n\n… genuinely what is wrong with BOTH of you!? You can’t control your laughter & she’s THAT uncomfortable by a crocheted animal? Grow up. Your poor niece will quite literally never forget your reaction.",
      "id": 241,
      "comments": [
        {
          "score": 1255,
          "content": "tbh I have a bigger problem with the wife than with OP. OP should’ve handled it better, but that was knee-jerk reaction. His wife, on the other hand, did not get put on the spot. Her decision was measured and came after the benefit of time.",
          "id": 242,
          "comments": [
            {
              "score": 733,
              "content": "I don't think knee-jerks last ten minutes, but yeah the wife's an AH too",
              "id": 243,
              "comments": [
                {
                  "score": 228,
                  "content": "For the record I think they’re both assholes, and yeah, ten minutes is a long time. That said, some people laugh as an expression of nerves. If he knew he fucked up with his initial reaction, I could see the laughter snowballing beyond control. I know a couple of people like that. But to make that decision after the fact- especially after their niece was so visibly heartbroken- is just callous and unfeeling. He’s an AH, but she’s definitely the bigger one.\n\nEdit: the more I bat this one around in my head, the less convinced I am that OP is an asshole. For a lot of people, uncontrollable laughter is an unfortunate physiological response to anxiety. It often manifests at inopportune and inappropriate times and is misconstrued as derisive and mean-spirited. When that happens, it only intensifies the anxiety which in turn prompts more laughter. OP’s initial laughter was unfortunate, and perhaps inappropriate enough to warrant an asshole verdict, but I feel like the inability to stop laughing isn’t as illustrative of ill-intent as people are making it out to be. If anything, needing ten minutes to get it under control even though he’s expressed contrition about it actually supports the possibility of a physiological cause.",
                  "id": 244,
                  "comments": [
                    {
                      "score": 97,
                      "content": "Ooo, that happened to me before, back in like third grade or something. Kids would make fun of my laugh and one time I accidentally laughed in the middle of class… everyone was staring… and I just kept laughing and laughing harder and harder because my brain was like ‘once i stop laughing I’ll have to deal with the ridicule’… then the teacher kicked me out until I got control of myself. Kids were scared of me after that, whoops",
                      "id": 245,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "My exact thought was that laughing isn’t always cause somethings funny. A lot of people laugh when they’re nervous or uncomfortable. My twin bro does this exact thing and for the longest I just assumed he’s an asshole but when he told actually opened up to me about it I actually felt like such an asshole for just assuming he was an asshole when really his was uncomfortable every time he did that",
                      "id": 246,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "To be honest even if not a response to anxiety sometimes you just can't control the laughter. I had that many times in the past, something makes you laugh a lot, you're trying to stop yourself, it makes you think about it again and you suddenly laugh again, and yeah in the past for me it would go for 10-15min (not laughing maniacally for 10min straight but rather trying to control myself between bursts of laughter). After a while you think about it and you don't even think it was THAT funny but just something in the moment made you cry from laughter. It's a very unfortunate reaction, but his actions after show to me that he's not really an asshole, he tried to fix it, even if he really couldn't.. She's definitely an asshole who doesn't think about the kid's feelings.",
                      "id": 247,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Giggle loop. You know you shouldn’t, but you do and then the inappropriateness/embarrassment/ridiculousness of the situation compounds the giggling. There was a show on BBC called Coupling that dubbed it the giggle loop (the whole scene played out at a funeral).",
                      "id": 248,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 157,
          "content": "This is exactly what I wanted to say. Both a seriously immature.  I can’t remember the last time I was unable to stop myself from laughing, let alone couldn’t gain control of it for ten minutes.\nYTA OP.\nI bet it was actually cute.",
          "id": 249,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3512,
      "content": "YTA\n\n\nI feel really bad for your niece if this is true. \n\n\nThe good news for you is you probably won't get a gift from her next year.",
      "id": 250,
      "comments": [
        {
          "score": 663,
          "content": "I’m not exactly sure what quality OP was expecting since this child just started crocheting this year, but the hysterical laughing seems WAY over the top. Was OP expecting realism?  Honestly, OP and his wife sound like an AH on many levels. YTA. I hope the niece continues her art and that these AH haven’t killed her love for it. I also hope she never gives them another gift. Clearly they have no class and aren’t gracious on any level.",
          "id": 251,
          "comments": [
            {
              "score": 225,
              "content": "This. The gift was from a 12 year old who only just recently started crocheting. Was OP seriously thinking it would look like something professionally made or what you’d order on Etsy?",
              "id": 252,
              "comments": [
                {
                  "score": 168,
                  "content": "To add insult to injury, this AH knew in advance how excited this child was to give him this gift and he STILL laughed at it, which was really him laughing at her.  What a fucking terrible uncle. If any child worked hard on a piece of art for me I would display it proudly, but my niece?!  That should be next level appreciation. OP sounds like he’s 14….not a married adult person.",
                  "id": 253,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Yeah, my niece hand drew me a picture of me with my puppy. It's hanging right above my computer monitor, so I see it every time I'm at my PC. Makes me smile from ear to ear too, even though it's not the best art, because to me the quality of art doesn't matter, she made that for me, you can't replace that warmth of love like that. She's a treasure in my life, and so is that piece.",
                      "id": 254,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Not to mention crocheting - especially when you're learning is HARD. It takes a little while to get the hang of and a crocheted stuffed animal? Even harder. I've only done a couple little jellyfish/octopuses and when I set them down for a while it takes me a minute to remember how exactly I did it and get it right. There are increases and decreases which can be tricky and also depending on the yarn it can be made easier or harder based on type and quality. It probably took OP's niece a decent amount of time and we also don't know if she has a template or a video to help her - if she created it by herself that's even worse because sometimes you have to play with it if you don't have something to help you see what you need to do to get the right shape. YTA OP you probably ruined her confidence and she might never pick it up again. Hell if my bf reacted like you did when I gave him a pretty misshapen scarf for our anniversary (my first work) I would have never touched crocheting again.",
              "id": 255,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "And all other years that will follow. OP should be happy if she even talks to him again... I would have been heartbroken... Poor girl.",
          "id": 256,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2309,
      "content": "YTA. She was so proud of what she put time and effort into and you just laughed in her face.There is no way you can make it up to her",
      "id": 257,
      "comments": [
        {
          "score": 387,
          "content": "Agreed. There’s no way to repair that hurt. It will be with her forever.",
          "id": 258,
          "comments": [
            {
              "score": 14,
              "content": "My cousin made us a brown ceramic rat with whiskers that is a straight up horror show. But goddamn if my mom didn’t put in on display for a good five years in a fancy designer home. And thank god she raised me to at least have a snicker in private and not be such a jerk.",
              "id": 259,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 296,
          "content": "YTA. She was excited to give YOU a gift.  I hope you never get that warmth from anyone again. \n\nAlso since it would be wise of you not to have children, I hope she picks your nursing home out.",
          "id": 260,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Poor kid. I have a 7 year old that makes some art that is objectively... not perfect. But I LOVE it. All of it. Every fucking time. Because she is always SO EXCITED to show me/ give it to me and that alone makes it the best damn thing ever.",
          "id": 261,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I crochet and that type is called amigurimi. It can be tricky and complicated. If she doesn’t give up, OP will never receive anything handmade ever again. That reaction will stay with her forever. We talk about this in r/crochet all the time.",
          "id": 262,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2148,
      "content": "YTA, fix it.  \n\n\n\"Niece, I am so sorry for the way I reacted to your gift. I took a kind a thoughtful gesture that certainly took you a lot of time to make special for me, and I ruined it. Niece, please don't let my reaction steer you away from your passion for creativity. I certainly could never crochet an animal like that, and it shows incredible dedication to finish a crochet project. I acted like an asshole (yes, say asshole, she'll appreciate you being candid and talking to her like an adult) to you. Let's be real here, you don't suck at art. Crochet is a new skill you are learning, and I am truly impressed that you have started picking up that skill at such a young age. Please keep having fun creating, and please continue to practice and explore new mediums. Create art you love. I hope that I can someday earn your trust back enough to deserve another one of your heartfelt creations. Again, I am so sorry. I am very proud of you.\" Then take her to Michael's and let her pick out some fucking yarn.",
      "id": 263,
      "comments": [
        {
          "score": 754,
          "content": "I agree with this, along with the trip to Michaels. Then ask her for a crochet lesson so you can make something hideous and see how challenging it is, and she can laugh at you.",
          "id": 264,
          "comments": [
            {
              "score": 184,
              "content": "Yes. I am 35 and my MIL tried to teach me crochet. I am AWFUL at it hah.",
              "id": 265,
              "comments": [
                {
                  "score": 15,
                  "content": "It takes a bit of time to get decent.",
                  "id": 266,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Oh for sure. I have ADHD and get distracted/lost in thought and I lose count ha. Don't worry, I have discovered that loom knitting and my ND brain get along really well.",
                      "id": 267,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "THIS!  Let's see HIS crochet animal.  I bet it won't be great.  I can do basic crochet and asked my best friend, who is really good, to teach me how to crochet a basic animal for my daughter, and after an hour she was like, \"How be you give me five bucks and I just do it for you?\" because of how bad the whole thing was going!",
              "id": 268,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I thought the same thing. Let OP crack down with some crochet hooks and yarn and let’s see how good they do. No way these are adults.",
              "id": 269,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 145,
          "content": "Yeah, looks good on paper, but I think OP fucked it up to the point where he can't lie himself out of it without his niece looking right through it.",
          "id": 270,
          "comments": [
            {
              "score": 95,
              "content": "Let me tell you as someone who’s had her own confidence crushed as a 12 year old. It is not great. No matter how many apologies you get, it’s done. All happy thoughts you had about something you enjoy doing is ruined. \n\nI once wanted to learn the keyboard and I still remember a teacher looking at me dead in the eyes and said “I don’t think that something that someone like you could do.” (For ref, I believe she was referring to my autism). That same year my brother laughed at me over some song I made on garage band. And let me tell you I cannot look at a keyboard or any instrument without feeling sadness. I do a lot of song writing and not being able to express myself emotionally and musically is so frustrating.",
              "id": 271,
              "comments": [
                {
                  "score": 19,
                  "content": "I have ADHD and thus the beautiful REJECTION SENSITIVITY DYSPHORIA, and I relate hard to how crushing words like that can be, especially when ND. It took me until like last year to start showing people my art again because I was so afraid of rejection. But I think a big difference between your situation and OPs is that:  \n1. Your teacher and brother were being malicious dickbags. OP was an asshole, but it wasn't their intention to shame their niece, they just reacted super poorly in the moment  \n2. They didn't give you a heartfelt, sincere apology that recognized how they were wrong (as if ND people didn't regularly become amazing musicians!) that also validated the fact that creating for creation's sake is not only valid, but valuable.  \n\n\nI hope someday you can look at an instrument without feeling sad. You deserve to express yourself through music.",
                  "id": 272,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Oh god I feel that. Yeah it makes me struggle to show off stuff I wanna show to people and it sucks. \n\nLast night I wrote a song and shared it every shyly a music group made by people in a gap year program I’m going on and someone said hey why don’t you make some music for it. Try as I might, I just couldn’t do it. I hate it.",
                      "id": 273,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "this is a good idea but i’m pretty sure op fucked up beyond repair. their initial reaction is going to stick with their niece much more than any rehearsed speech they throw at her now. \n\ni truly hope she never, ever makes anything for op or their shitty wife again.",
          "id": 274,
          "comments": [
            {
              "score": 8,
              "content": "Sure, but writing a heartfelt apology letter is still the right thing to do. She didn't deserve such ghastly treatment, and OP needs to tell her that he is a butthead who doesn't know shit.",
              "id": 275,
              "comments": [
                {
                  "score": 6,
                  "content": "i agree, but op should also not expect her to be ok with them after they do apologize super sincerely. they should be ready for the niece to not want anything to do with them. i just wanted to stress how big the damage op did is.",
                  "id": 276,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "This is good. Say this and say it with your chest. Add ice cream afterwards if she likes that.",
          "id": 277,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1243,
      "content": "YTA- I get not being able to control an initial reaction but laughing for minutes on end...who can't control themselves like that?",
      "id": 278,
      "comments": [
        {
          "score": 545,
          "content": "I get giggly to the point of not being able to stop sometimes too, but you know what id do? Id hug the thing and consistently tell the kid I'm laughing because i love it so much, maybe even get them to laugh too through playful means. There's no reason to make it a bad memory, you can make it a fun one for them too.",
          "id": 279,
          "comments": [
            {
              "score": 109,
              "content": "This is the response that makes sense! The gift is probably so laughably bad it's actually adorable!",
              "id": 280,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "If I laughed, that laugh would turn into OMG, you made this for me?!  \n\nAnd then since I'm an adult and have self-control I'd go on to say that it's awesome. Because it is.  And I'd look at it all over and ask her how did she do it?  I couldn't crochet an animal, that's for certain.  \n\nFor a kid to be able to explain their craft to an adult is a wonderful thing.  \n\nNo one starts out excellent at a craft. I was a freelance biological illustrator for 15 years but if you looked at my drawings back in kindergarten, they were pretty bad. No one laughed and they were proudly displayed on the fridge.  And I kept drawing and drawing and went on to get a BFA & MFA and work as a freelancer.",
              "id": 281,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "[deleted]",
              "id": 282,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Exactly. Total failure of creativity on OP’s part",
              "id": 283,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 130,
          "content": "I wonder if OP had been drinking or smoking something. Not saying it excuses it at all but that's the only reason for the uncontrollable laughing. Definitely YTA",
          "id": 284,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "I've experienced it, luckily not at another person's expense, but apparently it was because of mental health problems, ADHD and medication interaction. If OP doesn't have a solid reason for it like that, I can't believe it was \"uncontrollable\". \n\nYTA",
          "id": 285,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "This is the only reason I have any sympathy for OP. I was nicknamed hyena in high school because of my uncontrollable laughter. I have had many uncontrollable laughs before, lasting 15 or 20 minutes, even though I know it's inappropriate. It happened often, where I would laugh in the middle of class, and the triggers weren't even that funny. I try my hardest to stifle it, but the best I can do is put my head down and keep the laughter as quiet as possible. Yet you can still see me shaking and hear me struggling to breathe. Often, I end up going to the bathroom to try to get the laughter out.\n\nOnce, in college, a male roommate didn't make the football team and became a cheerleader instead. Only a little bit funny, right? Yet, once I found out, I tried my hardest to stifle any laughter, and rushed out into the hallway. I laughed so loud that everyone on that floor could hear me, despite my hardest to spare my roommate any pain.\n\nIt really is uncontrollable, because I always end up struggling to breathe. So I'm not defending OP, but I want to educate you that laughter can be uncontrollable, and can be triggered by the slightest situation.",
          "id": 286,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 751,
      "content": "YTA - even if it was unintentional. Your wife is an AH too. There was no reason for her to pull you aside during the party to let you know how ugly it is and that it needs to come down later.",
      "id": 287,
      "comments": [
        {
          "score": 277,
          "content": "Yeah the wife is almost worse. These are terrible people. My kid would not be within a mile of either of them again.",
          "id": 288,
          "comments": [
            {
              "score": 14,
              "content": "That is why they are married. Souls alike bond well...",
              "id": 289,
              "comments": [
                {
                  "score": 11,
                  "content": "My first thought reading this as well. An adult who has to excuse themselves for **10 entire minutes** to laugh at something their niece worked extremely hard on is embarrassingly immature, and a wife who was witness to all of this and still made a comment about how displaying the animal made her “uncomfortable” go perfectly together and I totally see why they’re a couple. Just two people with absolutely no regard for the feelings of others. A match made in hell.",
                  "id": 290,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Hopefully a sterile match...",
                      "id": 291,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "Yup. OP is dumb and thoughtless but the wife is straight up cruel.",
          "id": 292,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}