{
  "post content": "New account because my boyfriend follows me\n\nI (24f) just recently moved my boyfriend (28m) of 5 months into my apartment. Things have been smooth sailing until I got my period three days ago. I usually use tampons and throw them away wrapped in toilet paper in the trashcan (with a lid). The other day my boyfriend barged into my office space yelling about have I was 'disgusting' and how 'he shouldn't have to see that stuff' (while i was in a ZOOM CLASS, luckily muted thank god). I got pissed that he was having such an over the top reaction, in my opinion, and asked what he would like me to do with them instead. He said that he literally almost threw up because he could see the blood soaked through the toilet paper and he would prefer I throw them out in the trash bin outside.\n\nI told him he was being a a bit dramatic but if it bothered him that much I would use more toilet paper to wrap them up but that I would not be walking my used products through the kitchen just to throw them out outside.\n\nSince we had that talk he goes in the bathroom after me every time and tells me if I 'used enough' to cover them up. Well I have been getting pissed and said he's being a creep by checking the trash can after me and if its such a big deal he should get his own trash can. This upset him but he said he would stop checking. Except he didn't, he just stopped reporting it back to me.\n\nSo heres where I might be the a-hole,\n\nToday I just threw my tampons into the trash without any toilet paper but underneath some other trash that was already in there. When he got up (at around 11am) he legit screamed and called me cruel for forcing him to look at that. I told him that he wouldn't have had to look if he wasn't 'inspecting' the trash. He teared up and said he wasn't used to living with a woman because he never has before (his mom passed when he was very young). I told him 'well maybe you aren't ready to live with a woman then'. He got quiet and said he was going to go walk to clear his head. That was a couple of hours ago and he's ignored all my calls and texts except to say that I am not being empathetic to his feelings. I want to be understanding and really thought separate trash cans would be a good solution but he was making me uncomfortable about a very natural part of my body and I don't want to go through this with him every month.\n\nHis friend texted me telling me i'm being 'gross' and a 'bitch'.\n\nShould I apologize? or is he being dramatic?\n\n&#x200B;\n\nUpdate (sorry its long, guess I had a lot more to say):\n\nI'm sorry for not responding to any of these almost 400 comments is a little overwhelming, but know I've seen them and they've given me the courage I needed for this convo.\n\nHe came back at around 5pm and he was very apologetic and weepy (I have no idea what he was doing as that would be a long walk). Apparently he texted his group chat about this (which is when I go that lovely message from his friend) and two of his female friends ripped him a new one.\n\nHe told me he doesn't want to lose me and that he would like to try separate trash cans. He told me that he's not sure why but just the thought that it could be in the trash uncovered skeevs him out but he could have tried more to get used to it. He told me he loves me and this (living with a woman) is all new to him.\n\nI told him that hes not just living with a woman, hes living with me, someone hes supposed to love. I told him that he embarrassed me and disrespected me bringing all his friends into this private matter and I don't know if thats something I can forgive easily. I showed him what his friend texted me and asked if he agreed with this sentiment. He said 'of course not baby im so so so sorry he said that to you'. I told him hes got some stuff to work through and I'm not sure if we are going to work out if he's going to blow up like this for our first problem (which in my opinion is small).\n\nHe. started. sobbing. Asking me not to leave him, telling me how much he loves me, asking me to forgive him. I asked for some time to think and if he can get a friend to pick him up (he does not have a car) and then went off to my office space to get some space.\n\nHe was outside the door knocking and asking me how I could just walk away from him when he was crying like this. I told him that all of this was overwhelming and I would talk to him when we were both calm and had time to think.\n\nHe just left with a friend (not the one who texted me, thank goodness) and I am not sure what to do. I definitely don't feel like the a-hole but I feel bad for making him cry. I fully believe that men should feel comfortable showing their emotions but his reactions have been such a turn off and I'm not sure I see a future for us. It feels silly because ultimately this is so small. I will update in another post if there is anything more to say.\n\nEdit 2: I am NOT shaming him for having emotions, men should be allowed to express themselves openly and honestly. The turn off has been these past three days, him texting his friends, him leaving for almost 5 hours but not letting me have space when I needed it, him initially saying my idea of two trashcans wouldn;t work but after feeling guilty coming around. I love that my boyfriend trusts me enough to share his emotions I just need some time when we are both calm. I think this is something we can work through but I also know this will be a lot of work that I'm just not sure if I'm ready to take on. Thank you all for youre kind words (wrapping up in toliet paper rolls or doggie bags is something I never thought about and will absolutely bring it up when I talk to him next)",
  "id": 1,
  "comments": [
    {
      "score": 12981,
      "content": "NTA. Honey, if this man is uncomfortable around women's natural bodily functions then he definitely isn't ready to live with a women. What would happen if you started your period during sex? Would he gag and still call you gross? Time to rethink if he's even mature enough to be in a relationship.",
      "id": 2,
      "comments": [
        {
          "score": 3566,
          "content": "Exactly!! Imagine if they married and had a kid?? I mean god forbid she bleed afterwards.",
          "id": 3,
          "comments": [
            {
              "score": 1679,
              "content": "[removed]",
              "id": 4,
              "comments": [
                {
                  "score": 599,
                  "content": "These days Facebook blocked an AD from a period pad company because it showed a blood sheet... like really FB!? Oh I forgot, period blood is blue ... ffs\n\nThat’s why men need to have a strong female figure in their life to teach them that it’s okay and normal. Can you imagine if OP freaked out of a used condom, or a underwear with an ops wet dream material in it? \n\nNTA",
                  "id": 5,
                  "comments": [
                    {
                      "score": 179,
                      "content": "Or skidmarks? Some men are horrible for that.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 59,
                      "content": "An ad for postpartum care products was blocked because it was too realistic. \n\nThat's depressing.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "My mom never taught me anything about periods. But they don't bother me because I'm a fuckin adult man, unlike most \"men\". I'm so sick of these guys who can't handle basic shit like buying tampons because it might make them gay or whatever nonexistent shit they are afraid of. They need to grow up.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1151,
              "content": "And god forbid OP try to use menstrual cups. \n\nMy first time removing one ended up making the toilet bowl look like a Jackson Pollock. I did my best to clean it but missed under the toilet seat. You know what my husband did? He cleaned it up. Didn’t even mention it to me until it came up in convo months later. \n\nNTA, OP. I know it’s something different that your BF has to get used to, but he needs to figure out why he felt compelled to search for your used hygiene products.",
              "id": 9,
              "comments": [
                {
                  "score": 2166,
                  "content": "The first (and last) time I used a menstrual cup, it turned and got stuck. I spent an hour trying to get it out. Eventually decided I needed to go to the emergency gyno at the local hospital because it was beyond stuck. What did my fiance do when I texted him about it? Left work early, came to the hospital with food for me, actually tried to *fish it out himself* in the toilets and got blood all up his hand. He washed his hand and laughed (in a nice way) about how ridiculous the situation was. At no point did he complain about the inconvenience, the blood (that was literally on him as well as me) or make me feel bad for something natural or that I tried a new menstrual product and it went wrong. He then bought me some of those reusable absorbent pants because \"I get why you don't want to use the cup but you were so excited about having an eco friendly alternative, I hope these do what they say they do.\"\n\nGrown up men who are mature enough to be in relationships with women accept periods as a normal fact of life.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 677,
                      "content": "That's both a horrific and lovely story! Your Fiancé is amazing!",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 347,
                      "content": "This! I totally got one stuck too and my boyfriend at the time, now husband, had to go up in and get it out. I was laying on a towel on the floor and it was rough when it came out. I was so embarrassed (and hormonal) that I started crying and he just giggled and said it’s natural and not a big deal and we got a bath together. OP needs to have a talk with him about how women work and how he should react.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 145,
                      "content": "This makes me happy. You guys are wonderful. And don't give up on the cup, there are a few different designs out there and one might work better for you! It took me a bit of getting used to (definitely a lot of clean up required at home during changing time, and once I accidentally dropped it in the toilet at work) but now it's all smooth sailing and I'm so glad I persevered.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 82,
                      "content": "My ex wife told me(F) that she was disgusted because I started my period during sex (unexpected not on the usual monthly timeline). I spent the next seven years avoiding sex anytime near my period because she said that. My ex-bf literally laughed and then giggled and was like we can put a towel down? Nbd. My gf now is like really? That was ever a problem ever? It's not a man vs women issue it's an understanding of what's going on. Oh my ex wife she also made me take every tampon ever out to bin outside because that's how her dad taught her to do it. Because it gross. So yeah if you're a dude that doesnt get periods maybe read up at the very least. Before you act like OPs bf. If you're a chick that acts like it's some forbidden thing maybe have a convo with one of your more open friends. I've had my coworker dig thru my locker for a tampon (while I was away) because she knew I'd say yes because we should all understand it's not something we can control and its nothing to be ashamed about.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 74,
                      "content": "Thank you for sharing this wholesome story.  ( the hubby part is wholesome not the menstrual cup getting stuck .) hope OP finds someone this understanding and mature",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 63,
                      "content": "I've dated guys like that. I'm not squeamish about my own period, but I have so much trouble sharing that aspect of my life with men, and I don't know why. Some of them have been more comfortable with it than me.  I was never EVER taught to be ashamed of it or my body. I'm not, and never have been ashamed of it around women (well, maybe when I was like 12), but around men I'm dating? It is so difficult for me. I'm very comfortable with my sexuality, but in private, I'm not big on PDA for me, I'm not a prude with other people, but I'm weird about me. It's completely irrational. I'm 33 years old. I need to get over it.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Yes yes yes. Congratulations on having such an amazing PARTNER, in every sense of the word. Because that’s what I believe a significant other should be. We take care of each other! We deal with the gross things that come with living and sharing a full life with someone. No one likes cleaning up vomit but if your significant other has the flu or a bad hangover you hold their hair and help them out.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Are you me? This exact thing happened to me. Hubby tried to get it out too, but we were at home and the bathroom was a murderscene. He dropped me to the hospital, came home and cleaned it up. Barely batted an eye. He was 22 and his parents are boomers and his sister acts just like them so periods were NEVER discussed in his house growing up.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "He's a keeper.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "My mom bled a lot after she had my older brother, and was super embarrassed about it. Once she got blood on the bathroom carpet without realising, and tracked it around the house. She came back to the bathroom after following the blood trail to find my dad frantically trying to clean it so my mom wouldn't get upset",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 83,
                  "content": "That just happened to me last month! I legit flung blood all across the toilet seat, floor, and bathroom rug. I have since learned how to position myself to prevent that happening. \n\nOP, your boyfriend is being rude as hell and incredibly immature. Once someone calls anything to do with your vagina \"disgusting,\" they should never have access to it again. NTA.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Positioning is key! I also found the cups with a valve or a pull tab to release the suction are easier to remove with minimal mess.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "This-anyone who can't handle the idea what comes *out,* doesn't get to put things *in*.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "I think her bf would’ve had a stroke if he had to see that. And that’s a true partner you got there! That’s how it should be!!! Kudos to your husband for stepping up!",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Your husband is a treasure",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "In the first month that my husband and I were dating, I bled through my pad, underwear, and sweatpants onto the bed. What did he do? Encouraged me to take a hot shower, washed my clothes, and grabbed a pair of boxers and pajama pants from his clothes, and a pad from my purse for me for when I was done. He also cleaned the bed and got me a warm towel. He was 22, I was 26.\n\nWe’re now married. Periods are normal. Messes happen. A good partner understands all that.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Imagine his reaction to her boiling her menstrual cup to clean it.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "This was going to be my point. After my c section, my husband gave me a shower, didn't even blink at me asking to help. - in the hospital and held me the entire time. I imagine he saw all types of things. This dude would probably have a toddler tandem. Good god.",
              "id": 28,
              "comments": [
                {
                  "score": 46,
                  "content": "Yep. After my section, hubby had to help me onto the toilet because I couldn't bend at all alone. Didn't bat an eye. Helped me shower, got sprayed with milk, cleaned sheets that got blood on them, examined my incision for signs of infection... the whole nine. Has never once so much as turned an eyelash. That's what support looks like, this dude would have needed therapy",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I guess we managed to get the stand up guys!!! We as women need this type of man in our lives with all the turmoil we put our bodies through!!",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 66,
              "content": "I had subchorionic hemorrhaging with my youngest. My husband saw soooo much blood. I even had to sleep on a puppy pee pad at one point so I wouldn’t bleed through onto the bed in the middle of the night. I can only imagine what a whiny baby OP’s boyfriend would be in the same situation. \n\nNTA.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "Afterwards? I mean yes,  we bleed after birth, like a lot for days, but imagine if this guy saw her or any woman give birth to a child",
              "id": 32,
              "comments": [
                {
                  "score": 25,
                  "content": "I could ONLY imagine!! I can hear him now- “ew this is gross- I can’t watch!”",
                  "id": 33,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Totally!!",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Not just bleeding after—the stuff my husband witnessed when I was in labor and attempting to push the baby out! (And I won’t even get into what he saw in the operating room when I ended up with a c-section.) If this guy cant look at a used tampon, he’s not ready for any of that!",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I just started sleeping with someone, I've also switched BC to upgrade my no more babies protection. I got my fucking period early in the middle of a very fucking great time last week. \n\nI didn't notice cos I'm fucking blind with no contacts in the dark, but he did and was like one second... Grabs a towel (chose the dark one out of the 2 good man), puts it down and continued like he never had to get up. I put it together when he went for the towel but hey who am I to complain if he has no issue. Just means a shower after and I'm all about the shower.",
              "id": 36,
              "comments": [
                {
                  "score": 4,
                  "content": "And this is the perfect example of a great husband! Why ruin a good night!! Especially when you FINALLY get the chance to - when having little ones - or even teens running around to have some “adult time.” That adulting time is precious!! Lol nothin a quick shower can’t fix!!!",
                  "id": 37,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I did explain in the shower, I swapped BC to make sure our FWB situation doesn't get us another kid, we both have enough of our own and likely just a breakthrough situation with the hormones being played with. \n\nHe was just like.. but your not in any pain yeah? And you didn't have to do that for me... Well it was for me but you get a benefit to mate haha. \n\nI'm not bothered by it honestly, I find sex on my period seriously improves my cramping and pain issues I have associated with my periods. Its nice to find a man who's like.. damn I don't get to eat out tonight, I'll make up for that next week lol",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Right? So much blood after birth. But what if the baby was a girl. I’d hate to see his immature reaction to menstruation affect a daughter too. So many of us already have to battle shame about it from bad upbringings, I wouldn’t want that passed on to the kids. This would legit be a deal breaker for me.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1333,
          "content": "If you cannot stand the existence of periods you have no business touching a vagina.",
          "id": 40,
          "comments": [
            {
              "score": 171,
              "content": "This! Fucking THIS! 👆",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 165,
              "content": "i'm gonna cross stitch this quote and hang it up in my house",
              "id": 42,
              "comments": [
                {
                  "score": 30,
                  "content": "With flowers",
                  "id": 43,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Georgia O’Keeffe-style flowers.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 55,
              "content": "100%. It is astounding how many men think they are entitled to being allowed to stick their dick in a woman’s body but the natural processes that go along with the vagina are disgusting. It’s not some magical pleasure hole when it’s convenient to you and then this forbidden sarlacc pit of shame the rest of the time. It’s a part of our fucking body 24/7 and if you can’t handle it, then don’t fucking come near it",
              "id": 45,
              "comments": [
                {
                  "score": 9,
                  "content": ">It’s not some magical pleasure hole when it’s convenient to you and then this forbidden sarlacc pit of shame the rest of the time.\n\nHeisenberg's Vagina. Until you ascertain the state at that particular time and collapse the uncertainty, it is both the magical pleasure hole and the sarlacc pit of shame :D",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 384,
          "content": "Exactly the thing that bothers me as well is that he told his friends and shared all their business with them. I’d be equally pissed about that because what happens in our relationship stays in our relationship you don’t have your friends attack me because you’re all a bunch of immature men. He doesn’t sound ready to be in a adult relationship and she should rethink having him be there.",
          "id": 47,
          "comments": [
            {
              "score": 112,
              "content": "I agree! Until the final sentence, I was thinking, \"OK, he needs to grow up, you aren't being an asshole, but give him another chance.\" \n\nBut telling his friends? That's bad.",
              "id": 48,
              "comments": [
                {
                  "score": 194,
                  "content": "Telling his friends, then berating her for not comforting him for feeling bad after he was a dick to her. I think men should absolutely be able to show their emotions, but pushing the emotional labor of working through hurting your girlfriend back on your girlfriend is bad. This guy is not ready for an adult relationship",
                  "id": 49,
                  "comments": [
                    {
                      "score": 76,
                      "content": "“pushing the emotional labor of working through hurting your girlfriend back on your girlfriend is bad” this is EXACTLY what I was thinking when I read it.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "agreed. This man 100% thinks women and girls cry for attention and not out of an emotional response. His doing that shows that’s definitely why he cries. \n\nit’s extremely manchildish behaviour and a terrible sign. \n\nLike sure he might grow from this but it’s not OP’s problem, and if it was me, I’d be kicking him out, the bin checking pervert.",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "There are friends I would confide in after a fight, but never a group chat and not something that involved a fight about bodily functions or hygiene.  Some things are just too personal to be shared",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 338,
          "content": "Can we talk about the fact that he is *checking the trash can* to find them? It seems like he WANTS to see it.",
          "id": 53,
          "comments": [
            {
              "score": 134,
              "content": "Especially in the last instance, since OP mentions that they were under some other trash.... Is he digging through it to check to see if she wrapped them??",
              "id": 54,
              "comments": [
                {
                  "score": 37,
                  "content": "Yeah that stuck out to me too. He’s “skeeved out by the thought that he might see them by accident” but then goes hunting for them under piles of used tissues and dental floss? This dude has serious issues that he needs to resolve with a therapist before he’s ready to be in an adult relationship.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Eek. That's kind of creepy.",
                  "id": 56,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "Right. Like then let her have the one with the lid and he can have another smaller one so he never has to see.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 182,
          "content": "NTA. Time to wrap that boyfriend up and put him in a bin. With a lid of course.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 181,
          "content": "Thats not a man, thats a boy with his reaction",
          "id": 59,
          "comments": [
            {
              "score": 78,
              "content": "Nah even my six year old son is more mature with periods than this.",
              "id": 60,
              "comments": [
                {
                  "score": 7,
                  "content": "Shit, my son is the main event in the women's restroom when I'm on my \"blood pee.\" Nothing gets a room full of women giggling quite like listening to a four year old loudly discuss menstruation with his mommy.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Lol. I love that! My son has recently started trying to come up with euphemisms for period things when he talks to me (I think his dad and soon to be step-mum might be giving him the ol' 'cant discuss body things using the actual words cos that's rude' deal). White crayon that turns red was my favourite. He meant tampon 😂😂 But I am definitely telling him it isn't rude and these things aren't taboo and trying to combat the nonsense from his other influences as much as I can to keep him from ending up like OPs boyfriend!",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "That's what I thought is how old are these people that the friend also had to tell her she was gross and a bitch, that's late teen mentality.",
              "id": 63,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 160,
          "content": "Not remotely ready to live with a woman. \n\nOP, make sure you wrap this dude in enough TP when you toss him out.",
          "id": 64,
          "comments": [
            {
              "score": 134,
              "content": "And NOW he’s trying to make her feel bad for not consoling him when he’s upset that he wronged her (and that it might have consequences for him)\n\nNot ready for a relationship, I’d say.\n\nOP, this is manipulation, intentional or not. Hurting someone and then crying about it and demanding comfort from them is not okay.",
              "id": 65,
              "comments": [
                {
                  "score": 50,
                  "content": "Yeah, his reaction is totally over the top. I mean, I am all for men expressing their emotions, but his behavior is just overwrought and way too overemotional. Tears over a woman's bodily functions is just too much. I would back away from that dude immediately. Best case scenario is that he's not mature enough to be in a relationship. Worst case scenario is that he's emotionally volatile and manipulative, and that's a major issue.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I don't even get why we're approaching it from the \"men expressing themselves\" angle. When we talk about how men should be allowed to express their emotions more we mean they should feel comfortable acknowledging that they have them and not feeling ashamed of it, not using the expression of emotions to manipulate people",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 137,
          "content": "On top of the issue where he needs to deal with his discomfort with periods, this dude really, really needs to rethink how he deals with other people doing reasonable shit that bothers him. If I had a partner who really couldn’t handle the sight of blood, I could deal with their need for me to carefully hide evidence of bleeding — IF they came correct on the issue. That means \n\n— acknowledging it’s his issue, not yours\n\n— asking for reasonable accommodations as a favor/kindness in the spirit of accepting each other’s needs\n\n— not yelling at or blaming you for his behavior (no one is forcing him to look at anything)\n\nTo me those red flags are at least as big as the ones about his discomfort with period blood.",
          "id": 68,
          "comments": [
            {
              "score": 6,
              "content": "Yes!\n\nWe all have irrational things that bother us. Sometimes we might ask people to help us deal with it by acting in certain ways. It's *okay* to ask for help from a partner, but it's so so important to acknowledge that it's a 'me' thing and apologize for the inconvenience, trying to solve it as a team. Not the melodramatic mess that this turned into...",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "Frankly, if the guy isn't ready for what comes out of a vagina, he doesn't have the right to put anything into one.",
          "id": 70,
          "comments": [
            {
              "score": 20,
              "content": "best. answer.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 111,
          "content": "Yeah, this is a red flag for me. I’ve definitely had a few experiences when I was younger where I randomly started my period during sex, which was humiliating but the guys I was with made it better by not giving me a hard time about it.\n\nI do agree with using more TP just because that’s what I do myself, I don’t really like seeing or potentially touching bloody TP emptying the bin... mind you my bin is also open. \n\nFreaking out and inspecting is over the top and he really needs to realize that women have periods and there’s nothing gross or shameful about it. Asking you to take them to the trash outside is ridiculous... I can’t imagine on a heavy flow day walking outside to throw a tampon out, especially during the winter or something.\n\nI’m 32 and I’ve dated a fair bit, and every man I’ve been with (and this includes my first bf in my teens) was never judgey or anything but helpful when it came to periods, and would run out and buy me tampons or painkillers, prepare hot water bottles for me, etc. I would say at least half of the men I’ve been with sexually were comfortable with period sex, although it’s not something I personally enjoy (shower being the only exception). And not all of these men grew up with a female figure in their lives, either. \n\nHis excuses are BS. It would be so easy for him not to go through the trash or “approve” the amount of TP you’ve used. My mom has OCD and one of her “quirks” (drove me crazy when I lived at home) was doing things like this, she would go through the bathroom garbages and the recycling bins (she would also obsessively count her cigarettes and keep a log of how many she had, in case we stole any lol). Have you noticed any OCD tendencies in him? This post doesn’t really make it sound like it on its own, it just reminds me of my mom who DOES suffer from OCD.",
          "id": 72,
          "comments": [
            {
              "score": 74,
              "content": "My period has always been erratic, and I got it during my honeymoon. I thought husband would find it gross but his words were, \"what use is a warrior without blood on his sword.\" Made me laugh and get over the hangup.",
              "id": 73,
              "comments": [
                {
                  "score": 16,
                  "content": "Okay this comment made me laugh but the thought of period sex makes me want to hurl, not because it's gross but because it *hurts*. I get so hideously bloated and my last few have made me wake up literally whimpering in pain and writhing in bed in the middle of the night despite pain killers. The thought of anything getting up there that isn't a tampon makes me want to curl up in the fetal position. If I'm with somebody and they're feeling frisky, I've got at least two other avenues they can stroll down, and that's just how it'll have to be.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yeah, I'm not super into it (I'm asexual so I'm not in general into sex) mostly because the smell of period blood bothers me. It just smells... Different. But we do cosplay and ren faires so I had to laugh at that.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "I’ve always heard “a real sailor doesn’t fear the Red Sea” but I love your husbands.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3294,
      "content": "NTA!  Don’t apologize for menstruating. You did consider his feelings. You used more toilet paper and offered separate garbage cans. What more could you reasonably do?  He’s being unreasonable and very childish. Did he tell his friend to text you??  WTF",
      "id": 77,
      "comments": [
        {
          "score": 650,
          "content": "Fuck no, it's not gross NTA. He needs to grow up. It's not like you deliberately put them in bed or something.",
          "id": 78,
          "comments": [
            {
              "score": 594,
              "content": "I mean, bloodied products are a bit gross (and this is coming from a woman who uses them) but no more so than a snotty tissue or a band-aid. You throw them away and then they cease to be a problem.\n\nUnless of course you deliberately dig through the trash for some stupid reason, in which case you deserve to be grossed out because you’re DIGGING THROUGH TRASH.",
              "id": 79,
              "comments": [
                {
                  "score": 135,
                  "content": "Right?! How is digging through trash not grosser than seeing a used tampon?",
                  "id": 80,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Exactly. This exactly.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Bathroom trash, no less!",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 391,
          "content": ">Did he tell his friend to text you?? WTF\n\nI always want to know who these buttinsky friends are! I think I'm a pretty loyal friend, but if anyone asked me to text their SO over a fight over menstrual products I would laugh in their face.",
          "id": 83,
          "comments": [
            {
              "score": 110,
              "content": "I think it's selection effect. Basically, a combination of he texts whoever he thinks will be most sympathetic to his view combined with the unobserved people (from the GF's perspective) who don't send stupid texts to her. So perhaps he texted 10 people and 9 told him (rightly) to stfu. But the 1 that didn't then texted her.\n\nStill a stupid choice on BF and number 10's part...",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Whenever someone adds that detail, I just assume the post is fake.",
              "id": 85,
              "comments": [
                {
                  "score": 19,
                  "content": "I was just thinking that!  Then I saw your comment.  It's always a clearly NTA post then ends with some variation of....\"but I don't know because all of our friends and family are texting calling me an asshole\"",
                  "id": 86,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Yeah. It happens. A lot. We cut out a huge section of my husband's family because of the drama. 1 person starts an issue, everyone else jumps in, family bitch fight live on social media. \n\nLife got much calmer when we blocked a dozen or so people.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Wdym bro the obvious solution here is she just needs to stop menstruating. Its so obvious I'm pissed people still ignore this simple fix. Stupid women. Huge /s and OP is NTA",
          "id": 88,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2267,
      "content": "NTA - I think there's more to deal with here than him just \"not living with a woman before'. Why the obsessional checking the trash? Why the extreme reaction? Normal people don't scream and get teary when faced with an unfamiliar situation, especially once it's been explained to them, and a solution to their discomfort has been suggested. He obviously has much deeper seated issues, and he really needs to look into addressing them.\nI hope you two can talk constructively about this, and he can overcome this immature way of addressing things that make him uncomfortable.",
      "id": 89,
      "comments": [
        {
          "score": 920,
          "content": "I would also warn OP that staying with this guy could start to give her weird hangups and shame about her own normal body functions.\n\nI just imagine a domestic partner running into the bathroom and aggressively sniffing the air every time their SO leaves it, and then screaming if the air has a whiff of poo (which is very similar to what he's doing). Imagine what kind of hangups that would give a person about pooping!\n\nOP, you shouldn't stay in this situation. I think it's time for an ultimatum: your boyfriend gets over his bizarre neurosis and takes responsibility for this unreasonable obsession and takes steps to address it as the psychological problem it is, or the relationship has run its course.",
          "id": 90,
          "comments": [
            {
              "score": 107,
              "content": "[removed]",
              "id": 91,
              "comments": [
                {
                  "score": 100,
                  "content": "Exactly!! OP's bits are only their business.  I just had a miscarriage (very early on, was over before I knew I was pregnant, not sure if it \"counts\" tbh), and I told my partner I don't want him telling anyone.  Just like when I asked him not to talk about my period to others, cuz its MY business.\n\nBesides, clearly his friends are just as immature if they didn't immediately say \"whoa dude, TMI, and what's the big deal?\"",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 186,
          "content": "Right? And that is SUCH a manipulative ploy to guilt-trip you with a “my mom died” excuse for his behavior (which is entirely unrelated to his mom’s passing). A second trash can was such a constructive solution for OP to offer and him resorting to manipulation rather than compromise is a HUGE red flag—not even considering that he then aired it to his bros. This guy is better off as a lesson learned, OP. He will cause you nothing but shame and self-doubt that you don’t deserve.",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 77,
          "content": "Maybe he's just an asshole. It could be some sort of other issue, I'm just saying you don't need to have issues to be an asshole.",
          "id": 94,
          "comments": [
            {
              "score": 102,
              "content": "On one level, I'm with you. But screaming and tears? Seems like way too much a of visceral reaction to a trivial thing, to me.",
              "id": 95,
              "comments": [
                {
                  "score": 8,
                  "content": "Could be. You have a point. Actually where are tears mentioned?",
                  "id": 96,
                  "comments": [
                    {
                      "score": 34,
                      "content": "I don't know how to quote the op, but in the last big paragraph she says something along the lines of  \"he teared up saying it's because he's not used to living with a woman.\" It just seems like a really emotional response to me.",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "Yeah, that was my thoughts as well.  Like what the hell is he putting in the bin several times a day that he sees the used menstrual products?  NTA.",
          "id": 98,
          "comments": [
            {
              "score": 4,
              "content": "Right, I lived with a dude and he didn't even think to have a bathroom trash can.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1691,
      "content": ">I (24f) just recently moved my boyfriend (28m) of 5 months into my apartment\n\n\nHope he hasn't unpacked yet. \n\n\nThere are women who, for some reason, stay with dudes who have a childish fear of period related stuff. But checking the bathroom each time is going way further even than that. \n\n\n>His friend texted me telling me i'm being 'gross' and a 'bitch'. \n\n\nAlso a dealbreaker. Who the fuck has friends text their partner to insult them? That's insane behaviour. \n\n\nNTA, kick the dude out.",
      "id": 100,
      "comments": [
        {
          "score": 288,
          "content": "Right?? Like, up until that point I was thinking maybe it was potentially salvageable but when I read that his friend MESSAGED HER AND CALLED HER NAMES. Who in their right mind thinks that's acceptable? That he even has a friend willing to do that, and that he complained to the friend about it, means he's already checked out of the relationship or he has such little maturity and respect for her that he would allow that and encourage that to happen. Disgusting. NTA, run while you still can!!",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 139,
          "content": "My SO has a genuine phobia of blood and still isn’t this childish about my period.",
          "id": 102,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 54,
          "content": "NTA.  I read the update.  Lots of emotional manipulation happening here from the dude.    \n\n\nThrow out the whole man.  He's too old to be pulling this shit.  He's not 12.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "And he moved to his girlfriend's house and demanding she be \" considerate\" and making rules around HER goddamn house. The AUDACITY! And he does not even have a car, goes to HER office for space. As far as I saw, i see noting he can bring to her life aside from being like a 3 year old. Should be kicked out.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "This dude Beta AF if he can’t handle a little period blood not to mention running off and crying about it to all his friends especially something like that which can’t be helped. Now he’s trying to cry about the possibility of her leaving him for actin like a child. Fück outta here.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "[deleted]",
          "id": 106,
          "comments": [
            {
              "score": 4,
              "content": "So many posts here from women with boyfriends who are assholes and jobless. \n\n\nI know it's a Covid economy out there but holy crap, how does anyone take this kind of abuse from someone completely dependent on them.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 888,
      "content": "NTA. I'm a guy. This dude sounds pretty manipulative. I don't care if your mom died, women get periods and it doesn't take a saint to be understanding of the fact that blood is involved and that as the guy in a relationship you're gonna see it. This dude was seriously LOOKING THROUGH THE TRASH to make sure you were wrapping your products up, then got all sulky when you stood up for yourself.\n\nIf he doesn't apologize for being manipulative and come to some understanding that you need to dispose of your products like any normal person does, you should tell him to beat it. Hell, I'm grateful I don't have to go through a monthly cycle as a man and carry pads in my car in case of a friend's emergency and don't get squeamish if I see a family members' product in the trash. It's life, get over it and have some compassion yaknow?",
      "id": 108,
      "comments": [
        {
          "score": 718,
          "content": "Seconding the manipulative thing. Leaving aside the period stuff (which: YIKES, OP), the \"how can you walk away from me when I'm crying\" is a huuuuge red flag. That is not \"man comfortable expressing his emotions\" that is \"but I am crying to make you comfort me why aren't you doing what I want?\"  \n\n\nThink seriously about this, OP. Especially as you say this is your first conflict with him, this is a veritable banquet of warning signs.",
          "id": 109,
          "comments": [
            {
              "score": 140,
              "content": "I had this exact same thought, and I wish this comment was higher up in the thread.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "Yeah, I stupidly married one of these types.  Do not recommend.  Throw out the whole man.",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "[deleted]",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Yes and noticed how he’s the one who did something wrong (he even “admitted” it) yet she’s the mean one?",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 93,
          "content": "NTA, also all the crying and sobbing and begging. Because he saw some blood in the trash. Wonder what he would act like if an ACTUAL problem happened.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I thought the same thing! I dated a guy who used a lot of these tactics to manipulate me and gaslight me into thinking I was the problem.  Messed me up for years!  I hope this girl runs for the hills.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 726,
      "content": "NTA. Everything about this situation is a red flag. He is acting like a child. People sometimes have blood come out of their bodies. It’s normal. He wouldn’t carry on like this if it was a bandaid.",
      "id": 116,
      "comments": [
        {
          "score": 280,
          "content": "Or maybe he would.  What kind of fucking weirdo checks the trash for the very thing he doesn't want to see?  Lol this is so bizarre.\n\nEdit:  Her update makes this more bizarre.  What kind of fucking weirdo asks a group chat about their girlfriend's tampons?  How does one even phrase the question?",
          "id": 117,
          "comments": [
            {
              "score": 88,
              "content": ">Edit:  Her update makes this more bizarre.  What kind of fucking weirdo asks a group chat about their girlfriend's tampons?  How does one even phrase the question?\n\n... I'd assume it goes something like \"My gf keeps throwing her tampons in the trash. I'm disgusted by it and want her to go out of her way to throw it outside. She just told me I'm not ready to live with her. AITA?\"\n\n(Edit: And then his female friends go \"hell, yes, if you love her, go apologize you twit\" and some of his male friends go \"ewwww periods remind me of grade 7 sex ed grosssssss.\")",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 106,
          "content": "Used tampons & other feminine products go in the trash. So do used condoms. Anyone ever heard of a woman freaking out on her boyfriend because he tied off a condom & threw it in the trash can? No. Because it’s a container for a bodily fluid that needs to be disposed of appropriately in the trash, & neither period blood or semen deserve freaking out over. And my guess is OP’s boyfriend would think tossing a used condom completely normal because it’s boy stuff, not girl stuff. OP is NTA, & OP’s boyfriend needs to take a long walk off a short pier.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "A huge red flag is the guy fully attempting to gaslight her like she should be the one who is sympathetic to him for him being TA. \nThe heck is that about? So glad that his friends tore him a new one, he deserves it. \nIt’s so wack how we all talk about piss and shit and dicks all the time regardless of gender but as soon as a bleeding vulva comes into the convo it’s like “ew gross”. It shouldn’t be shameful to bleed. \nAny time anyone has tried to come for me about it I rightfully tell them to go fuck themselves.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "My boyfriend hates blood because of a bad doctor visit as a kid. I've left bloody tissues in the toilet because it didn't flush all the way, had accidents in my sleep, bleed during sex. Even though he hates blood he has never once shamed me and he didn't grow up with his mom and only has brothers. The difference is he's a decent respectful person.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 465,
      "content": "NTA - Your boyfriend sounds about 13 not 28. His reaction is over the top and implies having your period is disgusting or really wrong",
      "id": 122,
      "comments": [
        {
          "score": 113,
          "content": "You are being generous with the age, i thought boys already left the girls are icky phase, after they hit 7 years old",
          "id": 123,
          "comments": [
            {
              "score": 6,
              "content": "When I think of the most assholish of immature males, age 13 comes to mind. At 7 they're still relatively innocent.  At 13 they can do some real damage.",
              "id": 124,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 270,
      "content": "NTA. Your boyfriend sounds like he’s not ready for a relationship, not to mention not ready to live with someone. The fact that he actually told a friend about this and the friend proceeded to text you, leads me to believe he and his friends are very young and immature. Yikes. Sorry this happened to you.",
      "id": 125,
      "comments": [
        {
          "score": 44,
          "content": "Not even that he told *a* friend about it. He told a *group chat* of friends about it.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 227,
      "content": "NTA.  You are disposing of a necessary product in a waste receptacle with a lid.  That's exactly what is supposed to happen.  Wrapping in toilet paper or the next product's wrapper reduces the need to clean the can, but, really in a trash can with a lid is basically all that courtesy requires.  If he had an issue with blood in general (to the point that a shaving mishap would be difficult for him to handle), then you would need to be sensitive to that.  Otherwise, if he's ready to live with a non-menopausal person with a uterus, hygiene products are just part of the deal.  If he never lived with one before, there might be the occasional 'wait, that's how that works???' moment, but not the kind of reaction he's having.",
      "id": 127,
      "comments": [
        {
          "score": 87,
          "content": "I didn’t realize the garbage can had a lid until I went back and reread that. So definitely NTA. He doesn’t have to look if he doesn’t want to!",
          "id": 128,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 169,
      "content": "NTA your boyfriend needs to grow up",
      "id": 129,
      "comments": [],
      "relation": "Support"
    }
  ]
}