{
  "post content": "This is a bit long and I apologize in advance.\n\nI (21f) live with my ex (21m) in an apartment with 2 other guys. We broke up because of trust issues but stayed friends. \n\nThings were fine the first few months after we broke up (we broke up in July and I'm stuck on this lease till may 2022) but then he quit his job and suddenly he never leaves the apartment and I never have space from him. \n\nHe has a problem with not knocking on my door and will just waltz in here and start talking to me. He also will still act like we're dating sometimes (say he wants to merry me, how he only wants me, calls me his girlfriend, trys to cuddle me, etc) and I always need to remind him we aren't dating anymore. This is particularly annoying recently as I'm trying to date again. He also has no respect for people's time and never has. He doesn't time manage, ever, and I'm surprised he was never fired with how many times he went to work late. \n\nOn to the issue.\n\nYesterday he said he was going to his parents house today for the night. I was thrilled, I haven't had space away from him and to myself in months while he gets the place to himself every day as I work 40 hours a week + I have my university courses on campus. \n\nI messaged him several times today from work about his plans to leave and he promised he'd be gone before I got home.\n\nGuess what? He was sitting on the couch when I walked through the door. \n\nI was of course very annoyed as I had a night of pampering myself planned as I had been wanting a night to myself for ages. He noticed I was upset and bugged and pushed my buttons on why I was upset until I snapped and said \"I just wanted to be alone tonight! Why can't you just do the things you say you're going to do instead of changing all your plans around and ruining any plans I made around YOUR plans!\" He got upset and said \"well I took to long to leave so there's no point now\" \n\nThis really pissed me off because it meant the only reason he didn't go today is because he once again, decided not to watch the time. This has been a constant issue of his and its impacted me negatively in the past (forgotten to pick me up from places, makes me late to events, etc). Then he had the nerve to ask if I wanted a hug (for the third time during that conversation) and i just snapped back \"NO! I want to be ALONE! I was supposed to be ALONE! So leave me ALONE!\" He finally left my room but the night is ruined now as he could just decide to bug me whenever he likes, and he will, because he sucks.\n\nI went and got water from the kitchen a few minutes ago and I could tell he was mad at me. I hate when people are mad at me but I think I'm in the right.\n\nAITA for reaching my limit, wanting time apart from my ex, and yelling at him a tiny bit about wanting to be alone? I mostly just want to know if I should be apologizing as I guess he technically did nothing wrong.\n\nEdit: I'm accepting that we both are assholes here. I'm going to figure out a way to find space for myself without forcing him out of the apartment. Thanks guys ❤",
  "id": 1,
  "comments": [
    {
      "score": 67,
      "content": "ESH.\n\nIt’s unfortunate that you’re stuck in this situation with him (assuming there are financial or logistical reasons out of your control that prevent you from moving out earlier) and he’s obviously not at all respecting you.\n\nBut when you have a roommate, they might be there, they might not. You can’t be mad at someone for being in their own home.",
      "id": 2,
      "comments": [
        {
          "score": 21,
          "content": "Yeah that's why i thought I might be the asshole. However, it's not so much about him being home that annoyed me, but the fact that he never actually does what he plans which ALWAYS screws up my plans. If he hadn't said he was going to be gone tonight I wouldn't have been annoyed to see him home because you're right, it is his home too",
          "id": 3,
          "comments": [
            {
              "score": 44,
              "content": "To be honest though, he doesn’t really owe you an accurate schedule of when he’s going to be home.\n\nIf you have a roommate, you can’t really regularly make plans that rely on your roommate not being home.",
              "id": 4,
              "comments": [
                {
                  "score": 15,
                  "content": "I suppose not. It just feels more annoying because he's my ex and I really REALLY need a break from him as I literally feel suffocated. I wish I could leave for a weekend or something but I have animals so idk what else to do",
                  "id": 5,
                  "comments": [
                    {
                      "score": 17,
                      "content": "That’s the risk you take when you move in with someone you’re dating. You’re both on the lease, right? That makes it just as much his home as yours.\n\nCan you find someone to sublet your room so you can move in early? Or stay with a friend or family for a weekend? Honestly your options are going to be pretty limited here.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "Then find someone to replace you on the lease.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "I'm a little confused about why he feels like he can just barge in your room whenever he wants though. I have roommates and sometimes they're around when I don't want them to be. But I can always just go to my room to be alone. Do you not have a lock on your door? If you do, you should start locking your door.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": -4,
                  "content": "He does owe her and approximated schedule tho. Sure, he can cancel, but telling your roomate you're gonna be home when you said you wouldn't is the very least you could do.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 10,
                      "content": "If he wants to be nice and tell her when he doesn’t think he’ll be home, that’s an unnecessary but nice thing to do.\n\nBut he doesn’t have any obligation.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 32,
      "content": "NTA wdym he did nothing wrong? Dude is your ex, acts like your bf despite your protest/clear breaking up\n\nThen you can’t even have mental peace in your own home without him leaving entirely\n\nIs there really no options for you to be physically away from this clown? No relatives? No friends to move in with temporarily? \n\nPart of me wants to ask what you saw in this dude to begin with but I don’t think I’ll like the answer\n\nYou’re being TA to yourself at this point",
      "id": 11,
      "comments": [
        {
          "score": 13,
          "content": "I was going to move in with my friends but they decided I couldn't because 2 of them are allergic to my cat. Not upset at them for that obviously but it sucks. My family lives 3 hours away and I have a job and school here so I can leave unfortunately. I'm out of the house as much as possible these days which also sucks because I'm a total homebody and am really only comfortable surrounded by my things\n\nEdit: spelling",
          "id": 12,
          "comments": [
            {
              "score": 23,
              "content": "At that point I would check the Reddit sub for your university & see if anybody needs a roommate or check on google for listings in your area",
              "id": 13,
              "comments": [
                {
                  "score": 15,
                  "content": "That's actually so smart! I forgot my university had a reddit page. Thank you!",
                  "id": 14,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Np best of luck to you! Another idea is try the app neighbors since I’ve seen listings there for roommates or FB group for your university if you really can’t find anything \n\nAnyways glad to help & I hope you ditch this clown soon",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 25,
      "content": "Get a lock on your door. And nobody cares if the lease permits it -if you are careful you can take the old lock off and put it on without the landlord being the wiser. If you are nervous, hire a locksmith. With a lock, you would have at least a *little* damn privacy-at least in your own room.\n\nTF you ex wants to “cuddle you”. Get out of here with that. And he is a less than optimal “friend”, too. \n\nYou need to move out and block him. It will be sooo worth it. And nobody cares if he is upset. YOU are upset-and he sure doesn’t GAF. NTA\n\nOh. And my husband said you should get a date and bring him back, (warn him about your ex first, lol), and then have loud and enthusiastic sex. You deserve it.",
      "id": 16,
      "comments": [
        {
          "score": 9,
          "content": "All good ideas. Thank you so much ❤ that last part though, I probably won't do as I don't want him bringing his hook ups here so I don't want to be hypocritical lol",
          "id": 17,
          "comments": [
            {
              "score": 13,
              "content": "Even if you just get a door stop or 2 and wedge it from the inside.  It’s not like you need a lock that’s so secure it’ll keep out a burglar. Just something that stops him “waltzing in”.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Look into getting a portable door lock! Locks people out and they’re really sturdy and cheap. You really need to set boundaries and enforce them",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 18,
      "content": "Lock the door, every time you go in.  Eventually he will get used to he fact that he can't just waltz in and you may be able to leave it unlocked.",
      "id": 20,
      "comments": [
        {
          "score": 4,
          "content": "So simple yet so genius. Thank you!",
          "id": 21,
          "comments": [
            {
              "score": 6,
              "content": "Absolutely train him like you would a pet. NTA!",
              "id": 22,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NTA. Can you find a roommate to take your place until the lease is over?  Something?  Anything you can do?  It's obvious he's still stuck on you, but only wants you on his terms.",
      "id": 23,
      "comments": [
        {
          "score": 7,
          "content": "I have no where to go. I have pets, and I live 3 hours away from my closest relative. I'd live in my car if i didn't have a cat, snake, and bearded dragon to look after",
          "id": 24,
          "comments": [
            {
              "score": 2,
              "content": "No friends?  People who could take care of the pets, at least until you find a place?  What are you planning once the lease is up?",
              "id": 25,
              "comments": [
                {
                  "score": 5,
                  "content": "I'm moving in with two of my friends come May and I do spend spend few nights a week at their place. They try to help as much as they can by constantly inviting me over but like i said in a previous comment I am really only comfortable at home and don't like sleeping anywhere but my own bed so it's difficult",
                  "id": 26,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Can you find someone to take your place in your apartment and move in with them early?",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "ESH  just gently. He is overstepping and gaslighting and being creepy IMO. But you talk about texting him and how he comes into your room without knocking and how you have conversations with him. You should get a lock on your door, stop talking to him, block his number (roommate communication via notes on the fridge), get some noise-canceling headphones and make your room a safe space.",
      "id": 28,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "NTA. He said he would not be there, you planned some much needed \"me\" time and he decided to cancel without telling you anything. He'd be TA even if he were not your ex.\n\nAre you sure he was not waiting to see if you'd bring someone home? Considering he \"forgets\" you two are not dating anymore and everything.",
      "id": 29,
      "comments": [
        {
          "score": 4,
          "content": "No it's nothing like that, I don't being people to my place out of respect for him and when I leave to see other people he normally knows what I'm doing as I said, we're still kind of friends, and I tell him because I'm excited. He never likes hearing it but he literally does the same to me when he goes and hooks up with girls so 🤷‍♀️",
          "id": 30,
          "comments": [
            {
              "score": 2,
              "content": "I see. Less bad of a situation, then.",
              "id": 31,
              "comments": [
                {
                  "score": 2,
                  "content": "Oh yeah. He's not a bad person, I want to stay friends with him, but only as FRIENDS and he doesn't get that and I need space every once and a while",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "But aren't we all missing the point? Normal house mates have normal rules/assumptions like don't expect a schedule of when your roomie will be out. This is beyond that, he is bordering on harassing her as her ex. She didn't want him out so she could commandeer the shared spaces, it sounds like she wanted him gone so she could BE IN HER OWN ROOM without being harassed by him knocking on the door all the time, acting like they are still a couple. OP you need to enforce strict boundaries - get a lock for your door, if you can't, wedge a chair under the handle, anything. Tell him that when your door is locked you WILL NOT be answering his knocks. Stick to it. Walk away every time he acts like you are still together. Explain to him first that you will be doing this by telling him that you are glad your post breakup friendship is working but you want to ensure it continues to work and that means he has to acknowledge you are split up and will not be getting back together.\nNTA - if normal housemate etiquette applies here as everyone is saying then he doesn't get to act like he thinks he is still her boyfriend and take advantage of that privelige. He can't have it both ways.",
      "id": 33,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "ESH he’s your roommate so you both have rights",
      "id": 34,
      "comments": [
        {
          "score": -3,
          "content": "Yes but it wasn't about him being home, it was about him constantly ruining my plans with his bad time management. Idk though maybe you're right",
          "id": 35,
          "comments": [
            {
              "score": 4,
              "content": "He isn’t accountable to you nor does he owe you anything. If he changes his mind he has the freedom to do so. Try to get out of there ASAP",
              "id": 36,
              "comments": [
                {
                  "score": 1,
                  "content": "You're right. I need to look at this as what I can do, not what he clearly can't do. Thank you so much ❤",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "Honestly it feels like he changed his plans intentionally because of you, whether that was to see what you would do when you thought he wouldn't be home, or he just changed his mind and decided to stay home with you. I believe this because it seems very emotionally manipluative that he saw you were upset and didn't respect your boundaries by pestering you until you caved and admitted you were annoyed. At that point, he gave himself an excuse not to leave as he was upset/you were upset at him and it \"was so late.\"\n\nLock your door. Don't entertain his manipulation and look up the strategy \"grey rocking.\" NTA",
      "id": 38,
      "comments": [],
      "relation": "Support"
    }
  ]
}