{
  "post content": "Throwaway because some know my OG account.\nThis was pre covid when this happened, but I still think about it sometimes.\n\nSmall backstory: My (23f) friend (25f) has her son and was gushing on him constantly as I knew she would. Around the same time I was able to buy a house for myself with two floors and a finished basement.\n\nStory: Me- Me, F- Friend,J- F's son\n\nSo about a month after I moved into the house I invited F over to have some girl time. She was also kind of hounding me about seeing her son, who just started crawling.\n\nF and J came over and were doing pretty good. We put J in the living room so he could crawl around on the carpet and not get hurt. F and I were drinking coffee at the kitchen table which was just above the living room on a slightly higher level, so F and I had an extremely good view of J and the room.\nWell, the basement door must not have been fully closed as I heard the door creak open. I looked over to see J had opened the door and was about to go down the stairs.\n\nI got up so quick so the kid wouldn't go down and I got to him just before he tumbled down the first step. The stairs were wooden so if he fell, it would most likely kill him. The event went so quick that F had to ask what happened. I told her and she immediately grabbed J from my arms. She looked him over to see if he was ok then glared towards me. \n\nF: What is wrong with you? Leaving the door wide open like that! J could have fallen down the stairs and gotten hurt! It would be all your fault!\n\nI told her sorry, the door wasn't wide open and that I truly didn't know that the door wasn't fully closed. That answer wasn't good enough though.\n\nShe then began screaming about how I knew she was bringing J over and how I SHOULD (not could) have put a baby gate up in front of the basement stairs. She then started pointing out everything she thought SHOULD be baby-proofed (stairs, outlets, cabinets, etc.) in MY HOUSE. She then asked me if I would let my children live in such a house without baby-proofing anything. \nI answered by reminding F that I was sterilized the year previous, so children were not an option for me anyways.\n\nF's yelling caused J to get scared and cry (poor kid), to which F blamed me for. They left a short time later, but it didn't stop there.\n\nI don't use FB, but apparently F made a post about me being a b**** and putting her kid in harm's way.\nA huge argument started between her family and some of our other friends who knew about the situation.\nOne of my friends (E) asked why I was the one who ended up saving J when it should have been F's responsibility to watch her own kid.\nE ended up getting chewed out by F and the people who agreed for her (only her family).\nMost of our friends called her out as having the right to worry about her child, but she shouldn't expect everyone to accomodate for her or J. Especially when it means bubble wrapping their house for her kid.\n\nSo now I am here. I'm an a**hole for not baby-proofing my own house when I knew a baby was coming over?",
  "id": 1,
  "comments": [
    {
      "score": 6208,
      "content": "**NTA**\n\nDon't get me wrong, I don't consider shutting the door to a wooden flight of steps as \"baby-proofing.\" More like common sense.\n\nBut: it's her kid. She should have done a scan of the room and obvious potential hazards before putting him down for free-roam play.\n\nAnd her reaction in the aftermath? Outrageously inappropriate. Egregiously unacceptable.\n\nEdit— A couple people have congratulated me on my correct usage of the word egregiously. Do people generally not know how to use this word? It's probably one of my favorite words. I overuse it...but I never knew it to be one that was chronically misused?",
      "id": 2,
      "comments": [
        {
          "score": 1305,
          "content": "Agreed. And part of that reaction may be her own guilt - she didn't stop her kid from going down the stairs, YOU did. But that doesn't give her the right to go off on you (or anyone else who is backing you) especially on social media.",
          "id": 3,
          "comments": [
            {
              "score": 483,
              "content": "Yup. I could see her initial reaction (though still completely inappropriate) being out of panic and fear, but afterwards... Nope, she needs to realize that she has more responsibility there as, you know, the mother!",
              "id": 4,
              "comments": [
                {
                  "score": -3,
                  "content": "I’m sympathetic because she’s a first time mom and EVERYTHING changes when an infant becomes mobile. The truth is, we all get scared by close calls sometimes. My toddler tries to kill himself regularly. Comes with the territory with some kids. \n\nIdeally this new mom will find a supportive community to reassure her that this stuff is par for the course and as long as she learns from it, it’s ok. And then she apologizes to OP.\n\nGonna say NAH. Emotions are running high and everyone feels guilty, but the kid was fine and it won’t happen again. That’s the best anyone can hope prior to the age of self-preservation.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 316,
              "content": "Not only did she not stop him, she didn't even know what was happening. I wouldn't leave my *cat* alone somewhere I hadn't vetted (because my cats are assholes who get into *everything*) first yet. OP's not a parent, they presumably haven't read anything about babyproofing anyway, so this was entirely on the mom and she failed to properly look after her son in several ways here.",
              "id": 6,
              "comments": [
                {
                  "score": 8,
                  "content": "Yep also why would op own a baby gate when they will litterally never have kids ...",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "OP has zero obligation to baby proof her house as if a child lived there. That's what her friend wanted - for her to make her house exactly like home in the off chance that she would come by, fail to watch her own child and then blame you for saving the child she refused to watch. NTA. I wouldn't ever invite her to your house again, if you still want to be friends with someone so unreasonable that you should cater your child-free life to her personal preferences. She needs to act like a mother rather than letting the kid loose in a strange environment. If there's anything to find, a kid will find it, even a paperclip.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 288,
              "content": "And you don't leave a crawling child in an unfamiliar place out of arms reach. They weren't even in the same room! Having a child somewhat in your line of sight (but clearly not since he got to the door) is not enough when you're someplace that isn't childproof. She expects the world to revolve around her kid, she's in for some issues.",
              "id": 9,
              "comments": [
                {
                  "score": 139,
                  "content": "Came here to say exactly this! \n\n*You don't leave a crawling child out of arms reach period!* \n\nNTA, OP. This is childcare 101 shit. There are so many ways her baby could have hurt himself -- from pulling things down onto himself to choking -- he should have never been out of her sight and reach. She knows she f'ed up and was projecting her anger onto you. \n\nThe fact that she doubled down and tried to humiliate you on social media for something that was clearly her fault makes her a bad friend (in addition to being a bad parent). She owes you a sincere apology, both off and online.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 41,
                      "content": "Whenever we took our kids out during the baby/toddler stage, one parent always had to tail the kid while the other socialized. If you were the solo parent, you better hope your friend liked playing follow the leader. It is the nature of the (cute and curious) little beast.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Yeah,  at that age I did not let them randomly explore strange spaces without being on their ass.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 41,
                      "content": "Small people are like the Weeping Angels in Doctor Who.  They can move incredible distances the second you take your eye off them. (And it doesn’t stop for years, when you have a whole new set of problems as they become older).\n\nBad enough not to watch her kid and then blame OP, but to have expected her to spend money baby proofing with gates etc is ludicrous.  She’s TA, not OP.",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 366,
          "content": "If I only took my kids to houses that were baby proofed, they would never go anywhere. Hell I have 2 toddlers and a newborn and the only child proofing in my house is the under sink cabinets that contain chemicals. When I go places, I automatically look for what I know my kids will get into and anything that could harm them. It's part of being a parent. My in-laws have 2 stair cases, one with a door and one without. We have a board we use to block the stairs with no door and you can beat your ass I know the exact sound the door to the basement stairs makes when it opens and I immediately check the location of my kids. It doesn't matter where you are or what you're doing, you're kids are your responsibility. You never just assume someone else, especially someone without kids, is going to take all the precautions you do.",
          "id": 14,
          "comments": [
            {
              "score": 166,
              "content": "I'm childfree, I have plenty of friends and family with kids.  I do what I can think of to child proof my place before any kids turn up, but I do expect parents to have a look around for anything that could be a hazard that I wouldn't think about.  Kids are damn near suicidal and seem to be very keen to do themselves damage on a lot of normal stuff.",
              "id": 15,
              "comments": [
                {
                  "score": 197,
                  "content": "I am childfree, with almost zero friends or family with kids. If you decide to bring a child into my house, you better walk me through it, because I have no idea how babies work. Also, adding permanent modifications so a kid could visit me once a month is way too excessive.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Lmao, I have no children but I love hanging out with the kids at functions like weddings or parties, so I'm usually making sure they don't get into anything. I've tried to follow their thought process. There isn't one other than they see a thing and they poke it/ open it/ lick it/ climb it. Kids do dumb shit because they see the thing and get curious.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I just don't let children into my house problem solved",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "I have had to puppy proof my house for my rhodesian ridgebacks, so that is about the only experience I have!",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "Vacuum or sweep your floor before arrival. Try not to leave small glass items or open flames all over then room you are in. Most reasonable parents expect to have to keep their full attention on their child whenever they go anywhere, this is also why it's best to go to parents.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "My mom was once ironing something and my little sister was told not to go near the iron or touch it because it was hot. Well the second my mom turned her back to keep the clothing down and get another one, my sister ran to the iron and decided she wanted to check it's temperature.\nShe was burned her finger a tiny bit and got the lesson that if mumma tells you not to touch something you don't. \n\nIf kids could, they would jump down windows cause what just might happen. Kids don't think of consequences before doing something (like at toddler age). They are little daredevils.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 23,
                      "content": "My dad jumped out the window with his superman PJs on because he thought they'd help him fly.\n\nHe fell into a thorn bush, but nothing was broken, thankfully.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "And then if what you warn them about doesn't happen.... They thimk they even more bullet proof. The concept of probability is completely lost on them!",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "True. Apparently my parents had to often stop me from trying to climb the bookshelves. And other things.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "Same with just the cabinets until two weeks ago. I have toilet locks now. Not sure what caused the sudden fascinating to put every sock, toothbrush, and pair of underwear he can find in the house in the toilet whenever mom is preoccupied for a moment but I am not thrilled with it either - as for whatever reason he is stubbornly determined on this issue. Kids are weird.",
              "id": 25,
              "comments": [
                {
                  "score": 12,
                  "content": "Lol, my 7 month old is fascinated by wires. We can't keep anything plugged in around him. The things kids will do.",
                  "id": 26,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Yeah, my nephew enjoyed - heck, still enjoys - taking things apart and seeing what is inside. This is *not* a good approach to electrical outlets. His sister teases him to this day about how he fried his brain as a toddler.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My youngest is 6 and my house is mostly un-babyproofed now.  I'm sure there's still outlet covers on some outlets, we're just removing those as we need the outlets.  My husband removed all the acres on cabinet and drawer latches between Christmas and New Years, I pulled the clip on ones a couple months before that.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "I don’t have kids but I do the same thing when I take my DOG places. Check to make sure there’s nothing she can get into, no doors open, etc. it’s really not that big a deal. I don’t expect people to make accommodations and my animals well being is ultimately my responsibility.",
              "id": 29,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Shoot my kids wouldn't even be allowed at my house if I only took them to places that are baby proofed 😂 we have a gate across the threshold separating the kitchen/dining area from the living room, and a makeshift \"door\" leading to the basement (I've bought and returned at least a dozen baby gates we've attempted to use in the spot to keep 1.5 year old away from the stairs... none of them fit)... thats about it. We keep doors closed and daughter is free ranged lol. NTA OP, and it was a bit of a low blow with regards to you having children of your own there... I get the initial panic, but that should have been followed by an apology because SHE is the parent, and as such the sole person responsible for the well being of her child in your home.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "This. We have a lot of stairs in our house (weird warren layout). There's a gate at the main stairs, one on the front deck since the street is right there, and one to the kitchen. There's baby latches on the built-ins in the living room and on the chemical cupboards. Otherwise, it's not like I can take all the glass out of the French doors, put padding on all corners, etc.",
              "id": 31,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "My mother's place has stairs right where the front door is as soon as you walk in. We would block it off so he couldn't try to get upstairs where her roommate has his bedroom and wood working area. He's a curious toddler and will find anything but mostly he convinced Gram's to let him watch his favorite show on the Roku. Sometimes he'll find a pack of cookies she left out and he'll haul it to me asking for one.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 216,
          "content": "She should be also, idk, watching the kid.\n\nShe's got eyeballs she can see he's heading for some doors.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "A long time since I've had a baby but we'd have shown up with our pack-n-play if we were visiting a house with no kids and thus no reason to be babyproofed. We also wouldn't get so caught up in chitchat that he could have crawled out of sight. Parents' failure, not yours.",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Upvoted for the proper use of egregiously!",
          "id": 35,
          "comments": [
            {
              "score": 11,
              "content": "how is it used improperly?",
              "id": 36,
              "comments": [
                {
                  "score": 9,
                  "content": "I've seen it used improperly recently. One person used it as a synonym for gregarious and another used it in a context where they meant excellent.",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 0,
                  "content": "This was my point (question) exactly from my edit. Not to say it isn't a 50-cent word, but to ask, how is it used improperly? I'm happy to see this here, because someone else called me out on how I was apparently bragging about using a pretty word, which was so not the case. Thank you!",
                  "id": 38,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Mom to toddler here. Literally this is the first thing I do when bring my daughter to someone else’s home. She’s my responsibility, not theirs. Also at this age (under 1, just crawling) they’re actually still pretty easy to contain. Where was her pack-and-play?\n\nAlso side note, for places we go frequently I will buy baby-proofing items for them to keep there if I feel it necessary. My inlaws just moved into a new home that’s very contemporary and is essentially a baby danger zone (sharp stone ledges everywhere, floating stairs, glass sculptures, the works). We bought them baby gates, bumpers, and everything we need and put it up when we get there and away when we leave.",
          "id": 39,
          "comments": [
            {
              "score": 10,
              "content": "Dad to a toddler here. Concur. My parents have a baby gate and moved all of the breakable shit out of the reach of grabby toddler hands, and my in laws have three other grandchildren, the oldest of which is 9, so they never really un-baby proofed their house. \n\nUltimately, though, my kid = my responsibility. I don’t make my friends baby proof their houses (not that we’ve been visiting much this year, fucking COVID), I just...watch my kid.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "The immediate panic reaction is understandable, but she had time to think about it and calm down. Then she publicly doubled down on it. That's what really does it imo.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Yep. My house isn't baby-proofed because we never plan to have babies. My friends know this. When they bring their kids over, they watch them like hawks. Even stuff that's okay for them to play with the parents usually take away. Because they know it's their job to corral their kid, not my job to move every breakable object, cover every sharp corner, etc. Though, as a matter of caution, all the outlets in our house are tamper-proof.\n\nETA: NTA",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I'm not surprised at all that people misuse that word. Most people use big words they don't understand to sound more photosynthesis.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "If she lives alone, I don’t really see the issue with the door being open. She doesn’t need to close the door. \nI lived in a house from infancy until 12 that had a basement. We didn’t close the door and it was right next to the kitchen. No one fell. No accidents.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1054,
      "content": "NTA - The kid is going to be brought into many different environments that haven't been prepared for him. It's not your responsibility to prepare your house for visiting kids. Its the parent's responsibility to keep the kid safe after they've arrived. It's not the home owner's job to make sure the door to the stairs is closed, it's mom's job to make sure that its closed before she lets the kid loose.",
      "id": 45,
      "comments": [
        {
          "score": 334,
          "content": "Also why would she pay to baby proof her house when she has no kids?!? Baby proofing isn’t cheap",
          "id": 46,
          "comments": [
            {
              "score": 78,
              "content": "Baby proofing is not so much things you buy. Baby proofing is an attitude and an awareness.",
              "id": 47,
              "comments": [
                {
                  "score": 102,
                  "content": "This. My parents installed these safety thingies on the electrical outlets and baby proofed the cleaning supply cabinet, and that was it. Their baby proofing for me was like 50 bucks and years of alertness and watching out for me. Same with my sister, she installed one stair gate and raised 3 kids just fine. People need to stop looking at their phones and watch their kids ffs. There's no way to baby proof a house completely, kids will always find a way to cause mayhem and damn near kill themselves.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 44,
                      "content": "Heck, damn near killing themselves is the fun part of being a kid.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "I agree, but the friend also explicitly said to OP that she should have had a baby gate installed. Not only was she not aware of her kid herself, but she expected someone else to actually spend money on their own house for one visit, to make up for her lack of awareness!",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "LOL yes, I am without children at present but one of my cousins has two kids. We were at his house doing Christmas things a few years ago and I put a pair of scissors down on the kitchen counter, and when his daughter picked them up he snatched that shit out of her hands before I had even registered what was happening. And when I was like OMFG I wasn't thinking I'm sorry he was just like nah, it be like that.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "I agree with that and really like the way you phrased it. The friend in the post however did point out specific things OP would've had to purchase like a baby gate and baby proof sockets.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "I feel like that’s what the salesmen would say to\nMe at the baby proofing store before convincing me to buy thousands of dollars in Abby proof BS lmao",
                  "id": 53,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 1,
                  "content": "It's definitely about both. Some things are also not obvious to people without kids, and the level of baby proofing changes. I remember a night where at 2 AM I had to install safety locks on all lower kitchen cabinets because suddenly they had become interesting and available to a previously pretty immobile baby.\n\nSupervision is still key. One of my kids was the type who'd see a baby safety in the electrical socket and attempt to extricate them, while the other never paid them a glance... much fun was had.",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Yes this. I have many parent friends that will bring their OWN PLAYPEN to my house to drop their kid in so they’re safe. No excuses for your friend. It’s their job to the the parent and not have the world accommodate them.",
          "id": 55,
          "comments": [
            {
              "score": 28,
              "content": "\n>\tI have many parent friends that will bring their OWN PLAYPEN to my house to drop their kid in so they’re safe\n\n100%, some people call those pens PACK n plays for a reason, OP's friend.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 548,
      "content": "NTA. It's not your child, so you don't need to baby proof (at least not beyond super obvious things like not leaving kitchen knives in your living room or something). F needs to either WATCH HER KID while at other people's houses, or she should bring a playpen or temporary baby gates if she thinks it may be needed, or she should meet up with friends somewhere else.\n\nI'm speaking as a mom of 2, by the way. My youngest is 2 1/2 and TBH I just don't take her to some people's houses because I know they aren't very child safe. Until my little one is old enough to not get into everything she touches she stays at home, and friends and fam are perfectly welcome to come over to our place to see her. I know my home is safe for her, and I'm not going to subject someone else's home or their belongings to toddler chaos!",
      "id": 57,
      "comments": [
        {
          "score": 75,
          "content": "I agree. I have 3 kids and my youngest is crawling. If times were normal and I could take him places, I would never blame anyone but myself if I took him somewhere and he fell down a flight of stairs. That would be on me, as he is my child. I also never take him to my dad and stepmom's house because it has steep stairs and is full of tiny breakable knick knacks. I don't expect them to babyproof their house when their youngest is 12. OP is NTA.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "This!  NTA!  \nMy youngest is two and if we ever take her to someone else's house we watch her like a hawk.  Her safety is our responsibility alone, and if you go over knowing it's not baby proofed you keep a really close eye when they're that young.  It's just outright ridiculous to expect someone to babyproof their own home when they have no kids...  \n\n\nThat's definitely a terrifying situation to have happen as a parent, but if she'd been keeping an eye on her kid in the first place it wouldn't have happened.  Making an FB post over it and making OP the villain is going waaaay way too far.  Any normal person wouldn't have blamed her in the first place, and a decent one would have apologized over the overreaction.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 390,
      "content": "[deleted]",
      "id": 60,
      "comments": [
        {
          "score": 122,
          "content": "Omg I love the beginning of your comment so much!",
          "id": 61,
          "comments": [
            {
              "score": 22,
              "content": "Polish proverb ;)",
              "id": 62,
              "comments": [
                {
                  "score": 0,
                  "content": "Wait really? My mom has been saying this for years and we are not even remotely Polish lol. I figured it was an old Southern USA phrase.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 41,
          "content": "As a parent to small children I just want to say that it truly does feel like I'm living in a circus some times.",
          "id": 64,
          "comments": [
            {
              "score": 9,
              "content": "And those *are* your monkeys! :)",
              "id": 65,
              "comments": [
                {
                  "score": 4,
                  "content": "They most certainly are my monkeys.",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I second that lol",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 375,
      "content": "NTA. You don’t take your eyes off a crawling baby for a second. Crawlers are dangerous as fuck. I literally spend 8 hours 3 days a week, yanking an 11 month old away from danger. All they do is try to find ways to die. This is 100% on mom. She should have taken a good look around to make sure the space was safe for him to be unsupervised.",
      "id": 68,
      "comments": [
        {
          "score": 154,
          "content": "Sorry..I laughed out loud at that “all they do is try to find ways to die” so true. \nAnd the reason why you never take your eyes off them. Things can go from ok to real dangerous in seconds.",
          "id": 69,
          "comments": [
            {
              "score": 31,
              "content": "It’s so true! My nephew just started crawling, and his new favorite thing is to quickly crawl towards the fireplace (with a fire in it) if his parents look away for a second. And then when they frantically scoop him up before he literally burns himself up, he laughs like it’s the funniest shit in the world.",
              "id": 70,
              "comments": [
                {
                  "score": 10,
                  "content": "Luckily, babies seem to be made out of rubber. They'll fall off the back of a couch, land on their head, and just bounce, and unless you freak out, they'll just keep moving on along. If you do freak out, they'll start to cry. The only thing I know about kids is, don't let them know if they get hurt, because they don't really figure it out by themselves.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 106,
          "content": "To add on that - as a child free person (like OP) we don’t exactly know what to do to childproof a house and we certainly don’t have baby gates just lying around. No way was this OPs fault.",
          "id": 72,
          "comments": [
            {
              "score": 41,
              "content": "Also childfree and if someone with a small child wants to come visit, I'm happy to have them, but tbh, I'm not going to sit here for an hour googling how to baby-proof my place, then order/go buy equipment and install all of it. I'll take the basic precautions and other than that, I think it's the parents responsibility to tell me what I could do and just have an eye on their child. They could bring a playpen and put it in the living room with some toys for example.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Amen. Crawlers are terrifying. And then they start walking and it’s the same thing but they can reach higher. Taking my kids to visit family was exhausting when they were little. Oh you have all of grandma’s nice china in a cabinet on the floor? And it glass front doors that don’t latch and slide open easily? That’s such a lovely display! (True story.) I can understand this mom being upset at first if she’s a first time parent and didn’t realize that you can’t take a kid that age for a visit and expect a relaxing chat over coffee like you used to have. But after the first terrifying near miss you learn pretty quickly to always have one eye on them.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 112,
      "content": "NTA just double check the basement door next time. She shouldn't expect everyone to cater to her. Some people might be their own choice but it is definitely not an obligation",
      "id": 75,
      "comments": [
        {
          "score": 102,
          "content": "Yeah I looked over the basement door and realized that since the house shifts due to weather, the door sometimes doesn't close right.",
          "id": 76,
          "comments": [
            {
              "score": 49,
              "content": "May I suggest a flip-latch \"lock\" for that door? It gets installed onto the door frame with two screws, and keeps a tricky door shut. It is also, incidentally, how I baby-proofed (and dog-proofed) my own basement door, by installing it at adult shoulder height.",
              "id": 77,
              "comments": [
                {
                  "score": 73,
                  "content": "That could help if I ever get a dog someday. Wouldn't want the little/big guy breaking a leg from falling down the steps.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 47,
                      "content": "I had a doggo that learned that if he shoulder checked the wobbly door just right, it would pop open and he would sneak down the basement stairs to get into the recycleables and rip open the spare bag of dog food.\n\nWe put baby proofing latches onto our lower kitchen cabinets, too, so he couldn't get into the trash can (under the sink). A lot of our childproofing transfered over to dogproofing, just like our dog training techniques actually are quite applicable to kid-rearing. (Hilariously, my first grader's school just rolled out an emotional intelligence system using a stoplight metaphor to help kids identify when they're getting overwhelmed and need a break, and my husband and I laughed because it was almost identical to a stoplight mood-identifying technique we'd learned in dog training class a decade earlier.)",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yep, I had three asshole cats who figured out how to pull my storage closet door open if it hadn’t quite latched properly. I had to get an additional lock for it to keep them from getting in and destroying everything. Fuzzy little jerks.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -44,
              "content": "Your friend is TA for being ridiculous about baby-proofing, and her horrible social media post. However, I don’t think she was negligent if she scanned the room beforehand and saw a closed door. If you knew it didn’t close properly, you should have told her. If you didn’t know, it was just (almost) a horrible accident. Well done for your quick thinking!",
              "id": 81,
              "comments": [
                {
                  "score": 34,
                  "content": "I didn't know about the door until after this happened. That's when I realized the frame shifted with the house.",
                  "id": 82,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 97,
      "content": "NTA. The mother should be looking after her own child, not leave him alone, and then get mad at you.",
      "id": 83,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 97,
      "content": "NTA. I have a 3 year old. I do not expect people to baby proof their house. When I go for a visit and I see a glass vase on the table I ask if they mind moving it so we don't break it. When my baby falls, it's nobody's fault. It's a learning experience! If she felt your house was unworthy to leave her child alone in a room she should never have left her!\n\nFucken snowflakes, helicopter wannabe too lazy to watch her own kid friend of yours is a complete idiot!\n\nI can't stand it when parents expect childless people to suddenly become child experts.",
      "id": 84,
      "comments": [
        {
          "score": 43,
          "content": "I love the last sentence in your comment so much as I honestly feel the same way",
          "id": 85,
          "comments": [
            {
              "score": 14,
              "content": "Info do you still talk to F??\nNTA btw",
              "id": 86,
              "comments": [
                {
                  "score": 23,
                  "content": "Not really no",
                  "id": 87,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Good! You don't need that drama in your life!",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Some people go a bit nutty when a big change happens in their life. Having a baby, getting a pet, joining the military, getting into crossfit.",
                      "id": 89,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Related to your last comment.... I can't stand it when parents expect childless people to suddenly revolve their worlds around someone else's child.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 61,
      "content": "NTA\n\nIt was your friend's responsibility to stay close and keep an eye on her child.  She was too far away from him and not paying enough attention to him.",
      "id": 91,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 54,
      "content": "NTA. She can't expect everyone to baby proof their homes just for her offspring. That's unrealistic. Hell, I didn't baby proof for my own kids... And now that my kids are older, I don't do it for my younger family when they come to visit. At most, I make sure there's nothing dangerous a baby could stick in their mouth, or breakable in reach of a toddler. That's about it. \n\nAnd yeah, is absolutely the mother's responsibility to make sure the kiddo is safe.",
      "id": 92,
      "comments": [],
      "relation": "Support"
    }
  ]
}