{
  "post content": "Dating two years, moved in together 6 months ago. As a single guy, I had piles of laundry, dishes, papers, etc but always got to cleaning them up on my first day off. Now it’s like a competition between the two of us as to how long before one of us is repulsed enough to do something. Here’s our situation:\n\nMe: I make twice as much money as her, so I pay for every bill for the household (rent, gas, electric, internet, etc.) and food every other week. I work 12 hour days 4 days per week with 3 day weekends.\n\nHer: makes very little money plus has some debt from college and bad decisions. Pays for food every other week. Works 30 hours/week, but usually only has 1 day off. Lots of split shifts and half days. Also taking online classes for a certificate. \n\nChores: We usually work together cooking the meals for the week ahead of time. The dishes are usually piled up until the next week when we need to cook again. I use the same 3 containers taking food to work for 4 days, usually paper plates and a water bottle and beer cans on my weekend. She comes home for lunch, leaves cups of soda out each night. What I’m saying is I think she makes more dishes.\n\nChores (cont.): She does laundry almost every day. She has required outfits for each day that definitely cannot go 2 days without washing. She throws my clothes in with hers because it doesn’t make much sense to wash just her outfit alone each day.\n\nChores that pile up: trash is overflowing before someone takes it out. Dishes pile up. No sweeping, dusting, or mopping so far except once for her family’s Christmas at our house and I did it today. Bathroom is never cleaned.\n\n\nTL;DR- Am I the asshole for expecting the person who doesn’t contribute financially (and probably makes more messes) to help around the house more though I have more free time.\n\nEdit: Wow quick responses. Mostly we both suck, with me being the asshole for having an archaic idea of the provider/housewife bullshit. Guess it’s time for an adult conversation. Thanks guys.",
  "id": 1,
  "comments": [
    {
      "score": 56,
      "content": "ESH, what does how much you make have to with being fucking slobs?\n\nDo you guys compete at everything, because the way you make it sound it's almost a race to see who can be more disgusting. ",
      "id": 2,
      "comments": [
        {
          "score": -29,
          "content": "I feel if I’m letting her live with me for free, she could help more.",
          "id": 3,
          "comments": [
            {
              "score": 25,
              "content": "This phrasing makes it sound like you consider it to be “my home” not “our home”. ",
              "id": 4,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "This isn't a contest of who does more or who pays more. You've decided to play house and these things should've been discussed prior to moving in. ",
              "id": 5,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "You will never be in a relationship where you each make 50/50. It will never be fair to expect the other partner if you both work full time to have maidly duties because you make more. \n\nIt isn't fair for her to live there for free, either, unless you live someplace that's more expensive than what she can afford precisely because you can afford it. \n\nThis needs to be a dialogue of what you can both live with in terms of contribution.*Not* a 'i feel my partner should be doing x y z because I do a b c.'",
              "id": 6,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Is she your paid whore/live in maid or your girlfriend?? \n\nIf you're unhappy with how much she makes then dump her. If not, not treating her like an employee. ",
              "id": 7,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "What does she say to that?",
              "id": 8,
              "comments": [
                {
                  "score": -2,
                  "content": "That was more or less the agreement. She joked about being a housewife before moving in, doing most of these things when she’d come visit.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 13,
                      "content": "\"More or less\"? Like you didn't lay it out of explicitly?",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 44,
      "content": "YTA. You admit you have more free time. Unless you had an agreement where you provide housing in exchange for her being your maid, you should both do chores equally. She's already doing all your laundry. Maybe you guys can pitch together for a maid because it sounds like you're both kinda gross.",
      "id": 11,
      "comments": [
        {
          "score": -15,
          "content": "We certainly never had an agreement like that, though how is solely supporting the house and cleaning it fair either?",
          "id": 12,
          "comments": [
            {
              "score": 20,
              "content": "Are you a child? Adults clean up after themselves. Don't complain about her until you're doing your part. I'd suggest dishes. She does laundry every day. You could do dishes. Make a chart to split the rest. ",
              "id": 13,
              "comments": [
                {
                  "score": 2,
                  "content": "Laundry doesnt need to be done every day",
                  "id": 14,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 34,
      "content": "YTA\n\nI get the situation perfectly but what makes you TA is that you have this kind of condescending tone regarding her work/contributions to the household. It’d be so much better to try and make this a common effort between you, setting the goal of being cleaner and working towards it.",
      "id": 15,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 22,
      "content": "YTA.  You guys need to talk about who should do what.  No one can read minds.\n\nExplicitly establish expectations first.  You can get mad after that if they're not met.",
      "id": 16,
      "comments": [
        {
          "score": 0,
          "content": "We’ve tried the “hey can you do X more” but it rarely lasts. We tried a list on the fridge with notes, but maybe we need to address everything all at once",
          "id": 17,
          "comments": [
            {
              "score": 2,
              "content": "Yes this is good advice!  Hash it out, and divide up the responsibilities.  If you work more it’s not crazy to expect the person who works less to clean more.  ",
              "id": 18,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 15,
      "content": "ESH, bordering on YTA\n\nIf you have the time and see that it's a mess just clean it up, it's really not that hard. \n\nAlternatively, if the mess is getting to you come up with a chore list or something. ",
      "id": 19,
      "comments": [
        {
          "score": 5,
          "content": "I agree, ESH bordering on YTA.\nRegardless of how much money either of you are making, both of you should be contributing to the chores. ",
          "id": 20,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 14,
      "content": "YTA if you think that her making less money than you obligates her to be your maid. That’s cool that you pay more of the expenses but you should split chores 50/50, assuming you want this relationship to last. Sounds like you could both work a little harder on the cleaning. ",
      "id": 21,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 10,
      "content": "YTA-\n\nPretty typical issue a couple can have, but a few notes on your specific situation.\n\n1) Almost every single human being on earth, when making the assessment, comes to the conclusion that the OTHER person makes bigger/more messes, and often can easily overlook their own mess. (It’s like not minding the smell of your own farts over others)\n\n2) You didn’t mention specifically what ‘bad decisions’ led to her debt, and the things you did mention are reasonable. Take a second look and make sure that you aren’t making a false comparison between your lives. Some people made the ‘bad decision’ to be born into a low income family, or not receive any help from parents that other people in a similar situation might receive when going off to college, etc. Not having a solid foundation at the start of adulthood can plunge you into debt really fast, without doing anything outright irresponsible.\n\n3) Would you be paying significantly less for any of your costs of living if you were completely single? I pay more rent and bills than my boyfriend because I make more. If we split, my bills would either stay the same or increase. He’d probably have to rent a room on his income, so he’s getting a bit of a boost here, but I’m not actually losing anything.\n\n3) split shifts are very stressful and can zap personal time by splitting up the day. She may work less than you and make less, but I bet she feels like she’s ALWAYS working. and keep in mind that people who get paid less per hour don’t get less tired or drained per hour. She works 30 hours a week and goes to school, so she’s as busy as you are.\n\nBottom line: you both have busy lives and enough stress that you feel some kind of mental block from keeping your place clean and organized. Then the blame game starts. \n\nTalk to her openly about how you feel you’d both be happier if you came home every day to a clean and organized living space, and make chore assignments that fit both of your schedules. ",
      "id": 22,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "INFO. Have you talked to her about this concern of yours, or have you just been harboring these expectations while looking around at the mess?",
      "id": 23,
      "comments": [
        {
          "score": 16,
          "content": "Ikr, this guy's is just \"expecting\" it to happen by default",
          "id": 24,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I’ve tried, and it fixes it for a couple of weeks, then goes back to how it was.",
          "id": 25,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NAH or ESH I can't decide. \n\nYou're two adults acting like kids and getting into a petty fight over what's \"fair.\" A relationship isn't also a 100% fair. It's about give and take. I am sure if we talked to her she would have a list a mile long about things she does for you that you don't notice.  \n\n>I make twice as much money as her, so I pay for every bill for the household \n\nSo? That's your agreement, that doesn't entitle you to have her as your house bitch. Sit down and make a choir wheel of something. Or better yet, since you make so much money hire a cleaning lady to come in once a week. \n",
      "id": 26,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "ESH- You’re both adults who are capable of cleaning. You both work so it is shared responsibility. Why don’t you make a chore wheel? I know it sounds juvenile but it will make it very clear who is responsible for what and on which days. Then there’s no room for blame or playing the “who will give in and clean first” game. ",
      "id": 27,
      "comments": [],
      "relation": "No"
    }
  ]
}