{
  "post content": "\n\nMe (F.) and My ex husband (M.) are divorced. We have a 16 yo son together \"Mason\". I got remarried to my husband (M.) Nathan.\n\n\nMy ex husband and I used to argue on who should get Mason for the holidays back when he was little. As he got older we started letting him decide. Last year he spend Christmas with me, Nathan and my inlaws and he complained that the experience was \"terrible\" because he said Nathan and his family had little to no accomodation for his food choices (I'm not defending them but my inlaws are quite traditional when it comes to food and a bit ignorant to what types of foods Mason eats). He also said he didn't feel as welcom as the other kids in the family and that Nathan forced him to share his personal stuff like his phone so that his stepnephews could watch christmas movies.\n\n\nYesterday, during breakfast we were talking about christmas and what we were planning this year but hem out of nowhere announced that he'll be spending this Christmas with his dad at a rental christmas cottage in his favorite town. I was stunned, so was Nathan. I asked Mason when and how he agreed to this arrangement but he pointed back to what happened last christmas and said he didn't want to basically \"have another shitty holiday and be miserable\" I told him that his dad should've come to me first but he argued that he's already okayed it and so he saw no need for my opinion. We started arguing and he started complaining about me trying to ruin the experience but in response I told him that he has already ruined christmas for me and his stepdad the minhte he agreed to this arrangement. He got up and walked away after saying that I was being \"overdramatic\". Nathan just sat there and looked down.\n\n\nI had a huge argument on the phone with Mason's dad and he kept giving me an attitude and laughjng and saying that I sounded pathetic. When I told him I'd have my lawyer call him, he bbackpaddeled and said he woukdn't have done this if Mason didn't like it. He urged me to drop it and let Mason have this experience or he'll resent me for missing it. Now Mason isn't speaking to me. Nathan is trying to convince him to stay with us because without him, our christmas is ruined but he won't budge from the looks of it.\n\n\nAITA for not dropping it as well? What I meant by \"why didn't his dad come to me first\" is that he planned to take Mason out of town which is a big deal to me. There's going to be traveling.",
  "id": 1,
  "comments": [
    {
      "score": 44928,
      "content": "YTA.\n\nSo your son can decide who he wants to spend holidays with, as long as he chooses you? Get over yourself. Start thinking of your son.\n\nYou did nothing to make his holiday a good one last year. You let him be miserable and just defended your in-laws. Instead of supporting your son's choice, you throw a tantrum and threaten your ex. Some parent you're being. You're acting more like a kid than your own kid.",
      "id": 2,
      "comments": [
        {
          "score": 12844,
          "content": "And he only ruined Chritsmas because he's not going to be there to be a free babysitter. He's ruining their case to relax and not have to worry about the kids. Hell, they probably told the film that he'll be there and willing to babysit so the parents can drink.",
          "id": 3,
          "comments": [
            {
              "score": 6120,
              "content": "This is what I was thinking too. Why would Christmas just be ruined automatically? And why does he HAVE to share his phone with them? This poor kid.",
              "id": 4,
              "comments": [
                {
                  "score": 4852,
                  "content": "Also why didn't OP bring food for their child knowing that inlaws aren't prone to cooking food inclusive of his dietary needs? Even if I didn't have another parent to go to, I would refuse to attend after that whole experience",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2415,
                      "content": ">Even if I didn't have another parent to go to, I would refuse to attend after that whole experience\n\nRight?!\n\nStaying at home alone (no pun intended) sounds way better than spending with step-family who don't really engage him, expect him to give his phone to the step-niblings and who don't provide anything decent he can eat.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1094,
                      "content": "Yeah this is BS. I have a stepdaughter who has a pretty restrictive diet. My mom likes to cook & try new cooking, and is offended by picky eating. So Thanksgiving is set up for conflict, right? Nope. I just tell my mom, I'm bringing mashed potatoes and mac n cheese, and then I make it the way my stepdaughter likes, and everyone is happy.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 456,
                      "content": "Or at the very least let them know what he will eat. Make some kind of effort for her son. Instead she would rather him stay with her and be miserable for Christmas just so her and step-dad can have a good Christmas.  Completely selfish.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 134,
                      "content": "Yep!\n\nEvery 5-6 years my Mother in Law, Father in Law, husband and I go to my sister in law's house on the other side of the country for xmas.  We're going this year and our kids are 7 & 4.  We have a more relaxed dining style with our children (eldest has ADHD, so we have clear expectations for dinner time, but they don't involve staying seated until everyone is done, it involves staying seating while HE'S eating and then he's allowed to leave the table so long as he goes somewhere else to play, and doesn't hang around the room trying to talk to and distract his brother and everyone else.  So there's a standard of behavior for when you're AT the table, and if you don't want to stay seated, you can go do something else.  Because he usually likes being around everyone, it makes it so HE wants to sit down as long as he can, instead of us trying to force him to...  self-motivation does wonders!  But if it's one of those days where he just can't do it, he doesn't get punished for it, he has an opportunity to evaluate himself in that moment and make a choice to do something else.)\n\nMy Sister in law is much more formal with her children and will sit at the table fighting with them to stay seated (sometimes resulting in NEITHER her or her kid eating anything)...  I'm pretty sure this whole dynamic might be...  difficult...  for everyone, so I've already talked to my mother in law, who lives closer and will be driving, not flying, and she's going to bring their favorite ramen, and a few other foods that are quick to prepare and that my son ALWAYS is willing to eat, to make sure that if we have issues around meals, I know my sons will have foods they will eat without complaint.  Because the last thing we need is my kids deciding to be fussy about food, meanwhile her kids are being fussy about sitting down, and then the whole house is chaos!  Or my kids just being so distracted by it all at the dinner table that they don't eat enough, and then are hungry later.\n\nObviously I don't want my kids to eat nothing but ramen and nutella for 5 days, but if that's what it takes to keep them fed, and the drama down, over the holidays I'm going to do it, because my kids getting enough food is more important than whatever my sister in law thinks when I say \"Hey, I'm just going to take the kids into the kitchen and have them eat ramen!\"\n\nEven though the kid in this situation was 15 and not 7, it's still the parent's responsibility to make sure their children's needs are being met in new situations, like their in-law's or step-family's house.  OP just completely failed last year and doesn't even realize it!",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 117,
                      "content": "I’m a vegetarian and live in a “meat has to be in every dish” place. My parents would absolutely have told the host, or more likely let them know they were bringing me my own meal (people don’t know fish isn’t vegetarian, soup with beef broth isn’t vegetarian, chicken isn’t vegetarian, and a few pieces of plain lettuce isn’t a meal- all true stories lol). A parent is responsible for making sure they’re kid is fed, especially during a holiday where meals are a long festivity and everyone else gets to eat delicious food and that’s a big celebration!!\n\nYTA OP, majorly.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "I really can't believe OP wrote this whole post and kept being this oblivious. It's generally accepted that OPs here write the stories in the way that makes them look the best. HOW bad was it that THIS is what OP wrote? I just can't fathom such obliviousness.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "This!!!! \nSo much this! Op knows what her son eats, she knows her inlaws are *traditional*, whatever that means. Op should have brought something for her son to eat. Instead he was neglected and miserable.\n\nOp YTA.\n\nThis is how you get an 18 year old who has nothing to do with you once he legally turns into an adult.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Ugh, imagine being hungry in a house you already don’t feel comfortable in, and you don’t even have your phone as an escape. There was nowhere else for these kids to watch Christmas movies?",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1704,
                  "content": "I don't understand this either. They did nothing \"fun\" with the son.\n\nLets see why he doesn't want to go.\n\n* He went last year. Maybe he is alternating Christmas with his parents.\n* He wants to go to a place where he can enjoy the food.\n* He wants to not have other kids messing with his stuff.\n* He wants to have a Christmas where he isn't seen as a burden.\n\nOP you just take your son for granted, treated him like shit. Yet you expect him to want to come back and have the same experience again. The worse part instead of accepting his decision, you have doubled down and make him feel worse.\n\nFucking horrible parenting.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 266,
                      "content": "Exactly! My husband and I have a 20 yr old. In laws have always doted on my son. They will make food that they know he likes if asked. Every year when my son was growing up and even to this day when we're making Thanksgiving and Christmas plans I always ask my son is there something special you would like at the meal and either my mother-in-law or myself will make it. We believe everybody should have a voice in what we're eating. It guarantees that even the kids will eat and enjoy the holidays, not just us adults! I can't imagine being so selfish that you would not include your child like that!\n\nGod forbid I ever have new In laws but if I did, I'd make sure my child had food he liked and enjoyed the holidays too!",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Plus the dad is offering a holiday that take's the son's feelings and enjoyment into consideration:\n\n• Christmas cottage in his favorite town\n\n• No children taking possession of his personal things without his consent\n\n• Presumably food he can eat\n\nYTA. Apologize to your son for saying he's ruined your holiday by not being there. If you and your husband can't enjoy a holiday with his family that's certainly not your son's fault.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Fuckin' straight. OP will look at pics of her son, Mason walking across the stage at his high school graduation, pics of him celebrating his fresh start in his new state, and walking across the stage at his college graduation, pics of him at his wedding, house-warming party, and baby shower with his replacement family (his wife, friends, therapist, and in-laws, who all make him feel welcome, wanted, and loved), pics of him with his wife and their new baby, cry like all hell, and not only have a hard time figuring out why her son went NO CONTACT with her and her new husband, but also have a hard time figuring out why he left her out of those important events, and chose to include his bio-dad, instead.\n\nPlus, when OP's new husband, Nathan throws her away for another woman, and his family rejects her, she'll try to contact Mason, beg him to forgive her, only to find out that he has a P.O. box, disconnected his phone number, and deleted his social media accounts.⚠️",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "The alternating part is what I don't understand about OP. Even without Mason having a bad - okay, horrible - time last Christmas, it is not odd at ALL that he would alternate between his divorced parents. Yet OP is acting like this was completely out of the blue.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Yes! And let's add one more:\n\n• He loves his dad and wants to spend Christmas with him. Why does Christmas with the OP have to be the default setting, and to the point where if Mason doesn't spend Christmas with her and Nathan, it's \"ruined\"?",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yup! Selfish, entitled, arrogant, horrid parenting by OP and her new nothing burger husband and his ghastly family.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 843,
                  "content": ">forced him to share his personal stuff *like* his phone so that his stepnephews could watch christmas movies.\n\nThe way she worded it, it might not have just been his phone... And don't forget the ZERO accommodations for his \"food choices\" because her new in-laws are \"traditional\" and \"don't understand\". She doesn't elaborate, is he vegan, gluten-free, cruelty-free, organic only, celiac, lactose intolerant? Lordy she is self-involved. YTA OP. I hope you enjoy this last 2 years with him cause I'm pretty sure it will be the last you see of him. (No wonder she wanted him for Christmas, he will never ever spend it with her once he turns 18)",
                  "id": 21,
                  "comments": [
                    {
                      "score": 286,
                      "content": "Not elaborating is weird as well! It doesn’t sound like she takes it seriously at all. Putting a kid in a situation where they have nothing viable to eat is a great way to create disordered eating, aside from the whole abusive part of it.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 152,
                      "content": "It WILL be the last OP sees of her son, when he moves states away, after he graduates from high school, disconnects his phone number, erases his social media accounts, and gets a P.O. box.⚠️",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 444,
                  "content": ">Why would Christmas just be ruined automatically?\n\nBecause OP's ego is at stake. She spent years squabbling with her ex over who would have the kid for Christmas, like a pair of dogs fighting over a chew toy. Now her son is old enough to choose for himself and this year he didn't pick her - and she hates that her ex \"won\" this year, because it's still all about her needing to get the better of her ex, and not about her wanting the best for her son.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 56,
                      "content": "That and she likely doesn't want to have to explain why her son isn't there,  that he chose his dad to spend Christmas with instead of her.....people may realize she's not a good parent, but I'm sure she will spin it to the inlaws that the dad took him this year",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 371,
                  "content": "I mean, if they were newly divorced, and it was mom's first Christmas without her child i could see how a grief stricken woman might think to herself that that's the worst Christmas ever. However, she'd never say its kids fault (even to herself), would never express her disappointment out loud to the kid and she would encourage child to spend holidays 50/50 with the other parent.\n\nOP is already in another relationship, with new partner, new inlaws, new stepnibbling and has been sharing custody for some time. At this point is just selfishness",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 339,
                  "content": "I also can’t get over “we let our son decide now he’s older.” But also “how dare he choose the other option. I’m going to threaten my sons Dad with my lawyer because my kid dared to want an enjoyable Christmas.” \n\nIt just sounds like OP wants to use her kid as a way to get a one up on her ex at every turn. It’s sad.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 90,
                      "content": "I hope the lawyer shuts her down. 16 is legally old enough to decide.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "It's possible. It's sad, AND fucked up, at the same time.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 206,
                  "content": "Hey, what 16 year old at a miserable holiday gathering where they feel excluded and unwanted wants their phone, anyway?  I can just imagine how awful that was for him.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Right? Nathan could have offered his own phone for movies if his nephews were bored. \n\nI wonder if Nathan is secretly thrilled he doesn’t have to spend Christmas with his wife's son this year. It sounds like he married OP first, who then had an intermission with the ex (and teenager), and then a remarriage… maybe teen is an unwanted reminder to him and the ILs about the intermission. \n\nOP needs to step up and protect her son instead of making him feel guilty for wanting to spend time with his dad, who's making the effort to make a special holiday just for him.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "Yeah I'm a fucking adult and I'll be damned if I'm going to \"share\" my phone with anyone!",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Yeah I've shared Christmas with my Son's Dad for 16 years, the year he is with his Dad we just carry on as normal and look forward to him getting back so we can celebrate Christmas again. I'm confused why she is saying it's ruined her Christmas? She also said they agreed to let the son decide (that's what we do now too!) But is throwing a tantrum at the choice? Her husband is now trying to guilt trip him, while she threatens her ex. What horrible selfish people !!",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "My mom would have pulled the same shit. Saying a holiday was ruined if I wasn’t going to be there. Some parents are just narcissistic assholes.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 276,
              "content": "Oh my god you’re right. That explains how him not being there “ruins” it for them. They’ll have to be in the vicinity of younger kids. They may even have to share their OWN phones. Nightmarish.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 138,
              "content": "This mother did this to herself.  Give the kid a choice and then a shitty Christmas when he picks you.  I would not spend Christmas with her and sf ever again.  Do people realize even slightly how selfish they are?",
              "id": 36,
              "comments": [
                {
                  "score": 14,
                  "content": "Oh yeah, kid is going to be 18 in a couple of years and she's setting herself up for a future of no Christmas ever again with her son. I hope she really likes her extended in-law family because that's all she's going to get.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "[deleted]",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "And to make her look bad in front of the in-laws. They can’t play happy blended family.",
              "id": 39,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "Also:\n\n> Nathan and his family had little to no accomodation for his food choices (I'm not defending them but my inlaws are quite traditional when it comes to food and a bit ignorant to what types of foods Mason eats)\n\nSounds like they aren't even willing to accommodate his diet (I'm assuming it's being a veggie or something given op calls them choices) I'd rather go somewhere I can eat.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "And I thought you let Mason decide? Or do you only let him decide if he decides he wants to stay with you?\n\nYTA for that alone. Forcing him to share personal items, not caring about what he wants to eat, and letting him feel unwelcome is just extra crap coming out of the AH. Presumably, he’s even made to babysit. That makes it even worse.\n\nI wonder what’s going to happen when he hits 18.",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2633,
          "content": "Exactly!\n\n>As he got older we started letting him decide\n\nReally? Because it’s pretty clear that Mason made the decision to spend Christmas with his dad ages ago. Did OP ever ask?\n\nAlso, it’s not uncommon to switch every year. So even if Mason hadn’t had a shitty Christmas the year before, OP should still have expected him to consider wanting to spend this Christmas with his dad.\n\nYTA, so much.",
          "id": 42,
          "comments": [
            {
              "score": 772,
              "content": "Came here thinking exactly that. \n\nThis is OP writing from her point of view, and it still doesn't look good! \n\nThere's only what went wrong. Not once 'but he had fun doing....' or 'He looked happy when...' None. Nothing. Not even 'We enjoyed having him there because...' \n\nI see NO reason why OP's son would NOT want to spend christmas with his dad",
              "id": 43,
              "comments": [
                {
                  "score": 288,
                  "content": "I see no reason why OP wouldn’t want to start living with his dad full time",
                  "id": 44,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Yep, especially if Christmas goes well",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Right?! Let her lawyer call the dad.\nJudges will listen to where a 16 year old wants to live and spend holidays 😆 OP be tripping.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Came here to say many many things...THIS being a big one.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 157,
                  "content": "Maybe, for Mom, it's an appearances thing; makes her look bad to have her son choose  Christmas w/Dad, rather than her.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 150,
                      "content": "The idea his main worth is being a status symbol / accessory is heartbreaking actually.\n\n Not saying the idea is wrong, as it actually fits disturbingly well within OP's story, but... the poor kid.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "That’s crazy though? How does taking turns with his parents for Christmas reflect bad on her??? Honestly, I think they need a babysitter. Why else would his absence “ruin” their holiday??? It’s hella fishy!",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 83,
                  "content": "Heck, I’d rather spend Christmas with Mason’s dad",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "Right!  People like OP amaze me, I just can't see how as they a writing the facts, that they can't answer their own question?!?!\n\nEven before you get into the meat of the kid's reasoning, OP states the kid gets to pick and last year was with her.  Based on nothing else, it would make sense the kid would choose to alternate holidays!  So OP is already TA for making the kid feel bad about spending equal time with each parent.  And that's before we get to what happened last Christmas....",
                  "id": 52,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I know! JUST THAT PART!!! WHAT IS THE PROBLEM???? She didn’t notice how absolutely strange that sounds?!?!?! I’m sorry for the caps, I am just beyond perplexed!!!! 🤦🏽‍♀️",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "People like OP are in denial, that’s why they can’t answer their own questions. I have to say it “denial is not just a river in Egypt” \n\nYTA OP. I feel so sorry for Mason. Last year he hung out with the Grinches that stole Christmas and now you want him to hang out with you again",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "They enjoyed having him there because he could take care of the little kids so the parents didn’t have to.\n\nOp major YTA. You said you let him choose who he spends holidays with; why is that only if he chooses you?\n\nI can’t imagine why he’d ever choose to spend time with you. Hope you enjoy the next two years of forced holidays with him because once he’s 18 you have absolutely no say and I doubt you’ll ever get another one he willingly spends with you.\n\nAlso threatening to run to your lawyer is a real trash move;\n\nHow dare my ex take his son to his favorite place for a holiday I spent making him miserable last year! How can I punish him for actually thinking about what our son might actually want instead of MY needs.\n\nYour ex was right, you sound pathetic and miserable and I feel bad for your kid being stuck dealing with you. It’s pretty obvious how little he matters to you.",
                  "id": 55,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "And then threatens the dad with her lawyer... What a fucking asshole.",
                  "id": 56,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "I actually don't even see why OP's Christmas would be ruined, unless she's counting on her son to \"share his personal stuff\" (i.e. entertain younger kids so the adults don't have to) again. I mean, I co-parented a kid with an ex, I can completely understand wanting to be with your kid on the holidays, but it doesn't sound like OP was looking forward to an event or certain tradition with him or just enjoys having him around, she just seems pissed to not be the chosen parent.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 272,
              "content": "Right? I'm not sure that I believe this is real. OP Can't possibly have typed this out thinking they aren't the AH...",
              "id": 58,
              "comments": [
                {
                  "score": 56,
                  "content": "I also have a hard time believing this is real. I can't imagine a fully grown adult behaving this way. How little self awareness does one need to say these things and believe they did nothing wrong? \n\nShe's setting herself up to have her kid go NC in two years, and she will deserve it.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 29,
                      "content": "From what I hwar about family law, people can be the most self absorbed, insane assholes with the most selfish petty reasons and self imagined excuses when it comes to stuff like rights on the children. (Not saying that there are not many situation where there are good reasons the fight here with all you got, but too often, it seems it is more about winning over the other than anything else).",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "I believe it. Ever since my dad married my stepmother, Christmas has purely sucked. He knows I'm unhappy. He knows I dislike my stepmother intensely. But each year, he is mystified that I don't want to come over Christmas Eve and spend the night.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Not only is this exactly right, but what about the father...by her logic, wasn't the father's Christmas \"ruined\" last year when Mason spent it with her?\n\nOf course, I understand he's \"the ex\" so who gives a crap about him /s\n\nEven if the kid didn't have such a terrible time last year, assuming he has a decent relationship with the father (and there is no indication even in the OP's tone deaf post that he doesn't) why wouldn't he want to spend this Christmas with his dad if he spent the last one with his mon?",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I have NO idea how Mason came to this decision!!  \nHis step nephews just take his stuff, his step in-laws don't accommodate him, his mom and her husband don't stand up for him, and his dad is only taking him away to his favorite town! How could he have chosen that! Of course he gets to choose, as long as he chooses OP! Christmas is ruined! Why didn't he want to stay, be miserable, and watch some kids he wants nothing to do with! I can't wrap my mind around his hurtful decision! /sssssssssssssssssss",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "If I were Mason, I’d get in front of a judge and insist on living with my father full time.",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "We started letting him decide, but ONLY if he decides to be with us, otherwise he's RUINING Christmas!",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1346,
          "content": "I’m so confused how OP thinks they could possibly be in the right. You agreed to let Mason pick where he spends Christmas, he was with you last year, and he told you over a month in advance he would be going with his dad this year - where’s the problem?\n\nAnd those are just the basic facts, not even taking into consideration that you and his stepdad apparently didn’t care to make Mason’s holiday with you last year enjoyable for him.  And now you’re saying manipulative shit like “you’re ruining our holiday?” YTA, OP.\n\nAs a kid with divorced parents, I hated Christmas most of my life. I spent it on cars traveling from house to house with no say in where I was or what I did. At my dad’s house and my stepmother’s side’s Christmas, I was treated like an afterthought. Fewer presents compared to everyone else, no traditions to participate in, and expected to entertain the younger kids instead of do things I wanted to. This is what you’re setting Mason up for.\n\nI didn’t like Christmas until I had my first child and declared that we would not be leaving our home on Christmas Day anymore. Now it’s my favorite day of the year. \n\nWe invite people over to visit during the day, but those people who made the holidays miserable for me growing up and didn’t care at all about how I felt? They aren’t invited and we see them if/when we can.\n\nI hope OP heeds this as the warning it is about where her relationship with her son might end up.",
          "id": 66,
          "comments": [
            {
              "score": 421,
              "content": "[deleted]",
              "id": 67,
              "comments": [
                {
                  "score": 23,
                  "content": "Christmas Eve is the answer. I wasn't the one divorced but both of my sibs were and my mother would spend Christmas Day miserable because she felt she was the afterthought. 'Can't come over until after the presents are unwrapped but we can only stay for an hour because we have to get to the other house(s).' Once I had a child, I said 'I'm not waiting for anyone. I'm not making my kid wait to eat.' So we started having our family get together on Christmas Eve. It was great! Nobody was rushing anywhere, everyone could get up, open presents, mess around, do what they needed to do, my parents, I and my son would have a great day together on The Day.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 330,
              "content": "Fellow kid of divorce here.  Absolutely hated Christmas until I was about 16. Step mother forced my dad to have me at their house on Christmas day just for me to watch her kids open copious amounts of presents while I got one or two (that my mom would drop off so I had something to open). I'll never forget the year I was 11 - 12y/o  and my step mother made these amazing stockings for my 2 step- and 2 half siblings,  no stocking for me. The next morning there was a stocking with my name on it,  in (obviously) my dad's terrible handwriting, and 1 gift inside, a lovely ring.  She shot daggers at me and him as I opened it.  \nI blame my dad for being whipped just as much as I blame her for being awful.\nThe last Christmas I spent with them was a disaster (i was 13),  ended with my mom picking me up on Christmas eve after a fight with my step brother over a basket ball game.  I grabbed the gifts I had brought for everyone and headed out to the street to wait for my mom.  As i was gathering the gifts from the tree my dad said, \"get your stuff and don't come back\". And i didn't,  not for a couple years at least,  but never for Christmas - I'm 38 now!\n\nThis mom is definitely the AH. I hesitate to believe this is real because I can't believe someone could type this out and not see the error of their ways, but then I also acknowledge there are these types of people out there.\n\nEdit to add: my kids are 12 and 16 now,  and Christmas has always been about spending time/ making memories with our family (me, hubby,  kids,  and my mom + step dad), not about gifts. We share a few meaningful gifts and that's it - no mountains of presents or counting who got how many and who had the better gift.  I only want my kids to have magical holiday memories!",
              "id": 69,
              "comments": [
                {
                  "score": 20,
                  "content": "Jesus, that’s awful. Sorry. Is he still married to Cruella?",
                  "id": 70,
                  "comments": [
                    {
                      "score": 31,
                      "content": "They officially divorced a couple years ago. He gave me a heartfelt apology when I was 16yo or so. She has never apologized for the years of trauma she created, but in the last 10-15 years she has become a better/ kinder person.  I have forgiven them both,  as holding onto that would only do me harm,  but it's not something you ever forget.",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "I’m a child of divorce. I have hated the holidays since I was a kid and always will. Due to COVID I ended up spending Christmas with my fiancé’s family a few years ago and it was the happiest I’ve been during a holiday.\n\nI’m sorry your dad told you to leave and not come back. Once my dad told me and my sister that he didn’t want to see us anymore when we were being difficult on a trip. I still see him a few times a year (same with the rest of my family) but I’ll never, ever forget that.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "God, when I realised I was an adult and could just nope out of all things Christmas with the family members who made every December a chore, it was a revelation. That first year when I just declined to visit, have visitors or take any phone calls that I didn't want to, what a marvel. Genuinely delightful.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "My parent's divorce/custody setup was that Dad got one weekend a month, 3 weeks in summer, and every other major holiday. (It was the 70s and fathers rarely got equal treatment/rights when it came to child custody unless the mother refused custody or was demonstrably abusive in a way that the courts of that time were forced to acknowledge. The threshold was far higher then.)\n\nTheir divorce was contentious and Mom made a hobby of doing things to stick it to Dad, but they did manage to come to the mutual agreement that Thanksgiving was the big holiday in her family (she later joined a \"church\" that didn't observe most of the christian holidays while still calling themselves christian, which is a whole other can of worms, but I digress) so she got that holiday every year and Dad got us every Xmas, which was his preference anyway.\n\nIf it hadn't fit so well what Mom wanted, she'd have kicked up a fuss just to inconvenience/irritate/wound him, because that was who she was back then.\n\nI think I was trying to add my voice to the \"xmas every other year is normal in custody arrangements\" chorus and got distracted by how much of an AH my mother was when I was a kid...much like OP.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "So many damned fights about who's going where and who's playing \"Happy Families\"!  \n\nFor many years I had an Open House on Christmas Day. Buffet was set up 1-6. Friends, family and neighbors invited. \n\nWe did Santa and had eggs benedict in the morning. \n\nAll those people who stressed us out are either dead, or just gone. \n\nMy daughter has her Christmas whenever she feels like it and I applaud her for it. We've celebrated Christmas at her house on Jan. 2.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 876,
          "content": "Also OP is so dumb about threatening to bring in the lawyer…”hey my son doesn’t want to spend Christmas with me”, goes to court. “Mason, where do you want to live since you are 16 now?” “I want to live with dad”\n\nLike getting a lawyer involved would not work out in OPs favor at all.\n\nYTA. Big time. Your in-laws don’t accept or accommodate your son, and decides to do something that would allow him to be accommodated and accepted. So your selfishly bash him on the decision. Maybe you were a better mother you made sure he didn’t have a shitty experience by not enabling your shitty husband and in laws, maybe he would have wanted to spend Christmas with you.\n\nYTA YTA YTA",
          "id": 76,
          "comments": [
            {
              "score": 76,
              "content": "What is a lawyer going to do anyways beyond waste money or work out a new custody hearing in a few months? Kind of insane empty threat because a 16 year old “traveling” is a “big deal”. \n\nThis type of total shitfit reminds me a lot of my dad and stepmom growing up. “You ruined everything! I’m calling the lawyer/cops!!”",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Yup! I had a similar situation come up between my mom and dad (divorced). I stopped visiting him and he felt that meant he didn’t have to pay child support anymore. Judge told him it was my decision and that he’s better pay up right away.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yeah, a judge isn't going to put up with this shit. \n\nHe's 16. He can decide.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Seriously! I actually laughed when I read that, because the son is old enough that most courts are going to ask him what he wants. Especially if the agreement already said he got to choose on holidays. Things would not go in her favor. \n\nOP, YTA. Stop being selfish and let your son have a nice holiday. Or don't be surprised when he goes low or no contact as an adult .",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 636,
          "content": "YTA. A lawyer? Who is she taking to court? Her son?",
          "id": 81,
          "comments": [
            {
              "score": 237,
              "content": "I'd love to see her do it tho. Kids old enough (in the States) to decide to live full on with Dad if he wants. At this point family court would give him his own lawyer and let him take part in decisions. By taking her ex to court over their split custody like this she could end up much worse off especially if the manipulation of \"you ruined Christmas\" comes up.",
              "id": 82,
              "comments": [
                {
                  "score": 11,
                  "content": "This is the happy Christmas miracle we are all hoping for and it looks like it may happen. OP doesn’t seem too self aware.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 114,
              "content": "Maybe she's thinking a court could mandate the holiday in her favor? In my state, the judge would just ask the kid, since he's old enough, and that would be that.",
              "id": 84,
              "comments": [
                {
                  "score": 25,
                  "content": "Imagine being 16 and finding out your mother took your father to court to force you to spend a holiday with her after she said you could chose where you go.\n\nEnjoy being no contact with your kid when he turns 18. \n\nI feel genuinely so sad for a child I don’t know, because his mother sounds like she actually doesn’t give AF about him and what he wants.",
                  "id": 85,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 424,
          "content": "All of this. And I’m very curious how a teenager doing Christmas with his dad “ruins” Christmas for them. Unless they now have no one to pawn the younger kids off on so now they actually have to be responsible.",
          "id": 86,
          "comments": [
            {
              "score": 173,
              "content": "It’s emotionally manipulative.",
              "id": 87,
              "comments": [
                {
                  "score": 19,
                  "content": "Yes.  OP doesn't understand why Mason isn't happy with the shit sundae he got for xmas last year and is shocked that he'd want to spend it with someone else this year.  Hopefully his dad is much better.  The fact that he laughed at OP sounds like he is.",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Because they are entitled. They think he owes them his presence because of their entitlement and are upset they aren't getting what they want.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 352,
          "content": "Sounds like her son is old enough to pick not JUST the holidays to spend with dad. Wouldn't blame him.",
          "id": 90,
          "comments": [
            {
              "score": 12,
              "content": "This. Mason may decide to move with Dad instead of Mom. Oh well. She f'ed around and found out. Don't demand your teenage son to be a babysitter for the family.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 291,
          "content": "Completely agree with this! OP YTA, majorly. It is so hypocritical to say you let him choose, and then get mad when he chooses because it’s not you.\n\nAlso, isn’t it fair that he spend Christmas with his dad since he spent it with you last year? I share my child for holidays, that’s what happens when you get a divorce. Yes, it sucks, but it’s a part of life when coparenting. I could never imagine guilting my child like that and causing emotional turmoil over my own hurt feelings, which is exactly what you’re doing. If he was miserable last year, why would he want to\nGo through that again. You say you’re not defending your in-laws but you clearly didn’t stand up for your child or even try to make your own accommodations for him, and you let your husband take away his personal belongings to entertain children? You are TA for that too. You are the parent that makes coparenting difficult. You need to apologize to your son for the treatment you let him endure last year because it was TERRIBLE for him, you shouldn’t put it in quotes like it is not true, and you need to apologize for trying to guilt him this year.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 242,
          "content": "Glomming onto the top comment to say op YTA for saying to your son he is ruining your Xmas, psychologically that's a damaging thing to say and it's not even bloody true, you're ruining your own Xmas.  Saying that sort of shit will have a lasting effect on him (guilt even though he knows he shouldn't be guilty, second guessing himself when there is no need , god allsorts of shit) I am not on board with parents blaming kids like this, they are kids FFS\n\nWhy is his presence going to make such a dramatic difference to your celebration? Why shouldn't he spend it with his dad this year instead of you?   YTA, very much so.  And threatening your ex with a lawyer cos your son wants to spend Xmas with him this year?? Can you hear yourself?",
          "id": 93,
          "comments": [
            {
              "score": 19,
              "content": "And realistically, if she has no compunction with sharing with strangers that one of the first things out of her mouth was that her 16 year old would be ruining her Christmas by choosing to have an enjoyable one elsewhere, it’s not a leap to expect that she has spewed all sorts of emotionally manipulative nonsense all over that poor kid on a regular basis. She’s setting herself up to be LC or NC with this kid once he’s grown if she doesn’t learn some emotional intelligence and better communication. Yikes.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 236,
          "content": "\"It's his choice.\"\n*gets angry when he decides against her*\n\n\"I'm not defending them.\"\n*proceeds to defend them*",
          "id": 95,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12251,
      "content": "Yeah, in my opinion, YTA. \n\nHe spent last Christmas with you guys, I think it's only fair for him to want to spend this Christmas with his dad. \n\nTotally unfair for you to say that he ruined Christmas, he's a kid still. \n\nDid you think he'd spend every holiday with you guys when he also has a dad he'd like to spend the holidays with?",
      "id": 96,
      "comments": [
        {
          "score": 3090,
          "content": "Going to add that have you thought about how your response/family ruined or will ruin your son's Christmas? It's not all about you guys. \n\nI get wanting to spend time with your son during the holidays, but it's not just about you guys it's about your son too.",
          "id": 97,
          "comments": [
            {
              "score": 1670,
              "content": "OP is being incredibly manipulative here. It sounds like \"we began letting him decide\" meant \"he can decide as long as he chooses us!\" As a child of divorce, I cannot imagine how hurtful it would've been for my parent to tell me I was ruining Christmas by not being with them \n\nYTA OP, and you're very immature and selfish. Apologize to your son immediately and perhaps you can salvage the relationship",
              "id": 98,
              "comments": [
                {
                  "score": 413,
                  "content": "I'm 30 and my divorced parents STILL get upset about holidays my brother and I don't spend with them. Told my dad last month that my mom is having a major, 8 hr surgery two days before Thanksgiving, and his response was, \"But you're still spending Thanksgiving with me right?\" \n\nI mean I am, my mom chose that surgery date because she knew we were spending Thanksgiving with our dad, but I did not appreciate the sentiment. My mom is just as bad. My brother and I are not huge fans of the holidays. Our parents wind up disappointed no matter what we do.\n\nAnyways I empathize and OP's post pissed me off to no end. Grow up.",
                  "id": 99,
                  "comments": [
                    {
                      "score": 68,
                      "content": "Jesus, that's next level shit, I'm so sorry you have to deal with that.\n\nMy petty ass would just be telling them that I would no longer spend holidays with either of them going forward.",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Absolutely. From the moment I had kids Christmas was no longer my holiday or my wife's, or even a family holiday, it was my kid's holiday and I've spent the past 19 years ensuring that, whether I could spend on big gifts or not, that it was a holiday they remember as being magical.\n\nAt that age he might also be able to now choose who he lives with, OP is absolutely the AH and risks making things irreparable.",
                  "id": 101,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "ah but there's where you're wrong! It IS all about them!",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 448,
          "content": ">Totally unfair for you to say that he ruined Christmas, he's a kid still.\n\nYes!! It is very emotionally manipulative to say that. He ruined christmas because he wants to spend it with his dad?  You are being overdramatic like he said and yes.. YTA",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 344,
          "content": "Agreed. Hard YTA. \n\nLike you said, he spent Christmas with OP last year. It is only fair that he spend it with his dad this year. This is only compounded by the fact that Mason had a horrible experience with OP's inlaws last year, and OP didn't seem to care. It sounds more like OP is fine with her son having a miserable Christmas so that she can play picture perfect family in front of the inlaws, while the son's dad is actually taking his son's preferences into consideration. \n\nOP, you are being selfish and manipulative. Also, your son is 16. He can choose which parent he lives with. If you go to court, you may end up losing custody of your kid and having to pay child support.",
          "id": 104,
          "comments": [
            {
              "score": 69,
              "content": "I was thinking about that as well. She is threatening court but her kid is old enough to tell the judge his preferences and why he doesn't want to spend holidays around his mom and her husband. He even has the ability now to give preference on where he wants to live. If she keeps pushing it, I would not be surprised if he wants to live at his dads in the future.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "He's 16, practically an adult. It's \"fair\" if he spends it wherever the hell he wants, even if that means never spending another Christmas with OP again.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 164,
          "content": "[removed]",
          "id": 107,
          "comments": [
            {
              "score": 9,
              "content": "u/Traditionasaize175 is a bot.",
              "id": 108,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 111,
          "content": "[removed]",
          "id": 109,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 54,
          "content": "Yes even if last Christmas with them hadn’t sucked I think it would have been normal to spend this one with dad!",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "OP trying to convince herself and us that she's got a son problem, when what she's got is a husband & family problem.\n\n''You can choose where you spend Christmas (as long as it's us, and we'll make it miserable)''.\n\nFor OP, YTA.",
          "id": 111,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "She should get a lawyer, so she can hear the judge listen to the 16 year old since she won't. Her whole post reads like a list of how she ruined his Christmas last year. Can't wait for the Pikachu face when the kid goes no contact. She sounds insufferable.",
          "id": 112,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "This is what rubs me the wrong way. Usually when a kid has a good relationship with both of his divorced parents, it is understood that they rotate where they spend the holidays.\nOP, Mason is 16. He should have the final say in where he goes as long as neither you nor your ex have any habits that would compromise his safety. And threatening your lawyer makes you double the a-hole.\nYTA.",
          "id": 113,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7089,
      "content": "YTA\n\nMaybe if Mason had enjoyed his Christmas, and was treated fairly, he’d want to be around you for Christmas?\n\nHe also chose to spend it with you last year, why can’t he switch off this year if you “let him choose”?\n\nI get the impression that the only reason you give him an option is so that you get to lord it over your ex when you get picked, but now that it’s gone the other way you’re throwing a tantrum. And you’re going to ruin your kid’s holiday (and your relationship with him) if you keep pushing this.",
      "id": 114,
      "comments": [
        {
          "score": 1801,
          "content": "I saw another comment on this elsewhere, but OP had better be mindful of the fact that at 16 a court may take his opinion into account if he asks to just be with his dad full-time. Went through it with my older half siblings. They may lose a lot more than Christmas with him.",
          "id": 115,
          "comments": [
            {
              "score": 706,
              "content": "Maybe they should if she’s being this manipulative to a child",
              "id": 116,
              "comments": [
                {
                  "score": 361,
                  "content": "YTA and trust me, he's going to remember you telling him he ruined your Christmas for the rest of his life, regardless of the actual outcome and resolution.",
                  "id": 117,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Yep, I remember being told I ruined Christmas when it was my father's need to argue with his 14yr old daughter that created the problem. The argument was so trivial I don't even remember what it was now. Needless to say, as an adult I have felt no guilt in choosing to do exactly what I want to do for the holidays.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 169,
              "content": "This is so true! When she said she was going to call a lawyer, I laughed, the kid is 16, and the court is going to let him decide anyway at that age. She needs to be careful with threats like this when she isn't getting her way, it will backfire big time!",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "Yup. My mother finally lost custody of me after years of my dad suing for full custody. The nail in the coffin was that at 16 I was like \"Get me the fuck outta here\", then I lived with my dad and she was stripped of parental rights.\n\nI'm sure the Christmas issue is not the only thing that Mason deals with in this family. He's not treated like a full family member during Christmas, and it's a safe bet that treatment extends beyond the holidays.\n\nOP, YTA.",
              "id": 120,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "My dad acted this way when I finally found a job at 17 in my new town. They had a last minute shift open on a Saturday morning and said if I could fill it they’re permanently hire me. It happened to be during my dads weekend. When I asked him he said “I’m not sure where the statement dads weekend implies that you have a choice.” I had even offered to drive myself after the shift and then drive my brothers home so he could save time on Sunday. When all this was put in front of a judge the judge turned to me and asked now that I have a job like an adult how would I like to be treated with respect and given an actual choice. I never went to my dads house again.",
              "id": 121,
              "comments": [
                {
                  "score": 19,
                  "content": "So shite that he wanted to be so petty about getting what he felt entitled to, time with you, that he would deny you a chance to start growing into an adult.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 12,
                      "content": "What made it worse was the fact that he expected me to have a job. I had had one at 16 before I moved. He just somehow expected me to find a job that would give me every other weekend off for him as well as stick to limited hours Monday-Friday because of school. It wasn’t until my early 20s that I had learn that people in that town RARELY got hired anywhere before 18 but some* fighting parents refuse to look at their kids as more than pawns in their divorce games.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "OP totally lords it over their ex. This is evident in the fact they threatened to call their lawyer.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "he's also 16,  when i was that age i would spend some time with the family then go up and read a book for an hour.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "She only meant let him choose when she can guilt trip and manipulate him into choosing her.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6599,
      "content": "You are so obviously the AH that I have a hard time believing this is real, but I'll answer you anyway.\n\n>Nathan and his family had little to no accomodation for his food choices (I'm not defending them but my inlaws are quite traditional when it comes to food and a bit ignorant to what types of foods Mason eats). He also said he didn't feel as welcom as the other kids in the family and that Nathan forced him to share his personal stuff like his phone so that his stepnephews could watch christmas movies.\n\nSo you didn't lift a finger when your son's Christmas was getting ruined last year, but you have the nerve to try to emotionally blackmail and guilt trip him about \"ruining\" yours? **You failed** to look out for your son last year, so the natural consequence of your failure is that your son has realized he needs to look out for himself. Instead of lashing out at everyone else, why don't you take a good hard look at yourself and understand what YOU did to drive him away.\n\nDo better. YTA.",
      "id": 127,
      "comments": [
        {
          "score": 830,
          "content": "right? i can’t tell if this is bait or not. if it is real, she clearly doesn’t care about her son unless he’s her perfect baby.",
          "id": 128,
          "comments": [
            {
              "score": 183,
              "content": "I believe this is real, it reminds me of my own parents' divorce. Sometimes it has nothing to do with the kid but is all about shitting on your ex.",
              "id": 129,
              "comments": [
                {
                  "score": 39,
                  "content": "It's not that the situation is unbelievable, but that it's so obvious that they're the asshole that it's unbelievable that they'd post it and expect otherwise which is why it seems likes a bait. The poster would have to be seriously deluded to think they'd get a positive response.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 62,
                      "content": "They went through all the things that make them TA (letting him choose where he goes for Christmas when that’s clearly not the case, food he didn’t like, sharing his phone, he felt unwelcome) and then made no attempt to redeem the situation. Just goes into “yeah so since he didn’t choose me, now I’m mad! AITA?” \n\nI’d say it’s definitely bait",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "This reminds me so much of my mother it hurts. Got into a giant fight one time coming home from college. I was passing through my sisters town (half sister from my father, not related to my mother) and said that I was going to stop there for dinner since I was hungry and hadn't seen her in a while (it was a 6 hour drive). My mother threw a fit. Like full on rage screaming and cursing. Apparently my mother had built up this huge dinner in her head for me coming home. Did it matter that I was hungry now? No. Did it matter that even if I didn't stop I wasn't getting home until like 9pm anyway? No. Did it matter that she never told me any of this? No. All that mattered was I \"ruined\" her ideas of what she wanted.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "The \"we started letting him decide\" really makes me think this is bait",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 358,
          "content": "The emotional blackmailing is the worst part. Anyways, how can his absence ruin their Christmas?? This is ridiculous.",
          "id": 134,
          "comments": [
            {
              "score": 195,
              "content": "Based on his being forced to let step nephews watch movies on his phone, I’m going to guess he’s ruining Christmas by taking away everybody’s free babysitting.  I would be curious if he has younger half siblings he’s regularly asked to “pitch In” with.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Maybe she is worried her in-laws will think less of her if they're not being a perfect little family. Which would still be ridiculous",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 177,
          "content": "Agreed. Literally lists a dozen things that happened to make last Christmas miserable for her kid, says they gave him the right to choose, does surprise Pikachu face when kid wants to spend Christmas with Dad. \n\nOP, you’re arguing about wanting your kid to have another miserable Christmas because it would ruin it for you. Get over yourself. YTA.",
          "id": 137,
          "comments": [
            {
              "score": 13,
              "content": "so basically she's telling her son that unless he is miserable and feeling unwelcome her Christmas will be ruined.  niiiice.  OP is a massive AH.",
              "id": 138,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I'd love to agree that this doesn't seem real, but honestly this sounds a bit too much like my own life about 24 years ago to dismiss it. As you can imagine I go years without seeing my mother.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Bro no lie. I’m a new father so I be worried about fucking things up with my son a lot but after reading through some of these for a while, only the ones that pertain to parenting, but a lot of these people really be bugging and it’s wild to see that they feel like they’re not tripping or in the wrong. If anything I feel like she should be helping and supporting her son seeing as how he himself is saying that he doesn’t want to do Christmas with the in laws and giving valid reasons for why he doesn’t want to go.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": ">You are so obviously the AH that I have a hard time believing this is real\n\nThat's my take. This post is basically:\n\n>I kill puppies for fun and I poisoned my daughter to spite my husband while shooting up heroin that I bought with my kid's college fund and I publicly post creep shots of people that I take outside their bedroom windows. AITA????",
          "id": 141,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "I really get the feeling that the main post was either written by Mason or the Ex Husband from the perspective of the mom. The wording of the story and the whole situation is so obviously biased against herself.",
          "id": 142,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3082,
      "content": "YTA\n\n>As he got older we started letting him decide.\n\nEnd of story, he decided. Also, it's clear he is not really cared for that much at your in-laws. \n\n>his family had little to no accomodation for his food choices\n\nAnd\n\n>Nathan forced him to share his personal stuff like his phone so that his stepnephews could watch christmas movies.\n\nDid you ever stick up for your son in this scenario? Off course YTA, and off course your son wants to celebrate Christmas somewhere else. As is his right to do so.",
      "id": 143,
      "comments": [
        {
          "score": 1596,
          "content": "\"Give the other kids your phone to play with!\"\n\n\"I don't want to. It's my phone.\"\n\n\"Do it anyway! And eat your dinner!\"\n\n\"I can't eat anything here.\"\n\n\"Well, your step-grandparents just don't get dietary restrictions! I guess you can't eat anything!\"\n\n...\n\n\"So who do you want to spend Christmas with this year? You're old enough to choose, after all!\"\n\n\"I'm going to Dad's this year for Christmas.\"\n\n:::surprised Pikachu face:::\n\nYTA",
          "id": 144,
          "comments": [
            {
              "score": 455,
              "content": "Yup, Nathan is a bully and a dirtbag. He should've shared his own damn phone. What the hell is wrong with both the mom and step dad? Their both POSs",
              "id": 145,
              "comments": [
                {
                  "score": 113,
                  "content": "And ThErE's GoInG tO Be TrAvElInG!\n\nSo what??? He's 16! Pretty soon he's going to be traveling the F away from you and probably for good if this is the way you treat him.",
                  "id": 146,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 50,
                  "content": "But that would be an invasion of his PRIVACY /s",
                  "id": 147,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 235,
          "content": "The fact that it sounds like OP knew the in-laws wouldn’t be accommodating but still didn’t make an effort to ensure there was accommodation for Mason is just pathetic. She let his Christmas be ruined last year, she deserves to have hers “ruined” this year IMO.",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 100,
          "content": "Not only is OP the AH, but hilarious she threatened to call her lawyer. Sure lady, call your lawyer and make both of you spend money on something in which the judge will almost certainly say, “The 16 year old decided where he’s going so that’s where he’s going.”\n\nSource: Family law attorney. If I was this lady’s attorney, I’d say, “Sorry you’re disappointed but he chose so let’s not waste time and money fighting a 16 year old.”",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "And yet, my favorite part is still:\n\n\"we were discussing our plans for Christmas when, *out of nowhere*, my son announced his plans for Christmas\"\n\nYTA. Hes old enough to decide for himself.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Also I am not so sure if the inlaws were willfully ignorant or if they just didn't really know and if it was the second one it is 100% on op",
          "id": 151,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1383,
      "content": "YTA. It sounds like you and your ex established that your son gets to decide - so when he decides he doesn't want to spend Christmas with you, you pull out an emotional manipulation tactic? I think it would be fair for your son to spend Christmas with his dad just based on the fact alone that he spent it with you last year. But all of that aside, it's a really unfair expectation to put on a child that if they don't do what you want your holiday is ruined. That is not a healthy emotional boundary and will foster resentment.",
      "id": 152,
      "comments": [
        {
          "score": 279,
          "content": "The emotional manipulation also explains why Mason didn't tell her sooner that he was planning to spend time with Dad",
          "id": 153,
          "comments": [
            {
              "score": 15,
              "content": "Honestly, it's not even December yet. He gave her a lot more warning than many families get.",
              "id": 154,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 193,
          "content": "I swear, half the problems in this sub are by so-called parents refusing to even try to parent.\n\n\nIt was YOUR job to make sure your son had food he could eat.\n\n\nIt was YOUR job to make sure he feels welcome and included.\n\n\nIt was YOUR job to make sure your new hubby wasn't crossing boundaries by lending out his personal items without permission.\n\n\nIt was YOUR job to stick to the agreement you made. He gets to choose. And if not choosing you \"ruins\" Christmas, then did you always just intend to ruin all of his Dad's Christmases?\n\n\nYTA. It shouldn't always be about what *you* want for *his* life.",
          "id": 155,
          "comments": [
            {
              "score": 15,
              "content": "In my experience it's half of all parents too",
              "id": 156,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": " She wants a free sitter so she can sip eggnog with her inlaws",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "> so when he decides he doesn't want to spend Christmas with you, you pull out an emotional manipulation tactic?\n\nDon't forget threatening legal action against the Ex. OP you do this you will at most have 2 very miserable Christmases before your son never spands it with you again.",
          "id": 158,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 977,
      "content": "YTA wtf your kid didn't like Christmas last year, because he was FORCED TO SHARE HIS STUFF, what's the problem??? Don't you have any empathy for him?\n\nThat being said, he is 16. 16! He can decide where he wants to spend Christmas AS PER YOU AND YOUR EXES AGREEMENT. He did that. And you shame him for it, as well as threaten your ex with a lawyer??? I have no words.",
      "id": 159,
      "comments": [
        {
          "score": 275,
          "content": "Not to mention the all out EMOTIONAL BLACKMAIL.  \"you're ruining MY christmas\" Seriously?  Who says that to a teenager aka hormone cocktail/ emotional rollercoaster of a person? Being a teen is hard enough without your mom giving you a fucked up guilt trip because \"you didn't choose to have a shitty time so you ruined MY DAY with your choice to at least not have a horrible time\".  OP needs some serious communication lessons and therapy so she stops treating her kid like a personal emotional support pet!",
          "id": 160,
          "comments": [
            {
              "score": 20,
              "content": "Classic narc mom",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "True!!!",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Plus at 16, he is legally old enough in many places to decide where he lives. If OP were to take the issue to court, she could stand to lose a lot more than not having him on Christmas Day.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 874,
      "content": "So you can only have a good Christmas if your son is miserable? \n\nYTA.",
      "id": 164,
      "comments": [
        {
          "score": 81,
          "content": "Nothing says family bonding like a hostage situation.",
          "id": 165,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 47,
          "content": "Sure sounds like it to me",
          "id": 166,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 612,
      "content": ">Last year he spend Christmas with me, Nathan and my inlaws and he complained that the experience was \"terrible\" because he said Nathan and his family had little to no accomodation for his food choices (I'm not defending them but my inlaws are quite traditional when it comes to food and a bit ignorant to what types of foods Mason eats). He also said he didn't feel as welcom as the other kids in the family and that Nathan forced him to share his personal stuff like his phone so that his stepnephews could watch christmas movies.\n\nOK, so what did you tell him you would do differently this year so that the experience would be better?\n\n>We started arguing and he started complaining about me trying to ruin the experience but in response I told him that he has already ruined christmas for me and his stepdad the minhte he agreed to this arrangement.\n\nWhy does your enjoyment of Christmas hinge on him being there?\n\n>He got up and walked away after saying that I was being \"overdramatic\".\n\nYou're entitled to your feelings, but he isn't wrong.  A 16 year old is calling you \"overdramatic\". \n\n>I had a huge argument on the phone with Mason's dad and he kept giving me an attitude and laughjng and saying that I sounded pathetic. When I told him I'd have my lawyer call him, he bbackpaddeled and said he wouldn't have done this if Mason didn't like it.\n\nYou said Mason can choose where he spends Christmas.  What would getting your lawyer involved accomplish? \n\nYTA",
      "id": 167,
      "comments": [
        {
          "score": 133,
          "content": "Could you imagine THAT Christmas day at Stepgrandma-dearest’s if a judge forced a 16 year old to spend the holiday there?",
          "id": 168,
          "comments": [
            {
              "score": 66,
              "content": "Oh, 16 year old version of terrible twos tantrum in the making, there! Never underestimate the ability of a teenager who feels wronged to make everyone else suffer, too lol",
              "id": 169,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "I’m 31 now, but I cringe picturing the absolute disaster I could have caused at 16 if I were being forced by the courts to be somewhere after being told I could pick. That family wouldn’t ever want to see me again.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 112,
          "content": "Getting a lawyer involved would result in OP's son sitting on the stand and saying he wants to live with his dad and the judge will likely take his wishes into his account because teenagers his age get a say in where they stay in many jurisdictions.",
          "id": 171,
          "comments": [
            {
              "score": 17,
              "content": "OP could also be looking at higher child support payments",
              "id": 172,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "Yeah — the lawyer comment really threw me. \n\nDepending on the state, the lawyer will just say “he’s 16, which is the age he’s allowed to make his own choice as to which parent he would like to stay with. There is nothing we can do here.”\n\nI read the ex’s reaction as “Jesus, she isn’t going to back down. Let me just shut up” and not “oh no! A lawyer! Fuck!!!” Which is how OP interpreted it. She’s like, “see, I got you!” But really she’s just toxic and the ex is like “glad I got out of that!”",
          "id": 173,
          "comments": [
            {
              "score": 20,
              "content": "There’s no way they’d even get in front of a judge in time for Christmas. They’d be lucky if it happened before the kid turns 18.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "The only way the lawyer comment makes sense is if OP and Nathan have a lot of money to throw at legal proceedings and the ex doesn't. Which makes OP worse.",
          "id": 175,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "Honestly the judge part is just further manipulative tactics.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 469,
      "content": "YTA. \n\nYou said you guys decided that Mason should get to decide who he wants to spend Christmas with. He did that. And now your upset?\n\nYour son’s last Christmas was ruined. Why should he ruin this one so you and your husband’s Christmas isn’t ruined? What odd logic is this?",
      "id": 177,
      "comments": [
        {
          "score": 7,
          "content": "Sing it to the tune of Jingle Bells:\n\n🎶🎄”I, I, I, me, me, me, it’s all about me!\n\nit’s no fun for anyone if I don’t get my way, hey!\n\nMe, me, me, I, I, I, me, me, I, I, me!\n\nIf my son does what he wants he’s RUINED CHRISTMAS DAY!!!” 🎅🎶",
          "id": 178,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}