{
  "post content": "Hello reddit \nI am a 41f and work at a small independent grocery. And I've been here forever.\nThis whole year has been a rollercoaster for us. I mean, it's a town of less then 2000 people, but our store has become the main shopping place for several surrounding communities, because the bigger towns are riddled with the big yuck and people have been swarming to our store. And being so short staffed is exhausting. When they find someone new, we treat them with kid gloves and pray they work out. \nThey hired a new girl this week, and the woman who usually trains people is out with being sick, so they asked me to. This kid a 20 y/o dropout w 2 kids under 4, and lives with her parents - we all have our paths to follow. But her world view is f'd up. She starts her first day telling me, a stranger, how women aren't really women unless they have children (which I don't) and mothers aren't really mothers unless they have more than one child. Say what now?! \nI asked if she was religious (I honestly thought she was in a weird cult) she claims to be atheist. I have never been so offended in my life, the kid gloves came off, and I lost my shit. The owner and my coworkers are all split. We need the help, and we are all exhausted, and everything just sucks. \n\nAita?",
  "id": 1,
  "comments": [
    {
      "score": 24,
      "content": "ESH. Gotta update in light of the details. The way you lost it went too far. You didn’t just tell her she didn’t know what she was talking about and was being offensive. You also belittled her life choices and cursed at her (which some people are deeply offended by). It’s particularly bad because you were in a supervisory role as her trainer. I wouldn’t beat yourself up because you’re under pressure, but yeah, no good.",
      "id": 2,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 16,
      "content": "On the one hand, you prob should have kept your cool in the interest of making things easier for the whole workplace. On the other hand...... this kid needs to learn to keep her weird viewpoints to herself. It was totally inappropriate for her to start evangelizing her bizarre offensive opinions to her new coworkers. Depending on what \"lost my shit\" means, maybe ESH? Wouldn't fault you for telling her off pretty sternly and vehemently, but if you totally lost your temper and started yelling or cursing, admittedly that's not great.",
      "id": 3,
      "comments": [
        {
          "score": 5,
          "content": "This. Being in a new work place isn't the place to start throwing around your beliefs, especially when you are putting others down due to them. I am going with ESH, just because you need to learn your audience before saying that people aren't women if they haven't had children, especially if you are still living of your parents. I would have waited and gone to her supervisor to explain what was going on and had them handle it.",
          "id": 4,
          "comments": [
            {
              "score": 5,
              "content": "I'm also kinda curious how OP knows this girl's life story? Like, it doesn't sound like they knew each other prior to this, and in a lot of places it's basically illegal to ask about someone's family during the hiring process, so did the new girl also just spill all her baggage about being a 20yo dropout/single mom living with her parents in her first 10 minutes at her new job AND THEN start spouting off about how women aren't really women unless they've had kids? That's a lot.",
              "id": 5,
              "comments": [
                {
                  "score": 2,
                  "content": "It says the town has less than 2000 people. In towns that small people have some general idea of just about everyone lol",
                  "id": 6,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "Based on the additional info you've given, ESH. I'm also confused by this:\n\n\"I asked if she was religious (I honestly thought she was in a weird cult) she claims to be atheist. I have never been so offended in my life.\"\n\nThis seems to be saying that if she WERE in some weird cult you wouldn't have been so offended. Based on this and some of the info you gave about her background, I think your reaction was heavily influenced by her personally rather than what she said. Granted what she said was terrible, and if I were her boss I would've fired her, but I think there were some other things in there that caused you to overreact.",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "ESH. She should be there for the job, not to spout her opinions about her views of women. You’ve been at that store how long? I know it’s not your normal position to train people, but in a situation like that, you return focus to work. You don’t lose your shit.  \n\nNow if she was telling YOU that you weren’t a “real woman” or another coworker that SHE wasn’t a “real mother”, you bring that up to your supervisor/store manager. Unless you are store manager, there is always someone who gets paid more than you to handle those situations.",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "ESH. Both of you need a lesson on appropriate work behaviour.",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "The 20 year old is immature for launching into her opinions and insulting the co worker who is trying to train her. I understand OP being super annoyed - BUT it is a work situation and she is supposed to be training the new hire so she should have steered the conversation back to work and advised the newbie to check her opinions at the door when she begins her shift because she is working with the public who may not agree with her. ESH",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "Between YTA and ESH.  More leaning to YTA.\n\nReason being is I’m guessing she doesn’t know anything about you and you lost your “shit” over it.  She doesn’t know you, her words isn’t the law, and frankly it doesn’t sound like spewing hate towards people who doesn’t fall into her idealistic view of gender responsibility.  Who cares what her thoughts are? \n\nYou’ll always have coworkers you’ll disagree with.  Unless if they are purposely trying to screw you over, I would just avoid them because there’s more to life than to try and change someone’s view so you can feel accepted.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "ESH.  Kid's opinions are awful, but the way you handled it was not appropriate.",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "I’m not going to make a judgement, but I’d like to offer some advice. I’d apologize, even if you don’t mean it, because if she complains about it being a hostile work environment, you could lose your job or, god forbid, she could sue. We all have those coworkers we would like to just lash out at, but learning to bite our tongues is one of the hardest lessons we learn.  \n\nI’m sorry you’re going through a rough time. I hope things get better for you, and I hope you know and believe you are NOT less of a woman because of your personal life choices.  I hope things get resolved quickly and quietly for you",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "**Edited** YTA based on OPs response. You sound incredibly judgemental and rude. Regardless of their behaviour you need to be professional in the workplace and stop judging other people, especially people half your age doing the same job as you.\n\nI N F O By lose your shit, what did you say/do?",
      "id": 14,
      "comments": [
        {
          "score": -8,
          "content": "Oh. Sorry, it went along the lines of \"how dare you fucking talk to me like that, and just because I didn't get knocked up at 16 years old, doesn't make me less of a woman. And you need to grow up before you say a word about shit to do with the real world.\" And a few other unsavory things",
          "id": 15,
          "comments": [
            {
              "score": 13,
              "content": "You're 41 years old working at a grocery store. There are a lot of people that would judge you for that and assume you \"failed\" or made poor choices, as you assume she did. I honestly had to go check your age again because she's 20, she has a lot of maturing to do because she's barely an adult. What's your excuse? If you can't control yourself to the point of screaming at a coworker then you're quite immature yourself.",
              "id": 16,
              "comments": [
                {
                  "score": 4,
                  "content": "Right? Also, I love how OP is trying to lord over and act all superior than their co worker when you're 41 working at a grocery store. You aren't doing much better OP.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I can see why someone in a city might have a poor opinion of a 41-year-old working in a grocery store, but this is a village with fewer than 2,000 inhabitants, and everyone knows everybody else. The situation is probably quite different.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "yikes",
              "id": 19,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}