{
  "post content": "When I met my now ex he was in a shitty living situation with a lot of harassment and could barely pay his rent. I invited him to live with me (in his own room). I gave him a very fair rent (much less than his percentage cost) and told him that if something happened between me and him he would still be welcome as a roommate.\n\n\nLater he breaks up with me and starts spending a lot of time with his exgirlfriend. Since we wanted to be friends he came clean that he cheated on me with her for months. I decide I can still be his friend, we live together and I really do enjoy being his friend, but that I dont have any desire to be her friend. \n\n\nShe comes over sometimes and I'm civil. If I'm the first one to the door I let her in, I reply to her, I just don't initiate anything with her on my own. \n\n\nToday they came over while I was hanging out in the living room and I just kept doing what I was doing. They were bringing furniture in and I asked if I was in the way and moved when they said yes. \n\n\n5 minutes later he comes back out and tells me its unfair that I'm being so unwelcoming and rude to her. That its okay I dont want to be her friend but I cant be mean to her. I say that I dont think I'm being hostile, I'm just keeping to myself and letting them do whatever they want to do. He agrees I'm not being hostile but says I need to try harder to be friendly. I tell him that would be a lie, and I'm not going to, and that he's free to have her over however much he wants and do what he wants and I'll stay out of his way. I'll still be his friend when shes gone, but I dont want to hang out with her and I'm just going to keep to myself. \n\n\nHe says that sucks and he doesnt know if he could still be my friend anymore if I cant be friendly to her. I tell him yes it does suck, but it is what it is and I'm not willing to pretend anything other than what I feel, but I will stay out of their way when she's here. He reexpresses that I need to be more friendly or he'll stop being able to be my friend because its uncomfortable for him to feel like he's in the middle. I acknowledge that and say that I can't do anything more than what I'm doing now. \n\n\nThat's the backstory. \n\n\nSo. Where I'm stuck on is if I'd be TA is if he follows through with that and decides he cant be my friend anymore, would giving him 30 day notice of change of rent costs make me TA? \n\n\nRight now he pays well over $70 less per month just for his portion of rent+utilities. I also cover his grocery costs at no additional expense. I would not have offered this if he wasnt my friend. For a regular renter I would have calculated the costs by percentage, and given them their own shelves in cupbards and fridge so they would be responsible for their own food costs. \n\n\nHe doesn't bring in enough income to meet all of those expenses, which is why as his friend who makes more money than him, I have covered some. But if he's decided he cant be my friend anymore, am I still obligated to give him that price?",
  "id": 1,
  "comments": [
    {
      "score": 659,
      "content": "Holy moly you are letting him take advantage of you. You're paying for his food??? You're keeping him as a friend after he cheated on you and brings around the girl he cheated with? And this guy has the gall to demand you be friendly to her? Forget raising the rent. Evict his ass and work on improving your self respect. You deserve so much better than this.",
      "id": 2,
      "comments": [
        {
          "score": 151,
          "content": "I was about to write this. My gosh how do you even live with him, get him out of your life and do a favor to yourself!!",
          "id": 3,
          "comments": [
            {
              "score": -139,
              "content": "We're unfortunately super entwined. We have a lot of shared hobbies, I got him a better job at the company I work for (we don't work directly together) and neither of us know many other people in the area. I've been wanting to keep the peace as much as possible so everything doesnt turn to chaos.",
              "id": 4,
              "comments": [
                {
                  "score": 132,
                  "content": "Can I have some money? You seem to not know how to say no so let’s skip the sob story and lemme get that $100",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1,
                      "content": "dude, you are TA",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": -54,
                  "content": "There's a fair amount of downvotes here on this comment, obviously people feel I'm in the wrong with something I'm saying and I would very much like to know what it seems like I'm doing wrong. My main priority here is growing and developing past this because this is not drama I want or expected in my life. Please let me know how I suck so I can fix it?",
                  "id": 7,
                  "comments": [
                    {
                      "score": 154,
                      "content": "being friends with him is what wrong. many (me included) cannot fathom why you are friends with such an..ahem...unfavorable man. The downvotes/opposition you meet is from those who are concerned for how you treat yourself.\n\n(from another comment)\n>when he's not shitty he's a good friend.\n\nthat sentence is very troubling, yes everyone is good when they're not bad. But with real, good friends you would never utter this sentence, all you would say is \"he's a good friend\"\n\n>. My main priority here is growing and developing past this because this is not drama I want or expected in my life\n\ncut him off, he is a POS and is using you. Get a new roommate and kick his ass to the curb. Learn that you deserve SO MUCH better than trash like him.\n\n>Please let me know how I suck \n\nyou \"suck\" because your immediate thought is that YOU are the one who sucks, but no it is him.\n\n\n> I got him a better job at the company I work \n\nGod, you sound like such a kind hearted, and pure person it is hard to criticize you, but know it comes from a place of love. You are shackling your self to a lesser human, when you have the heart to be so bright.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "Keeping the peace! Peace is not the absence of war. Right now you're actively hurting yourself. He can't stay in your flat no matter what. I'd be really surprised, if you didn't develop stress symptoms while acting like a saint.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I downvoted you because you are enabling such an asshole. People who enable assholes entrench their behaviour. Stop helping him and start looking at it dispassionately. The guy is so clearly believing you will do anything to keep him in your life that he is confident that blackmailing you with the loss of his friendship will be enough to make you back down. See it for what it is - he thinks you are desperate to keep him, no matter what he does. He does not respect you.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 11,
                      "content": "Hes using you dude and tbh you should've just kicked him out as soon as you broke up. He confessed to cheating on you, then brings his ex over and expects you to be friends? No. I downvoted this because you're just letting this dude use you left and right because you dont want to start drama. You seem like an awesome person and you handled this way better than I probably wouldve but you're just letting people walk all over you at this point.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "You're being downvoted because you're letting you ex walk all over you *and defending his actions towards you* intge name of keeping the peace. WTF. He does not get to dictate who you are friendly to, especially in your own apartment.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "The \"we don't know many people\" is what triggered me. It is not a reason, it is an apologetic  excuse you conjured up to have an easier life (yes, meeting new people can be scary, especially as adults); but, clearly, your life is not easier one bit atm: it is harder, in fact, because of your situation with this individual (whom, btw, I don't find as bad as other people do: yes, he is not a nice person, but you are enabling him). So, my advice for you, is: ask him to leave (if he sais no or tries to talk you out of it, kick him out then) and go find people who share your Interests; hit the gym, go to a collecting card store, start playing an instrument, go dance at a club, enter a library or a coffee shop. People are actually pretty decent, if you give them a chance. And give yourself a chance to be loved as one deserves. No more excuses.\n\nEdit: typos",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Because you’re letting him take advantage of you even after he cheated on you, broke up, and now is shoving the girl he cheated on you with in your face. You need to respect yourself",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Hey, I wanted to say that I'm on your side on this. You sound like a really nice, down to earth person who's just trying to keep the peace and I agree that you should be able to just stay friends and stay out of the way when the girlfriend comes over. People are often too eager to find drama.\n\nThe thing is that how sustainable is your situation, really? Can you afford to subsidise his living in the long term? Courts will often find that you've set a precedent and will oblige you to continue paying for him if things do get messy. Depending on your contract and region, the eviction process might be lengthy. \n\nI'd advise you to just end things now whilst you're on semi-good terms. You can maintain a cordial friendship without living on top of each other.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Really? Really? You are text book definition of doormat sorry(not really) OP.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "THIS! Please get some self respect!!!",
          "id": 17,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "YESS. OP, this breaks my heart. Evict this guy. He's 100% taking advantage of you. You DO deserve better.",
          "id": 18,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Its a shame this came down as ESH because your comment didn’t have a NTA judgement in it.  :(",
          "id": 19,
          "comments": [
            {
              "score": 2,
              "content": "I'm not sure ESH is totally wrong. OP needs to stop enabling the ex.",
              "id": 20,
              "comments": [
                {
                  "score": 1,
                  "content": "Valid point, but that wasn’t really the question OP asked.  I don’t disagree with you.",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 115,
      "content": "A VERY gentle ESH. He sucks for obvious reasons. He's an asshole, OP and you need to him out of your life. Get a new place, or kick him out, find new friends, and for the love of all that is good in this world, STOP cooking/cleaning/paying for his self centered ass.\n\nThe reason I went ESH is because you have allowed this man to take advantage of you and are complicit in his behavior. You are not being a good friend as he is not your friend. You are allowing him to not only live there (reasonable), but to also treat you like his personal bank/cook/girlfriend/etc all while paying far less than he should be paying (unreasonable)! Stop letting him do that. You're not keeping the peace, you're allowing yourself to be taken advantage of at a staggering degree. If you won't respect yourself enough to protect your finances and self worth, why on Earth do you think someone like him will ever do so?? He's a bad guy, OP. Cut him off.",
      "id": 22,
      "comments": [
        {
          "score": 14,
          "content": "That one is hard to hear. Because when he's not shitty he's a good friend. We have a ton in common and we do a lot of shared activities together. He offers to help me out with shit when there's other stuff going on (though to be honest never in a way that actually inconveniences him). It's just that at every single point he's put this person at a higher priority than me and I'm  struggling to find where to draw the line. In the long run I'm really okay if he and I aren't romantically together, I just don't want to let him trample over me forever and that kinda feels like what's happening. So. Yeah. I kinda know that I suck for not being more forceful about this all.",
          "id": 23,
          "comments": [
            {
              "score": 36,
              "content": "You have a kind heart, and that is something to be admired. I'm sure he has good qualities that you find valuable, but the good doesn't outweigh the bad. Bad people aren't awful all the time. They always have just enough charm to get people attached so they can take advantage of them. There are other wonderful people in the world with the same good qualities that he has, that also won't treat you so badly. \n\nBe strong and stand up for yourself! Cut him out and find friends who will care for you the way you care for them. You can do it.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I don’t want to be harsh, but this is a sub about judging people, so... You are a doormat. Everyone has good qualities, including both him & the worst person you can think of. But let’s step back to get a bigger picture. Your bf cheated on you for months, still stays in your place at a discounted rate after breaking up, brings over the woman he cheated with & demands you be overly friendly & welcoming to her, and you feed him for free. What the hell are you thinking. Will you start washing their underwear next?\n\nAlso, he is a hot mess for jeopardizing this sweet deal he’s got going here.",
              "id": 25,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "People aren't characters from a movie. Transparently evil monsters for the \"good guys\" to fight against. People are always a mix of good and bad attributes. Even the shittiest, most selfish people can be fun, charming, etc. They aren't all bad, or awful all the time, and its admirable that you try so hard to see the best in people and not hold grudges when you would be well justified in doing so. But you have to have standards for how you're treated and theres nothing wrong with having boundaries and insisting on being treated with respect. That doesn't make you shitty or catty. He doesn't have to be the worst person alive to justify you extricating yourself from an unfair situation or demanding better in your own goddamn home.\n\nWhat if, as a thought experiment, you imagined a friend or sibling you care about coming to you with this problem. What would you tell them? If they were a kind and successful person but didn't know many people in town, or were somewhat intertwined with their ex, would you assure them that whatever their ex demanded was something they should tolerate? Or would you tell them that they could do better and should stand up for themself? \n\nWhat if you imagined being him. You're in a jam and your partner helps you out, gives you a place to live for cheap, even covers your food and hooks you up with a job. Somehow you're ok with someone paying for your food and giving you a sweetheart deal on your rent because they're your partner... but then you cheat on him with your ex. Not once. Repeatedly over time. You keep taking advantage of the situation because it benefits you while actively betraying and disrespecting the person helping you. You come home, lie to his face, know that you're doing the wrong thing, but dont bother to make a change because this situation is fucking sweet! You have cheap rent, free food, a live in bang maid! \n\nThen you're comfortable enough to go ahead and end the relationship, confident that the gravy train will keep flowing as long as you stay \"friends\". You're still living in his place, paying reduced rent and eating his food, because taking the mature step and leaving wouldn't be the cheapest, easiest, most convenient thing for you. And why not? It's not like this arrangement impacts you negatively at all. You still get all the benefits and just expect that your ex will keep swallowing his pride in the name of \"friendship\". Why shouldn't he pay for your food, clean up after you,  pretend this is normal? You bring your boyfriend around the house, you both take up the space, eat your exes food, parade the relationship you had *behind his back* in front of his face *in his own home* under the expectation that you're friends now, so why should he take issue. He tolerates its, tries to see the best in you and ignore the rest. But no.. he isn't actively happy to see the man you cheated on him with in his house (**not** your house, you are a tenant). He doesn't go out of his way to welcome and adore your new bf. He doesn't do **every single thing** possible to help you to ignore what a selfish, inconsiderate leech you're being. So instead of reconsidering how unreasonable of a situation this is and changing it to preserve a friendship that you claim matters to you, you use that \"friendship\" as a bargaining chip to force your ex into not just tolerating your new bfs presence but actively pandering to him and being the doormat he is to you to him too. It's not enough that you pay less rent, dont pay for food, have your ex being cordial to you while constantly reminded on your cheating, he cant have any lingering feelings at all. He cant do what's right for him in his own home unless it is exactly what you want every step of the way. \n\nCan you imagine yourself doing any of those things? Can you imagine being that entitled, selfish, and demanding? Doing whatever you wanted, whenever you wanted, taking everything you can get and giving little to nothing back? Disregarding your \"friend\"'s feelings or needs because it's not the most convenient thing for you? Using his desire to maintain a relationship with you against him to deny him his own feelings  and your own shittiness? Of course you cant. Because you're a good person and a good friend. Maybe with some distance, he could be a decent friend but that's not what he is right now and you deserve not just more rent, but a better roommate. You can do this, OP, you get to set boundaries on how you're treated. instead of tying yourself up in knots trying to let him off the hook and blaming yourself, put your foot down and move forward. You can do better and you will once you put a stop to this.",
              "id": 26,
              "comments": [
                {
                  "score": 3,
                  "content": "Thank you for writing it out so clearly. There's so many different emotions wrapped up in the whole mess that it's hard to dissect it so cleanly. I'm going to be making some changes for certain.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Good luck! Internet strangers believe in you!",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 52,
      "content": "ESH: he is a total douche bag for all the reasons you mentioned above. He cheated, he brings her over, then DEMANDS you be her friend?  Serious asshole.  You suck, not because you want to raise his rent, but because you are questioning whether you should or not. .  He is taking advantage of you, letting you pay for his food, and giving him a good deal on rent.  You should have kicked him out the moment you broke up.   It does not make you a bad person to not want to be around the guy who cheated on you. You care way more about his feelings than he does yours because This guy cares ZERO about you.",
      "id": 29,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 29,
      "content": "NTA. You sound reasonable but anything you do like this is going to come across as spiteful. \nHonestly,  I would give him the 30 days to find a new living situation. He caused his own problems,  now he's forcing you to \"make nice\".",
      "id": 30,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 26,
      "content": "NTA. Christ. You'd still be NTA if you kicked him out and threw all his shit into the street. No idea why you're even willing to be friends with someone who you dated, who cheated on you, brings the girl he cheated on you with to YOUR house, and then gets pissy that you aren't chummy with her. No idea why you don't even seem a little angry about anything that came BEFORE the last part and can't even begin to understand why you're still willing to live with him.\n\nThis guy needs an attitude adjustment, and you need a life that doesn't include this stain of a person. Absolutely NTA to raise his rent to a normal level, absolutely NTA if you kick him out and cut him out. If you can't afford to lose his rent then look for other roommates and after you have someone lined up, then kick him out.",
      "id": 31,
      "comments": [
        {
          "score": -2,
          "content": "It's been two months since he broke up with me, and told me about the cheating the following week. I've had time to move on past that. I just can't wrap my head around how he thinks its okay to ask me to be friendly to her when I'm trying to let us separate and go our own ways in as least a fucked up way as possible. \n\nI dont think she has any intentions to actually get together with him, they're nonexclusive because she still wants to fool around elsewhere, so I think if I go to kick him out he'll actually end up homeless. So I dont really want to kick him out, just stop paying more than my share",
          "id": 32,
          "comments": [
            {
              "score": 22,
              "content": "You can’t wrap you’re head around it because it’s not ok, he’s a manipulative ass. You’re not actually trying to separate him from your life tho, if you want to go a separate way from him then kick him out, you’ll be better off even if it might be tough at first.  It doesn’t matter if she’s not exclusive with him and what happens when you finally get rid of him because he’s Not Your Problem he’s just using you and he’s going to until you have nothing left of value for him. \n\nESH \nHe’s shit obviously because he’s a manipulative using asshole who doesn’t expect consequences for his behavior \n\nThe ex/new girlfriend is shit because it sounds like she knew that he was in a relationship when they were hooking up, also because she expects you to be nice when she isn’t\n\nYou’re an asshole for how you treat yourself, “don’t set yourself on fire to keep others warm” you say you’re still friends with him because you’re into the same things, unless you two are the most unique and different people on the planet there’s probably a million people around the world and a couple close to you wherever you are that are into the hobbies too. Stop making excuses and start making steps for living your life for you not some asshat.",
              "id": 33,
              "comments": [
                {
                  "score": 1,
                  "content": "I just don't know how to go about setting steps in motion that I know will ruin someone's life. If he doesn't live with me he'll either be homeless or lose his job or both. \n\nI've been trying to find boundaries that don't end with him on the streets without me getting completely screwed over but I really think this is kinda the line.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 20,
                      "content": "That's not your problem! He can couch surf, stay in a hostel, rent a cheaper room in a bigger house, parasitically attach himself to his new girlfriend the way he did to you...he has options.",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "You’re not the one ruining his life, he is, he’s the one who needs to live with the consequences of his actions and he’s not because you’re choosing to ruin yours. If you’re honest when was the last time you were truly happy? Because it sounds like from this and your other replied it’s been a long time. You deserve to be happy, you deserve to put yourself first, healthy boundaries mean that you’re comfortable living your life, and i know it’s hard and a lot easier to just type out than actually do but i don’t think you’ll ever feel completely content. Have you thought about maybe going to therapy?",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "> I know will ruin someone's life. If he doesn't live with me he'll either be homeless or lose his job or both.\n\nYou are NOT the one doing that! You are not responsible for HIS actions! \n\nHe made a choice, the choice he made didn't factor your happiness in it all. He doesn't care. He's selfish and using you. You're worth more than that OP. You need a clean slate. E V I C T him. Move on, get a new roommate if you need the money. This guy needs to be out of your life.\n\nStop being so fucking nice, take care of YOURSELF for ONCE",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Now you're being dramatic. He is an employed, partnered up adult. If he ends up homeless or losing his job because you stop enabling him it will be his fault, not yours. Assuming that only you can save him is kind of arrogant, don't you think?",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": ">I just don't know how to go about setting steps in motion that I know will ruin someone's life. If he doesn't live with me he'll either be homeless or lose his job or both.  \n>  \n>I've been trying to find boundaries that don't end with him on the streets without me getting completely screwed over but I really think this is kinda the line.\n\nI ended up staying in a relationship for *years* after it had actually ended, because I didn't want to ruin my ex's life. I'm talking 7.5 years when, in retrospect, it was really over by year 3. My ex was constantly either un- or under-employed, and I was paying the lion's share of all the bills. I didn't realize how miserable I had been until I finally broke things off and moved to another state.\n\nPlease give yourself permission to stop worrying about him. He's an adult, and can address his own problems.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "honestly, I get it. you seem like a very nice and compassionate person, someone who genuinely tries to help people in need. you're very forgiving and hate to see even a complete asshole suffer even if it's completely their fault. 99% of the time, those are incredible traits to have and make you an amazing person.\n\nthis is the 1%, though. \n\nreally think about this guy. completely analyze everything you remember about every time you've done friend stuff with him. does he ever initiate doing stuff together? does he ever seem genuinely happy to hang out with you? can you honestly say that he values you as a friend nearly as much as you value him? you're handling most of the financial burden, but are you also the one carrying your friendship?\n\nyou need to ask yourself if this guy is really your friend, because it doesn't sound like he is. the relationship you've been describing sounds to me like it's closer to an abusive relationship that you're scared to leave than a true friendship that you want to keep. it sounds like he's just using you for cheap rent. really ask yourself if that's the truth.\n\nsomeone who's using you and pretending to be your friend does not deserve to benefit from you. raising his rent to 50% is at the *least* what you should do.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Some people need to grow up and face the consequences. He is abusing your kindness 100%. And he will continue to do so for a LONG time if you let him. He needs to learn and grow up",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 21,
      "content": "NTA. Your ex is asking way too much of you. If he was a real friend, he would not be putting you in this situation. You should give him a month to move out.  It is extremely reasonable to ask him to leave. In my mind, you're not violating the promise you made that he could still be a roommate if things did not work out with you romantically. His violation of trust puts things in a different light.\n\nIf you had broken up, it would feel spiteful to raise his rent, etc. Given his actions, he needs to move out, and you deserve to treat yourself better.",
      "id": 42,
      "comments": [
        {
          "score": 6,
          "content": "I second this",
          "id": 43,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 16,
      "content": "[deleted]",
      "id": 44,
      "comments": [
        {
          "score": 2,
          "content": "I have no idea if its relevant or not, because I really dont know what's going on in his head but today was the first time I had someone come over. I'd given him a heads up it might happen, cause he's let me know when she was going to come over, and he was with his new girl the entire time I had company, and never remotely interacted with my guest. But I am actually moving on still and am really not interested in getting back with him, and at least one person has been understanding of my situation.",
          "id": 45,
          "comments": [
            {
              "score": 5,
              "content": "[deleted]",
              "id": 46,
              "comments": [
                {
                  "score": 2,
                  "content": "I'm not going to concede to his demands here. I know I'm being too soft but I'm not quite that stupid. Just dumb enough I guess. He was in his room with her when my guest came over today and we went to my room to watch TV rather than being in the living room to potentially have an awkward run in. Exbf and his chick were out when my guest left. They didn't cross paths at all",
                  "id": 47,
                  "comments": [
                    {
                      "score": 4,
                      "content": "[deleted]",
                      "id": 48,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "NTA, although you ARE TA for putting up with this garbage. You’re only obligated to give him that price if you had a contract, which it sounds like you didn’t. I suggest you do what is in the best interest of your finances. It doesn’t sound like he gives much of a shit about your feelings; in fact, it sounds like he’s straight taking advantage of you. He’s just a regular renter at this point so charge him as such, make him sign a rental agreement, and if he can’t pay, he needs to move out (and his stanky ho too)!\n\nAnd for crying out loud, stop buying his damn groceries! Let his new (old) woman take care of his ass!",
      "id": 49,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "Tough one. I’m leaning towards NTA because although at first this sounds like a very petty way to get back at your ex, I think there’s some valid points in your reasoning: you offered him a good living deal (you’re even paying for some of his food!) as a friend. If he ends the friendship it makes sense to change the living cost arrangements. \n\nI also think you’ve handled the whole breakup/cheating/new relationship thing very well and I agree you have no reason to fake friendliness towards anyone you don’t feel like being friendly. \n\nFinally, your ex bf sounds incredibly entitled by demanding you to be friendly with the woman he admitted to have cheated on you with, when he brings her into your home... where he lives a comfy life thanks to you. \n\nI think he got used to all the help and comfort you provide in this arrangement and became entitled. \n\nPerhaps a nice reality check at the fact he can’t afford his current housing on his own is needed. And in any case I think him moving out will be for the best.",
      "id": 50,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "YTA for not kicking him out when you broke up and getting yourself into this childish mess in the first place.",
      "id": 51,
      "comments": [
        {
          "score": 2,
          "content": "That's fair. We had it set up this way because he moved in very very early on in dating. I needed a roommate, he needed a place to rent. We had separate rooms so that if early on this happened where we just had an incompatibility it wouldn't put either of us in a bad situation.",
          "id": 52,
          "comments": [
            {
              "score": 7,
              "content": "So bad choices from day one, gotcha. You'd honestly be better off just putting an ad on Craigslist for a new roomie and rolling the dice with that then to stick with this trash situation you're stuck in now and that's really saying something.",
              "id": 53,
              "comments": [
                {
                  "score": 0,
                  "content": "I've lived totally peacefully with an ex in the past, where we stayed friends until we just kinda naturally drifted apart. I guess I thought that could happen again.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 5,
                      "content": "That is the exception, not the rule. It's great that happened with your previous ex, but it's obviously not happening with this one.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}