{
  "post content": "Throwaway account and please don’t repost anywhere else. \n\nI (24f) was with my ex fiancé N (27) since I was 13 and he was 15. He was my first love, my first everything. We got engaged when I was 20 and about 6 months after we found out we were expecting. Unfortunately I miscarried a couple days later. That was the worst moment of our lives. \n\nWe always dreamed about starting a family early so this was a major blow to us individually and to our relationship. I fell into deep depression and I admit I was wrong for only caring for the lost i felt and not my partner’s. We argued a lot, he partially blamed me and I accused him of not knowing how it felt to lose a life you were growing inside you. \n\nWe were hurting each other and decided to separate for a while, that while turned into a year. We still kept in contact, I went to therapy and worked on healing myself, he even came to a few sessions with me. \n\nWe decided to get back together shortly after my 23rd birthday. However the relationship wasn’t the same. He was somewhat withdrawn from me and I thought it was because he still blamed me. I was sick overthinking and worrying. It got to the point where i was going backwards in my process so i decided to snoop through his phone. I found out during the year we separated he had been confiding in my sister (27) and it turned to something intimate. He cut it off when we got back together but the damage was done. She was pregnant. \n\nTurns out my parents knew about this and some of our friends. I kicked him out and cut off everybody who knew. Well a couple weeks ago I got an invite to the wedding. Something snapped inside of me, I got drunk and I took a cab to my parents house where they were throwing a party for them. Most of my family was there, I basically showed up and gave a whole fuck you speech to everybody. My sister ran upstairs in tears and my parents called me an a hole for ruining the prospect of their wedding. I said good because nobody apologized to me, everybody just kept saying we were separated, things happen people fall in love, i should be happy for them, the heart wants what i wants. The worst part is my sister told me maybe my baby died for a reason so she could get her happy ending. \n\nI’m regretting getting drunk now because i’m not a confrontation person but i was so upset. Aita ?\n\nHi everybody, thanks for all the support and encouraging words so far. I know this update is coming so soon but i’ll like to tell you guys a joke. My sister called from an unknown number a couple minutes after i posted this lol (I’ve blocked everyone). She asked well more demanded that I return the ring fiancé bought since it would be disrespectful to keep anything for him knowing they’re starting a family. She said how immature of me for basically not sucking it up and being happy for her. She even intended to make me her MoH. I apologized to her for ruining her party and told her I’d mail the ring but as for me and her, we’re done and to tell my parents the same. I’m here balling my eyes out waiting on my therapist to finish with another patient so i don’t turn to a bottle again and go off again.",
  "id": 1,
  "comments": [
    {
      "score": 28506,
      "content": "I started dating my ex when I was 15 and we broke up when I was 23. If he ended up dating my sister, knocking her up, and then marrying her, I would lose my shit. \n\nWhile barging into a party, screaming at them wasn't exactly the most healthiest decision you can make, personally, I say fuck them. They clearly don't care about you, and if you got some relief from doing what you did, I say congratulations.\n\nNTA",
      "id": 2,
      "comments": [
        {
          "score": 11108,
          "content": "I did get some relief in the moment but now I’m just so drained",
          "id": 3,
          "comments": [
            {
              "score": 24732,
              "content": "Also DO NOT send that ring back. Sell it and use the money to help pay for your therapy. Is it the least they can do!!",
              "id": 4,
              "comments": [
                {
                  "score": 5927,
                  "content": "I planned to post the same thing. Therapy or some other form of self care and healing work.  I'm so sorry. Not just for the betrayal and miscarriage but for the gaslighting as well.  You don't deserve this.  NTA.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 7048,
                      "content": "Holy cow. What your sister said about why your baby died is the most insensitive selfish delusional narcissistic shit I have heard in a while. Burn the ship and do not look back. I guess she must have always been insanely jealous of your relationship with him to actually marry your sloppy seconds. I feel for you OP and I’m sorry you have such a craptastic family. Here is wishing you such a happy future and a new love and beautiful family. I will also pick a few awards for you because damn you deserve them.  Sell the freaking ring and take a vacation. I wouldn’t waste a dime on therapy over any of that or any one of them. Celebrate the universe for revealing the people they truly were and you have a doozy of a story to tell.\n\nEdit:  thank you all for the awards. I am glad so many agree that OP deserves the best future and to leave this mess and these crazy people in the dust!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Yeah. If sister takes OP's man and marries him with the ring that he bought for OP,  that's just too much.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1690,
                  "content": "OMG this. I can’t believe you’d send it back. I would smash it into unrecognizability and send the photos of that before I’d send the ring. \n\nYou over them nothing. \n\nThe effing nerve of your sister.",
                  "id": 8,
                  "comments": [
                    {
                      "score": 1642,
                      "content": "Id sell it like her sister plans to. That’s why there’s an urgency. They want the cash.",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 199,
                      "content": "Great idea! I would say \"I wanted it to fit in the envelope\" NTA",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 126,
                      "content": "Tell them it now lives in your toilet tank, lol.\n\nMaybe don’t actually put it there, for various reasons.  Just mess with them.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "\"yeah since you can't keep a baby I decided to give him one. Oh and marry him too\". Whatttttttt. Theeeee. FRICK.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 492,
                  "content": "It's an engagement ring. If in the US, legally it's not theirs to keep if the engagement is off\n\nEDIT: I should have elaborated and did not expect so many replies haha. My thought when I initially commented was that people should verify its ok in their state to sell the ring because it isn't always considered a gift. In some places it's a contract and may need to be returned depending on who broke it off. In this case, OP most likely would be allowed to keep it.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 453,
                      "content": "It depends on the state. I know in my state of her ex-fiancé was the one to call it off, OP would get to keep the ring because the ex was the one who broke the ‘contract.’ I’m not sure what would happen in what seems like a mutual breakup, but she should look it up if she’s worried.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 82,
                      "content": "You might want to look up Legal Eagle on Youtube. He did a segment on that",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "I mean if you give it back your sending the bad juju to them silver linings and all that",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "Not necessarily true, I'm a paralegal, if the ring is a heirloom or an inheritance, then she has to return it... otherwise is a gift, she gets to keep it. Also, if the engagement is off by mutual agreement, and/or the receiving fiance cheated, then the ring must be returned.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "It also depends on why the engagement is broken. In my state at least if it is broken due to infidelity IE this case, it would be hers to keep. They might not be sleeping together when he got back with her, but he left her for another woman. HE broke the promise the ring represented.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "No.  It’s a ring. Engagement or not is irrelevant. It’s a ring that was given to her and is therefore a gift. It’s hers.\nIf I were she, I would sell it and put the money toward a vacation after the pandemic is really over.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 257,
                  "content": "Keep the ring!",
                  "id": 20,
                  "comments": [
                    {
                      "score": 383,
                      "content": "Sell it and do something fun with the money.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 216,
                  "content": "YES! When he gave you that ring, it was a gift. It's legally yours, and you should absolutely sell that ring and keep the money.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 58,
                      "content": "I was gonna say this too. It’s a gift, it legally belongs to OP. Sell it and go on vacation or something.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "No it's a conditional gift. Engagement rings and other such items are treated differently legally. If the wedding is called off the contract is nullified and the ring was considered part of that contract.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "This might not be legally correct, depending on her area. Some places in the US and elsewhere, an engagement ring is considered a conditional gift, and belongs to the one who originally gave it in the event that the engagement is broken, unless it was given on a special occasion such as anniversary, birthday or Christmas. Some places it also depends on who called off the engagement.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "It’s a conditional gift.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "No. Engagement ring is a conditional gift and belongs to the giver in a case of broken engagement. They can sue for the cost of the ring if op were to sell it.",
                      "id": 27,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "I remember a case on one of those television court shows that said the ring belongs to the person who bought it if the wedding is called off for any reason. The reason she gave was that it is a verbal contract that she keeps it in the event of a marriage. If that contract is broken, it goes back to the party that purchased it. It sucks in this case, but that always stuck with me.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 136,
                  "content": "Depends on the state/country OP is in. They might be legally required to return the engagement ring. It's considered a contract in some places and isn't really the recipients unless the wedding happens.\n\nI'd return the ring, but nothing else that he might have given her while they were dating. The rest of the items are legally gifts and don't have to be returned.\n\nOP, definitely look up and see how your area handles engagement rings and if you're legally required to give it back. If you're not required to give it back to him, prolly say fuck it and pawn it instead. Like, who goes around and has unprotected sex with your ex's sister if you have a possibility of getting back together with them? This would have been less heinous if it was anyone else",
                  "id": 29,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Eh, even if she is in a state/country where the ring legally belongs to the fiance, she shouldn't return it unless the fiance actually initiates legal proceedings, which is extremely unlikely.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Who has sex with their sisters boyfriend? OP will have to live with this in her face for the rest of her life and it looks like she'll have to do it without much support from her family.\n\nMy vote for biggest a-hole is OP's sister.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 66,
                  "content": "100% this! The ring is yours, you owe them nothing! By all means don’t hang on to it but use it to fund something for yourself.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "They clearly just want the ring back for money, they couldn’t give less fucks about how “disrespectful” it is to keep it. They just want to sell it. Beat them to the punch :)",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Careful, if you sell it and spend the money I think you can be sued.",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "^^^^ DO NOT send that ring back. Why does she even want it. You sell it and do something nice for yourself. She will sell it to use for wedding expenses. She doesn't deserve a single thing from you.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 326,
              "content": "Thats normal. You need sometime to grieve not only a long-term relationship, but a relationship that lasted most of your lifetime.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 296,
              "content": "[removed]",
              "id": 37,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 235,
              "content": "That's just the feeling of emptying out all the darkness they injected into your soul wih their utterly heartless betrayal.\n\nYou have to let it out, and eventually let it go. Nowhere else to go but up once you hit rock bottom babe.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 206,
              "content": "OP NTA and I agree with the other comment DO NOT send the ring back. If he wants to marry her he can buy her her own. Sell it, do whatever you want. \n\nShe doesn’t deserve it after what she did, especially saying your baby died so *she* could be happy? I would’ve had some choice words for her for that.",
              "id": 39,
              "comments": [
                {
                  "score": 17,
                  "content": "That comment shows to me that whenever they would've hit their first major crisis, she would've pounce on her sister's man, just better now, and not after marriage and kids. It was a matter of the first opportunity for OP's sister",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Nowhere does it say the ex-fiance wants the ring back…only the sis. Don’t know why she would have any legal claim to it especially when they’re not married yet. \n\nWe don’t even know if the wedding is really going ahead.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 153,
              "content": "That's the feeling from lancing an infected wound.\n\nTake good care of yourself, do things that invigorate you (something creative, something beneficial, something productive), and to hell with all those people.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 99,
              "content": "You said what you needed to say to them, and now you can be done with them.\n\nNow you can start working on what you need in order to heal. \n\nNTA",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 72,
              "content": "Please do not give the ring back if you can! You are a strong individual. You shared this online with strangers on Reddit who all can tell you, your \"family\" are huge As. You need to take care of yourself. Find a new unit of supportive folks, maybe animals, do things you love, do this for yourself! The ring can be sold to help guarantee your care.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 71,
              "content": "Please  get some rest and take care OP❤ and obvious NTA, their behavior was cruel",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 71,
              "content": "Im proud of you, they needed a major fuck you",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 295,
          "content": "I'm was ready to say ESH but I will go NTA for they were public with other people before talking to OP. I don't believe OP has veto power (there was a breakup and people can move on) on the relationship but more a curtesy. So 20% ESH 80% NTA",
          "id": 47,
          "comments": [
            {
              "score": 229,
              "content": "sister tho...... def has veto power",
              "id": 48,
              "comments": [
                {
                  "score": 425,
                  "content": "[removed]",
                  "id": 49,
                  "comments": [
                    {
                      "score": 286,
                      "content": "[removed]",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "[removed]",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "I’m wondering if your sister got knocked-up “accidentally on purpose,” too.",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 37,
              "content": "I think the fact that he was fucking sister while trying to court back OP and only ending it when he succeded is profoundly fucked up from the guy.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Uh…no. If they were broken up and he went off with some random person, that’s one thing and no one would have been doing anything wrong, but to mess around with the sister, that’s utter betrayal on both their parts. And the parents too for condoning it. At that point I’d be like these people are no longer my family.\n\nEdit: Definitely NTA and don’t give that ring back.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 169,
          "content": "NTA.  Agreed, I can't necessarily condone her behavior........but I understand, hell I *overstand*.  Your family sounds exhausting and uncaring, for normalizing what your sister and your ex did.  Your sister is insufferable and she had no right demanding the ring back.  \n\nI'm so sorry that this happened to you, but I am glad that you are in therapy.  You deserved better from all involved.  Good luck!",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Honestly, what else was OP supposed to do? No one talked to her like an adult, no one gave her support while she processed, and no one showed any caring for her feelings. This was handled really badly by her family. I understand the heart wants what it wants, be she deserved the respect and basic decency of being told what was going on.\n\nSometimes, there’s a place and a time to be an AH and this was it.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This shit is so foul... how could the parents be okay with this dude getting with both of their daughters? Wtf?",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "I’d say what happened here is even shittier though: what makes it so much worse to me (aside from everyone hiding it from OP) is the fact that he knocked sister up, then went back to OP, and THEN decided to marry sister. \n\nThat he got back together with OP after having gotten into a secret relationship just makes him an extra special asshole, and him then going back to sister suggests that the relationship with/feeling for sister were still there when he got back together with OP.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 13178,
      "content": "holy shit NTA. “my sister told me maybe my baby died for a reason so she could get her happy ending.” who the FUCK says that to anyone, let alone their sister?? you had a miscarriage which is heartbreaking enough and then your sister swoops in and steals your partner & has the audacity to say something like that? i’m angry FOR you right now. i am so sorry that you’ve had to go through this bs",
      "id": 59,
      "comments": [
        {
          "score": 7680,
          "content": "She was there for me during said miscarriage. I cried on her lap, she was the first person I called when the doctors informed me. That broke me so much, I don’t know how much therapy is going to fix me",
          "id": 60,
          "comments": [
            {
              "score": 4136,
              "content": "I've never suffered a miscarriage, so I cannot speak to that pain, but I have been in that place where I felt so broken by family betrayal that I didn't know how I could ever be whole again. I'm here to tell you that with time and therapy, it does get better. In my case, along the way I saw that my family had been dysfunctional-to-toxic all along, and I barely noticed. Whether or not that turns out to be true for you, you will be better off without people who don't support you. \n\nThis internet stranger is here to tell you that one day, you'll wake up and go the whole day without thinking about your family. It's a long process, and it's not remotely linear. You'll feel great, and then a memory will pop up on Facebook which ruins your whole day. But then, one day, a memory will pop up and you'll just... go on with your day. \n\nPrioritize yourself right now. Set the boundaries you need to, cut out the people you need to, and lean on those who have demonstrated they can be relied upon. Get therapy ASAP. If you don't click with your first therapist, get another. Sometimes one therapist can only help you so much, and it's time to move on. No shame there. \n\nWishing you all the best. This is a tough road, but you can walk it.",
              "id": 61,
              "comments": [
                {
                  "score": 476,
                  "content": "You can also block certain people or dates from FB memories, if you need to.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Oh my god how, their settings are such a maze, do I have to wait for a memory to pop up before I can block that date?",
                      "id": 63,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "It can be hard to block everyone remotely related and sometimes things sneak through",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I mean, just stop using Facebook, it's a horrific mess of politics and people's babies I don't care about.",
                      "id": 65,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 924,
              "content": "You just need to work through the emotions and get on a track to a better life.   I'm so so so sorry that  happened to you OP.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 840,
              "content": "Karma has a way of working things out. Your sister will never be truly happy with him, I bet. She'll be looking over her shoulder because she'll be afraid that he'll cheat on her like he did with you.\n\nETA: OP, just read your update. See it's starting already! For your *sister*, not the ex-fiance, to demand the ring back says a lot. She already does not have peace of mind. Oh and she wants you to be her MOH? Huh, she probably just wants to keep her beady little snake eye on you. Don't give that ring back! At least, not if your sister is the one demanding it. If you wind up having a conversation with the ex and he wants it back, that's a whole other thing. Your sister has no claim on that ring and she just keeps adding to her assholery.",
              "id": 67,
              "comments": [
                {
                  "score": 511,
                  "content": "Agree for different reasons. If anything ex fiancé cheated on the sis with OP. It’s gotta sting for the sis to know she was always 2nd place to her husband and that she was dropped like a hot potato once OP became available again.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 444,
                      "content": "And she always will be 2nd choice for her soon to be husband because she knows deep down that there's no way he would have agreed to marry her if he didn't get her pregnant. She will be looking over her shoulder for as long as their \"marriage\" lasts (probably won't last long) because she's knows of given the chance he'll be crawling back to OP. But I have no sympathy for her because she set herself up for it. She's his consolation prize and he's her 2nd place trophy who can't keep it zipped.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": " I'd go to the wedding to make that my MOH speech, but I'm am asshole and i think they deserve it. Burn it to the ground, in front of everyone. Enjoy your reception, screw you guys, I'm going home. Lose my number, we're not family.",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 383,
                  "content": "He already once dumped the sister to get back with OP, only to return when she was pregnant. So far not much of a stable relationship.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 219,
                      "content": "Not to mention he only went back to said preggo when OP kicked him out! Sis is never was/is going to be a first choice for him.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 261,
                  "content": "Not even cheat.  She'll always know that he *chose* OP over her, and only altered once circumstances made it all but necessary.  We get people posting on here all the time having trouble that their spouse is honoring a departed ex - imagine if that ex is still alive *and* is a sister who has zero loyalty to you.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 168,
                  "content": "yep, My mother used to always say \"how you get them is how you loose them\" when it came to cheating partners. He's going to get overwhelmed with family history and the baggage that comes with everything they just did and he'll end up cheating on her and leave her absolutely miserable and a single mother.  What. An. Idiot.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 19,
                      "content": "He may not have cheated. But surely OP's sister must know that she's clearly the second choice, and he only married her due to a pregnancy. She has to bear that knowledge for the rest of their relationship together.",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Part of me wonder if the sister got pregnant on purpose to trap the ex-fiancé. Since he only went back to the sister after OP kicked him out and found out she’s pregnant.",
                  "id": 76,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "If OP does decide to be MOH, she should wear the ring as a right hand ring.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Nah, fuck the ex, too. He can't have it back. He's a spineless worm of a man; couldn't even ask for the ring back himself. I agree with the others, sell it and spend it. Send  pics of a fabulous vacation in one big, grand, final FU to the whole family! And completely cut contact. Forever.   \n\n\nOP can choose a NEW family. Some of my best friends have been better family to me than blood ever was. This whole scenario would be UNFORGIVABLE to me.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 712,
              "content": "I'm just going to point out that if her \"happy ending\" is being her husband's second choice every time (he dated her when he was missing you, broke up with her to be with you, and would have stayed with you if you hadn't broken up with him again...) she leads a very, very sad life.",
              "id": 79,
              "comments": [
                {
                  "score": 631,
                  "content": "THIS. You could have him right now if you wanted him. Thank God you don't because you deserve so so so so so much better. Just know that he isn't happy. He looked to her for comfort because he was weak and couldn't process all of the grief and emotions from the miscarriage and the breakup in a healthy manner. Not because he loved her or because \"the heart wants what it wants\". If that was the case he wouldn't have come back to you.\n\nHe will feel trapped and resentful and their marriage won't last. She will ALWAYS know that he loves you no matter how much she tries to convince herself otherwise. She will also know how people view her. No matter how much they console her or say the right thing to her face, she KNOWS deep inside that what she did was disgusting and that she'd be judging harshly if it was someone else. She will always feel insecure and wonder if maybe he'll start confiding in you, or even someone else, when things get bad. He, while stuck with this woman who he didn't even want to continue a relationship with before being forced to because of the pregnancy, will have to watch you pick yourself up, which you WILL, and move on and find happiness and it will KILL him.\n\nI'm so sorry that all of these people betrayed on so many different levels in an attempt to create immediate and temporary peace and the illusion of perfection, that \"everything is fine, nothing to see here!\" and somehow act as though it is YOU who is irrational. Anyone with 5 brain cells can see the truth. Trust that. Everyone can see what is happening even if they don't say anything. Makes them shit for not having your back but just know, they do know that they'd react the same way you are and that what your sister and ex did is absolutely gross. Not to mention your family totally disregarding your feelings. Time will go on. You WILL feel better. You will come out stronger and in a much better place. They will just have to sit in the mess they created. Hang in there.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 49,
                      "content": "Damn. She should print this comment and send it back with the ring.(but don’t include the ring)",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I love this comment!!! OP please read this please!!!",
                      "id": 82,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "She’ll be facing the karma soon enough…and he’ll get his the minute he finds out you’ve got a new love of your own.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Yah… he’s stuck with the sister now because he knocked her up.  Also… If I were him I would be getting a DNA test on that baby. The sister doesn’t sound like she can be trusted, at all.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I hope sister reads these comments.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 603,
              "content": "We’re your family now",
              "id": 86,
              "comments": [
                {
                  "score": 125,
                  "content": "Was going to say this. OP, we are your family now; we're sorry your former family is a bunch of twats with zero class, but we're glad you've cut them off. Also, sell the ring and use the money to take a self-care vacation. Somewhere pretty where you can relax and be far, far away from all that toxicity.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I came here to say this, but adding a petty twist by texting your sister plenty of photos of the view.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Yup! Drink lots of water and don't forget that you're amazing!",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Agreed. I’ll be a new sibling for you, OP. I cut off toxic family a few years ago and never looked back. They treated me like shit after I miscarried then were so sweet to my “brother” when his girlfriend miscarried. I told them all to fuck off and have been so happy without all of them ever since!!\n\n*Edited for clarity",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 457,
              "content": "Then she got together with your boyfriend.? That even breaks the friend code let alone family code. \nNTA however your ex and sister are very much TA’s. I would not be able to forgive either of them.",
              "id": 91,
              "comments": [
                {
                  "score": 36,
                  "content": "The parents are also massive assholes for blaming OP for ruining the 'prospect' of their wedding. \n\nHearing the truth doesn't \"ruin\" anything. If it does, that relationship had no substance to begin with. \n\nOf course, that goes without saying when their entire relationship is \"I'm an asshole who fucked my sister's estranged partner, and now I'm preggo with an Affair Baby! Come celebrate the wedding of Asshole Sister and McCheater!\"",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 230,
              "content": "I highly doubt there relationship will last, everyone will be crawling back to you soon, do not let them. your family sucks, and you definitely dodge a huge bullet with your asshole of an ex fiance.",
              "id": 93,
              "comments": [
                {
                  "score": 6,
                  "content": "Exactly! OP would have dodged a storm of bullets by cutting off everyone (the sister, the family, the fiance). No one there seems to be in their right mind.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 171,
              "content": "You will get there, and you know why? You sound like an amazingly strong person. You shared the fault in your relationship breaking down (and honestly that's a tough thing on a relationship, and adding in you were so young at the time, it's all very understandable), and you worked on improving yourself and your mental health. Sure having the big dramatic yelling moment wasn't maybe the best in the long term but frankly I applaud you. \n\nSo keep them at arms' length while you heal, surround yourself with people who will love and respect you, find yourself a partner who deserves you, if that's what you want, and live a fabulous life. You deserve it.",
              "id": 95,
              "comments": [
                {
                  "score": 109,
                  "content": "Exactly. I know it doesn't feel this way now but, once the clouds have lifted, I promise you will look back on this mess and think, \"Thank god I'm out of that\".\n\nAlso, your sister didn't get her \"happy ending\". She got to be second prize for a guy who accidentally knocked her up. That's not a happy ending and I'd be shocked if they last.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 142,
              "content": "OP, idk if you'll ever see this, but I want to share something my therapist shared with me.\nTherapy won't fix you, it isn't designed to. Therapy is designed to help you live as the best version of the person you are now. You'll never be the person you were before, and that's okay.  You're becoming a stronger, better person and I am so proud of you.",
              "id": 97,
              "comments": [
                {
                  "score": 8,
                  "content": "This, this, this. It's like a caterpillar becoming a butterfly. Not that there's anything wrong with being a caterpillar, but once you've moved past that stage, there's no need to go back. Stay open to what's coming.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 133,
              "content": "Go to r/momforaminute for a new, supportive family and walk away from all of your family of origin. Your bio sister is trash and it's heart breaking that your bio  donors are supporting her in all this",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 168,
          "content": "I... Just... Can't.. How fucking evil 😭",
          "id": 100,
          "comments": [
            {
              "score": 5,
              "content": "Evil is an insult to the devil himself. This is some adjective so horrible it doesn't even exist yet",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 98,
          "content": "I literally gasped out loud when I read that part. That is evil! I can't even begin to describe how evil that is, from the thinking it to the saying it.\n\nOP, NTA. Your family doesn't deserve you. Ffs.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Very this",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Also, the kind of guy who is so morally bankrupt he knocks up his gf’s sister after his gf has a miscarriage is not going to be anyone’s happy ending. The sister is probably about 5 years at most out from an ugly divorce.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Every time I'm reading something like \"my aister and ex are dating/getting married\", I'm like WTF! But the addition \"and my parents/family say suck it up and be happy for them, love is love, it's just how it is\" I'm like WTFfff!!! My family would disown me or my sister if we were dating the ex of the other one... And everybody would be on the side of the one that got betrayed by her sister and ex! (At least I'm hoping that...because after all the storys I've been reading so far, I'm not so sure anymore.... Seems like it's happening way more often then I thought...)",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8855,
      "content": "**NTA. Your own f\\*cking sister said maybe your baby died so she could get her happy ending? Oh hell no. I would intentionally wreck their wedding for that sh\\*t alone.**",
      "id": 106,
      "comments": [
        {
          "score": 2495,
          "content": "Man it’d be on sight if my sister ever said that to me",
          "id": 107,
          "comments": [
            {
              "score": 1415,
              "content": "On 👏fucking 👏sight",
              "id": 108,
              "comments": [
                {
                  "score": 461,
                  "content": "LOUDER FOR THE PEOPLE IN THE BACK",
                  "id": 109,
                  "comments": [
                    {
                      "score": 689,
                      "content": "#**ON 👏 FUCKING 👏 SIGHT 👏**",
                      "id": 110,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 103,
                  "content": "What does this meeaannnnmmm! Help me, I’m old! Lol",
                  "id": 111,
                  "comments": [
                    {
                      "score": 255,
                      "content": "The second I see your ass, I'm fucking you up. Be ready or don't, it's happening the second I see you regardless.",
                      "id": 112,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 38,
                      "content": "Giving an ass whoopin' as soon as laying eyes on the person who wronged you.",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "Like the phrase “shoot on sight”",
                      "id": 114,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "Same here. She pulls that shit and she can expect to get her ass whooped any time she shows her face infront of me.",
              "id": 115,
              "comments": [
                {
                  "score": 26,
                  "content": "I know my sister and if this had happened to her, her sister would need armed security around the venue of the wedding, and even then you better have an emergency escape plan in place. The fact OP just came in drunk and screamed at people is like, the least of the concerns that family would be having right now. People would be bleeding and that house would be burned to the ground. \n\nAnd I really don't think I'm exaggerating *that* much. Maybe she wouldn't start a fire, but only because she would have been bodied out of the house before she could. And that would have been a blood feud that lasted for generations. In 1992 Pizza Hut delivered a pizza past her dads picket line during a strike. They STILL don't eat Pizza Hut to this day. \n\nThey carry grudges to the grave on that side.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 16,
              "content": "\"Maybe god told you to say that so I can open this here can of whoopass on your candy-ass.\"",
              "id": 117,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Agreed, she would catch these hands for sure",
              "id": 118,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "[deleted]",
              "id": 119,
              "comments": [
                {
                  "score": 12,
                  "content": "The moment I see you, ready or not, I'm fucking you up.",
                  "id": 120,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "It means I’m beating your ass lol",
                  "id": 121,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1074,
          "content": "I have to be honest. I would probably show up in a wedding gown.",
          "id": 122,
          "comments": [
            {
              "score": 840,
              "content": "Imagine if a whole bunch of us showed up in wedding gowns.....",
              "id": 123,
              "comments": [
                {
                  "score": 622,
                  "content": "I mean, I'm not busy....",
                  "id": 124,
                  "comments": [
                    {
                      "score": 322,
                      "content": "I wanna come with!",
                      "id": 125,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "And I really like bridal fashion.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I have several white formal dresses that folks can borrow, I mean, save for the one that I would be wearing.",
                      "id": 127,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "I love this idea, I'll bring my screaming toddlers. Everyone likes that at a wedding right?",
                      "id": 128,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 248,
                  "content": "Show up in wedding gowns and claim OP’s ex knocked us up too\n\nEdit: wrote on instead of in",
                  "id": 129,
                  "comments": [
                    {
                      "score": 34,
                      "content": "Have an \"I'm Spartacus\" moment and everything",
                      "id": 130,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "Never have I laughed louder at a comment",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 240,
                  "content": "I don’t have a wedding dress, but I DO have a brand new box of red wine 🍷 and I’m clumsy as shit.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 14,
                      "content": "How could you ever drink in front of a pregnant woman? She might feel tempted to drink, too, leading to her harming or losing the child. We certainly wouldn't want such a bad thing to happen to her! /s",
                      "id": 133,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "🤣I love this!",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 167,
                  "content": "Yo OP when and where is the wedding",
                  "id": 135,
                  "comments": [
                    {
                      "score": 56,
                      "content": "op: well i no longer have a family. \n\nreddit: look at us. we are your family now. also, where do these people live? we just wanna talk 😌",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 141,
                  "content": "I will probably never get married, I’d like to wear a wedding gown at least once. Tell me where and when and I’ll be there",
                  "id": 137,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Seriously. I've waited 38 years to get married, if it ever actually happens it'll be in normal clothes in a courthouse. This is the excuse I need to buy a wedding gown! I'm in! Fuck OP's sister and ex!",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 91,
                  "content": "Count me in, I would totally show up lmao 🤣",
                  "id": 139,
                  "comments": [
                    {
                      "score": 5,
                      "content": "I’m in! 🙋🏼‍♀️",
                      "id": 140,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 62,
                  "content": "Have my wedding dress and a *very* flexible schedule!",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 30,
                  "content": "I am vaccinated, petty, and in dire need of some travel. I'm here for it.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I would buy a gown just for this.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "I’ve still got my wedding dress, I’m there!",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 221,
              "content": "Nah, you gotta find out where they’re getting married and all the vendors and cancel every order, repeatedly. Eventually they’ll run out of food locations, good caterers, good bakers, etc. if you can, bribe the bridal salon and ruin the dress too.",
              "id": 145,
              "comments": [
                {
                  "score": 266,
                  "content": "Don't cancel on them - that could venture into \"assuming a false identity\" legal territory. Calling every single vendor in a 2 hour radius and giving your  sister and ex's names and spilling the whole story to all of those vendors so they won't want to work with them, or they'll charge an exorbitant asshole tax? Totally in the legal clear",
                  "id": 146,
                  "comments": [
                    {
                      "score": 44,
                      "content": "Oh that is diabolical. I love it.",
                      "id": 147,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "You I like.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Couldn't that be considered defamation of character or harassment or something?",
                      "id": 149,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 261,
                  "content": "nah tell us where the wedding is and we’ll all show up in white.",
                  "id": 150,
                  "comments": [
                    {
                      "score": 169,
                      "content": "Perfect, an excuse to wear my wedding dress again. I'm there.",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Or in all in black. To show our condolences.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "My wedding dress wasn't white, but hopefully I could still be included in the mission.",
                      "id": 153,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Weirdest domestic disturbance call of those officers lives",
                      "id": 154,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 76,
              "content": "Especially since this isn't ex-boyfriend, ex-fiance. If they got so far where she had bought a wedding dress, I hope she does wear it lol",
              "id": 155,
              "comments": [
                {
                  "score": 9,
                  "content": "me too!!!",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "For 10000% petty AF credit, also bring flyers that say \"This wedding was brought to you by my miscarriage\" with the sister's direct quote.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 306,
          "content": "Honestly? If my sister were to say this to me, you'd probably have to visit me in jail because I'll be charged for a \"crime of passion\". Anything that would have been close to me (chair, knife, table, plait, cup, bowling ball, whatever) I'd use it to throw at sister because I would be seeing red at that moment 🤯😬",
          "id": 158,
          "comments": [
            {
              "score": 10,
              "content": "No jury would convict after hearing this story. Holy hell...",
              "id": 159,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 144,
          "content": "That was so horrible...but I will say that not only is Karma a bitch, she's a petty bitch with patience, a long memory, and a twisted sense of humor. Sister will get hers eventually, and it will be EPIC.",
          "id": 160,
          "comments": [
            {
              "score": 37,
              "content": "Karma doesn't always pay her bills on time but she always pays them eventually.",
              "id": 161,
              "comments": [
                {
                  "score": 11,
                  "content": "And sometimes, she pays back with interest. When I was a freshman, I was bullied/sexually harassed by a fellow student for months, got so bad my mother had to go to the dean to get my class schedule changed because it was affecting my grades. The next 3 1/2 years I spent hiding from this guy because I was so afraid. Flash forward 10 years, I see him at the gym and what do you know, dude is bald as a honeydew melon. Thank you, Karma.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Make a TON of popcorn so we can sit back and watch!!!",
              "id": 163,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "I was like maybe she's a little bit the asshole until I read that. Fuuuuuuuuuck that.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "As far as I know a marriage ceremonie can't continue when someone objects. \n\nOP maybe you should accept the invitation after all...",
          "id": 165,
          "comments": [
            {
              "score": 32,
              "content": "As funny as this would be the ceremony will continue even if someone interrupts and that part is usually left out nowadays anyway, especially in this type of situation.",
              "id": 166,
              "comments": [
                {
                  "score": 12,
                  "content": "Oh well the thought of it was nice",
                  "id": 167,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "They still ask if there are objections here in the U.K.",
                  "id": 168,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "YES, YES, YES!! Show up and object OP! Object because \"on a break\" or not, you don't go cozying up to your sister's ex!! You don't say cruel things about your sister's miscarriage.",
              "id": 169,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Shit I’d go up there as MOH and drop that right in the speech “I’m so happy for my sister. In her own words ‘my baby (with the groom) died so she could get her happy ending’ and here we are”CHEERS”",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Totally! They deserved the fuck you speech and more, I am SO angry for OP. I can't believe the audacity of some people.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5725,
      "content": "NTA\n\n>my sister told me maybe my baby died for a reason so she could get her happy ending.\n\n\nthe second your sister said this, it physically became impossible for you to be an asshole. you could have shown up drunk to the actual wedding and not been an asshole. the nerve of your sister is absolutely astounding",
      "id": 172,
      "comments": [
        {
          "score": 1063,
          "content": "Right?? I'm angry OP felt the need to apologize. I would give back the ring knowing that these two losers deserved each other and I dodged a couple of bullets",
          "id": 173,
          "comments": [
            {
              "score": 886,
              "content": "I’d wear the ring to the wedding. Or sell it. Or throw it in a lake. Anything other than giving it back to those absolute fucknuts",
              "id": 174,
              "comments": [
                {
                  "score": 212,
                  "content": "I like that better. Certainly wouldn't go to their wedding though!",
                  "id": 175,
                  "comments": [
                    {
                      "score": 134,
                      "content": "True but it’s fun to imagine OP walking in and waving around the ring her sister wants back.",
                      "id": 176,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Oh I would totally go to the wedding and when it was time for toasts and everything and I stand up to give mine I would let everybody know what happened and how their love story truly happened. I mean there nothing wrong in their eyes they have nothing to be ashamed of so why not let the whole world know what they did. Maybe a nice gift of a wedding announcement in the paper sharing their love story might be a nice gesture. Screw them.",
                      "id": 177,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Have it engraved with \"OP's name + ex-fiance's name love forever\" then mail it to OP's sister.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I think she should trade in the ring for something fabulous! Most jewelrs will do that for you.",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 115,
          "content": "[removed]",
          "id": 180,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "The second the sister said that Karma made a date with her",
          "id": 181,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "She would have not been an asshole even if she had punched her in the face.\n\nNTA",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Her sister basically gave her all the ammunition for the rest of their life.  Their relationship is screwed for life. I cannot see a way its saved.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3139,
      "content": "NTA i hope this is real because you’re my hero",
      "id": 184,
      "comments": [
        {
          "score": 2100,
          "content": "Haha I’ve never been called a hero before",
          "id": 185,
          "comments": [
            {
              "score": 2698,
              "content": "You are a hero. \n\nYou refused to be made a sacrifice to your family's disfunctions. One of the daughters stabbed a dagger in the back of the other and it was easier to pretend your wound doesnt exist that to accept they raised a monster. Heck, they turned a blind eye to your sister saying your baby had died to give her a happy ending!!!!!!  And they want you to believe you're the one with the problem? \n\nI will quote the narcisist's prayer so you understand how strong you are, because you didnt let them drag you into their game:\n\n**That didn't happen.**\n\n**And if it did, it wasn't that bad.**\n\n**And if it was, that's not a big deal.**\n\n**And if it is, that's not my fault.**\n\n**And if it was, I didn't mean it.**\n\n**And if I did, you deserved it.**",
              "id": 186,
              "comments": [
                {
                  "score": 435,
                  "content": "What an eye-opening thing to read. I feel like a lot of questions about the last few years of my own life have been answered through this.",
                  "id": 187,
                  "comments": [
                    {
                      "score": 32,
                      "content": "This was also very helpful to me. Sorry you've gone through something similar in that way.",
                      "id": 188,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 152,
                  "content": "You should post this publically on every wedding photo they put up",
                  "id": 189,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Watermark on every photo",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "The fact that the entire family knew and hid this from OP proves that they knew it was wrong. Why hide it if it wasn't? \n\nEverybody in this post is terrible excluding OP. Cut contact, sell the ring, and use the money for an awesome vacation. OP, if you see this, you got this. Cut free the dead weight and live your life happily.",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "That narcisist's prayer needs to be tatooed to my sister's forehead!",
                  "id": 192,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Damn, that prayer sounds like my ex husband! Literally just had this conversation from him today when I tried to tell him the reason his 16 year old son is refusing to go see him.",
                  "id": 193,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "You're my hero because you are taking care of you, scheduling with a therapist and trying to avoid the bottle. You're making good choices. Take care of yourself.",
              "id": 194,
              "comments": [
                {
                  "score": 5,
                  "content": "Yes, I'm glad this was said. You're doing great, OP, you already admitted it wasn't the best way to handle things and are getting on with therapy to help you handle it a little more constructively. \n\nI must admit, there was a part of me evil giggling at you crashing the party. I can't blame you for being furious, especially with some of the shit your sister said.\n\nStay strong, shine that spine and be proud of yourself for being as strong as you are. You got this!",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 108,
              "content": "You are absolutely a hero",
              "id": 196,
              "comments": [
                {
                  "score": 33,
                  "content": "Absolutely agree. Hero for not giving them a pass. Draw your lines and dig in. Don't waiver - you are right. They are Assholes.",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 78,
              "content": "And keep that ring, girl. Sell it and move far away.",
              "id": 198,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "Good lord NTA and if it took liquid courage to tell these people they are AH and take up for yourself then good on you. Why should you turn a blind eye to this bullshit.\n\nYou sister is a major AH for her comment to you, but you dodged a bullet, if your ex is ok with doing this to you he is NOT a good person.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2087,
      "content": "ESH - We have seen this a lot on this sub recently, but dating/marrying your siblings Ex is weird AF and remarkably insensitive. Your sister, ex, and parents are big AH for doing and being okay with this. And your sister is a MEGA asshole for the comment about your baby, I am so sorry for your loss. \n\nBut getting drunk and storming the castle in a rage was a stupid idea at best. You may feel justified in your behavior, but that doesn't mean the intention wasn't to antagonize and traumatize others. \n\nTo be honest this family sounds like a toxic nightmare.",
      "id": 200,
      "comments": [
        {
          "score": 565,
          "content": "I’m having a hard time buying some parts of this and it just feels like stretched details to help justify what she decided to do. End of the day the whole family seems like a disaster.",
          "id": 201,
          "comments": [
            {
              "score": 268,
              "content": "That’s the *entire* problem with this subreddit. Every post. There’s multiple sides to every story but we only get the one.",
              "id": 202,
              "comments": [
                {
                  "score": 81,
                  "content": "The other problem is people can’t seem to seperate being an asshole with justification. Yes they treated terribly by the sister, yes it might be considered even payback but you’re still an asshole for doing it",
                  "id": 203,
                  "comments": [
                    {
                      "score": 43,
                      "content": "100%. Sometimes you can be justified in being an asshole, but you’re still an asshole. What did OP gain by going and yelling at her family? Nothing. Would have cost her nothing to not do that. So why not just stay home and let them be happy? Because she’s an asshole. Her family are assholes too, but being an asshole to an asshole still makes you an asshole.",
                      "id": 204,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 27,
                  "content": "There should be a sub where people make up the other side of the story. Try to add to it such that our perspective on the original changes (if we pretend it’s real). (Like 95% of the posts here and similar subs are fake, but ignoring that).",
                  "id": 205,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Too many times I've heard friend recanting stories that I was around for.  Even the most inane stories people naturally exaggerate things to make it cooler or in their own favor.  I try not to do it, but there have been plenty of times where after I told someone I story I thought to myself \"why did I embellish that detail?\"\n\nPeople posting to this Subreddit are oftentimes looking for validation so I'd wager these stories are even more one sided.\n\nThis is definitely ESH.  Maybe the family sucks more, but OP's actions were still shitty even from OP's biased opinion.",
                  "id": 206,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "There is definitely a self inflated side to this post, the family was ok with the other relationship and in under a year she was pregnant and they were ready to marry AND they all knew except OP, hmmm, seems like they all have similar opinions or predictions of OP and her typical behaviour, this is of course conjecture but there's more to it all and no way is this wedding crashing bullshit the first of its kind.\n\nThis entire family is off its head i hope i never meet any of them",
              "id": 207,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "What stuck out to me was OP, having blocked everyone, answering a call from an unknown number (most people won't even do that during normal times), and then staying on the phone for the sister to berate her.",
              "id": 208,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Like someone would ever put themselves in a negative light. You're always hearing the best side of the side of the story you're reading. You're never hearing the worst of the side.\n\nThis sub is hilarious to read",
              "id": 209,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 454,
          "content": "I'm going NTA because even though I see the reason for the E S H judgement, I don't consider people not having ideal reactions in less than ideal situations to be assholes, and this situation is a shit show.\n\nOP was went through a severely traumatizing event that led to the break up of a relationship that lasted half her life. On top of that, her sister used this situation, intentionally or not, to develop a relationship with the ex. Its just incredibly fucked up and I would expect OP to have a fucked up emotional reaction when she has been betrayed by almost everybody that she loved.\n\nOP made a scene fueled by pure emotion, but didn't break anything or hurt anyone. She is seeking help because she realizes she needs it because she can't keep reacting like this. I don't consider this AH behavior. I don't consider it a reasonable to expect most people would have a cool and collected reaction to all of this.",
          "id": 210,
          "comments": [
            {
              "score": 168,
              "content": "yep totally agree. she’s literally seeking help from a professional so as to find a way to deal with this and move forward. that shows a ton of maturity on her part imo.",
              "id": 211,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I agree! But also **Dating/marrying/sleeping your siblings ex is 👏weird 👏as👏fuck.** Say it out loud for the people in the back.",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "What does ESH mean? I'm new here.",
          "id": 213,
          "comments": [
            {
              "score": 5,
              "content": "Everyone Sucks Here",
              "id": 214,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1800,
      "content": "NTA. Oh my god.  The toxicity of your family is unbelievable.  I am so sorry that all happened to you.\n\nGet away from these people and look after your own mental health.  Please get some professional counseling and work through what has to be some serious emotional stress.  You deserve to be happy, so please cut these people out and find your own 'family' who will be loving and supportive.\n\nGood luck to you.",
      "id": 215,
      "comments": [
        {
          "score": 573,
          "content": "Id sell that ring and pawn it, spend the money on a plane ticket to any-fucking-where and build a new life somewhere far away.",
          "id": 216,
          "comments": [
            {
              "score": 84,
              "content": "Same here. I also would of sent a huge fuck you text to everyone, shattered my phone, bought a plane ticket to Dubai and stay there.",
              "id": 217,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "This!!! 100%",
              "id": 218,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "\"I sold the ring to get therapy for when you told me it was good my baby died\"",
              "id": 219,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 983,
      "content": "I'm going with NTA because that's just messed up. He comes to therapy with you but have sex with your sister and your sister just magically gets pregnant during the short time they're together and thinks about her happiness when it comes to your miscarriage.\n\nIf I were you, I wouldn't go the wedding and I would cut all contact with the family for a long time. Sending you an invitation for the wedding like that was rude and so thoughtless. \n\nYou should go back to therapy and get some help to deal with all of that.",
      "id": 220,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 759,
      "content": "NTA. For countless reasons they are: ex dating a sibling and not telling you, saying your miscarriage was part of their plan(!), throwing a party before ironing everything out to celebrate with family, etc.\n\nYou have every right to be upset and the only reason I would say YTA in any way is going nuclear on the party. That could have been done behind closed doors, but it also seemed they were perfectly content living life pretending you weren't even there.\n\nEdit: Changing this to NTA from a very minimal ESH after reading others and changing my mind. I think nuclear probably was the way to go. I hope you find peace in your pain and I am so sorry!",
      "id": 221,
      "comments": [
        {
          "score": 486,
          "content": "I do feel awful about barging in, thank you for your honesty",
          "id": 222,
          "comments": [
            {
              "score": 271,
              "content": "You feel awful cause you’re a decent person.\n\nI would have exploded.\n\nI mean they betrayed you in such an evil fucked up way. They gaslit you like this is normal. It’s not. \n\nYou were justified. \n\nI’d cut them off, not return the ring and even move, change address just start over and pretend they all died in an airplane crash. \n\nThat’s how fucked up they are.\n\nWhat your sister said about your miscarriage just seals it perfectly. She’s evil. \n\nIf you decide to have kids they will never have to deal with them. Your “family” have ruined any chance of seeing your future self.\n\nThey’ll always be vile and you will continue being brilliant and evolving as you heal and help yourself xxx",
              "id": 223,
              "comments": [
                {
                  "score": 118,
                  "content": "> I’d cut them off, not return the ring and even move, change address just start over and pretend they all died in an airplane crash. \n\nAnd change your name.\n\nMom, Dad, sis, and ex could never be part of my life again. If I even acknowledged the, it would be as very distant acquaintances.",
                  "id": 224,
                  "comments": [
                    {
                      "score": 39,
                      "content": "The only contact I’d ever have again would be to show up at their funerals just to make sure they’re really dead.",
                      "id": 225,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 154,
              "content": "I hope you see I changed my view and agree that any bit of anger is justified. I just know that those type of situations tend to end up either in reconciliation or no contact and it seems like it will be your choice because everyone else is content leaving you behind in your feelings and in general. Nobody here knows your family dynamics outside of 2 paragraphs you've given, so take advice with a grain of salt. If you care about keeping your family, you will have to open some painful wounds in ways that can be received as well as possible by everyone. I mean, is the goal just to ignore the situation forever?!\n\nI have been part of a family that has not talked to each other in a long time and it is hard. That is why I responded intiially the way I did. You deserve much better and it seems like the situation where if someone will be the bigger person, it gets to be you. Take pride in that and know you can dictate this how you want it to go.",
              "id": 226,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 83,
              "content": "You feel awful because you’re a good person with a conscience. Has your ex or any of your family even tried to make amends? So don’t blame yourself for having a human reaction. I wish you didn’t even apologise, they don’t deserve it. Cut them all off.",
              "id": 227,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You shouldn’t. Your sister should feel awful for existing. She’s an actual monster.",
              "id": 228,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "OP I would have done so, so much worse than what you did. Your reaction was justified if ill-advised and unhealthy. Cut them off. Blood doesn’t mean shit, find a new family who actually loves you.",
              "id": 229,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 572,
      "content": "Jus this: \n\n>my sister told me maybe my baby died for a reason so she could get her happy ending.\n\nI truly hope you find the healing you need and deserve.",
      "id": 230,
      "comments": [
        {
          "score": 180,
          "content": "That sentence alone is scorched earth enducing. How could someone say that to someone that they like let alone love?",
          "id": 231,
          "comments": [
            {
              "score": 15,
              "content": "I don’t even think I could say this to someone I dislike honestly….",
              "id": 232,
              "comments": [
                {
                  "score": 6,
                  "content": "I've been through that particular loss, and had close family and friends go through it.\n\nI wouldn't have to even know the person this was said to to go nuclear with rage. Even if I hated the person it was said to I think I'd still lose my absolute shit on their behalf.",
                  "id": 233,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}