{
  "post content": "TA since fam has main\nSo, me and wife have a new born, who is breastfed. \n\nMy wife *hates* confrontation, she never stands up for herself ,She won’t argue with anyone…..*ever* I mean ever. She will let you walk all over her and then apologize to you\n\nIt used to be infuriating because she’s the sweetest soul and she just lets people say what they want and she doesn’t deserve it but after talking there is a good reason behind it so we are working together how to fix this. \n\nWell one thing she always felt afraid, not because she didn’t want to but she knew it caused confrontation was breastfeeding anywhere but the house or in a bathroom or closet and we will keep a blanket.\n\nIt took a lot of explaining but unless she is uncomfortable with breast feeding out, there is no reason to hide in a bathroom. \n\nWell, we are at my mothers house,I don’t have the best relationship with her but my wife thinks it’s important and i enjoy talking to my dad So we were over with the baby chatting with my father and my mother cooking as they were talking she started feeding. \n\nBaby was eating and she blanket covering her slightly. dad has six kids he couldn’t give less of a sh*t, he looked away for a moment so she could get situated and engaged back in conversation without any issue. \n\nmy mother comes in, gasps and goes on a rant. She said that that is disgusting and if she was to do that she should’ve gone home, especially infront of her husband, who apparently “looks uncomfortable” and it’s rude to do when you know people around you don’t like it. Dad cut her off saying to keep him out of it and feeding a baby wasn’t his issue. She ignored, continued ranting saying that she needed to respect herself more and don’t ever do that in her house again. \n\nI stopped her, I said that she needed to get lost and get over herself she had six kids who she undoubtedly did the same thing with and this was just her way of taking her anger out but she’s not going to do it on her. I said that she was being a hypocritical a hole and that this is the last time she’s seeing wife or baby. This happened once and not going to happen again. \n\n*then* she said she was just in a bad mood and she’s so sorry she took it out on her and she’s welcomed to do that whenever she needs to.\n\nI told her she shoulda thought about that before. Then went to my wife who mid rant left to the bathroom in hysterics but didn’t want to interrupt the babies eating. We sat in the bathroom for a little while until baby was done, she stopped crying.\nWe left, my dad said I was being more reasonable than he would have, mom sent me tons of messages, family is telling me I was being dramatic and that it wasn’t that serious and I was being entirely unreasonable and if my wife was that hurt by it she needed to grow ‘thicker skin’\n\nShe didn’t even *actually* have an issue, she was just being mean. I think I was right to do what I did. \n\nBut AITA?",
  "id": 1,
  "comments": [
    {
      "score": 15711,
      "content": "NTA. \nBreastfeeding is feeding a child. Period. I don't get the uncalled obsession of telling people to do it in bathrooms. Would your mom eat her lunch there?? \n\nYou did well OP. No one should be confronted like your wife was and your mother needs to stop behaving like the mean witch of any given child story.",
      "id": 2,
      "comments": [
        {
          "score": 7430,
          "content": "“Would mom eat lunch there” \n\nEXACTLY!!",
          "id": 3,
          "comments": [
            {
              "score": 4279,
              "content": "drop mom, keep dad",
              "id": 4,
              "comments": [
                {
                  "score": 1788,
                  "content": "Definitely, so often the partner here does fuck all. Ops dad did the right thing and it would be nice if he could carry on seeing the baby. Away from the mum of course.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 329,
                      "content": "This. I do hope this won’t have an impact on Dad’s access to the baby.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 291,
                      "content": "It’s clear which parent won the battle and instilled their values into OP. \n\nNTA. \n\nI’m willing to bet that his wife has a similar mom in her family but an absolutely useless father. That’s why she’s such broken bird.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 83,
                      "content": "I think it'd be good for dad to come to OPs place to see the kid. No need to punish him for Mil's actions",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 175,
                  "content": "It hurts that so often misogyny is carried over by women instead of men. Ladies, we need to do better. NTA but maybe have a sit down chat with mom.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 48,
                      "content": "wtf is wrong with standing up to an asshole it doesn't matter if they're a man or woman a asshole will be an asshole",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 36,
                      "content": "Yeah, I see everyone calling men sexist but I never seen women  being held accountable for the SAME sexist actions. It's sad that other women are shaming a new mom for doing something natural",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Women are expected to police other women, taught to from childhood, and as a way to gain some sort of power. It's internalized misogyny. Protect men by controlling other women.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 100,
                  "content": "Yeah, and the family who said OP was being unreasonable can fuck off. The man who has to live with this woman has said that OP was more reasonable than he would have been. That’s a pretty clear message that Dad knows his wife can be a huge AH, and he should be the expert on that. Ignore them.\n\nNTA",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Dad sounds great. Mom sounds immature af. I feel bad for him if these are the smallest things she gets mad over",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Dad sounds cool, I’d take hit with him.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -33,
                  "content": "[deleted]",
                  "id": 16,
                  "comments": [
                    {
                      "score": 48,
                      "content": "Shut up he literally stood up to her shit",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1885,
              "content": "Invite mum over for lunch. Set hers up in the bathroom.",
              "id": 18,
              "comments": [
                {
                  "score": 425,
                  "content": "I love you, this is so petty but it IS the answer !! :))",
                  "id": 19,
                  "comments": [
                    {
                      "score": 100,
                      "content": "You joke, but maybe it is the answer to any family that have an issue with breastfeeding.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -5,
                      "content": "[removed]",
                      "id": 21,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 326,
                  "content": "Exactly. \"Watching you eat is disgusting mom, so I put yours in the bathroom\"",
                  "id": 22,
                  "comments": [
                    {
                      "score": 84,
                      "content": "On the seat....",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 111,
                  "content": "No, she should never ever be in OPs wife's safe space.   Maybe at a family member's house.  I love the thought but she lost all visiting privileges.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 3,
                      "content": "this guy can show knuckles de wae",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 81,
                  "content": "I like this idea a lot!",
                  "id": 26,
                  "comments": [
                    {
                      "score": 91,
                      "content": "I wouldn't do this.\n\nIt was good of you to recognize your mom was the A hole here, and *why* in such short order. Its pretty obvious everyones used to your mom dumping on people when she's in a bad mood and they expect you to suck it up.\n\nThats the good thing about being an adult. You don't *have* to interact with anyone you don't want to. You chose wisely. However bringing your mom in your wife's safe space is a mistake. \n\nInvite dad to come without her, and explicitly tell her she can come visit when she tells *the exact same people she was egging on to bother you* that her behavior was out of line and she should have owned it instead of getting others involved.\n\nThen after she does that you will ask your wife if she's okay with it.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "You are of my tribe!",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "You petty motherfucker. I like you.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "You win all the petty awards and I'm here for it. Also, OP NTA",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I love it!",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Snarky response and evil plan.  I love it.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "And maybe not clean it for a week or so prior.",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 674,
              "content": "My husband tried telling me this with our first. If we're eating out and the baby needs to eat, I should go to the bathroom. I told him, sure, as long as you grab your plate and pop a squat in there with me. He replied, ew, gross. I told him, exactly. Then why do you want your child to eat in there? The dawn of realization on his face was glorious. It was our first and only discussion about what I could and could not do in public with my breasts and our baby. \n\nLong story short (too late! Sorry) Thank you for being one of the good ones who understand that breastfeeding is normal and that it isn't sexual in any way. It's providing nourishment for a growing life. Moms can fight this fight but we really needs Dads to step up whenever they can to help.",
              "id": 34,
              "comments": [
                {
                  "score": 251,
                  "content": "I fed my oldest in a bathroom at an event once. It was full of people, I was sitting on a chair as not to fill a stall, she was covered and I was trying to be out of the way. I still got looks of disgust from people. It was that moment when I decided that I truly didn’t give a fuck and people could look away if they didn’t want to see it.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 286,
                      "content": "When my daughter was a baby, we went to the ripley's aquarium in gatlinburg, tn. This was 2002. Place was full of families and small children. Baby needed to nurse so I went to find a bathroom, not knowing where else I could feed her without people flipping out.\n\nNext to the restrooms they had another room with a sign on the door that said nursing mothers. I go inside and it's the nicest room set up with rocking chairs. I fed my baby in absolute comfort without the stress of trying to \"hide\" to feed her. I was so grateful they had the consideration to create a place for nursing mothers.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "I mean Id be kinda \"eww\" not because of the breastfeeding, but because of the location... Why would you subject your little one to a public bathroom of a busy event for more than necessary? Unless it was a swanky place, with sofas more comfortable than my living room, in which case perfect place!",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I have decided that most people are okay. They're just doing their thing and living their life. Then there are the giant assholes who have nothing better to do but try to make every person they interact with feel little. Those people are little people who live little lives and just want to watch the world burn because they don't care about anyone but themselves. Sometimes they don't even care about themselves if it'll make someone miserable. I think we should gather up all those people and put them on an island together. We'll all be happier and they'll have plenty of people to annoy still. it's a win/win! \n\nGood for you! Sometimes you have to out asshole the assholes and not fucking care what they think!",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "Looks of disgust from other women? You weren't doing anything wrong",
                      "id": 39,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 69,
                  "content": "They assume breastfeeding is about the mother feeding the child, when it's actually about the child eating a meal.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Exactly! Well said!",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "The fact you had to type out what I could do and not do\" is sad. But good thing he actually understood and didn't argue. I'm sick of people acting like they own their partner's body",
                  "id": 42,
                  "comments": [
                    {
                      "score": 2,
                      "content": "That was the one and only discussion we had about it. Otherwise, he has been very good at acknowledging my autonomy over my own body. We're both the type of people who once we realize our argument isn't correct, we correct our thinking. We don't do the \"I'm right and you're wrong always\" thing.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 272,
              "content": "Your Mom acts like this because she has been ALLOWED TO. It’s time someone like you put a stop to it. Especially when she tried to throw your Dad under the bus as an excuse. Luckily he was having none of it. Your mom was just being mean and petty. That comes at a cost called consequences. Mean and petty people don’t like consequences. Thank you for standing you for your wife. Some SOs don’t. Keep your boundary and stand firm. All of those who say your wife needs to get a ‘thicker skin’ needs to be added to the list of those who are no longer a part of your life.  NTA",
              "id": 44,
              "comments": [
                {
                  "score": 9,
                  "content": "Underrated comment 👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻\n\nBut you should probably add a judgment, yeah? 🤔😀",
                  "id": 45,
                  "comments": [
                    {
                      "score": 7,
                      "content": "A judgment only counts if you're the originating comment on a thread, not a reply to someone else.",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Oops sorry!",
                      "id": 47,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Yes.  The people on JustNoMil have a lot of experience witth people like her.  She can be expected to push boundaries and criticize on a regular basis if she is not stopped now.\n\nShe may continue anyway, but if she knows your expectations for her behavior, you can feel less guilty when you reduce or eliminate contact with her.  NTA",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": ">Would mom eat lunch there\n\nid eat my lunch in the bathroom, but im also a weirdo who avoids human contact so im probably not the best example for this lol",
              "id": 49,
              "comments": [
                {
                  "score": 22,
                  "content": "Right, I might choose it for myself (depending on the bathroom it might be better) but nobody is going to tell me I have to.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 66,
              "content": "Awesome job defending your wife!   Thank you for putting her and your child first.  And thumbs up to your Dad too.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "NTA You're my hero!",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Your dad is a keeper. Not so much your mom.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "“You need a thicker skin”. “You can’t take a joke”. Etc, etc, is what bullies say to justify their behavior and blame the victim for them being bullies.  Do not let them get away with it.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Too bad it was too big of an issue to be able to wait and confront it by getting disgusted by your mom eating and telling her she needs to do it in the bathroom",
              "id": 55,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 377,
          "content": "There was a series of adverts on Australian TV when it became a protected right for mothers to breastfeed whenever and wherever they needed to, that featured a grown man in a suit eating spaghetti from a tupperware in a toilet stall.  \nThe tag line was \"you wouldn't eat here, so why should a baby?\"",
          "id": 56,
          "comments": [
            {
              "score": 95,
              "content": "The minute I Read this I had to find it....\nhttps://m.youtube.com/watch?v=VnReJeQrK0k&list=PLU5mGN5EuKvNMijsttfG1GOAcx5tFpzDa&index=2",
              "id": 57,
              "comments": [
                {
                  "score": 19,
                  "content": "You're the best😂",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "This is GOLDEN.",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "So glad that's a right here! I have breastfeed many times in public without a cover because LO rips them off or stops breastfeeding so I have up. I rarely get looks and it was nice knowing that I could tell them off with the law on my side if they did. Legit those ads were great 😆",
              "id": 60,
              "comments": [
                {
                  "score": 3,
                  "content": "The fact we even need laws to protect nursing mothers doing something natural and non harmful is sad",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I don't remember them but I breastfed my three kids anywhere and everywhere...post office, school, tram, train, plane,  Cafe and the park. Never did I cover them up nor flash a boob to my knowledge. Only once in my combined 6.5 years if breastfeeding did I ever get a comment and it was a young woman  walking past whilst I was feeding on a public bench outside the markets. Before I or my husband could say anything,  her friend stated berating her.  I didn't gaf what others thought,  that's a them problem, not a you problem.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 261,
          "content": "They are just some titties. Everyone has either seen one or fed from one. People who flip out about it need to get their heads out of their asses and STFU 🤬",
          "id": 63,
          "comments": [
            {
              "score": 75,
              "content": "Blind people enter the chat 😎",
              "id": 64,
              "comments": [
                {
                  "score": 34,
                  "content": "Oh, so you were bottle fed?",
                  "id": 65,
                  "comments": [
                    {
                      "score": 80,
                      "content": "Sorry could you send that in braille I couldn't read it.",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "I am fairly confident there are blind people who were bottle fed. But I doubt they're the people giving people a hard time for breastfeeding in \"public\".",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "This is what I really fail to understand. I've never had a child and I'm a 29F  and I am so shocked that people in this day and age actually get so offended by people breast feeding????? Literally half the outfits and swimsuits out there barely cover your breasts and everyone is all for that. But someone feeding their baby is so terrifying to the general public? Jesus it's just breasts.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "What they should do is when his mother eat act the same way. Oh can you please do that in the bathroom how dare you eat in front of me. \nSee it’s ridiculous to expect anyone to do it but it’s ok to treat babies like crap because they get breastfed. \nI breastfed and I didn’t give a shit my baby was hungry I would feed stuff everyone else baby more important.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "It’s not remotely point, but I do feel like in North America, public bathrooms SHOULD be nicer. Like have closed sound proof doors that go all the way down so we can’t hear poops, good floor drainage, exceptional ventilation, warm temperatures, artwork, general sound proofing so it doesn’t echo, charcoal filtered air purifiers\n\nWe really shouldn’t be eating in a bathroom, but we do spend time there, I would like for it to be just a bit nicer\n\nNta",
          "id": 70,
          "comments": [
            {
              "score": 41,
              "content": "Back in the day places like Sears had clean comfortable ladies lounges as part of the bathroom set up. It's nice sometimes to have a quiet place away from everyone to relax when feeding babies. I do think babies need to eat regardless of where they are but I liked doing it alone sometimes because of my own anxiety.",
              "id": 71,
              "comments": [
                {
                  "score": 12,
                  "content": "Where I live almost every major shopping centre has a quiet room with armchairs etc where you can sit and feed a baby. I always really appreciate these as I personally prefer to breastfeed in semi-privacy, and having a decent chair to sit in really helps!",
                  "id": 72,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Those sound heavenly. But we should also have them for every guy girl and non binary pooper. We all deserve nice places",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I think some Nordstrom stores still have family lounges.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "The ROTC and university police building on my old college's campus had the best lounging area in the women's bathroom. I legit went there to take naps between class sometimes because it was so low traffic",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "That’s great! But what I mean is like for every human deserves a nice public bathroom, not just for baby feeding",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Oh, if we did *that* people would just use them as fuck booths.  \n\nThough I agree.  One of my college dorms had floor to ceiling toilet stalls and that was so nice for anxious people.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Bathrooms in public are gross. Especially women who leave their period products and other stuff in there on the floors for others to find. Who would want to eat in there",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 48,
          "content": "It sounds like mom was just trying to pick a fight, and landed on this topic. Still NTA, I don’t have time or energy for people like this.",
          "id": 79,
          "comments": [
            {
              "score": -1,
              "content": "I agree NTA although the forever threat to withhold the kid forever seems extreme? And maybe detrimental to the kid. Maybe not unless grandma has some redeeming qualities. \n\nBut in all seriousness OP your constellation of women sounds \\*exhausting\\* -- from the terrified, sobbing wife to the haranguing mom, you and your (sane, kind) Dad must be expert navigators.",
              "id": 80,
              "comments": [
                {
                  "score": 6,
                  "content": "As somebody who has cut family off, reading this, it sounds like OP is sick of his mother’s shit, and only puts up with her to spend time with his dad.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": ">family is telling me I was being dramatic and that it wasn’t that serious and I was being entirely unreasonable and if my wife was that hurt by it she needed to grow ‘thicker skin’\n\nHere we go again. No-one can just grow a thicker skin. Your wife is sensitive and deals with it by being non-confrontational to infinity, something that means she gets walked over all the time. Well done for supporting her against your appalling mother. NTA.",
          "id": 82,
          "comments": [
            {
              "score": 26,
              "content": "And nonconfrontational people often get that way because they have dealt with a lot of completely unreasonable people in childhood, ones who would never change their behavior no matter what.  You learn never to engage because it's not worth it, or it will get you further abused.  It can take a lot of therapy to shift that.  Thank goodness OP had his wife's back.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "It's because american society is scared to death of tits. Morality police being high and mighty about something that couldn't be more trivial.\n\nNot saying breastfeeding is trivial, I'm saying getting offended by a boob is trivial especially if that boob is being used for the function that boobs are intended to be used for.\n\nNTA",
          "id": 84,
          "comments": [
            {
              "score": 14,
              "content": "Yup, exactly this. American puritanical society, particularly men, and particularly the religious right in America, have completely turned breasts into a sexual organ. They totally aren't, but that's what has happened, to the point where going topless and showing the nipples *as a woman* is illegal in most states because \"it's lewd and lascivious\". But only lady nipples. Not men. Guy nipples are just... meh. Nobody ever considers those to be inappropriate or sexual.\n\nIt's pretty stupid and misogynistic, but most folks are so used to it we don't think about it. There are loads of \"Christian\" men who act all disgusted by breastfeeding because they basically think boobs should only exist for thier viewing pleasure, and nothing else. These are the ones who call breastfeeding mothers \"lewd\" in public. They don't even like thier wives to breastfeed oftentimes- I guess it ruins things for them, so they just do all they can to pretend it isn't happening and making them hide away to feed baby.\n\nBecause it's a societal issue though, that means plenty of women have internalized misogyny, too, so they can be awful towards other women.\n\nSo tired of the puritanical beliefs that far too many Americans have. It does so much damage, especially since it really contributes and connects towards rape culture in America.",
              "id": 85,
              "comments": [
                {
                  "score": 2,
                  "content": "Puritans are cringe. Their weird history of trying to stamp out people's sexialities is just weird",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "And your comment of only women's chests not being shown isn't true. I've read some places guys did have to fight to go topless. It was seen as religious taboo in older times to express sexuality of any kind.  Also in media chests drawn for men are still somewhat censored",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Agree NTA, just to add, \"I was just in a bad mood\" is classic abuser behavior, not long after buying the bad mood I was a \"frequent flyer\" at the er with stories like I fell or ran into something, keep that child and your wife away from her, she is an abuser and she found someone that won't stand up to her, it will get worse",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I actually suggested that a hateful old man do that at a restaurant when my kid was about 6 weeks old.  The waitress relayed his request,  I told her that it was illegal for her to ask and that if he was that uncomfortable. I was sure the men's room or his car would be far more comfortable for him, plus, it would be way easier for him to move since babies have do much stuff.   He left.",
          "id": 89,
          "comments": [
            {
              "score": 2,
              "content": "I love this story.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3701,
      "content": "NTA. You stood up for your wife and she probably respects you a lot more for it. Your wife is a pushover probably because of past experiences, and if anyone tells her to grow \"thicker skin\", just tell them to suck it. Why does SHE need to grow thicker skin? Why cant everyone else be respectful and shut the fuck up about things their opinion isn't wanted in. \n\nYour mom is definitely the asshole. How is something as natural as breastfeeding disgusting to her?",
      "id": 91,
      "comments": [
        {
          "score": 2054,
          "content": "Not even that, how is something she did with multiple kids willingly,disgusting",
          "id": 92,
          "comments": [
            {
              "score": 683,
              "content": "I wonder if she repeatedly thought to herself, \"This is disgusting!\" as she breastfed her kids.",
              "id": 93,
              "comments": [
                {
                  "score": 99,
                  "content": "She prob bottle fed hers.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 86,
                      "content": "I mean, it's OP's mom, he knows she breastfed.",
                      "id": 95,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "She's probably the type to leave the room hurriedly and embarrassed when anyone came in. Such a shame. It's. A natural process",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -44,
                  "content": "Women can get aroused from breastfeeding. Maybe she experienced it and is not associating breastfeeding with dirty thoughts. It's all normal and natural though, since it's them nipnops. Doesn't mean you're hot on babies or little kids just the way our nervesystems work. But it's not talked about much among moms or in general so it might come as a surprise. And it can be odd, having tickles in your panties while breastfeeding a child which is not a very erotic situation usually.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I wonder if those downvoting just refuse to understand your comment and see \"arousal, babies => downvote\". \n\nIt's fact that breastfeeding is connected with downstairs, one of the reasons why in labor hospital they recommend you to breastfeed at least for a while is because it helps with shrinking your uterus to pre-pregnancy size. \n\nPersonally I find those tickles more weird than arousing. But it's definitely the same like arousal, the only difference is in my mindset.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 121,
              "content": "You did good, NTA. But if you were born in the 70’s or 80’s you likely weren’t breastfed. 50’s-60’s it became less popular, even more so 70’s-80’s and by the time it came back into favor in the 90’s and continues to do so, it was more taboo than it had ever been before the 50’s. Now, it’s a good thing I was formula fed because my mom wanted to go back to doing her drugs in the 80’s (Her words, not mine), but but your mom is likely those generations. Even if she did breastfeed you she probably felt her own shame but that’s not your wife’s responsibility.",
              "id": 99,
              "comments": [
                {
                  "score": 50,
                  "content": "My oldest sibling was born mid 70's and I was born late 80's. My mom said that I was the only one she attempted to breastfeed (also the only one she got an ultrasound for) so we def fall in that scope haha",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "Correct! 80s baby here. No breastfeeding for me. But my younger siblings born in the 90s were. Go figure.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 52,
                      "content": "The formula companies told people that formula was better for babies.  By the 90s it was clear they lied.",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Do you notice a difference between you and your siblings when it comes to socializing with people? My mom didn't breastfeed me or my sister and neither of us are really touchy-feely, sentimental people. I've always wondered if that has anything to do with it or if it was just how we were raised",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I was born in the seventies. There was a prevalence of formula feeding but there were outliers. My mom was so crunchy hippie that she breastfed each of us until we self weaned. I feel like I'm the first person in America to have witnessed a nursing toddler, even weirder to know I was one.",
                  "id": 104,
                  "comments": [
                    {
                      "score": 6,
                      "content": "When nearly everyone born before the 50s was breastfed.",
                      "id": 105,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "If your family could afford formula, anyhow. We were all breastfed (mid 70s-early 80s) but my parents were flat broke when I was born. (My mom may have been a bit skeptical too, she never bought into margarine over butter either…)",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "My mom breastfed us in the 80s and says it felt like an act of rebellion every time. It actually took courage to be a breastfeeding Mom.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "In my area of the US, breastfeeding was back full force in the 80s, when I had, and breastfed, both my kids.  Not so much in the early 70s, but increasing more in the late 70s.\n\nIn the 40s and 50s, when my siblings and I were born, it was all bottle feeding.  I was fed a formula of canned evaporated milk, boiled water, and corn syrup.  My mother tried hard to breastfeed, but got no support.\n\nNTA",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Wouldn't she have corrected him if so?",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": "People like her will use every opportunity to bully their victims (which apparently she has decided your wife is prime victim material due to her timidity) even if what they are saying makes absolutely no sense. My MIL did the same to me until she pushed me too far and I lost my shit on her.  Stupid me thought I had solved the problem, but she just went covert with it and shit-talked me and our kids for years behind our backs.  When I finally figured out what was going on we all went no contact with the whole lying family.",
              "id": 110,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Well, I hope she hid in the bathroom, in shame! /s",
              "id": 111,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "your mother is the disgusting one. NTA",
              "id": 112,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "NTA. But just wanted to say congrats on the new baby and the she's able to breastfeed. Rif your in the has lots of families are in a lot of trouble because there is a shortage of formula. So, keep mommy happy and breastfeeding! Keep standing up for  both of them!",
              "id": 113,
              "comments": [
                {
                  "score": 2,
                  "content": "Yes we got very lucky! Momma and baby are alright !",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "She’s gaslighting you, my friend. “Thicker skin” and “take a joke” are ways for bad people to convince you it’s YOUR fault that you don’t like how they behave.  Fuck those people.",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Exactly this. My mil is a huge prude who freaks out of anyone breastfeeds in the room. Even with a cover on. Because it’s *gasp* a breast involved! Gah. \n\nAnd as the oldest of six kids my husband says she did it all the time so she’s just being a controlling hypocrite",
              "id": 116,
              "comments": [
                {
                  "score": 5,
                  "content": "I’ll never understand, balls of fat on a chest😱, horrific",
                  "id": 117,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I don’t think it has anything to do with breastfeeding. I think she just doesn’t like your wife and is looking for reasons to take her down a peg in her mind.",
              "id": 118,
              "comments": [
                {
                  "score": 2,
                  "content": "I think your right",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -5,
              "content": "Because most older ladies who feel like this tend to be  on the less smart side and conservative. Do you live in the south lol\n\nEdit for clarification*",
              "id": 120,
              "comments": [
                {
                  "score": 22,
                  "content": "It wasnt a south thing. It was the medical community pushing moms to bottle feed over breastfeeding so they could be out in public. I was bottle fed for that reason. My mom regrets not trying to breast feed. But it is what it is. By the 90’s women started pushing back and in canada breast feeding or not we got the right to go topless same as men.",
                  "id": 121,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Most people I know who get turnt over a baby getting breast fed is insecure older women. I wasn’t  able to breast feed my own baby and was shamed for it, but I can’t comprehend someone being upset because a baby needs to eat from what the female body is supposed to naturally give. I made the south comment because MIL sounds like my own older conservative MIL",
                      "id": 122,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 225,
          "content": "People have told me to grow a thicker skin my entire life! \n\nWhat it actually means is “*I just don’t care enough to not continuously hurt you over and over and I’m unwilling to change even in the slightest so instead I demand that you change and stop being hurt when I do or say hurtful and cruel things. Or at the very least pretend to be fine and hide if you get hurt so that I don’t have to feel bad over my casual cruelty because I like to pretend that I’m a good person and that’s more important than you and your well-being.*”",
          "id": 123,
          "comments": [
            {
              "score": 37,
              "content": "This and \"*you're too sensitive.\"*",
              "id": 124,
              "comments": [
                {
                  "score": 6,
                  "content": "Yet they're bold enough to cry at you and copy paste ypur words to their Facebook group  or send it to other family when you stand up to their bullying. Looks who's \"sensitive\" now",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "It's setting her up to fail. Say intentionally hurtful things, blame the victim for being hurt.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "The mother should get a thicker skin so she can handle seeing someone breastfeeding without freaking out. Imagine thinking that being upset and leaving when someone is shouting at you while you are holding and feeding a baby is unreasonable! The wife was in such a vunerable position and it's just lucky that baby wasn't disrupted from their food.",
          "id": 127,
          "comments": [
            {
              "score": 44,
              "content": "She wasn't even disgusted by it, she just chose that to be the random thing she gave his wife shit over because she was in a foul mood.  \nOP is definitely better off keeping that toxic BS at arm's length",
              "id": 128,
              "comments": [
                {
                  "score": 0,
                  "content": "That's a crappy excuse. You don't treat guests like that, especially when they're behaving in your house",
                  "id": 129,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Oh absolutely, I wasn't defending it, just pointing out how fucking batshit it is",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 41,
          "content": ">Why does SHE need to grow thicker skin? \n\nMy MIL said I was too sensitive. I said no, you're INsensitive!  :))\n\nha haaaaaaa !!",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "THIS! I hate when people tell me I need to grow a thicker skin so it works better for them. They can also change to be more compassionate and empathetic. God forbid I have feelings and don't like to confront people.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": ">Why does SHE need to grow thicker skin?\n\nExactly! If anybody, and I mean *anybody*, tried to demand someone I was close to to grow thicker skin in situations like this, I would demand, \"Why should they be forced to grow thicker skin to accommodate you being an asshole?\"",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -21,
          "content": "OP's mom is an asshole and also the wife needs to grow a thicker skin. Expecting other people to care about your feelings is setting yourself up to run to the bathroom crying every time someone is a dick to you. Having a bit of a thick skin is just a useful skill, like cooking or swimming.",
          "id": 134,
          "comments": [
            {
              "score": 13,
              "content": "My wife is just fine. She is a sensitive person like most, we are working on it, but there isn’t a *problem* she doesn’t have to.",
              "id": 135,
              "comments": [
                {
                  "score": 10,
                  "content": "I don't understand this desire we have as a society to hammer on people. As long as your wife is happy and healthy, the thickness of her skin is her own business. She clearly has a safe harbor in you and at least a supportive system outside that in the form of your father if no one else. Having thin skin shouldn't be seen as a vice.",
                  "id": 136,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1923,
      "content": "> my dad said I was being more reasonable than he would have\n\nBased on your response I believe your father said you are NTA, I agree with him.",
      "id": 137,
      "comments": [
        {
          "score": 440,
          "content": "yeah dad knows whats up, he's probably just as sick of her BS if not more",
          "id": 138,
          "comments": [
            {
              "score": 150,
              "content": "Makes you wonder why he’s tolerating her still. She sounds miserable to be around.",
              "id": 139,
              "comments": [
                {
                  "score": 176,
                  "content": "My guess? He feels obligated to because they’re married.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 83,
                      "content": "That's why my mom is with my dad still, a man that has cheated on her multiple times in my 34 years. She was raised catholic, so divorce is looked down upon no matter the reason behind it. \n\nBoth my parents are miserable, and neither will admit it and file :/",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "Well sure. So why are they still married?",
                      "id": 142,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "In some long-term relationships, they stay because they like the companionship.  Even if you're not talking much to each other, sometimes it's nice to just have someone else in the room.\n\nSome people prefer animals to humans for company.  I can understand why.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "As someone who stayed in a miserable marriage, it’s about life experience and values. My husband’s parents’ divorce was really hard on him and he was/is determined to make it work. The big thing in my case was that we both decided if we were going to stay together things needed to change. We are very happy with two children now. I don’t know if I could have put up with OP’s mom as long as his dad has. Or it could be she’s gotten mean in old age and he’s wondering where his sweet wife has gone.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Totally this. I feel for the dad since he has to put up with stuff like this all day long. Good on him for standing with you.",
          "id": 145,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 927,
      "content": "NTA. Your whole fam is for sure though, they can easily just not be rude instead of demanding your wife “grow a thicker skin”",
      "id": 146,
      "comments": [
        {
          "score": 370,
          "content": "Exactly!",
          "id": 147,
          "comments": [
            {
              "score": 415,
              "content": "Except your dad.",
              "id": 148,
              "comments": [
                {
                  "score": 373,
                  "content": "Yeah he’s cool",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "The type of people that say “grow thicker skin” are just looking for a way to justify their awful behavior and play you off as the problem (not them).",
          "id": 150,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 898,
      "content": "NTA. \n\nWow, not only did your mother attempt to \"slut shame\" a breastfeeding mother, she also insinuated that it was done on purpose to make your father, her husband ...have a reaction. \n\n\nThe irony is she made everyone else uncomfortable by expressing these warped opinions. She tried to come off as the voice of morality and decorum and ended up looking like a bitter bully. \n\nYou did the right thing 100%",
      "id": 151,
      "comments": [
        {
          "score": 551,
          "content": "Right. It’s a baby, and it’s disgusting how it’s made to be sexual",
          "id": 152,
          "comments": [
            {
              "score": 150,
              "content": "Congrats on your little one!\n\nYour dad is a rockstar as well as you for sticking up for your wife.\n\nBreastfeeding is already hard as it is. Having family shame their  family member or the partner for nursing is disgusting. I had family do it to me and I stopped breastfeeding. I had 2 more children after that and between latching issues and my past trauma, I wasn't able to. (My boys are now 18, 12 and 8)\n\nNTA and wishing you all many blessings.",
              "id": 153,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "NTA by any means. I’m curious, is it possible your mother is jealous of your wife’s appearance? If she’s a narcissist, she may feel in competition with your wife and put her own feelings of sexual inferiority above the basic need of her grandchild to eat. Disgusting.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 416,
      "content": "Nta, she sed she found it disgusting so I guess she won't be in sight with baby until breastfeeding is done? WHO recommends two to three years,",
      "id": 155,
      "comments": [
        {
          "score": 261,
          "content": "Guess that’ll have to be the case",
          "id": 156,
          "comments": [
            {
              "score": 86,
              "content": "You can tell your family that you made that decision to make sure she won't be uncomfortable ever again 😌",
              "id": 157,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "NTA, and I don't want to assume your family planning, but sure would be a shame if #2 came along about then, you'd have to go another 2-3 years without the pleasure of her company",
              "id": 158,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -16,
              "content": "Your mom sounds like an idiot but she apologized. Just go back and all get along like happy families",
              "id": 159,
              "comments": [
                {
                  "score": 23,
                  "content": "Nah. Im good. I’m not gonna be around manipulative gaslighting gossipers who disrespect my wife my baby and me. This ain’t happening again.",
                  "id": 160,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Why? So she can make OP's wife cry about something else next time? She wasn't an idiot: she was being purposefully nasty because she was in a bad mood and knew OP's wife was an easy target. People like that don't deserve happy families and don't get to brush their bad behavior under a rug.",
                  "id": 161,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "Just because she apologized doesn’t mean anything. I know PLENTY of people that apologize a few times, just to get you back around them, and continue to do the same things. \n\nOP, NTA. And I applaud you for backing your wife. That is what needs to happen to these MIL’s that try to make their DIL’s miserable. I don’t understand it. There have been a few of my sons gf’s I didn’t care for, but I would NEVER treat them poorly. And your mom reacting that way over breast feeding, sounds like she is jealous of your wife and worried about your dad. I was never able to breastfeed, but I don’t care if you pull the whole thing out and NOT cover the babies head (I mean seriously has your mom ever tried to eat in the bathroom with a blanket covering her face?), around my husband. If my husband is turned on by a mother breast-feeding her new born baby, LET ALONE his own DAUGHTER IN LAW breast-feeding his grandchild, then I would say I have bigger problems on my plate.\n\nEdit to add the word breast to the “breast-feeding” at the bottom.",
                  "id": 162,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 64,
          "content": "LMAO the last part has my crying. Welp, guess the mom will see baby in 3 years!",
          "id": 163,
          "comments": [
            {
              "score": 36,
              "content": "Well it's not lying and breastfeeding is on command of baby, it can be after 20 mins, it can be after 3 hours, \n\nSrr mom you find it disgusting but it's so hard to plan",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "I'm pretty sure that's the MINIMUM too. In many parts of the world kids get top up breast milk until 5 or 6 (although that would be very unusual in the West)",
          "id": 165,
          "comments": [
            {
              "score": 26,
              "content": "Tbh I did my best and I went as far as 1. Year 5 months with the second child, then my body was done, first kid 1 year 1 month, \n\nIt depends on a lot but grandmo doesn't need to know",
              "id": 166,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "Yeah, a lot of places in the world it’s used as supplemental nutrition where they may be lacking. Any place where there’s food insecurity (including parts of America!) kids get breastmilk well past the 2 mark.",
              "id": 167,
              "comments": [
                {
                  "score": 3,
                  "content": "And we are in a formula shortage!  Who in their right mind would want to pay the inflated price for formula if they are able to breastfeed?  And wife can certainly breastfeed around family.  The mother is a jerk, and being mean intentionally.",
                  "id": 168,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I desperately wanted to breastfeed but we had several issues that meant it didn’t work out. Luckily my daughter turned 1 just before the shortage turned critical, but there’s no universe I can imagine where I’d stop breastfeeding because someone was being an asshole about it. Far more likely I’d pop the baby off and squirt gun the complainer.",
                      "id": 169,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I believe the APA recommends 4 years, but I could be wrong. I'm still breastfeeding my 2 year old daughter.",
          "id": 170,
          "comments": [
            {
              "score": 2,
              "content": "I know WHO is world health Organization, what's apa PLS?",
              "id": 171,
              "comments": [
                {
                  "score": 2,
                  "content": "American Academy of Pediatrics",
                  "id": 172,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 301,
      "content": "She is feeding a baby, it's not something sexual and she was covered. Your dad didn't feel uncomfortable and confirmed that. \nNTA\nIt does sound like your mum is jealous of your wife though",
      "id": 173,
      "comments": [
        {
          "score": 263,
          "content": "It’s gross how it’s made to be sexual. I can’t take some people seriously, “oh my gosh it’s a boob! Jesus Christ”😐",
          "id": 174,
          "comments": [
            {
              "score": 74,
              "content": "Both you and your dad sound like sweethearts though!",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "NTA. Your dad patiently waited for her and baby to be settled and carried on the conversation. Good man. She was completely covered.",
              "id": 176,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Yeah. A friend had a twins and most of us (1 woman, 4 men) were absolutely fine with it and the one guy who had an issue was deeply apologetic, acknowledged it was a him-thing, he was just embarrassed, and stood just outside the room to continue chatting while babies were fed. When boobs were covered he came back in. \n\nWe didn't shame Mom for feeding but we ALSO didn't shame him for his feelings, and approved of him taking ownership of his own emotions & working out the compromise.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It's puritan religious culture at play. As progressive as society has become, it's the boomers at it with thier old fashion view",
              "id": 178,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 211,
      "content": "NTA. Your dad's reactions says it all. He knew she was being an asshole as well.",
      "id": 179,
      "comments": [
        {
          "score": 131,
          "content": "That’s usually the case",
          "id": 180,
          "comments": [
            {
              "score": 50,
              "content": "She's *usually* an asshole? What does your dad see in her? Wth...\n\nSidenote, good on you for defending someone who can't really defend themself. Your wife is lucky to have you.\n\nEdit, spelling.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 157,
      "content": "NTA and thank you, because you see so many posts in here about problems between MiL and DiL/wife and so often the son/husband just doesn't stand up for his wife when his mother is being a turd.",
      "id": 182,
      "comments": [
        {
          "score": 119,
          "content": "This!! I don’t know how people do that, it makes my blood boil",
          "id": 183,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 106,
      "content": "NTA and congratulations on how well you stood up for your wife and child!",
      "id": 184,
      "comments": [],
      "relation": "Support"
    }
  ]
}