{
  "post content": "My boyfriend (29M) and I (22F) recently decided to move in together. We’ve been together for 1.5 years. I am currently renting an apartment and he has a house that he bought just before we started dating.\n\nBefore moving in together, we thought it’d be best to discuss finances. He’s a doctor and I’m a social media manager. He told me how much he makes and it was more or less what I expected. When I told him how much I make, he kind of laughed and said I’m supposed to tell him how much I make per month, not per year. I told him no, that’s how much I make per month. His shock was understandable to me- I make 150% of his salary.\n\nI told him that it’s just because I work for a client in a country where the currency is nearly 20x stronger. If I had this same job in our country, I would only make a quarter of what he does.\n\nI don’t live an extravagant lifestyle so you wouldn’t be able to tell that I make as much money as I do by just looking at me. I still live in a small apartment that I got when I was making less than 20% of what I make now, and I never learned how to drive (I know, I know) so I don’t have a car and get around exclusively by e-hailing services.\n\nOnce the initial shock wore off, he said that’s great, because now I can pay half of his mortgage. \n\nI was a little taken aback by that. I mean, it’s not like I wasn’t going to contribute to the household at all. I would’ve been happy to buy groceries, pay utilities and cook and clean because my workload is MUCH lighter than his. I told him this and that I wouldn’t pay half his mortgage.\n\nHe retorted that since I make so much more than him that the least I could do is pay just half the mortgage and that we could go half on groceries and utilities.\n\nI told him that that’s a little unfair because if we break up, he gets a house and I’m left with nothing, and that if that’s going to be the case I would rather stay in my apartment.\n\nI offered up a compromise. His house is sparsely decorated to say the least. He has 2x 1 seat couches, a table that’s too big and a tv that’s too small. Oh, and a bed. He’s never really there, so I get it. I told him that I would furnish the entire house and get the groceries, cook and clean, and we’d go half on utilities. But he still insisted that I pay half of the mortgage.\n\nHe said that I still need a place to live, and that if I was going to be paying rent anyway, paying his mortgage would be the same thing. He said I’m being an A-hole for not wanting to pay it.\n\nMy boyfriend is a smart man so I don’t know if he doesn’t see the logic (or lack thereof in my opinion) of what he’s saying or if I’m being dumb and it’s not a big deal.\n\nAITA for not wanting to pay half of my boyfriend’s mortgage?\n\nNote: I would’ve been happy to pay half of his rent. It’s not about the money. It’s about the principle.\n\nEdit 1: I will come back to add more information when I have some time, but for now I will say that half the mortgage he wants me to pay is 3x my current rent.",
  "id": 1,
  "comments": [
    {
      "score": 5005,
      "content": "NTA Please continue to live on your own terms, but your own place or pay rent. Your boyfriend isn’t even interested in figuring out what your reasonable portion of rent would be. He just wants to cash in on your help. He sounds entitled.",
      "id": 2,
      "comments": [
        {
          "score": 1704,
          "content": "NTA the only way you pay half the mortgage is if you’re on the actual mortgage.",
          "id": 3,
          "comments": [
            {
              "score": 762,
              "content": "Most of the time half the mortgage is going to be below half the market rate of renting an equivalent space (even with escrow for property taxes factored in). If she doesn't want to live with him, she shouldn't pay. But if she's planning to move in, half the mortgage is probably a fair rental amount.",
              "id": 4,
              "comments": [
                {
                  "score": 238,
                  "content": "THIS!\n\nAlso, the fuck?\nSo, if your partner isn't on the lease, they don't pay half the rent?\n\nWhat kind of stupid nonsense.\n\nEdit; he gets money back.\nHe also assumes all liability and upkeep for the home. And, spoilers, she still gets a place to live in exchange for payment.\n\nWhen people say mortgage payment they usually mean escrow. Property tax is hundreds plus every month, insurance, and THEN the mortgage payment. Which, early on, pretty much only hits interest and not the principal. So, no, you don't just get the money back. You also lose 7% of the value paying both realtors when you sell. So, you can actually sell a house and have to write a check. People can literally be too poor to sell their homes.\n\nI don't think alot of these comments even understand the basic math behind renting or owning. The system we have currently is baaadd. That doesn't mean you should stiff your home owning partner because you don't understand how mortgages work. And, even if they do get some of that money back. Who. Cares. You lived there! Likely for much less than rent on your own. And, if YOURE so sure about the relationship, like you expect the home owner to be, who cares it'll be both your equity in the future.\n\nEntitlement and ignorance is off the fucking charts with some of you. The commenter below even says they don't pay rent! It's ridiculous af. Mommy and daddy paid your bills, and now you want wifey/hubby to.\n\nEdit; I'm well aware they said 3x. Without actual numbers that's meaningless. If you live in your mom's basement for 5 and want to move in with someone in an apartment that is 1,000. You don't get to go \"but that's more... :-(\". OP intentionally left that info out. They might be in a 200sqft apartment versus a 1800 sqft house with a third of an acre. We don't know, because she didn't share it. If the genders were reversed, most of you would be saying YTA. As a woman before I get called a neckbeard or some shit.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 403,
                      "content": "Uhm no, very much not the same. He will be getting the money back when he sells the house. Not the case with a lease.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "It's funny. A couple of months ago there was a similar post when the OP and homeowner was a female and the male bf didn't want to pay half the mortgage unless his name was on the deed too. At that post the bf was the AH but apparently here the roles have turned.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 7,
                      "content": "Thank you! She has a choice, she is not stuck. I was getting comments on my reply (I went with YTA) ... one actually said \"but she would be losing money.\" Like, yeah... what do they think paychecks are spent on?",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Assuming that half of the mortgage is less than shed pay in rent, I think OP actually is the AH. If shed pay 1000 in rent and his mortgage is 3000 all together and she'd have to buy a car, then yes, he's trying to gouge her. But if she's spending 1000 and the mortgage is 1600 and in a location that's suitable to her current lifestyle, OP is just being a scrouge. I absolutely don't understand people who EARN MORE THAN THEIR PARTNER and feel like they don't have to pay their way.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "AMEN!!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Actually op stated maybe in the edit or a comment just half the mortgage is actually 3x the current rent they pay which I understand is not an equivalent price for the space she'd get but it's a big lifestyle change to spend that much more monthly.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "These posts always drive me nuts. Of course she should pay half the mortgage. It's rent. She shouldn't have to pay HOA fees, property tax, repairs, etc. I did this with my husband before we got married. It's fine. I don't expect to live for free. I paid *rent* to him. If you have roommates they pay *rent*. The fact you're having sex shouldn't change that. Yes it made him my landlord I guess, but if your dude isn't an asshole he's not going to use that position to take advantage of you. If that's the case, you shouldn't be together anyway.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 32,
                      "content": "She should pay *rent*, but he needs to be careful to not call it his mortgage or else she could possibly sue to claim part of the value of his house down the line.\n\nShe should pay *rent*, and it should be defined as such, with the understanding that any home maintenance costs are not her responsibility.\n\nFrom what she said though he is asking her to pay triple what her current rent payment is now. I definitely wouldn't take on that deal, honestly.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "He wants her to pay 3x what she pays now - not cool",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "Considering there wouldn't be a lease. He can't take advantage like a landlord could! She can just leave and find a new place with no repercussions, unlike renting!",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "but if he didn't have that house would she be choosing to live in a place that size?  It sounds like her current rent is lower than half the mortgage?",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Came to say this? Who moves in and doesn't pay rent? Yes, it's hus mortgage. But you would be renting from him. And that means ANY repairs and such would be handled 100% by him as he is the homeowner. It's completely unreasonable to think you can move in with ANYONE and not have to pay rent. You are too focused on the fact that he owns the  house. Every rental is owned by someone! YTA you're wanting a handout.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Did you read where she said she would be more than happy to pay rent just not 3x her current rent????",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "She edited to say half his mortgage us 3x her current rent. I think the compromise would be giving him an amount equal to her current rent.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "I moved into my SO's house 2 years ago, been paying half of everything, including the mortgage and its still cheaper than a 1 bedroom apartment in New Englad at any decent spot.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 10,
                      "content": "OP says that paying half the mortgage would be three times her current rent.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yeah exactly one property my mortgage is 650/month( with property tax more like 800), Market rate for it as a rental in my area is 1250( currently rented at that and i could charge more im sure).\n\nYTA op",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "But the house is more space than she wants/needs, in an area she didn’t choose, with limitations on what she can do in or to it or how long she can live there. Not comparable to rent, where you get to determine all of that for yourself. She is HAPPY in her little apartment for minimal rent. The rent of a comparable place is not what she wants or she would have moved. \n\nI see this all the time in this sub - “you pay rent on a place you don’t own so why wouldn’t you pay “rent” in a house your partner owns?”  Well, a) because you are romantic partners, not landlord/tenants. B) because 90% of the time the partner who owns the home choses everything about it - it is what they want, in the area they want, what’s in it, and you are just along for the ride…until you break up. Much less stable than a lease; much less convenient than where you live already; and much harder to argue with your partner about upgrades and fixes than your landlord you don’t sleep with every night. And c) because often the mortgage is more than what they are paying in rent elsewhere. It is NEVER “just like renting.”  \n\nI am also a firm believer that it should never cost you MORE to live with someone. The “upside” of moving in together is supposed to be lower costs for both of you. My husband moved from a rent controlled “junior 1 bedroom” in the city to my 3 bedroom house in the suburbs. Half my mortgage would for sure be less than what he *would have paid* to rent a 3 bedroom house, BUT HE DIDNT WANT A 3 BEDROOM HOUSE. Why would he pay 1/2 of more house than he needed?  It would also be more than he was paying for his apartment, and it shouldn’t cost HIM MORE while costing ME LESS to live in a place he didn’t choose. Also at the time, his commute doubled moving in with me (so gas and bridge toll and time) - he would NEVER have *chosen* to live in the suburbs, but that was kind of a condition of moving in to my house, which again, seemed like a real dick move to add even more cost to his budget for the privilege of sharing a room with me in the inconvenient location of my choosing. \n\nHe actually offered to pay his former rent price to me, but i figured out that the costs of half the utilities for renting a drafty old house, plus groceries (I have more expensive tastes than him), and my cable package, and his new transportation costs was basically the same as his old monthly payments, and that was surely enough of a contribution. OP is NTA. There’s no upside for her in any of this, and it actually kind of seems like “punishment” for her making more.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I think paying a part of the mortgage as rent is an OK decision... As long as there is a rent contract. Otherwise, it will be gifting money to the partner without protection at all. At any given time the owner of the house can kick out OP and that would be a huge problem.\nI would go for NAH - both of them have a point, but an agreement good for both is possible.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "She said half the mortgage is 3x her current rent though. If one partner wanted to rent a super expensive place then the other partner would find a compromise. Right now, she isnt getting a choice in where the house is. So shes effectively paying for a much more expensive location where her boyfriend gets to keep the value/gets more value over time.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "If you rent a house do you think you’re only paying half of the mortgage? I’ve got news for you.",
              "id": 26,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "This is the dumbest thing I've ever read. \n\nIf he rented to a tenant, they'd be paying the mortgage for him. She's being asked to pay *half* that. Like, you know, anyone who rents a place with roommates. Just because he owns a house doesn't mean his girlfriend gets to stay there rent free. That's not how any of this works.\n\nIf someone wasn't willing to pay their fair share of living expenses, I'd be breaking up with them immediately. OP, YTA.",
              "id": 27,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "Why?  Half mortgage is far cheaper than actually fair rent even with a 25% discount.  \n\nWhy should one partner take on all the risk?  Equity really doesn't build fast at all and they have the freedom to walk away that the owner doesn't have.",
              "id": 28,
              "comments": [
                {
                  "score": 4,
                  "content": "She said its 3x what she is currently paying.",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "I lived with a roommate who owned the house. I paid rent, which contributed about half (I'm guessing) of her mortgage payment. When I moved out, of course she kept the house, because she owned it and purchased it. This situation is no different just because they are sleeping together.",
              "id": 30,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "That doesn’t make sense. My mortgage is $1500 rent in my area would be at least that. If I wasn’t married why wouldn’t my significant other pay $750 a month when they couldn’t get a cheaper place on their own?",
              "id": 31,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Not the mortgage, which just documents the debt. On the DEED, which will document joint ownership and protect OP’s financial investment in the house.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "This, unless you're buying a place together, and don't feel comfortable paying \"his\" mortgage. Just stay in a place on your own. I can imagine this resulting in a lot of resentment moving in together in this style.   \n\n\nIf you find a place to buy together, where BOTH your names would be on the deed, payments, all the legal jazz required. You're both contributing equally to the payments and sorting out house work and food etc after that.",
          "id": 33,
          "comments": [
            {
              "score": 5,
              "content": "Just have him file a quitclaim deed to move the title into his and hers jointly then she can pay half the mortgage and not have to worry she's paying for \"his\" house",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "I don’t understand how this is the top comment. She should pay rent. It’s fair to pay half and half. \n\nWhen I made 150% more than my bf I paid 60% of the rent and he paid 40% but neither of us owned the place so I don’t think that would be fair in this situation. But she still needs to pay rent or not move in. It sounds entitled af to assume you can live with your bf rent free.",
          "id": 35,
          "comments": [
            {
              "score": 41,
              "content": "Eh, they’ve been together less than 2 years, he’s nearly 30 and she’s 22. They aren’t paying rent—they’re paying a mortgage, which BF affords bc he is 7 years older than her (and they’re in their 20s, which are highly formative years. She’s behind in home ownership because she’s been in the real world less than half the time he has. If they were in their 30s it would even feel different.)\n\nShe’s being taken for a ride if she pays half a mortgage she isn’t on. If they find a place to rent together? Of course split. Because one party won’t be making bank upon the dissolution of the relationship.",
              "id": 36,
              "comments": [
                {
                  "score": 5,
                  "content": "Mortgage is less than rent \n\nIt’s entitled to think you can contribute $0 to housing, especially when you earn more then the parent\n\nNot saving splitting half is the answer, but $0 is very very very entitled mooch behavior",
                  "id": 37,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Mortgage can be less than rent. It wasn’t when I bought, and in this case it definitely isn’t. OP has much cheaper tastes in accommodation than her bf, and shouldn’t be expected to foot the bill for his much more expensive tastes while getting no equity.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "Half mortgage is a far better deal than what fair split would be.  \n\nDo none of yall know what house wear costs are?",
          "id": 39,
          "comments": [
            {
              "score": 29,
              "content": "Not when its 3x her current rent.",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "Yes - but she didn't pick this place.  If they were renting together she could say she was only comfortable spending X per month and could get something smaller or less fancy as a result.  Now she is stuck with whatever he picked out previously, even if it is way more than what she would choose to spend per month.  Even if she makes more money than him, it is fair for her not to want to pay 3x what she is paying now for the privilege of sharing his fancy house with him.  There needs to be some consideration for the fact that she got no say in the size or cost of the house.  He chose that place and that price with the idea he would be paying it alone, he can't expect her to want to subsidize his expensive taste just because she wants to live with her partner.",
              "id": 41,
              "comments": [
                {
                  "score": 4,
                  "content": "Yes, thank you. If she’s going to be on the hook for half of the expenses, she needs to have a say in their standard of living. She didn’t make the decision to buy the house, and on her own she’s been living much more cheaply.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "NTA. Looking at your edit, naahh, if you pay half the mortgage then you are on your plan to get on the mortgage, and you should have an attorney to help you figure out a fair term. If not, then nah. He should be offering the market rate of a roommate in his type of house. But also, seeing that he is charging you 3x the regular roommate rate without option of co-owning, I would review the relationship, put moving in on hold and live by myself, or instead look into buying your own house (if that is the city you see yourself living long-term in). If you’re gonna be together forever, putting off 1-3 years isn’t a big deal.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "THIS. There was no discussion of marriage in any of this so you moving in together is not a run-up to marriage. Even if it were, you shouldn't be paying into his mortgage (much less HALF!) until you two are married and you're protected.\n\nIf you want, you can pay him the amount of rent you were paying for yourself, assuming it's less than half his mortgage. Or you can find a lawyer, have him draw up some papers stating that you will get equity on bf's house for the amount of mortgage you pay off, and insist he sign them before you move in. Or just don't move in unless or until you two are ready for marriage. But his unreasonableness about this points to a fourth option: dump him and find a man more interested in an equitable relationship.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1425,
      "content": "NTA. \n\nI think what’s bugging you is that he made a declarative statement about you making half of his mortgage payment without asking you. That’s how I read it. \n\nEdit : thank you so much for the awards!",
      "id": 45,
      "comments": [
        {
          "score": 160,
          "content": "Agreed, I think he could’ve worded that way better and open the discussion as opposed to just flat out deciding.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "I think the issue here is he wants to live in a big, expensive (compared to her appartment) house and he wants her to subsidize his choice.  If they were picking out a new place together she could choose someplace more frugal - but he already chose this place that is more than she wants to spend a month.  She just wants to live with her partner, but he comes with this expensive house she didn't pick and doesn't want to pay for.  Even if she makes more she is allowed to say 'that is too expensive for me, I would rather stay in my appartment and put that money in my savings'.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "I think I'm with you on this. I would consider it reasonable to go half on rent/mortgage, but saying \"you should/will\" instead of \"would you be willing to?\" is really shitty.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 881,
      "content": "NTA\n\nYikes. He is demanding you pay for his house and you guys are only 1.5 years into dating? It sounds a bit like his ego was hurt after learning how much you make and his retaliation is trying to guilt you into this.\n\nDon’t do it.\n\nPay for utilities / monthly mortgage, etc., but do not give him any sway over using all your money as benefit to him and only him.",
      "id": 49,
      "comments": [
        {
          "score": 145,
          "content": "Re read the post again, ops bf is asking for half the mortgage as rent",
          "id": 50,
          "comments": [
            {
              "score": 527,
              "content": "Which is 3x her current rent, and comes with no contract or lease to protect her interests. If she pays half his mortgage, he can wake up any day and say \"get out\" and she is simply out all that money that he didn't have to pay for his house. And you can say it's the same as rent all you want but it's not. When you rent your lease says the landlord is responsible for x things, and you're entitled to love there for x amount of time, and your landlord is never going to promise to do the dishes and then leave them for you to do anyway. \n\nI'm not saying her bf would do the last thing, but it's just an example of how much different it is to pay rent than pay on someone else's mortgage.",
              "id": 51,
              "comments": [
                {
                  "score": 34,
                  "content": "[deleted]",
                  "id": 52,
                  "comments": [
                    {
                      "score": 108,
                      "content": "There's literally nothing stopping him from giving her an eviction notice the day the mortgage is paid and sending her off on her way. And she is simply out every thing she put into the mortgage and home. \n\nWhen you rent, you know exactly where you stand. You're paying to stay here for a time. A specific contracted time. You have to fuck up for them to evict you. Not OPs boyfriend. He can just evict her. \n\nNot to mention, when you rent you choose. You choose the place, price, area, etc. that works for you within your budget. OP is not getting any choices here. Dudes place isn't even fully furnished. OP suggested she pay all groceries and utilities, and furnishes it which he gets to keep if they break up.",
                      "id": 53,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Tbf, OP doesn’t specify where they live. There’s no way to know what landlord-tenant laws or protections there are or aren’t in their country/state/etc.",
                      "id": 54,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "I don’t get you freaking people. That’s how rent works.\n\nIf she’d rather live alone then pay the rent then that’s her choice. But it’s not unreasonable to expect half and half. Regardless of how the work load is split. I’m imagining if she didn’t clean he wouldn’t clean it, either. So that’s something she’s doing that only she sees value in.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 5,
                      "content": "There's got to be a name for this logical fallacy. The idea that you have actually lost just because somebody else gained and you didn't. When in reality you're in the same position you would be had they not gained. \n\nAll the people saying that's not fair he gets to keep the equity she paid into the house. Yeah  So would your landlord if you rented.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 38,
          "content": "I so agree and think it's time to stop and do some research before doing anything. OP should look at cohabitation agreements and discuss the points with your partner. \n\nDon't move in or forward before you agree.\n\nHere is a look to lots of templates. (They are found spesific for your country if you search online if not in three US). \n\nhttps://templatelab.com/cohabitation-agreement/\n\nhttps://www.loveisrespect.org/quiz/is-your-relationship-healthy/",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "I would strongly disagree.. If it was a rental half everything is 100% fair, right? Right. But since he just happens to own, he shouldn't expect to split? She is still getting a home, and more space (assuming the house is bigger than the apartment which is not a big leap).\nI do think the way about this could have been better, but if they were going to move in anyway, why spend 1000's more that isnt needed? It is stupid.",
          "id": 58,
          "comments": [
            {
              "score": 61,
              "content": "Her current rental doesn't cost as much as his mortgage.\n\nAlso, they do need furniture according to her. It's not like she'd choose to put more than her current rent money into paying down his mortgage if she's overpaying to live in a badly-furnished home.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "It seems like part of the core issue though is that she would lose her tenant protections. If she pays off the mortgage there is nothing to stop him from kicking her out and she is now out a home and all the excess money she spent on the place. He benefits from her paying the mortgage too much to honestly expect he can just declare what she will do with her money",
              "id": 60,
              "comments": [
                {
                  "score": 19,
                  "content": "I think OP needs to think whether the extra living costs is worth it or whether it would hinder her from reaching her financial goals (e.g. home ownership, starting one's own business etc.). Think about how much she's willing to spend on rent and compare it with boyfriend's offer and the market rates.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yup this. Just cos she can take the financial hit of tripling her rent now, doesn't mean it's a wise choice for her or one she's confortable with. Maybe the work with this client dries up and she suddenly earns a lot less. Maybe she just wants to save up so she can purchase her own place too. The boyfriend is a bit of an asshole to assume that she would be willing to triple her rent to live with him.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Sign a lease if it makes her feel better. Or don't, since most of those protections convey by default if she's there for like a month.\n\nThere's no difference between her paying a landlord's mortgage or her BF's.",
                  "id": 63,
                  "comments": [
                    {
                      "score": 2,
                      "content": "There is a huge difference! The simplest one is the cost difference between the two. The next big difference is the loss of protections she has. You claim “most of those protections stick if she is there for a month”. Well “most” isn’t “all” so that’s also a huge difference. And the worst difference of them all is that he can still kick her out at the end and she would have nothing whereas she would have been entitled to her deposit from a landlord.",
                      "id": 64,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "That's such a BS argument. She would be renting from him. He can't just kick her out.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yes, he could. She would have some minor protections but nothing at all like she would have with a landlord. And let's be honest here, if he wants to kick her out of the house it's also a loss of a relationship. Being forced to choose between living with the person who just broke up with you and immediately leave is a shitty choice that she would have no chance of facing if she kept to her current living situation.\n\nAnd all of that isn't even mentioning the fact that he is benefitting to having the house in his name. That's a benefit she isn't receiving so their split should reflect that unfair advantage he is receiving.\n\nShe says she is fine with paying something similar to her current rent, but he demanded she pay 3x her current rate without even trying to discuss it with her. That alone should make him the AH.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I mean it is money that she would have spent on renting anyway.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 523,
      "content": "NTA - do not pay the mortgage as long as your name isn’t on the deed.\n\nSo how would this have gone if you earned a lot less then him?\nWould he still have expected you to pay half of his mortgage?\n\nSorry to say but it seems he got $$-signs in his eyes the moment he learned that you are well off.\n\nPlease don’t let him take advantage of you just because you are in love.",
      "id": 68,
      "comments": [
        {
          "score": 93,
          "content": "Exactly. If he wants you to pay half the mortgage, then your name gets added to the deed, and you and he each get the percentage of the sale price back as you put into paying off the mortgage. \n\nOtherwise he walks away with all the equity you put into it. \n\nNTA. But since he’s being super possessive just buy your own house. Egomaniacs aren’t worth the hassle.",
          "id": 69,
          "comments": [
            {
              "score": 31,
              "content": "Yes, that’s exactly what will happen if she rents too. If she wants a house she should buy one or offer to pay their partner half of what’s already been put into the house\n\nI don’t understand why so many people on this sub think it’s wrong to pay rent to their partner and think they should get to live rent free",
              "id": 70,
              "comments": [
                {
                  "score": 8,
                  "content": "Right!? I also can’t believe that so many people are saying that she should not pay toward the mortgage, as if it’s any different than rent. People would lose their minds if told them my boyfriend pays 100% of my mortgage ($500) and I also contribute 100% ($500). Thing is, $500 is a STEAL for rent or a mortgage in the US, so he’s still paying below market rental rates for our LCOL area. \n\nIt not the principle of paying toward a mortgage to a place that’s not in your name, it’s the amount relative to what she’s comfortable with. I see her edit that half the mortgage is 3x her rent now, and she’s not comfortable with spending that much on her housing costs.\n\nTHAT is the issue.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "That’s not quite what they’re saying. \n\nHe’s saying he wants her to pay half the mortgage. That’s different to paying rent. \n\nThe people on this sub are saying that if he wants her to pay half of his mortgage then she needs protection so that if they break up she hasn’t lost her money. Say if they broke up after 5 years. \n\nThere’s two ways of doing that. You can either buy them out for half the value of what they’ve already put in, possibly pro-rating it as a percentage of the original value and the current value of the house. Or you can add them to to the mortgage straight off and then she would eventually get a percentage of the value based on her contributions excluding the value he originally put in. \n\nPaying half of someone’s mortgage =/= paying rent. If he wants her to pay rent instead that’s a separate discussion.",
                  "id": 72,
                  "comments": [
                    {
                      "score": 5,
                      "content": " It really isn’t though since rent and mortgage payments for similar properties tend to be similar\n\nI get what they’re saying but that doesn’t explain WHY she should get a free ride just because she’s dating someone with a home. It’s not normal to effectively promise your girlfriend a severance package to break up with you. \n\nShe hasn’t offered to match what her partner put in at any point so not sure why we’re pretending OP would do that. And I’m not sure you understand how house ownership works\n\nAs I said before and most housing experts will tell you, from her wallets view, it’s effectively the same. She’s just trying to take advantage of her partner",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "What's the difference",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "How is her paying him rent Any different than paying her landlord rent?  I don't understand.  Her landlord isn't giving her stock in the apartment.",
          "id": 75,
          "comments": [
            {
              "score": 104,
              "content": "Because the mortgage is 3x her rent.",
              "id": 76,
              "comments": [
                {
                  "score": 11,
                  "content": "Where are people pulling this figure?",
                  "id": 77,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Op said it in a comment https://www.reddit.com/r/AmItheAsshole/comments/sdesj4/aita_for_refusing_to_pay_half_of_my_boyfriends/hucdk20/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "Maybe it’s 3X her rent because it’s a house and it’s nicer? She could not move in if she can’t afford the rent at her bfs",
                  "id": 79,
                  "comments": [
                    {
                      "score": 26,
                      "content": "She can afford it, considering she makes more than the BF. But considering she was willing to live in a tiny apartment before this, it is clear her first preference would not be such a large house. That was only chosen because the BF owns the place already. Considering her previous lifestyle, if they were both moving into a new rental place together, it would probably just be a larger apartment, which 50% rent would be much cheaper than the house \"rent\".",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 75,
              "content": "Because she doesn't have the option to find someplace smaller/cheaper to live with him.  I don't disagree that she could pay something in rent, but it sounds like she wants to live modestly and save rather than pay rent for a luxury place.  He is putting her in a position where she has to choose her savings or him.",
              "id": 81,
              "comments": [
                {
                  "score": 5,
                  "content": "She doesn’t have to live with him, no one is making her!!",
                  "id": 82,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Because when you’re paying a landlord you have a legal agreement that you will have a place to live. You have a guarantee of secure shelter. Paying into your boyfriend’s equity though? That’s a different story. This relationship could end at a moments notice and she would have no where to go, and much less money.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 330,
      "content": "NTA but if I could offer a compromise you might like if you really want to proceed with living together...\n\nMake up a contract (get it notarized or whatever necessary to legitimize it,) that states if you help pay down his mortgage and should you two break up he has to buy you out for all the months you helped pay that loan of his down... If you get married he signs you into the mortgage so you're protected in case of divorce\n\nThat way he doesn't feel like you're getting a free place to stay while earning a sufficiently larger salary but you can feel assured that you havent been taken advantage of financially if things were to end \n\nLemme know if you see this OP and best of luck",
      "id": 84,
      "comments": [
        {
          "score": 142,
          "content": "Good idea. Heeding your advice, thank you!",
          "id": 85,
          "comments": [
            {
              "score": 124,
              "content": "That sounds fair. If he still won’t agree to that that means he’s just trying to mooch off you until he ends the relationship.",
              "id": 86,
              "comments": [
                {
                  "score": 14,
                  "content": "Precisely",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "What makes it fair to him",
                  "id": 88,
                  "comments": [
                    {
                      "score": 5,
                      "content": "The fact that she would be paying half of the expenses anyways? They had an arrangement planned before he realized he could profit off his girlfriend.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "But how is she not mooching of him if she lives there 2 years then move out. Take all what she paid back and as a result she didn't pay rent for 2 years?\n\nIn this suggestion the girl should get back some % of what she paid so no one is actually mooching of the other.",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Also - even if this sounds creepy - life insurance on him so that if he passes away before you're married, and the house goes to his family, you get something back. My partner and I did this on a house I owned that I wanted to stay with my family but we wanted him to recoup anything he put into the place in repairs/renovations/maintenance/etc. Also so that even if my family acted like dicks over my estate/will he could land on his feet ¯\\\\\\_(ツ)_/¯",
              "id": 91,
              "comments": [
                {
                  "score": 2,
                  "content": "What does the bf get out of this?",
                  "id": 92,
                  "comments": [
                    {
                      "score": 2,
                      "content": ">What does the bf get out of this?\n\nWhat does OP's bf get out of a life insurance policy on him where his gf is beneficiary if he dies? Nothing - because he's dead ¯\\\\\\_(ツ)_/¯ But while he's alive he gets peace of mind knowing that a person he loves will be left financially secure if he dies while he can leave the house to anyone else too. There's more than one way to skin a cat. Or did you mean what did my bf get from this? He knew that he'd be financially recompensed for his contributions and the house's future appreciation even if he didn't inherit the house itself, and he'd be financially ok immediately since life insurance to a named beneficiary pays out outside of probate/Wills/estates.",
                      "id": 93,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "OP:\n\nwhat happens when you lose the client and end up making 25% of what he makes?",
              "id": 94,
              "comments": [
                {
                  "score": 58,
                  "content": "My thought exactly.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Honestly you should be careful about making huge changes that will drain your saving/financial resources when you have a less predictable career. You should be living well under your means to save for a rainy day. I know your boyfriend has a reliable career but youre relationship is still new and you’re still quite young. If you were moving in after marriage, youd get some protection. So you need to think long term. What if he wants to break up and youre now down to making 25% of what youd made or even change career? He’ll still have an expensive house you paid 3x your current rent for (and took care of). \n\nIf you move in with him, id pay a reasonable rent and figure out how the housework piece is going to work. If you want to refurbish the place, make an agreement. You have to always plan for the worst case scenario. Youre dating right now. So protect yourself. Youll have to compromise but think long term.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 25,
              "content": "If you do this, go through an actual lawyer for this.  It's worth the cost.\n\nPersonally, his attitude bothered me right from the start when he belittled you and then demanded to cash in on your success.  I don't think he respects you.",
              "id": 97,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "You need a lawyer to draft that up. It’ll be very hard to enforce.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I would say the same but minus your current rent for however much time passes if you split because otherwise it would be the same as living rent free if you got all the money back imo",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "If you do pay half  is he gonna do half the cooking, cleaning and house work?",
              "id": 100,
              "comments": [
                {
                  "score": 2,
                  "content": "He does all of it now at his place.",
                  "id": 101,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "I don't understand why more people aren't suggesting that he write up a contract. If it were me, I'd determine the fair market value of renting her share of the space, write up a lease, and treat this aspect like a business relationship. The boyfriend should be on the hook for all repairs and expenses since he owns the house, the girlfriend is essentially paying him rent, and they split utilities and groceries based on individual usage. I don't think he should have to buy her out--she doesn't just get to live for free because she's dating a guy with a house. But the amount she pays shouldn't be \"half the mortgage\", it should be the fair market value of renting a comparable space from a different landlord.",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Wouldn't that mean, if they broke up, that OP would basically have gotten a free place to stay for however long they dated?  That doesn't seem fair to the SO either.",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Honestly, althought that sounds like a fair compromise I'm VERY concerned that he just automatically assumed that she should and would pay half the mortgage without even asking her. \n\nI don't know, that along with the age difference gives me bad vibes on the situation. I just hope she protects her future and financial health.",
          "id": 104,
          "comments": [
            {
              "score": 3,
              "content": "How is that fair at all? She can just break up at anytime and get all her 'rent' back? She could live there for 3 years, break up, and essentially have never paid a dime in rent.",
              "id": 105,
              "comments": [
                {
                  "score": 2,
                  "content": "Well, no.  She’s also getting all that free sex from him, don’t forget.  \n\n/sarcasm",
                  "id": 106,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "so she would of been living rent free? I know its unpopular but that's what it means. there isn't a right answer that will fit all. what if they both were paying the same amount as mortgage for rent then split up \n\nyou could offer to pay 1/2 the interest ?\n\nsee how much rent would be for a place like that and go from there? \n\nyou don't have to move in as well you can rent. \n\na lot depends on what future you see with your bf. like is this the person you see marrying and getting old with\n\ndon't think YTA/NTA applies",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Why would he sign this",
          "id": 108,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "I would say if things end he should be obligated to pay her back the difference between her monthly mortgage contribution and what she currently pays in rent (not refund her total share towards “rent” just like you don’t get the money back if you stop renting an apartment). 🤷🏻‍♂️\n\nOverall, few like he’s an AH for assuming she owes more to him than a fair share and she’s an AH for trying base her share entirely on equity rather than what her costs would be regardless of the relationship. 🤷🏻‍♂️",
          "id": 109,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 199,
      "content": "NTA, strictly speaking because he’s treating you as a tenant and not a significant other. Plus you said the mortgage is 3X your current rent. Because you don’t want to pay that (which is understandable) you offered to stay at your own apartment or move in and furnish/pay utilities/groceries, which is a fair trade. He’s looking to use you because of how much you’re making. Stand your ground.",
      "id": 110,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 148,
      "content": "ESH.  You boyfriend is acting at least mildly entitled by immediately saying that you should pay half his mortgage.  It sounds a bit presumptuous and greedy, to be honest.  Almost as if he is grabbing at your salary now that he knows how much you make.  \n\nHowever ... I don't like your attitude either.  I'd you move into a house that he owns then you should pay SOMETHINGA for the space.  That amount might be a few hundred dollars.  It might be half the mortgage.  It might be the whole mortgage.  The amount doesn't matter so much as the fact that the two of you need to arrive at a number that is mutually agreeable for the two of you and does not beggar either one of you.\n\nPersonally, I think half of the monthly mortgage payment is fair.  But that is only my opinion.  The important thing is that it needs to be an amount the two of you agree on.  \n\nOveralls the two of you need to stop thinking of yourselves and each other as piggy banks and start thinking of yourselves as a team.  Otherwise, cohabitation is not going to work well.",
      "id": 111,
      "comments": [
        {
          "score": 115,
          "content": "It’s 3x what her rent is. So he would be saving a shit ton every month (half the mortgage and utilities, some will go up a bit but not double) and her expenses would be going up by a lot. Exactly how is that fair?",
          "id": 112,
          "comments": [
            {
              "score": 76,
              "content": "That is a bit of a false comparison.   Being one of two residents of a house is a completely different animal from being the sole resident of an apartment.  \n\nThe proper comparison isn't with her current rent, but rather whether she receives reasonable value for the amount of rent she pays her boyfriend each month.  The best yardstick for this, I think, is to examine the rental rates for houses in the area that are similar to the boyfriend's.  If the amount he seeks (half of his mortgage) vastly exceeds half the rent on similar houses, then OP would not be receiving a good deal.",
              "id": 113,
              "comments": [
                {
                  "score": 76,
                  "content": ">The proper comparison isn't with her current rent, but rather whether she receives reasonable value for the amount of rent she pays her boyfriend each month\n\nBut the increase of value isn't something she finds valueble, so that ain't a proper comparisson either. \n\n\nShe would be paying more, A LOT MORE, for something that's not important to her, that she doesn't want. \n\n\nLike, if I want to buy a diamond necklace for 2K and my boyfriend buys one for me and I just need to pay half of it back, then I saved 1K. But if I don't want a diamond necklace and he does that, then it's costing me 1K.\n\n\nIn the first scenario I'm very happy and in the second one I'm fucking pissed off.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 24,
                      "content": "The comparison is valid.  what's not proper about it?  \nIf she doesn't see the value then she can decide to not move in.\n\n>She would be paying more, A LOT MORE, for something that's not important to her, that she doesn't want.\n\nExcept it is important, and it is something she wants...or at least did in the beginning.  They discussed moving in together...that's an important discussion to have.  And if after going over her expenses, weighing pros and cons she no longer wants to move in then fine.  \nBut if she's not paying half or close to half the market rate for rent then she would be low-balling him, thus the better decision would be to stay where she is comfortable at and at a rate she is comfortable with.\n\nit's more like you and ur bf discuss getting a $2K diamond and splitting the cost 50/50, but then(before committing) u no longer think it's worth the $2k.  Just because it's not worth $2k to u doesn't mean it isn't a $2k diamond.  It simply means u don't go 50/50 and instead buy a different necklace at ur price point.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "Except she lives an extremely modest life currently to put herself into a better financial position in the future.  And he's demanding that she go 50/50 to assist him in paying down on an asset she didn't want, doesn't need, doesn't benefit from in the long run, and undermines her ability to meet her own long term goals.  I agree contributing to housing costs makes sense but demanding they split 50/50 benefits only him. Telling me I have to pay for a 'benefit' I don't want or value isn't actually a benefit.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 22,
                      "content": "My analysis is premised in the idea she wants to move in with him and share the home.  A higher rent goes with having a larger home.  The answer in this scenario is not to stamp the feet and complain the new rent exceeds the precious rent, but to negotiate a rate that is fair to both.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "They’re moving in together after a 1.5 years a house is a good asset for a possible marriage",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": ">.   Being one of two residents of a house is a completely different animal from being the sole resident of an apartment\n\nlegally speaking she would be a boarder. It's still his house, he's still the landlord. He has all the say at half the price. This is all good for him and all bad for her",
                  "id": 119,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Yea one is a little apartment and the other is a house. You wouldn’t say your landlord who you’re renting a bigger house from is ripping you off because your last smaller apartment was cheaper.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Honestly what I got from it is that since her bf works long hours, he’s probably not gonna do any of the household chores once she’s living with him. Therefore she’s actually making a pretty fair compromise imo as she offers to pay for the groceries and utilities while also taking on the household chores as she works less. I think it’s a pretty fair compromise. Pretty sure if they went half on everything, she’d still the the one doing 100% of the household duties as he’ll claim she works less hours.",
          "id": 121,
          "comments": [
            {
              "score": 6,
              "content": "It is a fair compromise. Getting your house cleaned isnt free.",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": ">you should pay SOMETHINGA for the space.\n\ndid you read the actual post?",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "She's not trying to get in without paying anything - she offered to furnish the nearly empty house (that's potentially thousands of dollars right there), plus utilities, groceries, and doing the cleaning and cooking. His demands would have her paying 3X more - and him paying HALF. So her expenses increase threefold, and his are cut in half - how is that a fair trade off at all? Would you still think it fair if your monthly expenses tripled while your partner's dropped by half?",
          "id": 124,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 109,
      "content": "YTA.\n\nAnywhere you rent, you’re going to be paying someone else’s mortgage. If you move in with your boyfriend, you should be paying market rent for that area. Your bf will technically be your landlord. So refusing to pay rent if you move in makes you an AH. You should be expected to pay rent, half of utilities, and half of groceries but not pay for any house maintenance or repairs. Just like a renter.\n\nIf you get married, then you should refinance the mortgage together and get both your names on the deed.\n\nHowever if paying half the mortgage is out of your comfortable price range then NAH for not wanting to move in.",
      "id": 125,
      "comments": [
        {
          "score": 57,
          "content": "She said that half the mortgage is 3x what she currently pays on rent, then utilities and groceries on top.",
          "id": 126,
          "comments": [
            {
              "score": 37,
              "content": "Renting houses costs more than renting an apartment.",
              "id": 127,
              "comments": [
                {
                  "score": 52,
                  "content": "It sounds like she would be happier staying in her apartment then, if he really wants her there he can compromise",
                  "id": 128,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Right, which is why she chose to live in an apartment and is willing to stay in the apartment to save money?",
                  "id": 129,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Which is fine; but if she moves into a house, paying fair rent is expected",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Not necessarily. I rented an apartment last year for over 1k/month, then purchased a home that was over 4 times the size of the apartment and my monthly mortgage is about $150 less.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Please re-read my comment.",
                      "id": 132,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "then she can decide to not move in, perfectly acceptable and NTA.  But she shouldn't expect to not pay rent, or for bf to charge her 3x's less than market rate just because that was her previous expense.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Then she shouldn’t move in if it’s too expensive for her",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "She also said in same comment she doesn’t want to pay any sort of rent. Makes her the TA.",
              "id": 135,
              "comments": [
                {
                  "score": 2,
                  "content": "[deleted]",
                  "id": 136,
                  "comments": [
                    {
                      "score": 2,
                      "content": "And that makes her and even bigger AH. I hope her BF dumps her. I wish I could show him this sub.",
                      "id": 137,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "This is 1000% the correct answer. There's nothing magical or special about home equity. It's not even generally the best asset you could get for the money (although since you can buy it with leverage and some countries give tax breaks that offsets things a bit.) One way or another you're paying rent (keep in mind you could \\*both\\* move out of the apartment and rent it to someone else.) \n\nSo there is no principle to stand on here. OP and her BF should decide on what financial arrangement makes them comfortable with the move in or if they can't find one don't move in. It's reasonable for her to pay something for rent, but there's not necessarily any reason it should be market rate if she wouldn't have wanted to pay market rate absent the BF's decision to live there. There is ultimately no principled correct way to split the costs, it's simply a joint decision to navigate. I will say that if you guys can't find a way to navigate this, which is a relatively simple financial situation, in a way that makes you both happy that's not a good sign for the long-term.\n\nNAH (but again wrong on the matter of principle)",
          "id": 138,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 97,
      "content": "NTA.  Like you said, only he gets the house if you break up.  You should contribute something if you are living there, but not half the mortgage.",
      "id": 139,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 75,
      "content": "It sounds like your bf is trying to get out of paying half the mortgage. He bought the house before you started dating. I say your compromise was pretty fair. You two are partners, not landlord/tenant. It also seems like his fragileness got the best of him, and that he can't handle a woman making more than him. You're absolutely right in saying that if you guys broke up, then you'd be left with nothing. If you're going to be paying half the mortgage, then you should have him add your name to the title.\n\nNTA",
      "id": 140,
      "comments": [
        {
          "score": 29,
          "content": "No, they’re unmarried so legally they are not partners—they’re roommates, or landlord/tenant depending on their living situation.",
          "id": 141,
          "comments": [
            {
              "score": 20,
              "content": "By partners I meant bf and gf, not domestic partners. You're right, they're not legally partners. I should've been more clear when I said that. Thanks for pointing that out.",
              "id": 142,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "What a horrible take.",
              "id": 143,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    }
  ]
}