{
  "post content": "I (26F) have an older brother (27M) who's been dating another guy (30M) for around 4 years. I don't have any issue with my brother being gay, but I have one with him wearing a wedding ring in order to pretend that he's married to him. You see, we live in a country where gay marriage still isn't allowed (Romania), but despite this, my brother and his boyfriend started wearing weddings rings recently. When I asked my brother about it, he told me that despite not being able to do it legally, they already consider themselves married spiritually and they're hoping that one day gay marriages will be allowed to do legally as well, either by leaving the country or waiting till gay marriages are made legal here as well. While I think this nice, I told him that they shouldn't be wearing wedding rings till they actually get officially married, as I think it's kind of distasteful. He told me that they're just a symbol of their love and that they're not hurting anyone by wearing them, but I disagreed, they're actively misleading people into thinking that they're actually married and frankly just making a mockery out of marriage. \n\nMy brother told me that he doesn't care what other people, including me, think about them wearing wedding rings and maybe they should just mind their own business, then left furiously. Not gonna lie, I think his comment here was kind of out of line, as all I did was to give my opinion on people wearing wedding rings when they're actually married yet and he seemed to take it personally. His boyfriend also contacted me later and told me that their romantic lives doesn't concern me and to stay out of it.\n\nAITA ?",
  "id": 1,
  "comments": [
    {
      "score": 49971,
      "content": "[removed]",
      "id": 2,
      "comments": [
        {
          "score": 16586,
          "content": "But they said they weren’t homophobic lol",
          "id": 3,
          "comments": [
            {
              "score": 5831,
              "content": "You’re gonna miss at least 500 upvotes for not including the /s\n\nEdit: And I gained them because of it",
              "id": 4,
              "comments": [
                {
                  "score": 1420,
                  "content": "I want to lock you at 500 for poetic reasons",
                  "id": 5,
                  "comments": [
                    {
                      "score": 500,
                      "content": "And I would lock 500 upvotes and iiiIIII would lock 500 more",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 87,
                  "content": "[removed]",
                  "id": 7,
                  "comments": [
                    {
                      "score": 15,
                      "content": "bad bot",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "The above comment was stolen from [this one](http://np.reddit.com/r/AmItheAsshole/comments/ua4jbp/aita_for_telling_my_brother_and_his_boyfriend_to/i5ve7ck/) elsewhere in this comment section.\n\nIt is probably not a coincidence; here is some more evidence against this user:\n\nPlagiarized | Original\n-------- | -----------\n[Lol “it’s just a wedding...](http://np.reddit.com/r/AmItheAsshole/comments/ua61ks/wibta_if_i_remove_the_in_sickness_part_from_my/i5w4usz/) | [Lol “it’s just a wedding...](http://np.reddit.com/r/AmItheAsshole/comments/ua61ks/wibta_if_i_remove_the_in_sickness_part_from_my/i5votgu/)\n[Bit embarassing taking 16...](http://np.reddit.com/r/soccer/comments/ua40dc/goal_cristiano_ronaldo_is_the_first_player_to/i5w53s1/) | [Bit embarassing taking 16...](http://np.reddit.com/r/soccer/comments/ua40dc/goal_cristiano_ronaldo_is_the_first_player_to/i5vawa7/)\n[Maguire definitely somewh...](http://np.reddit.com/r/soccer/comments/ua3gdd/arsenal_1_0_manchester_united_nuno_tavares_3/i5w51j9/) | [Maguire definitely somewh...](http://np.reddit.com/r/soccer/comments/ua3gdd/arsenal_1_0_manchester_united_nuno_tavares_3/i5v7eoy/)\n[Damn bro what you doing o...](http://np.reddit.com/r/shitposting/comments/ua1sdb/damn/i5w4jy6/) | [Damn bro what you doing o...](http://np.reddit.com/r/shitposting/comments/ua1sdb/damn/i5v5jv2/)\n[You should say, \"God Bles...](http://np.reddit.com/r/shitposting/comments/ua39ft/amen/i5w4fwx/) | [You should say, \"God Bles...](http://np.reddit.com/r/shitposting/comments/ua39ft/amen/i5w26nb/)\n\nbeep boop, I'm a bot -|:] It is this bot's opinion that  [/u/MaxineDavisb](https://np.reddit.com/u/MaxineDavisb/) should be banned for karma manipulation. Don't feel bad, they are probably a bot too.\n\nConfused? Read the [FAQ](https://www.reddit.com/user/reply-guy-bot/comments/n9fpva/faq/?plagiarist=MaxineDavisb) for info on how I work and why I exist.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1087,
              "content": "They are though, that's what the 'nice' homophobes say",
              "id": 10,
              "comments": [
                {
                  "score": 1197,
                  "content": "Exactly, or they say \"I'm not homophobic, I don't care what they do behind their closed doors, just not out in the street in my face and in front of MY CHILDREN.\"\n\nThat kind of homophobic.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 82,
                      "content": "I think those are called NIMBY - not in my back yard",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 172,
                  "content": "P sure this is sarcasm",
                  "id": 13,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 29,
              "content": "And \"wow how could he take it ~personally~\" like OP WAS talking abt his personal life??",
              "id": 14,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "She forgot to seal it though by including \"no offence\" at the start or finish of the sentence.",
              "id": 15,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "This whole thing reminded of this guy who posts stuff about racial equality and always gets accused by white people on how he's doing reverse-racism or whatever\n\nRecently he responded like: \" How can I be a racist when I have a **white** fridge??! Hmm? HMMM??!!\" \n\nlmfao",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Funny thing about Eastern European politics, most of the anti-LGBT people weren't particularly homophobic until recently. It's just that right wing nationalism ushers in a bunch of \"traditional values\" so the entire region has moved backwards on civil rights.",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "\"I'm not homophobic but, ...\"  \n\"I'm not transphobic but, ...\"  \n\nI'm sorry, but yes you are.",
              "id": 18,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "They can’t be homophobic, they have a gay brother! /s",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "You know what makes a mockery of marriage? Straight people who have kids and get married too fast, fuck up the kids and then decide to get divorced and remarried and divorced multiple times.",
              "id": 20,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 2705,
          "content": "[removed]",
          "id": 21,
          "comments": [
            {
              "score": 2616,
              "content": "You know, that's kind of accurate. Fellow Romanian here (moved out of the country years ago), while it's a beautiful country and I love and miss my family, it's also full of bigoted, judgemental, religious nuts who's backwards thinking leaves no room for progress. Pretty much the bible belt of Europe. Sad and disappointing to see that young people like her are not more open minded. Some things never change. YTA op, mind your own business and if you can't be supportive of your brother, keep yourself and your homophobia away from him.",
              "id": 22,
              "comments": [
                {
                  "score": 1525,
                  "content": "Yep. I have a family member that's gay. Been with their partner for somewhere around 30 years. They had a commitment ceremony because gay marriage wasn't acknowledged at the time. I WOULD NEVER TELL THEM THEY WEREN'T MARRIED!!! I would imagine they've been together longer than most straight couples here.\nWhy would you even make a comment about a piece of jewelry? Women here have worn gold bands for years...on their ring finger, thumb, pinky... it's a fashion thing with them.\nApologize. Today.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 1151,
                      "content": "I used to wear an engagement/wedding ring on purpose to stop creepers from hitting on me at work. It worked 99% of the time. Nothing else did. Is that making a mockery of marriage? If so, I’m not sorry. \n\nYTA.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 384,
                      "content": "This. I would argue that couples that get married and are miserable the whole time and constantly hurt each other are much more of a mockery to marriage than two people that love and are truly committed to each other.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 20,
                      "content": "Right? You know what's a mockery of marriage? The post someone made here today on AITA saying they wanted to leave out the \"in sickness\" part of their wedding vows and are *shocked Pikachu face* that their fiance is upset about that.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "I've only been to Romania once, on business, but I'll add that the bigotry goes way beyond the religious people. A former co-worker referred to the Romani as \"vermin\". Out loud.\n\nYTA, OP. We can cut you some slack because you clearly weren't raised right, but you have got to make some changes. While you're at it, consider worrying a little less about \"marriage\" and spare a thought for your brother's safety.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "The EU is not some progressive monolith, not even its western 'liberal' members.\n\nFuck OP, though.",
              "id": 28,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "There's an absolute cultural chasm in Europe between East and West. If you find maps of surveys where people are asked their attitudes to various social issues, former Soviet bloc countries are always reactionary and, well, not in line with the attitudes of the original EU countries.\n\nPersonally, I think it was an error to extend the EU eastwards before attitudes had changed, but I guess western Europe was hoping membership in and of itself would cause change... and so here we are, with Polish \"LGBT-free zones\", Hungarian fascism, and Romanian OPs claiming to not be homophobic while berating her gay brother for disrespecting the sanctity of marriage.\n\nOp, YTA.",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1131,
          "content": "Does OP think that the government prohibits gays from wearing rings in their ring fingers? Every homosexual is required to have a hand inspection quarterly to ensure they have not been masquerading as though they deserve equal rights, lest they make a mockery of an institution with a 42% failure rate\n\nEdit: for clarification, I used a UK statistic from 2012 but it appears that Romanian divorce rates are closer to 23%, or 1.6 divorces per 1000 people.",
          "id": 30,
          "comments": [
            {
              "score": 257,
              "content": "Now check how many marriages end not due to divorce but due to domestic violence. Not a fun statistic in the slightest. I'm Romanian as well. \n\nOP, I know people that didn't marry legally so they don't lose some pension from their previous marriage. They even had vow \"renewals\" at the church, and always wore wedding rings. They lived together for 25 years until one of them passed. Do you think they made a mockery of marriage? Or is it fine because they were straight?",
              "id": 31,
              "comments": [
                {
                  "score": 30,
                  "content": "I know people who never married because one of them is on disability and would have lost all their benefits. And i know another couple that got divorced because they became disabled and didn't qualify for benefits but desperately needed it because they couldn't afford the necessary care. It was more economically affordable to divorce, sell their home and rent separate apartments so the wife could have benefits than if they kept their marriage and their home. Granted i understand that things are very different here (usa) and these may not be issues in other parts of the world. It's just a couple examples of why no one should judge the state pr value or worthiness of a relationship based on jewelry.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 12,
                      "content": "My aunt and uncle were happily unmarried for 25 years until she passed from cancer at 50.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 106,
              "content": "It's pretty common for divorce rates to be much lower in more religious areas, since divorce is usually highly stigmatized in religious communities. A lot of the time, people just live out their unhappy marriage, maybe cheat, and pretend everything is good because it would be too shameful to divorce. Wouldn't be surprised if this is the case in Romania, since it is a very religious country, but that's just speculation on my part.",
              "id": 34,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 736,
          "content": "It would probably put a fatal twist in OPs knickers if they knew that many single women wear engagement-looking or gold band rings when traveling to stop unwanted male attention.\n\nYTA and MYOB",
          "id": 35,
          "comments": [
            {
              "score": 293,
              "content": "I wonder how OP feels about how I,  a woman married for 10 years,  don't wear a ring at all.",
              "id": 36,
              "comments": [
                {
                  "score": 57,
                  "content": "My husband is a lot more likely to wear his ring than I am to wear mine! I *love* mine--but I'm a gardener and a baker, my hands are always in something.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 20,
                      "content": "I was a pastry chef for 11 years, which is why I never wore mine.  Even now that I changed careers I'm used to not wearing it so I don't even think about it.",
                      "id": 38,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 24,
                  "content": "Oh, likewise! Married over 25 years, don't wear my ring, but my spouse always wears his. He doesn't mind, and neither do I, and those are the only two opinions that matter.",
                  "id": 39,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "You're making a mockery of single life!!!!! How dare you!!!!",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "Also, don't people wear their ring as soon as they get engaged? Even though the engagement period is sometimes *years* before getting married. Seems like OP's brother is basically engaged.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "My son's girlfriend wears a ring on her left ring finger because she gets hit on by perverts when she's working.",
              "id": 42,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 145,
          "content": "I'm curious what they think about all the married people who cheat on their spouses if they are so concerned about the sanctity of marriage...are they allowed to wear rings if they didn't end up in divorce?",
          "id": 43,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 130,
          "content": "OP's opinion on other's life is as useful as a virtual hug. YTA\n\nEdit: Your to OP",
          "id": 44,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 66,
          "content": "Oh no, you use wedding rings as a symbol of love, how could you! /s\n\nI bet if her brother wore wedding rings with a woman without being married, she would find it romantic.\n\nAnd also why call it wedding rings? Call it partnership rings and everything is tutti paletti. As if rings are just worn by married people. Even highschool sweethearts wear them. Or friends. They are a symbol that you belong together. And not a symbol of marriage.\n\nBut if you are homophobic, even little rings can be threats...\n\nYTA",
          "id": 45,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "Making a mockery of marriage = not allowing two people in love and ready to commit for life to be legally married. NOT making a mockery of marriage = considering your commitment as strong as that of a legally married couple and wearing rings to symbolize that.",
          "id": 46,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Methinks op *does* have a problem with their brother being married to another man. \n\nYTA",
          "id": 47,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "On the list of “shit that is not your business”, this is right up there with shrieking at a non-virgin for getting a white wedding dress. Jesus, OP. Get a hobby. Let people live. YTA",
          "id": 48,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 33512,
      "content": "I sometimes take my wedding ring off, and put it on the cats tail, and tell my husband he's now married to the cat.\n\nHow's that rock your perception on the sanctity of marriage?\n\nYTA.  Stop pushing your own ideals on what a ring, and marriage means to other people, and focus on your own life.\n\n\nETA: WOW. This blew up. Thank you so much. Will post the cat, wearing the ring, once I get home.\n\nETAA: I'm not home yet guys 😆 I will post the second I am!\n\nCAT TAX POSTED ON MY PROFILE. ENJOY MY BABY BOY, RENGAR.",
      "id": 49,
      "comments": [
        {
          "score": 5467,
          "content": "Are you in the market for a new friend? Because I want to be your friend. \"married to the cat\" BEST!!!!",
          "id": 50,
          "comments": [
            {
              "score": 1497,
              "content": "Tbh i would probably steal my partner's ring so that i get to be married to the cat.",
              "id": 51,
              "comments": [
                {
                  "score": 330,
                  "content": "take both rings so the cat can be married to the cat",
                  "id": 52,
                  "comments": [
                    {
                      "score": 99,
                      "content": "Married to the car? Is your cat autosexual?",
                      "id": 53,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "Okay now, cats getting married I can deal with but cars is WAAAYYY too far",
                      "id": 54,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 305,
              "content": "It's official, I'm marrying our dog tonight as soon as hubs gets home to see it. He's gonna be so pissed!!!!",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 226,
              "content": "Right? I want to see a picture of this cat :)",
              "id": 56,
              "comments": [
                {
                  "score": 34,
                  "content": "Cat tax required!",
                  "id": 57,
                  "comments": [
                    {
                      "score": 23,
                      "content": " Yes cat tax please",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Yes please I need that in my life!",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Cat tax!!!",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 50,
              "content": "She had me at “you’re married to the cat now”",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I'm going to do this now 😂 thanks for the idea",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I’d also like to be part of this friend group if that’s okay!",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Everyone in our friend groups is able to wear my ring 😂 so every now and again, we’ll say something to the other, which ends with someone else in the group being married to my husband for x duration of time. It’s great and we love it",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1536,
          "content": "My husband sometimes takes his off, puts it on his toe, and says, “Now we’re foot married!” Then he cackles maniacally like he’s getting away with something.",
          "id": 65,
          "comments": [
            {
              "score": 263,
              "content": "Absolutely creased up laughing at this",
              "id": 66,
              "comments": [
                {
                  "score": 110,
                  "content": "We have a good time",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "ok this is my new favorite way to say I died from laughing\n\nis this a British thing? It sounds very British",
                  "id": 68,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Am British and it's a British thing for me!",
                      "id": 69,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "I have never heard this phrase, but I love it! Any info on origin?",
                  "id": 70,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Idk if it's actually this, but in my head it's because you laugh so hard you bend over or can't move your core muscles.",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 161,
              "content": "If my husband fiddles with his ring I snatch it out of his hand and declare we are not married anymore until he can wrestle it back from me.",
              "id": 72,
              "comments": [
                {
                  "score": 67,
                  "content": "Ah yes! FIGHT FOR THIS LOVE!",
                  "id": 73,
                  "comments": [
                    {
                      "score": 12,
                      "content": "I hope they play the song during the wrestling match",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 58,
              "content": "In Finnish the word for concubine (not a thing in Finland) translates literally as \"foot-wife\".",
              "id": 75,
              "comments": [
                {
                  "score": 14,
                  "content": "Oh dear.",
                  "id": 76,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I read this comment aloud to my husband, while wiggling my toes at him and cackling maniacally. He closed his eyes and slowly shook his head at me. I’m thoroughly amused.",
              "id": 77,
              "comments": [
                {
                  "score": 11,
                  "content": "We wiggle our toes at each other at least three times a day. In fact, we refer to toes as “wigglers.”",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "He's a keeper! 🤣 It's important to like your partner as much as you love them, and it sounds like you two enjoy life together. That makes me smile, thanks for the good feelings!! ❤️",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Isn’t marriage great? I can’t imagine being in some of the marriages on here where they just seem to hate eachother",
              "id": 80,
              "comments": [
                {
                  "score": 11,
                  "content": "I think too many people see marriage as a box to be checked in the stages of life without considering whether their partner is worth sharing their life with. I was never one of those people who felt like I had to be in a relationship. If something wasn’t working out I ended things as soon as possible so as not to drag things out for either party. \n\nAnd then I met my now husband and everything changed. Here we are - wiggling our toes at each other and foot married.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1092,
          "content": "This is truly one of the funniest things I’ve read and I can’t wait to do this one day when I’m married",
          "id": 82,
          "comments": [
            {
              "score": 342,
              "content": "My husband just left the house and I'm fucking pissed I have to wait 6 hours to see him again. He's marrying our fluffy Maine Coon tonight 😤",
              "id": 83,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 166,
              "content": "Right? Now I’m ready to marry the next schlump that comes my way just to put my ring on the cat",
              "id": 84,
              "comments": [
                {
                  "score": 17,
                  "content": "Who says you need a guy to do this, go buy yourself and the cat a ring. You guys deserve it 🙂",
                  "id": 85,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Cause *i* don’t wanna marry the cat, i want *him* go be married to it",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "This is def happening with my ring today. Which, btw, I remove to lift weights, so I guess I'm not technically married when I go to the gym.",
              "id": 87,
              "comments": [
                {
                  "score": 28,
                  "content": "We don't wear our rings around the house so we joke that we are only married when we leave. Sometimes we forget them when going to Home Depot or to visit my parents. The amount of shit we give each other for \"galavanting\" around town without our rings is super fun, especially if only one of us forgets.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I can just imagine a conversation like \n\n“You mean to tell me I was walking around all day married to No oNe?!? Of alll the disrespect!!” \n\nAnd I’ve been giggling for the last 5 minutes because of it.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I want to get married just do to this. Then I can get divorced.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 476,
          "content": "Bro. Idk who you are but I love you. That's hilarious and you have given me some wonderful ideas. Thanks!",
          "id": 91,
          "comments": [
            {
              "score": 15,
              "content": "> some wonderful ideas.\n\n\nOh no...",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 356,
          "content": "Going to do this with my engagement ring and the small dog this evening, ty for the excellent idea",
          "id": 93,
          "comments": [
            {
              "score": 165,
              "content": "Make sure you pay attention to where the ring lands after the dog wags their tail.",
              "id": 94,
              "comments": [
                {
                  "score": 111,
                  "content": "The real LPT is in the comments.\n\nI give it a week before we see a 'TIFU: put ring on animal's tail and lost it' post\n\nEdit: punctuation",
                  "id": 95,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I have a pic of my SILs engagement ring on one of their greyhounds toe.",
              "id": 96,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 246,
          "content": "Oh no! My husband is married to my bathroom countertop!!! To be fair, I’d marry it too.",
          "id": 97,
          "comments": [
            {
              "score": 29,
              "content": "Lol. That’s gotta be some countertop.",
              "id": 98,
              "comments": [
                {
                  "score": 31,
                  "content": "[removed]",
                  "id": 99,
                  "comments": [
                    {
                      "score": 40,
                      "content": "Must be marbleous.",
                      "id": 100,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "I guess the countertop is a bottom!",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 146,
          "content": "Are we the same person? Because this is absolutely something I would do.",
          "id": 102,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 124,
          "content": "My  partner takes their's off  to play sports and always forgets to put it back on. I tell them we are not married  and I can do what I want until they put it back on.  \nI never do anything because I am lazy,  but it's a nice threat to hang over their head.",
          "id": 103,
          "comments": [
            {
              "score": 31,
              "content": "When my husband takes his off to shower I joke we’re not married anymore too, “cause that’s how it works right?!”",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I take mine off to run because of sweat induced eczema, but generally put it back on after I get home and shower. My husband takes his off to shower and every so often forgets to put it back on before going to work. That's my cue to send him a photo of it wherever he left it with the caption \"sharking today are we?\". Makes us both smile and stops him panicking that he lost it cycling to work. 🙂",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 120,
          "content": "This is an amazing joke. Can I be married to you while your husband is married to your cat?",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "Wow I’m stealing this joke you’re hilarious",
          "id": 107,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 19656,
      "content": "YTA\n\nBefore marriage equality was legal here in the U.S., my wife and I wore wedding bands for years (we've been together 25 years). It symbolized our love and commitment to one another, despite the government's unwillingness to acknowledge that.\n\nYes, there are rights and obligations that go along with being able to be married legally, but marriage is NOT only about the state/government acknowledging it. It's about personal love and commitment. And they want to show that to the world. \n\nSo what's your issue with them showing their love and commitment? Does it hurt you at all? Nope. YTA, OP. 100% YTA.",
      "id": 108,
      "comments": [
        {
          "score": 1251,
          "content": "Well stated.",
          "id": 109,
          "comments": [
            {
              "score": 1909,
              "content": "Not to mention OP says *them* wearing rings offends her because *they're* mocking marriage and *they* can't get married so *their* rings offend her, and this chick's surprised they took her bigotry towards them personally... it is personal, you're offended by their personal choices",
              "id": 110,
              "comments": [
                {
                  "score": 630,
                  "content": "Right? It's like, \"why are they offended when I specifically went out of my way to offend them?\"",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 216,
                  "content": "\"All I did was was judge his personal choice and he took it personally\"\n\n*shocked Pikachu*",
                  "id": 112,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "I thought her angle was going to be that the country is hostile to gay people and actively enacts \"vigilante justice\" on them. Nope, she just hates gay people.",
                  "id": 113,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 655,
          "content": "That is a fact!! My fiancé and I are high school sweethearts and for us personally getting our lives in order was more important than getting married. So rather than get married right out of high school we chose to wait 9 years before getting engaged. We'll be together 11 years by the time our wedding happens. And people act like this is such a big step. And I really can't understand it. We already live by the wedding vows and are 100% committed and in love. An overly expensive party isn't going to change that. As far as feelings and commitment and lifestyle is concerned we've been married for years already.",
          "id": 114,
          "comments": [
            {
              "score": 124,
              "content": "Yea, same here. The biggest change in my life when I got married was my signature. We were already committed and had been for years when we got married. We waited until we were in a place where we could afford to get married like we wanted, which was about 4 years in. But we'd lived together for several years and made decisions together and all that. The wedding was just formalizing and celebrating what we already had, not creating anything new.",
              "id": 115,
              "comments": [
                {
                  "score": 26,
                  "content": "Yep, all that's changing in my name. But I've been practicing that signature since high school.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 14,
                      "content": "Aw, that's adorable. Congrats to you!",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "My cousin did it the same way! She and her now husband got together her sophomore, just junior year of high school. He went to college two states away. Right when he graduated, she moved a state away for pharmacy school. They got engaged while she was in pharmacy school and got married last fall once she had graduated. They just hit 10 years together.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "We got engaged just before the pandemic, were gonna start looking in March 2020 at places to get married. Then the world shut down. Things opened back up but the prices of places skyrocketed.\n\nWe already got our rings and started wearing them. (So happy we did as mine was hella painful if my fingers even swelled a smidge)\n\nProbably just gonna say fuck it and do justice of the peace. We're already 100% commited to each other. Just want that piece of paper to hang on the wall.",
              "id": 119,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "You have put this so well!\n\nI realise you and OP are based in other countries but civil registration of marriages only became a requirement in the UK in the 1800s. It's only been necessary to have a marriage certificate for less than 200 years! Is OP saying that any marriages that took place before this were not real? That the love and commitment between two people was any less? \n\nThis whole thing reeks of homophobia and I feel bad for OPs brother for the way she has treated him and his partner, by dismissing the value of their relationship.\n\nYTA op",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I remember where I was when same sex marriage became legal. I was in basic training in Fort Sill Oklahoma and our drill sergeants came into the barracks and announced that same sex marriage is now legal. I’m not gay but a lot of my friends in there were, so many of them cried. Hell I cried when one of my friends told me they need to call home and ask their girlfriend to get married.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "To me before my husband's car accident a wedding certificate was just a piece of paper it doesn't change anything. Well he was in the Army, we needed that bit of paper for our relationship to be acknowledged by our employers. I was 5 months pregnant looking ready to poo with at least twins, but when I asked for time off to help him, they said no. I went anyway, pointing out how ridiculous telling me that we didn't have a relationship... I had to be careful in his quarter as we weren't married yet so I shouldn't have been there. The MOD wouldn't have notified me had the accident been more serious.\n\n\nWe had a date in June booked, once he was mobile again we brought it forward & married 8 weeks later, with all the bells & whistles. When we changed our date there were leaflets about the then scheduled to start commitment ceremonies for same sex couples in the UK. I thought it wonderful until I read it..it was IMO insulting. It gave the legal rights but seemed like a OK you can have x, y  z but that's it you're not married just in a legally recognised committed relationship. That was just vile because that's what a marriage certificate gave me so splitting hairs was just ridiculous & unjustifiable, it was homophobic. Love is love & a committed relationship with a bit of paper to prove it is marriage. Every adult has the right to marry their significant other, it should be that simple. The love between my husband & I is the same as the love between his sister & her girlfriend. If they ever choose to make it official we'll be there to celebrate their wedding & love. Until then they're both my SIL & both our sons aunties. \n\n\nAs for OP saying brother & BIL wearing  rings is wrong or a mockery of marriage, the only wrong is that they cannot legally marry. Rings are a symbol of our vows they are not part of the legal part of getting or being married. Some married people don't wear rings, it doesn't make them less married. OP's brother & BIL are committed to a life long, exclusive relationship with each other & that's exactly what wedding rings symbolise. They absolutely should never wearing those rings & OP owes a huge apology & needs to accept them. Absolutely OP YTA, you need to make this right.",
          "id": 122,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9660,
      "content": "YTA. This is the definition of mind your own business. \n\nAnd not allowing consenting adults to get married is mockery enough itself.",
      "id": 123,
      "comments": [
        {
          "score": 706,
          "content": "Exactly. Leave them alone and pay attention to your own life.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 506,
          "content": "Yeah. Only one making a mockery of marriage is the Romanian government. Since marriage is no longer a property exchange and we tend to focus on love more, what the heck is OP’s problem? That ring symbolizes the important part. Also, I wonder what they think of promise rings",
          "id": 125,
          "comments": [
            {
              "score": 197,
              "content": "Op is upset they can't descriminate against their OWN BROTHER even more than they already have. Like they don't say they disagree with the law ..so...what's the brother supposed to do? Is making a \"mockery\" of \"real\" marriage OP? Should the government even be involved in marriage? A lot of people think not.",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "This! OP is being the poster child for straight people thinking they are allies but then proceeding to expect lgbtq+ to adhere to their opinions on how to be gay",
          "id": 127,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5907,
      "content": "They are wearing rings as a symbol of their commitment to each other regardless of what the law says. Who TF are you to tell them they can’t do that? YTA",
      "id": 128,
      "comments": [
        {
          "score": 1458,
          "content": "OP, My husband sometimes puts on a cowboy hat and he isn’t even a cowboy!!!!  I’m constantly mislead about who he is, and i remind him how unfair this is to me!!!  He tells me he feels the same way when I wear my sexy nurse outfit. Hmmm….. I guess I need to go to nursing school so that what we do and wear in the parameters of our own relationship won’t be scrutinized by assholes. YTA.",
          "id": 129,
          "comments": [
            {
              "score": 268,
              "content": "if you have to go to nursing school then he needs to go to cowboy school. what's fair is fair.",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 136,
              "content": "OMG\n\nMy husband wears baseball caps all the time *and* *he* *hasn't* *played* *baseball* *in* *like* *30* *years*\n\n\nWho even is this fraud? He's clearly making a mockery of the sanctity of baseball just as yours is making a mockery of the sanctity of cowboy. How did we get here? *sobs*    /s just in case\n\n\nFFS OP is such an AH that I don't have the expletives to properly convey it.",
              "id": 131,
              "comments": [
                {
                  "score": 26,
                  "content": "Well shit. My husband wears baseball hats and he’s NEVER played baseball. I’m going to report him to the appropriate authorities immediately.",
                  "id": 132,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Right? Like, I wonder if the teams and managers get confused or offended when they see someone out wearing a cap and they didn't go through all the training and sign contracts, etc that the pros had to do be able to wear the cap. And mine wears a *hockey* team baseball cap, a bicycle repair store baseball cap, and a comic con baseball cap, mostly. Baseball players must be so confused when someone is out impersonating a baseball player when the cap isn't even a baseball team. The audacity.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 18,
              "content": "If I had an award to give you, I would! Love it!",
              "id": 134,
              "comments": [
                {
                  "score": 13,
                  "content": "I gotchu fam",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "My husband does singing telegrams. He FREQUENTLY wears a gorilla costume. \n\nI’ve tried and tried to explain that he’s making a mockery of the entire animal kingdom and we should respect our noble cousins, but he won’t listen. \n\nIt’s a fucking nightmare.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "He sounds like a big phoney.",
              "id": 137,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 694,
          "content": "But the sanctity of llegal marriage! What mockery of the level system! /S",
          "id": 138,
          "comments": [
            {
              "score": 256,
              "content": "This post screams \"gays are alright I guess as long as they don't pretend they can do everything straight people can do.\"",
              "id": 139,
              "comments": [
                {
                  "score": 52,
                  "content": "Yeah op is claiming no issue with brother being gay so long as he knows his place",
                  "id": 140,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 262,
          "content": "Exactly this. A ring is purely a symbol of love and commitment, NOT of marriage itself. That's why my husband buys me cute little gemstone rings every year on our anniversary, as a renewal of his love for me and commitment to our lives together. I rarely even wear my wedding ring anymore because I have 22 other rings I can choose from every day. \n\nKeep your nose out of other people's love lives, OP. It is absolutely NONE of your business, and you should be ashamed for not being \\*happy\\* for your brother! That he found someone who truly loves him, and someone he can grow old with. Just the same as with any marriage built on love. Who cares about the legalities of it?? 40 years ago I wouldn't have been able to marry my husband because he is a different race from myself. The whole legal system surrounding marriage and policing relationships is so antiquated, and quite frankly, \\*THAT\\* is what makes a mockery of marriage. The government should not have any say whatsoever in who can marry whom.\n\nGet over yourself. YTA\n\nEdit: awwww, you guys and your rewards! Thanks so much!! 😘",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "A relative of mine is gay and married. He and his partner wore engagement rings for at least five years before it was legal for them to wed. The only reason these rings are even remotely relevant to op is because she stuck her nose where it doesn't belong and needs to promptly remove her nose from there.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4416,
      "content": "\"Not gonna lie, I think his comment here was kind of out of line, as all I did was to give my opinion on people wearing wedding rings when they're actually married yet and he seemed to take it personally. \"\n\n&#x200B;\n\nYTA and YOUR comment was out of line",
      "id": 143,
      "comments": [
        {
          "score": 742,
          "content": "How could they NOT take it personally! She was only saying it because it was *about them*! YTA OP!",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 325,
          "content": "Plus OP is saying \"yet\" like they're wearing their rings too early or something. Which would still make her an AH but she said in their country brother and his bf CANT get married. OP like really isn't considering what that would feel like, to not be legally allowed to marry the person that they love. \n\nI am getting officially married soon (I am gay too) and I'm waiting to wear my ring until its official because that makes it feel more special. I know queer couples who did engagement rings for both of them that doubled as the wedding rings so they started wearing them \"early\". \n\nThat would still be none of OPs business but the fact that they are choosing to acknowledge their relationship in their own way even though they CANT get married makes OP a raging homophobic asshole.",
          "id": 145,
          "comments": [
            {
              "score": 23,
              "content": "Congratulations on your upcoming wedding!",
              "id": 146,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "That’s the line that angered me. Like, I felt my blood pressure rising. \n\nShe didn’t give her opinion on “people,” she gave her opinion on her brother. And when he got upset and said he didn’t care what she thought (though he does or she wouldn’t have infuriated him) she thinks *he’s* out of line. Of COURSE he took the comment personally. She said what she said because she saw HIM wearing a wedding ring. She’d have never even commented on such a situation if her brother hadn’t been wearing a wedding ring. Ugh. \n\nAnd the entitlement thinking she gets to tell him how to conduct his relationship. Disgusting.",
          "id": 147,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "\\- \"I hate your nose\"  \n\n\n\\- \"why would you say that? that's so mean!\"  \n\n\n\\-...\"for some reason, you seem to be taking my comment personally\"  \n\n\nlol",
          "id": 148,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Transcript of convo\n\nOp: “I know no one asked for my opinion but I’m gonna give it anyway”\n\nEveryone else: “that’s not cool op”\n\nOp: “Your reaction is out of line! I was just stating my opinion!!!”\n\nhonestly even disregarding the actual context of what she said, people just shouldn’t give their unsolicited opinions. It almost always makes you the ah",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Also what else are they supposed to do when they can't get married to show their commitment? Constantly wear shirts that say \"I'm fake married because I legally can't get married\"",
          "id": 150,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2806,
      "content": "INFO: How is this any of your business?",
      "id": 151,
      "comments": [
        {
          "score": 667,
          "content": "Where did they find the audacity?!",
          "id": 152,
          "comments": [
            {
              "score": 252,
              "content": "In their arse whilst their head was stuck up there?",
              "id": 153,
              "comments": [
                {
                  "score": 17,
                  "content": "Ya know what? I wish I could say stuff like that!",
                  "id": 154,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Laughed WAAAAYYYY too hard!",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Audassity",
                  "id": 156,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "As a man I can often find the audacity, yet even I'm struggling to find that audacity. OP is definitely the AH here.",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Pretty sure it's sold in giant vats at the Cis Privilege Supermart.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "“well you see, my religion is the only one that mattered. especially that one that always agreed with Meeeee”",
          "id": 159,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2302,
      "content": "YTA. This is none of your business. I read everything you wrote, expecting to see you were concerned about their safety or had a legitimate reason for your interest in the jewelry they choose to wear, but nope.",
      "id": 160,
      "comments": [
        {
          "score": 469,
          "content": "It's an ugly attitude.\n\nI wish the two people toward whom it was directed all happiness, and perseverance to make a good life in an unwelcoming place.\n\nOP, I hope you can adjust your meanspiritedness one day. Until then, YTA.",
          "id": 161,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "Exactly. When I read the post, I was hoping that it was going in the direction of safety. But nah it went homophobic. Op YTA for sure.",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "THIS is exactly what I came to say. I mean, I’m kinda worried for them. I hope they stay safe and happy and OP gets a clue.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I was also holding out for some kind of safety concern, but nope. OP is just a major AH",
          "id": 164,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1938,
      "content": "YTA.\n\nYour brother is not married because he literally is banned from doing so, not because he chose not to get married. Telling him he should wait with wearing a ring (it's not like he faked certificates, he's wearing a ring, which is something you can do regardless of your family status, even if you are single), because it's making a mockery out of marriage is really distasteful and disrespectful. Sounds like if it were his choice he would be married already.\n\nAnd as someone who is married I can tell you, its really not a magical thing that boosts your relationship to another level. My relationship has not been different before and after marriage, because it really only is the feeling you have towards your partner, and this doesn't change through a piece of paper.",
      "id": 165,
      "comments": [
        {
          "score": 670,
          "content": "Interesting how OP says they don’t have a problem with brother being gay but also that his wearing a ring without a ceremony is “making a mockery out of marriage” - time to take a great big look at yourself OP - also YTA",
          "id": 166,
          "comments": [
            {
              "score": 159,
              "content": "And promise rings for teenage couples are a thing too. A lot of people in my high school had them when they graduated. They recognized they were too young to propose and be married, so it was a sign of commitment and future intent",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1306,
      "content": "Congrats on being homophobic.\n\nYTA.",
      "id": 168,
      "comments": [
        {
          "score": 87,
          "content": "and asshole sister too",
          "id": 169,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}