{
  "post content": " I’m getting married in 3 weeks, and I just had my bachelorette over Easter weekend. During a quiet moment one of my bridesmaids took me aside and told me that about three months ago she was diagnosed with fetal alcohol syndrome. Obviously I asked her what that meant for her and she started crying because she feels differently about her relationship with her mother. We met in elementary school and she’s always had a learning disability, but she didn’t know that there was a preventable cause. My other bridesmaids noticed her crying, and the evening ended up being about her. We skipped out on going to a bar in the limo I had hired because she was upset. I thought about it all today and ended up emailing her to tell her that she took away an important moment from my life. I feel bad about this happening to her, but even though she didn’t always know it’s been going on for her whole life. If this was a recent thing she found out about or it was some kind of deadly disease I would feel differently, but she was sitting on this for months before bringing it up at an event that was supposed to be special to me. You only get one bachelorette and mine was totally overshadowed. I felt really hurt that she did that, and told her that I didn’t want to have her in my wedding if that’s how she’s going to treat me at a time where the focus was supposed to be something good in my life instead of something sad in hers. She could have waited a few more weeks until after the wedding if she wanted to have this conversation. She’s still invited to the wedding but I don’t want her to be a bridesmaid after this. I was just texting my cousin (my maid of honour) and she disagreed with me doing this. She said that it sucked that we didn’t go to the bar, but this other friend has already paid for her dress so I should just let her stay. My fiancé supports my choice, but I wanted another opinion. AITA?\n\nUpdate: for those wondering I had actually seen her on two occasions since her diagnosis, including getting coffee one on one a week after it happened where she could have told me. It was the fact that she waited until my event to tell me and then derailed it that had me so upset. I hadn’t considered the fact that everyone pre drinking might have set her off. After reading a bunch of comments here I called her. I asked why she hadn’t told me before and she said she was still trying to process when I had previously seen her. She didn’t realize she was going to cry so much and distract everyone and ruin the mood. She said she felt really horrible about doing that and that she hadn’t meant to ruin the evening. I apologized for acting on my own hurt feelings and asked if she’d be willing to consider still being a bridesmaid. She said she really wanted to still be in the wedding. I don’t have the budget to have another bachelorette party, but I realize that I was only making that loss worse by hurting an old friend in addition to losing out on an event. I was definitely attributing her behaviour to malice when it was actually bad timing. Back in high school she did a similar thing to me because she was jealous of the attention I was getting as part of a competitive choir, but she’s grown up since then (we’re 23 and 24 now). I overreacted, and I honestly appreciate the tough love from this sub. It made me reconsider what I was doing and probably just saved a friendship.",
  "id": 1,
  "comments": [
    {
      "score": 24726,
      "content": "ESH - I get it! She found out months ago and waited until that night to say anything, took the attention, and you lost out on the money you paid. It was completely understandable to be hurt and frustrated. BUT you didn't need to cut her from the wedding. That was retaliation, pure and simple. You could have called her and opened up the door to have an honest conversation about how you felt and allow her to respond, this would've shown compassion and grace. Instead you made a decisive decision because your feelings were hurt. It is your wedding, but she is also a close enough friend where you asked her to be a bridesmaid and she deserved that conversation before you decided to push her out. I would absolutely apologize to her and realize that in this case you've both been shitty to each other.",
      "id": 2,
      "comments": [
        {
          "score": 7360,
          "content": "This is the reasonable answer. People saying Y T A because a woman wanted to have a good time at her bachelorette party aren't people I want to go to social functions with. I'm not going to take someone's birthday celebration and start describing what it was like to see my mother dead on a table in a morgue, or dumping other trauma on people. There's a time and a place for things.\n\nAnd kicking the friend out of the bridal party entirely is also an asshole move.",
          "id": 3,
          "comments": [
            {
              "score": 4055,
              "content": "One of my besties had her bachelorette less than a week after my wife came out to me as trans. As great as it ended up being, it was incredibly difficult at the time (not knowing how it would change her and our relationship as well as being yanked from the closet against my will). Celebrating the beginning of someone's marriage when I thought mine might be ending was grueling.\n\nBut I kept it to myself. It was my friend's weekend. She was beyond excited. So I just got pretty drunk and did my best to be happy for her. Sometimes, you have to put your own stuff aside for friends. \n\nThat being said, if I'd had a meltdown, I'd like to think my friend would be empathetic enough not to kick me out of the party. Definitely an overreaction.",
              "id": 4,
              "comments": [
                {
                  "score": 2878,
                  "content": "There’s a difference between finding out a week ago and finding out 12 weeks ago.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1411,
                      "content": "Yes. This. \n\nI also have a personal rule. \n\nNo serious talk around alcohol!\n\nStupid arse shit only!\n\nWanna be serious. Then talk sober and one on one of a small group. Once there is booze then all serious stuff needs to be tabled. \n\nI will often walk away from crying drunk friends and say “not listening! Let’s chat sober! Don’t want to hear it! Am here to dance”\n\nLast thing anyone needs is serious teary stuff at a party. \n\nI agree totally with ESH though. \n\nThis whole “everything must be about me me me at 22 events is just weird”",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 241,
                      "content": "Also between crying for a moment to getting everyone to cancel everything where they are all around your issues.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 209,
                      "content": "That's the thing. I understand that the bride might be afraid that on the day of her wedding, the friend would suddenly remember an horrific moment of her life and just make it about her",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 99,
                      "content": "I’m curious if this was the first proper social event the friend attended since finding out. \n\nIf this was the first alcohol-centred event she’s attended since learning, I can understand the break down. \n\nAlcohol will be a trigger for her while she processes. She might not have even thought about it UNTIL being at the bachelorette. Once there - boom, alcohol and the night is about being drunk and now all she can think about is her mom and her diagnosis. \n\nShe might not have even been planning to tell anyone at all. But she broke down and freaked out and then it all came out.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "People are super hung up on her having found out months ago. But a few months isn't a lot of time to process a diagnosis. When I was diagnosed with ADHD, it took me months before I told a friend and when I did, I felt so uncomfortable. Yes, my life didn't change when I got the diagnosis, but realizing so much that I've struggled with could be because of this was a hard thing to process and there were a lot of emotions. I assume the bachelorette included drinking and maybe it triggered her in a way she didn't expect. If she deliberately chose to make the event about her, yes she's an AH. But I'd say it's just as likely she didn't mean to. \n\nI understand it sucks to have your expectations not meet reality and we often have high expectations and big dreams around everything wedding. But the lack of compassion for the friend who has found out something life-changing for her and is still processing/struggling with it - c'mon. If she didn't intend it to go this way, then she made poor decisions and needs to set better boundaries yes. But assuming she's been a good friend before, I'd hope for more compassion from a very good friend and everyone here is just validating OP's callousness.\n\nI think it was all handled badly by everyone.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "People process trauma differently though. Good for you for being able to suck it up but don't be judgmental on someone else if they process their feelings at a different time/rate.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 266,
                  "content": ">after my wife came out to me as trans. As great as it ended up being, it was incredibly difficult at the time (not knowing how it would change her and our relationship as well as being yanked from the closet against my will). Celebrating the beginning of someone's marriage when I thought mine might be ending was grueling.\n\nI had a similar experience when my wife came out. Except it got worse- My dad died 3 weeks after my wife came out. 5 weeks later, his husband passed. My entire family is in town and I didn't want or need additional stress. I literally shut completely down a couple of times- unable to make decisions when I'm usually very decisive. My wife said that for the time being, she'd keep living life as she had (in the closet, male presenting) so that it wouldn't take away from the occasion and celebration of life for them. This is not something I asked of her, but rather, she told me that was the way it was going to happen. Ultimately, her stance on this made our relationship stronger. I thought it very big of her to put my needs over her own validation. \n\nAbout a month after everyone went home, she announced it to my family- a couple of them were very unkind. I'm glad she waited because I'm really not sure how I would have reacted in person in that emotional state. I have a very short fuse (and violent, when I was younger) but have learned to temper it in normal situations, but during that time, I struggled with lashing out.\n\nHowever, your comment struck me in a weird way. My wife and I have had a stable relationship, but for that year, I was grieving her former self and our relationship. But it never really dawned on me that I, too, was yanked out of the closet against my will-  subconsciously, I was also grieving my former self.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 92,
                      "content": "Yeah, sometimes you just have to push your own shit aside and stay quiet just to be there for the people that need it most! When I first found out I was pregnant, my sister had just split up from her kids dad and was having a tough time, and my dad took all of us away, so I just shut up about it and waited a few weeks, because she needed the support more at that time!",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 251,
                  "content": "I had to disappear from my friend's bachelorette party for 45 minutes on a 'family emergency' phone call with my parents. When I got back, she asked, \"Is everything ok?\" I told her, \"My cousin's been excommunicated from the family, but I don't want that to-\"\n\nI didn't get to finish because she grabbed another beer and said, \"Tell. Me. Everything!\" 😆",
                  "id": 14,
                  "comments": [
                    {
                      "score": 32,
                      "content": "I like that! She considered you her friend first and her bridesmaid/wedding accessory second, which is as it should be. \n\nI agree that it's rude to \\*deliberately\\* hyjack someone's event, but I wish OP had given her friend the benefit of the doubt and decided to act like a friend, not a Bride whose need for attention automatically outweighs everyone else's needs.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "That's some tea, not some 'sad' news.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 174,
                  "content": "She didnt kick her out of the party because there was no party. The party got overtaken by the best friend’s news, the other bridesmaids decided that the party wasnt important and they never got on the limo(shows where their priorities lie). Having a meltdown during a party 1 week after finding out bad news is understandable. Having a meltdown before a party begins, and then allowing that party to never begin so everyone can comfort you three months after you found out about bad news is not understandable.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 49,
                      "content": "The bridal party, she kicked her out of the bridal party. Not the bachelorette party",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 117,
                  "content": "This is someone with learning disabilities though, not everyone thinks the same way. Yes she should have waited but I'm guessing she didn't think of that at the time.\n\nOP do you and your friend see each other often? My bestie and I don't do when we do see each other we end up just talking about everything that has happened to us while we haven't seen one another. Maybe it's a similar situation ? Just a thought.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 18,
                      "content": "[removed]",
                      "id": 20,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Really simple: if you’re too upset to have fun, explain why, and leave the party early.  Then make it up to your friend another day.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "But she didn't even have a meltdown, she specifically took OP aside to tell her. Before they even hit the bar. What is the motivation? That's why I'm leaning more NTA than E S H because it just feels premeditated on the friend's side and like I get not wanting her in the wedding party after that.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "This! \n\nWe each have our own shit we go through on a daily basis. (I don't know this poster, and have never been in her shoes, but I can certainly be empathetic to her plight and 100% agree, timing is everything.) \n\nThe OP needs to understand, you don't know the back story. What triggered the bridesmaid to start this? Because SOMETHING did. I highly doubt she decided to go to the bachelorette party with the intention of making it all about her by sharing that intimate detail about herself. The bride sounds like she is being a bit of a bridezilla. She needs to take a step back. \n\nAs the daughter of an alcoholic, sometimes we also need to recognize what triggers us and when we see those signs we need to remove ourselves. It's hard, at least for me. \n\nEmpathy is key, and the OP obviously wants everything to be about her. I wish a lot of brides would get this whole....my wedding day is about ME thing out of their head. It makes them selfish, assholes, and entitled.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Respectfully as well, but we should remember the friend does evidently have a learning difficulty and may not have found it as easy to understand \n\nNone of us have total control of our emotions, it seems like you managed to keep yours in check that day, but like you say you'd hope if you couldn't that your friend would look towards empathy \n\nWe can all be frustrated when things don't go our way and wish it was another way, but retaliation is an unwise tool in my opinion",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 360,
              "content": "\"You're enjoying your day, everything's going your way, then along comes Debbie Downer! \n\nAlways there to tell you about a new disease, a car accident or killer bees, you'll beg her to spare you, Debbie please, but you can't stop Debbie Downer!\"\n\n\\*WOMP WOMPPP\\*",
              "id": 25,
              "comments": [
                {
                  "score": 79,
                  "content": "Feline aids!!",
                  "id": 26,
                  "comments": [
                    {
                      "score": 80,
                      "content": "They never did catch that anthrax guy.",
                      "id": 27,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 47,
                      "content": "It’s the number one killer of domesticated cats.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 66,
                  "content": "By the way, it's official.  I can't have children",
                  "id": 29,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 311,
              "content": "Sorry but no it isn’t. This isn’t like she just found out about it, she found out months ago, many opportunities to have a conversation about it with her friends and if she didn’t want to then why did not have to be at someone’s bachelorette? It was completely selfish of her to drop that bomb on op at that moment and if she does that at the bachelorette then I don’t want to find out what she’ll do on my wedding day, kicking her out was the only acceptable answer",
              "id": 30,
              "comments": [
                {
                  "score": 105,
                  "content": "I don't mean to be rude but I think that she's the type that want the attention to herself and I understand why the bride fired her and I don't see anything wrong with it.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "I don't understand how you can jump to \"kicking her out was the only acceptable answer\" when OP hasn't even attempted to have a conversation with her about what happened. \n\nObviously, the bachelorette party was not the time or place for OP's friend to disclose her diagnosis like that. But it's entirely possible that if OP had talked to her and said \"That wasn't okay, you took over my party and I'm worried about what might happen at my wedding,\" she would have understood, apologized, and made sure it didn't happen again.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Abd if she dud it again at the wedding? No. She had months to talk to OP, but chose to make her issues the centre of attention. Good chance she'll do it again.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "NAH This is my thought. I’m on the spectrum, so I’ve been known to be “blunt” with everyone, always, but even I wouldn’t pull this. \n\nIf that friend already had her dress, there were meetings of some kind to discuss that. She could have confided then, and expressed her feelings about alcohol or whatever. To do it at the one and only event wasn’t appropriate and who could tell what she’d do at the next one and only event that’s not supposed to be about her. \n\nI get wanting to be there for a friend, but the bride shouldn’t be required to be there for someone to the point that no one is there for them. That celebration was important to her, and taken from her. The bridesmaid should have excused herself if she wasn’t able to set aside her personal issues. \n\nStuff is happening to everyone all the time. That’s the truth. People die, they learn someone else died, they get diagnosed or learn someone else did, or get fired, or might get laid off, or evicted, or have an accident, or their cat gets sick, or a million other things. That’s how life works. When you accept an invitation to a party (get that? ACCEPT an invitation to a PARTY), that is supposed to be a last hurrah, leave the million worries outside or don’t come to the party that’s supposed to be focused on someone else. Stealing that focus is inexcusable, because it can’t be undone. Knowing this is something her bridesmaid is capable of, and removing that possibility from the main event seems prudent to me. \n\nI mean, this wasn’t just some birthday party, or random weekend and the bridesmaid should have known that going in.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "She also has a learning disability. Maybe she couldn’t understand the social complexities of telling her unsympathetic friend some emotional news during that friend’s celebration?",
                  "id": 35,
                  "comments": [
                    {
                      "score": 8,
                      "content": "If that is the case, and friend cannot grasp the proper social etiquette of celebrations and not overshadowing the people those celebrations are about, then even better that she was removed from the bridal party, as she may have unintentionally caused issues at the wedding as well.  By the time you are an adult, even if you are not neurotypical, you have likely been to plenty of celebrations (birthdays, weddings, bridal/baby showers, graduations, etc) and should have at least some grasp of the social aspects. Even as someone with autism I know better than to make someone else's party about me and my problems.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 108,
              "content": "Agree on the time + place. My husband's brother was in town (he lives far) for his birthday and they held a big party for him. My mother was in the hospital unconscious at the same time - she was terminally ill. We had to see her while we had a chance so we informed only my MIL as to not wreck the party vibe.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 100,
              "content": "I grew up in a pretty abusive household.  Each of my three brothers processed the abuse differently.  I am the youngest and I did what I could to escape the house and family situation.  I went to college and immediately started going to counseling to process and unwrap - and rewire myself.\n\nYears later and I am the first in my family to graduate.  My brother stayed down there and was constantly playing peacekeeper, frequently siding with our folks.  When he came up, he made my entire graduation about him and him finally coming to terms with the abuse that transpired.  He literally sat at my celebration dinner with some of my closest friends and started crying.\n\nI was super pissed with him.  \n\nIn the end though, he continued to dance on the fence.  So all he really wanted at my graduation was to make it about him.  \n\nSome people are really just so inept.  These people frustrate me to no end.",
              "id": 38,
              "comments": [
                {
                  "score": 10,
                  "content": "I have an older brother that I’m LC with because of this reason. He loves to make everything about himself. He tried to make himself the centre of attention at every family function and has used personal tragedies to centre himself in every conversation. I’m also the first of my family to get a degree and I’m glad he wasn’t able to attend my graduation.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Yeah.  I recognize that sometimes trauma keeps people in an arrested development state, but honestly that is not my problem.\n\nThis same brother and I are no longer speaking to one another because he would constantly feed my information to our parents, and I frequently told him to stop.  I don't feel safe with them knowing where I live and work.  He would say things like, \"I believe every parent should know everything about their child\" while conveniently leaving out the litany of secrets he's kept from them.\n\nSo after numerous chances, I saw that he would never respect my boundaries.  At the same time, he spends time whining and crying that he was abused also.  You can't have it both ways, and I decided for my own sake that I was finished.  \n\nI communicated this with him before I cut contact, so he knows exactly why I'm no longer speaking to him.\n\n10 years later and he still whines to our mutual friends, \"I dunno what I did,\" and in these instances, he is making that social gathering about himself and his woes, forcing the social interaction to screech to a halt as they try to comfort him.  Oh boo hoo.\n\nSome people are incorrigible.  And he is not my responsibility.",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 44,
              "content": "That and literally every other AITA pertaining to a wedding people are always so quick to say “it’s your wedding, do what you want” except for when the bride does exactly that. I agree cutting her out of the wedding was doing *a lot* but she definitely ruined the night so I can’t even blame her",
              "id": 41,
              "comments": [
                {
                  "score": 9,
                  "content": "The friend ruined a major life event for Op. Who's to say she won't do so, even in small ways, again? The OP is still inviting her to the wedding.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Ikr? There's a time and place for everything. Bringing that up at the bachelorette party was completely inappropriate. I'd be a little more understanding if she just found out about her FAS that day, but she'd known for 3 months.",
              "id": 43,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Is it though? If this woman was so determined to take away the focus on the bachelorette party, can you imagine what she’ll pull at the actual wedding? She’s been sitting on this diagnosis for months and had all that time to disclose it. Instead she chose the bachelorette party. She’ll definitely find a way to bring up her diagnosis at the wedding.",
              "id": 44,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "My BIL's wife's grandfather passed away and she waited until the next day as my MIL was about to blow out her birthday candles to announce it",
              "id": 45,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "I guess that would depend on if she has a history of doing things like this. I have a relative who will always find a way to make any situation about her and her past and her trauma. The fact that this friend waited 3 months until the very night of the party to trauma dump this makes me think she’s one of those people. I wouldn’t want someone like that in my wedding party after she’s already made it clear she’s willing to do it even during very special events. The family member I had, she was in my sisters bridal party and pulled her crap the night before the wedding. It was a disaster! She was NOT invited to be a part of my wedding and I feel zero guilt about it.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1238,
          "content": "If she’s truly a close friend she wouldn’t have made OP’s party about herself.",
          "id": 47,
          "comments": [
            {
              "score": 442,
              "content": "Remember this person had FAS - this can 100% impact judgement and behaviour.",
              "id": 48,
              "comments": [
                {
                  "score": 1148,
                  "content": "I’m autistic and ADHD, both which can impact judgment and behavior and this is still not an appropriate moment to disclose this information.\n\nShe’d had *3 months* and is clearly “high functioning” enough that OP trusted her as a bridesmaid and to come out drinking with her. \n\nI feel horrible for the girl and the knowledge she has to live with, but that doesn’t absolve her of how she treats others.",
                  "id": 49,
                  "comments": [
                    {
                      "score": 604,
                      "content": "As a fellow AuDHD, FAS is a totally different kettle of fish. It is something that was done to her by her own mother, before she was ever born, that was a preventable result of her mother’s actions. And coming to terms with that is an additional layer of trauma.\n\nIt’s totally understandable that she may have had some un-dealt with trauma related to alcohol that she only discovered when it was triggered. Appropriate timing, of course not, but it may have been the first time since her diagnosis that she was around heavily drinking women. \n\nObviously even if this is the case OP is still justified in being upset that the terrible timing ruined her engagement, but it seems so heartless to cut someone who was likely facing an unknown trigger. \n\nAnd I don’t know about you but I definitely felt shame attached to my diagnoses at times. FAS has a way worse reputation - it’s really hard to come forward about, because it means that your own mother did this to you, and everyone who knows about FAS thinks of the stereotyped extreme - the type with the FAS facial deformities.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 120,
                      "content": "I mean, FAS is not autism/ADHD. It’s more equitable to a traumatic brain injury. Your brain isn’t neurotypical. Their brain has been damaged by alcohol in the uterus. Im",
                      "id": 51,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 63,
                      "content": "No offense,  but just because you have conditions that impact judgements, and understand that,  does not mean that she does. I have MS. Also impacts behavior and judgment.  I've said or told things at more or less inappropriate times.  I didn't realize it until I was told so.",
                      "id": 52,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 29,
                      "content": "I got diagnosed with adhd 2 years ago now and I’m still coming to terms with it. It’s worse when I’m more acutely reminded of how it impacts my life. I imagine the friend feels much the same way, and being around alcohol, especially in excess is probably very difficult for her. I would guess that seeing all the alcohol was reminding her off it until she couldn’t stop it from bursting out. \n\nCould she have handled it better? of course. but as someone who is mentally ill and disabled, I think it would be unfair to purely condemn her.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "As someone raising an Autistic kid and 2 with FASD they are far from the same. Also realising that your lifelong struggles are the result of alcohol could have been triggered by the thought of going to a bar and drinking.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "ADHD and autism are quite different. The worst cases of ADHD come across differently than FAS. It’s literal brain damage where as ADHD is a chemical misfiring. I don’t think it’s fair to compare and there are big ranges of all of these disorders.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "I’m sure that being around a lot of alcohol at a bachelorette party was very triggering for her too!",
                  "id": 56,
                  "comments": [
                    {
                      "score": 46,
                      "content": "Then don’t go.  It would have been a better option than ruining a friends bachelorette party.  She knew for three months but chose her friend’s bachelorette party to create drama, making the bachelorette party all about her, and ruin her friends milestone event.",
                      "id": 57,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "If she went through most of her life undiagnosed except for a LD, then she’s capable enough to choose a time that isn’t someone else’s moment. This was pure selfishness.",
                  "id": 58,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Nonesense",
                  "id": 59,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Seems like a justification to not risk a repeat.",
                  "id": 60,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 104,
              "content": "Do you really think that was her intention?  she was overwhelmed by this information.  Granted, her timing was terrible, but have some compassion.",
              "id": 61,
              "comments": [
                {
                  "score": 319,
                  "content": "She was probably triggered by the fact it would be a night surrounded by alcohol. Most likely thought she had a handle on the grief from learning the diagnosis and then that trigger set her off unexpectedly. The Bach party was probably the first big night out drinking since she had learned the diagnosis as well.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 107,
                      "content": "Yup! Also, where tf was the maid of honour in all this? Literally, her one job is to make sure the bride to be has a fantastic time, but it just sounds like she, and the other bridesmaids, thought there was drama and fed into it as opposed to looking out for the bride.\n\nWhy did no one offer to order an Uber for the friend who was clearly upset? Why did no one take the friend aside while the others kept the party going for OP? \n\nKicking her out of the bridal party seems like an overreaction, imo.\n\nShe could've just had a sit down with the other bridesmaids and been like, \"I love that you were there for my friend. I think we all need a redo of the Bachelorette party, minus my friend. She's still a bridesmaid, I just want to be respectful of her coming to terms with her diagnosis.\"",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 51,
                      "content": "New trauma and not knowing the triggers that go with it since it's Satan's scavenger hunt to learn them, she couldn't have predicted what was coming or a plan for managing it. Crappy situation but stuff happens.",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "This",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 219,
                  "content": "She’d sat on the information for months.\n\nThat doesn’t imply “overwhelmed”\n\nIf she was that upset, she could have excused herself and explained later",
                  "id": 66,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 100,
                  "content": "Yeah I don’t think so. She sat on the information for months. She may have been feeling badly about it but she could have told her at any point before the party of after. NTA imo.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "She knew for three months.  She made her friends bachelorette party all about her by divulging the information months after she knew about it. She definitely didn’t deserve to be in the wedding party after she ruined the bachelorette party.  Why give her an opportunity to ruin another life milestone of the bride and groom.",
                  "id": 68,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "No no. Compassion is not permitted. Parties take priority over any other life event. Half the wedding party could be blown up in an explosion, but god forbid the attention be diverted from the bride for a nanosecond.",
                  "id": 69,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "She was being way over dramatic. Literally, nothing in her life changes with this news, other than her view of her mother. Which should probably stay between the friend and her mother. \n\n\n She didn’t need to bring this up at OP’s Bach party and she definitely didn’t need to act like she just found out she was dying.",
                  "id": 70,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "Maybe! But we can only control our own actions and treat people the way we would want to be treated. Maybe the friendship won't survive but it was worth a dialogue.",
              "id": 71,
              "comments": [
                {
                  "score": 139,
                  "content": "Sometimes people have falling outs and need space. \n\nNot wanting her in a major event of your life after she’s already made a smaller event about herself seems fair. I wouldn’t want to look back on photos of my wedding and sourly remember an ex friend or tension",
                  "id": 72,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Agree, she is still invited though, and removing her as a bridesmaid doesn't mean that OP will unfriend her too. She just want her day to go as expected and leave the bes memories to her for she deserves it.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I really wish some of the other people at the party would have interceded on the bride's behalf. Like the MOH could have said, \"Oh no, this diagnosis is a really heavy thing! We want to hear about this. Can we meet for coffee at a less chaotic time, when we can be more focused on listening? We totally understand if you're not comfortable going in the limo. How about if you and I just stay here and chill for a bit while the others carry on with the special stuff they've had planned? Or I could drive you home if you're not feeling like a party. Give me a hug, brave girl. We are here to support you and will still be here when our dear friend's special night is over.\"\n\nI'm irritated that every person at this party apparently dropped the bride in order to play therapist. Not one single friend had her back and realized that this was a problem? No one tried to salvage things, which could have been done? There are a bunch of ways this problem could have been solved.\n\nI definitely understand why the bride is upset. I also have compassion for the person with the diagnosis. FAS does mess up your ability to read the room. This was something a third party could have helped with.",
              "id": 74,
              "comments": [
                {
                  "score": 6,
                  "content": "Yes, I agree. I also wondered about that!\n\nI can only assume that either they don’t know her well or they’re all used to dropping everything to focus on her when her emotions escalate quickly and it’s a common pattern over the years",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Normally I would agree but FAS is one condition that messes with your cognitive and impulse control and apparently she's gone her whole life without getting any treatment for it.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 377,
          "content": "I doubt it was retaliatory as much as “I can’t trust you not to make my wedding day about you.”",
          "id": 77,
          "comments": [
            {
              "score": 32,
              "content": "I was surprised she's even allowing the person to go to her wedding. Who knows what she's going to trauma dump there.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 292,
          "content": "You’re making a very large and very uncharitable assumption that it’s “retaliation, pure and simple”. \n\nThink for a moment about how one chooses their wedding party. It’s mostly about who you want to share that moment with you. They did something shitty to OP and OP isn’t feeling great about them at the moment. OP shouldn’t be expected to share their very special day with someone they’re not feeling great about and lost trust in.\n\nBeing a bridesmaid isn’t just a perk or an honor. It’s a responsibility. They flubbed that responsibility pretty badly.\n\nIf OP confirmed your assumption then maybe I could see ESH (but to very different levels). Short of a confirmation of that, it looks more NTA, as there are other explanations.",
          "id": 79,
          "comments": [
            {
              "score": 29,
              "content": "Yeah to me whether or not friend stays a bridesmaid is more of a question of how OP feels about friend now and what OP thinks the consequences of kicking friend out would be.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 167,
          "content": "To be honest, was it retaliation??? How much champagne is there going to be at the wedding and drinking she already went ballistic on the bachelorette party… I can figure if she couldn’t keep it together that night why would she be able at the wedding… \n\nAnd all this is only relevant if OP is currently pregnant, the bridesmaid was or one person in the group was and those have no self control to avoid drinking while pregnant…. There was no reason to skip the bar… because of this fragility. It was money wasted and frankly I get not wanting to risk it happing again on the day of the wedding",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 132,
          "content": "[deleted]",
          "id": 82,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 101,
          "content": "I scanned the comments and I think there is one more thing at play that was not mentioned. FAS can impair the brain beyond just a learning disability in the context of school. It is possible that the friend has some trouble with reasoning and understanding consequences.  It doesn't seem like OP knew this and so I don't think she should be blamed for her immediate reaction, but maybe with a little more knowledge she can forgive her friend.\n\nI think this is a clear case of NAH.\n\nhttps://www.mayoclinic.org/diseases-conditions/fetal-alcohol-syndrome/symptoms-causes/syc-20352901",
          "id": 83,
          "comments": [
            {
              "score": 133,
              "content": "It doesn’t matter what someone has, if they are willing an able to destroy major life events for you, they are not automatically deserving of a seat at the table. If you want to include them, great, if you don’t, great. Excusing someone for ruining a bachelorette party by dropping emotional information she had known about for 3 months is just someone hijacking a social gathering to make it all about them.  This was the brides bachelorette party, a major day in her life, and she had it hijacked and ruined by someone who had held that information until all of their friend group was gathered, and made it all about her.  If she had found out that day, or that week, completely different scenario, but even then, it’s not the time or place to dump your emotional baggage.  This was a decision by the “friend” and it ruined the bachelorette party.",
              "id": 84,
              "comments": [
                {
                  "score": 17,
                  "content": "We don’t know why she revealed the info when she did. Just by her taking OP aside to reveal this to OP I figure she didn’t want to make it about her but probably just felt more comfortable saying it then because she was having a good time with friends. \n\nPeople can do dumb things without malicious intent. We have nothing that indicates this was instead her wanting attention.",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yeah I agree - unpopular opinion I guess but this person held the info until OP's event then disclosed it there to make it about her on purpose.  I don't think OP is at all unreasonable to not want this person to make the rest of the wedding about her too and therefore NTA - I'd just give up and elope rather than spend tens of thousands of dollars to have an ostensible wedding celebration where the friend is actually the focus of conversation (and again, given the sitting on this information for months and then disclosing it at the bachelorette party, this was clearly intentional, so totally understandable of OP not to want to assume there will be no upstaging behavior at the wedding, and even if the friend isn't trying, now if she's standing up there, everyone is going to be talking about her - honestly this may be true even if she's *not* standing up there now, this drama may have upstaged the wedding).",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "If we're to assume the FAS person has poor self control and a lack of understanding how consequences work then that seems like even MORE of a reason to exclude her from the bridal party and maybe even the wedding.  \n\nOP doesn't need to be an anxious wreck on her wedding day because they're worried about what other trauma dumping and woe is me type stuff the \"friend\" might spill.",
              "id": 87,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 3,
              "content": "I have a friend who is a set of triplets and all 3 have FAS and my friend is the only one is a functioning adult but one sister got married and has a baby but has developed remembering important things like feeding her baby so she and her husband live with her parents so they can help her and this is a recent development and the middle daughter is functioning like a 12 year old and very short attention span. These girls are in their 20’s.\n My friend seems to be doing great but she gets overwhelmed very easily and will lash out when she gets over tired and she doesn’t realize it until later.\n My friend and her sisters are adopted.\n\n My friend said that they all have different personalities and they each have different triggers such as routines.\n\n My friend said that her parents sent the middle child to church camp but since she didn’t have her routines they had to go get her so I am wondering if OP’s friend was also overly tired and overwhelmed. My friend did say once that even though they knew about their FAS they still have trouble with following through with big things like planning for a holiday or something away from home or something big going on in their lives and they would just say that it was not a big deal but the bigger the event the bigger the issue of following through with certain things and activities.\n \n OP please talk with your friend. She may not realize how you feel about her taking the opportunity from you. Being a bridesmaid may truly been to much for her once she realized how close to the wedding is. I honestly don’t think she did it on purpose or for attention but she took something from you that can’t be replaced.\n\n Someone suggested that you have a do over for your bachelorette party and just not invite her. That would be a great idea for you and your other bridesmaids.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 90,
          "content": "No, no,no she did that on purpose! She intentionally waited for that night to say anything. Op is NTA by a long shot!",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Dude this comment just shows how ignorant this subreddit it. JFC.",
          "id": 90,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 29,
          "content": "Excellent response! I understand OP being upset because friend had known for months so friend could have picked another day to talk about it, but people shun people for trauma all the time and friend DID try to take OP to the \\*side\\* and talk about it. Friend did not stand up on a table and start bawling. \n\nEverything you said about this warranting a conversation before totally icing someone out is valid.",
          "id": 91,
          "comments": [
            {
              "score": 11,
              "content": "She's having her at the wedding, just not in the party. That's not totally icing someone out. And why would you put someone in your wedding party that could potentially derail it?\n\nShe needs that party to be focused on her on that day, not dealing with her friends trauma.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8167,
      "content": "NTA: She knew for three fucking months. She knew what the hell she was doing.",
      "id": 93,
      "comments": [
        {
          "score": 1523,
          "content": "She definitely picked a bad time, but idk how much she chose it, exactly. A FAS diagnosis is seriously traumatic - it is something that was done to her by her own mother, before she was ever born, that was a preventable result of her mother’s actions. And coming to terms with that is an additional layer of trauma. \n\nI think it’s totally understandable that she may have had some un-dealt with trauma related to alcohol that she only discovered when it was triggered. Appropriate timing, of course not, but it may have been the first time since her diagnosis that she was around heavily drinking women.\n\nObviously even if this is the case OP is still justified in being upset that the terrible timing ruined her engagement, but it seems so heartless to cut someone who was likely facing an unknown trigger.\n\nFAS has a seriously bad reputation - it’s really hard to come forward about, because it means that your own mother did this to you, and everyone who knows about FAS thinks of the stereotyped extreme - the type with the FAS facial deformities. Many diagnosed with it feel that it has to be kept secret, if they’re at all able to mask it or it’s mild enough to just be passed off as learning difficulties.",
          "id": 94,
          "comments": [
            {
              "score": 330,
              "content": "My mom has genetic cancer that I will now have to get tested for myself. Many many things can be passed genetically. Also FAS can be caused by a little as a drink or two and can occur during any trimester. Also, plenty of prescription and over the counter medications and supplements\nCan be harmful and do similar things If not worse. As can even some foods and even skin creams and makeup (ie retinol and swordfish and tuna)",
              "id": 95,
              "comments": [
                {
                  "score": 233,
                  "content": "Yeah; my mum took a specific type of antidepressant while pregnant with my older sister and as a result my sister does not produce enough serotonin. She will be on antidepressants for her whole life just to get to a baseline healthy brain. Mum’s side of the family has also got a history of breast cancer, and endometrial issues. Joy of joys!",
                  "id": 96,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Thanks for sharing! What type of antidepressant caused this? My GP ok’d Setraline, an SSRI, and my Psychiatrist and I discussed my continuation of Duloxetine, an SNRI, during my recent pregnancy. How did your family find out this was the cause vs passing down something like this genetically? Apologies if these are really specific questions, I just want to be prepared in the future in case it affects my child as well!",
                      "id": 97,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "I have gentled a bit in my stance since I wrote this, so I do see what you’re saying, it may not have been the mother’s intent to drink while pregnant. I will say i do think her mother should have had an eye out for any issues that came up as her child grew, knowing that it could have an impact of development, but also accept that she may have felt too much guilt and therefore found it easier to be ignorant, or that she genuinely didn’t know, as education on FASD isn’t great. Like how I don’t blame mothers who took thalidomide and did not know how it could affect their children. At the same time, to have trauma and complicated feelings as a result of this diagnosis isn’t unreasonable either imo. \n\nI’ve got to go get tested soon for one of those genetic cancers too, actually. Didn’t know until my mum narrowly survived said genetic cancer a few years ago.",
                  "id": 98,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Sometimes the symptoms aren’t super apparent, and like the comment you’re replying to said, it can happen with just one or two drinks even before the woman knows she’s pregnant. I doubt she felt such overwhelming guilt while her daughter was growing up that she ignored any and all symptoms of fasd. A lot of people don’t find out until adolescence or adulthood.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Not to mention, it can even be caused by the father having alcohol in his system when the child is conceived.\n\nhttps://edmontonfetalalcoholnetwork.org/2016/05/27/can-men-who-drink-have-a-baby-with-fasd/amp/\n\nLess common but not all FASD comes from a mother being irresponsible.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "A bunch of mental disorders are genetically linked. Mothers pass down mental illnesses that cause significant life disruption all the time. FASD isn't special in that regard.",
              "id": 101,
              "comments": [
                {
                  "score": 106,
                  "content": "Not really the same thing as choosing to drink while pregnant, often in late stage pregnancy.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 199,
                      "content": "To be totally fair, it can also be from early stage drinking/before the mother was aware of her pregnancy, which is a very tragic outcome.\n\nAnd I’ve known a few people who had hereditary illnesses who had complicated feelings about their parents’ choice to reproduce, knowing their kids would likely inherit them too",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "This comment is what I was looking for. The trigger of being in a group of drinking women, and possibly drinking herself,  is what I expected set her off as well. And these women are likely her closest friends, so she felt like she could confide in them.  Sucks that the plans got ruined, but shit happens. At least you still have the wedding to look forward to. ESH.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "She should talk to a therapist about FAS, not make it about her at a bachelorette party and potentially a wedding that costs tens of thousands of dollars.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Actually recent studies have shown that symptoms of fasd can be caused by even one drink early on in the pregnancy so it could be that her mom drank before she even knew she was pregnant, not every mom of a kid with fasd is terrible and chose to drink while knowing they were pregnant",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Yeah, I'm leaning towards NTA too. \n\nI was MOH for my bff recently and a girl in her bridal party had a traumatic incident happen the morning of the wedding (her brother had to have emergency brain surgery). She came to me quietly and explained the situation, and said that she didn't want to take away from the wedding, and asked me to cover for her when she needed to leave to answer phone calls, cry, whatever. \n\nI helped her out, made up excuses when she needed to slip away, made sure she had everything she needed, and the bride had no clue.\n\nShe and I weren't even close, but she knew that if she told the bride, the focus would be taken away from the wedding. She got the support she needed to handle her emotions without ruining the wedding day.\n\nThe bridesmaid in OPs story knew for months. She could've cried about it at any other time. She either chose that moment maliciously, or something came up during the bachelorette and she didn't regulate her emotions properly.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "While I agree that three months is a long time to sit on the info, I wonder if it changed the friend’s relationship with drinking. She might not have intended to share in that moment but may have had an unanticipated reaction to being around social drinking.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yep. If she suddenly felt terrible on the day she should have bowed out. If she felt terrible at that exact moment, she should have asked OP and friends to go on without her. Just so many chances for friend to be unselfish but she wasn’t.",
          "id": 109,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "They were doing heavy drinking at a party and she spilled somethings her had been wrestling with.\n\nHow is that make her an asshoe?",
          "id": 110,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5884,
      "content": "Big NTA. I don't understand the y.t.a comments. She had 3 months to process her diagnosis and ask for support from friends. The thing that really angers me is that she turn a special moment that was supposed to be about having fun into something sad. And quite literally ruined your plans by using social pressure, because if you wanted to go to the bar anyway you would have looked like you don't care about her.\n\nI honestly wouldn't invite her to the wedding until she apologies, because this seems intentional.",
      "id": 111,
      "comments": [
        {
          "score": 1563,
          "content": "Agree NTA. I would not want to be friends with the y t as. It's just a wedding! It's just a birthday party, you'll have others (and we'll ruin those too)! It's just a bachelorette! It's just a graduation! It's just a baby shower! It's just an \\[event somebody else is paying for, to celebrate something important to them, that you don't need to attend if it's a burden\\]! Waaaaaaaah why don't you invite us to your celebrations??\n\n\r\n\nMost of the time people are asking for, what, one to four days out of 365 to be focused on them, that they are also usually footing the bill for. Invitations are always optional. Why is this too much to ask of friends? Everyone should get their day.",
          "id": 112,
          "comments": [
            {
              "score": 407,
              "content": "I once declined an invitation to my friends birthday party because I had recently been laid off, was being sued and my father had passed away. I was miserable and wasn’t up to putting on a happy face for the sake of the party. I would later explain to my friend why I declined and he understood. OP probably did herself a favor. Who knows what nonsense this friend of hers would pull on the big day.",
              "id": 113,
              "comments": [
                {
                  "score": 136,
                  "content": "My sister missed her best friend's wedding because she had a miscarriage the day before and was a sobbing mess for days afterwards. She didn't want her friend's day to be overshadowed by her loss. \n\nCoincidentally, her \"best friend\" is no longer her best friend because she called her and screamed at her for not coming to the most important day of her life, and even when she knew the reason why, said she couldn't be her friend anymore, but that's another story.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 18,
                      "content": "God your poor sister.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 168,
              "content": "This! ⬆️ Hard agree with this. Please take my poor person’s award🥇",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": ">It's just a wedding! It's just a birthday party, you'll have others (and we'll ruin those too)! It's just a bachelorette! It's just a graduation! It's just a baby shower! It's just an \\[event somebody else is paying for, to celebrate something important to them, that you don't need to attend if it's a burden\\]! Waaaaaaaah why don't you invite us to your celebrations??\n\nI've said this exact same sentiment before (about how weird people here get to people's special days), and treating the event-throwers as if they're selfish for making a SINGLE. FUCKING. DAY. about them. They paid for it! They put in the work and the effort, why should it be selfish to hope for just a little bit of attention for A FEW DAYS during your ENTIRE life?!?! It's not like you're asking to be the center of attention at all times, in all events, every single day, NO - just a SINGLE day of acknowledgement seems to be too much for most AITA people to wrap their heads around.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "> It's just an [event somebody else is paying for, to celebrate something important to them, that you don't need to attend if it's a burden]! Waaaaaaaah why don't you invite us to your celebrations??\n\n100% this! Honestly her friend should cover the costs of the limo and everything else they missed out on. Imagine losing thousands of dollars because for your bachelorette party and others are expecting you to be cool with it when your friend had 3 months to discuss this issue.",
              "id": 118,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 292,
          "content": "Honestly, this OP reads like the straw that broke the camel's back. For that reason NTA",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 245,
          "content": "Yes, she and the other bridesmaids owes OP an apology. I don’t understand why thought it was okay to cancel the whole thing like that. It was best because they could cancel her wedding if they think the friend is upset",
          "id": 120,
          "comments": [
            {
              "score": 17,
              "content": "Yeah if I was op I might “fire” all the other bridesmaids too.  The party wasn’t messed up just because one bridesmaid had a breakdown (intentional or not), all the other bridesmaids decided to completely derail it!",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 130,
          "content": "Exactly. Three months is too long for this to be a natural breakdown. NTA",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 95,
          "content": "Agreed. NTA. So many people are tiptoeing around other peoples feelings and honestly some people just want attention. It’s a bit of a crap thing to happen but not to be disclosed on someone’s special planned day. \nWake up and smell the entitlement.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 68,
          "content": "I doubt op will,ever see her again.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "This is the part that gets me. I don't understand these Y T A comments when the timing of her disclosure is so important. If she had just been diagnosed a few days or even a week or two prior, I can totally understand her breaking down about it at an inopportune time (and if this happened to me, I would be profusely apologizing all while crying and probably excuse myself from the celebration because I wouldn't want to bring anyone down). I would be mortified, even if my breakdown was understandable.\n\nI don't think people are realizing how long 3 months is to sit on a diagnosis. Think about your life on January 11th this year, and now think about how LONG ago that was and how easy it would have been to call a friend and get some help between then and now. She waited until a very important and fun day for someone and brought everyone down. Whether she did it on purpose or not doesn't matter; if she held it together for 3 months, she could have done it for ONE MORE EVENING. NTA, OP.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "She's the type of person who'd take the mic at the wedding and making the day all about her.\n\nPersonally, I wouldn't let her anywhere near my fucking wedding. The bride can say she inherited an asshole gene that makes her act out in fucked up but exciting ways.\n\nNTA\n\nAnd that's coming from someone who's never had the displeasure of getting married.",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "There's an argument being made that she was triggered by the fact that they were all going to go to a bar and drink, but I don't buy it either. She knew what the party would entail, showed up anyway, then had a breakdown. She could have excused herself from the function in advance, or during. \n\nWhether intentional or not, she basically guilted everyone into not going forward with their plans without giving them any advance notice. If she had contacted people sooner they could have adjusted plans, gone to a show or dinner or something instead of bar hopping. If she had a sudden trigger, she could have excused herself, said she would call later to talk about it, and for her friends to please enjoy themselves.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Not only that, OP spent money on a limo, that didnt end up being used bc her friend decided to trauma dump",
          "id": 128,
          "comments": [
            {
              "score": 3,
              "content": "That's the worst part of all",
              "id": 129,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2962,
      "content": "I have been in several situations where someone has had to turn another's happy occasion into all about themselves. NTA. Yes, you deserved to have your own moments. It is too bad that someone couldn't have escorted your friend home and stayed with her a bit to get her off of your case.",
      "id": 130,
      "comments": [
        {
          "score": 260,
          "content": "Yeah, this is what should’ve happened ideally (or if it was a destination party, someone stayed behind with her while the rest went out).",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 121,
          "content": "It's called main character syndrome. \n\nBasically a soft way of calling someone an asshole.",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "People who do this, always do this. If this is the first time the friend did it I would give them the benefit of the doubt.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2486,
      "content": "INFO: But it's info I think you should get from her. Was this the first time she was going to be around a bunch of alcohol since the diagnosis? If so, is that what triggered the disclosure at that moment? She may not have known how she'd feel about it, and it caught her by surprise. I think you kind of feel like this was intentional, but it might not have been",
      "id": 134,
      "comments": [
        {
          "score": 741,
          "content": "this exactly. perhaps either being drunk or being around the alcohol prompted the confession. i'm sure id have quite a moment being around alcohol after finding out my mom drank while pregnant with me",
          "id": 135,
          "comments": [
            {
              "score": 458,
              "content": "I think it's also the kind of thing that could hit you unexpectedly. Or, the friend was trying super hard to suck it up for months, and at the last minute, she just couldn't do it. I really suspect that it wasn't intentional. People talk a lot about how posts on here are often clearly OP isn't the AH and people around them are just super abusive or OP is clearly the AH and a narcissist who just can't see it. I think a third super common one is that there's been some kind of breakdown in communication",
              "id": 136,
              "comments": [
                {
                  "score": 250,
                  "content": "Then she should have left. Made an excuse and left imo",
                  "id": 137,
                  "comments": [
                    {
                      "score": 208,
                      "content": "The OP says SHE chose to cancel the limo and it was her other friends who took notice first. I wonder if OP is putting full blame on the friend but it was as much the other bridesmaids that caused the shift. I don't see why they couldn't have ended the night differently. \n\nIf you are experiencing a trauma response and people you *think* are your friends rally around you and try to make you feel better, that can give the impression you've got permission to trauma dump and be supported. If they later get mad at you, that's super confusing and hurtful.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 90,
                      "content": "Tbh that might have prompted the confession \"I recently found out that I have FAS so I might have to leave early/ can't go with you\" and then she just got overwhelmed.",
                      "id": 139,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 176,
          "content": "I think this is exactly what happened. I think the friend made a bad judgment call by trying to come to this event when she knew there'd be drinking and it clearly was too soon after the dx. There is SO much pressure in bridal parties these days. I'm wondering what kind of bride we're dealing with here....",
          "id": 140,
          "comments": [
            {
              "score": 146,
              "content": "Then just leave, don’t make the event all about you and piss away the money of the bride, and hijack a major life experience.  It seems to me that if you know your diagnosis for thee months, you can figure out how to deal with it, without screwing over your friends.  If you can’t, expect to get disinvited to weddings after you completely screwed over your friend and ruined her bachelorette party.",
              "id": 141,
              "comments": [
                {
                  "score": 89,
                  "content": "If she was doing it on purpose she would've announced it to the room or told OP right there. Instead, she pulled OP aside. That tells me she was trying to be discreet and wasn't able to keep it together.",
                  "id": 142,
                  "comments": [
                    {
                      "score": 24,
                      "content": "I can sympathize and she can still be in the wrong. Can't hold it together and going to ruin a once in a lifetime event? \"Oh I'm sorry I'm feeling light headed and sick all of a sudden. I'm gonna call an Uber don't worry about me\". You can explain in a couple days.",
                      "id": 143,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "It’s also very much assumed there’s going to be alcohol at a bachelorette party it’s not like that was a surprise. This girl is very self centered and I don’t blame OP for doing what she did",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 79,
              "content": "One that uses the term \"firing my bridesmaids\" which is a rather crass way to discuss your supposed closest friendships.",
              "id": 145,
              "comments": [
                {
                  "score": 15,
                  "content": "This is my thought. Unless you hired them, you're not firing them. Who wants to talk about friends and family like they're employees whose performance you aren't sufficiently pleased with, anyway?",
                  "id": 146,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "This is exactly why she’s an AH imho. This firing term makes it sound retaliatory AF.",
                  "id": 147,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 43,
              "content": "I do too, but it sounds like the bride thinks it was intentional. It could be that this is a pattern for the friend, and if the friend intentionally waited to bring it up until the event, kicking her out of the bridal party would straight up be the best call. But the fact that OP only mentioned the fact that the friend knew for a while as reasoning for the decision, I suspect the bride could just be really stressed and stuck in Main Character Mode, which is fair when it's your wedding so you *are* the main character, but I think that may have made the bride not fully think through what happened. It feels like the kind of thing OP might regret not talking out later. Hell, OP might still land on the friend not coming if it turns out alcohol is a huge issue, but it seems like further discussion might be needed",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": ">She may not have known how she'd feel about it, and it caught her by surprise\n\nThe thing is, even if it caught her by surprise, she could have thought a  minute or 2 about it and what she wanted to do. She could have kept it short and told the friend that she wasn't feeling well and excused herself to go home, saying that she thought it would be fine, but aparently it wasn't and had to leave, and talk to her later (after the weekend for instance). That would have also sucked, but this way, she could process her feelings in peace, and the bacholorette party didn't need to be (semi-)canceled.",
          "id": 149,
          "comments": [
            {
              "score": 19,
              "content": "100%. People aren't perfect and I know from personal experience that sometimes things you didn't think were bothering you pop up at inopportune times. But lord, when that has happened to me, I've made an excuse and gotten tf out of the situation that triggered me, for the sake of my friend's fun time! Especially if it was a special night like a birthday or bachelorette party. I would have been MORTIFIED if I made a friend's night all about me and they cancelled their plans to sit with me and cry. Especially when I had 3 months to come to terms with it. NTA.",
              "id": 150,
              "comments": [
                {
                  "score": 13,
                  "content": ">they cancelled their plans to sit with me and cry\n\nWell, if it's to cancel their movie night at the theater, or going to the mall type plans, then it's not an issue to cancel when your friend needs you and vice versa. But with once in a lifetime experiences like your bachelorette party, yea that's very different",
                  "id": 151,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I agree, there are times when cancelling plans to support a friend are warranted. But a Bachelorette or birthday party is definitely not one of those times.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "Plus one of the major impacts of FAS is poor impulse control. The friend’s disability may have had a direct impact on her bad timing with zero malice or intent to steal the spotlight.",
          "id": 153,
          "comments": [
            {
              "score": 72,
              "content": "And if that’s the case then I don’t see why it’s inappropriate for OP to decide she doesn’t want someone with poor impulse control as a bridesmaid. I have ADHD and poor impulse control but it’s still my responsibility to manage and the world doesn’t have to just accept it.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Which would mean it's a bad idea to have her at another bigger event",
              "id": 155,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "I mean she’s had it her whole life tho??? \n\nGuys she didn’t just get FAS. If she had such poor decision making her entire life, I don’t think OP would have been as surprised and thrown!! \n\nBut clearly this is some interesting new behavior. She was just diagnosed, but she’s had this her entire life literally since birth. It’s a bit rich that suddenly she has a disability that prevents her from stealing the spotlight accidentally.",
              "id": 156,
              "comments": [
                {
                  "score": 3,
                  "content": "Exactly why op is a good friend, she kept her in the wedding as a guest. Knowing she couldn’t be a bridesmaid, rather then kicking her out she kept her as a gusst",
                  "id": 157,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "And what's to prevent that from happening again at the wedding? When there will be even more alcohol and more stress?",
              "id": 158,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "If thats the case, why would you still want someone with poor impulse control on the wedding? She'll be around alcohol at the reception, i wouldnt trust her not to start this whole thing again on a bigger scale",
              "id": 159,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "You know what I didn’t think about this. Thanks for that.",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "This. It’s the only explanation where neither here are TA, whereas if this was planned then the friend would be one.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "or maybe they were bonding and that was the moment she felt secure and intimate enough to share this info.",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Also how often do they see each other? Sometimes you can know something and not be ready to talk about it and then it comes out at a time that is inconvenient, but it’s still important. I don’t think we have enough info here, either.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Yes, also do you see her regularly, or was this getting together after a long time of not seeing each other?",
          "id": 164,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2127,
      "content": "NTA\n\nShe either knew what she was doing and intentionally undermined you\n\nOr she’s incredibly self centered and had no idea she was making it all about her\n\nBut either way I wouldn’t trust her to not pull similar at the wedding",
      "id": 165,
      "comments": [
        {
          "score": 343,
          "content": "I feel like she weaponized her tears to make OP look bad if she tried to celebrate.",
          "id": 166,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "I think it’s the second one.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "My aunt has FAS, she’s always been extremely self-centered and selfish.  Her brain age is about that of a 15 year old.  My dad has shared NUMEROUS stories about awful things she did because she was only thinking about herself.  She stole so many things from him and she literally bled my grandmother dry over the years because she knew exactly how to manipulate her - “I can’t afford groceries to feed my kid” or “his epilepsy medicine is too expensive, I need money” was the usual.  And then she’d instead go get her hair done or buy an expensive car that she could barely afford payments on.\n\nDon’t get me wrong, I loved my aunt growing up but she was an incredibly toxic person.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 773,
      "content": "NTA. There is a time and place for everything.",
      "id": 169,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 577,
      "content": "ESH\n\nShe knew what she was doing that night since she’s known her diagnosis for months. Maybe the bar scene was upsetting, who knows. But she could have redirected the conversation at some point, could have still used the limo, or merely said - thanks for listening. Let’s go dancing now!\n\n(And I say this as someone who didn’t really do a bachelorette party so it’s not like I’m heavily invested in the experience or something.)\n\nBut you also suck here. \n\nThrowing her out of the wedding party seems extreme, at least at this point. Why not say that what happened at your bachelorette party hurt your feelings and why. Then tell her you don’t want a repeat scene at the wedding. Ask if she believes that will be an issue. You get the idea. If she apologized it would have been fine. But you never gave her the chance to make amends.\n\nEdited: Typo",
      "id": 170,
      "comments": [
        {
          "score": 450,
          "content": "Honestly, for a long time in my adult life, 1/3 of alcohol related events with a lot of women ended up with one of them crying. Like, some men get douchy when they’re drunk, and some women cry. It stopped around 34 for some reason. \n\nAdd in someone who recently learned that their life has been horribly and permanently affected by alcohol being surrounded by it - while probably drunk herself - and she’s bound to get all up in her feelings. She may not even have intended to tell — that’s very personal information, but drunk people do be like that. \n\nClear ESH. Friend picked the wrong time to have an existential crisis. But OP is punishing a friend for a bad night in 20+ years of friendship. That’s crazy to me. Incidentally, someone cried at my bachelorette - my fault for not realizing that it was an emotionally fraught date for her that she was trying to power through - I drunk smoked her cigarettes while I calmed her down and then we went back to the party. I was more worried that SHE wasn’t having a good time because she was my friend and I want nice things for my friend",
          "id": 171,
          "comments": [
            {
              "score": 160,
              "content": "This response is really kind and as someone who has previously known a few people with FAS, I appreciate seeing this graceful response between all of the ‘she totally knew, it’s her fault to ruin OP’s day (legal field, related to children in foster care. Big surprise, kids who’s parents aren’t fit parents because of addiction or dependency probably had those dependencies through the pregnancy as well…). \n\nShe definitely picked a bad time, but idk how much she chose it, exactly. A FAS diagnosis is seriously traumatic - it is something that was done to her by her own mother, before she was ever born, that was a preventable result of her mother’s actions. And coming to terms with that is an additional layer of trauma. And of course, the lack of social awareness etc is also classic FAS. \n\nI think it’s totally understandable that she may have had some un-dealt with trauma related to alcohol that she only discovered when it was triggered. Appropriate timing, of course not, but it may have been the first time since her diagnosis that she was around heavily drinking women.\n\nObviously even if this is the case OP is still justified in being upset that the terrible timing ruined her engagement, but it seems so heartless to cut someone who was likely facing an unknown trigger.\n\nFAS has a seriously bad reputation - it’s really hard to come forward about, because it means that your own mother did this to you, and everyone who knows about FAS thinks of the stereotyped extreme - the type with the FAS facial deformities. Many diagnosed with it feel that it has to be kept secret, if they’re at all able to mask it or it’s mild enough to just be passed off as learning difficulties.",
              "id": 172,
              "comments": [
                {
                  "score": 61,
                  "content": "Your comments on this post are giving me hope.  We foster medically fragile infants, who often have in-utero drug & alcohol exposure, and it’s frustrating to see so many commenters not understand the stigma & shame that often accompany a FASD diagnosis.",
                  "id": 173,
                  "comments": [
                    {
                      "score": 16,
                      "content": "You guys do really essential work, I wish you all the best.",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "That was a decent, caring thing to do for your friend.   You're a good person.  😊",
              "id": 175,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I had to scroll way too long to get this sort of response… this is the compassionate & non-narcissistic perspective. Thank you!",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 408,
      "content": "NTA. While I can sympathize with her, and understand her wanting to talk about it, this was definitely not the time or place for it. \n\nShe hijacked your bachelorette party, and made it all about her. \nI wouldn’t trust her, not to do the same thing, during your wedding.  While some people may feel your an AH for doing it, I believe it’s better to be safe than sorry in this situation. \n\nCongratulations, and I hope you and your fiancé have a wonderful wedding.",
      "id": 177,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 345,
      "content": "Eh, I'm going to go against the grain and say NAH on this one.\n\nI 100% believe that your friend deserves love and support and understanding about her diagnosis--it seems to be weighing on her and she's struggling to process it. You can't just shut off your feelings in a case like this, and having spontaneous hard feelings doesn't make her an AH.\n\nThat being said, there's a time and a place to bring sensitive personal information, and in the middle of a friend's celebration isn't it. Surely she knew what was planned for the night? If she wasn't comfortable going to a bar or partying with you, she should've discussed this with you beforehand and opted to stay home or leave early. There was really no reason to bring this up in the middle of your bachelorette party, especially since it wasn't brand-new information. She had ample opportunity to discuss this with you literally *any other time*. So yeah, I get why you're upset, too.",
      "id": 178,
      "comments": [
        {
          "score": 6,
          "content": "You wrote out what I came here to say so no need to repeat. NAH.",
          "id": 179,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}