{
  "post content": "My husband (28m) and I (29f)have been together 8 years.\nHe has a habit of not responding when I talk that drives me up the wall and honestly makes me feel terrible. It feels like what I say doesn't matter and that he's just waiting for me to stop talking.\nWe will be sitting down looking right at one another and I will be telling him about something (today was about issues I'm having with my doctor) and he will just not respond.\nNo \"wow that sucks\" \"damn\" \nNothing.\nThis is something I've spoken to him about a LOT. He just doesn't see anything wrong with it. \"Not everything needs a response\" \nAt this point we are on complete opposite sides with no one budging.\nHe thinks this is just how he is and I need to get over it.\nI think he needs to work on his behavior because it should be an easy enough change for him to make and its something that HURTS me.\nSo AITA for Making this a problem and starting a fight?",
  "id": 1,
  "comments": [
    {
      "score": 56,
      "content": "ESH you married what hurts you not sure what you want.",
      "id": 2,
      "comments": [
        {
          "score": 19,
          "content": "Holy shit- you married what hurts you. \nThat just resonated with me on so many levels. Thank you. \nAlso- you are correct- ESH.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 16,
      "content": "YTA. You’ve been married for 8 years, you would think you’d be able to accept him by now. My wife is very similar. She has trouble thinking about how to respond so often times she doesn’t. Like you it used to drive me up the wall but when I sat down and thought about the only thing that wasn’t working was my expecting a response. I wanted her to change for me but wasn’t willing to accept her. Instead of getting mad when she doesn’t respond I wait a bit to see if she has something to say and either continue talking or ask a question that needs a response.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 15,
      "content": "NTA\n\nYour request is reasonable--most people want a partner who's supportive, validating, and good at active listening.\n\nI'm sorry your husband isn't keener to try harder to meet your emotional needs--perhaps you can talk him into starting marriage counseling. And maybe counseling could help you frame your request in a way that emphasizes your feelings and minimizes the chances he'll perceive it as an attempt to control his behavior (maybe you already do this, idk).",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "This isn't \"not responding.\"\n\nThis is \"stonewalling\" which is basically just shutting down communications.\n\n[https://en.wikipedia.org/wiki/Stonewalling#Relationships](https://en.wikipedia.org/wiki/Stonewalling#Relationships)\n\nEdit: This is supposed to come much later on in a relationship as it breaks down. If he was always like this then it's a hard to imagine you'd have married him in the first place- was he always like this?",
      "id": 6,
      "comments": [
        {
          "score": 17,
          "content": "You must have some pretty impressive training and insight to identify and characterize someone's behavior by another person's one-sided description.\n\nNot that it could just be that there's a personality difference and he's just stoic. Nope, he's abusive. I love Reddit.",
          "id": 7,
          "comments": [
            {
              "score": 11,
              "content": ">he's just stoic\n\nYou should look up the meanings of words that you are unfamiliar with. Because that word does not mean what you seem to think it means.\n\n(I would have expected more from a Douglas Adams fan.)",
              "id": 8,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "Or maybe she talks way too much.",
          "id": 9,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA\n\nHe should look into therapy or marriage counseling for you both.\n\nIf his status quo is hurtful to you, he either needs to change, or, if he refuses to, you're incompatible and may need to split up. So, which is more important to him, he needs to decide—giving his wife the emotional security/support she deserves, or doubling down on his \"accept me the way I am\" dysfunction.",
      "id": 10,
      "comments": [
        {
          "score": 0,
          "content": "This 100%",
          "id": 11,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "Have you tried mirroring his behavior so he can understand how it feels?",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "INFO: is he ADHD?",
      "id": 13,
      "comments": [
        {
          "score": 7,
          "content": "INFO: Does it fucking matter? ADHD isn't an excuse to stonewall your partner and disregard their feelings completely. Stop giving people with ADHD a bad rap and stop enabling fucked up behavior.",
          "id": 14,
          "comments": [
            {
              "score": 4,
              "content": "I ask because most of my family are ADHD and can zone out when someone is talking to them without realising they’re doing it. If he realises he’s doing it and does nothing about it, that’s not acceptable. If he mostly doesn’t realise he’s doing it and doesn’t know he had ADHD, it might helpful for someone to suggest he go get a diagnosis and some methylphenidate.\n\nOh and btw: maybe get off your fucking high horse and stop acting like you own all knowledge and experience of ADHD? *And thanks so much for your charming and constructive comment.*",
              "id": 15,
              "comments": [
                {
                  "score": 18,
                  "content": "**Yes, he realizes he is doing it and does nothing about it. That is literally what this post is about.** She is fucking begging her spouse to even act like he gives a shit about what she has to say but he is straight up refusing. Did you even read the post? This is such a repeated issue for her that she is at a breaking point over his behavior. He isn't getting distracted or zoning out once in a while. He is ignoring her needs time after time. **Continuously disrespecting your partner is NOT a symptom of ADHD, it's a sympotom of being an asshole.**",
                  "id": 16,
                  "comments": [
                    {
                      "score": 3,
                      "content": "And, for all your shouting other commenters down, and telling them their opinions don’t “fucking matter” (how to unsuccessfully bully fellow Redditors into submission, by KartlindWitch), it actually does still matter. OP venting her frustration on here could be what leads to her husband getting a diagnosis and treatment. Now, he might still be an AH, with or without ADHD. But at least this way he can be an AH with meds. And maybe he and his wife can understand a bit better which behaviour is neurodivergence and which is just being an AH.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 0,
                      "content": "Well, it takes one m’dude. Please stop yelling at me in bold.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -1,
              "content": "It does \"fucking matter\" actually. My gfs the same way, dxed with adhd. She doesnt experience the world the same way i do (i have autism). Sometimes a few moments will feel like hours to her, and in that \"long time\" she'll forget what ive said, or that its her turn to respond. Saying someone could have a REASON is different than saying they have an EXCUSE.\n\nAlso the dude could just be, yknow, like that. Quiet? A lot of people are. I dont always think i need to respond to everything, though to this extreme i *would* argue he could pull a little weight to make his wife more comfortable.\n\nAnyways yada yada not everything is a sign of abuse or a failing marriage. Get out of your armchair, doc. The guys just kinda weird.\n\nAlso OP, NTA. only reason husbands the AH is for not working on a behaviour that clearly upsets you.",
              "id": 19,
              "comments": [
                {
                  "score": 5,
                  "content": "I have ADHD and autism too my guy, you aren't special and neither is your wife. But I'm not so mean spirited as to regularly ignore my partner even after they beg me to show even a morsel of interest in their words. No, ADHD is \\*not\\* a reason to ignore your partner over and over and over. This post isn't about forgetting to engage once in a while (which would be a real ADHD reason), this post is about a repeated pattern of disrespect. ADHD gives you a lot of quirks and behaviors, but it doesn't make you an asshole.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 1,
                      "content": "You actually just sound mean spirited in general",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "Actually wondering the same question. I would zone out without meaning to in convos before I found out I had ADHD. At one point I thought I had horrible hearing because I zoned out often. Wasn’t until meds that I talk to others without zoning out and I can finally hear people more clearly.\n\nWanted to add that I wasn’t zoning out on purpose, but my mind without meds goes 1000 miles a minute, so while I cared about what was being said, it was a struggle to pay attention. I thought I was stupid because of it for so long and was ashamed/embarrassed by it.",
          "id": 22,
          "comments": [
            {
              "score": 4,
              "content": "Yes, THIS ❤️ That’s exactly how my brother described it. He says sometimes he is aware someone is talking to him but he literally can’t hear what they were saying. He was worried there was a problem with his hearing, he got it checked, and it was fine. Later (well into adulthood) he connected the dots and got an ADHD diagnosis. He’s now on meds which helps, but just being aware of it is half the battle. This and other ADHD behaviours have been a problem for him in relationships for years, having a diagnosis is such a blessing.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "NTA. Being ignored is a HUGE pet peeve of mine as well. Like an ok would suffice depending on the conversation but some kind of response is better than nothing and feeling like your talking to yourself or a brick wall.",
      "id": 24,
      "comments": [
        {
          "score": 0,
          "content": "Hi! My post about the couples shoot got deleted! I wanted to thank you.",
          "id": 25,
          "comments": [
            {
              "score": 0,
              "content": "You are very welcome!🩷",
              "id": 26,
              "comments": [
                {
                  "score": 2,
                  "content": "I have so many follow ups! Lol",
                  "id": 27,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Message me if you’re comfortable?",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA, if he’s not in the mood to talk he needs to communicate that. but he needs to come back when he’s ready to talk, and listen to what you have to say.",
      "id": 29,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "INFO, is he actively listening, though?",
      "id": 30,
      "comments": [],
      "relation": "No"
    }
  ]
}