{
  "post content": "English is not my first language\n\nWhen i (27M) was 6 i lost my mom. She died giving birth to my siblings (21F,21M). \n\nWhen i was 9, my dad met my stepmother. Altough i always loved my stepmom, i never called her mom, the maximum i would do is refer to her and my dad as my parents. \n\nWhen i was 18, my stepmom asked me and my siblings if she could adopt us. My siblings said yes but i refused, i explained that i loved her but i wanted to keep my mom as my legal mom. \n\nFrom that moment she started to treat me differently. I moved out soon after but i would always visit, she was cordial to me like you are with strangers, she introduced my siblings as her kids and my as her husband's son. Me and my dad tried to talk to her but she just bruched us off saying that it was all in our head. \n\n3 years ago, me and my sister became parents. With my son my stepmom would be inpatient and rude but with my niece she would be the calmest person in the world. \n\nI had enough and asked what did i do for her to go 180° on me. She said i was reaping what i sowed, that i rejected her as a mom so that she rejected me as a son. \n\nAfter that i had gaven up in our relationship, we were cordial and that was it. My dad tried many times to reconsile us to no avail. \n\n1 1/2 ago she got diagnosed with a terminal illness. Out of family i'm the one most well off so my father called me and asked me to pay for her treatments. \n\nI visited and had a talk with her. She apologized for treating me badly and said she loved me like a son and that she had a bad reaction to my refusal of the adoption and regret it. \n\nShe died a week ago, i only found out because my father called after and explained she didn't wanted me there because she only wanted \"family\". \n\nMy siblings have aproached me and asked me to pay for her funeral expenses and i have refused. \n\nThey called me and a-hole saying that i couldn't be mad for being excluded because i did it to myself when i refused to be adopted. \n\nMy wife is on my side and even tough my dad says he understands me he said i should do it for my siblings because my stepmom was their mom",
  "id": 1,
  "comments": [
    {
      "score": 10296,
      "content": "NTA at all.  Man, it's ASTOUNDING how many people think it's appropriate to spend other people's money because \"they have it\".  I get that on a societal level for various reasons but where individuals are concerned, I would say that you have no obligation even if you guys got along.  Your stepmom sounds like she was an embittered person who craved holding onto a good grudge.",
      "id": 2,
      "comments": [
        {
          "score": 2742,
          "content": "[deleted]",
          "id": 3,
          "comments": [
            {
              "score": 2079,
              "content": "And then reversed that for her funeral. She 100% wanted his money but not him.",
              "id": 4,
              "comments": [
                {
                  "score": 329,
                  "content": "Did she ever get his money for the treatments?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 803,
                      "content": "OP answered in another comment, dearest Step Mom did indeed accept money for her treatments",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 237,
                      "content": "I don’t know? But OP says she was nice and apologized when dad asked OP to pay for the treatments and visit her. And then she left instructions for her funeral to only be “family” and she didn’t want Op there.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 1,
                      "content": "I hope not.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 269,
                  "content": "No it's worse then that, she only wanted family while she was dying, that's why OP didn't find out she died until after the fact. That's so much worse, she either got what she wanted when she \"apologized\" and cut op off again or didn't get it and immediately went back to being petty AF.  \n\nOP NTA",
                  "id": 9,
                  "comments": [
                    {
                      "score": 438,
                      "content": "So according to OP they did pay for treatments, then still cut OP out only wanting \"Family\" around at the end.  And yet, the rest of the family went along with it, none of them said anything to OP.   They're all as bad as stepmom. \n\nI'd being going NC with all of them personally.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 245,
              "content": "Yeah, but that only lasted until she was actively dying, at which point she only wanted \"family\" present – and OP wasn't \"family\".",
              "id": 11,
              "comments": [
                {
                  "score": 329,
                  "content": "That should be his response, only family should pay for the services and step mom made it clear he wasn’t family. They know this aswell bcz they blame him so why should he put any money forward.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 122,
                      "content": "Exactly that. She fake apologized for cash for treatments and when she was on the way out snubbed him again. Nope, she doesn’t get anything else. NTA OP - and your father has some nerve to even think about asking you.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Nah, that was just coincidence. She happened to realise she'd acted like an arsehole just at the time she need him to pay for her treatment purely by chance.",
              "id": 14,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Then after that she also said she didn't want him around when she was dying because he wasn't family.  Of course, after he spent money on her treatment.",
              "id": 15,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 357,
          "content": "Agree here NTA. My mom is under the illusion herself that I’m rich because I’m a disabled veteran and wants a wake, (with a display casket), then cremated and a funeral where her ashes are buried at the cemetery, all of that is like 30,000.00 and she refuses to get life insurance. I told her it’s not happening 1000 times, and she says she’ll haunt me. \n\nIt’s weird how the boomer generation who barely raised their kids expects so much from their kids in their golden years.",
          "id": 16,
          "comments": [
            {
              "score": 175,
              "content": "Tell her to haunt away cause she’ll never be scarier then the debt collectors she’ll cause you to have.",
              "id": 17,
              "comments": [
                {
                  "score": 83,
                  "content": "Exactly, I’m already living paycheck to paycheck one emergency set me back 11k in debt Al Kat a year ago and it’s a struggle paying that back. \n\nI forgot to include, my mom doesn’t think my sister should pay because she has two kids to take care of lol",
                  "id": 18,
                  "comments": [
                    {
                      "score": 115,
                      "content": "I’ll never understand why “disabled vet” means loaded to some people. Most of our disabled vets (both Canada and USA) get shit all. \n\nTell her next time she finds a good cardboard box to keep it unless she wants to get life insurance.",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 68,
              "content": "[deleted]",
              "id": 20,
              "comments": [
                {
                  "score": 24,
                  "content": "I wonder if you or anyone else here ever had their parents say “god helps those who help themselves” 😅",
                  "id": 21,
                  "comments": [
                    {
                      "score": 23,
                      "content": ">  “god helps those who help themselves”\n\nMy dad said, \"trust in god, but row toward shore\".",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 53,
              "content": "Next time she says she'll haunt you tell her you'll get an exorcist.",
              "id": 23,
              "comments": [
                {
                  "score": 23,
                  "content": "Ahaha that’s exactly what I always say 😂",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yeah, all boomers are terrible parents? What the hell?",
              "id": 25,
              "comments": [
                {
                  "score": 2,
                  "content": "No kidding. What a ridiculously simplistic and ignorant statement.",
                  "id": 26,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "you're a disabled vet, I'm sure there are other scarier things haunting you than your mom, she may be a welcome reprieve lol. (I may be a jerk here assuming you have dark humor)",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "The only way to get the funeral you want is to pre-plan and pay.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -1,
              "content": "Please don't lump all people in the same generation as behaving the same way. When you say \"boomer generation...blah, blah, blah, hateful, ugly words\" You insult all people lumped into the same generation. Not all boomers behave the same. Your mother is A H. She needs to pay for her fancy funeral if she wants it a certain way. Not all people raised their children the same way. Not everyone in your generation raise your children the same way. Generalizations like this are hateful.",
              "id": 29,
              "comments": [
                {
                  "score": 4,
                  "content": "What do you think defines generations… it’s generalizations lol",
                  "id": 30,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Yep. Highly simplistic, biased, wide ranging generalized labels applied to individuals who get their information from social media.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -4,
              "content": "Your going to talk crap on a whole generation because of your mother?!?!  Please! Do better!",
              "id": 32,
              "comments": [
                {
                  "score": 5,
                  "content": "Don’t like stereotypes? I don’t care. Of course there exceptions but wtf do you think defines generations. \n\nI’ll leave this here for you. \n\nhttps://www.care.com/c/boomer-seniors-are-surprising-adult-kids/",
                  "id": 33,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Do you really think that that generation you love to vilify wasn’t burdened by the generation before? Or that one wasn’t burdened by the one before that? You guys need to get your head out of your ass and stop talking like stupid parrots.",
                      "id": 34,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 93,
          "content": "I wish people would understand just because you marry someone with kids does not make you their new parent and would respect that instead of getting bitter when rejected",
          "id": 35,
          "comments": [
            {
              "score": 15,
              "content": "Yeah but for some reason so many people don’t see that. I never wanted the hassle of being a stepparent so I don’t date guys with kids. Then I don’t have to deal with any drama. People really need to think about that before getting serious. My own personal experience is yes my stepdad is my dad. But my life isn’t anyone else’s life. Generalizations doesn’t work the same in every blended family.",
              "id": 36,
              "comments": [
                {
                  "score": 14,
                  "content": "Exactly. I hear so many stories of people marrying/having a relationship with single parents. But they hate the fact thlse people have kids. SO WHY DATE THEM IF YOU HATE THEIR KIDS",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Also OP is the only one remembering his bio mom while the other 2 siblings never honored her death. God damn she died while giving birth to them! After the ultimate sacrifice that poor woman got nothing from the ungrateful children but lost the title of being mother to a spiteful woman( step mom).",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "true but they certainly take the role of the parent as a guardian or provider without the benefit of being an actual parent.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "I feel like that’s the number one thing I’ve learned here. It’s incredible.",
          "id": 40,
          "comments": [
            {
              "score": 23,
              "content": "I've also gotten better at identifying passive aggressive behavior and statements.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "You reap what you sow. You rejected me as family and treated me and mine horribly and I want nothing to do with you.\n\nNTA",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "The problem here is, this woman has now created a situation that if the OP doesn't help then he risks his relationship with his siblings who will blame him for not helping. It's a shame as it sounds like he did see his stepmother as a parental figure until she ruined things.",
          "id": 43,
          "comments": [
            {
              "score": 4,
              "content": ">You reap what you sow. You rejected me as family and treated me and mine horribly and I want nothing to do with you.\n\nYou have a very good point. She's put him in a terrible situation.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I think people think being adopted just means you get a brand new mom no it's erasing  your entire story and you had a mother. And I don't know if it works the same in your country, but you get an altered document when you were adopted as if your mother never existed in the first place. For her to take that as some sort of slight towards her because you don't want to do it says more about her than it will ever say about you, and finally no one else can tell you how to spend your money. They're legally her children, they can figure out how to do it. \n\nNTA",
          "id": 45,
          "comments": [
            {
              "score": 2,
              "content": "The thong is OP was old enough to remember his mom. She died in a tragic way. He felt no connection to his stepmom which is okay. Clearly stepmom took that shit personally instead of nurturing the relationship.",
              "id": 46,
              "comments": [
                {
                  "score": 2,
                  "content": "Oh, she definitely did, and even if she had nurtured the relationship. I still think she would've had a hard time hearing the word no.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Good point. It’s also ok to want to hold onto the last thing you have of your mom",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "i didn’t even need to read past the title NTA",
          "id": 49,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "It’s envy, I feel like. Envy is distinct from jealousy in that it takes action to disabuse the envied one of that which makes them envied. Idk.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2768,
      "content": "NTA:  She cut you out in many ways.  “Family” should pay her bills.",
      "id": 51,
      "comments": [
        {
          "score": 413,
          "content": "This right here!\n\nAccording to her, OP wasn’t her family. Therefore, OP should put a dime for ANY of her expenses. \n\nNTA.",
          "id": 52,
          "comments": [
            {
              "score": 105,
              "content": "OP tell them \"I'm not \"family\" so it's cringe your asking a stranger to pay for her funeral!\"",
              "id": 53,
              "comments": [
                {
                  "score": 25,
                  "content": "“Her kids should pay, I’m just her husband’s son”",
                  "id": 54,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2034,
      "content": "You're the only one who isn't her legal child and yet you're expected to pay? WTF that makes no sense.\n\nNTA. Your siblings and father are fully toxic. Why isn't your dad paying for the funeral?",
      "id": 55,
      "comments": [
        {
          "score": 476,
          "content": "Right! I feel like the dad knew she lied about being regretful and sorry. He’s got a lot of nerve asking for more money for such a vindictive woman. They couldn’t even tell him she died and I doubt he’d be mentioned in her obituary. But gladly took his money and asked for more. Horrible people.",
          "id": 56,
          "comments": [
            {
              "score": 131,
              "content": "Yuuup. Father made contact to get money from the sun, allowed her to make these plans when she knew the treatment wasn't working, and then was the one to call his son and say that he was supporting his wife's exclusion and was going to uphold it.\n\nThis does come down to the husband supporting his wife in chucking out his son but still wanting to get money out of him. What an asshole",
              "id": 57,
              "comments": [
                {
                  "score": 2,
                  "content": "He was excluded from her deathbed, not her funeral. If someone is dying you have to respect their wishes as to who they want there with them.",
                  "id": 58,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Perhaps, but don't expect them to be happy about it. Those choices have consequences...",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 974,
      "content": "NTA. You didn't reject her, you were already an adult that had had a mum, so why would you want someone else to adopt you? I mean, who even tries to adopt an adult?!\n\nIt's funny how she apologised to you when she wanted money from you to pay for her treatment and then she only wanted her 'family' there, which according to her you were not. Let her 'family' pay for it",
      "id": 60,
      "comments": [
        {
          "score": 299,
          "content": "I was adopted as an adult by my step-dad. My bio father was abusive and I didn't want him to access to my children if something happened to me. So it's a thing and it happens for different reasons.",
          "id": 61,
          "comments": [
            {
              "score": 238,
              "content": "Adult adoption is perfectly fine; holding a grudge when the potential adoptee declines to be adopted, and persisting in punishing not only the potential adoptee but also his completely innocent baby – *for years* – is not remotely fine. Finally apologizing to that potential adoptee, and expressing regret for one's years-long campaign of unkindness, in the hopes of getting him to pay for expensive medical treatment, only to exclude him yet again from one's death bed (because he's not \"family\"), is even worse.",
              "id": 62,
              "comments": [
                {
                  "score": 71,
                  "content": "Step mom is awful.  I was just responding to the who adopts an adult sentence.  But honestly I think his dad is worse for allowing this to happen.  Sometimes you need to put your  foot down even to a fellow adult.  Dad is being much to passive.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "This!! My lovely aunty asked if I would like her to adopt me as an adult/call her \"mum\", but I declined on the grounds of having bad mental associations with calling someone that, and that she had done a great job of giving me a much better associations with \"auntie\", so that's how I preferred to think of her. She said she understood and has never treated me any differently as a result.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "I understand that but that's not the case here, is it.\n\n\nI'm not saying that this is how it played out but given everything else that went on I wouldn't be surprised if she waited until she'd never have any financial obligations to the one child who actually remembered their mother to broach the topic of adoption.",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Not the same situation at all.",
              "id": 66,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "That was my thought. SM wanted to adopt OP when he was 18? That's weird. Like, what would that really accomplish? OP was on their way out of the house to do their own thing.",
          "id": 67,
          "comments": [
            {
              "score": 16,
              "content": "My thought is that if OP is the oldest, and had younger siblings, whom she wanted to adopt and they were an age where it made more sense, of course, it would be the reasonable and kind thing to do also offer that to OP. Even though OP was legally an adult, it would’ve been even worse than the current scenario if she had only offered to adopt the kids were young enough.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "If anything, she rejected him and was vindictive and exploitive towards OP.",
          "id": 69,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 460,
      "content": "NTA she wanted only family then only family can pay.",
      "id": 70,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 427,
      "content": "NTA she treated you like family before the adoption thing. Then treated you like trash. She apologized but then still pushed you out. NTA.",
      "id": 71,
      "comments": [
        {
          "score": 221,
          "content": "She apologised, but was that sincere? Because she only said sorry after she needed money for her treatment...",
          "id": 72,
          "comments": [
            {
              "score": 60,
              "content": "Exactly. It wasn't about her feeling regret. She just needed someone to pay for her treatments.",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "Very true",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "And it was after nine years of treating OP and OP’s family like garbage. Like I could see her getting upset and being rude for a few days afterwards (which would still be inappropriate on her part). But she apologized after almost a decade of being a total AH to OP.",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "If it was sincere, he wouldve been invited with family to say goodbyes.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 314,
      "content": "Did you pay for treatment and they want the funeral paid for?",
      "id": 77,
      "comments": [
        {
          "score": 352,
          "content": "Yes.",
          "id": 78,
          "comments": [
            {
              "score": 525,
              "content": "So this woman took your money but doesn’t consider you family enough to visit before she passed away…\n\nI know you should speak ill of the dead, but she was kinda a gross human. Her relationship to you was always what she could get out of it, not a genuine one.  \n\nAnd your siblings and dad just sat on the sidelines not correcting her behavior.\n\nNTA.",
              "id": 79,
              "comments": [
                {
                  "score": 171,
                  "content": "People should be spoken of as they deserve. If they earned the disrespect in life, they can carry it in death.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 2,
                      "content": "i've never heard it put that way before but you're totally right",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 114,
                  "content": "Eh, if people won't want to be spoken ill of when dead, they should not be assholes when alive.\n\nNTA OP, and I hope once this storm passes you find peace again.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "I will speak ill of the dead of dead warrants such ill speak. And feu SM fits the bill. She was AH.",
                  "id": 83,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Nah being dead doesn't change that they were asshole in life. If you want people to remember and talk about you fondly you gotta not be a jackass.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 159,
              "content": "So you even paid for the treatments yet nobody bothered to keep you informed as to her progress? You are only a cash cow to your father and siblings, to be guilted into coughing up for their expenses. If you pay for the funeral now, you'll be asked for more money in the future. \n\nNTA your 'family' needs to examine their consciences. Send them all a photograph of your late mother. At least you remember her.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 60,
              "content": "Wow. That’s craziness, OP. Write them all an email saying that you extended yourself to pay for her treatments, in spite of the complicated feelings and family situation that existed. And while you don’t want to hurt them the way that you were hurt by being excluded from stepmom’s final moments on earth even after you helped with her treatment, you are simply unable to pay for the funeral too. You join them in their grief, love them dearly, and urge them not to displace any feelings of sadness/anger they may have onto you. Wishing you well and hoping your family comes to their senses🥹",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 58,
              "content": "Hard NTA, especially after you paid for her treatment.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Well fuck that noise. If it is “only family,” then “only family,” should pay. \n\nNTA",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "So she still didn't see you as family up to her death and lied straight to your face to get the treatment money. Let her be carrion for the birds if the people she considered family can't pay for it.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "That seems unfair, why wasn't a funeral cost looked at earlier? Nta",
              "id": 90,
              "comments": [
                {
                  "score": 12,
                  "content": "Yup. #AskAMortician ftw",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "This was always the plan: to let OP pay for the funeral",
                  "id": 92,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Pls tell me you will go LC with your siblings for this or NC. The audacity for this is just outstanding.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "No good deed goes unpunished. Send your dad and siblings a bill for her estate for her medical treatments and go NC. NTA.",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Just tell them that your manipulated and false apology won funds was more than enough considering her duplicitous behavior and clear jealousy of a dead person. Also, why aren't they paying for the funeral since its their mom as she made it oh so clear with her favoritism and lies.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 177,
      "content": "Nta.\n\nYou did not exclude your stepmom, she did it herself once she disrespected you ans your choices.",
      "id": 96,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 174,
      "content": "NTA. She talked to you and asked for forgiveness because she needed your money. She proved once again she didn't care for you.\n\nThey can pay for her funeral expenses. You tried to help her live. They can pay to honor their mother.",
      "id": 97,
      "comments": [
        {
          "score": 45,
          "content": "Yep, and your father is the one who holy said this situation up. He reached out to you to get your money, and that's still all he's doing. Your father and your siblings are even saying they don't want a relationship with you, they just want your money",
          "id": 98,
          "comments": [
            {
              "score": 11,
              "content": "I got this kind of vibe too!!! They will absolutely only reach out when they need OP to pay for things.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "What does your first sentence mean? I’m trying to make sense of it but I’m struggling. Genuinely asking, not trying to be an AH.",
              "id": 100,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 133,
      "content": "NTA\n\nYour stepmom lied. She didn't love you like a son. She apologized so she could get you to pay for the treatments. \n\nYou were family enough to dig into your pockets, but not family enough to see her before she died? No, they cannot have it both ways. \n\nYour siblings don't get a free pass on this, either. They knew about the disparity in treatment, and were fine with it because it didn't affect them. And your dad absolutely should have stood up for you. \n\nYou were under no obligation to let stepmom adopt you, even if you weren't already a full adult when she proposed it. And then she went so far as to take out her completely misplaced ire on your child. \n\nIt doesn't matter about all the people saying \"do it for your siblings\". That's what you did the treatments for. You have more than met your obligations in this matter. They can and will figure it out themselves.",
      "id": 101,
      "comments": [
        {
          "score": 63,
          "content": "> They called me and a-hole saying that i couldn't be mad for being excluded because i did it to myself when i refused to be adopted.\n\nThey all (father & siblings) knew this was about getting OP to pay for step moms treatments.  \n\nOP go spend time with your real family (your wife and child) and move on from these leeches.  Personally I would go NC but I have never tolerated shit from people including my family.  Why invest any energy into that kind of negativity",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "If she loved him like a son, she would have treated him like her son regardless of what he called her. That’s how a mom loves her son.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}