{
  "post content": "I [35m] am married to a woman named Jess [26f]. We dated for two years before marriage and have been married for one year now.\n\nMost of my family has passed away, but I have (or rather had) one aunt from my mother's side. My aunt Jill took an active role in raising me, making sure I was fed and clothed when my mother was unable or unwilling, which was often. We kept in touch, but living across the country from her, she and Jess never met. \n\nYesterday morning I got the news that my aunt Jill had suddenly passed away. I was in shock because she was still young and her life was taken prematurely in an accident. I immediately told Jess. Jess was sympathetic at first, but I told her that I needed a while to be in my room.\n\nI went to my room, where I kind of just mindlessly spaced out browsing through a news site. At some point Jess knocked on my door and told me that I needed to talk about it, to which I responded I appreciated the sentiment, but I really just needed to be alone. Jess reacted harshly to this, saying I was an \"emotional black hole.\" Then she slammed my door shut and literally stomped away.\n\nFor the next two hours, every 10-15 minutes or so, Jess would open my door abruptly and half shout asking if I was ready to \"be an adult.\" I grew increasingly impatient until I just stood up and went out for a walk. When I got back home about an hour later, the chain was locked on our front door (which we never use), and I repeatedly knocked/pushed the doorbell until Jess said that she'd only let me in if I agreed to talk about what happened. I said no, so Jess walked away. Eventually she unlocked it because I kept pounding on the door and she didn't want me \"embarrassing her in front of the neighbors.\" \n\nJess is furious at me now, saying that I'm not really grieving because I'm online. She said that I needed to let her in on my feelings, but I responded that it's hard to let her in on my feelings when she just refused to let me into our house. That set her off even more.\n\nAm I being a mega asshole here?",
  "id": 1,
  "comments": [
    {
      "score": 11746,
      "content": "NTA but your wife certainly is. \n\nThere is no right or wrong way to grieve, and by pushing you into grieving \"her proper way\", she's actually making it harder to you to process your aunt's death. \n\nShe needs to apologize to you and back the fuck off.",
      "id": 2,
      "comments": [
        {
          "score": 3043,
          "content": "Yup.  She is showing both insecurity and immaturity.  You cannot project on others how *you* would feel or mourn or deal with deep emotions.  Some people cry and need a shoulder, some people need quiet alone time, some people need to back away from it and approach it in teeny tiny bites when it feels safe for them.  OP’s wife is making it about her, and it’s not.",
          "id": 3,
          "comments": [
            {
              "score": 1137,
              "content": "Immaturity.  Exactly.  She’s the one being immature, not OP.   OP is definitely NTA in this situation; you can grieve any way you want, and I’m sorry for your loss.  Soft TA for being a 32-year-old who was dating a 23-year-old and is now complaining about how immature she is.",
              "id": 4,
              "comments": [
                {
                  "score": 547,
                  "content": ">Soft TA for being a 32-year-old who was dating a 23-year-old and is now complaining about how immature she is.\n\nI knew as soon as I saw the ages that Reddit would judge the shit out of this.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 150,
                      "content": "Yeah this sub is really sensitive about the age gap.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 28,
                      "content": "Rightfully",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Yup, no matter what the subject, the moment age is mentioned and there's even the slightest difference that's what people jump on. The only way OPs can get an unbiased judgement is if they don't add the age.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -2,
                      "content": "Reddit only cares if the man is the older one. If the woman is older they act like all is normal.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 114,
                  "content": "That’s a jump. OP never used the word “immature” during the situation with his wife. Age gaps don’t always equal creepy behavior. Just like someone behaving badly doesn’t equal immature. Odds are the wife knew this was a huge blow to OP and didn’t know how to handle her own helplessness in the situation. People do weird shit when when they feel they can’t help. I’m not defending the wife, because she is an absolute A H hands down. This sub always jumps to conclusions when there’s an age gap.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 315,
                      "content": "We're not saying she's immature because of her age; we're saying she's immature because of her immature actions. Trying to insert yourself into someone else's grief? Immature. Constantly hounding someone to get your way? Immature. Locking someone out of their house because they went for a walk rather than engage in your immaturity? Immature. Refusing to let that person back in until you get your way? Immature. Only letting them back in because you've created a scene and are worrying about what the neighbors would think? Immature.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "OP’s wife was the one who brought up immaturity by asking if he was ready to be an adult, just in case you didn’t relate them or missed it! I had to go back and look to double check :)",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "I always hate comments like this one. My mom met my dad when he was 21 and she was 30. Funnily enough my mom didn’t even realize my dad was so young because he looked older, and he didn’t realize she was that much older because she looked so young. Does that make my mom a creep? No. Immaturity doesn’t have to be an age thing, and don’t bring age gaps into the equation when that doesn’t seem to be a factor here.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 18,
                      "content": "My bf is three years younger than me and I’ve dated guys as young as 30. I’m 45. This was because most guys my age have kids and I have zero interest in raising any. Just because you date younger doesn’t mean you’re automatically creepy.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "i’m 38 and my bf is 29. i actually almost didn’t date him when he told me but then he pointed out he could have told me a fake age and i wouldn’t have known the difference and he’s been gaslighting me ever since. \n\nnote: that’s 100% sarcasm, he’s very very sweet",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 27,
                  "content": "Like clockwork on this sub. I am 9 years younger than my wife so I guess if I ever have an issue in my marriage and I come here for advice everyone can let me know our issues have to do with age. He isn't an asshole or even a \"soft asshole\" for marrying someone 9 years younger than him. It wasn't like he dated her when she was underage. She was an adult for half a decade before they dated. \n\nShe's 26 now and TA for being mad her husband wasn't grieving the way she wanted him to. That's it.",
                  "id": 16,
                  "comments": [
                    {
                      "score": -13,
                      "content": "No, there is absolutely nothing inherently wrong with an age difference, and I'm not saying he's an AH for marrying someone 9 years younger than him.  I'm saying he's a soft AH for complaining that his apparently immature wife is acting like a petulant brat when that's essentially what he signed up for.  I'm sure the age difference isn't an issue in your marriage, but if you stomped around and threw a temper tantrum when you disagreed with your wife about something then, yeah, I'd think it was an issue.",
                      "id": 17,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "This isn’t “immaturity,” she’s just being an AH. Come on, would YOU have acted that way at 23, let alone 26? I wouldn’t have.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "She's 26 now. You think 26 year olds can't comprehend that people grieve differently? Is she permanently going to be immature because of their ages when they started dating?",
                  "id": 19,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Well, apparently this 26-year-old can't comprehend that.  But it's not even about her disagreement with him; it's about the way she expresses it that's very childish.  But I see your point; debating whether she's immature or just an asshole in general is -- to some extent -- just splitting hairs.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Objection on the Soft TA rating, the age gap is not relevant here. They're consenting adults, back off that route.\n\nThe only one in the wrong is the wife for literally locking her grieving husband out of the house for 2 hours",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Dang, just because of their age differences you're giving him that? That's asinine. I was 28 when I met my husband, who was 38 at the time. We've been together 18 years, and married for 17 of those years. Now, her actions, verbally attacking the man (who she supposedly loves) who is grieving for someone who was basically his mother? This puts her squarely, right smack dab in the center of TA verdict. No equivocations.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "She's a 26 year old",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Idiotic statement. \n\nI processed grief maturely, calmly and in my own way from a very young age,  carried my first coffin at 16 and arguably have been more mature then you for the last decade considering the statement you just made, dont tar and feather everyone with the same damn judgemental brush",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 77,
              "content": "[removed]",
              "id": 25,
              "comments": [
                {
                  "score": 16,
                  "content": "So does that mean I can't bother someone who doesn't want to bother, or yell at them, slam doors and stamp my feet if they don't do what I want them to do, and lock them out of the house, even though I'm doing all this to try to comfort them in their grief?!?! Sheesh! <And just for the haters who lurk on this board, I'm not serious, I'm being quasi -sarcastic.> <Make that TRYING to be..>",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 69,
              "content": "[removed]",
              "id": 27,
              "comments": [
                {
                  "score": 124,
                  "content": "She acts childishly is one way to put it. I would  say incredibly controlling.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": "Exactly. Someone I love dearly died in May. I still haven't cried yet. I know I'm \"living on the river of denial\", but I'm not ready to fully process it yet. My family/friends have been understanding of my limited ability to talk about it.",
              "id": 29,
              "comments": [
                {
                  "score": 74,
                  "content": "OPs wife would HATE my reaction to grief as well...I'm the one who just goes into plan-the-funeral-and-reception-mode and gets the dwelling packed up and stored until things are distributed...and then fall apart on the next major holiday when the person isn't there.  \nLucky for me my family knows this about me so doesn't treat me like a sociopath for it.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Same! When my mother died I became the admin professional machine that I am at work. I Did Stuff and then I read to the end of the internet each night because it was the only way I could turn my brain off to go to sleep. I'm doing more crying now, seven years later, than I did then.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I never cried when my grandma died. It was on Dec 31st (yay \\*roll\\*), so we had the funeral person over to arrange everything that day. Then we went and started to clean up her apartment on Jan 2nd. Nothing fazed me. Then a friend of me and my father's who had heard my grandma/ his mom died, had gone on a search to find out the time, date and venue where the reception would be held and he showed up. Well, THAT made me cry.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "my mother died in October of 2021. \n\nI'm just now getting her house empty. \n\nAnd I didn't get along with her, she was a terrible parent. \n\nI don't miss her, I was frankly relieved when she left this earth. \n\nBut, I could Not deal with that house, all the stuff in it, and the prospect of being completely done. \n\nEveryone processes loss in their own way.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "This December would be 10 years since my dad passed away and believe me or not I still sort of in denial. Like at his funeral I remember thoughts like \"it just a bad joke. It's not him it's a doll and now he enters this room and says it is for a crappy TV show\" and even 10 years later my brain sometimes is like \"what if it all was fake and I'll see him in the street today\" I know it's silly and I know it's not real but thoughts about him faking his death and living without us somehow feels less cruel than his actual death. And when he passed away I remember I was sort of emotionless robot. I didn't cry didn't talk about him didn't ask for help. But I clearly remember how I cried alone after school. And even if it's 10 years it hurts as hell still.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "I lost someone I loved and it took me fifteen years to cry about it. I’m so sorry for your loss.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "And I really hope op shows her this. And I hope she reads it and sits with it instead of immediately getting defensive because she’s going to destroy her marriage if he isn’t able to process his grief and she is the reason he can’t.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "You don’t even know how _you_ grieve until you do it. \n\nI threw myself into programming when my mum died because I needed to obsess about something, and that was at least a productive obsession.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Also emotional immaturity can be an issue whatever the physical age.\n\nSo sorry for the loss of your aunt OP.  Please know that however and whenever you want to grieve is acceptable.  I once went on a “memorial hike” and attended another service where the deceased had requested brownies and champagne.  Honor your aunt in whatever way you need.💗\n\nEdited for grammar",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Everyone grieves differently, I know that when I grieve, I either joke about what's upsetting me and cry in private, or I tend to lash out at people, sometimes even just do what OP did, just find a quiet space and zone out. \n\nOPs wife is a huge butthole and gets 4/5 buttholes on the butthole scale ngl. \n\nNTA, but OPs wife certainly is.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It had also been less than a day when she started all this. I feel like you'd need to wait at least a week to be able to see how someone was grieving a loss in general.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 268,
          "content": "All of this and you’re also likely in shock as it was unexpected and it’s going to take time to sink in, anyone should know this let alone someone you’re married to. Her crossing all of your boundaries by repeatedly going into the room and then stomping out (ironically asking YOU to be the adult) is an AH move. \n\nShe likely has her head up her ass thinking you’re a caveman who doesn’t discuss his feelings but she’s just showing ignorance here. \n\nTell her you’re in shock, need to process your feelings before you’re able to share anything and that when you do feel able to share then you will go to her. Or you could just leave the AH.",
          "id": 41,
          "comments": [
            {
              "score": 56,
              "content": "I completely agree with all three of these top posts. I think they are all spot on. I’m so sorry that you are dealing with this. Good luck.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "Yes. Hell, I'm a woman, and I don't storyboard my emotional processes, or anything else, with anyone. When I'm ready to talk about something, I will, and dealing with someone acting like a human can opener does not help.\n\nSomeone mentioned downthread that there may be missing context around the \"emotional black hole\" comment. Be that as it may, a grief situation is individual and personal and would NOT be the time to address this, and absolutely not in the manner in which it was handled. So NTA.",
              "id": 43,
              "comments": [
                {
                  "score": 2,
                  "content": "Same and one of the things I appreciate about my husband is that,  no matter what it is,  he just accepts it when I say \"I need to sit with this by myself for a while but I'll let you know when I have it sorted enough to talk about it \".",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 202,
          "content": "I feel like there’s often a rush to tell people to break up on this sub. \n\nBut there’s a good reason for that. This anecdote is actually horrifying. Assuming it’s an accurate representation of the events, and that the wife isn’t in a moment of temporary insanity where she’s behaving in a highly uncharacteristic way (and I think OP would have said if that were the case), this is an abusive relationship. \n\nIt is not normal to get angry and intrusive when someone needs a quiet moment alone. It is abusive to lock your spouse out of the house in a fight. Over years this becomes soul-destroying. \n\nThat’s why divorce is a potentially reasonable approach to this situation.\n\nMy condolences about your aunt.",
          "id": 45,
          "comments": [
            {
              "score": 68,
              "content": "I've always assumed that those who say people are too quick to call for divorce here are just worried that their own partners will realize they don't have to put up with them anymore.\n\nOh, NTA, OP, and get a divorce!",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "It's not normal to react this way over one situation - which is why I'm having a hard time believing this is one situation and not the straw that broke the camel's back.",
              "id": 47,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Agreed. If she actually wanted to make sure he's okay, she'd give him the space he needs and support him. Grief is one of the worst things we go through in our lives, and the most important thing is to let the grieving person take the lead. Gentle nudges are okay *only if* the person has been indulging in dangerous coping mechanisms for an extended period of time. Even then, you approach that delicately to ensure you don't do more harm than good. Needing space is not something that needs a nudge, let alone correction. \n\nOP's wife is not worried about him, she's either delusional or intentionally hiding her abuse behind \"worry\" to continue it as long as possible. But this isn't worry. This is contempt. She's seething because he's not *obeying* her. She thinks she's entitled to dictate how he processes this and *needs* to be in control. He's having big emotions that don't revolve around her and instead of seeing him as a person, she sees this as an attack on her that she can't abide. So she demands he hands over the reigns to his grief, and punishes him for not complying. She insulted and belittled him, repeatedly steamrolled perfectly reasonable boundaries, and refused to let him in his own house unless he did as he was told. She wants to make it so painful to make his own decisions that he capitulates. \n\nHopefully OP will recognize that the unwarranted torment she's inflicting on him isn't the result of his failure to obey, but the calculated *choices* of an abusive, unhinged, dangerous woman who would rather torture a broken man she claims to love than show an ounce of compassion. All because her ego and need for power and control will *always* come before him. Surrendering to her isn't the solution, it's the problem. Run, OP.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 104,
          "content": "Holy shit, I can’t believe this behavior on her part. YOU DONT GET TO TELL PEOPLE HOW TO GRIEVE. What’s she’s doing is both inappropriate and damaging. Maybe this is triggering something in her too, but that doesn’t excuse dumping on you like this.\n\nTake some space to process your feelings, and feel 100% okay if this means getting the *%€# away from your wife. NTA",
          "id": 49,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "NTA Your woman needs to mature considerably. If she doesn't get her way, does she always chuck the dolly out the stroller?",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 61,
          "content": "NTA whoa, is she generally this controlling?! She can’t dictate how you grieve just because you don’t want to do it with her. And then locking you out is just extra alarming! This can’t be the only instance this behavior has manifested",
          "id": 51,
          "comments": [
            {
              "score": 11,
              "content": "Was looking for this comment, thanks!\n\nControlling AF..!\n\nMy God, I would be utterly pissed off if anyone did this to me!\n\nContinously barging into the room?\nLocking him out?\nNope. Nope. Nope!\n\nShe sounds exhausting.\n\nOP, NTA",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "Exactly!  What is she, the f#*king grief police?  Bizarre, and NTA.  I’m sorry for your loss, op…",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Exactly this.  It only that but you asked her to leave you a line and she wouldn’t. That’s absolutely unacceptable. NTA.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "NTA. I don't even understand this behaviour. It hadn't been a day even. \n\nIf after a couple of weeks you had remained in your room and hadn't communicated anything, I could just about see some insistence on needing to communicate. \n\nBothy partner and I have had to deal with the passing of our mothers. We have been there for each other, talked when the grieving person needed to. But otherwise, there was just endless tea and cuddles. \n\nWhen either of us were ready, we talked. But these things  can't and shouldn't be forced.",
          "id": 55,
          "comments": [
            {
              "score": 2,
              "content": "Yeah that's the wild thing to me. Like she didn't even give him 10 minutes to process his feelings. He probably would have talked to her about it later but she just couldn't chill. She's being so aggressive yet claiming she's trying to help. It's bananas.",
              "id": 56,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Yes this. Wow. Where does she get off? She’s making this about her. What does she expect , you to fall in her arms or something? She’s a big A H. I am so sorry for your loss.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2739,
      "content": "NTA \n\nJess needs to back the fuck off.\n\nShe doesn’t get to tell you how to grieve and you don’t have to perform your grief for her in a way that she finds satisfactory.\n\nHer locking you out is a solid AH move, as is not giving you space to process how you’re feeling.",
      "id": 58,
      "comments": [
        {
          "score": 353,
          "content": "I want to repeat.... she needs to back off!!!!!  Grief is so very different for people, not one human has the right to determine how you process it. \n\nMy husband's father passed last year. They were very very close but my husband had a lot of mixed emotions since he was also an asshole of a father. My husband didn't cry, he was down for a bit, I asked once is he wanted to talk, he said nope, not what he wants to do and then I LET IT GO.  Of course if he started showing some unhealthy behaviors I would have tried to help out but to someone on the outside, they never would have known he lost a parent and that's OK and he's ok and this is consistently how he processes pain. Let people heal in their own way  dammit.",
          "id": 59,
          "comments": [
            {
              "score": 57,
              "content": "When my mum died (last living parent) my wife asked me if I wanted to talk, or to be left alone/given space. I chose option 2 and she just nodded, hugged me and left me alone until I was ready to do anything. I will never forget that - it gave me the space to breathe that I needed.  I'm sure Fudgrea's husband appreciates what they did - shame OP's partner isn't as sympathetic.",
              "id": 60,
              "comments": [
                {
                  "score": 9,
                  "content": "I'm sorry for your loss, but pleased you grieved in peace ❤️",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Happy cake day!",
              "id": 62,
              "comments": [
                {
                  "score": 10,
                  "content": "Thanks, you're the first to ever wish me one!! A piece with extra icing to you.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 66,
          "content": "Imagine locking your husband out of the house because he didn't feel like talking about his aunt's death the day he found out about it. Wow.",
          "id": 64,
          "comments": [
            {
              "score": 26,
              "content": "I think at that point I would have left and slept somewhere else till she starts acting like a adult and partner. This reeks of narcissism.  She only cared about her own wants, and was pissed he did  not give her what she expected.",
              "id": 65,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1462,
      "content": "honestly this is such a red flag.",
      "id": 66,
      "comments": [
        {
          "score": 220,
          "content": "Crimson",
          "id": 67,
          "comments": [
            {
              "score": 265,
              "content": "Marinara",
              "id": 68,
              "comments": [
                {
                  "score": 131,
                  "content": "100 jars of it",
                  "id": 69,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Got mozzarella sticks?",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "Complete with a steaming pile of Alfredo on the side.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "Scarlet",
              "id": 72,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -3,
              "content": "It’s a real marinara flag.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 33,
          "content": "A red flag is a behavior that is in of itself harmless but tells you that something less harmless might be coming if you continue down the road.\n\nA red flag would be whatever unhinged behavior she almost assuredly displayed when they were dating that should have warned him not to marry the kind of woman who would lock him out of his own house for \"not grieving correctly.\" He's way past red flags now.",
          "id": 74,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": -13,
          "content": "You mean the guy that went after someone a decade younger than them?  That usually is a major red flag, yup.",
          "id": 75,
          "comments": [
            {
              "score": 1,
              "content": "She’s 26 who cares",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -14,
          "content": "I think there’s a whoooole lot more to this (red flags on both sides, methinks)\n\nI highly doubt she’s calling him an “emotional black hole” over a single issue. I’m guessing he’s extremely withdrawn and closed off, but that’s just speculation",
          "id": 77,
          "comments": [
            {
              "score": 3,
              "content": "His aunt dying isn’t the time to bring it up",
              "id": 78,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "That got me too. Shes definitely wrong for cornering him into talking when hes not ready but what she said about black holes makes me think theres a bigger issue at hand thats been going on for longer. Id be interested to see her pov ngl",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Yeah, this was pretty obvious to me. Choosing now to go off on him is an AH move but sounds like this is the final issue after many that made her snap.\n\n“You’re an emotional black hole” would be a weird overreaction/thing to say to this one incident, suggests maybe he struggles with being emotional and opening up in general.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -28,
          "content": "And their age gap when she is so young isn't?",
          "id": 81,
          "comments": [
            {
              "score": 29,
              "content": "[deleted]",
              "id": 82,
              "comments": [
                {
                  "score": -16,
                  "content": "Maybe you need to learn reading comprehension, she was 24 when they got engaged, and they had been together for some time before that. Yes a 21/22 year old is in a different stage of life than a 30 year old.",
                  "id": 83,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Maybe *you* need to learn reading comprehension. They got engaged when she was 25 and started dating when she was 23. A 25 year old woman isn't capable of marrying someone slightly older than she is?",
                      "id": 84,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "Where are you getting those numbers from?  Op says they're 26 and 35, and that's still only an 8-9 year gap, same as me and my husband.",
                      "id": 85,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "Ah yes the incredibly young age of 26. What are you on about?",
              "id": 86,
              "comments": [
                {
                  "score": -26,
                  "content": "They are married, meaning they have been together for a few years at this point. a 31 year old and a 22 year old are in different stages in their lives.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 9,
                      "content": "That's not what you said - you said she was young, period. I was 24 when I got married. Was that too young for you, too? How old do I have to be before it's cool?",
                      "id": 88,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "They are consenting adults, the age gap is not relevant here.\n\nWife's behavior is borderline unforgivable... who locks their grieving partner out of the house?!",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 918,
      "content": "NTA\n\nDifferent people grieve in different ways.  If your behaviors were going on for more than a week, she'd be justified in being concerned about your withdrawing from the world rather than tackling the grief.  But on the same day you got the news?  Not cool.\n\nAnd then locking you out of your own home?  That's over the top.\n\nThis is a very troubling reaction from her.",
      "id": 90,
      "comments": [
        {
          "score": 82,
          "content": "[removed]",
          "id": 91,
          "comments": [
            {
              "score": -1,
              "content": "Bad bot",
              "id": 92,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 75,
          "content": "Locking him out of his own home at one of his lowest point instead of support time and making it about herself...",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Right? If he was just kind of dissociating and clearly seemed detached from everyday life three months from now, she'd be plenty warranted in giving him gentle, loving nudges to maybe start talking about it. Supportive nudges. Patient nudges. \n\nIt's like she saw someone forcing someone else to talk through their grief on a TV show or something, and decided that was the appropriate first-line immediate response to a loved one experiencing loss, and is now upset at him for not playing the other part in how that interaction is supposed to go.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 550,
      "content": "NTA\n\nRUN.  She doesn't want to make you feel better this is all for her, not everybody handles grief the same, she should respect your wishes and give you your space.  And the fact she threw a temper tantrum like that is a huge red flag.  Like I said RUN",
      "id": 95,
      "comments": [
        {
          "score": 95,
          "content": "Narcissist just HAVE to be the center of attention right?",
          "id": 96,
          "comments": [
            {
              "score": 65,
              "content": "She wants to be the hero so bad, and apparently right now that means \"helping\" him through his grief. And now he's not playing along with her plan to be the savior, and it's making her lash out in really nasty ways. \n\nShe really thought that talking through this with him would make him later recount the tale of how she was \"his rock\" getting through this hard time, and right now he's apparently denying her of that status.",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Borderlines too.\n\nSource: personal experience.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 224,
      "content": "NTA, but I have to ask why are you with her?! She has more red flags than a 3 ring circus during the summer in Georgia.\n\nFor starters, there's a special place in the underworld for people who decide to literally lock their SO, WHO LITERALLY JUST LOST A MAJOR PARENTAL FIGURE WHO RAISED THEM, out of the house because their.. hold on... *checks notes*... grieving wasn't \"acting like an adult\"... and then... *checks notes again*.. only decided to let them in after they were \"embarrassing her in front of the neighbors\".\n\nWow, just... wow.. OP, run, do not walk, run away from this woman. This is NOT how a partner should behave when there's a death of a major family member.\n\nThis is just... please see this as the marinara flag your wife is waving, and it only gets worse from here.",
      "id": 99,
      "comments": [
        {
          "score": 42,
          "content": "Physically locking/blockading your spouse outside of their home when they are not a literal danger and/or active abuser to the occupants inside is, in my opinion, immediate grounds for divorce.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -26,
          "content": "They are married, there’s no way this is her full character. OP married her for a reason anyways and that commitment or promise strongly suggests one to work things out. People make mistakes sometimes really big ones. You and I and everyone else does. Ideally you have a partner that learns from them when you shine the magnifying glass. You never know what her justification is for her actions. Even though it’s clearly wrong people may have been conditioned to process things a certain way as the correct way. In my relationships both me and my partner have had to learn that our way doesn’t mean the right way and yes that means having tough talks. Not running away otherwise you don’t grow\n\nEdit: obviously OP is NTA and his wife needs to a lot of self reflection",
          "id": 101,
          "comments": [
            {
              "score": 34,
              "content": "Uh... you are not going to downplay literally locking a grieving husband out of their home for 2 hours (and probably more if she wasn't worried about making herself look bad in front of the neighbors) as a \"mistake\"... this is one of those arguably unforgivable actions.",
              "id": 102,
              "comments": [
                {
                  "score": -20,
                  "content": "It’s obviously bad, but to me this isn’t something unforgivable like cheating. If the wife after confronted refuses to back down then you can consider divorce. But for fucks sake when did we stop having the hard conversations\n\nEdit: and I don’t believe I’m downplaying that at all. If that happened to me I would be absolutely furious. This is the hill for OP to die on. She 100% needs to apologize and make up for it. But divorce is way too nuclear too fast",
                  "id": 103,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "The level of malice of the wife's action is beyond what I would call a mistake.  Who does something like that to a grieving person?\n\nIf this happened to me, divorce would be on the table immediately.  Imagine having kids with this woman, and then she does something like this to the children.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You wouldnt be spewing this bullshit if the husband locked the wife outside of the house.",
              "id": 105,
              "comments": [
                {
                  "score": -13,
                  "content": "Not really. If this is repeat behavior then yes I’ll agree with you. But to me this seems like a one off deal. I grew up in a household where you work through problems. My parents were close to divorcing but luckily my mom didn’t. They had a tough talk and worked it out because they believe in marriage and the pact of love they made in the beginning. It’s easy to forget that as life goes on. Sometimes you need a big bump on the head. Now they are happily married and going on for 50 years. I believe in the sanctimony of weddings not because of a contract or religion but because you look into your partner and make a vow of love till death do you apart. And if OPs wife meant what she said then to me theres no reason why she doesn’t deserve an ultimatum about this situation",
                  "id": 106,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 221,
      "content": "NTA. Everyone grieves and processes big emotions differently. If she’s not giving you that room, when things are a bit more even keeled, i might 🔍 at your relationship.",
      "id": 107,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 176,
      "content": "Holy shit NTA all the way.\n\nEveryone grieves in their own way. I could understand concern from her if this happened a year ago and you were still struggling due to it, but this has just happened and you need time to process in your own way.\n\nAnd even then having concern and wanting to help deal with it wouldn't be done in this ridiculously childish manner and would include suggestions like therapy rather than insisting you need to talk to her specifically.\n\nShe's putting her annoyance at not getting her way over your pain and just making this process harder for you.",
      "id": 108,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 128,
      "content": "NTA your wife seriously needs to grow up. Does she always throw her dolly out the pram if she doesn't get her own way??",
      "id": 109,
      "comments": [
        {
          "score": 54,
          "content": "If the OP wanted a spouse that acted more mature maybe he should have married someone his own age.",
          "id": 110,
          "comments": [
            {
              "score": 24,
              "content": "The wife is 26! Ffs people, her age here doesn't matter, she's grown. I'm the same age as her and the infantilisation of adult women on this sub is absolutely infuriating. \n\nI don't even agree this is a case of immaturity, she's just controlling as all hell and you don't get to put the blame on the OP because he has a younger wife GTFO with this BS",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 22,
              "content": "I've just gone back and had a look at the ages..yes you're right",
              "id": 112,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "Age gap being used for a maturity argument at 26?\n\nI see people are judging the 9 year difference, but the maturity argument is null at this point.",
              "id": 113,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "26 should be plenty old enough to know this isn't how you treat people you love.\n\n\nYeah the age gap is weird, doesn't mean victim blaming is cool now.",
              "id": 114,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "26 is a grown adult.  Her poor behavior is inexcusable.",
              "id": 115,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Fuck off with that. If OP was the same age this wouldn't be acceptable or understandable.",
              "id": 116,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "People on this sub talk about women the same way Sopranos characters talk about their dead mob associates lol\n\n“She was only 26. Just a fuckin kid”",
              "id": 117,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Grasping at straws to try to excuse the AH...?",
              "id": 118,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 2,
              "content": "She's been an adult for almost a decade. Come on.",
              "id": 119,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 111,
      "content": "Does she usually make everything about her?",
      "id": 120,
      "comments": [
        {
          "score": 25,
          "content": "Seriously.  I would suggest OP turn that fact back on her and demand that if she really needs to talk to someone then *she* needs to get a therapist.\n\nHer actions show her demands are not out of concern for OP or his safety, how very selfish to the point of cruelty.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}