{
  "post content": " I 30F and my boyfriend 38M are having a disagreement and I need an outsiders viewpoint. My boyfriend is a single father of two children 17M and 4M. They are great kids and really don’t have anything to do with the story. Just needed to be mentioned for context. I do not have any children.\nBeing a single father, he works two full-time jobs to support his kids. I also have two jobs, but I work significantly less as they are both rather well paying and have less expenses. As we both work a lot, you can imagine we don’t get to spend a lot of time together. This definitely puts a strain on our relationship, but we have tried our best to make it work as we both love each other deeply.\n\nSince I have more free time, I tend to spend a lot of this free time with my two closest friends. Both of whom are stay at home wives. We like to go to brunches, spa days, movie nights, festivals. Basically, just having fun and enjoying life. My boyfriend often jokes about my “life of frivolity” and “wishes he could have as much fun as I do”\n\nLately, he’s been trying to convince me to use some of my free time to get another job so he can take time off of work because he would like to do those things with me. He said, “with all my free time a part-time job making like a few hundred bucks a week shouldn’t be so hard” and he would be able to work less and spend more time with me. While I would love to spend more time with my boyfriend and can admit that secretly, sometimes I would prefer to be out doing these things with him. I don’t feel it’s fair that I get another job to subsidize his income. He immediately got defensive and told me it wasn’t like that I didn’t understand because I don’t have kids and that he needed to work as much as he did for his children.\n\nThis is where I may have been an A**hole. I told him it was ridiculous for him to expect me to pay to spend time with him. He told me I was being childish and not listening to the situation. Simply he could not afford to work less, and desperately wanted to spend more time with me. He figured since I could earn more money in less time than he could that I should work a little more so he could work a little less. I again told him I would not pay to spend time with him and the conversation and quickly deteriorated. \n\nI just need to know  AITA?\n\n\n\nEdit:\n\nWe’ve been together about a year and we live about 45 minutes apart \n\nHe does work 80 hours a week \nI work anywhere from 35-45 hours a week\n\nMe agreeing and working an extra 10-15 hours a week would mean he would only have to work around 60 hours.\n\nWe do not share finances\n\nHe is overall a great boyfriend, and I do see myself spending the rest of my life with him. \n\nWe have openly talked about the future together. \n\nEdit 2:\n\nHe is actively looking for ways to earn more and work less\n\nThis would be “temporary”, but there’s no saying how long ",
  "id": 1,
  "comments": [
    {
      "score": 2559,
      "content": "NTA.  Let me get this straight; your boyfriend wants you to get a **third** job, **give him the money from said third job so he can work less,** and then spend what little free time you have left with him, thus cutting out your time spent pursuing your own interests and hobbies with your friends.  \n\nWhy would he even think you would, or should, do such a thing?  Your bf apparently thinks he hit the cash lottery with you.  Your bf is the AH.",
      "id": 2,
      "comments": [
        {
          "score": 517,
          "content": "Why doesn’t he get a better paying job? I know it sounds easier said than done but getting a trade would be like taking a step back to take 2 forward. It also makes more sense than asking his girlfriend to subsidize his lifestyle.",
          "id": 3,
          "comments": [
            {
              "score": 230,
              "content": "Absolutely. He wants her to subsidize his lifestyle and pay for his kids because he has a lower earning capacity - and give up her free time along with it to spend any time left with just him.",
              "id": 4,
              "comments": [
                {
                  "score": 148,
                  "content": "[removed]",
                  "id": 5,
                  "comments": [
                    {
                      "score": 212,
                      "content": "Yes, he called her leisure time \"frivolous,\" so he does not respect her and wants to control her. Nurse and purse and nanny. And she gets to pay for the privilege.\n\nRun, OP run!",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "And it’s clear by the age gap in of the kids, there’s 2 different mothers. Absolutely NOT! Call their mothers to help with their life choices. Time for a new BF, this isn’t going to resolve itself. He’s got a resentment with the OP and it’s called jealousy which stems from insecurity.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 20,
                      "content": "It's actually not clear that that's the case at all...",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Can you imagine how he would expect things to go if they were to get married? Or move in together??? She would be working three jobs and paying ALL the bills while he becomes a stay at home dad...",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -9,
                  "content": "[removed]",
                  "id": 10,
                  "comments": [
                    {
                      "score": 4,
                      "content": "[removed]",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "[removed]",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 103,
              "content": "this! work smarter not harder. finding a job that pays better is absolutely the better solution",
              "id": 13,
              "comments": [
                {
                  "score": -34,
                  "content": "Oh yes, great idea, lets all snap our fingers and let a better-paying job fall into our laps!\n\nFor fuck's sake, get back to reality, people.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 38,
                      "content": "lmao that’s not what i said. it’s a start because having op subsidize him is not a long term solution. maybe read what was actually said before getting so angry. you seem out of touch",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 21,
                      "content": "I grew up poor in a garbage trailer park. Dropped out of college, grades in HS weren’t anything to be proud of. \n\nI got tired of only making around 50k. I figured out what I wanted to do and studied my ass off for 6 months. Kept getting rejected for one position and trying again for another. I was lucky enough to be able to not work for like 4 months, but you can make the time if you have to. I was mostly burnt out from the shitty job. The recruiter was impressed, as was the team, so they started sending me suggestions for other jobs. I eventually got in. Now I make 113k. \n\nSo while you can’t snap your fingers, you can dedicate time to getting it in the next year. Not everyone can buckle down and do it. It can be done though.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Literally no one said anything about snapping fingers and having a job fall into one's lap, but go off I guess.\n\n\"Just get a better paying job\" is shit advice. But there's a huge difference between that and \"look for ways to increase your earning potential, like going back to school, switching fields, getting a professional certification, etc.\"\n\n'Work smarter, not harder' is the latter category, in case that was unclear.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "He has a gf who has better paying jobs so she may have some insider knowledge and even connections to getting a better paying position.. \n\nYou are being hyperbolic..",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "They don't live together and don't share finances. In what reality should she work more and give him money because he wants more free time? That's absolute BS. \n\nThe *only* solution is for him to look for a better paying job with less hours. If he doesn't find it, that also has nothing to do with OP.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "Because he already found a better paying job, one that aligns with his interests: Being the „boyfriend experience“ for his girlfriend. Or an escort? I am not up on the lingo.\n\nBut that is, what it sounds like to me.",
              "id": 20,
              "comments": [
                {
                  "score": 2,
                  "content": "I have come across these kinds of people similar to the bf here. They will complain about their situation, victimize themselves and then do nothing about it. Instead they will ask for a handout or worse expect one. Where there is a will, there is a way. If I were the gf, I would run from this situation. Asking her to work more so he can work less is a huge red flag. They don’t live together, she’s not legally obligated to provide for his children and they certainly are not married.",
                  "id": 21,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Exactly, and the dude should be happy his gf is having a great time even without him.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "He is already doing that though.",
              "id": 23,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "I don’t think it’s unreasonable for him to ask for temporary help, as in “hey. I can’t get ahead with 80hr a week. Can you help me for X months to let me get training/schooling so I can increase my earning ability and I’ll pay you back? After that, give me Y months and I’ll pay you back in installments”\n\nIt’s not ideal. It’s rough. If you’re in it for long term, could be a choice.\n\nAnd it’s obviously something that requires timelines",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 156,
          "content": ">your boyfriend wants you to get a third job, give him the money from said third job so he can work less\n\nYeah, I'm not getting the math on that one either. So OP should work another job and then *she can pay for stuff* that should be paid by the boyfriend, like maybe part of his rent, insurance, car payment? Wtf.",
          "id": 25,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "when does he see the kids?",
          "id": 26,
          "comments": [
            {
              "score": 126,
              "content": "If he’s working that much I’d bet that 17 year old is having to look after the 4 year old",
              "id": 27,
              "comments": [
                {
                  "score": 103,
                  "content": "That 17 year old is raising the 4 yo. I have no doubts about that.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Where are the mothers!?",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "With that age difference, I was guessing that the 17 year old and the 4 year old have different mothers and that they live with their mothers.  If he's working 80 hrs/wk he doesn't have time to parent, so probably pays child support and has visitation, but not custody of either child.  \n\nI'm completely guessing all of that, so I could be wrong about all of it.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 33,
                      "content": "OP says he’s a single father to 2 children .. which to *me* implies he has custody of them \n\nWhy would he work 80 hours a week to be able to provide enough for them if he wasn’t their primary care giver ?",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "This is what I thought.  He's not going to spend more time with her.  She'll be working more so he can spend more time with his kids",
              "id": 32,
              "comments": [
                {
                  "score": 31,
                  "content": "And she will be paying for those kids.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -4,
                  "content": "Those two things aren't mutually exclusive....",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Probably every other weekend and then the 17 yr old watches while he works . That is if they have same mothers and are on same schedule",
              "id": 35,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "\\^\\^ THIS \\^\\^ WHY is this falling on OP?\n\nNTA and she needs to move on.... the passive aggressive comments of referring to her life as a  “life of frivolity”  and in the same breath coming off as jealous bc he wishes he could do those things? Sounds like he needs to make some changes in his career so that he can make more money and work less. This is not OPs problem",
          "id": 36,
          "comments": [
            {
              "score": 21,
              "content": "Yeah. She's putting in full time hours.  It's the boyfriend who isn't making a living wage with a single job.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Completely agree!",
              "id": 38,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": "My thoughts exactly.   Boyfriend isn't thinking straight.  Neither are you, if you think this idea is even an option.  \n\nNTA",
          "id": 39,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "🚩🚩🚩",
          "id": 40,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "OP, you are incompatible with your bf. Don’t marry him. He doesn’t know how to handle money. He’s making you a sugar mommy.",
          "id": 41,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "At first glance I didn't understand your comment... Now I realize that it's accurate: if OP's partner was ***not*** getting money from OP, her additional work hours wouldn't relieve his budget concerns.",
          "id": 42,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "He absolutely is the AH \n\nOP they’re not your children. It’s not your responsibility, you guys don’t live together so you haven’t even taken on the step mother role yet. If you lived together and were dating for a few years I could understand it a little more (but not necessarily agree given what you’ve written) \nYou both work two jobs. Why would you want to work a third?? What if he up skills and gets a better paying job so he is able to work less.\n\n\nAnd what really stumps me is that he wants to spend more time with you, but what about with his children? \n\nI hate to be skeptical. But it doesn’t sound like this will progress too much further. There’s some red flags that will be popping up more frequently, especially if you do move in together.\n\nEdited to add - NTA",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "I always wonder what kind of mental gymnastics these kind of men do to convince themselves that something like this is okay to ask their partner to do.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 661,
      "content": "NTA. He wants you to work 3 jobs? 3? Because he had a kid at 21 and then another in his thirties? Nah, that doesn’t sound fair or healthy for you",
      "id": 45,
      "comments": [
        {
          "score": 156,
          "content": "For real. I would have sympathy for the guy being a single father but he apparently made himself a single father….. twice? Did he not learn how to use a condom after the first one? Obviously I’m making assumptions here but I’m guessing both kids were not planned and he did not intend on staying with the mother(s).",
          "id": 46,
          "comments": [
            {
              "score": 94,
              "content": "I just find it so selfish to be a father of two and have a gf for around a year I believe it was and gave the audacity to ask them to work more so that they could give you money to work less hours and do more fun shit together. They don’t split finances, they don’t live together, he’s not asking her to pay for more of their shares experiences so he could join her, which I could wrap my head around. No he’s asking her to literally work an extra job",
              "id": 47,
              "comments": [
                {
                  "score": 53,
                  "content": "To me it sounds like he wants OP to take on extra job, so he can spend more time with his kids (despite him saying it’s to spend time with OP).  \n\nAnd imagine if OP were to comply and then ask “when are we spending more time together?” What a monster the BF will paint her as, for trying to reduce his time with his children!",
                  "id": 48,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Right!  If she increases her hours to help him out then when exactly will she see him?\n\nNTA op",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Also he’s a single dad, okay well where are both mums. If they’re both alive, why is there no child support? If he’s having to work 2 jobs for 80hours a week, his income is probably quite low so he could likely apply for some form of child benefits? There are other avenues than asking your partner to work and that money going directly to him",
          "id": 50,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 412,
      "content": ">My boyfriend often jokes about my “life of frivolity” and “wishes he could have as much fun as I do”\n\nI hate it when people say passive aggressive things like this. \n\nIt's not a joke. He meant it and has passed it off as a joke. \n\nYour life is yours and you get to spend your money whichever way you want and people can keep their little digs to themselves. \" It must be nice to be able to do xyz \" ... Yes, yes it is nice, Barbara. Let's move on. \n\nHe was definitely asking you to work more so you can spend time together - and I think you've reached an impasse, because once you move in together, he fully expects you to subsidise his income. Which is fine , lots of couples do that - but your expenses would considerably increase because of him and his kids solely so he's one who stands to gain a lot more from this deal. \n\nAre you okay with that? That's something you need to decide for yourself.\n\nEdited - forgot to add NTA",
      "id": 51,
      "comments": [
        {
          "score": 134,
          "content": "If her boyfriend wanted to live a life of frivolity he shouldn't have had 2 kids. That's his choice and he needs to own it, not expect others to subsidize it. I agree he wasn't joking, he's telling her flat out he wants her money.",
          "id": 52,
          "comments": [
            {
              "score": 31,
              "content": "Yes, OP don't be a purse and give up your freedom to do it for this guy.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": ">He does work 80 hours a week I work anywhere from 35-45 hours a week  \n>  \n>Me agreeing and working an extra 10-15 hours a week would mean he would only have to work around 60 hours.  \n>  \n>We do not share finances  \n>  \n>He is overall a great boyfriend, and I do see myself spending the rest of my life with him.  \n>  \n>We have openly talked about the future together.\n\nYou're assuming too much. He is probably either divorced or widowed and his choice of having children at the time would have included someone to help him. I'm guessing that what he mostly likely want is a bit of a break and not literally living a life of frivolity. I mean working two jobs and taking of two kids is exhausting so I don't fault him for desiring a break. However, that is definitely not a tasteful way of asking for it and the way he puts it feels off for another reasons that I can't quite explain.",
              "id": 54,
              "comments": [
                {
                  "score": 15,
                  "content": "He's manipulative and trying to make her feel guilty.  Gross!  She should RUN!!!!",
                  "id": 55,
                  "comments": [
                    {
                      "score": 2,
                      "content": "true, it's manipulative treatment.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "Absolutely. Boyfriend resents the fact that OP has free time when he has a lower earning capacity and had a child very young and then another child. OP and he are not living together. He is basically asking her to pay his bills and childcare expenses so that HE can have free time. It is also a red flag that he wants to spend free time with her instead of her having a social life of her own. He is going to try to control her social life and take her money.\n\nOP run, don't walk away from this man.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "I feel like he says those things to make her feel lazy and entitled,  so she'd feel guilty enough to do what he wants.",
          "id": 58,
          "comments": [
            {
              "score": 34,
              "content": "Saying those things to me would make me feel single.",
              "id": 59,
              "comments": [
                {
                  "score": 12,
                  "content": "That's made me laugh 🤣 thank you. \nHearing that from my boyfriend would make me feel really single too.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 271,
      "content": "NTA but this story is missing a lot of important context. Do you live together? Do you share expenses? How much do you both actually work? If you live together then your free time/income all needs to be factored together to find more equal solutions. It’s a more nuanced conversation. If you are just dating then obviously your work/income doesn’t impact him at all and what he’s suggesting sounds like you giving him an allowance to supplement his personal income and pay his personal expenses in return for spending time with you. Which I wouldn’t do either. \n\nI honestly can’t even imagine a boyfriend saying, “hey why don’t you get another job so you can give me that money and in return I’ll come do fun things with you that you normally do with your friends”.",
      "id": 61,
      "comments": [
        {
          "score": 77,
          "content": "OP says they live 45 minutes away from one another.",
          "id": 62,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 16,
          "content": "Forgot to add \"with my 2 kids\".....",
          "id": 63,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -129,
          "content": "It makes more sense when you read the edit.\n\nShe is definitely TA.  She wants her cake and to eat it too:  she sees themselves together forever, but is unwilling to make the sacrifice necessary for them to have that needed time together.  Apparently because it offense her sexist sensibilities, i.e. \"I shouldn't have to pay for my guy's time, that's a guy's job!\"\n\nShe should just break up with him already and find some wealthy sugar daddy so she, too, can quit work and be a stay-at-home wife, and let her BF find someone who is actually decent and loves him for who he is.",
          "id": 64,
          "comments": [
            {
              "score": 80,
              "content": "What an odd thing to say. Just because she doesn’t want to subsidize the lifestyle of her partner who doesn’t live with her doesn’t make her TA. You’re very obviously projecting your personal feelings onto the matter. She can love him and not want to fund him at this point in their relationship. This would be just as bad if the genders were reversed.",
              "id": 65,
              "comments": [
                {
                  "score": -64,
                  "content": "He isn't asking her \"subsidize his lifestyle,\" only to work some extra hours so they have more time to be together.  If she wants to spend the rest of her life with him, and pines for more time with him -- both of which she says is true -- there's only one path to that, and that's easing his financial burden so he has more time.  \n\nThat's called starting to think like a couple, rather than just for herself.\n\nMen have done this for centuries when they work more than they want to, so they can provide for their family.  Happily, now women have the chance to play that role too.  But witness the rank sexism of all these redditors, saying the woman shouldn't have to make sacrifices!  \n\nMy guess is he will realize that that she has a double-standard and dump her, so he can find a decent woman who loves him for him, and she can go off and find some sugar daddy from a wealthy family who is there for her AND can provide financially.  \n\nIts like some of you people want to reverse womens' rights 100 years.",
                  "id": 66,
                  "comments": [
                    {
                      "score": 62,
                      "content": "If the roles were reversed, and it was the woman asking the guy to take on another job and hand the proceeds to their gf *of only a year*, it would still be ridiculous.  \n\nThe example “guys have been doing this for centuries for their families” is irrelevant, because this isn’t her family. It’s a guy with kids that she’s known for a little while.  \n\nPlus the guy says he wants it so he can see OP more, but then bemoans not seeing his kids more - how much time is he expecting to claw back using OP’s time and money?",
                      "id": 67,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 53,
                      "content": "Except he is. They don’t live together or have combined finances yet and he wants her to work more so he can woke less. \n\nStop with the sexism crap. Women have held down households too. It’s a choice that happens when people are married and their lives are joined. They aren’t married and they don’t live together which means that he gets zero claim to her money, same goes for her with his money. \n\nYou are truly an odd individual for twisting this to seem like she doesn’t love him and is somehow a gold digger because she doesn’t want to fund his lifestyle. This has nothing to do with women’s rights but sure please keep pretending you don’t have some strange bias towards women",
                      "id": 68,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "It's like you didn't even read the post. They've only been together for a year and some, they don't live together/share finances, and she makes more money than him working less hours w/ no kids...  Soo, he's the wanna-be-sugar-baby. She's dodging, becoming a sugar mama. Bc essentially he's asking her to pay him to hang out... He's asking her to pay him to hang out by getting a 3rd job and handing the check over. He's not an escort now, is he? What a terrible take you have.",
                      "id": 69,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 41,
              "content": "Giving money to a BF, when they aren't even married, is a weird af take. Esp when she'd have to get a third job and work more hours? They don't share finances, they don't even live together.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "That's just silly talk, and being rude for rudeness' sake.",
              "id": 71,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Is he an escort?",
              "id": 72,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 153,
      "content": "NTA. You are being taken for granted.\n\nIn a relationship, it's important for both partners to support each other, but this doesn't necessarily mean taking on additional work to subsidize the other's income. Your time is valuable, and how you choose to spend it is up to you, especially since you've worked hard to be in a position where you can enjoy your free time as you see fit.Your boyfriend's situation is undoubtedly challenging, and his desire to spend more time with you is understandable. However, suggesting that you should get another job so he can work less places an unfair burden on you. It's not your responsibility to change your work-life balance to alleviate the pressures of his responsibilities, especially when it comes to financial matters and personal time.\n\nIt's also concerning that he labels your lifestyle as a \"life of frivolity\" and then asks you to alter it for his benefit. A more constructive approach would be for both of you to discuss ways to manage your time together within the current constraints of your lifestyles and work schedules, without expecting one another to make unilateral sacrifices.  \n\n\nThe conversation might have deteriorated, but it seems this was due to the strain of the situation rather than any intentional wrongdoing on your part. It's worth revisiting this discussion when both of you are calm and can talk about your needs and capabilities without judgment or unrealistic expectations.",
      "id": 73,
      "comments": [
        {
          "score": -56,
          "content": "It doesn't sound like OP is up for supporting anyone but themselves. I don't see this relationship getting much further.",
          "id": 74,
          "comments": [
            {
              "score": 35,
              "content": "An adult with two children should have the wherewithal and resources to support them self.",
              "id": 75,
              "comments": [
                {
                  "score": -48,
                  "content": "He does, he works 80 hours a week to provide, lol. For the record, I'm not agreeing that OP should subsidize him, I'm simply pointing out that to me, being in a relationship means helping each other better themselves. All I see on here is people advocating for people to be self centred.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 30,
                      "content": "They don't share finances. He's not even asking her to share finances. Hes asking her to take on a share of his responsibility.  Taking care of an adult and his kids aren't this girls responsibility. If he wants free time he should try to better himself and get a decent job so he just works 40 hrs wkly. Not take advantage of someone that cares about him.",
                      "id": 77,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "It's really early in the relationship and the boyfriend is making inappropriate asks regarding the way OP spends her resources. He's asking for a degree of self sacrifice and investment that is only appropriate in a long term relationship, and shouldn't be open-ended on the timeframe. \n\nHe's also attempting to shift his responsibility for his children's financial security to OP. Which, frankly, is pure madness. Why would any responsible parent be comfortable relying on someone they've been with a handful of months? It reads like he's trying to get her entangled enough that it's difficult for her to pull away.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "They are simply dating not in a relationship not engaged not even living together",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "They aren't married. They don't live together. They have been dating for a year. She does not need to pay anything for him. \n\n>being in a relationship means helping each other better themselves\n\nYes. It does not mean her working more hours to give him the money so he can take care of his children that he had before he met her.",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "That's a good thing because the bf is looking for a purse to subsidize his costs and his children at the expense of OP's free time and money.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 107,
      "content": "NTA but you've chosen to be in a relationship with an older man with 2 kids and 2 jobs and no time and no money. Doesn't sound like a very fulfilling relationship.",
      "id": 82,
      "comments": [
        {
          "score": 32,
          "content": "She’s not complaining - he is.",
          "id": 83,
          "comments": [
            {
              "score": -21,
              "content": "She is, after he called her frivolous and wanted her to pay his bills, giving up her free time.",
              "id": 84,
              "comments": [
                {
                  "score": 25,
                  "content": "So she’s complaining because HE wants HER to not only stop spending her money on herself but to ALSO get a THIRD job to help support HIM. \n\nDo you understand how ridiculous you sound?",
                  "id": 85,
                  "comments": [
                    {
                      "score": -11,
                      "content": "Why am I ridiculous? OP posted this because she was offended about his tone and they had a fight. \n\nShe asked if she was TA to be offended. She is not TA. Learn to read and comprehend.\n\nOP has every right to complain about his entitlement.",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 86,
      "content": "NTA. Your boyfriend is wrong for assuming that the two of you would have merged finances. Married people sometimes merge their finances, but not always. Bf and gf do not merge their finances, and with his scheme he is actually expecting you to pay to spend time with him.",
      "id": 87,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 82,
      "content": "You subsidizing him being reckless with his seed is absolutely ridiculous. He created the financial liability and now he’s trying to guilt you into being responsible for it.  It’s about time for you to move on and find someone more suited to your situation. It will only get worse with him and the conversations will only get more heated and intense. NTA.",
      "id": 88,
      "comments": [
        {
          "score": 9,
          "content": "It is possible that he is a widow. So it's not necessarily that he is being reckless with his seed.\n\nI'm not sure where you stand on if his ex-spouse has walked out on him and the kids. Would you consider this him being reckless for his choice of partner or will it depends on whether there was red flags or not.",
          "id": 89,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 58,
      "content": "[deleted]",
      "id": 90,
      "comments": [
        {
          "score": 8,
          "content": "Makes me wonder why he is single.",
          "id": 91,
          "comments": [
            {
              "score": -2,
              "content": "I'm don't know why he is single, but his ex-wife is either dead or alive. If she's alive and not helping with the kids then I'd have a harder time placing the majority of the blame on him for being single as you seem to imply.  \n\n\nNot implying he's in the right here. Life is just unfair some times.",
              "id": 92,
              "comments": [
                {
                  "score": 2,
                  "content": "It probably doesn't matter if moms are involved or not. When you have kids, you dont know what you'll get and don't know what curves life will throw you.\n\nLife isn't fair.  It isn't for other people to clean up.   If he's proposed these money ideas to other women, it makes sense to me he'd be single.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 50,
      "content": "But... how are you going to spend time with him while working three jobs? I don't get the logic here",
      "id": 94,
      "comments": [
        {
          "score": 12,
          "content": "[deleted]",
          "id": 95,
          "comments": [
            {
              "score": -1,
              "content": "Yea, that's where I'm at too. I dont think he is an asshole or even that it's a \"red flag\" that he is asking for this. But *expecting it* is another thing. It's pretty clear that they both have different expectations.\n\nHowever, if the OP really does love them and sees themselves with them forever, a better solution might be to move in together so that they can split resources more efficiently and lower the CoL for both of them without OP needing to work any more.",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}