{
  "post content": "I (F32) got a private text this morning from the mother of my son’s (M7) classmate. She told me that apparently my son has been calling her daughter’s traditional lunch weird and things as such and apparently that is making her daughter feel uncomfortable and insecure. She asked me to please talk to my son about being more sensitive and respectful so her daughter doesn’t feel excluded.\n\nNow, I feel for this woman as a fellow mother. No one wants to see their child feeling sad, but overcoming insecurities is a big part of growing up. Additionally, I thought it was ridiculous of her to criticize my son, a 7 year old, for making relatively innocuous and curious comments about food that is not familiar to him. He’s at a curious age and is discovering the world, and I refuse to try and limit him and shut him down for not having the emotional sensitivity of an adult.\n\nPolitely, I told that mother that I was sorry her daughter was struggling with insecurities, and I found some online parenting articles about building your child’s confidence to send to her so she could use some tips to help her daughter out.\n\nShe replied and said I was acting completely shamelessly and disgracefully, and I am not able to text her anymore. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 61148,
      "content": "YTA\n\n>I refuse to try and limit him and shut him down for not having the emotional sensitivity of an adult.\n\nTeaching your kid to be respectful of other's choices is NOT \"shutting him down\", it's literally part of your job as the parent to....y'know....*parent*.\n\n&#x200B;\n\nEdit:  Thanks for the awards!",
      "id": 2,
      "comments": [
        {
          "score": 17129,
          "content": "Yeah, like where does OP think kids are going to learn to have the emotional sensitivity of an adult?\n\nBy being taught in these teachable moments.",
          "id": 3,
          "comments": [
            {
              "score": 6815,
              "content": "EXACTLY!! This is literally the moment where that happens...or doesn't, in this case. Such a great opportunity for teaching and growth. Learn about the food, try takeout from new places, read some books, and learn why it's important to be kind and respectful of differences. Ugh.",
              "id": 4,
              "comments": [
                {
                  "score": 4216,
                  "content": "Entitled child in the making.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2719,
                      "content": ">Entitled child in the making.\n\nWhich will most certainly lead to an entitled adult.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 685,
                      "content": "Racist in the making",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 585,
                      "content": "OP is an AH who is raising an AH.\n\nThis is the latest episode of AH Next Generation.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "With some racism to boot",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 16,
                      "content": "No... Entitled child has already been made. This is just protecting the entitlement.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "So quick to be the victim when they’re the aggressor. \n\nReminds me of that video of the woman going on a racist rant bc the pizzeria guy is Hispanic and whatever is on tv is in Spanish. She calls them victims and herself an American until she starts videoing them back and then all of a sudden she’s the victim and all these people are being mean to her because she’s WHITE.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "Or worse, bully in the making.",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1466,
                  "content": "EXACTLY. When I was five, I said a rude thing (which I had heard from someone, obviously) about one of my best friends' religion (he was Roman Catholic, I was some form of protestant). I said this rude thing because I was mad at him, and nevermind \"said\" - I shouted it, loudly, in front of his house, under the kitchen window. Needless to say, his mom talked to my mom... And what did my mom do? Sent me to Catholic church with some other neighbour the next Sunday, so I could see what \"their\" service was all about. I came home, all excited about THEY HAVE HOLY WATER!!! and THEY GET LITTLE COOKIES!!! and \"IT SMELLS SO GOOD WHEN THEY WAVE THE SMOKE.\" Poof, went that prejudice - turned into envy...that we weren't Catholic. (I'm agnostic now, but I still remember that day, and that lesson.)",
                  "id": 13,
                  "comments": [
                    {
                      "score": 423,
                      "content": ">I was some form of protestant\n\nThis made me laugh 😃",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 232,
                      "content": "An upvote for your mum..",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "This is such a cool way to teach and parent!",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "That part! \nWhat a teachable moment. \nAll I’m thinking was what was this little girl eating cause I bet it was richly flavored, yummy cultural goodness.\nBut what 7 yr old even understands that \nAs a mom - what did she have, is their a restaurant nearby - family dinner night out - exposure and experience is the hallmark of a great childhood.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "Exactly. She should have taken him to every requirement in town that isn't local cuisine over the next year to broaden his cultural awareness. Were in the SE USA and my kids love sushi, Ethiopian, and Thai and Indian is routine. My kids friend was over for dinner and thought the Indian was the best thing ever and even ate a lot of saag on her own helping herself to second m her mom says she's a picky eater. Kids are way more flexible than their parents.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "They have cookies! Lol, kids",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "Seriously, SUCH  teachable moment. She could have asked the other mom what the food was, what the culture behind it was, and taught the son about things outside of his experience.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "This is such a great teaching moment totally missed. \"Different doesn't mean wrong. Apologise to the girl for being mean. Now why don't we try cooking/eating a few things together from a different culture and see what we think\".",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Than to have the balls to send the other mother articles online. Wow. What a bitcharoonydoony",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Also how is saying someone’s food is weird an action of curiosity and not just unkind?  Clearly it didn’t happen one time either if the mom felt she had to call the kids parent?  Not checking this behavior now is just enforcing him becoming a more effective bully.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 781,
              "content": "Yes! This was such a good opportunity for a teachable moment. And she just threw it away so she could be condescending and rude herself.",
              "id": 24,
              "comments": [
                {
                  "score": 47,
                  "content": "We know where he gets his manners from.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Right? What a great moment to ask the other mom what some of the food is, then go out and try it as a family. Then he has a way to connect with his peer instead of making them feel different.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "But come on!!! OP can’t teach what she, herself doesn’t have.  I read once that we should “teach our children good manners and emotional intelligence 25 years before they are born”",
              "id": 27,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9984,
          "content": "While he shouldn't have \"emotional sensitivity of an adult\", the 7yo girl should learn how to deal with insecurities. How curious... \n\nYTA.\n\nEdit: that was my first time receiving awards. Thank you so much ☺️",
          "id": 28,
          "comments": [
            {
              "score": 5314,
              "content": "Lmao that's the part that gets me. \"My seven year old is a precious baby child, but her 7 year old needs to buck up and overcome issues adults struggle with.\"",
              "id": 29,
              "comments": [
                {
                  "score": 1854,
                  "content": "YESSS. Op is so hypocrite with those double standards it's disgusting.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 3705,
                      "content": "Annnnnnnd that, my friends, is how we create women who adopt others’ emotional burdens and men who don’t even carry their own",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 217,
                      "content": "I can't believe someone actually has this mentality, that kid is gonna be spoiled in a bad way if OP doesn't reconsider how they're raising him",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "My jaw hit the floor reading her post and you summed up why perfectly",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 925,
              "content": "this is the perfect age to teach him “Don’t yuck my Yum”",
              "id": 34,
              "comments": [
                {
                  "score": 366,
                  "content": "My parents believe in what I call the 'Here, try this' method. It goes: 'Here, try this' 'What is it?' 'I'll tell you after'. They always served off their own plates, and never offered something they knew I would hate. I trusted them, so always tried at least 2 bites. They threw every kind of food they could at me, and have for as long as I can remember. \n\n\nNow, as an adult, I'm willing to try almost anything and have an eclectic bunch of favorites. I go out to eat raw squid with fish eggs and grilled eel on my birthday. I am eating tripe, raw beef, and beef tendon while I write this. Stuff nearly anything in a roasted then deep fried jalapeño, and I'm all over it. I occasionally eat pickled herring *because I like it*! **With sour cream!** \n\n\nSo my food mantra is 'Don't yuck my yum!'",
                  "id": 35,
                  "comments": [
                    {
                      "score": 175,
                      "content": "I’m half for this method. I’m all about giving kids a huge variety of food and definitely do this with my own kids. However, I hate when people go ‘try this’ and refuse to give me any info. I need to adjust my expectations for what’s going in my mouth. That surprise when what you thought was white chocolate turns out to be cheese or something really unsettles me. I just need some info -try this, it’s savoury and cheesy. Try this, it’s creamy and rich. Also if you give kids the vocabulary to describe food, they’re better able to articulate what they like and don’t like. And you wind up having very amusing gastronomic conversations with a 9 year old.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "It’s because the other seven year old is a girl but boys will be boys",
              "id": 37,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "This was my exact thought. Also… Without knowing much about it, and going off of the words “traditional” and “unfamiliar” I feel like this is probably an ethnic meal and not a hellmans vs miracle whip comment. If so there is a lot more to unpack here. Food is personal, can be a very loaded topic and school meal settings are a huge opportunity for ostracism and bullying. The more I think about this, I feel like there is more going on than OP is letting on or refusing to acknowledge. At best this is a great teachable moment about new experiences - at worst she’s training a bully. YTA",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Man. When I was a child some 25 years ago, I would take kimbap to school because it is my favourite food in the whole world. My mom would get up early and make it for me and I'd quietly eat it at lunch.\n\nI was already \"weird\" at school because I am Korean and it was a predominately white and black area and so I was made fun of a lot without this happening.\n\nAfter a while I asked my mother to stop sending me to school with Korean food because, even though I liked it, the other kids would say it was weird and smelled funny.\n\nI'm a grown ass adult now, and I made my husband cheese kimbap to take to work last weekend and as I was packing it I kept thinking \"I hope his coworkers don't make fun of him.\" ( We live in the south. It's not a ridiculous thought. )\n\nAnd when he came back I asked if anybody said anything and he said no, nobody else was in the break room when he had his kimbap.\n\nBut TWENTY FIVE years later, I still think about it if I eat/prepare kimbap for outside of the house.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2780,
          "content": "These are the families that my teacher friends absolutely hate. The kids are terribly behaved and the equally insufferable parents excuse it with BS like this. \n\nYTA",
          "id": 40,
          "comments": [
            {
              "score": 616,
              "content": "As a Kindergarten teacher-YES!",
              "id": 41,
              "comments": [
                {
                  "score": 627,
                  "content": "I hope the poor girl’s mom had a talk with their classroom teacher as well. I’m also a K teacher and if I found out about this we would have a whole class talk about how everyone eats different foods because they come from different cultures. \n\nOP is missing out on a great opportunity to help their son explore new cultures and cuisine. If it were me I would take my son to an Indian/Korean/Mexican/whatever type of restaurant and show him that the food is delicious and enjoyed by many people. And we would also have a talk about kindness and showing respect to others. It doesn’t have to be a “punishment” to teach a child about empathy and kindness.",
                  "id": 42,
                  "comments": [
                    {
                      "score": 274,
                      "content": "When my child was in elementary school her teacher organized a special day where each child brought 27 servings/samples (enough for each student as well as the teacher) of a food from their culture.  Throughout the day, each student was asked to talk about their heritage, where their food was from, a special memory involving the food (ie. my grandma always makes rice pudding when…) and then everyone would try the food.  It was a hit with the kids and each of them was sent home with the recipe for each of the foods.  Such a great and fun way to teach and experience diversity and inclusion.",
                      "id": 43,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 211,
              "content": "As a preschool teacher I absolutely teach my kiddos that comments like that are rude and unnecessary and that it’s not ok to mock people for differences.",
              "id": 44,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "I’ve been going back and forth with one of my sons teachers recently for some shenanigans (nothing nefarious, just surly teen being a stubborn surly teen) and I swear that poor woman all but kissed me because I treated her like the educated human she is.\n\nInsufferable parents are the worst",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Preview of when the mom storms into the college prof's office and berates them for being unnecessarily harsh on little Timmy's final essay and demands a regrade.",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2274,
          "content": "Isn’t it interesting that “overcoming insecurities is a big part of growing up”, but when it’s her kid, it’s “ridiculous to criticise”. And of course, the female child should have the emotional maturity to put up with being harassed by the male; “boys will be boys” after all 🙄 \n\nBeing respectful is also part of growing up, looks like OP skipped those lessons in her own schooling. Maybe she should join her son in primary school to revisit basic courtesy.",
          "id": 47,
          "comments": [
            {
              "score": 855,
              "content": "Boys will be boys (well into their 30s). Seven-year-old girls, on the other hand, need to learn to manage their emotions and manage the insecurities of boys (and men).",
              "id": 48,
              "comments": [
                {
                  "score": 187,
                  "content": "And it is always the girls fault. Whatever happended to the girl in the future is always her fault.\n\nBoys will be boys. They can never take responsibilities for their actions. It is always the girl who ask for it.\n\nRAGE",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "And now in addition to acting in a manner as to not provoke anger, not dressing in a manner to provoke harassment or assault, now we need to not eat things that will provoke insults.",
                  "id": 50,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 701,
              "content": "I am starting to believe that the reason girls mature earlier is the expectation that they will behave in a ladylike manner from the moment they can walk and talk, while boys are allowed to be as childish as they want for as long as they want. What we call maturity is not the real thing in most cases - that comes much later on. We just are told to act our age, no matter what age - not a concern for most men outside a professional environment. When women are having fun, they are acting crazy or have loose morals, if men are having fun, they are just “fun guys”. Over the next several years, this little boy will be allowed to be insensitive and childish whenever he wishes, all while having his mother support this behaviour. Meanwhile, little girls everywhere will be told they need to grow up and not be *over sensitive* whenever their feelings are legitimately hurt",
              "id": 51,
              "comments": [
                {
                  "score": 186,
                  "content": "I believe it. I’ve always been more mature than my older brother because I was held to a higher standard than he was. Example I remember my parents celebrating my brother getting b’s and c’s but my straight As were met with “but it comes easy to you.” No, I actually did the work, he always got a pass for his behavior. I almost died and my baby almost died in 2020 and my parents couldn’t isolate to visit us because *my adult brothers needed them* because one brother can’t cook for himself and lives at home (though an adult) and the other was “struggling with his divorce” that had been finalized over 2 years. I’ve accepted that of my parents three children I will always be last on their priority list.\n\nEven still I had someone in a parenting group this week insisting that boys potty train slower than girls because of maturity and I’m like no, my son isn’t potty trained yet because of his personality, which is very similar to mine. My mom loves to reminisce that I was potty trained at a later age than my older brother.",
                  "id": 52,
                  "comments": [
                    {
                      "score": 74,
                      "content": "Nevertheless guess who they expect to care for them when they are old. Please keep these memories for that situation.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "All of this. This was me as a child too which makes these comments all the more anger-inducing - the boys in primary school made me feel like absolute shit, day in day out, whether it was physically attacking me or just sitting next to me in class telling me I was ugly/stupid etc. When I complained to any adult it was ‘you’re such a sensible well-behaved girl, you have to just ignore them because you are more mature than them, they can’t be like you so they act like this.’ They never had to stop, it was just accepted that boys do this and girls must weather the storm",
                  "id": 54,
                  "comments": [
                    {
                      "score": 13,
                      "content": "This was a horrible time and obviously still is.",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "It IS the reason. It's 100% because we allow boys to coast through bad behavior while holding girls to a higher standard. Boys need to be held to the same standard as girls. This is one of those instances where sexism actually hurts boys and men.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "\"Not a concern for most men outside the professional environment.\" \n\nIt's not a concern for most men inside the professional environment, either.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Honestly, though. \n\nThe fact that OP doesn't see the screaming red flashing light that is \"STOP TEACHING YOUNG GIRLS TO BE SO AWARE OF THEIR FOOD AND FIGURE\" is so concerning to me.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1045,
          "content": "Yup. OP wouldn't be 'punishing' her kid. She would be teaching him that some behaviors and actions are unacceptable. That 'emotional sensitivity' doesn't just come out of nowhere. \n\nA 7yo girl doesn't tell her mom about something that happened hours ago unless it made an impression. Her boy's 'innocent curiosity' is more likely rudeness at best, bullying at worst. She followed it up with actions that are also rude at best, bullying at worst. With just a dash of misogyny to keep things interesting.",
          "id": 59,
          "comments": [
            {
              "score": 319,
              "content": "This is worrysome actually, that she understood punish immediatly.\n\nIt seems that to OP, the only way to correct an undesirable behavior is to punish. \n\nTalking, guiding, teaching isn't even in consideration for her son.",
              "id": 60,
              "comments": [
                {
                  "score": 41,
                  "content": "Really good point. I didn't read the other mum as wanting OP to punish, just have a conversation with her son about how his behaviour was hurtful.",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Absolutely this. OP could just talk and guide.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Right? I see so many different ways this could have been handled positively by OP. She chose the most insulting and demeaning way possible out of arrogance.\n\nOP, all you had to do was tell the other mother \"thank you for letting me know. I will talk with him.\" And that would have solved your interaction with the Mom. She raised a VERY valid concern and you dismissed it out of hand.\n\nFor your kid, the easiest way to handle it would have been to go to a restaurant of their ethnic background and order something from the menu that he would like. Ask the server what traditional foods kids his age enjoy. Boom. He eats it, likes it and boom - a bridge has been built. Especially if he sees you and other people eating other food off the menu.\n\nIt normalizes the food she is eating. \n\nTry a little parenting and kindness here - it goes a lot further than behaving defensively.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 208,
              "content": "There's a little something racist (or at least xenophobic) in there too. Her \"traditional\" foods are weird? Hmm.",
              "id": 64,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 67,
              "content": "Right? She wasn't even asked to punish him. She was literally asked to have a conversation with him. Calling something \"weird\" isn't an expression of curiosity. It's a judgement.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 979,
          "content": "I'm also astounded that OP's calling this \"curiosity,\" because it's literally her child being closed minded (which makes sense for a 7 year old). Curiosity would be asking about the food or asking to try it, not labelling it as \"weird\" and making a classmate uncomfortable about their own food.",
          "id": 66,
          "comments": [
            {
              "score": 306,
              "content": "How dare you limit my child's opportunity to bully other kids!",
              "id": 67,
              "comments": [
                {
                  "score": 20,
                  "content": "My RiGHts for my son to be the full yt male supremacist he was born to be.",
                  "id": 68,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "One of my most embarrassing childhood memories is when I enthusiastically went \"wow! this is weird!\" when my aunt (then my uncle's fiance), who's Korean, made a side dish with kimchi. I was like 6, meant it in a, like, \"cool, unfamiliar food I like\" way, and it still makes me absolutely cringe thinking about it. She was nice about it and my mom had a *discussion* about *not* using \"weird\" in a complimentary way lmao",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Let's call it what it is: racism.\n\nThis kid is being racist against his classmate because of her food and that's awful.",
              "id": 70,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 640,
          "content": "To a lot of people, “weird” means “different in a bad way.” He’s not open to this new thing. He’s criticizing it.\n\nKids who are different are often bullied for being “weird.” It isn’t a positive to most people. It isn’t neutral. He’s not open to it.",
          "id": 71,
          "comments": [
            {
              "score": 174,
              "content": "As a 'weird' kid, I approve this message. \n\n\nAs an adult, I glory in my weirdness. But that's because I have found people that are also 'weird'. As a kid, it was a biting insult. It's definitely a kickoff point for bullies.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "I want to know how OP would react if someone called her kid “weird”.",
              "id": 73,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Indeed. There was no \"curiosity\" here at all. The boy didn't ask what was in it, where it was from or it he could try some. \n\nHe made a negative judgement and verbalized it in the presence of the students' peers. Total AH. \n\nOP, YTA for not teaching your child basic manners, and an even bigger AH for not even considering this to be AH behavior.      You're an AH raising an AH.",
              "id": 74,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I've read *so* many stories of kids with \"non-traditional American backgrounds\" get bullied for their ethnic foods at lunch, which in turn causes them to be put down for their identity. Do better as a parent and make sure this little girl doesn't feel ashamed to be her. YTA",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Also, just because a child has insecurities they need to overcome doesn’t mean it’s ok for her son to make them worse. When I was in elementary I only ate one kind of sandwich, and it was a little weird and one kid made fun of it so I literally just stopped eating. I skipped lunch until I was enough to drive and grab food somewhere else because I didn’t want to get made fun of for my food choices. I still have insecurities based around food and eating in public to this day and I’m 33.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Yeah, \"he doesn't have the emotional sensitivity of an adult\", how is he ever going to if he isn't taught?",
          "id": 77,
          "comments": [
            {
              "score": 13,
              "content": "And he needs to be taught by someone else because apparently Mom missed that class also. Sending the other Mom articles on how to parent her daughter when it was her son causing the problem was sooo condescending!",
              "id": 78,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 29209,
      "content": "YTA. Your kid is bullying another student in a racist manner. Are you trying to raise a racist?",
      "id": 79,
      "comments": [
        {
          "score": 6547,
          "content": "Exactly. YTA.",
          "id": 80,
          "comments": [
            {
              "score": 8126,
              "content": "The title of this says \"punish\" but no one mentioned \"punishing\" him. The mom just asked OP to TALK to him. Like, how shit of a parent do you have to be to say \"nah, fuck that. How about you teach YOUR kid to suck it up?\". Jfc",
              "id": 81,
              "comments": [
                {
                  "score": 4658,
                  "content": "The balls to send *parenting advice articles* to someone who is telling you your kid is being rude or a bully. Sometimes, I just can't with some people.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 1154,
                      "content": "That other mom’s response was way more polite than mine would have been",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 329,
                      "content": "“I can’t text her anymore” with the surprised Pikachu face. Omg.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 126,
                      "content": "Yeah, I thought the parenting advice for the other mother was very classy.  Like, hey I know my kid is a little asshole and will very likely be a massive bully by the time he gets to middle school, but here’s some lovely reading material so you can prepare your daughter, now, for the even worse bullying she will receive in a few years from him.",
                      "id": 85,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 37,
                      "content": "For real like that was gross",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 698,
                  "content": "Not to mention the patronizing comment about the other child’s “insecurity” and sending articles to the other parent to address that.",
                  "id": 87,
                  "comments": [
                    {
                      "score": 16,
                      "content": "The insecurity that her son gave her no less. She's so obtuse.",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 284,
                  "content": "This.   7 year olds say some off things sometime, but this is the age where they are learning to do better and should want to do so.  This was a great opportunity to teach son how to be respectful.  That's nit punishment, it's a lesson.   Instead OP gaslights other family and acts as if her son can do no wrong.  YTA for raising a future YTA for this forum",
                  "id": 89,
                  "comments": [
                    {
                      "score": 17,
                      "content": "When my kid was maybe a little older they were playing with a friend and they was touching the friends hair- friend said stop and my kid said “but it’s so fluffy”\nI pulled them aside and reminded them that you never touch anyone without permission and explained issues with white people touching Black hair. \nI did it privately to avoid embarrassment, had them apologize for not listening when their friend said stop. \nThey should have already known not to touch without consent because we talked about that regularly- but that needs to be reinforced regularly, other more nuanced discussions about how to treat others get taught by addressing them as they occur or when bad behavior is seen in entertainment or on the news. \n\nWondering what OP thinks is worthwhile to teach her kid.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Was a perfect opportunity to take the son out try different a cuisine and learn, would have been a positive learning experience but no OP wants to raise a small minded child\n\nYTA",
                      "id": 91,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 28,
                  "content": "In fairness based on the OPs post having to talk to them would be a punishment.",
                  "id": 92,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "Exactly this. It’s a teaching moment. Use this opportunity to talk to your kid about different cultures and cuisines. You’re right, kids this age ARE curious.\n\nOP YTA. Giving parenting tips? Really?",
                  "id": 93,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "This is a key point. OP tried to craft a narrative where OP is N T A (because it’s true a 7 year old shouldn’t be punished for such an “innocuous” comment) but definitely YTA for not using the teachable moment. Sending the other parent “articles about overcoming insecurities” was the cherry on top !",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "To some, accountability=punishment. \n\nAnd those “some” are usually entitled, self-centered, narcissistic people. \n\nBut maybe they could have their victims read a book about it and work on it. Cause after all, dealing with a**holes is just a part of life.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "So many parents I encounter are like this. My kiddos have had issues with their classmates just like all kids do, and half the parents are mortified and half are like 🤷🏻‍♀️",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "She one of the “boys will be boys” people",
                  "id": 97,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1386,
          "content": "OP seems like a bully and a racist herself.",
          "id": 98,
          "comments": [
            {
              "score": 814,
              "content": "Hey, kiddo learned it from somewhere. \n\nI love that this woman also expected the girl to regulate her own emotions but her sweet little boy can be as much of a little shite as he wishes. Racist, with a sprinkle of misogyny and a little hypocrisy",
              "id": 99,
              "comments": [
                {
                  "score": 72,
                  "content": "Little girl should go back to school and ask OP's son, \"Why are you such a racist bully?\" You know, because she's at that age where she's curious.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I wonder if her sweet little boy would have been \"curious“ enough to comment the food of another boy - let‘s say a boy who is taller than him -  the same way.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 139,
              "content": "Flying a trump 24 I flag high I bet 👀 that’s the first thing I thought",
              "id": 102,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 778,
          "content": "OP is firmly convinced it’s their fault for being different, and you just know she’s one of those people who will scream that people are just so fragile these days.",
          "id": 103,
          "comments": [
            {
              "score": 258,
              "content": "OP definitely calls people snowflakes.",
              "id": 104,
              "comments": [
                {
                  "score": 15,
                  "content": "All while being the biggest snowflake herself.",
                  "id": 105,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 93,
              "content": "All while being horrified if her child is exposed to history in history class or science in science class.",
              "id": 106,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 34,
              "content": "OP definitely identifies as a “boy mom”.",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "I'm willing to guess that OP has \"beach hair-don't care\".",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "And if someone says something negative about her its cancel culture and 'woke' society.",
              "id": 109,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 17,
              "content": "She thinks her son's the fragile one. Talking to him would just \"shut him down.\"",
              "id": 110,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "\"Traditional lunch\" worries me.",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 369,
          "content": "Kids like OP’s are why I begged my mom to let me get hot lunch at school instead of packing one.",
          "id": 112,
          "comments": [
            {
              "score": 118,
              "content": "My kid has several food allergies so had to bring their own food that was sometimes a bit weird, but they liked it, and around that age they suddenly would bring the food back home because of reasons ( not hungry, no time etc). Turned out some kids were bullying her about it and she was too embarrassed to unpack the food to eat it.",
              "id": 113,
              "comments": [
                {
                  "score": 41,
                  "content": "I remember once in junior high, I brought leftover Chinese food, and some kids said it was “gross” and that the Shanghai noodles looked like worms. I told them they were missing out but it made me a bit insecure and I’m not Chinese. I can’t imagine how it would feel for a young child eating food from her culture. There is no “weird food” just food you have never had before.",
                  "id": 114,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Literally same. And it happened at a young, young age as well. 7 is roughly 2nd grade and these behaviors are largely learned at home and brought to school where they spread amongst other kids. It's like one day you're having a great time with everyone playing kickball at recess, then the next you're ostracized because little Timmy called your food weird and now nobody wants to be with the weird kid.\n\nOP, YTA in a massive, massive way and you're well on your way to raising a bully with racist tendencies. Though it seems like your child is learning that from you, based on your interaction with the mom who reached out to resolve this as adults ought to do.",
              "id": 115,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 351,
          "content": "Exactly. I'm Lebanese and took lebanese food with me to school. My Herb sandwiches were named \"Dead Ants\" snatched out of my hands and rubbed in the dirt and I would go the day with no food because of racist little shits whose parents never taught them otherwise. This was way back in the early 80s and went throughout my entire primary schooling. (Aussie here). This mother is disgusting and needs to teach her son proper manners. Her take on it is to raise a bullying racist who will, one day, raise the stakes. **YTA**",
          "id": 116,
          "comments": [
            {
              "score": 19,
              "content": "I apologize to you for what those horrible people did, who would never think they were doing anything wrong. It must have hurt a lot as a kid.",
              "id": 117,
              "comments": [
                {
                  "score": 28,
                  "content": "Thank you. It did. A lot. I didn't have the safest or best home life either, so my childhood was pretty much hell. Yet now, so many of my old classmates are friends with me on Facebook and actually love Leb food. I was the only Leb kid in school, so an easy target. I just hope my story will open OPs eyes up and show her that these things stick with kids right through to adulthood. I'm 44 now and it can still be upsetting.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 345,
          "content": "Absolutely this. OP could do with googling “micro aggressions racism” and paying close attention to the results. \n\nAssuming they’re open to learning they then ought to apologise to this parent for their initial reaction, explain that they’ve done further research and will be talking to their son about understanding how words can hurt others and about respecting those from other cultures and backgrounds to ourselves. \n\nI imagine it would have taken a lot for the mum to reach out to OP. I’m thinking there must have been multiple interactions where her son made comments which upset this poor girl and had a profound enough impact that she was still thinking about it and hurt enough to mention it hours later. After this happening multiple times, the girls mum finally decides she’s going to have to handle it by messaging OP who….totally shuts it down, implies her daughter has self esteem and confidence issues and takes zero responsibility for the fact she’s raised her son to be intolerant of others. \n\nOooft. YTA. 100%",
          "id": 119,
          "comments": [
            {
              "score": 19,
              "content": "Completely agree. It is so scary to me how many people struggle SO hard to put the shoe on the other foot. Like what if someone treated their kid similarly?? First of all the kid prob wouldn’t even speak up if that’s how the mother feels about a child being upset by what someone has said to them. But if they did would the mom tell the kid to “buck up” or would they go polar opposite and FLIP tf out on the other parent? Both are bad, both are likely imo.",
              "id": 120,
              "comments": [
                {
                  "score": 8,
                  "content": "Totally. If the other girl had called OP's son's food \"weird\", I bet her reaction would have been VERY different.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Maybe someone can send OP some articles.\n\nEdited for clarity",
              "id": 122,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 27,
          "content": "Different but similar: \n\nWhen I was 11, another girl I was friends with came over and told me that a boy in our class was gay. This was 2000, I was very sheltered, and didn't know what gay actually meant, but I could tell from the way the word was used that it wasn't a desirable quality. She saw him and said something mean, and I did too- not because he was gay, but because he had been my \"boyfriend\" the year before, and he had dumped me out of nowhere. (I realize, now, that it had to do with his orientation, and that while I was hurt and felt rejected, we were both 11 years old and neither of us had the emotional capacity to deal with it like adults). \n\nI joined in and I deeply regret that now- especially as I had my own struggle with my orientation a bit later. (I'm bi). \n\nAgain, I really need to stress that yes, I bullied him and called him gay, but I really didn't know what it meant. But that doesn't matter, because the target of my bullying *thought* that I was attacking him based on that. So while I didn't fully understand what I was saying, the impact was the same. I will never stop feeling badly for how I hurt that boy, when he was probably just figuring out who he was. \n\nThe next day, his mom came to my dad's store he owned, and told him what happened, and asked him to deal with it. \n\nMy father was pretty progressive, considering the time period he was born into, and his religious beliefs, but he didn't support gay marriage at that time, believed it was a sin, but still had gay friends that he supported as friends and fellow humans. He never said a derogatory word to them about their sexuality, and certainly never used a slur. \n\nBut he was *furious* with me. I was grounded for a month, had to sit down and write an apology to the boy, and lectured endlessly about not being a mean little jerk. I wasn't allowed to go on a field trip that had been planned- the school hadn't barred me from going, but dad did. \n\nI never, ever picked on another kid like that again- because my dad, even if he had his own private feelings about homosexuality at the time, knew what was right, what was wrong, and taught it to me. \n\nThat's what good parents do. They teach their children to be better than them. \n\nEnd note: My dad did eventually come around, and became more accepting. I became an ordained minister in 2015 to perform a same sex marriage when their church wouldn't do it, and dad supported my choice to do so, and said he was proud of me for doing something I believed in.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Thank you for saying this so blatantly! OP YTA",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "I really, really hope that mom goes to the principal so that OP can get called on the carpet. Her kid is not just insensitive, he’s both a bully and a racist one at that. There isn’t time to dally around with this one.",
          "id": 125,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17001,
      "content": "YTA. \n\nTeach your son better words to use. \"That looks different. What is it?\" or \"Your lunch is interesting. What is it called?\" There is a fine line between being curious and being rude. Teach him not to be rude. Teach him not to use words like weird when looking at someone's food.",
      "id": 126,
      "comments": [
        {
          "score": 4803,
          "content": "[removed]",
          "id": 127,
          "comments": [
            {
              "score": 1297,
              "content": "The kid is 7 so I don't blame him for using the word weird. Kids that age only have the vocabulary they have and they have to be taught to use better words or phrases. I am actually surprised the teacher or lunch monitor hasn't worked on this with him. I am in education and spend a lot of my time teaching kids better words or better ways to handle situations. \n\nThe OP was definitely condescending to the other mom. She shouldn't have sent articles on parenting when she refuses to work with her own child.",
              "id": 128,
              "comments": [
                {
                  "score": 482,
                  "content": "My kids go to a diverse school with many international students, weird is not a word that kids use.  What is that? If a child has been taught to be polite weird is only for something they consider gross or very strange.  As a teacher, I would say the child is old enough to know they were being mean.\n\nEDIT: The kids use the word weird in my kids schools but it is considered something gross--feeling slime for the first time. It is universal know as something gross",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 93,
                  "content": "If the kid is anything like some of the kids at my school, the lunch monitors probably do try to redirect him to use more friendly vocabulary, but the lessons don't stick because there's no follow-up at home.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Thank you for doing this! \nMy kid has several food allergies so had to bring their own food that was sometimes a bit weird, but she liked it, and around that age she suddenly would bring the food back home because of reasons ( not hungry, no time etc). Turned out some kids were bullying her about it and she was too embarrassed to unpack the food to eat it.\nThe school didn't notice.",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Yeah. OP is a patronizing AH",
              "id": 132,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "That's where I was stunned. So your kid acted kinda rude and you sent the offended party parenting articles?? The audacity",
              "id": 133,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 345,
          "content": "For real, since my kids were 2 we've taught them to not \"yuk\" someone else's \"yum.\" And the people eat and like different things.",
          "id": 134,
          "comments": [
            {
              "score": 20,
              "content": "And 7 is definitely not too young to learn that they don’t have to let out every comment that pops into their brain",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "In my experience, if a 7yo is talking about something hours after the event, it's because it made a big impression, good or bad. The line between curious and rude also tends to be bigger than an adult's. That makes me think his 'innocent questions' were either *very* rude or he was just being a bully. Either way, the girl was still upset enough to tell her mother when she got home.\n\n\nI'm betting it wasn't just 'That's weird.' It was probably more along the lines of 'Ew! That looks/smells weird! Gross!'",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14481,
      "content": "YTA, you’re racist and you’re raising a racist asshole.",
      "id": 137,
      "comments": [
        {
          "score": 1144,
          "content": "It's like you're reading my mind",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 733,
          "content": "Someone needs to send her some parenting articles!",
          "id": 139,
          "comments": [
            {
              "score": 37,
              "content": "I would lose my mind if some AH mom did that shit to me. I think that’s the most upsetting part of the post. 😑",
              "id": 140,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 321,
          "content": "This should be the top comment.",
          "id": 141,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 32,
          "content": "And that is why OP doesn't care.",
          "id": 142,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "can't believe I had to scroll this far for someone to point out the obvious dogwhistles",
          "id": 143,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9507,
      "content": "[deleted]",
      "id": 144,
      "comments": [
        {
          "score": 2450,
          "content": "I have a 7 year old, and even she can tell you it's rude to yuck someone else's yum, because my husband and I parent our kid and teach her basic manners.",
          "id": 145,
          "comments": [
            {
              "score": 737,
              "content": "I really like age appropriate “rude to yuck someone else’s yum”",
              "id": 146,
              "comments": [
                {
                  "score": 49,
                  "content": "That's the rule in our house, and my 4 and 5 year olds get it. They even use it on us when we slip, and we thank them for correcting us. This parent needs to get their priorities in order.",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 305,
              "content": "I teach first grade and I am going to add your “don’t yuck someone else’s yum” line into my vocabulary forever! Thank you! Great line.",
              "id": 148,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 20,
          "content": "As a teacher who has sent home many a note describing a moment in class that was used as a learning experience and how the parent needed to be aware and continue the conversation at home (not punish your child, but reinforce what we discussed as a basic way to treat humans/etc), a lot more parents than you would believe think their kids need to be punished if they're asked to talk to their children. It's sad. And a lot get defensive. \n\nMy favorite was when a parent asked to speak to me and I was called to the office, out of my class, and the parent started screaming at me in front of staff and classes walking by, how I was a racist and singled out her kid and said he was looking up girls skirts. Ma'am, your six year old son may be black and I may be white, but in a class of twenty five children, three of them are not black. But all the girls told me he was literally laying on the floor to look up their skirts and I saw it with my own eyes, and we calmly discussed and talked about it, and I NEED YOU TO DO YOUR JOB AS A PARENT TO REINFORCE THIS SO YOUR SON DOESNT GROW UP WITH SEXUAL ASSAULT CHARGES ONE DAY. But nope, I was a racist. \n\nSo when her kid was sent to time out later in the year and refused to sit correctly in the chair and wound up falling forward and smashing his nose onto the tile and bleeding all over, I relayed all the info to the nurse and had her talk to mom, because there was no way in hell I was going to. \n\nSeriously, over all the things to get upset about, that's the hill that parent (and op) chose to die on. Like. It is SO easy to have those conversations with children. I know, because I have them with kids as a teacher! We've already done half of the work, you just need to follow up at home. \n\nBut many parents would rather pretend there's no way their kid can do wrong.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Yeah, I'm really wondering what the hell is going on there.  No one said punish the kid, they said to talk to him. 🧐",
          "id": 150,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "This is what actually worries me the most. This notion of basic parenting being a punishment.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 9078,
      "content": "YTA. Your title is misleading. She didn't ask for punishment. She asked you to talk to him and explain how his comments can hurt other people. He is at an age were he exactly needs to learn that. You should help him reflect on the impact of his behavior. That is called parenting, not punishment.",
      "id": 152,
      "comments": [
        {
          "score": 732,
          "content": "[deleted]",
          "id": 153,
          "comments": [
            {
              "score": 105,
              "content": "It's so weird when parents try to be friends with their kids in the same way they would be with other adults when those kids are still KIDS. Like, you can't make real friends? You gotta try it out with the captive audience you made in your vagina?",
              "id": 154,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 25,
              "content": "Respectfully I don’t think that’s the case. It’s probably that she’s racist and sees nothing wrong with raising a racist.",
              "id": 155,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 197,
          "content": "Maybe having to do some actual parenting feels like punishment to OP? YTA, OP.",
          "id": 156,
          "comments": [
            {
              "score": 23,
              "content": "Maybe OP doesn’t know what parenting means?",
              "id": 157,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Do you have any articles you can send to OP so she knows how to raise her child?",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "her kid harasses other students because he doesn’t have the emotional sensitivity of an adult = normal, good, encouraged\n\nother kid feeling insecure about said harassment because she don’t have the emotional sensitivity of an adult = not normal, bad, needs to grow up",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5407,
      "content": "YTA. IT’S NOT INNOCUOUS. Your son is starting to bully others. Nip this shit in the bud now.",
      "id": 160,
      "comments": [
        {
          "score": 1271,
          "content": "Fr... Racism isn't innocuous",
          "id": 161,
          "comments": [
            {
              "score": 306,
              "content": "It’s also very telling that OP wrote that and her thought was about how this kid is insecure instead of realizing that the kid is starting to feel alienated and different because of her child’s comment",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 506,
          "content": "Yeah but where do you think the kid is learning it from? OP is low key bullying the other parent in response to being asked to have a teaching moment. This is probably how the son has been taught to respond to the world.  OP sounds like the \"I'm not rude you just can't handle me keeping it real\" type. OP YTA and you're screwing up the next generation.",
          "id": 163,
          "comments": [
            {
              "score": 19,
              "content": "My mum is one of these. She'd just insert a negative opinion regardless of whether anyone had wanted to consult her or not over something. \"I'm just being honest.\" \"Isn't it better that I let you know?\" \"You should be happy that someone told you so you wouldn't feel embarrassed or bad\"\n\nI got all dressed up once only to be told not to wear strapless dresses or dresses with spaghetti straps because it highlighted how broad my shoulders were and that they didn't compliment them at all. I was feeling good in my chosen outfit and makeup up and that made me feel crud and insecure.\n\nI would sing and she would just tell me it sounded awful and \"it's okay here but it doesn't sound good at all, probably don't sing in front of others as you're way out and it just sounds dreadful\"\n\nWhich then became \"why are you doing that?\" -insert criticism or negative opinion.\n\nWhich then became \"why are you doing that?\" -> \"because I want to and blah blah blah ugh leave it alone\" snapped in a stressed and harsh tone.\n\nWhich then became \"my god I'm just trying to help you or give you advice Jesus no need for you to be so rude, you're so sensitive 🙄🙄🙄\"\n\n\n\nThere's a time and place for honesty. When asked an opinion and you feel negative in response you gently tell the person that you (personally) prefer X. Or something else gentle. No need to be blunt and just insert yourself when not asked.\n\nHer opinion on that is \"I'm letting you know what I think, I want to let you know so you don't go out like that etc etc I need to be able to be honest\"\n\nAlso if you can't change it or do anything about it for quite a while then it shouldn't be criticised. Telling me my makeup looks poorly done that day after spending all morning with me and then letting me know when we are in the shopping centre is awful.\n\nI see OP as exactly this, I see her son resulting in either a carbon copy of it to pass to his own next generation or an extremely anxious child who feels entitled but constantly afraid of criticism towards himself- even when he asks for opinions.\n\nOP do better yikes. He can be spoken to about how he could better approach the little girl (or others) if he finds something unusual. Massively beautiful learning moment could be had here.\n\n \"Hey 7y/o, I've been let know that you've been talking about ____ girls lunches, may I ask why you've been saying what you have?\" -establish his grounds for the communication to begin with, perhaps he was genuinely hoping to learn more about it and approached it wrong. That way you could advise him on a way to ask without referring to her food as weird and explain to him that other people calling someone's food odd can make them not enjoy their food as much.\n\nIf he was feeling grossed or icked by her food you could explain that other people have different preferences and she likely feels similar to some of his foods. The difference being is that he needs to think these thoughts and not voice them, perhaps even give the foods a go if he hasn't so that he knows whether they actually aren't pleasant to him or not. Then lastly whether he tries them and likes them or tries them and they make him dry-heave he should not show disgust or criticism to others for enjoying it as doing so is off-putting and makes it difficult for them to enjoy it.\n\nI always got told \"don't say yuck, you can think it or not but don't say it because it's off-putting and I still want to enjoy my dinner and if you're not eating it anyway then it doesn't matter.\"\n\nSo yes OP, YTA. The girls mother was just hoping that your kid would stop upsetting her daughters eating and that was entirely valid. I also got the sense that he didn't only do it once. This needs to be addressed by you. Her mother did not need to be sent that parenting article, she was not an issue here as her child was entirely appropriate with how she felt.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "Lol but she responded by bullying the mother. Shocked",
          "id": 165,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5174,
      "content": "YTA. Calling someone's food \"weird\" is not making a curious, innocuous comment. It is bullying. You should be ashamed.",
      "id": 166,
      "comments": [
        {
          "score": 462,
          "content": "Yeah…. Try “I’ve never seen that before! Can you tell me about it?” “That looks so cool, what is it?”",
          "id": 167,
          "comments": [
            {
              "score": 35,
              "content": "OP is deluded to think that \"weird\" is equivalent to \"relatively innocuous and curious comments\".\n\n\"Who made it?\" \"What's in it?\" \"Does it taste good?\" are all innocuous and curious comments. Maybe \"Where's that from?\" depending on tone for a seven year old.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 349,
          "content": "Fucking THANK YOU! Curious is “What is that? I’ve never seen that before! Is it meat? Are there veggies? Do you like it?” This mom is deluded.",
          "id": 169,
          "comments": [
            {
              "score": 12,
              "content": "Not deluded in the least, just an asshole.",
              "id": 170,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I am in my mid 30s and I legit have trauma from being in elementary school and my classmates making fun of the lunch my parents packed for me. This is real. You need to teach your kid to be more inclusive and respect other cultures. If he tries it and doesn’t like it, that’s fine he can learn to use the appropriate words to express that he doesn’t like it without making other people feel bad (ie saying “I don’t like how it tastes or feels” vs “that’s weird/gross”)",
          "id": 171,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4919,
      "content": "YTA \n\nShe didn’t ask you to punish your son, she asked you to have a conversation with him. He’s not asking her questions out of curiosity. He’s calling another child’s cultural food “weird” making her uncomfortable, and unintentionally highlighting her as a cultural “other”. If you want to encourage his curiosity, then take it on yourself to teach him how people eat all kinds of different foods all over the world, and that so many people eat food everyday that he may have never heard of before. Take him to restaurants where he can be exposed to new kinds of foods. But don’t enable him to continuously bother another child. \n\nIt was incredibly condescending of you to send parenting articles to another parent. She made a polite request of you, and you implied she doesn’t know how to parent. That was out of line and you should apologize.",
      "id": 172,
      "comments": [
        {
          "score": 691,
          "content": "Fat chance OP will apologize. They made this post looking for people to support their crappy parenting. They're not going to learn from this.",
          "id": 173,
          "comments": [
            {
              "score": 57,
              "content": "12+ hours without a peep from OP. Definitely looking for an echo chamber and bolted when they didn't get it.",
              "id": 174,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "I suspect you're right, poor kid :(\n\nEdit: suspect you're right, hope you're wrong.",
              "id": 175,
              "comments": [
                {
                  "score": 18,
                  "content": "I feel sorry for OPs son too.\n\nHe is either gonna have to get his parenting/lessons elsewhere (because his mum refuses to actually parent him)\n\nOr he is gonna grow up into a jerk.",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "At least the search for affirmation is not going well.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 290,
          "content": "😬 me the whole time reading this",
          "id": 178,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Obviously OP is the AH, and this is totally not the point, but as a massive food fan and greedy guts myself, I feel sorry for all that her kid is going to miss out on if he's taught that everything outside his culture is \"weird\". I was raised in the UK in the 70's and early 80's, when the restaurant scene wasn't exactly diverse or vibrant. But my parents lived in Singapore for a few years after they were married, and then we all lived in the States for 3 while I was a kid. My parents had a rule that you had to at least try food before you said you didn't like it. Age 8, curry was my and my sister's favourite food. Chilli was a close second. Trying new food is one of my favourite parts of travelling. This kid's mum is teaching him to be a racist AH, but also to shut himself in a box away from any unfamiliar experiences. And there's so much out there to discover and enjoy. (And eat.)",
          "id": 179,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2684,
      "content": "YTA, if you do not teach your son now about respecting different cultures this will become a bigger issue in the future. This “relatively innocuous and curious comment” is a good teaching moment. His classmate’s food is not “weird” it is completely normal in her home and in many other homes that share her culture. \n\n**Her daughter does not need lessons on confidence, your son needs lesson on cultural differences. Parent your child!**",
      "id": 180,
      "comments": [
        {
          "score": 575,
          "content": "How strange that OP thinks this is the other moms problem. “Lol raise your kid to be less sensitive I guess 💅” like no babe, this mom is dealing with a kid who’s feeling ‘othered’ right now. Her kid isn’t insecure, your son made her feel out of place in the world. Huge fuckin difference.",
          "id": 181,
          "comments": [
            {
              "score": 209,
              "content": "Exactly! Calling a 7 year old child ‘insecure’ because she’s being bullied is disgusting. That’s the shit that MAKES you insecure later in life ffs!",
              "id": 182,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I assume this kid is probably a lot less sensitive than OP's kid who can't even be spoken to about his language.",
              "id": 183,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "OP's a racist and her son will follow. $2 says his name is Kyler, Kaeden, Jayson or Hudson.",
              "id": 184,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "If I could upvote this one more I would or if I had an award you’d get it",
          "id": 185,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}