{
  "post content": "This happened a few months ago, but has been bothering me since, wondering if I was inadvertently the asshole. \n\nNo throwaway because it's not necessary. \n\nI work in a 911 PSAP, we're a tight-knit group that works together every shift and we get along really well. That being said, there are a couple of girls I don't know really well (aka, their food preferences) and they are not overt about it. \n\nOver the last few times we've had food nights together, I've gathered that they are vegetarians. \n\nA couple of months ago, (not a scheduled food night) I was feeling like Popeye's Fried Chicken. My hubby was going to be passing by a Popeyes and my HQ and I had mentioned that I was craving Popeye's. \n\nMy saint of a husband offered to pick it up for me and drop it off at work. I sent a message around the room informing everyone of my awesome husband and his offer and I made sure he picked up enough chicken for anyone interested... my treat. \n\nI received a message back from one of the girls who is vegetarian saying basically \"Thanks for the offer... but vegetarian.. You know...\". I don't think she was trying to be an a**hole at all. But that made me rethink my decision to offer chicken to the whole room.\n\nShould I have kept my mouth shut unless there were vegetarian options on offer?\n\nAITA?\n\n(On mobile, in case formatting sucks)\n\nEDIT: As someone who has participated in this sub for a while, it's pretty eye-opening, that something that I thought was black and white (I *FULLY* expected to be the asshole) was not even close. \n\nI can honestly say I have a different outlook on differing points of view here now.",
  "id": 1,
  "comments": [
    {
      "score": 24,
      "content": "NAH you're free to eat whatever you want. If you eat meat and your husband is bringing some due to your craving then that's simply that: your craving being fulfilled. Their lifestyle isnt yours to cater to.\n\nEdit: I'm not saying they're an asshole for that either.",
      "id": 2,
      "comments": [
        {
          "score": 6,
          "content": "No, I don't think for a second she was being rude about it.  \n\nIt just made me go \"Ohhhh....  :(  I should have thought about that before I opened my mouth.\"\n\n Thank you.",
          "id": 3,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 17,
      "content": "Nah I mean you offer chicken, she said no thanks.  You don’t buy her chicken. Everyone should be happy not assholes here.",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "NAH. A, it wasn’t a work event where you needed to serve everyone, just a generous option. B. Popeyes has veggie food! Lady missed out on some badass biscuits.",
      "id": 5,
      "comments": [
        {
          "score": 6,
          "content": "Thank you, yes. I am a vegetarian and I was reading this like “wtf get some sides, ladies.”",
          "id": 6,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I guess that's where part of my concern arises from. I'm not vegetarian, I have *no idea* what menu items are ok and what one aren't.  I ordered biscuits (of course!!), fries and mac and cheese, but I don't know the ingredients of those and know if they're truly vegetarian or not.",
          "id": 7,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "NAH - quite the opposite! You offered up a yummy treat for others to take part in if they so chose.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 10,
      "content": "NAH, you're not obligated to accommodate everyone when it's not the official food night, and you were nice enough to put the offer out just in case, and it doesn't sound like the other girl was too bent out of shape about it, just giving a reason why she wasn't interested.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NAH. I think her message was letting you know she appreciated your offer to treat her as you were treating the others. Don’t read into her message.",
      "id": 10,
      "comments": [
        {
          "score": 1,
          "content": "I didn't. I didn't think she was being rude at all. It just pointed out to me that I probably should have been more considerate (whether she intended that or not) so I was wondering IATA?",
          "id": 11,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NAH. I’m a vegetarian, and I feel like when I say “can’t really have that I’m a vegetarian” it’s a) a joke, or b) a reminder because people genuinely forget a lot. Seems like that was the case for her.",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NAH. It's not like this was a formal team dinner or something - you had a hankering for chicken and offered to get some for other people.",
      "id": 13,
      "comments": [
        {
          "score": 1,
          "content": "That is an accurate way to phrase it, thank you!",
          "id": 14,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NAH - If any of the vegetarians complained, they’d be the ass, but it doesn’t sound like that happened",
      "id": 15,
      "comments": [
        {
          "score": 1,
          "content": "No, it didn't. I tried to be clear about that. But at the same time it felt like it was a \"Hey, maybe I should have thought this through.\" Because, honestly, they know I'm not an asshole *at all*.  So maybe they were a bit disappointed in me for not being inclusive?",
          "id": 16,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NAH. nobody was obligated to take you up on your offer of chicken, and you weren't obligated to provide food for everyone. I guess you could've offered to get biscuits and corn and a few other veggie sides too, but it wasn't strictly necessary.\n\nI'm muslim and don't eat pork. if someone brings in pepperoni pizza, I can't eat it. obviously if there was an agreement that someone was bringing in food for all of us, that's a dick move. but if someone just happened to have more food than they needed and was offering to share it around, that's fine, because it's not like I was guaranteed food to begin with. I just remind them that I can't eat pepperoni and we all move on. (I do have some friends who won't order pig meats around me, but they're *close* friends - it doesn't sound like these are particularly good friends of yours.)",
      "id": 17,
      "comments": [
        {
          "score": 1,
          "content": "Thank you, this is a very relevant insight!",
          "id": 18,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}