{
  "post content": "AITA: \n\nOk to start of I 36f and him 37m met while working together.. we became really great friends while working and then feeling started to emerge. We decided to start dating.. I come from a relationship with 3 kids 16f 14m 7f and he has a son 7m.. \n\nWe started dating and i slowly introduced him to my babies because I’m extremely protective of my children.. well everything was going great and then one day he told me that if we were going to be together for a long time I need to let him be a part of our family. I said ok that’s fine but decisions about the kids isn’t his place that’s between me and their father. I don’t think that was wrong but he then got angry and told me if we are going to be married then he has a say so with my kids and I looked at him and laughed and told him ummm nooo I don’t tell you what to do with your child because thats your child ( which by this point still haven’t met) \n\nWe’ll have have been together for 3 years now and he still thinks he has more of a say so with my children. I tell him to stay in his lane because he isn’t the father nor the mother and he can’t tell me how to raise my children when he has nothing to do with his own child. He says I pay child support that’s enough. I agin tell him that there’s more then then just throwing money at a child to say I’m a parent that’s not how that works and if he wants to be a dad then go be a daddy to your own child and leave mine alone.( he tells me how I need to punish my children and when we can go do things together) and I of course don’t listen because why the fuck would I. Yes I do leave him out of a lot of outings because he complains that I ignore him and focus on them more then anything. I tell him to suck it up because he’s a grown man and I don’t need to mother him… but every time we get into an argument about kids I throw his in his face and tell him don’t parent mine or try when you don’t try with yours am I the asshole for this?\n\nI am solely responsible for my children. I pay for everything for them once he paid for a craft for my oldest and he throws in my face that he paid for something. I pay for everything insurance for our cars and food and rent.. and when I ask for help he tells me no I need money for other things..\n\nHe doesn’t see his child because he doesn’t like his baby momma. He wants to wait until he’s old enough to come live with us so he doesn’t have to deal with her.. I have offered to pay for an attorney so we can get split custody and see him but he turns it down.. I have tried honestly to get him to see his child but he tells me no I can wait..,",
  "id": 1,
  "comments": [
    {
      "score": 47,
      "content": "This is bizarre. You don't sound like you even like the man. You haven't met his son in three years, yet you're engaged? ESH. This doesn't sound like a healthy relationship.\n\nETA - \n\n> I constantly throw his son in his face\n\nthis is really appalling.",
      "id": 2,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 24,
      "content": "ESH \n\nThis doesn’t sound like a healthy relationship at all",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 15,
      "content": "YWBTA if you don't give this man the heave-ho.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 11,
      "content": "NTA but why have you wasted 3 years of your life on a man that has no interest in parenting his own child but demands to have a say with yours? Dump him. You and your children deserve better.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "You are a mother who obviously loves her kids. Why are you with a man who can't be bothered to see his 7 month old child? Do you see this ending well?",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "NTA.\n\nI'm seeing an Ocean of Marinara here. He's got no relationship with his son, yet he expects to magically have one when the kid's older. He's on a road to major disappointment there. \n\nYou are right to say he's not a parent to your kids. The fact he's trying to be shows he doesn't recognize boundaries or he just thinks they don't  apply to him.\n\nYou need to seriously evaluate your relationship.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "ESH\n\nNeither one of you sound like you like or even respect the other at all. Why are you even dating, much less engaged? You speak to each other with complete disdain. Honestly, it seems like you deserve each other, and none of your children deserve either of you.",
      "id": 8,
      "comments": [
        {
          "score": -8,
          "content": "Sorry you feel that..",
          "id": 9,
          "comments": [
            {
              "score": 2,
              "content": "That is not an apology. Stop. That's why you're failing in your relationship now",
              "id": 10,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7,
      "content": "Why are you still in a relationship with him? He sounds like a nightmare.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "why do you want to be with this person?\n\nHe doesn't respect your very reasonable boundaries.\n\nHe sounds like he wants all the control in a relationship, which is a red flag.\n\nHis child is 7 yr old.  But he won't spend time with his child.  Thats is another red flag.\n\nNTA but rethink why you even want to be with him.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "YTA. if you are not ready to share your life with someone, don't share your life with someone.\n\nIf you live with this man and marry this man, you are a family. There is no \"my child/your child\" anymore. If you don't want that, then don't get married and stay single, or have flings/non serious relationships.",
      "id": 13,
      "comments": [
        {
          "score": 12,
          "content": "Step parents still have to stay in their lane, especially when the other parent is still involved in their children's lives. Until there is a set agreed upon thing between the both bio parents and step parents.",
          "id": 14,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Like, I respect there is a difference between being a bio parent and step parent. \n\nTo assume that a step parent who lives with kids for whatever % and is 100% ignored about anything that involves the kids doesn't sound healthy at all.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}