{
  "post content": "I spend a large amount of time in a wheelchair. I can walk but stresses my body and leads to pain.\n\nFriends and myself like to go out drinking on the weekends. Clubs, pubs etc. Friends suggest to go to new popular club, I'll say sure. Roll up there and find that it has step or stairs. It's gotten to the point where I'm saying to them that I'll only agree to clubs that are easily accessible to me. If people suggest a place I told them that if it's not accessible then they have to figure out a way for me to get in. This has caused massive friction with the guys and girls I'm going out with. I get it, the nicer/cooler/whatever places give them a better chance of hooking up. I really do want to experience some of those places myself but there's a barrier of entry.\n\nMost of the time nobody wants to carry my chair into a club and bouncers often don't want to touch me because of liability reasons. So we go somewhere else, these are mostly places that are empty of with people but not our other extended friends. I can tell my friends are getting frustrated with me and often I get told the places I choose suck. This is true, most of the places I choose are shitholes, but shitholes I can enter and drink in.\n\nOh you say, why not call ahead to find out. Well, I try that and most places believe they accessible but forget to mention only entry/exit is steps/stairs and no disabled restrooms. Basically I'm getting false information out of ignorance rather than meanness. It's happened where I've gone to a place rolled in the entry area, paid cover charge and then been confronted with stairs/steps so I can't even buy a drink and chill in a foyer.\n\nI know it's entitled of me, but when we all go out drinking, I take the approach of we all have to be able to enter and have fun or no one does.",
  "id": 1,
  "comments": [
    {
      "score": 36,
      "content": "ESH - Shitty move for them to suggest places where you can't go, also shitty to try to 'force' them\n\nSeems to me the answer is rather than trying to force them to do anything, just say if it's a non accessible place, you can't go. If they then end up regularly going without you, they are probably shitty friends.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 14,
      "content": "Nah\n\nPerfectly reasonable to want to do things with your friends.\n\nAlso perfectly reasonable for them to want to enjoy other places once in a while. Its super cool that they're so accommodating in the first place.",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 14,
      "content": "NTA\n\nIf anything, your friends are the assholes. They know that you use a wheelchair, yet they continue to invite you to places that are inaccessible? \n\nIf they really want to go to those places, they can go without you either before they meet up with you, after, or on a night you can't make it out (not everyone has to go out together at all times which is clear by the fact that not a lot of people go to the accessible places)",
      "id": 4,
      "comments": [
        {
          "score": 2,
          "content": "This doesn't sound like a great solution either. Your suggesting that OPs friends just go out without OP - ie stop inviting hanging out with them?",
          "id": 5,
          "comments": [
            {
              "score": 9,
              "content": "No. My suggestion is that they still hang out with OP but stop inviting OP to inaccessible places. If they want to go to inaccessible places, they can do so, but they shouldn't invite OP and put OP in the position of having to veto it.",
              "id": 6,
              "comments": [
                {
                  "score": 1,
                  "content": "Yeah... sounds like that you want to the friends to stop inviting him to their outings.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Ffs. Do you hang out/invite every single friend to hang out with you every time? I doubt it.",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "NTA I can't believe people are calling you an asshole and selfish and entitled when you are a disabled person who simply wants accessable spaces. Fuck them and fuck your asshole friends for not helping you.",
      "id": 9,
      "comments": [
        {
          "score": -3,
          "content": ">when you are a disabled person who simply wants accessable spaces. \n\nThat's not why.",
          "id": 10,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 9,
      "content": "NTA, it’s not entitled at all. If they want to go out with you, they *have* to either go places you can access without assistance or do whatever necessary to help you enter inaccessible places. It’s seriously shitty of them to say they don’t want to help you up stairs and then.... put the blame on you when y’all have to go somewhere without stairs? \n\nYou need better friends tbh.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "ESH if you and your friends plan ahead together you wont have this problem, but if it's more of you pushing yourself in on their plans without them inviting you then you are ruining it for everyone else.\n\nI get its allot harder for you to be able to go to  clubs, but if you can barely walk up the stairs maybe you should stop going to clubs, because if you can't walk you can't dance so a club will essentially just be a bar for you anyway,",
      "id": 12,
      "comments": [
        {
          "score": 5,
          "content": "They said they have tried calling and planned ahead but often got incorrect information. Which does happen frequently I can tell you, places often forget to take all requirements in consideration and think they done enough. \nAnd if they cannot dance in a club, they can still enjoy their friends company, maybe that's enough.",
          "id": 13,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "ONLY GO YTA You want to go to spend time with them they want to go to hook up.  You should have separate outings from time to time.",
      "id": 14,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "YTA unless you don't get mad when your friends go out to places without you. You do realize you can't bar your friend group from going to places just because it's difficult for you personally... that means sometimes, you don't have to go.",
      "id": 15,
      "comments": [
        {
          "score": 6,
          "content": "I don't get mad if I'm not there. Why would I care about that? If I am there, then I want to be able to enter a place and not sit on the footpath like a stooge waiting for them to finish up.",
          "id": 16,
          "comments": [
            {
              "score": 9,
              "content": "Then how is there massive friction then? Something doesn’t seem to be adding up. They feel you’re imposing. Why is that? Also, you say you can walk. Can you walk long enough to get into the club and sit back down?\n\nNothing you’re describing sounds like a problem, yet there’s a problem. How often does the group have to switch up plans for you?",
              "id": 17,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "[deleted]",
      "id": 18,
      "comments": [
        {
          "score": 13,
          "content": "It says in the post their friends refuse to help them carry their chair.",
          "id": 19,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 2,
          "content": "Does anyone even bother reading the posts anymore?",
          "id": 20,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA. Can you guys compromise- sometimes go to clubs that you know for sure are accessible, and sometimes they go to clubs that aren't and you find something else to do that night? Maybe they could scope out places for you to see if they are for sure accessible?\n\nI'm sorry you're dealing with this, people's ignorance (the bar staff and your friends) is bullshit.",
      "id": 21,
      "comments": [],
      "relation": "Support"
    }
  ]
}