{
  "post content": "I (20M) am a college student. Recently, we had a group presentation to do, which our group has a whole really fucked up. One of our team members is this girl with whom I don’t really get along. We often get into disagreements and don’t quite enjoy each other’s presence.\n\nShe chose to personally attack and blame me specifically for our poor performance as a group. She went on saying “it’s all your fault that the presentation sucked, I am gonna email and tell them that you’re not a part of our group…” etc. I argued back and brought up my own argument in regard to how this was a fuck up from all of our side and what she did (literally stole an entire presentation from the internet for our pitch).\n\nThis was when she was clearly fuming, and retaliates with “is this how your dad yells at your mom?” out of the blue. Keep in mind that there’s no context to this at all, but I do know that her dad took off and left her family when she was a child. Neither did I yell at her, I merely just raised my voice to some extent. She randomly brought up my family into a personal argument, and I lost it at this point. I replied “Oh, so you’re gonna bring in my family into this argument? Go fuck yourself, you fucking bitch”\n\nNow she’s going around trash talking me and telling people that I called her a bitch (I don’t really care) but I would love to hear your thoughts on this. Am I the asshole for calling her a bitch?",
  "id": 1,
  "comments": [
    {
      "score": 21,
      "content": "ESH\n\nAre you sure you’re a college student?",
      "id": 2,
      "comments": [
        {
          "score": 9,
          "content": "THANK YOU!!!  I was thinking the same thing and wondering when they started letting 5yo's post here.\n\nESH",
          "id": 3,
          "comments": [],
          "relation": "No"
        },
        {
          "score": -7,
          "content": "Yeah I’m a college student",
          "id": 4,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "ESH -- she shouldn't have dragged your family into this, but you escalated the situation.",
      "id": 5,
      "comments": [
        {
          "score": 6,
          "content": "I'm sorry but insulting OP by accusing his dad of being abusive is far worse than what OP did.",
          "id": 6,
          "comments": [
            {
              "score": 1,
              "content": "I don't accept your premise.",
              "id": 7,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -8,
          "content": "Yeah I agree I went wrong but I really couldn’t stand it when she brought in my family, it’s like a trigger point for me. Not that I’m justifying my actions but I wouldn’t have reacted this way if she hasn’t insulted my family",
          "id": 8,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "ESH. You both need to mature quite a bit",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "I'd say ESH\n\nDon't use the b-slur as a man towards a woman, honestly its that easy.\n\nYou should have reported her comments to the Dean of Students, now you don't really have any ground to stand on.",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "ETA: ESH. I had originally gone to YTA, since name-calling is not okay even when provoked, and gender-based name-calling is abusive. But the group mate should not have blamed and made a personal attack on baseless assumptions.",
      "id": 11,
      "comments": [
        {
          "score": -4,
          "content": "Curious why you say YTA and not ESH - it’s fine that she brought in my family?",
          "id": 12,
          "comments": [
            {
              "score": 1,
              "content": "ESH, yes. I will edit my original response. She should not have blamed you for the failure of the whole project or made a personal attack on you.",
              "id": 13,
              "comments": [
                {
                  "score": 1,
                  "content": "Appreciate it, I realize my mistake",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "ESH Time to be adults.",
      "id": 15,
      "comments": [
        {
          "score": 0,
          "content": "What’s this got to being an adult? Adults use such language all the time",
          "id": 16,
          "comments": [
            {
              "score": 2,
              "content": "Mature people do not resort to this over a group project.",
              "id": 17,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "I'll say ESH\n\nThe whole group sucks for not working together and coming up with an original presentation. Copying one found online is plagiarism. Your school probably has some pretty severe penalties for plagiarism.\n\nYou and this girl got into an argument. Arguments happen. However, she was in the wrong to drag your family into the argument. Your comment should have stopped at \"Go fuck yourself\". There was no need for the rest.\n\nI suggest that you and this girl avoid each other like the plague.",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I called someone a bitch which some people may think makes me an asshole\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 19,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "YTA. \n\nYou didn’t do a good job on the presentation (you say no one did). She plagiarized it off the internet and you had no issue with this. You ‘only raised your voice a little’ (aka, you yelled at her). Yeah, she shouldn’t have insulted your parents, but why did you think it was OK to yell? And then you called her a gender slur. \n\nI think you all deserve to fail the class, TBH.",
      "id": 20,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "Esh. Didn't know calling someone a bitch was a gender based slur but I'm also not a woman and call everyone cunt. But you didn't have an issue with her plagiarism until she started blaming you and instead of handling it maturely you both threw tantrums and blame games. you guys don't like each other clearly, so just avoid her and distance yourself.",
      "id": 21,
      "comments": [],
      "relation": "No"
    }
  ]
}