{
  "post content": "\r  \nSo i recently proposed to my long-term girlfriend, and we are planning for a wedding in summer next year, everything is still very early stages. My fiance has expressed that she wants a child-free wedding, which I am all down for but I want to make one expectation, my son (15M), i had him from a previous relationship and we have evenly split custody of him.\r  \n\r  \nUntil now my fiance has gotten along great with him, we've had days out as a family, she's gone to see his games (he plays ice hockey) and she's even taken him out on fun days just the two of them.\r  \n\r  \nI brought up that I wanted to make an exception to the no kids rule for my son, she shot the idea down straight away and said that she didn't want anyone under 16 there as she doesn't want to feel like she or anyone else has to babysit on her special day.\r  \n\r  \nI told her that no one would have to babysit him, he’s 15 and she knows he's well-behaved and a generally quiet kid. She then changed her reasoning and asked why i wanted my old family and life on the day I was supposed to making a commitment to her and our new family, I told her while I will be making a commitment to her, my son will still very much be my son and my family.\r  \n\r  \nShe then equated it to wanting my ex at our wedding, which I do not and never asked. I told her that i don't care about the aesthetics of the wedding, and that she can pick everything else, the food, the aesthetic, the music, the dress, but all i want is my family at the wedding (my parents, my sisters and my son), that is my only ultimatum when it comes to our wedding.\r  \n\r  \nShe started calling me controlling by giving me an ultimatum and said I had initially agreed to a child-free wedding and now im “gaslighting” her. I said we can have a mainly child-free wedding, but with this one exception, an expectation that guests can't even complain about being unfair since the only child is the son of the groom.\r  \n\r  \nShe called me a dick and is now not talking to me, I really think this is a reasonable want, but maybe im not seeing something, so AITA?\r  \n",
  "id": 1,
  "comments": [
    {
      "score": 42639,
      "content": "Wow wow wow.  She doesn’t want *your own child* to come to your own wedding. And not a crying baby or a terrible two, but a *fifteen year old*, a kid that will be old enough to drive next year-when the wedding is???\n\nIf this goes on as she wants, do you think your kid won’t remember? \n\nYea, I’m sorry, bud, this is all kinds of evil stepmother red flags-the whole thing about you making a new commitment to *her* and her family, and equating having your son there to having your ex *wife* there! \n\nDude. Get out now while you just have to eat the non refundable deposits for the wedding. Save yourself and your kid a world of hurt. YWBTA if you marry this woman. \n\nedit to add, you have never had a fight like this before, because up to this point, she has been putting on a show. But now she is comfortable enough in the relationship to show you who she really is.",
      "id": 2,
      "comments": [
        {
          "score": 13151,
          "content": "Exactly. She will be the type to make him kick out his son once he turns 18. Or make him move back to his mother's when she gets pregnant. She is pushing him out already.",
          "id": 3,
          "comments": [
            {
              "score": 6227,
              "content": "She will certainly make sure the son doesn't receive the same access to and support from his dad that any new kids will.",
              "id": 4,
              "comments": [
                {
                  "score": 3582,
                  "content": "Son is going to be here in a year finding out if he's TA for going no contact with his dad.  Maybe less than a year.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2131,
                      "content": "That's why the answer here is so simple: a hard no worthy of cancelling everything.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1198,
                      "content": "[deleted]",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 316,
                      "content": "Or he will be posting asking if he was the ah for not inviting his son to his wedding and his son has gone no contact with him.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 13,
                      "content": "Lmao. My Dad did this to me and I’ve thought about asking if IWTAH after finally going no contact.  Thanks for saving me the effort. \n\n\nFinal straw was when I wasn’t “allowed” to see him after not calling him(or anyone) back while I was nearly dying of alcoholism and depression. \n\nNot because I had done something to him or his wife while drinking. But because something could have happened to him and I wouldn’t have known? How could I be so cruel?",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 695,
                  "content": "[removed]",
                  "id": 10,
                  "comments": [
                    {
                      "score": 649,
                      "content": "That's the thing though, it's such a petty and controlling demand that it brings it full circle to him being the AH again if he stays with this woman.\n\nIt's hard to know what's going on in her head for sure, but it sure seems like she's doing what she can to alienate his son, and if you willfully stay with someone like that as a parent... That makes you an AH in my book.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "Exactly...my cousin in Indiana had a child free wedding with 2 exceptions....her 3 yr old daughter and her 10yr old niece. And the niece was made an exception truly for me, bc I live out of state and the trip for the wedding was so short it would be my only chance to meet her....it's up the the bride and groom to decide who they want at their wedding. And a bride saying that having his SON at his wedding is \"holding on to his old life\" is a HUGE red flag that she does not view this child as family and will do everything possible to push him fully from his fathers life if he marries her.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Absolutely. I've been at plenty of kid-free weddings where the children of family members were allowed. To me, a kid-free wedding is just a polite way to say, \"we don't want random little kids at our wedding\"\n\nTo try and exclude OP's 15 year old(!) son under the guise of \"kid-free\" is one of the reddest flags that I've ever seen and OP would be an AH if he ignores this glaring issue",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Plus 99% of \"child-free\" weddings mean kids under the age of 12. I don't think I have ever been to or even heard of a wedding that enforced a 18+ age limit. Anyone in my large extended family that even attempted that would be told to go pound dirt by the aunts and uncles typically shelling out for it and if they insisted both be stuck paying for it themselves and never invited to anything ever again going forward.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 182,
                  "content": "And insist on him rewriting his will to only include his “real” family",
                  "id": 15,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Oh that is for sure on her checklist.  OP this is your wake up call to ditch this woman now.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Oh thats next!",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "People (generally) marry young enough that they aren't thinking about the end, but men generally die younger than women and this lady would 100% fight and cut the son out of the will if they get married.\n\nIf that's a concern, you cannot marry the woman. \n\nLuckily she showed this side early - some people fake it the whole marriage and then after the partner kicks it, slices all the step-kids out of the will with their increased access to paperwork so they can leave stuff to themselves or their bio kids only.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yeah I'm worried about this happening when my dad passes. It could honestly go either way with my stepmother.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "You are going to fight with her any time your child needs money, a car, college tuition, any help that she will feel takes away from her and any future kids.\nShe does’t truly love your child or she would want him there.\nI am sorry. You need to do some thinking about what you want for you and your child.",
                  "id": 20,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Yep. Happened to me and my siblings. My father is still alive but he just recently explained to me that when he dies his son with his 3rd wife is the only one he is leaving anything to because \"It wouldn't make sense for my wife to share with kids that aren't hers\" he and my step mother have been together since I was barely 2 years old BTW, it's not like they got together when us kids were already grown or anything. \n\nNow I don't care that I'm not getting any inheritance, it's something I've always kind of assumed he would leave me out of, but it's probably the closest he's come to openly admitting that we don't count as his kids since getting married. That's something I've felt in my core from my earliest memories but nobody would acknowledge it. Whenever we would visit his house it was made very clear that it wasn't our home too. We had to do whatever our younger brother wanted, we couldn't play with his toys but didn't have our own there either. Little brother literally didn't believe our Dad was our Dad too, I remember him very vocally denying it and would also tell us that our grandmother was only his, not ours. Dad paid for him to get a private education and take vacations overseas while not bothering to pay his owing child support to us, forgetting our birthdays and we grew up in poverty while he and his new family were comfortably upper middle class. I hold nothing against my little brother now, we're all grown adults and he's actually a really good dude, he didn't know any better when we were kids, why would be think we were siblings when he only saw us every few years and Dad obviously didn't talk about us ever?\n\nOP you are NTA but you're on a very slippery slope and need to be careful and think about your priorities here. It's not just about the wedding, this is an indicator about how life married to this woman will be if you go through with it.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "I have a friend who's at the tail end of this. Her father is terminally ill. The stepmother and kids are cruel to her every time she visits him, and taunt her that they are going to contest any will that has her in it. She just wants to spend time with her dying father.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1427,
              "content": "I would not be surprised if she’s already seeded things to the son like he’s in the way of his dad’s happiness, etc. OP should have a heart to heart with kiddo and see if he’s been holding back any information out of fear of rocking the boat.",
              "id": 23,
              "comments": [
                {
                  "score": 236,
                  "content": "Yes! This! That is a smart idea",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 224,
                  "content": "I agree. Kiddo might be seeing something Op is not.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 19,
                      "content": "Unfortunately blinded by love is real and it's time to ask the son what his feelings are about the whole situation.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 147,
                  "content": "And he’s on here asking questions. So I’m sure she’s gotten away with many instances of making his son feel like a nothing and OP did nothing. Oblivious, just like right now",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 131,
                  "content": "I didn't think of this, if that kind of thing has been happening the relationship would be over for me. If you're trying to poison my relationship with my child then you don't love or care about me. That is NOT someone you want to marry.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 11,
                      "content": "If anything, the new spouse should be trying to make sure the kid(s) have a role in the wedding if they want one.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Really, I think it all boils down to this. How much can she really care for OP if she wants to delete the thing that probably matters most to him besides her -- his son? There's just no way she could really love him if she can be this manipulative. \n\nYou've hooked yourself a sociopath, OP, or at least a woman with sociopathic tendencies. Your son is only 15, and she could do a hell of a lot of damage to him if you let her stay in your lives. You've got to bite the bullet and throw this rotten fish back. Godspeed.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "Yes, all that \"doing things just the two of them\" could have been her time to manipulate the kid.  OP needs to have a friendly chat with his son....start by asking \"how would you feel if I decided not to marry *?\"  Follow with things like \"if we got married, what do you think would happen next\".  I'm betting he expects to not be around much.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Came here to say this. Kids are perceptive and they aren't viewing the relationship through rose-colored glasses. She probably doesn't think she needs to put more than a superficial effort into wearing the mask around OP's son. Even the tiniest slip here and there will have rung alarm bells for him, and he may be too scared or unsure of himself to say it.\n\nAlso, and this is very important, OP having a conversation with his son would NOT be for purposes of deciding whether to marry the fiancee. It is already abundantly clear that OP should run from her. Talking to his son would be *for the son's sake*, to find out the extent of and mend any damage the fiancee has already caused.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "This happened to me and I never said anything. Such a dark time.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "OP I hope you see this comment!",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Very insightful.  I had not even thought of it, but I can definitely see it as something in control freak would do.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 790,
              "content": "Also the type that if OP dies first, she'll be ripping up copies of his will, draining the bank accounts, and doing everything she can to prevent his son from inheriting a dime.",
              "id": 36,
              "comments": [
                {
                  "score": 413,
                  "content": "Oh you've met my stepfather",
                  "id": 37,
                  "comments": [
                    {
                      "score": 374,
                      "content": "It's incredibly common. Anyone who has money and kids from a prior relationship should take steps (like setting up a trust) before remarrying to make sure that the new stepparent doesn't disinherit the kids from the prior relationship.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 522,
              "content": "She is showing you who she is and I would suggest you believe her!! She is making you choose between her and your son!! How do you think your kid would feel if he knew about any of this! You really must take his feelings into consideration because your fiancé isn’t and won’t!!!",
              "id": 39,
              "comments": [
                {
                  "score": 13,
                  "content": "I'm kind of wondering if the son would even want to go to the wedding at all and wouldn't even mind, but the fact that the fiancee is reacting like this tells me it shouldn't matter because she's being unreasonable (and thus, there shouldn't be a wedding). Funny how she accused OP of being controlling. Pot, meet kettle.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 22,
                      "content": "A 15 yo boy might not care that much about a wedding! He might care about his future stepmom not wanting him at his dad’s wedding!!",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 184,
              "content": "Kick him out?  I’m thinking more that she’s going to be putting a spoonful of rat poison in his food every day until he finally dies, like that scene in Sixth Sense.",
              "id": 42,
              "comments": [
                {
                  "score": 170,
                  "content": "I’m a proud bonus mom of our 19 year old daughter. She lives with us and *I’m* the one wanting her to live home with us until she’s at least twenty.\n OP’s fiance does *not* care about nor *like* his kid. Which says *everything* about how much she *truly* loves OP.\nShe’s too immature and selfish to be capable.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 18,
                      "content": "My thoughts exactly. Similar situation with my stepchild and I'm soo proud of them. Like you I'll miss them if and when they fly the nest.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "I was 22 when my Mum married my bonus Dad, one of their first dates was to my 21st birthday party. I proudly tell people I have three parents because even though I was well and truly an adult when they met and married he is my parent and I love him just the same, my sister feels the same and my “step” sister and brother feel the same towards my Mum (I even share a birthday with my sister). \n\nOur parents have been married for 23 years next year, which is longer than either of their first marriages and at this point all of us siblings have been in each others lives longer then we were out of each others lives. \n\nBut it also doesn’t just go for our immediate family, my bonus dad’s sisters and brother in-laws are my aunty’s and uncles, their kids are my cousins. His dad, who was technically his stepdad was my Pop. \n\nThere is no step in my family. We are just family.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Bonus mom is such a sweet term.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "I don't think it'll even take that long. She'll be looking to send him off somewhere as soon as they get back from the honeymoon bc it's time for their new life together 🥰 and he is from the old life 👿",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "“ She then changed her reasoning and asked why i wanted my old family and life on the day I was supposed to making a commitment to her and our new family, I told her while I will be making a commitment to her, my son will still very much be my son and my family.\n\nShe then equated it to wanting my ex at our wedding,”\nNTA and this is the biggest reddest flag right here. She is flat out saying your son is not a part of the new family she wants with you and that is not ok, do not let her push your child out of your family and your life.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "“We’ll I was kinda hoping you’d only acknowledge and take care of our children and just cut ties with him.” Seen on so many of these posts.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "i dont think she will wait for him to be 18.\n\nshe already sees him as \" an old family\" and in het eyes he has no place in her family. she will likely push for mom to get full custody and dad maaaaaaybe visitation every other week.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3319,
          "content": "YES. Don't marry this woman! She arbitrarily chose an age one year older than your son to be the cutoff, then talked about \"old\" family versus \"new\" family?? This has nothing to do with not wanting children at the wedding - this has everything to do with her plan to push your son out of the picture. Next comes wanting vacations alone, getting pregnant and wanting the holiday to be a chance for the new family to bond, etc etc. She does not see herself as joining your family; she does not see you as a dad, she sees you as a man with baggage from your first marriage. This woman is toxic and will treat your son like an inconvenience and undesired nuisance in your lives. Protect your son from this! If you go through with this marriage, he will know he is unwelcome and your future relationship with him will be destroyed.",
          "id": 51,
          "comments": [
            {
              "score": 1379,
              "content": "[deleted]",
              "id": 52,
              "comments": [
                {
                  "score": 664,
                  "content": "People using therapy buzzwords to manipulate their spouses left and right these days. Unless OP is leaving out a f ton of info, he's the one being gaslit too.",
                  "id": 53,
                  "comments": [
                    {
                      "score": 16,
                      "content": "It's so fucking bad. I just got out of a marriage exactly like this. The pseudo-psychology that so many people spout is so obnoxious and toxic.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Seems more like she's using DARVO than gaslighting to me",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 381,
              "content": "That to me is the biggest red flag. The “new family” INCLUDES THE SON. And if it doesn’t, OP needs to run fast.",
              "id": 56,
              "comments": [
                {
                  "score": 13,
                  "content": "When someone shows you their true colors, believe them.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "The old/new family thing is disgusting! That's not how families work. Should he not invite his parents either, as they're part of his old family?",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "He should agree to no one under 16 but then demand they delay the wedding a year so he can come. Out crazy the crazy!   Seriously this guy needs to run.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I was literally about to type your first sentence. THAT shit was deliberate. I’m willing to bet if he was 16, the age would’ve been 17. I’m not one to jump on the AITA paranoia bandwagon, but take this as a warning and think long and hard before you move forward.",
              "id": 60,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "She also said him being there is like his ex being there, which means she doesn’t want him around ever.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "He should tell her that in order to meet the cut off age they should postpone the wedding one year. Problem solved 😁",
              "id": 62,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1004,
          "content": "It's appalling that she compared wanting his CHILD there to wanting his ex there. She in no way sees that boy as future family. Horrible woman.",
          "id": 63,
          "comments": [
            {
              "score": 399,
              "content": "Yea she literally called the son her old family. She is despicable.",
              "id": 64,
              "comments": [
                {
                  "score": 205,
                  "content": "I'm not a dad and I can't read people but when I read \"old family\" I stopped reading. That's not  just a red flag; that's the red eject-seat button.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 27,
                  "content": "This is a good catch on her phrasing.  She's also told OP *in so many words* that she thinks having his almost adult son at his own wedding is like inviting your \"ex\" and requires her, somehow, to \"babysit\" him.\n\nShe's told you exactly how she feels about your son: time she spends with him has always been only transactional \"babysitting,\"  and once they're married he'll be OP's out-of-the-picture \"ex\" just as surely as his mother is. \n\nNTA for now, OP, but that will change if you go along with excluding your son from your marriage and the life your fiance has engineered by playing this long game. Btw, have you ever sat down your son and asked him how she treats him during their one-on-one time and how comfortable he is with her?",
                  "id": 66,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Thank you! This is her way of telling him exactly how she feels about his son and it is a foretelling or some shitty treatment to come.\n\nI get angry at parents that are so blind and sex obsessed with their partner that they IGNORE big neon glaring signs about their disdain for their kids.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "This just in: your children are disposable baggage when the next relationship comes along. If you want to have any sort of parental responsibility to them, you’re ruining your new family \n\n(Very obvious /s)",
                  "id": 68,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Yep, she's been putting on a show for OP this entire time. If she gets pregnant, his son is going to be pushed out.\n\nShe's never ever considered him part of OP's life - just bided her time to get the ring. She can't even wait to cast his son out already at the wedding!\n\nAnd if OP dies, his son's inheritance is not going to go where it's supposed to.\n\nOP - Do NOT marry this woman. Protect your son.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 878,
          "content": "Agree ⬆️\nRun, OP, run\n\nAdding:  NTA",
          "id": 70,
          "comments": [
            {
              "score": 542,
              "content": "This is one of the few instances here where I'm like, yeah, definitely calls for a break-up.",
              "id": 71,
              "comments": [
                {
                  "score": 261,
                  "content": "Yeah I never go right to break up/divorce but she has no business being with a man who has kids.",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 95,
                  "content": "Yep I’m sorry as soon as she said she didn’t want his son at the wedding, I would have said okay, we aren’t getting married then. I don’t have any children yet, but hopefully one day I will and no one will ever be more of a priority than them. Like seriously she would have been straight out of the door no negotiations until she came back begging on hands and knees for him to be allowed at the wedding.",
                  "id": 73,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Not even then. She’s shown what she really thinks. If she apologized it would just be her trying to hide it for awhile again. You know she would still push the kid away.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Me too. Fuck that OP, this is the hill to die on. Your son should absolutely be there on your wedding day. Did she really expect that your son would not be upset about being excluded? She is basically telling him that he isn’t really important to her. If he was, she would want him there. Do you want to be married to someone who doesn’t think your kid is important? What happens later in life, when your kid needs you for something? Is she going to be upset with you when you want to drop everything to go help your kid? How is she going to treat any children your son may have, since they “aren’t a part of your new family?” If I were in this situation, I would be rethinking it and honestly I would walk away.",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Unless OP is a particularly fast runner I'd suggest a bike at minimum",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Exactly this.  OP does need to Run from this woman who has now shown him exactly who she is- a \"pretender\" of liking his son to get to him and now that she feels she has him, she is showing her true self- ugly and controlling. And she is the gaslighter.  If OP marries this woman, he will lose his son because of whatever sh\\*t she will stir to get him out of their lives.\n\nOP better keep an eye on his condoms too if he doesn't want to be stuck to this \"pretender\".",
              "id": 77,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I'll add run fast and far",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 415,
          "content": "This is horrible! She is showing you who she is OP. Read the signs.",
          "id": 79,
          "comments": [
            {
              "score": 17,
              "content": "Yup. When someone shows you and tells you who they are? Believe them.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 338,
          "content": "THIS!  I’m glad she is giving you a preview of what a terrible stepmother she is going to be.  I hope you are paying close attention.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 310,
          "content": "This. Get out of this relationship now. She's kicking your kid out of your wedding. (It is also your wedding, you're an equal participant in it and should have equal say.) She clearly has no concept of what being a parent means.\n\nI have zero doubt that she's probably going to do everything she can yo ruin your relationship with your son because she sees him as an extension of your ex. \n\nI don't even think it's worth trying to patch this up even if she sincerely apologizes. She has no respect for your parental role and responsibilities. She is not, and will not ever be a fit for you because of that. She's shown her true colors. Get away, now.",
          "id": 82,
          "comments": [
            {
              "score": 22,
              "content": "Yes. It’s clear from what she said that she sees OP’s son as a temporary encumbrance that she’ll push out the door as soon as she can. The son being “too young” to be at the wedding will rapidly turn into him being “too old” to need to live with them at all.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 233,
          "content": "She calls him controlling for insisting on having his son at the wedding, but I assume she doesn't think she is controlling for insisting that the son not be at the wedding.\n\nShe is a hypocrite and into double standards along with the other nasty traits that have surfaced. And they all will get worse as you get closer to the wedding, or God forbid, actually get married.\n\nShe has been putting on a mask up until now. But she now feels like she has her hooks deep enough into you that she can show her true self and bully you into anything.\n\nRun OP, run!",
          "id": 84,
          "comments": [
            {
              "score": 10,
              "content": "Toxic people always have double standards for them and other people. And accuse other people of what they do.",
              "id": 85,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 224,
          "content": "Ooooooh this is a huge red flag 🚩",
          "id": 86,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 212,
          "content": "It upsets me when AHs like his wife use 'gaslighting' wrong, it's why people just think it's a buzzword instead of an actual abusive tactic.\n\nEdit: HOW WAS HE VOTED THE AH\n\nEdit 2: I think so many people were calling his fiancé an AH (myself included) and it messed up the vote.",
          "id": 87,
          "comments": [
            {
              "score": 15,
              "content": "Same it's becoming overused, and i can't stand hearing people use it in arguments as a weapon to try to get their way. Oh, you're gaslighting me..stfu you don't even know what that means.",
              "id": 88,
              "comments": [
                {
                  "score": 13,
                  "content": "It’s so annoying. I hate when these words get consumed by the masses. \n\nSomeone who disagrees with you is not ‘gaslighting’ you, they just have a different opinion.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Since it became a saying of sorts I've been trying to work out what it means. In my day, gas lighting meant actually lighting the gas! Lol",
              "id": 90,
              "comments": [
                {
                  "score": 21,
                  "content": "It actually comes from the movie 'Gaslight' where this man was doing things such as dimming the gaslight, knocking on walls etc but tells her it's all in her head. This caused her to question her sanity. He then continued to isolate her etc, I'm too scared to watch it lol",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "She knows exactly what it means. She's accusing him of it to make him question himself and get him on unstable ground.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7706,
      "content": "NTA.\n\nEven at child-free weddings, there are reasonable exceptions - and a child of the bride and/or groom are very reasonable exceptions. \n\nOf course, if the child is of a very young age, it could be unfair on the guests if the kid gets free run to disrupt the wedding whilst older, better behaved children aren't invited from the on the basis of being distractions. \n\nAnd given he's 15 now and the wedding is next summer, surely by then he will be only at most a few months shy of her cut off?\n\nSince you say she's a long-term girlfriend, I presume that fiancée has known your child some time. And you've proposed, so I am also presuming she's not excluded him before. But now....\n\n>She then changed her reasoning and asked why i wanted my old family and life on the day I was supposed to making a commitment to her and our new family\n\nWow. So what, is she expecting the boy to no longer be a part of your life the moment you say 'I do'? \n\nBecause that revised reason for excluding him from the wedding screams that she's already mentally excluding him from your life. \n\nBut lets pretend she didn't suggest your son was simply part of your old life. Let me ask you a few questions here:\n\n* Exactly how old will your son be at the time of the wedding?\n* Who chose the wedding date? Was it a mutual decision, or picked by one of you then simply agreed by the other? \n* Why is the cut off 16, not 18? Is her 16yo cut-off allowing a teenage guest of her own to attend?",
      "id": 93,
      "comments": [
        {
          "score": 3109,
          "content": "he will still be 15 by the wedding, the date was mutually agreed upon, im not her so i dont know exactly why 16 was chosen, but are from the UK 16 is when kids finish secondary school (the british equivalent to high school) so maybe its that again idk",
          "id": 94,
          "comments": [
            {
              "score": 6014,
              "content": "It makes no difference. Do not marry her.  To have to even ask if you are the AH means she’s already done a serious gaslighting on you.",
              "id": 95,
              "comments": [
                {
                  "score": 1334,
                  "content": "Sounds like the goblin was getting close to the jewelry she wants on her finger and accidentally showed her true colors. She has no intention of having his son meld into her new \"dream\" life.\n\nRun",
                  "id": 96,
                  "comments": [
                    {
                      "score": 122,
                      "content": "My precious...",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "Yep she’s a narcissist and her mask fell off",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "She is explicitly excluding your son from her family. And she waited until she had a ring to show you how she really feels about him. Break up with her.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Exactly. If he was 16 then she would be asking for 17 years to be the limit. Her issue is OP's son. Nothing else. Because there's barely any difference in maturity between a 15 year old and a 16 years old. In fact, a lot of 15 year olds are more mature than a 16 year old. The only reason she's causing an issue about that specific age is almost definitely because it's OP's son.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": ">  she’s already done a serious gaslighting on you.\n\n*Accuse others of that which you are guilty*\n\n>> She started calling me controlling ...  and now im “gaslighting” her.\n\nPoor OP, married or future divorced to her, not sure what's worse",
                  "id": 101,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 3169,
              "content": "We know why 16 was chosen. She did it to purposely exclude your son. If he was 16, she would say 17. If he was 17, she would say 18.\n\nShe told you exactly what she wants. Believe her. She doesn't want your child at the wedding at all. That is her goal. She is gaslighting you.\n\nNta for having your son at the wedding",
              "id": 102,
              "comments": [
                {
                  "score": 1091,
                  "content": "This. She doesn't want your child in her LIFE at all.\n\n>asked why i wanted my old family and life on the day I was supposed to making a commitment to her and our new family,\n\nRead this back. She called your son your old family, separate and excluded from the family you'd have with her.\n\nBe grateful she showed her true colours before a legal commitment was made. As daunting as it seems to call off an engagement, it's much more daunting to initiate a divorce. NTA.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 342,
                      "content": "OP.. this she calls your kid old family. She has no intentions of being a nice blended family. Please protect your son from her. NTA",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 251,
                      "content": "She wants you to become a “ vacation/weekend dad. Only have him occasional weekends and school breaks and a few weeks in the summer. And stop paying for and stop spending so much time with his hockey.",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 144,
                      "content": "All of this.  OP naturally assumed that he and his son were a package deal, she has been planning to move his son out of the picture as soon as possible -- 16 is school leaving, and she can say he's old enough to not depend on his dad.   That's too soon?  She'll move it to 18.   There will never be a good time for him to sleep over because \"they\" have plans and if she has her way, she'll get pregnant soon (bio-clock you know).  And soon he'll realize that her promises were worth nothing, no amount of discussion or counseling will make any real difference.   He'll end up alienated from his son and guilty that he's not totally happy with his \"new\" family.\n\nu/ChildFreeWeddingSon  is so lucky that she has revealed herself now.",
                      "id": 106,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "This exactly!! This was the number one thing that stood out for me. She has no intention of your son being part of your life once you make her your family. She already considers him out of the picture. RUN. For the sake of your son and yourself, just run. It's only going to get worse from here.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 434,
                  "content": "It's really funny to me that she's accusing him of gaslighting her while she's gaslighting him. She started with 16 across the board to be \"fair\", but when pushed, she's really shown her true colors. She's not even a good liar about it. She must've really thought he'd not want his son there either in pursuit of fairness. I can't imagine she has her own kids.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 207,
                      "content": "She isn't gaslighting him, that's not what gaslighting is. she's being manipulative.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "She doesn't want his child in her life, not only at her wedding. \n\nIt's sad, but OP must think twice about marrying this person. She just started showing who she really is.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1256,
              "content": "Don’t discuss it any further with her. She is spiteful and hateful. Not a good start. \n\nPostpone the wedding by one year. Tell it everybody. Reason: you want your son there and your gf wants nobody under 16. \n\nProblem solved. She cannot even complain because that her rule.",
              "id": 111,
              "comments": [
                {
                  "score": 170,
                  "content": "This is the way.",
                  "id": 112,
                  "comments": [
                    {
                      "score": 463,
                      "content": "No, this is not the way! That doesn’t change the fact that GF sees son as part of his old life. I don’t even have kids so don’t experience or understand the kind of love a parent has for a child and even I was horrified to read that. \n\nOP should NOT marry a woman who thinks a child can just be excluded. She’s marrying into an existing family and can’t just dispose of kids.",
                      "id": 113,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 127,
                      "content": "No, this is hiddig the rubish under a carpet. She called the boy \"his old family\" and she said having him atbthe wedding would be equal to having the ex there. I'm not one to belive that step-parents have to see their step-kids as their own, but they should still like them or at least not despise them.",
                      "id": 114,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 123,
                  "content": "This is devious but brilliant.\n\nIf she balks at the postponement, and still refuses to allow your son to be there, you know to permanently postpone a wedding with her.\n\nHowever, I wouldn’t waste my time with her any further, and would just end it now.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 8,
                      "content": "No. He already knows this woman should never be his wife. Or he should. She hates his son. Unless OP also hates his son, he needs to cut ties with her immediately and move on.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "He shouldn't marry this woman",
                  "id": 117,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 572,
              "content": ">**he will still be 15 by the wedding**, the date was mutually agreed upon, **im not her so i dont know exactly why 16 was chosen**\n\nReally? I mean, come on.\n\nThere are none so blind...",
              "id": 118,
              "comments": [
                {
                  "score": 158,
                  "content": "I find it hard to believe she has just been hiding this side of herself the entire length of their relationship. Either they haven't dated very long or OP is kind of oblivious. Guessing she's younger than OP, hot, and psychotic. Given he came to AITA instead of dropping her faster than a bad habit and never talking to her again, I'm guessing he's a bit oblivious and requires being hit upside the head in order to finally \"get\" something. I'm rooting for him lol but he's making it hard to!",
                  "id": 119,
                  "comments": [
                    {
                      "score": 121,
                      "content": "It's also pretty amazing how good people are at pretending to be a decent person until they get what they want.",
                      "id": 120,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 84,
                      "content": "You should look into how abusers manage to keep their abusive nature mostly under wraps until they believe they have their victim trapped…like with a pregnancy or marriage.",
                      "id": 121,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "My best friends wife hid it until after their son was born. About 6 months later, when he was at work, she went to his daughter from a previous relationship and told her she wasn't sure why she was still here. Actually ranted to a 12(f) about how once a proper child comes along  the rest need to go away and not come back. Ya he divorced her",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 68,
                  "content": "OP read this a few times and remember how you said that your fiancé likened you wanting your own son there to be wanting your ex there. She sees your son as your past and will probably try to distance you from him after the marriage.",
                  "id": 123,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yep. Her plan all along. She's been very, ah, patient, waiting to cut that father/son cord to have him fully to herself.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Thinking with the wrong head...",
                  "id": 125,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 267,
              "content": "No, it’s not that. It’s “why you wanted your old family and life” OP, the thing you are missing is the importance of that statement. She has been playing nice with him to get you. Once she gets you, she will start pushing him away.",
              "id": 126,
              "comments": [
                {
                  "score": 21,
                  "content": "Yes. Exactly. I cannot imagine what a monster she is going to turn into once SHE is pregnant!! OMG. That poor son!",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 254,
              "content": "Op I was 12 when my dad married my stepmother.  I wasn't invited to their wedding. I was a shy, quiet, well-behaved kid. I asked to go and was told no. When my mom married my step-dad, I  was invited. I was even in the wedding party. Guess which side of my family feels more like family to me? My dad and stepmother wedding was the first time she she didn't include me or my brother, and it sure wasn't the last. I was part of his old life, and and look like my mother she didn't like that. Op fight for your son to be a part of your new life or find someone else to marry.",
              "id": 128,
              "comments": [
                {
                  "score": 22,
                  "content": "Sadly a lot of parents also want to discard the kids from their “old life”. Considering OP is incapable of seeing the reason why she is doing that, he probably will go ahead with the wedding. At best he may try to get his son to attend it.",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "OP, I hope you see this comment.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 242,
              "content": "She picked 16 because your son is 15.\nIf he was 17,she would have picked 18.\n\nYou may think that she gets on with your son but she has just shown you that she doesn't want him around. \n\nMy guess is as soon as she is pregnant ,she will be too stressed to have him there.\nShe has shown you who she is. Pause the wedding",
              "id": 131,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 225,
              "content": "That’s not “it.”  “It” is because she’s found a (in her head at least) reasonable way to exclude your son from the wedding without coming across as a major asshole. \n\nYou need to address the elephant in the room. He’ll be, what, a few months shy of the age limit, and she wants to exclude him. Him, the *son* of the groom. \n\nYou’re marrying the wrong woman, man. Starting a life with someone that begins with cutting off your own children is not a road you want to go down. This won’t stop here.",
              "id": 132,
              "comments": [
                {
                  "score": 16,
                  "content": "**Starting a life with someone that begins with cutting off your own children is not a road you want to go down. This won’t stop here.**\n\nLOUDER FOR OP IN THE BACK",
                  "id": 133,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 200,
              "content": "When I started reading this, I expected to soon get an update saying she thought after the marriage you'd forget about your old family and your son and start over with her or some bullshit but then I got to the part where she already called them your old family and gave you a nice hard look at what's to come and you can't see the red flags she's waving directly in your face.\n\n\nETA: You're NTA for wanting your son at your wedding. You will be if you go through with this wedding after she clearly stated her feelings about your son.",
              "id": 134,
              "comments": [
                {
                  "score": 15,
                  "content": "The “old family” comment is a red flag so large that it could probably be seen from space.",
                  "id": 135,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Seen from? It's so large it's ***in*** space.",
                      "id": 136,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 171,
              "content": "Don't even try to justify her ignorant position. There is no excuse for her decision. \nDo not marry her or you will lose your son.  She will make sure of it.  \n\nShe's already asking you to choose her over your child.  \n\nI was cut off from a wedding. Same age. No one under 16. They were married in August.  I turned 16 in Sept. My 2 older sisters were invited.  (Who does that,  right?) \n\nThis was literally 50 years ago.  I still remember how hurt and embarrassed I was.  I stopped talking to them when they decided I was not important enough to be there. They also tried to justify it, but it was all bs.  This was a cousin. I cannot imagine if it were a parent!!!!  \n\nAnd no, I have had nothing to say to them all these years....",
              "id": 137,
              "comments": [
                {
                  "score": 17,
                  "content": "And you weren't the child of the bride or groom either.",
                  "id": 138,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "That's horrible I'm sorry they hurt you, I can't believe this guy seems to be considering hurting his son in the same way, what a betrayal that would be.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7568,
      "content": "NTA. \n READ CAREFULLY. It reminds me of an another post on Reddit. Same situation the girl did not wanted her boyfriend to bring his daughter from his previous relationship to the wedding ! Guess what, after he said that it was not negotiable cuz his daughter will ALWAYS be his priority and family, she admitted that she was expecting that he will become some kind of “holiday’s dad”. She was hoping that when they will get children together his daughter will be less present in his dad’s mind and life. The guy did not even think about it TWICE. He was disgusted (as he should) and dumped her. Then he went with his  daughter on holidays during the week the wedding should have occurred. \nStarting a new family does not mean that you should dump the previous one or make it less valuable. And just imagine the image that your son is going to have of YOU and HER.\n\nSorry English is not my native language…\n\nSometimes on REDDIT I think that people are overreacting but for ONCE it’s not the case at all. Your son is your family. He is not a ghost of your old life. Please, I beg you take the good decision and to be a good example for your son.",
      "id": 140,
      "comments": [
        {
          "score": 1202,
          "content": "**https://www.reddit.com/r/AmItheAsshole/comments/14urh2j/aita\\_for\\_telling\\_my\\_fianc%C3%A9\\_my\\_daughter\\_has\\_to\\_be/**",
          "id": 141,
          "comments": [
            {
              "score": 538,
              "content": "Another update: \n\nhttps://www.reddit.com/u/whoevenisthat5/s/pUklCBdxKI",
              "id": 142,
              "comments": [
                {
                  "score": 156,
                  "content": "Functioning links for cool people: \n\nhttps://old.reddit.com/r/AmItheAsshole/comments/14urh2j/aita_for_telling_my_fianc%C3%A9_my_daughter_has_to_be/\n\nhttps://old.reddit.com/user/whoevenisthat5/comments/14vb4wi/update_on_the_last_post/",
                  "id": 143,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 179,
              "content": "Now that's a good dad.",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 729,
          "content": "I seem to remember a similar story, gf didn't want his daughter/wanted a child free wedding. He reluctantly went along with this until he got to his wedding to see loads of her side had brought their children, it was only child free to him and his family!",
          "id": 145,
          "comments": [
            {
              "score": 232,
              "content": "Disgusting. I'd have left her at the altar.",
              "id": 146,
              "comments": [
                {
                  "score": 102,
                  "content": "Assuming I was already out the money, I wouldn't waste it by just not showing up to the wedding. I would've quickly written some very petty surprise \"vows\" and *then* left her at the altar. Surely at least *some* of her family would have been horrified to hear what she had done, and that way they're like to remember.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 25,
                      "content": "Cancel the wedding but throw a 'dodged the bullet' party instead of the reception, let her family know that are not invited.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Oh, I most definitely meant at the altar and not before ever reaching it. But you certainly made it much better by letting everyone know what an asshole thing they'd done. Kudos!",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Yah, that's an immediate annulment for me dawg...",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "This is truly despicable. Fuck that bride.😬😭",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "OMG i would have been so pissed off.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 266,
          "content": "Just came to post the same thing! She’s expecting him to become a “vacation dad” and start over with just her and him as a “new” family. If OP planned on having kids with her, they would immediately take too spot and his son would all but cease to exist to her",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 179,
          "content": "I always support child free wedding posts but this one is ridiculous!!! OP: RUN!! This woman does not want your son in your life. A 15 year old is not a “child” when it comes to establishing a child fee wedding—especially if it’s your own son! Please do not alienate your child for this woman. Love interests will come and go but your  child will be your child FOREVER!",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 105,
          "content": "Is this the one where, when she told him the truth, he took her hand and removed the ring?",
          "id": 155,
          "comments": [
            {
              "score": 21,
              "content": "That's the one!",
              "id": 156,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "Yeah, that guy was a good dad!",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "My dad wasn't allowed to call me when I was a teenager, because my mom might answer the phone.  This was before the days of cell phones and video chat.  This woman is giving me the same vibes.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Wish I could upvote 1000 times.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3470,
      "content": "Don't go through with this wedding. Your fiancée is being controlling, gaslighting you, and showing you exactly how she will behave if you are married. She doesn't want your son in the picture and will do everything she can to ruin what relationship you have with him. She equates him being at your wedding to your ex being there? Your son = your ex to her, and you will end up wondering why you're in a miserable marriage and never see your son anymore.\nNTA. She's TA.",
      "id": 160,
      "comments": [
        {
          "score": 111,
          "content": "> Your fiancée is being controlling, gaslighting you, and showing you exactly how she will behave if you are married.\n\nYeah the fact that she called *him* controlling and said that he was gaslighting *her* almost made me spit out my drink. That might be the blackest pot I've ever seen trying to talk shit to the kettle. Unreal.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 85,
          "content": "I was hear to say this!!",
          "id": 162,
          "comments": [
            {
              "score": 16,
              "content": "I hear you were here, too ;)",
              "id": 163,
              "comments": [
                {
                  "score": 11,
                  "content": "Oh, snap 🤦🏼‍♀️ replying before coffee! 🤷‍♀️",
                  "id": 164,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Believe it or not, jail.",
                      "id": 165,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Plus, I bet, if/when OP calls off the wedding and dumps her, she will come crawling back saying shit like \"But that is not at all what I meant!\"",
          "id": 166,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Exactly. I can’t believe he’s still thinking of marrying her. He’s NTA right now. But will be, to his kid, if he marrys her.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2291,
      "content": "NTA\n\nThere is a giant red flag on the play here. Your son is your son, he's not going anywhere. \n\n>asked why i wanted my old family and life on the day I was supposed to making a commitment to her and our new family,\n\nShe seems to be under some sort of illusion your relationship with your son will change when you're married to her. \n\nYou need to resolve this - or very seriously reconsider.\n\nBlended families are tough, and I think she has a fantasy in mind. You're not fitting into it, because you have a history She isn't able to contend with",
      "id": 168,
      "comments": [
        {
          "score": 288,
          "content": "This is a massive red flag waving. Car dealership size red flag flapping in his face. She doesn't want his son to be a part of their life.",
          "id": 169,
          "comments": [
            {
              "score": 19,
              "content": "It’s one of those flappy inflatable guys with the crazy arms flying all over the place, and it’s slapping the shit out of him.",
              "id": 170,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "If the son was 16, I bet the wedding cutoff would have been 17.",
              "id": 171,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 116,
          "content": "Equating the son with the ex....no words for how awful this is. Will anger against the ex be taken out on the son?",
          "id": 172,
          "comments": [
            {
              "score": 16,
              "content": "Already is.  That's what started this mess.",
              "id": 173,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "This isn't a red flag, it's a full goddamn p'yongyang parade.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1706,
      "content": "NTA.\n\n>She then changed her reasoning and asked why i wanted my old family and life on the day I was supposed to making a commitment to her and our new family\n\nOP your fiancé just showed her hand. She considers your son part of your old life, and your old family. That lil slip up may very well mean she is only tolerating your son and will start trying to push him aside once you're married, not to mention favoring any children you have with her over him.\n\nI would think VERY carefully about whether this is the woman you want to marry or not after her ultimatum.",
      "id": 175,
      "comments": [
        {
          "score": 179,
          "content": "There was another post super similar to this (I can't remember the title) where the fiance was expecting the parent to relinquish custody after the marriage to the ex partner. Even though this person had full custody at the time! \n\nEven if this isn't the plan here, it is very telling how OP's fiance will treat his son going forward. Especially if they have more kids.",
          "id": 176,
          "comments": [
            {
              "score": 10,
              "content": "That one ended with the OP breaking off the engagement and taking his daughter to Hawaii, on what would have been the honeymoon.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "This right here.  It starts with the wedding and then expands to holidays and when you have children with her. She does not see that she is joining your family and your son is part of it. \n\nYou need to take a moment to discuss how she sees the future and what part your son has in it.",
          "id": 178,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Most definitely agree. OP she more than likely will. That would be a red flag for me too if my fiancé said something like that. He’s definitely NTA like you said.",
          "id": 179,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1046,
      "content": "I got as far as you \"old family\" and she is your new family. This woman will destroy your relationship with your son and anyone else from your past. She has given you a glimpse of what is coming your way. Once married she will slowly manipulate it so you are being separated from your son, any friends that knew you before and any family members that still have contact with your ex. I can tell you from experience most of the time someone claims you are gaslighting them, they are the ones doing it. Even if she changes her tune about your son coming and blames wedding nerves or other conditions, DO NOT fall for it. She has shown you who she really is. She may start to back pedal a bit when she sees this isn't her hill to fight on, don't let that fool you. Anyone who refers to you child as part of your old life, and says you might as well be inviting your ex is not a decent person to have around your son.",
      "id": 180,
      "comments": [
        {
          "score": 119,
          "content": "Yep, that stood out to me as well. This woman tipped her hand a little early and OP should run away.",
          "id": 181,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I’m usually not in a rush to tell someone to reconsider their relationship but…This should never have happened and you should not give this person the opportunity to do anything like this again.",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Exactly. That comment is unforgivable.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 767,
      "content": "She wants to exclude your son from your wedding.\n\nRead that again. Now think about, if this is how she is before marriage, imagine how much emotional damage she will do to that poor child after marriage.\n\nShe wants to exclude him from your life. This is just the start.",
      "id": 184,
      "comments": [
        {
          "score": 97,
          "content": "Exactly. That's why she changed her tune after OP fought on 15 vs 16. Why would she set the age at 16 when son is 15, if not to exclude? OP, please read these comments carefully.",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 53,
          "content": "All of this. OP you need to sit down with your son and find out if she is truly treating him well. He may be keeping quiet about things because you are happy. NTA",
          "id": 186,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "How much damage has she done already on the outings she’s had with son that son isn’t telling anyone about as well…",
          "id": 187,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "OP needs to have a sit down with his child and have a fairly long chat about how the son feels about the upcoming change to the family.  When Dad isnt around how does the Fiancé treat him?  Does she ignore him? Neg him? I’d do a check in with the teen.",
          "id": 188,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 717,
      "content": "Dude, you can’t marry someone who calls your child your “old family”. She has no interest in him. That’s not healthy for a kid/teen. If you marry someone who doesn’t want him around next she’ll demand that she be your sole inheritor and ‘promise’ to make sure you son is taken care of in the event of your death. \n\nDude, she doesn’t want your kid around. She called him being there “babysitting.” \n\nYWBTA to marry her",
      "id": 189,
      "comments": [
        {
          "score": 58,
          "content": "NTA. **OP, this is a very big deal, do not underestimate her intentions.**\n\nI'm dating a single Dad, we both very much understand that his kid is #1 (in a normal way not like an enmeshed way). I wouldn't want to date a parent who doesn't consider their kid #1 because then they're not a good parent. I don't fuck with bad parents.\n\nThis is bad, really bad. She'll keep pushing your kid out. The mask is slipping. Please don't give \"the benefit of the doubt\" to her here, she's showing her true colors and it'll get worse. \n\nOP, you love your kid so don't let her lead you down a path to hurting him. This is one of those situations that your son would never forget and she's banking on that to set the new tone of your relationship.",
          "id": 190,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "OP is a massive asshole if he subjects his son to this horrible woman for another day. Let alone marries her. \n\nGood lord, some of the questions on here are so obvious I wonder how people manage to get through daily life.",
          "id": 191,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 659,
      "content": "NTA\nMajor red flags. Child free in most people's minds typically wouldn't include those in HS. Why is she cool with a 16 year old but not 15?\n\nIf that's true, you could say \"okay, no problem sweetie. Well just have to make sure the wedding is after (son's birthday) so he can come\" and smile away. \n^note I wouldn't actually recommend this nuclear fight starter, but she's got a big problem coming that you need to talk through.",
      "id": 192,
      "comments": [
        {
          "score": 178,
          "content": "She would be cool with a 16 old because his son is 15. She clearly does not want his own 15 year old son at the wedding because his son is the \"old family\".\n\nShe does not see the son as a family member and she will ruin the relationship between dad and son in the future.",
          "id": 193,
          "comments": [
            {
              "score": 59,
              "content": "I think we all got that",
              "id": 194,
              "comments": [
                {
                  "score": 12,
                  "content": "Yeah, but OP might not have gotten it yet. I'm not sure he will.",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 106,
          "content": "This a thousand times! Postpone til he’s 16. Start that fire. This wedding shouldn’t happen anyway. Might as well go out in style. \n\nNTA.",
          "id": 196,
          "comments": [
            {
              "score": 20,
              "content": "This is the best test. If he proposes the idea of waiting a year so that his son is included, she will think of something else to exclude him.",
              "id": 197,
              "comments": [
                {
                  "score": 9,
                  "content": "This would be an interesting “test.”  See how she reacts and make sure she knows if you’re going to announce a change in dates that you are clear why you have to change the dates.",
                  "id": 198,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 51,
          "content": "Most people set their child-free age limits at like 12, or go all the way to 18. It's so clear she designed this rule specifically because she doesn't want his son there. There is basically no difference between a 15yr old and a 16yr old.",
          "id": 199,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "I would absolutely do that because it will reveal her true intent and he needs to see that. \n\nThis rule is to 100% solely to exclude the son. If he proposes to wait till he's 16, she'll find other reasons that will be telling and do everything to have the son out of his life. If it truly was about the age, she'd say it's fine. \n\nBut she already clearly told him that she doesn't want his son in their lives. She litterally told him she doesn't understand why he wants his 'old life' in his wedding. He shouldn't marry her if he values a relationship with his son. She'll do everything to destroy it",
          "id": 200,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}