{
  "post content": "Me and my girlfriend have been going out for over a year now, we just moved in together and we decided to throw a moving in party. The party was maybe 25-40 people, I honestly couldn't count because a lot of people were coming in and going out. \n\n&#x200B;\n\nThe thing is, my girlfriend had control over the music. She was playing... kind of really bland edm-pop stuff like a edm remix of a taylor swift song and ed sheeran and stuff, and I could just absolutely tell that nobody was into it. I think this might be somewhat of an urban/suburban divide, she is from the suburbs where the radio is more popular in general. For one, most of the people there were people I knew, and I know that they wouldn't like it, but also I talked to a few of my friends and they said the music was annoying. \n\n&#x200B;\n\nI decided to ask her if I could play some music, something that was... you know, crowd pleasing (early 2000s hip hop hits, of course), and not just music that I personally enjoy, and right away you could see people get more excited from the music. About 4-5 songs later, she asked if she could play more music, and I told her yes, but play something different than what she was playing before because a lot of people weren't into it. She got a tiny bit upset at that, and she kept asking me to explain what I meant, and I just said that people didn't want to hear pop music at a party like that, and she got kind of really pissed off at me and took it as a personal attack on her music taste. I kept telling her that it wasn't me, it was more the guests. Truth be told, I didn't like it much either, and I think she could tell that it was also me, but I personally didn't CARE about the music, its more that it was mellowing out the party in a bad way because people didnt like it. She ended up getting really frustrated at me, saying that we've been dating for over a year and I never told her that I thought her music taste was bad. Like, why would I tell her that? We have different music tastes, she knows that. I think she was kind of in denial that the PARTY didn't like the music, and assumed it was entirely ME who was disliking the music. \n\n&#x200B;\n\nShe ended up going upstairs in a pout, and the next day she went to Chicago for a work trip so we have barely spoken since. I felt like an asshole the entire night. I probably shouldn't have said anything about that, it just came off like I was telling her that her music sucked, but she also kind of put me in a tough position there.",
  "id": 1,
  "comments": [
    {
      "score": 194,
      "content": "ESH but I am howling with laughter at the idea that early 2000s hiphop top hits music is what you consider to be sophisticated beats for the urban ladies and gents. You both have shitty taste in music and you trying to make it into a city/suburb thing is just amusing to be honest. \n\nShe's TA for overreacting, but she is not the asshole for her music taste. You're the TA for being blatant about what you thought of her music, but you're not the asshole for wanting to change the tunes. Next time compromise with a mixlist, or both of you could try some new stuff.",
      "id": 2,
      "comments": [
        {
          "score": 106,
          "content": "\"early 2000s hiphop top hits music is what you consider to be sophisticated beats for the urban ladies and gents.\"\n\nI dont think its that so much, as it is that early 2000s rap hits are just general crowd pleasers at parties. Everyone knows them, they're fun and dancey. Everyone loves Hey Ya and Missy Elliot, especially if they're millennials. Judging by the example he gave of what she was playing, that would not be received well at... any party I can think of.",
          "id": 3,
          "comments": [
            {
              "score": 24,
              "content": "Funny you say that, I played Hey Ya. Not Missy though, but that would have been a great choice.",
              "id": 4,
              "comments": [
                {
                  "score": 23,
                  "content": "I don’t know anyone who doesn’t get going when Hey Ya comes on. What an a absolute banger of a tune. Toss in Roses and a few other OutKast songs, start a station and you got a good time.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "[deleted]",
              "id": 6,
              "comments": [
                {
                  "score": 3,
                  "content": "Yep, I'm 31, if I did tunes based just off what my friends liked, who are my age, I'd be playing a lot of EDM, or if pop 1 Direction and Justin Beiber. I chose instead to do a mix of EDM and R'n'B.\n\nI have to hunt out places that play tunes I like as EDM or pop is the default.",
                  "id": 7,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Fuck guess I'm not a millennial then.",
              "id": 8,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "'Shawty it's YA BIRTHDAY\n\nwe Gon' party like IT'S YA BIRTHDAY\n\nwe gon' sip bacardi like IT'S YA BIRTHDAY.' \n\nTotal urban class = op.",
          "id": 9,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 74,
      "content": "NTA. When hosting a party you need to try to make your guests comfortable. Spamming music that most people don’t like isn’t the way to go.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 31,
      "content": "NTA. If you’re gonna DJ, learn to read the room. It’s not like you told her explicitly her music sucked. You just requested she play some music that everyone would be into. If you knew that the party goers were into EDM or were responding well, then it wouldn’t be an issue, but obviously people weren’t enjoying it. She needs to grow up and learn if she’s gonna be the DJ then she needs to take requests.",
      "id": 11,
      "comments": [
        {
          "score": -2,
          "content": "OP was only paying attention to himself and a few of his friends. He didn't ask any of her friends. Was just focused on himself and his friends. He was the only person requesting, no one else.\n\nBetter if they'd come up with a mix of both of their tastes than him only caterer to what he and a few of his friends like.",
          "id": 12,
          "comments": [
            {
              "score": 7,
              "content": "He said 95 percent of the people there were his friends in a comment below",
              "id": 13,
              "comments": [
                {
                  "score": -1,
                  "content": "Didn't ask all of them. Just a few. He assumed all of them didn't like it with no concrete evidence. \n\nMay be that their plans for the part were different, beyond just the tunes.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I know my friends personal preferences because we're friends. If my gf likes carrot cake but everyone else likes chocolate, do I need to go ask everyone if they prefer the carrot or chocolate?",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 21,
      "content": "YTA: *You* didn’t like the music and you offloaded that onto your friends so that you didn’t have to be “the bad guy” but she could tell. Now you’re being dishonest and making her feel embarrassed about her music tastes.\n\nUnless she has no awareness whatsoever she would be able to tell if people were into her music choices or not. Either they liked it and you’re projecting or they didn’t like it and she didn’t care. Either way, if you want to be responsible for music, tell her BEFORE the party. Don’t wait until the party is going and tell her that “other people” don’t like her music.",
      "id": 16,
      "comments": [
        {
          "score": 40,
          "content": "I didn't like the music, but if it was just me then I would have allowed her to play it. It was more that the actual people at the party didn't like it, and it was kind of really, really obvious that they didn't. But I think she picked up that I also didn't like it, and assumed it was just me. It was not just me, it was everyone.",
          "id": 17,
          "comments": [
            {
              "score": -2,
              "content": "Did you say “the guests don’t like the music” or were you up front that you also didn’t like it?\n\nIf it was really, really obvious that they didn’t like the music, why do you think she couldn’t tell how the guests felt about it? Is she oblivious about other social cues?",
              "id": 18,
              "comments": [
                {
                  "score": 16,
                  "content": "Oh no I was not telling her at all that I didn't like it, I was trying to hide that. I just told her the guests don't like it, and she right away got the idea that I didn't like it. Which isn't false, I didn't like it, but that wasn't why I was asking her, and its not the reason I presented to her.",
                  "id": 19,
                  "comments": [
                    {
                      "score": -12,
                      "content": "That’s probably a lot of why she was pissed.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 20,
      "content": "NTA\n\nShe should have been able to tell that people wouldn't like Ed Sheeran at a party with adults. How old are you guys? If this was a group of teenagers then maybe but I don't know anyone over the age of 21 who listens to Ed Sheeran or Taylor Swift.  \n\nEither way, you had a responsibility to throw a fun party, and the guests didn't like the music, so you asked to change it up. That's totally reasonable. I think the problem was that she knew that you didn't like the music, and she took that as a personal attack.",
      "id": 21,
      "comments": [
        {
          "score": 1,
          "content": "Am 23. Ed Sheehan and Taylor Swift are both solid and I listen to both. That being said, listen to whatever you want :)",
          "id": 22,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "NTA, this is reminding me of this guy I know who got really into abscure techno/rave music. It kind of sounded like they were playing three different songs at once so the beat was really odd and not good for dancing.\n\nAnyways, because he swore that this music was *amazing* he kept of pestering the DJ at a school dance to play (random name) songs. The DJ didn't even have any on his device and told him he couldn't play it, so the guy says \"it's ok I have a playlist on my phone\" then proceeds to unplug somethings, plugs in his phone, and presses play. \n\nHis music comes on and everyone stops dancing after a few minutes. He's the only one on the dance floor going all out while a few others just move awkwardly.\n\nThe DJ let's his music okay untill the guy realized no one else was dancing (about two songs) and slowly stopped himself. Then the DJ plugs his stuff back in and everyone else starts dancing again. \n\nHe complained the rest of the night about being the only one with good taste in music.",
      "id": 23,
      "comments": [
        {
          "score": 5,
          "content": "As obnoxious as it is for everyone else, poor dude really. It sucks to have a taste so different that you struggle to find a group to enjoy it with.",
          "id": 24,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NTA and it sounds like she overreacted",
      "id": 25,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "YTA\n\nMost people were people you knew, what number are we talking here? How many of her friends were there? Did you gauge if they liked the music or did you only care about your friends?\n\nIt sounds like you were just focused on yourself and the friends of yours that didn't like the music.  The smarter option would have been to do a mix that flips between both your tastes every other song. Not just create the impression that you had the better taste in music, which is what you did.\n\nIt's not an urban or suburb thing. I grew up in small villages and towns, I love 80's and 90's R'n'B, rap, and hip hop. Less so a fan of the 00's, not a fan of the 10's. I know bucket loads of people who grew up in big cities and all they groove to is EDM/pop music. Tastes vary widely. All you can say is what your friends like, and it won't hurt them to listen to a tune they don't like for a few minutes. \n\nApologise, sincerely for what you said, and tell her that for your next party you'd like to incorporate her favourite tunes with yours, so both of you get input on the playlist. There are even mixing apps that can help you make fun playlists that blend the start and end of tunes together.\n\nAnd don't ever go at someone that their music is bringing the party down, you just have your opinion and a few of your friends. You didn't ask her or her friends.",
      "id": 26,
      "comments": [
        {
          "score": 16,
          "content": "He doesn't have to be their friends to read the room and realize that a party is not enjoying the music.",
          "id": 27,
          "comments": [
            {
              "score": 4,
              "content": "He based his read on himself and a few of his friends. Nothing for her friends. And he doesn't even know how many people were there. Speaks for someone not that observant.\n\nThere is a big difference between 25 and 40. You're going to know.",
              "id": 28,
              "comments": [
                {
                  "score": 6,
                  "content": "In another comment he says that she didn’t have any friends there except for a handful of coworkers she barely knew. Either way, you don’t have to actually know everyone there to read a room and realize people aren’t bumping to the music at all. I wouldn’t play loud death metal music at a party knowing most people would hate it. Same for weird edm remixes of Ed sheeran.",
                  "id": 29,
                  "comments": [
                    {
                      "score": -6,
                      "content": "Doesn't matter, especially with his attitude of how people like music based on where they live. He went off himself and a few friends. If they really hated it, they would have left.",
                      "id": 30,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "She doesn't really have any friends like that in the city, her 4 work friends were there but she doesn't know them that well. So basically like 95% of the party was my friends and people I know, which she is fine with, she likes my friends and vice versa, and she sees them a lot. She only moved here two years ago, and we've been dating for most of that time. I probably should have cleared that up. \n\n&#x200B;\n\nIt also wasn't for a few minutes. She was playing songs for the first 2 hours of the party.",
          "id": 31,
          "comments": [
            {
              "score": -5,
              "content": "Did you ask 95% of the people there? No. So don't assume everyone didn't like it based of off you and a few friends. That shows your bias. \n\nDoesn't matter if it was yours or her place, you agreed on a split party, which means tunes should be split well.\n\nAnd still doesn't matter how long her tunes were playing, you approached it in a bad manner. There are ways to switch things up without putting down someone else's tastes. \n\nI mean your love of 2000's hip hop music would score lower for me than EDM. But I love the 80's and 90's tunes. Which are quite different. Even within genres people have tastes. It's not as cut and dried as you make it seem.",
              "id": 32,
              "comments": [
                {
                  "score": 11,
                  "content": "\" Did you ask 95% of the people there? \" I cant tell if you're joking or not. Does a DJ go to 95% of the people in a club to determine whether everyone likes his music? \n\n&#x200B;\n\nI know what my friends liked, and it \\*wasn't what she was playing\\*. Honestly, it was not music anyone would play at a party. I played normal hits from the 2000s that anyone would know, songs which are pretty often played at parties, stuff that people actually dance to and recognize. \n\n&#x200B;\n\nAlso I didn't initially put down her tastes, I just told her the guests didn't like it, and she kind of right away accused me of saying her music was shitty based on that, and I said I didn't, but the guests didnt like it. Either way, she came to the conclusion that I thought her music was bad. I don't think its bad, I don't like it, but music is subjective so whatever. But it definitely did not belong at a party like that.",
                  "id": 33,
                  "comments": [
                    {
                      "score": -4,
                      "content": "You assumed based off of a few people that they didn't like the music. Your bias coloured your view. Not all the guests didn't like it. You can't know that.\n\nI like hip hop music, but if you played me 2000's hip hop tunes I'd be tuning out. It just doesn't measure up for me for prior artists. But I'm polite enough at a party to not insist it's tunes I like. A beat is a beat. Easy enough to dance to.\n\nAnd again, EDM is very much urban music. Much like rap and hip hop. It's just not your music. Radio isn't playing EDM music.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "NTA. She's a drama queen, get out while you can.",
      "id": 35,
      "comments": [
        {
          "score": 5,
          "content": "NTA - tho \"get out while you can\" sounds a bit dramatic, lol. Over music? She's being dramatic for sure but they also haven't really had a chance to talk it out. I would hope that a conversation confronting what happened could clear things up and make them both feel better.",
          "id": 36,
          "comments": [
            {
              "score": 3,
              "content": "Going upstairs to pout about people not enjoying your taste in music at a party (where you couldn't possibly please everyone's music tastes) is a ridiculously childish thing to do. This is a red flag for an emotionally unstable and irrational partner. I mean, hey, have at it but don't say I didn't warn them when she purposely ruins Christmas dinner with a temper tantrum over the cranberry sauce.",
              "id": 37,
              "comments": [
                {
                  "score": -1,
                  "content": "I counter you with:\nMost the party was OP's friends.  The gf has lived there for two years and no friends to come to her party?  OP is controlling which limits her making friends. This emotional abuse is why her choice of music couldn't keep playing. Potentially the room loved her music and OP was being upstaged by gf which made him jealous. We are just getting OP's side of it and I don't trust abusers.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Well now, if most were OP's friends and she wasn't permitted parties with her friends, I'd give it you, hands down. I'm not sure that's the case. If she isn't familiar with the audience's tastes, would it not be incumbent upon her to yield the selection. After all, is the purpose of the music meant to suit her or the party on that occasion?",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -1,
                  "content": "Why was this upvoted? I’m serious. \n\nYou’re making up wild accusations, hey where did you get that psychology degree of yours?",
                  "id": 40,
                  "comments": [
                    {
                      "score": 0,
                      "content": "You've got the degree to refute it?",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "honestly she isn't typically at all, I think this was just oddly a sensitive thing for her",
          "id": 42,
          "comments": [
            {
              "score": -1,
              "content": "You've just moved in together, you are both going to test the power dynamic in the relationship. I wish you luck.",
              "id": 43,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited.***\n\nMe and my girlfriend have been going out for over a year now, we just moved in together and we decided to throw a moving in party. The party was maybe 25-40 people, I honestly couldn't count because a lot of people were coming in and going out. \n\n&#x200B;\n\nThe thing is, my girlfriend had control over the music. She was playing... kind of really bland edm-pop stuff like a edm remix of a taylor swift song and ed sheeran and stuff, and I could just absolutely tell that nobody was into it. I think this might be somewhat of an urban/suburban divide, she is from the suburbs where the radio is more popular in general. For one, most of the people there were people I knew, and I know that they wouldn't like it, but also I talked to a few of my friends and they said the music was annoying. \n\n&#x200B;\n\nI decided to ask her if I could play some music, something that was... you know, crowd pleasing (early 2000s hip hop hits, of course), and not just music that I personally enjoy, and right away you could see people get more excited from the music. About 4-5 songs later, she asked if she could play more music, and I told her yes, but play something different than what she was playing before because a lot of people weren't into it. She got a tiny bit upset at that, and she kept asking me to explain what I meant, and I just said that people didn't want to hear pop music at a party like that, and she got kind of really pissed off at me and took it as a personal attack on her music taste. I kept telling her that it wasn't me, it was more the guests. Truth be told, I didn't like it much either, and I think she could tell that it was also me, but I personally didn't CARE about the music, its more that it was mellowing out the party in a bad way because people didnt like it. She ended up getting really frustrated at me, saying that we've been dating for over a year and I never told her that I thought her music taste was bad. Like, why would I tell her that? We have different music tastes, she knows that. I think she was kind of in denial that the PARTY didn't like the music, and assumed it was entirely ME who was disliking the music. \n\n&#x200B;\n\nShe ended up going upstairs in a pout, and the next day she went to Chicago for a work trip so we have barely spoken since. I felt like an asshole the entire night. I probably shouldn't have said anything about that, it just came off like I was telling her that her music sucked, but she also kind of put me in a tough position there.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 44,
      "comments": [],
      "relation": "No"
    }
  ]
}