{
  "post content": "Title is slightly inflammatory, but oh well.\n\nMy brother (16) has a flat tire on his car. He isn’t able to fix it until next week, so he has to use a pump that he plugs into his cigarette lighter to inflate it every time he drives. This takes about 5-10 minutes. So for small errands, like running to the gas station for milk or picking up our little sister from work, I (20m) have been letting him use my car, which has a little six inch pride flag on my dash board.\n\nYesterday, after he got back with milk, he announced “I took down your pride flag.” I asked why, and he said so that no one he knew would see him with it. I rolled my eyes, but whatever. And I just asked if he put it back up.\n\nHere is where he started to annoy me. He said “No. I don’t want anyone to see me putting that up. It’s in the passenger seat.”\n\nI took a moment, before telling him that he either had to put it back up, or he couldn’t use my car. He asked if I was serious, and I said yes. He has to respect my decorations or he can’t use my stuff. I’m not saying he has to drive around with it up, but I do expect him to replace it.\n\nAbout an hour later he borrowed it again, and I reminded him of our deal. He came back and I, probably in a ruder tone than I should have, demanded to know if he’d put it back up. Our little sister (15) told me to chill, because it’s not like it’s homophobic and I shouldn’t stop him from using my car over a piece of plastic. And frankly it wasn’t until she said that that I realized how homophobic it is to refuse put someone else’s decorations back up because you can’t stand the thought of someone seeing you touch the scary gay piece of plastic.\n\n(He didn’t stand it back up, he just placed it flat on the dash. But since it’s tricky to properly place, I’ll count it as good enough.)\n\nSo, Reddit, am I the asshole for demanding that  my brother put my pride flag back up if he uses my car? I think it’s reasonable to expect my belongings to be respected, but my sister and brother think I’m being a petty tyrant.\n\nEdit/Update: It seems the consensus is that I’m NTA. And every single YTA comment boils down to either poor reading comprehension or ‘the evil gays!’. So that’s good. Some of the ESH comments made good points.\n\nI have told my brother to get a patch kit. I’ve even offered to show him how to find the hole in his tire. I can lead the horse to water but I can’t make him drink. I don’t know what he’s waiting on, but he’s waiting on something that is next week.\n\nLet me re emphasize this sentence. **”I’m not saying he has to drive around with it up, but I do expect him to replace it.”** Not once did I say he had to drive around with the pride flag flying. He has to reattach it to the vent when he’s done if he wants to drive my car.\n\nI also don’t think my siblings are raging homophobes. Yeah, my little brother was doing a homophobic action by refusing to put it up. But he’s not a homophobe, just someone who enjoys pissing off his older brother. They’re teenagers. And I can’t put up a permanent pride sticker because I use my car for work, so all the pettiness will have to die here.",
  "id": 1,
  "comments": [
    {
      "score": 6281,
      "content": "NTA it's your car and your flag. If he doesn't want to be seen with a pride flag he can spend five to ten minutes inflating his tyre.\n\nYour car your rules",
      "id": 2,
      "comments": [
        {
          "score": 3160,
          "content": "Also OP’s sister is wrong, acting like supporting gay rights is shameful is ABSOLUTELY homophobic",
          "id": 3,
          "comments": [
            {
              "score": 1228,
              "content": "Yup. The idea that he’s terrified of being seen with a gay flag is the epitome of being homophobic.",
              "id": 4,
              "comments": [
                {
                  "score": 665,
                  "content": "\"I'm terrified of being seen as respecting gay people but i'm not homophobic\"",
                  "id": 5,
                  "comments": [
                    {
                      "score": 167,
                      "content": "\"No homo phobo\"",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 24,
                  "content": "...Yes and no. In this case, very likely. But if someone is genuinely scared they'll be attacked by bigots for showing a Pride flag, I don' think that's homophobic. No more so than a gay person being too scared to come out of the closet if they live in Syria or Iran or Texas or something.\n\nWhich, as far as I can see, isn't what's going on here, so I think the sentiment you're expressing is correct. Just not exclusively so, since there are times when I think people could be terrified of being seen with a gay flag regardless of their stance on gay rights and acceptance.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 138,
                      "content": "OP has been driving with the pride flag and hasn’t been tarred and feathered, so what does their brother have to worry about?",
                      "id": 8,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "People are openly gay in Texas",
                      "id": 9,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Why would he be so upset about the thought of being seen in the proximity of a gay pride flag if he didn't think that being gay, or being perceived as being potentially gay, is somewhat inferior or shameful?",
                  "id": 10,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 0,
                  "content": "Or being afraid of being beaten, even if in this case this is unlikely.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 2,
                      "content": "1. He’s in a car. \n\n2. It’s unlikely that he lives in a neighborhood where he’ll just be beaten for having a pride flag in his car, if that were the case OP probably wouldn’t have the flag and definitely wouldn’t kind.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -9,
                  "content": "[deleted]",
                  "id": 13,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Do me a favour and Google what epitome means and we can start this conversation back up.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": -29,
                  "content": "Really? This is the epitome of being homophobic? I think you might be a little dramatic...",
                  "id": 15,
                  "comments": [
                    {
                      "score": 9,
                      "content": "No. The core presentation of being homophobic is being scared YOU will be thought to be gay. \n\nActually beating or verbally abusing gay people is over homophobic like the KKK is over racism. But being racist, or being homophobic isn’t defined by extreme or over behaviour, but by the core belief that fuels it. \n\nBeing terrified someone might think you are gay IS what homophobia is - and you don’t have to be straight to be homophobic.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": -79,
                  "content": "Y’all have obviously forgotten what it’s like to be 16 🙄",
                  "id": 17,
                  "comments": [
                    {
                      "score": 54,
                      "content": "At 16 even I wasn’t this big of an asshole",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "16 was a year ago for me, and i would *never* have messed around with someone’s car decorations. much less be friends with jerks who aren’t cool with pride flags",
                      "id": 19,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 11,
                      "content": "well, I'm 16 and I know what homophobia looks like. being scared to be seen driving a car with a pride flag in it or putting said pride flag back up bc you're just so afraid of people thinking you respect gay people is definitely homophobic",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "What, like my 16 year old trans niece?",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Nah. You just only remember being a homophobic 16 year old.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 3,
                      "content": "I wasn't a major homophobe when I was 16...",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "THIS.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "Exactly, I saw some stupid comic about this girl who said she’s fine with her gay friend but doesn’t support the LGBT movement and was all shocked pikachu face when her friends abandoned her.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "The I you. How's staying they don't want to be seen with a pride flag not homophobic?",
              "id": 26,
              "comments": [
                {
                  "score": -1,
                  "content": "\"I think someone would beat me up for it\" would just mean that homophobia exists, not that the person worried agrees with them.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 0,
              "content": "Though he is a sick, it’s not homophobic if he does not want to show a prose flag himself. Maybe he believes there is no need to show this. Maybe he has different political views. That is up to his freedom. It’s not up to his freedom to decide on his sisters things.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -1,
              "content": "Not really, I know a lot of people that support gay rights but absolutely detest gay culture and the pride flag is now associated more with the latter than the former.",
              "id": 29,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -5,
              "content": "You don’t have to be homophobic to not want people to think you are gay",
              "id": 30,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -44,
              "content": "Eh I disagree. You can support gay rights without flying a flag. Some people don't like having beliefs (or anything for that matter) in their face all the time. \n\nFor example, I can support a political candidate but still get annoyed at seeing posters/bumper stickers/flyers of said candidate everywhere.",
              "id": 31,
              "comments": [
                {
                  "score": 71,
                  "content": "It’s not the choosing to not fly a flag that’s homophobic. But OP’s brother was very clear that he specifically would be embarrassed and ashamed to have anyone see you near the visual support of gay people’s rights.\n\nHe didn’t just not buy a flag himself (which is fine). He went out of his way to remove OP’s flag from OP’s car and refuse to put it back up, because he didn’t want to be seen with something representative of the gay community.\n\n*that* is what is homophobic",
                  "id": 32,
                  "comments": [
                    {
                      "score": -38,
                      "content": "It's only homophibic if his reason for taking it down is because he dislikes lgbtq+ people.\n\nIf he took it down so that he doesn't get bullied then that's not homophobia.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 42,
                  "content": "To use your example of a political candidate:\n\nIf you don’t buy Candidate A’s bumper sticker yourself, I’m not going to assume you’re opposed to that candidate. You might just not like bumper stickers.\n\nBut if you go out of your way to remove Candidate A’s bumper sticker from MY car without my permission, because you can’t bear the thought of being seen with a car sporting a Candidate A bumper sticker, then yes, I’m going to assume you are actively opposed to Candidate A.",
                  "id": 34,
                  "comments": [
                    {
                      "score": -34,
                      "content": "Nah I still disagree. There are a lot of people that support in silence. That's why it's considered impolite to ask people who they voted for",
                      "id": 35,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "“Beliefs” get in the fucking bin",
                  "id": 36,
                  "comments": [
                    {
                      "score": -2,
                      "content": "True, beliefs isn't a good word for it. \"Cause\" I guess?\n\nRegardless my point remains. Wanting to be disassociated with a topic doesn't mean lack if support for the topic.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 327,
          "content": "Not only “your car, your rules” but he better be returning it clean and filling up the tank every once in awhile, too!",
          "id": 38,
          "comments": [
            {
              "score": 2,
              "content": "That here!",
              "id": 39,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 115,
          "content": "I don’t get why he doesn’t just patch the tire or replace it entirely? At a certain point you have to ask yourself “how much is my time worth?” Spend $50 to patch the tire and be done with it, or like an hour each week until the end of time?!\n\nEdit - (I missed the part about him getting the tire fixed next week, my bad)",
          "id": 40,
          "comments": [
            {
              "score": 48,
              "content": "Well OP said next week for a new tire so it sounds like this has only been a temporary thing.",
              "id": 41,
              "comments": [
                {
                  "score": 21,
                  "content": "Oh my bad I missed that",
                  "id": 42,
                  "comments": [
                    {
                      "score": 16,
                      "content": "No it's fine. I misread things all the time.",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "Even with the getting the tire fixed next week you aren't wrong.  I ran over a nail last year and had a leak.  Went right to the local tire place and had it patched in 30 minutes for about $20 no appointment necessary.  If brother has time and money to be running errands and worrying people might judge him for his sister's pride flag, he has time to get the tire taken care of this week.",
              "id": 44,
              "comments": [
                {
                  "score": 12,
                  "content": "Not all leaks can be patched. Last time I had a leaky tire I was told because it was on the sidewall it wasn’t fixable.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Seconded, last time I had a leaky tire, there was a spark plug sticking out of it, no f*cking clue when I drove over that 🤷🏼‍♀️",
                      "id": 46,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "[deleted]",
              "id": 47,
              "comments": [
                {
                  "score": 12,
                  "content": " > Are you saying op should just pay the money to get the tire fixed for their brother and be done with it?\n\nNo..?",
                  "id": 48,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 80,
          "content": "Stealing the top comment to tell OP that this is the time to plaster the car with Pride bumper stickers",
          "id": 49,
          "comments": [
            {
              "score": 41,
              "content": "This.... is probably exactly what I would do. Wanna take my flag down and disrespect me? Let me put multiple rainbow flags on the outside of my car that you cant remove. \n\nThen he can make the decision to drive the car or not. But it'll make him look like an even bigger homophobe when he ultimately has a fit about it.",
              "id": 50,
              "comments": [
                {
                  "score": 9,
                  "content": "Lol, at that point it would probably be easier for OP's brother to drive said car with a paper bag over his head if he didn't want to be associated with gay pride.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Rainbow wrap for the car.",
              "id": 52,
              "comments": [
                {
                  "score": 24,
                  "content": "Rainbow seat covers.",
                  "id": 53,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "NTA but your siblings are homophobic and you should call them out on it.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "The rule is to always leave something equal or better than you borrowed it... so it is not much to ask for him to replace it in position (or close to)",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Or maybe - and hear me out - going to the car shop to get the tire patched. I'm not sure how much that would cost but it is cheaper than an entire set of tires.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "Right?! Like what’s the big deal anyway? If he supports his brother then he shouldn’t care what people think. I would proudly drive around with it. OP’s siblings can find a different vehicle.",
          "id": 57,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -3,
          "content": "So you fools probably think it is OK for my dad to refuse to let me cover us his Trump 2024 sticker when I drive his car? His car his rules? Seriously?",
          "id": 58,
          "comments": [
            {
              "score": 3,
              "content": "LGBT people aren't a political movement, they're people who can't change their sexualities or genders just like anyone else. Big difference from a political thing. I'm no expert in freedom of expression or anything, just saying these two aren't alike.",
              "id": 59,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Again it's not your property it's your dad's so yes if you borrow it you accept the stickers  even if you don't agree.\n\nQuestion is if it's completely against your moral code why would you want the car anyway. Like OPs brother if its that upsetting don't drive it, don't borrow it, don't go near it.\nUse your own",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1381,
      "content": "NTA. My personal annoyance around why he’s so embarrassed to be seen in a car with a pride flag aside… it’s your car. If he doesn’t like it, he can inflate his tire and use his own vehicle.",
      "id": 61,
      "comments": [
        {
          "score": 90,
          "content": "Yeah. I'm short, so when I borrow someone's car I usually have to move the seat forward, but I move it back when I'm done because it's their car. The fact that it's over the pride flag makes it worse because it's like the brother is saying he's ashamed of OP. But even if it wasn't a pride flag, you still don't do that!",
          "id": 62,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 993,
      "content": "NTA. Even putting his homophobia aside, when you borrow someone else's property you should give it back in the same condition you found it. If he can't show basic respect for your stuff, then he shouldn't expect you to share it with him.",
      "id": 63,
      "comments": [
        {
          "score": 93,
          "content": "Exactly. OP is definitely not that asshole but the little twerp homophobic bro is.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -31,
          "content": "It's not homophobic, I'm bi and I wouldn't be caught dead with any type of flag in my car. Not lgbt, not my country's, none. I think it's weird to put flags up everywhere except inside your own house maybe as a decoration, but putting them where others can see them is just annoying.",
          "id": 65,
          "comments": [
            {
              "score": 27,
              "content": "refusing to be seen anywhere with a pride flag = refusing to let anyone think you're a part of the LGBT = homophobia\n\nI'm curious to see if OP's brother would allow any other flag on the dashboard. if yes, this behaviour is definitely homophobic",
              "id": 66,
              "comments": [
                {
                  "score": -19,
                  "content": "That's ridiculous. I'd take the flag down while I'm driving to (I just wouldn't be a stubborn wanker like her brother and not put it back up) your classification of what constitutes homophobia is ridiculous",
                  "id": 67,
                  "comments": [
                    {
                      "score": 23,
                      "content": ">I asked why, and he said so that no one he knew would see him with it.\n\nIn case you glossed over this",
                      "id": 68,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": -19,
                  "content": "What? So if I don't want people thinking I'm gay im a homophobe? This is a whole another level of bullshit.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yes? Because how is it shameful in any way for someone to think your gay?",
                      "id": 70,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "The difference here is that it's not his car - it's OP's. Taking down and refusing to replace the flag makes the brother the asshole.",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 800,
      "content": "NTA. Your brother IS being homophobic though because he doesn’t want people to SEE him touching a rainbow flag. If he wants to borrow your stuff, he can obey a very simple rule.",
      "id": 72,
      "comments": [
        {
          "score": 96,
          "content": "First and foremost, NTA\n\nWhile I agree there are some homophobic reasons towards this, it may not exactly be HIM being the homophobic one. What if someone at school saw him and they turn out to bully him relentlessly for being queer? Regardless of if that is true or not, that kind of thing can be debilitating as a teenager.\n\nWhen I was in school, I was proudly out as pansexual. All my friends knew it, I’ve known that I was into the same gender since I was a little tot for Christ’s sake. However, a girl at school found out, hounded me for years about me being a f*g, and that in turn led to me trying to do something terrible to me (don’t know if I can say anything more). There were times when I wished that she didn’t know, and that I wished she had never saw me wear a pride flag during the summer. \n\nAgain, I agree that he is being completely unreasonable, but he is a *teenager.* He’s *gonna* be a shit. And teenagers are *brutal,* dude. Definitely don’t let your brother use your car if he refuses to respect your space. But don’t necessarily call him a homophobe? He’s a kid. Teach him why this matters to you.\n\nAsk him if you went into his room and took down something of meaning and refused to put it back, would he be okay with that? Reputation aside, that is what this is. Don’t let him try to get around it, this is him not respecting you, OP. Food for thought, at least.",
          "id": 73,
          "comments": [
            {
              "score": 84,
              "content": "[deleted]",
              "id": 74,
              "comments": [
                {
                  "score": 9,
                  "content": "Yes, I agree! Homophobia is homophobia regardless of how little or small. And that’s why I had said that OP should not let him use the car. He’s not respecting them. He’s not being a decent human being. Sorry if my message came across as muddled, I didn’t proofread!",
                  "id": 75,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -423,
          "content": "[removed]",
          "id": 76,
          "comments": [
            {
              "score": 288,
              "content": ">just because you dislike a movement doesn't mean you dislike the people of the movement.\n\nWhen the movement you dislike includes things like **supporting human rights, equality, ending & overcoming oppression, etc.** that's exactly what it means.\n\nYou see people fighting for the right to be who they are and think *they've gone too far?* When you view standing up for and supporting those in the LGBTQIA+ community as '*having gone too far'...* that very much is homophobia.",
              "id": 77,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 196,
              "content": "I don't think you understand the historical significance of the pride flag.",
              "id": 78,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 158,
              "content": "omg it’s op’s brother",
              "id": 79,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 132,
              "content": "please explain how Pride has gone way too far",
              "id": 80,
              "comments": [
                {
                  "score": 86,
                  "content": "Where does it stop? Next thing you know these people will want to vote and own property.",
                  "id": 81,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 119,
              "content": "\n\n>some people think that this whole pride thing has gone way to far, \n\nyes, how dare they demand to be treated as human beings. we should stop black history month too, because having a whole month to themselves is just to much also 🙄",
              "id": 82,
              "comments": [
                {
                  "score": 43,
                  "content": "And don’t forget abolishing “women’s history month” (/s)",
                  "id": 83,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 98,
              "content": "It IS, however, pretty telling that he's so scared of someone *gasp* seeing him toucn a pride flag that he threw a fit about putting it back up after *he* removed it. That does smell of homophobia. If he just thought the movement was over the top, he wouldn't be so terrified of being mistaken for lgbtq.",
              "id": 84,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 93,
              "content": ">some people think that this whole pride thing has gone way to far,\n\nGoddamn, those queers and their request for equal rights! /s",
              "id": 85,
              "comments": [
                {
                  "score": 50,
                  "content": "Equal?? In a lot of cases let’s start with ANY rights!! 😢😢😢",
                  "id": 86,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Well, I live in Canada and, while there's still room for improvement, we're pretty much guaranteed equal rights under the law. Now we just need to get religious establishments and the general public up to speed.",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 75,
              "content": "It’s not an LGBT+ issue. Replace “pride flag” with anything else — fuzzy drive, crucifix, a “honk if you’re horny” bumper sticker, or even a (racist AF) confederate flag — and the issue is the same. If you borrow someone else’s property, you are required to respect it. If you find their property offensive, you shouldn’t borrow it. That’s it. \n\nIn a car, changing anything other than adjusting the mirrors/seat is very uncool. \n\nOP, NTA",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 40,
              "content": "I don't think you understand homophobia. Perhaps you don't own a mirror?",
              "id": 89,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "Man, that’s a lot of words to just say you’re homophobic.",
              "id": 90,
              "comments": [
                {
                  "score": -52,
                  "content": "[removed]",
                  "id": 91,
                  "comments": [
                    {
                      "score": 44,
                      "content": ">I have a problem with the fact that children are exposed to this shit\n\nThank you for confirming that you are, indeed, homophobic.",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 36,
                      "content": "How, exactly, is a flag with pretty colors inappropriate for kids?\n\nHow exactly is being queer inappropriate for kids?\n\nNo one ever says straight people existing is inappropriate for kids. No one says Jack shit about those stupid little onesies for boys that say heteronormative shit like “hide your daughters”, or straight people seeing opposite gender toddlers playing together and being like “omg look! Little Allie has a boyfriend!”\n\nKids can be gay. Therefore, Pride is appropriate for kids.",
                      "id": 93,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Spoken like a true homophobe. How is a rainbow flag harming a child? Or gay people simply existing? We have a culture that thinks it’s ok to put hyper sexualized shirts on babies “mommy just wanted a back rub” “ladies man” “daddy says I can’t date til I’m thirty” to name a couple. But oh no, it must be the gays harming our children!!! How the fuck is the pride movement inappropriate!?",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "The funny thing about this is that you just don't get it.",
                      "id": 95,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": "DING DING DING there it is!",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I agree man, it’s a big problem these days. What if my kids see a rainbow and catch The Gay? I don’t even let them go outside after it rains anymore just in case.",
                      "id": 97,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 196,
      "content": "NTA\n\n\nIt's so rude to borrow something and change the decorations and not putting it back.",
      "id": 98,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 159,
      "content": "NTA \n\n> I’m not saying he has to drive around with it up, but I do expect him to replace it.\n\nThat is the most reasonable thing I heard all day.",
      "id": 99,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 141,
      "content": "NTA, it’s not your problem if he’s too insecure to drive around with ‘a piece of plastic’ on the dashboard. \n\nIt’s your car, if he borrows it he should give it back in the exact same condition he borrowed it. It’s common decency and if he can’t respect that then he should get the bus.",
      "id": 100,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 117,
      "content": "NTA. Your rule that he replaces it is reasonable.\n\nHe's also way overestimating how much people look into other cars while driving, or how much they can see, but whatever, I guess? He IS homophobic from the sounds of it.",
      "id": 101,
      "comments": [
        {
          "score": 53,
          "content": "And what if someone should ask?  \"It's my sibling's car.\" End of story.",
          "id": 102,
          "comments": [
            {
              "score": 34,
              "content": "Fuck that. He can stand up for pride because his family is involved. OP may be LGBT+ or just an ally, and his brother can damn well be an ally too.\n\nI hate to use the cliché but if you're not for us you're against us. Taking down the flag is a homophobic act whether or not brother is actually homophobic, because he does not want to be perceived by others as an ally.\n\nOP your brother is an AH and I would superglue that flag down and force him to drive it like that or explain why he has a problem with it.",
              "id": 103,
              "comments": [
                {
                  "score": 20,
                  "content": "Well, it's pretty obvious his brother is \"against\", but we're also talking about a teenager who is homophobic enough to think just the flag's presence may ruin his chances with a chick.  He COULD stand up, but it's kinda obvious he doesn't want to.  And if he doesn't want to, he better have good walking shoes, because he shouldn't be using his sibling's car if he doesn't want to respect the car's owner.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 83,
      "content": "NTA your car & rules. \n\nI could understand not wanting to ride around with a car decorated with My Little Pony or something like that, but I can't really empathise with not wanting to ride around with a little rainbow flag that's INSIDE the car. \n\nIt's your decoration, your car and also; using your car is a favor you're doing him.",
      "id": 105,
      "comments": [
        {
          "score": 4,
          "content": "bronie!",
          "id": 106,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 48,
      "content": "NTA. You’re not being petty, this is about respecting people’s property and requests. And yes, if your brother is so bothered by a “piece of plastic” as your sister put it, he is homophobic, excruciatingly so.",
      "id": 107,
      "comments": [],
      "relation": "Support"
    }
  ]
}