{
  "post content": "My 24 f bridsemaid / cousin Ella 26 f is to be in my wedding party in June. \nThe ongoing issue is that my wedding has a blue and green peacock theme and guests have been asked to follow this colour scheme with their clothes. \nHair wasn't originally included at all in the colour scheme but my cousin Ella has natural bright ginger hair.\n\nI would never ask someone to permemnantly change their hair for my wedding,  I know that would be bonkers so I suggested some temporary hair dye, but Ella argued that she has been growing her hair for 6 years and doesn't want to risk the colour not washing out. \nI thought this was ridiculous because it literally says washes out in like 14 washes.\nBut Ella says because her hair is completely natural colour it might take strongly to her hair. \n\nSo I gave up on that avenue and suggested a wig, it is 1 day 1 single day and there are some amazing wigs these days,  I had a look on Instagram and you wouldn't even be able to tell. \nBut she said she would feel self conscious and weird wearing a wig and that because her hair is butt length that it might sit weird on her head.\nSo she won't dye it,  and won't cover it up. \nI really don't want to come across as a bridezilla but butt length flaming red hair will destroy the wedding photos,  and ruin the colour scheme completely. \n\nIm at a loss, I can't cut her from the wedding because my mom would murder me but I can't have freaking Merida ruining the photos, AITA for asking this of her for just 1 single day?\n\ntl;dr   bridesmaid has flaming red hair and refusing to hide it for one single day for my wedding that has a colour scheme it will clash with aita\n\nEDIT: Ella has dropped out of the wedding because we couldn't reach a compromise so it doesn't matter anymore. \nI now have to deal with my mom and aunt chewing me out over it all.\n\nEDIT: OK I get it jesus iata please leave it be now, I decided to link ella this post as it hit twitter and i was worried she would hear about it anyway,  we will be working to reach a compromise.",
  "id": 1,
  "comments": [
    {
      "score": 22404,
      "content": "YTA - This is her natural hair. If she had artificial coloring, I can see asking her to dye it again, but you are asking someone to change their natural hair color. Yes your wedding, but there are limits are you have exceeded the limit.",
      "id": 2,
      "comments": [
        {
          "score": 11326,
          "content": "No, even if she had artificially colored hair, you don't get to demand that someone change their hair color for your wedding. If all you care about is the aesthetic of your photos and not, you know, having your friends and family around for your big day, then just don't invite them. Or ask your photographer to photoshop their hair to a different color in the pictures. Or fucking have everyone wear hats. But you absolutely do not get to ask your guests to change their hair color/weight/glasses/etc for your wedding.",
          "id": 3,
          "comments": [
            {
              "score": 4871,
              "content": "If she asked her photographer to photoshop someone's natural hair color I'd call her an asshole too, tbh.",
              "id": 4,
              "comments": [
                {
                  "score": 2566,
                  "content": "At least not an AH who had messed up her cousin's hair, but yeah. The degree to which she's fixated on someone's natural hair colour ruining the photos is just beyond me. The only thing I can think is that the cousin is striking and she's worried she'll pull focus?  Why on earth would you want your cousin not to look like your cousin? And how is red hair going to mess with your peacock colours? Does everyone else have green hair? I'm so confused. \n\nYTA.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2230,
                      "content": ">The degree to which she's fixated on someone's natural hair colour ruining the photos is just beyond me.\n\nAnd yet she still thinks she's not a bridezilla lmao YTA op",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 103,
                      "content": "You talking about extension pixiecut^(whatever the fuck that is) lady?",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 15,
                      "content": "The ironic thing is having her cousin dye her hair would actually create the exact situation she is trying to avoid. No one would fixate on her in the photos because that's what she naturally looks like. If she dyes it everyone's first reaction would be like \"OMG she dyed her hair!\" Or \"Is that Ella? She dyed it?! She looks so different I barely recognized her!\" Having someone change a defining physical characteristic like that will cause people to fixate.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": ">The only thing I can think is that the cousin is striking and she's worried she'll pull focus?\n\nA red head dressed in blue and green? Yeah, methinks bridezilla knows she can't compete with that for attention.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "> Does everyone else have green hair? I'm so confused.\n\nYTA- Right?!  So does the bride want her bridesmaid to have  blue/green hair for her wedding or she does she want her bridesmaid to dye her natural red hair a different natural hair color??  WTF.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Exactly! YTA this is tacky and rude to ask someone to change their natural hair color.  When you asked her to be a part of the wedding party you did not mention she needed to change something she was born with.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Also I think the red would go beautifully with the wedding colors. I think the bride doesn’t want to be upstaged tbh.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 1037,
                  "content": "Also, it totally isn't going to clash. I'm ginger. Do you know how amazing I look in peacock colors? If the colors were red or orange or pink - clash city. But cool jewel tones??",
                  "id": 13,
                  "comments": [
                    {
                      "score": 1007,
                      "content": "I wonder if that’s secretly the problem. Her cousin has beautiful red hair, and will stand out amazingly in her gown making OP look less attention grabbing.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 344,
                      "content": "Came here looking for this. Blue and green are the most complimenting colours for red heads.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "That was my thought! She even references Merida in her post, who happens to wear blue/green dresses.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Agreed. As a ginger, those are my colors. \nAlso as a ginger, if someone asked this of me, I’m taking their soul.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 680,
              "content": "Completely agree with this! Butted in to add that I recently got engaged and my 22 year old sister (bridesmaid) asked me if I wanted her to dye her hair a natural colour for the wedding because it's red and might not 'look good' in pictures. I told her that it didn't matter to me, the only thing I cared about was whether she would be my bridesmaid or not. Some women get engaged and really do lose the plot on what's 'normal' to ask of their bridal party haha.",
              "id": 18,
              "comments": [
                {
                  "score": 184,
                  "content": "I dye my hair random colors frequently and asked my sister as well. She was always trying to convince me to go blonde, so she got excited and went with me to help pick the exact shade and we made a day of it. I love her, and it made for a lovely day together. I think it's fine to request a color if the bridesmaid asks.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 177,
                      "content": "Big difference if the bridesmaid is the one doing the asking.  If the bridesmaid volunteers to change their hair to suit the bride, there is nothing wrong with the bride accepting.  But for the bride to try to demand it like they are entitled to everyone caving to their every whim is bonkers.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "My sister in law's younger sister, a bridesmaid, slammed her finger in the car door the day before the wedding. She has her finger in a big cast in the wedding pictures and it's delightful. It's little things like that that make your wedding and photos look real and unique.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 614,
              "content": "When I got engaged, one of my bridesmaids had waist length dreads. Six months before the wedding, she shaved them off as part of a St Baldrics fundraiser. She asked me beforehand, and I was stunned because I would never dream of restricting what someone did to their own body. She looked gorgeous, and I was so thrilled she was part of our special day. \n\nOP: YTA. I sincerely hope no one ever tries to dictate what you have to do to your body. No one deserves that.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 389,
              "content": "I was in a wedding with vibrant blue hair. I offered to even change it because I knew the bride's family was a bit conservative, and she said \"hell no! It's your hair! I'm just gonna make sure your dress matches!\"",
              "id": 23,
              "comments": [
                {
                  "score": 42,
                  "content": "You have yourself a really good friend there.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Instead of having a wedding, it would be cheaper for these bridezillas to hire models that had the look they wanted. This is all just bonkers. Who really goes back and looks at the pictures years later? I only framed my formal pic and one of hubby and me.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2322,
          "content": "Also and extra YTA for “I can’t have freaking Merida ruining my photos”\n\nJust who does OP think she is?",
          "id": 26,
          "comments": [
            {
              "score": 833,
              "content": "Someone overdue to lose some friends, IMO.",
              "id": 27,
              "comments": [
                {
                  "score": 295,
                  "content": "With that attitude I am surprised OP has friends to begin with. I couldn't imagine even thinking to ask a friend to do that, I respect them too much for that bullshit",
                  "id": 28,
                  "comments": [
                    {
                      "score": 28,
                      "content": "Maybe she doesn’t and that’s why she had to ask her cousin to be a bridesmaid",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 382,
              "content": "Ella should invite the OP to be in her wedding party and her theme can be bald-headed bridesmaids. YTA",
              "id": 30,
              "comments": [
                {
                  "score": 34,
                  "content": " it is 1 day 1 single day and there are some amazing bald caps these days,",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Even better... just tell her that's bald theme. Make sure self and others in the party have quality bald caps to wear in the preceding days and to the rehearsal dinner. Then make sure at the wedding everyone shows up with their gorgeous locks flowing except OP - the only baldy in the wedding party. Lol",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 221,
              "content": "I agree! Plus, Merida = hair goals.",
              "id": 33,
              "comments": [
                {
                  "score": 13,
                  "content": "I'm assuming OP is just jealous because she has awesome hair",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Just my opinion here, but Merida is one of the best Disney princesses. She's a strong independent woman who don't need no man, and fought for it tooth and nail.\n\nI would be proud to have Merida in my bridal party. And actually one of my bridesmaids is 5 inches taller than me with gorgeous curly red-blonde hair and I wouldn't dream of asking her to change a single thing.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Seriously!! As a redhead like I am super offended by the OP. What is up with all the dang ginger hate out there. It’s our fucking hair! It grows out of our heads! It just is what it is and I don’t make fun of other people for their elbows and teeth and eyeballs. Yes, all us gingers are aware that our hair is a third color to coordinate an outfit with but shove off with the whole wild ginge hair will ruin my wedding aEsThEtIcS",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Also Merida's dresss is blue in the film, so how is having merida there a problem with a blue/green dress code.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "'don't want to be a bridezilla'\n\nProcessed with ridiculous requests and opinion of photos",
              "id": 38,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Jealousy never looked good on anyone least of all a future bride.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "She's a petty child that needs to grow up.",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1369,
          "content": "YtA, but I think you don't realize how impossible what youre asking is.  I have just about this colour hair and I will never die it, because it is very difficult to get back to the same colour.  I have several friends with this hair and NONE of us would ever die it.\n\nRed hair dies poorly, and often does not come out the colour anticipated, often with a greenish hue.  It also often has a thicker shaft, which also effects the dying.  She would never be able to die her hair back to the roots as they started growing in because natural red hair is very hard to colour match, so she would have this horrible fading brown with roots growing in, even if she used this temporary.  Not to mention damage from the chemicals\n\nWigs are hot, sweaty and uncomfortable, and you will seem like a giant asshole to everyone who asks what happened to her beautiful red hair and she says \"oh the bride thought I would ruin pictures\"\n\nPractical solution - put her hair in an updo or back of the neck bun that will be less obvious in photos",
          "id": 41,
          "comments": [
            {
              "score": 434,
              "content": "Cue Anne Shirley accidentally dying her hair green with black hair dye...",
              "id": 42,
              "comments": [
                {
                  "score": 26,
                  "content": "I always thought the guy who sold it to her gave her a bad hair dye, never knew it was a side affect of being a redhead.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 21,
                      "content": "Well and there is iron in the water in PE (that is WHAT makes the soil red). So that might have been a factor too.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "Literally just watched that scene the other night. I rewatch that miniseries every other year.\n\n\nEdit: I should read the book one of these days...",
                  "id": 45,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Please do. This series is one of my favorites",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 375,
              "content": "As a red head that has willingly colored my hair, you are absolutely right. I've only used temporary dyes and never use bleach. The color usually comes out different from the box, and in some spots can takes months to wash out/grow out.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "Natural strawberry blonde here. I dyed the underside of my hair purple once and it lasted for about 2 years, when it was supposed to wash out within 14 washes. I eventually had to cut it all out to get it out. If the ex-bridesmaid had been growing it out for a while, she absolutely would not risk this happening to her",
              "id": 48,
              "comments": [
                {
                  "score": 9,
                  "content": "I bleached parts of my hair and dyed it a blue (which fades to green). It has been nearly 5 months and the green is still there! \n\nAlso, this was so upsetting to read, treating someone's natural hair color as an affront to your color scheme is gross.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "I have a shade of curly dark red/auburn hair that is a color that I've rarely seen on anyone else. I've been told before my people that they wish they could dye their hair this color but haven't been able to do so successfully. \n\nThere is absolutely no way in hell that I would ever dye my hair because I'll never be able to restore the original color, and I'm definitely not going to do it for someone else.",
              "id": 50,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I’m a natural redhead and my hair will only take hair dye if it’s left on for a long time or it is bleached. And it comes out very uneven. \n\nNever mind that the first thing that comes to mind with all this is that matching a peacock theme means blue or green hair. \n\nI don’t get any of this. I was married 1.5 weeks ago. People worried about upstaging somehow. I was just like, dude. I’m the one in 8 skirts and loads of pearls. Not gonna happen.",
              "id": 51,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "I have naturally red hair and dyed pieces in the back underneath blue or teal sometimes. No bleach, temporary, just for fun hair color. I haven't touched up in 2 years and it hasn't washed all the way out still. Or grown out. Why are brides so insane about other people taking away focus jfc? No one cares.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Natural red head here. I 100% agree It took me 7 years to grow out my natural hair and color from dying it. Red is hard to color and almost every red head I know who has died their hair had to just wait and grow it out to get their natural color back.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Add too it with wigs, you have to be able to lay all of your hair flat underneath the wig. And that would be next to impossible with waist length hair.\n\nHigh quality wigs aren't hot and sweaty, but they are crazy expensive. I'm willing to bet OP would have made her cousin spend the several hundred dollars on a wig she'd never even use again.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 697,
          "content": "It reminds me of Jane Eyre where at Lowood they make Helen cut off her natural curls because Mr. Brocklehurst thinks it’s too vain. Don’t be a Brocklehurst. YTA.",
          "id": 55,
          "comments": [
            {
              "score": 242,
              "content": "Or when Anne dyes her hair green because Gil calls her carrott!",
              "id": 56,
              "comments": [
                {
                  "score": 158,
                  "content": "Who doesn’t want to be a raven haired beauty, like Diana?",
                  "id": 57,
                  "comments": [
                    {
                      "score": 83,
                      "content": "That was my favorite book as a kid. I'm SO MUCH like Anne, and I have nut-brown hair. I used to pray at night for there to be a way to trade with her because I always wanted red hair SO BADLY.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 139,
              "content": "Upvote for Brocklehurst. OP is totally Brocklehursting.",
              "id": 59,
              "comments": [
                {
                  "score": 12,
                  "content": "Yeah she needs to hurst waaaaay fewer brockles than she currently is.",
                  "id": 60,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I am going to try to find a way to wedge the admonishment “don’t be a Brocklehurst” into every conversation I can henceforth.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 537,
          "content": "The worst bit about it being her natural hair is that the cousin is *right* to be worried about \"temporary\" dyes. They're rarely temporary. Just because the package says 14 washes, doesn't mean it will. Frickin manic panic stays in my hair indefinitely. I've had pink in my hair since I last bleached it a year and a half ago and while most has grown out and been chopped off, I've still got patches of now coral but still noticeably pink hair. If it'd been my natural used-to-be-red-before-grey it'd probably *still* be pink.",
          "id": 62,
          "comments": [
            {
              "score": 327,
              "content": "[deleted]",
              "id": 63,
              "comments": [
                {
                  "score": 35,
                  "content": "Yes!!  I dyed my natural honey blonde hair a \"temporary\" dark brown.  Predictably it washed out to a mousey cooper-brown which took 2 YEARS to grow out.  With that weird, light roots, dark ends the whole time.  \n\nNever again.",
                  "id": 64,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "I nearly screamed.\n\nFWIW - I find that the cheap drugstore temporary dyes (not the ones that need developer) do actually wash out on bleached white hair pretty quickly if you dilute them with conditioner. However they're all fashion colors.",
                  "id": 65,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "14 washes on my hair is actually more like 6. I know people for whom 14 washes might as well be permanent. OP has obviously never used hair dye.",
                  "id": 66,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "This happened to me when I put some teal panels in my hair. Literally still had a teal sheen to them when I dyed my hair a deep brunette color months later. If OP is so certain the dye will wash out in two weeks, maybe she should do a trial run on her own hair before making her bridesmaid do it.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 350,
          "content": "Absolutely, plus, temporary hair dye is still some-what damaging to your hair, although not as much as permanent. If my hair was all natural, I would not want to take the chance on something that could pose some damage to it.",
          "id": 68,
          "comments": [
            {
              "score": 164,
              "content": "I tried one of those on my natural brown hair. One year later half my hair still has a different hue.",
              "id": 69,
              "comments": [
                {
                  "score": 160,
                  "content": "I used a “temporary” (wash out in 28 washes) dye in college and it lasted at least a year. Temporary my ass.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 130,
                      "content": "They are only temporary if you want them to last. If you really want temporary, it won’t wash out!",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I highlight my hair now to get a more silver/ashy blonde, but I'm a natural brassy yellow blonde, and I wouldn't touch any temporary dyes even before I started highlighting my hair. It'd *never* wash out and I'd have to get it fixed by dying it back to my original color. Hell those colored hairsprays would take two or three washings to get the tint completely out and those were supposed to wash out immediately. I used Manic Panic once to put a pink streak in my hair, and while it lost the vibrant neon pink color, there was still an obvious streak of slowly lightening pink in my hair for a long, long time.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "The boxes really mean that it's only the color you want temporarily, after that you're stuck with whatever it fades to. Very misleading advertisement.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 218,
          "content": "Not only is it her natural hair, which looks beautiful, she also insisted on getting a wig. Some people might even find that degrading as she would have to answer everyone’s question at the wedding that she knows. Super YTA.",
          "id": 74,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 188,
          "content": "BRIDEZILLA",
          "id": 75,
          "comments": [
            {
              "score": 9,
              "content": "Cousin dodged the Bridzilla bullet. For the OP's next wedding she plans on a jail theme where everyone in the wedding partywears orange and shaves their heads. But don’t worry, they can wear wigs after til their hair grows back!",
              "id": 76,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Nope. My best friend had bright orange hair on the day of my wedding and my colors were pink and green. I would’ve never thought about asking her to pick a color based on my colors. \n\nShe is now gone and I look at those photos with the amazing memories of having had her there that day. \n\nIf hair color matters more to the bride than the love of that person they shouldn’t have asked them to be a bridesmaid. \n\nYTA OP. You deserve your mom and Aunt being pissed at you.",
          "id": 77,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Okay, i have had dyed hair for 6 years now. For my first sister’s wedding, i was allowed to have bright green and purple hair. It didn’t ruin the photos, I didn’t stick out, everyone was happy and life was good. Now my other sister is getting married. And she’s asking me to dye my hair. As someone who has been dyeing her hair for so long, i can confidently say that those “14 day dyes” never last for just 14 days. Depending on hair type, health, etc, they can take a much stronger hold of the hair, and they almost always leave a tint. Before i even started dyeing my hair, my naturally colored haired friend used a brown one. It lasted for four freaking months. Not to mention, there’s a reason this girl has grown her hair down to her butt and kept the bright red. It’s her hair. It’s a big part of her appearance. She likes it, it’s what she’s comfortable with. If she wants to hide her hair so bad, ask her to do a style that hides it in the back for photos like a braid or a pulled back sort of thing. OP, YTA.",
          "id": 78,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17317,
      "content": "YTA she's hotter than you huh",
      "id": 79,
      "comments": [
        {
          "score": 5310,
          "content": "Bingo!!  Someone's jealous and a complete nut.",
          "id": 80,
          "comments": [
            {
              "score": 3245,
              "content": "Becca, I'm going to need you to wear this Davey Crockett 'Coonskin hat or, like, I don't even want you there, betch",
              "id": 81,
              "comments": [
                {
                  "score": 426,
                  "content": "To be fair, Becca would be insane not to wear that hat.",
                  "id": 82,
                  "comments": [
                    {
                      "score": 35,
                      "content": "My real name is Becca and I’d fucking rock the shit out of that hat and at the same time make you fucking regret it.",
                      "id": 83,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 505,
              "content": "[deleted]",
              "id": 84,
              "comments": [
                {
                  "score": 32,
                  "content": "I am a redhead and let me tell you that so many people touch it without even asking",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 26,
              "content": "Like orange hair would totally work PERFECTLY with those colors.",
              "id": 86,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2295,
          "content": "I think it was \"freaking Merida\" that gave it away...",
          "id": 87,
          "comments": [
            {
              "score": 957,
              "content": "Yeah, as a naturally curly ginger here, fuck OP. She's an insecure asshole and needs to remove the massive stick from her bridezilla ass. YTA.",
              "id": 88,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 914,
              "content": "Yeah she’s a huge asshole just for that line",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 383,
              "content": "“Would jer ahccept jer fayte??”",
              "id": 90,
              "comments": [
                {
                  "score": 103,
                  "content": "MOM ITS JUST ME BOW",
                  "id": 91,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "Laughed out loud. My boyfriend and I say this to each other all the time in the stupidest voice possible",
                  "id": 92,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "LMAO I was not ready for this",
                  "id": 93,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 314,
              "content": "I had to google Merida, because my kids are all adults now and I haven't seen a Disney movie in a dog's age. That's beautiful hair.",
              "id": 94,
              "comments": [
                {
                  "score": 232,
                  "content": "Right?! I'm a straight lady, but butt-length naturally brilliant red curls....OP's cousin is hot as hell.",
                  "id": 95,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "Lol Everytime I watch Brave I just stare at awe of her hair.",
                  "id": 96,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "My girl looks like Merida, I'd never let anyone change her beautiful hair color",
              "id": 97,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 813,
          "content": "Oh without a doubt. OP sounds insufferable. She tried to frame this as just her wants but toward the end she’s just shitting on her cousin (“freaking Merida”). This is 100% the cousin being prettier than OP and OP wanting to change the cousin’s appearance to feed her own inferiority complex",
          "id": 98,
          "comments": [
            {
              "score": 51,
              "content": "I wonder if OP got left by a guy for a redhead or dated somebody that was into them. Heck, maybe her fiance has even commented on the cousin's hair being cool.\n\nI had a boyfriend when I was 19-21 that had a thing for redheads (which I am not). He was a jerk that would check out other girls when he was with me and I was always insecure and somewhat threatened by redheads because of it. I've since realized he was just a tool and he probably couldn't have gotten half of the redheads he drooled over anyways. Might explain OPs issues though.",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 444,
          "content": "Absolutely. Think how gorgeous a redhead would look in that color scheme.",
          "id": 100,
          "comments": [
            {
              "score": 290,
              "content": "Merida is LITERALLY wearing that color scheme in the movie.",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 276,
          "content": "My first thought when I saw that it was 100% her natural hair color",
          "id": 102,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 30,
          "content": "Found the true answer.",
          "id": 103,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "That was exactly my thought. \"Ruin\" the photos with her natural, long, unique hair that sounds beautiful. Sounds like bride is afraid someone might steal the show",
          "id": 104,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 28,
          "content": "yep, and that red hair will look amazing against those colours.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "That's what I was thinking. This screams insecurity",
          "id": 106,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 24,
          "content": "Yup I bet the cousin gets a lot of attention for having natural, very long, untouched red hair. She probably gets regularly complimented on it by strangers. To me her hair sounds extremely beautiful and attractive. OP was probably seething at the idea of someone in her bridal party getting noticed throughout the night and taking attention away from her. \n\nSelfish and gross Bridezilla behavior, I had to re-read her post to make sure I was seeing things right. Glad to see the edit that her cousin doesn’t have to deal with her insanity now.",
          "id": 107,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11349,
      "content": "YTA. \n\nI thought she was going to have some sort of comical Crayola shade of red hair. She has gorgeous, natural virgin red hair. It's beautiful and completely natural. Nothing about her hair is \"flaming.\" It's not even particularly red, more like a deep strawberry blonde. This is just bizarre. You're a bridezilla like 17 times here. Idk what's behind this weird insecurity about someone's natural hair color, but you are absolutely the asshole for making such ridiculous demands. Your wedding guests shouldn't need to adhere to a strict dress code color scheme and people shouldn't be asked to subdue their natural hair color or other traits outside of your control. JFC it's not even like her hair is purple!",
      "id": 108,
      "comments": [
        {
          "score": 2098,
          "content": "I know right?!? From just the title I definitely thought the cousin would have had some sort of gatorade blue or bright green hair, which would be somewhat more acceptable to ask to change, if not still kind of weird. That is a totally natural hair color. She’s insufferable.",
          "id": 109,
          "comments": [
            {
              "score": 1297,
              "content": "No, even if she had artificially colored hair, you don't get to demand that someone change their hair color for your wedding. If all you care about is the aesthetic of your photos and not, you know, having your friends and family around for your big day, then just don't invite them. Or ask your photographer to photoshop their hair to a different color in the pictures. Or fucking have everyone wear hats. But you absolutely do not get to ask your guests to change their hair color/weight/glasses/etc for your wedding.",
              "id": 110,
              "comments": [
                {
                  "score": 680,
                  "content": "For real! My cousin had like, purple and blue hair for my wedding and it def clashed (in actually a pretty cool way) with her green dress and I gave not one single fuck. I wanted my best friend there???",
                  "id": 111,
                  "comments": [
                    {
                      "score": 167,
                      "content": "I've got blue and purple hair rn and I'd be so hurt if my friends gave me any trouble for my colour choice. \nAt most they can talk to me about what colour I'm choosing for the time I'm dyeing prior to the wedding",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Ha! My hair actually wound up matching one of my dresses in a past wedding.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 462,
                  "content": "100%. It is *always* bridezilla behavior to try to get someone to change their **physical** appearance.\n\nIt is standard to dictate what the bridal party *wears* but that's where it stops.\n\nPhysical appearance should be 100% off limits.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 28,
                      "content": "I was forced to shave 8 months of beard for my brother's wedding. Everyone thought I was the ass hole for not wanting too.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 153,
                  "content": "Asking the photographer to Photoshop the hair is still an asshole move.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Yeah, but it's way less of an asshole move than trying to force the person to dye their hair. For that matter, OP could just get the pictures of her bridal party developed in black and white; then the color won't matter at all!",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I agree, which is why I said “somewhat more acceptable” and “to ask” politely, not “demand”. One of my bridesmaids had neon pink hair and my aunt told me to ask her if she would dye it a more “socially conventional” color. I didn’t because I didn’t care, but I can see why some more traditionally minded people might consider it.",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 552,
              "content": "I feel like the ONLY acceptable way to ask, is if your friend constantly cycles through different bright colors for her hair.\n\nTHEN, you could say, \"Hey, your hair is cherry red right now, and it was turquoise green last month. Do you think that six months from now, at my wedding, you might consider having bright green or blue hair? You know, peacock theme. Run with it.\"",
              "id": 119,
              "comments": [
                {
                  "score": 395,
                  "content": "*And even then you would have to be willing to take \"no\" for an answer.*",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 61,
                  "content": "That’s what my sisters-in-law did. I change my hair color all the time so she asked if I would have blue since it was one of the colors for the wedding. And she was super cute about. I didn’t mind the ask at all because it’s a color I’ve done before and because she made it clear that it was completely fine if I said no.",
                  "id": 121,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "This. My sister knows I like aesthetically pleasing colour schemes and every month her hair is a new colour I've never seen before so for my grad a few years ago when we outfit shopping for my fam (we got family photos done as well) I mentioned her dying her the colour of the dress she bought. She said yes because it was pastel but ultimately it was her choice. I didn't demand she change it.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 178,
              "content": "Ditto.  I was imagine Ariel from “The Little Mermaid” and got Anne Shirley instead.  And the red head is right- people with that color and probably texture have to be careful with hair dyes because they tend to stick more to the texture of red hair, which tends to be drier.",
              "id": 123,
              "comments": [
                {
                  "score": 79,
                  "content": "If she was Ariel from the Little Mermaid, it would be just as insane. I've got butt-length Ariel-red hair, and nothing on this planet could get me to change that. Bright red dyed hair is a pain in the ass to maintain, it fades extremely easily, it's hard to get the vibrancy without bleaching the hell out of your hair, it requires intensive upkeep. To ask someone with hair like that to put blue dye anywhere near it? Oh hell naw.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "My daughter was Anne of Green Gables for Halloween in fourth grade. I used a temporary rinse to dye her honey blonde hair red like Anne’s. It lasted MONTHS. Fortunately it was a very natural look on her; the teacher remarked “I never noticed how red DD’s hair was before.”  I didn’t enlighten her. But I totally agree that due to the unpredictability of the products (and to kindness and consideration) no one should force anyone to make hair changes— dyes or cuts—for a wedding, no matter how temporary they claim to be.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "She called her cousin Merida ffs.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I glazed over the first sentence while getting ready for work and thought her cousins hair, not the theme, was peacock blue and green...\n\nEven so, asking too many changes of a person is just picky.  And its frankly rude when it goes this far.  I'm in a friends wedding this year, and she wants me to cover parts of any tattoos that will poke out of my dress a little bit (I have sternum and front of shoulder that count) so it doesnt look bruisy, and keep my hair natural.  Thats it.  And I am ok with it because I understand why.  If she started zilla-ing on me, her and I would be having a long talk..",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 651,
          "content": "I’m presuming OP is a troll from all their responses, but I’ve been in a wedding where the dresses were peacock colored. The bride and half of the bridesmaids were blonde. The MOH and the rest of us had varying shades of natural red hair. The colors suited everyone and no one can miss the bride in all our group photos.",
          "id": 128,
          "comments": [
            {
              "score": 221,
              "content": "I used peacock colours - for the bouquets and the decor, not the HUMAN BEINGS!!!",
              "id": 129,
              "comments": [
                {
                  "score": 51,
                  "content": "Same here. It’s cool to hear that other people used it too. Jewel tones FTW.",
                  "id": 130,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 119,
              "content": "I hope so. Looking at the color theme (I'm guessing green and blue) she'll look beautiful. No clashing.",
              "id": 131,
              "comments": [
                {
                  "score": 117,
                  "content": "I was thinking the same thing. The red hair would look beautiful with blue and green (Source: have red hair and look bomb in green). Maybe OP is just jealous",
                  "id": 132,
                  "comments": [
                    {
                      "score": 32,
                      "content": "This is what I was thinking. I mean, if you look at Merida (the comparison the OP gives) and imagine a blue and green dress, that's a very nice picture.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Those colours are some of the best suited for red hair. Like wtf is OP thinking. Is she just jealous/worried she won't stand out.",
                  "id": 134,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 51,
              "content": "Right. Beyond being an absurd issue to take, her objections make no sense. Jewel tones typically look beautiful on redheads.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "I had just commented that red hair looks amazing with blue and green, especially when it's bright! Just look at [Jessica Chastain](http://www3.pictures.zimbio.com/gi/Disappearance+Eleanor+Rigby+Premiere+67th+Wtx2p0rvqkdx.jpg). Sounds like OP is worried that people might look at anyone but her the whole night..",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 325,
          "content": "Also... completely ignoring how rude OP was to her cousin, red hair and deep blue/green are actually an AMAZING color combo and don't clash? Look at Jessica Chastain in [blue](http://www3.pictures.zimbio.com/gi/Disappearance+Eleanor+Rigby+Premiere+67th+Wtx2p0rvqkdx.jpg) and [green](http://www.yournextshoes.com/wp-content/uploads/2016/01/Jessica-Chastain-National-Board-of-Review-Louboutin-1.jpg). \n\nSounds like OP is more concerned about her cousin standing out in any way and \"taking the focus off the bride\".",
          "id": 137,
          "comments": [
            {
              "score": 23,
              "content": "My first thought!!!! The cousin definitely will outshine the bride",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "Nail on the head.",
              "id": 139,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 74,
          "content": "Seriously. I was thinking some crazy tie dye looking hair and all we're talking about is a redhead.",
          "id": 140,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "The cousin just posted, her hair is beautiful! https://www.reddit.com/r/AmItheAsshole/comments/ezb2co/wibta_if_i_refused_to_attend_my_cousins_wedding/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
          "id": 141,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "I’m betting the weird insecurity has less to do with the cousins’ hair messing up her color scheme, and more to do with the cousin’s hair being prettier than the brides. \n\nbtw I normally hate when people jump to saying someone sounds jealous over things that can easily be explained by them simply not liking it....but the way OP keeps angrily trying to convince the audience there is something inherently wrong with her cousin’s hair  ‘I.e can’t have a mermaid running around ‘ is just so bitter.",
          "id": 142,
          "comments": [
            {
              "score": 8,
              "content": ">btw I normally hate when people jump to saying someone sounds jealous over things that can easily be explained by them simply not liking it\n\nMe too. I *hate* that! It wasn't until I saw the picture example coupled with the language used that I felt it came from a place of weird jealousy. It doesn't seem like the OP is jealous of this specific cousin as much as redheads in general, though. Given how some cultures are still super anti-redhead, I do wonder what the root of this drama really is.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": "She mentioned having “Merida” running around her wedding.\n\nThis girl is a jealous troll, and I’m amazed there are women willing to stand with her after that.\n\nImagine telling someone they clash with the stupid decor.",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "I'd kill for hair naturally that color. Its fucking gorgeous.",
          "id": 145,
          "comments": [
            {
              "score": 17,
              "content": "Was there a picture somewhere in the thread that I'm missing?",
              "id": 146,
              "comments": [
                {
                  "score": 17,
                  "content": "There was an example pic in the post. It was edited out (probably because it was working against OP). It was really lovely natural red/strawberry blonde hair.",
                  "id": 147,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Those 'temporary' hair colours don't always fully wash out, either. One of my kids used a red one 2 months ago and her hair is still much more red than it was before. What an insane request!",
          "id": 148,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "THIS! YTA so hard. I can’t even believe you did this.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9635,
      "content": "YTA. A peacock color scheme would look just fine with that shade of red hair. If anything, it'll make the dress colors look more vibrant. If she wears her hair up, the emphasis will be on the color scheme, not her hair. You don't ask a natural redhead to dye their hair for one day. You don't ask a woman with super long hair to stuff it into a wig. \n\nAre you sure you're not worried she'll look better than you because of her hair?",
      "id": 150,
      "comments": [
        {
          "score": 3200,
          "content": "> If anything, it'll make the dress colors look more vibrant. \n\nThis is exactly what I thought. It will look beautiful. Perhaps that is the real problem.",
          "id": 151,
          "comments": [
            {
              "score": 1788,
              "content": "[deleted]",
              "id": 152,
              "comments": [
                {
                  "score": 168,
                  "content": "I can't believe there are people actually like this.  \n\n\nI mean, apparently there are, but how skewed do your priorities have to be...",
                  "id": 153,
                  "comments": [
                    {
                      "score": 22,
                      "content": "I don't understand it either. Like, it's your wedding day - you're going to be the center of attention no matter what. You're the bride for goodness sake. \n\nAnd if someone does completely \"show you up\" they'll be gossiped about and seen as an asshole, not admired.",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 138,
                  "content": "Yup",
                  "id": 155,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 28,
                  "content": "So does green! It’s literally usually the color of their eyes as well. Green with red hair is amazing. It’s all jealousy",
                  "id": 156,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1497,
          "content": "As a redhead myself, I can tell you that we look amazing in peacock colours.\nOP is just jealous of her cousin and is scared that she will draw attention away from her. OP is definitely TA.",
          "id": 157,
          "comments": [
            {
              "score": 381,
              "content": "I'd have more sympathy for OP if they were honest about their reasoning. Hiding behind 'It'll clash!' isn't working out.",
              "id": 158,
              "comments": [
                {
                  "score": 409,
                  "content": "Well, it'll clash with OPs self-esteem...",
                  "id": 159,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 27,
              "content": "So jealous she can't see straight. She's probably watched people (namely in their family) fawn over her cousin's hair and can't stand it. \"Freaking Marida\" is the only proof you need of her obvious jealousy",
              "id": 160,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Also natural red head (who last week cut off a foot of hair!), we look our best in peacock colours! Blue, green, turquoise, hints of purple?! Perfect on us.",
              "id": 161,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Thanks for clarification because every time I pictured it in my head, I thought it looked fine so I figured maybe I had the wrong colors.",
              "id": 162,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 709,
          "content": "Peacock green and blue and red hair? She'd look terrific in that. Better than you, I'm guessing.\n\nMan, if I got wear those colors as a bridesmaid I'd probably dye my hair Scully red to make me look fabulous.",
          "id": 163,
          "comments": [
            {
              "score": 170,
              "content": "' Man, if I got wear those colors as a bridesmaid I'd probably dye my hair Scully red to make me look fabulous.'\n\nDude, same.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 134,
          "content": "Was a wedding photographer for 10 years. I can confirm that that bridesmaid would look absolutely stunning with that hair in those colors; I always loved coming across someone on the wedding day with natural red hair because they photograph so well.\n\nDefinitely think OP is a little worried about being outshined.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Color complements are things. OP doesn't actually care about composition, she just knows that \"Merida\" is prettier than her and wants to feel like she has one up on her.",
          "id": 166,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "This was my thought as well. Bride is worried she will look better and the attention will be on her.",
          "id": 167,
          "comments": [
            {
              "score": 9,
              "content": "Now I wonder what's stopping the bride from dyeing HER hair? HMMMM.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "She absolutely is worried the bridesmaid would look better. It’s not about the color at all, OP is lying. If it were why would OP have asked her just to cut it as a compromise? When OP said in a comment that she asked the other girl to cut her hair she shot herself in the foot and made it completely obvious that this is all about how beautiful the other girl’s hair is. Case closed.",
          "id": 169,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "The cousin is definitely way more attractive than OP. 100%. This whole post reeks of jealousy.",
          "id": 170,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "Yea man, blue and orange are complimentary colors! Their juxtaposition makes both colors seem more lively and vibrant.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "That last part is exactly what I was thinking lol",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9303,
      "content": "YTA. It’s her natural hair for heaven sake! Plus, dying red hair is notoriously difficult, and frequently red hair doesn’t return to its natural shade after dying it. Her red hair isn’t going to ruin your color scheme. Get over yourself; you’re being unreasonable.",
      "id": 173,
      "comments": [
        {
          "score": 1587,
          "content": "My brother has a similar shade of hair, has tried dyeing it multiple times and it always ends up looking dull and fake.  Also,  dyeing butt-length hair is a ton of work, that's like 2 to 3 boxes of 'box dye' or well over $100 at a salon.",
          "id": 174,
          "comments": [
            {
              "score": 989,
              "content": "> well over $100 at a salon\n\nI highlighted/dyed my slightly longer than shoulder length hair at a *Hair Cuttery* once (with one of their discount packages) and it put me out over $200. Butt length hair is going to be a massive expense to color anywhere for sure.",
              "id": 175,
              "comments": [
                {
                  "score": 471,
                  "content": "My hair is slightly longer than yours and anytime I’ve tried having professionals dye it it ranges from $300-$600 because I have thick hair and they need 4-6 things of bleach minimum. Brides are insane for thinking they can ask someone to take on a huge expense and damage hair that could take a decade to grow back to the state it was in beforehand. I finally gave up on dying my hair, the expense and damage just wasn’t worth it and it’s taken me 4-5 years to grow it out to my shoulders again. I can’t imagine what waist length hair would take.",
                  "id": 176,
                  "comments": [
                    {
                      "score": 26,
                      "content": "My hair is short, like 2-3 inches on one side and just above chin-length on the other.  Getting my hair dyed and trimmed is nearly $200.\n\nButt-length hair?  I’d have to declare bankruptcy!",
                      "id": 177,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 245,
              "content": "I work at a salon and I can tell you at my place, it would be well over $350.",
              "id": 178,
              "comments": [
                {
                  "score": 13,
                  "content": "Makes sense, it's a lot of work and a lot of hair to cover.",
                  "id": 179,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Natural redhead here. \nHairstylists usually won’t agree to dye naturally  red hair (or I’ve never met one who will). \nRed hair is naturally thicker than other hair colors as well. So more boxes of dye. \nRedheads (or maybe just me) would also be more sensitive to ingredients in the dyes. \n\nWhy invite a natural redhead to your wedding if you don’t want the package deal? So weird.",
              "id": 180,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Lol $100. I got a balayage at a mid priced salon with my slightly past shoulder length hair and it was about $300. Now, I have incredibly thick hair, but still. Dying red hair down to her butt, the whole thing? That could easily be $500, depending on where she lives.",
              "id": 181,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 629,
          "content": "Hairdresser here! If this girl colors her hair she will like never be able to color it the same properly again and will literally have to grow it back out and cut the artificial color off in order for it to be the same ever again.",
          "id": 182,
          "comments": [
            {
              "score": 98,
              "content": "My cousin had the same colour hair as a kid. She dyed it black as a teenager then bleached it blonde and maintained the blonde for years. Her hair has never recovered to the same colour it was. OP is asking someone to risk destroying their hair over 1 single day",
              "id": 183,
              "comments": [
                {
                  "score": 28,
                  "content": "Actually, hair color changes with age a bit naturally, so that might be the partial reason for no longer having the same color. \n\nBut yes, I wouldn't risk coloring drastically for one day as well, even with \"washable\" hair color (I have below waist light strawberry blonde/honey hair, but roots are losing the intensity of the color with age (not getting white, but simply darker/muted/gray-er, like lowered saturation), and visibly brighter lower).\n\nOP YTA bridezilla.",
                  "id": 184,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "[deleted]",
              "id": 185,
              "comments": [
                {
                  "score": 20,
                  "content": "Which is a shame, bc I loved her with red hair.",
                  "id": 186,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "I dyed my natural dark blonde, waist length hair to a medium/dark brunette with a 'semi-permanent' dye. The colour took well, too well in places. It didn't all wash out, and I was left with a ring of dark dye around the roots and crown. Emded up going to a salon and having them dye my hair blonde to cover up the ring, which then needed maintenance and years to grow out the permanent dye! \n\nSemi permanent dye is not as simple as 14 washes and then it's gone.",
              "id": 187,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6369,
      "content": "YTA.  As someone with \"flaming red hair,\" there are about a hundred things I would say to you about this, but 99 of them would probably get me banned from this sub; so I'll just say you're in the running to be America's Next Top Bridezilla.",
      "id": 188,
      "comments": [
        {
          "score": 772,
          "content": "follow readhead here, feel the same way",
          "id": 189,
          "comments": [
            {
              "score": 382,
              "content": "You can both come to my wedding!",
              "id": 190,
              "comments": [
                {
                  "score": 193,
                  "content": "YAY!!!!!!",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Will it be Little Mermaid or Brave themed?",
                  "id": 192,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "But can they bring their natural hair colour?",
                  "id": 193,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 13,
                  "content": "When is it? I'm ginger and love weddings.",
                  "id": 194,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Is the colour scheme \"red\"? Will I have to gingerify myself to be able to come?",
                  "id": 195,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Agreed, redheads band together! Temp dye lasts up to a couple months in my hair, and it’s never the same, I would freak.",
              "id": 196,
              "comments": [
                {
                  "score": 16,
                  "content": "I got surprisingly angry reading this. Fellow redhead.",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Auburn hair here.\n\nSo, so much this.\n\nHer hair will look abso-bloody-lutely amazing with those colours!\n\nAlso, I actually dye some of my hair emerald green. I have to bleach it first. Normally bleach has to be left on for 45 mins. I have to leave 40 vol bleach on for 1 1/2 hours! Fortunately, as I only dye a few small sections at the front, I only bleach my hair twice a year so the damage is minimal. \n\nDyeing red hair is not easy. You can not use wash in/wash out dyes ever. Believe me, I tried when I was a teen, they just don't take.",
          "id": 198,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "\nFrom her spelling of color (colour) more like the Commonwealth’s Next Top Bridezilla. \n\nThis is the one time it’s not America’s fault.",
          "id": 199,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "Male redhead here, and I can't fathom someone asking me to dye my hair for their wedding photos. It's like — that's who I **am**, and if you're forcing me to change my appearance, why do you even want me in the photos at all?",
          "id": 200,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Same as a fellow natural red with the my color being similar to the picture she attached an it also being long no way would I change it . She is definitely in the flipping wrong",
          "id": 201,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Right??? There’s a literal plot point in a chick lit book I keep reading where the ‘mean’ character makes a fuss about one of her bridesmaids’ hair colours! Also, if red hair isn’t the PERFECT shade to complement this peacock theme...",
          "id": 202,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "From the title I wasn't expecting natural hair color, I was expecting hair like mine, vibrant, blue gradient to green. Not to say ginger hair isn't vibrant, but the wording led me to believe it wasn't natural. I could see asking me to dye my hair or wear a wig, (I can't wear wigs my hair is too long I have to do the pin curl method and then the pins stick me all night I bare it and my hair is at least a foot shorter than the girl OP is being a jerk to) but not someone's natural hair. They didn't do anything to it, so why do you think you can decide that, OP?",
          "id": 203,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Agreed! Also a red head. I'd be fucking livid. I have never and will never dye my hair.",
          "id": 204,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4778,
      "content": "YTA asking someone to change their natural hair or their hair period is over the line. No one will give a crap about your wedding photos within a few months of the wedding besides you. Her hair won't ruin the photos, your attitude will.",
      "id": 205,
      "comments": [
        {
          "score": 736,
          "content": "If OPs attitude is all encompassing like in the post (imagine all the other details she must freak out about) it probably already spoiled the wedding for some other people. It wouldn't be fun to attend.\nI am married and it sucks to see brides and grooms to be who miss the whole point of the wedding day by this much.",
          "id": 206,
          "comments": [
            {
              "score": 141,
              "content": "Given that she asked her guests to all dress in her color scheme, I imagine her shitty attitude is absolutely all encompassing. Yikes.",
              "id": 207,
              "comments": [
                {
                  "score": 59,
                  "content": "Seriously. As a guest, the second I saw that the bride was demanding I wear a certain color would be the second I RSVPd declining the invitation. I cannot fathom caring so much about the aesthetic of your wedding that you try to dictate what your guests wear.",
                  "id": 208,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 517,
          "content": "\n\n\n>Her hair won't ruin the photos, your attitude will.\n\n*your attitude already has ruined it.\n\nFTFY",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 35,
          "content": "Plus I always find this argument strange for the photos because to me, wouldnt it be weirder to always have these pictures of someone looking different than normal? Like shes a redhead in all other pictures but then theres your wedding photo and shes got random brunette wig on? To me that would draw even more attention",
          "id": 210,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": ">no one will give a crap about your wedding photos within a few months. \n\nYep. Married 8 years, and I can count on one hand the numbers of times after the 6 month mark that we looked at the photos—and those times only exist because we moved/had to box and unbox them.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Weddings are about having the people most important and close to you there for your big day . Not for the sake of a picture that no one will ever care about again except for yourself. You are literally delusional and already damaged relationships. Red hair would have been fine. You’re just obsessed with being the star and think you demand the world just because it’s your wedding day. Your sense of self importance is very inflated.",
          "id": 212,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "Lol within a few months? No one will give a shit about those stupid fucking wedding photos period besides this psycho bride",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": ">YTA asking someone to change their natural hair or their hair period is overt the line. No one will give a crap about your wedding photos within a few months of the wedding besides you. Her hair won't ruin the photos, your attitude will.\n\n>YTA asking someone to change their natural hair or their hair period is over the line. No one will give a crap about your wedding photos within a few months of the Pope  who 0p0wedding besides you. Her hair won't ruin the photos, your attitude will.",
          "id": 214,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4400,
      "content": "YTA 100% bridezilla.",
      "id": 215,
      "comments": [
        {
          "score": 1068,
          "content": "And a horribly jealous one at that",
          "id": 216,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 528,
          "content": "No, no, she specifically said she wasn't one right before saying someone's hair would DESTROY her photos and color scheme.",
          "id": 217,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 91,
          "content": "I’m astounded she even needed to ask if she was an asshole tbh. Geez. I’m glad the cousin dropped out cause no one needs that bullshit.",
          "id": 218,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2899,
      "content": "YTA. What on god's green earth makes you think you have any standing to tell someone to change their hair color - their NATURAL hair color?\n\nYou are the epitome of the Bridezilla stereotype. I often think that people who demand such things for their SUPER SPECIAL MAGIKAL PRINCESS JUBILEE MARRY DAY are not mature enough to marry.\n\nCalm down OP. Your cousin will look lovely, you will look lovely, none of this matters in the scheme of life.",
      "id": 219,
      "comments": [
        {
          "score": 637,
          "content": "> SUPER SPECIAL MAGIKAL PRINCESS JUBILEE MARRY DAY\n\nI think I like this more than Bridezilla.",
          "id": 220,
          "comments": [
            {
              "score": 24,
              "content": "Haha! Yes this is also the way I feel about grown-ass adults who get upset about not being able to have their birthday parties (!) on the actual birthday date (!!).",
              "id": 221,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 184,
          "content": "I think her cousin looking lovely is exactly what OP is afraid of.",
          "id": 222,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "This! What is it about weddings that make women think they have the right to act like complete psychos and make insane demands of people? Behavior like this would make me strongly reconsider marrying a person.",
          "id": 223,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "I don't even understand why she asked her cousin to be a bridesmaid in the first place if she's so concerned about her color scheme being fucked up by red hair. She's definitely an asshole.",
          "id": 224,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2006,
      "content": "YTMassiveA: Speaking as a person with natural bright copper hair, your peacock color scheme has nothing to with it. Those specific tones go perfectly with red hair and it looks amazing. There literally couldn’t be a more complimentary pallet to red hair than peacock tones.\n\nYour jealousy is showing and rightfully so, she’s going to look *amazing* on your big day with those colors as her backdrop.",
      "id": 225,
      "comments": [
        {
          "score": 489,
          "content": "I love how OP keeps denying she's jealous but then describes Ella's hair as \"attention-grabbing.\" She can't help her natural hair color! How is that attention-grabbing? I may be out of line saying this, but I think OP is projecting her own narcissistic needs onto her cousin.\n\nAnd she doesn't care one bit how this has affected her other family members. Ugh!",
          "id": 226,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 117,
          "content": "That’s what I was thinking. I have green eyes. When I was in hs I dyed my hair a tint of red/brown and holy moly did it make my eyes **pop!** bridezilla over here must think the redhead will “ruin” her photos, simply because she’ll be the one **poppin’** in them.",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 79,
          "content": "> Those specific tones go perfectly with red hair and it looks amazing. There literally couldn’t be a more complimentary pallet to red hair than peacock tones.\n\nWhich actually makes me wonder if the real issue is that OP doesn't want this bridesmaid looking prettier than her.",
          "id": 228,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 51,
          "content": "And all the guests are being asked to coordinate so even if Ella isn’t a bridesmaid she could still be wearing the colour scheme and in some of the family pictures...so was OP going to uninvite her as a guest, too?\n\nAnyway as per OP update she’s apparently made things so unbearable that Ella has dropped out of the wedding, though it’s not clear if that’s just wedding party status or if she’s said she’s not attending full stop. I hope OP’s mother and aunt can get through to her because she’s not simply Being Firm with Unreasonable Family...she IS the unreasonable family.",
          "id": 229,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "Joke is, if her cousin is still attending the wedding and complies with the peacock attire, she’s still going to look amazing.",
          "id": 230,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}