{
  "post content": "I (f) own a piercing and tattoo studio and take pride in doing things properly. For those of you who don't know, piercing guns are generally very very bad. Although most people say \"I had mine done with a gun and they are fine\", it's still a poor way of piercing as a gun forces the jewellery through the lobe causing trauma to the skin, meaning that, if you decide not to have the piercing anymore, the holes are less likely to heal and the scars will be more thick and visible. Also, you cannot properly sterilise a piercing gun, and they break/get stuck often. It's also easier to pierce with needles as you can be 100% sure of where the hole is going to go. Because of this, I always pierce with needles and make sure my staff do too. \n\nMy sister is 18 and has a 5 month old baby girl. I love my sister and my niece to death but my sister was insisting on piercing her daughter's ears, and assumed I would do it. In my studio, we don't pierce babies because of the chances of the piercings being uneven when they grow up, and simply because as the owner I don't think it's fair to pierce someone who cannot give their consent to the procedure. There's also the added issues of babies not knowing it's bad to play with new piercings, the risk of them falling asleep on the piercing and hurting it, and I've also heard of parents not cleaning the piercings properly because they're \"worried about hurting the baby\". I told my sister, when she asked when she could bring my niece in, that I would not do it. \n\nShe said that if I don't, she'll go to Claire's and get them done there. I thought she was just trying to goad me into doing it to be honest, so I rolled my eyes and that was it (we've had chats before about why piercing at Claire's is bad). The next day she messaged saying she was in the mall and she was serious, and I have ten minutes to say I'll do it.\n\nI ignored her, so she called me, we had a small fight in which she insisted I do it, or Claire's does, so I eventually agreed. \n\nShe brought my niece into my studio, and I pierced her ears. It was actually quite a smooth process but my niece obviously cried. My sister actually paid me, which surprised me, and then she left, happy she got what she wanted. \n\nI feel awful, and unprofessional. This was a couple of weeks ago and the piercings are healing well. \n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 9713,
      "content": "Going against the grain here with NTA\n\nSticking to your principles would have just risked your niece having a more painful experience and infection. You pretty much got emotionally abused into doing it. Im sure your sister has bullied you like this before and trained you pretty well through your life to do what she wants.\n\nAnyone who says youre the asshole off their rocker honestly, because your sister is definitely for sure a giant asshole so at the very least everyone sucks here\n\nEdit: Listen y’all, like five people said she was the asshole when I first posted this and NO ONE had said otherwise yet. Chill out",
      "id": 2,
      "comments": [
        {
          "score": 2702,
          "content": "Thank you. I felt like it was the lesser of two evils.",
          "id": 3,
          "comments": [
            {
              "score": 1146,
              "content": "You feel bad the same way an honest starving man feels bad about stealing food for his family. You were put in an unfair situation.",
              "id": 4,
              "comments": [
                {
                  "score": 224,
                  "content": "Les Misérables?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 404,
                      "content": "FIVE YEARS FOR WHAT YOU DID,THE REST BECAUSE YOU TRIED TO RUN",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "[GOAT ](https://youtu.be/kI3T3o2-2xc) \n\nI always cry. Every. Single. Time.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "I see it similar to selling drugs to addict because if you dont, someone else will. Except this is legal and OP provides the best alternative.",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 329,
              "content": "Your sisters you in a really shitty position. She guilt tripped you into doing something that was against your moral standards as well as against the owners rules.\n\nIt would have been the better of two evils, but really, she should have found a good piercer who did babies, or waited until the baby was older.\n\nKeep this in mind, because I bet you she will use that technique again to try to get what she wants.",
              "id": 9,
              "comments": [
                {
                  "score": 117,
                  "content": "Agreed on NTA but whew that sister is a piece of work. \n\nThere's no WAY a reputable piercer will pierce a baby. My favourite piercing shop won't even do piercings on anyone under 8 and the kid has to ask for the piercing themselves and fully explain the aftercare back to the piercer otherwise they refuse it. Most are like OP and will still try to encourage people not to get pierced until they're older, 16-18 and have stopped growing so the piercing doesn't shift or distort. The fact that OP has explained all of this to her sister who still insisted on piercing her daughter... Bad content.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 14,
                      "content": "My question is, do mall piercing gun shops do babies? It seems like liability central.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": ">she should have found a good piercer who did babies,\n\nGood piercers don't pierce babies (not including OP in that generalisation because their situation is uniquely shitty.)",
                  "id": 12,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Yes. lol, I wasn’t thinking when I wrote that. Of course you need to be over 18 to get a proper piercing.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 175,
              "content": "I kind of hate your sister. You're NTA. She is.",
              "id": 14,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 154,
              "content": "I got my ears pierced at 16 with a gun and it didn't go well, I have scarring and keloid masses in the earlobes, the holes often hurt when I try to wear earrings and sometimes they get reinfected. You've spared your niece that by doing it properly since, evidently, it was going to happen with or without you. Her health is what's most important, you did everything right, NTA.",
              "id": 15,
              "comments": [
                {
                  "score": 45,
                  "content": "Have you considered / checked for a metal allergy? I'm allergic to nickel.  Most cheap jewelry contains nickel, so I get an allergic reaction that is extremely similar to an infection (red,  warm,  swollen,  occasionally puss) with piercings. \n\nFor ears,  one of the work arounds I've found is dipping the post in neosporin.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 20,
                      "content": "I hadn’t! That’s is a really great tip, thank you, I’ll look into it. It could explain the “reinfections”, but the keloid scars from the gun will always make it feel unpleasant, I think, to wear earrings. I still do but I have to take them off after two hours lol",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I had the opposite! My mom thought I was allergic to like all metals my whole childhood because my ear piercings were perpetually irritated by every earring I wore despite being long-healed. Turns out I'm not allergic to the metals at all, my piercings are just REALLY shitty and the fronts and backs don't line up so I end up damaging the skin every time I try to get a piercing in them and that is what causes the redness and leaking. I still can't wear earrings without huge discomfort and days of irritation but at least I can wear other jewelry now that I know.",
                      "id": 18,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "I have never thought of neosporin! I just settled on only wearing sterling silver or gold, which can be kinda spendy. Will have to try this with the few cheap earring I have.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Same. My ears healed poorly and I had to have scar reduction surgery because I keloided so badly it was almost disfiguring.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "First holes at 13 and second at 18 both with a gun. I ended up stretching my first holes so I can wear things like glass and silicone because metal pissed them off too much. My second holes were so crooked with so much tearing I couldn't put anything in them. Got them repeirced several weeks ago and one of my professional holes (peirced straight) crossed my old hole at a diagonal... So thats how bad guns are",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "My sister had a similar problem. She ended up solving it by letting it  heal fully (obv. there was some scarring) and the had it re-pierced with a slighty hollow and a tiny bit bigger piercing needle by an actual professional. He basically 'pierced out' the small amount of scar tissue, and she hasn't had any issues since! Maybe that's an option for you if your scarring isn't too bad? Might be worth it to check in with your local piercing studio!",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 94,
              "content": "100% this was, and you werent given a choice between the two.\n\nI dont think children or babies should have pierced ears, but Claire's is the LAST place they should get it done if it HAS to be done.\n\nNTA, sorry you were put in this position.",
              "id": 23,
              "comments": [
                {
                  "score": 15,
                  "content": "I totally agree....ear piercing is painful, and there are so many things that can go wrong afterward (squirmy infants pulling at them, etc). But every time I compare this type of body modification to circumcision, I get shot down/down voted, etc. What I'm saying is that I often see anti-circ folks post online who have had their infant daughter's ears pierced, and who emphatically state that there is a difference.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 18,
                      "content": "It's a cosmetic procedure that your kid isnt getting a say in, its wholly optional and the only reason you're piercing their ears is because YOU want them to look nicer with them.\n\nPersonally, for normal earnings I think 10 is plenty old to decide, but under a year old is just stupid.\n\nIt does nothing for your kid, and they're never going to look through the photo album, or fuck, I guess the Facebook wall now, and say \"Gee thanks mom, I'm so glad I got my earings at 8 months old and not when I was 12.\"\n\nIt's just dumb shit we've always done so we continue to do.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "When practices like these are based on deep social norms or values, you're not going to get through to them with comparisons based on bodily autonomy.  Just as some people have religious reasons for circumcising boys, others have really deep (gendered) values about piercing ears on girl babies.  \n\nI'm right there with you on child's bodily autonomy for procedures that don't have medical need and that they can't consent to.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "[deleted]",
                  "id": 27,
                  "comments": [
                    {
                      "score": 80,
                      "content": "When the parent is such an asshole that they are willing to put their baby's health at risk so that they'd look cute. Sister clearly knew that Claire's was bad and didn't care, she just used that info to guilt trip her sister.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 29,
                      "content": "Never, in my opinion. But definitely not fuckin Claire's if it ever is.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "Some people think it's a way to fit gender norms - piercing baby girls' ears helps them look more \"feminine\" and \"gets it over with\" (they assume she'll have pierced ears anyway).  Of course, it's usually a big taboo for a boy to get his ears pierced.  \n\nI personally find it repulsive to inflict on a baby or child.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "It's a cultural thing for some people .",
                      "id": 31,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "For some, it's a religious sacrament.",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "Just want to say I feel so bad for you and am so mad at your sister for knowingly putting you in such a shitty position. I think you made the best of a terrible situation.",
              "id": 33,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 62,
              "content": "I got my ears pierced three times on each side- three individual love piercings. All done at piercing Pagoda or Claire's. All six got infected even though I took care of them religiously. \n\nI got six other piercings done at legit shops with needles and all hurt less and healed better than the ones done with guns. \n\nI think that you did the right thing.",
              "id": 34,
              "comments": [
                {
                  "score": 2,
                  "content": "I got my nose pierced at the Pagoda. Word to the wise, don’t fucking do it. They put an earring in my nose and it was part of the reason it wasn’t healing right. It’s was absolutely terrible and I was lucky it came out and I was able to get another one in that was way to big for any nose hole piercing.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "Absolutely, that was my first thought… The lesser of two evils. However, your sister is definitely a manipulative asshole and needs to be held accountable for this. Using a baby’s welfare to manipulate someone into going against their principles is lower than low.  Don’t just let this incident go… What other things will she make you or others do by putting her child in questionable situations, that’s what I would want to know for the future.",
              "id": 36,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Just remember, you didn't do this \"to\" your niece.  You did this \"for\" your niece.   \nYou did your best to prevent a poor job and when your asshole of a sister pushed it, you did what was right and in your power for an innocent child.  \n\n\nYou are NTA.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "NTA, and for the record my first ear piercings are totally and ridiculously uneven because they were done at a very young age.",
              "id": 38,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 179,
          "content": "This for sure. Claire's did a terrible job with my and my sister's ears, even though she was 4 or 5 and I was maybe 12. And worst of all, the workers there aren't allowed to refuse if the kid says no or if there's something else they're worried about.",
          "id": 39,
          "comments": [
            {
              "score": 136,
              "content": ">the workers there aren't allowed to refuse if the kid says no\n\nThis sounds illegal.",
              "id": 40,
              "comments": [
                {
                  "score": 76,
                  "content": "My guess is it's because kids are not legally in charge of themselves, and if a parent throws a stink over a refusal, it might cost Claire's money to a competitor. Obviously, not a lawyer, and only my guess.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 93,
                      "content": "Yep. I worked at a Claire's for one summer. Parents brought in their baby who couldn't have been more than six weeks old. We usually recommended waiting until three months to do the piercing, but the parents insisted. I did the first ear and the baby started absolutely screaming. They had to hold her down for me to do the other ear. I felt like a monster.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 57,
                      "content": "Claire's is just begging for a lawsuit if you ask me. Surprised no one has taken them to court over their ear piercing services already",
                      "id": 43,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 61,
              "content": "I used to work at Claire’s when I was 16. At my store we were allowed to tell clients we were not comfortable doing their ears. I don’t think we were encouraged to do it but I personally turned away a lot of babies who seemed fussy since it’s easy to rip their ears. \n\nClaire’s is a terrible place to get your ears pierced. I would not recommend it to anyone. We got a 30min training guide and were basically thrown into it after watching someone do it once. Many of my coworkers didn’t follow the sterilization protocols and many were lazy with making sure they were even/lined up correctly :/",
              "id": 44,
              "comments": [
                {
                  "score": 5,
                  "content": "Fellow ex-Claires employee here! Yea it was my first job. And the training was essentially watching a quick video on it, practicing on a dummy ear and voila! 16 year old idiots (me) legally assaulting infants. It's crazy.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "The equivalent of Claire's in my country did mine when I was 8. They've never healed. They're uneven. I genuinely hate them and wish I'd never got them.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "This exactly.   \nI got my ears pierced at Claire’s 13 years ago; I stopped wearing earrings 6 years ago.  \nOne ear has closed up fine, the other occasionally oozes. I have massive scars on my lobes now, and there’s a solid block of scar tissue on the inside.  \nI absolutely regret getting my ears pierced at Claire’s; I was nervous about the needle method, so I thought a gun would be less scary.   \nI should have gotten my ears pierced with a needle.   \nOP saved their niece a _lot_ of potential issues down the line. If the niece no longer wants earrings, ears pierced with a needle won’t scar as badly.",
          "id": 47,
          "comments": [
            {
              "score": 59,
              "content": "I think it’s actually kind of a jerk move to want to pierce a kid’s ears before they can actually decide if they want it. \n\nGot my ears pierced when I was 5 or 6 and can barely remember it except for the shock and pain, but they got infected all the time (kids suck at hygiene and I kept fiddling with them,) and now I have two permanent holes in my earlobes that I can’t do anything about, and I hate wearing earrings, even studs. I’ve had plenty of other piercings but I was old enough to decide for myself.",
              "id": 48,
              "comments": [
                {
                  "score": 24,
                  "content": "I'm not saying it was a flawless choice; I definitely agree that ears should be pierced when kids are A) old enough to clean/take care of the piercing and B) old enough to vocalize the desire with full understanding of what it entails.\n\nHowever, since the sister was literally going to pierce her baby's ears at a company that seems to do more harm than good (skimming the comments gives a pretty good scope of Claire's less-than-acceptable standards), the needle piercing is the lesser of two evils.\n\nMy lobes are basically ruined from Claire's--even after 6 years of healing. I've know someone who only needle-pierces, and her scar from a failed piercing is a tiny dot after a year.",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "My Aunt decided when she had her little girl that they wouldn't pierce her ears until she was old enough to decide for herself - sometime around 10 i think they said. It seemed really reasonable to me and I can't imagine putting a baby through it. It seems painful, even to adults.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I hated having regular ear piercings and wearing earrings (largely because I wasn't buying the good quality stuff so it was always really really uncomfortable), but I stretched my ears and I love it. I wear glass most days and it's super comfortable. More comfortable than studs ever were.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I got my ears pierced 12 years ago at Claires. They get infected every now and again and they're super uneven. I really regret getting my ears pierced there, it was painful and they get red and irritated if I wear earrings for too long. I really wish Claires would stop their piercing services since there's so many reports of infected, scarred, and generally messed up piercings. People should go to tattoo parlors and specialized shops like OP's, the risk is too high for younger girls getting their ears pierced.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I got my second holes done at Claire's.. There is now scar tissue where holes once were. \n\nIn fairness, I think it was more due to low quality metals than piercing technique but always go to a pro. I've had several needle piercings since then that use titanium jewelry and they've all gone smoothly.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I got my ears pierced twice - once when I was probably like 6 and once when I was probably 11 or 12. First time when I got a bit older my skin got really sensitive and the earrings would cause rashes. I got scared and stopped wearing them. They closed the first time. My mom tried to tell me since I was older it probably went away, so I got them done again. Same thing happened, but I discovered the sensitive ear ones. Probably wore earrings until I was 15 and then I kind of didn’t care and my ears felt more comfortable without them on. Eventually even sensitive ones would sometimes bother me \n\nI never wear them now. I’m 22 and the holes haven’t closed yet. Both of my piercings were guns. I don’t really know why I shared this. Idk, I guess don’t pierce children’s ears because they might have sensitive skin?\n\nEdit: not that I’m blaming OP, I think she made a good choice trying to give the kid the best possible care. Also I’m sure OP can help with keeping them from getting infected!",
              "id": 54,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 40,
          "content": "I completely agree, she broke her principles to protect her niece because she is a professional who knows what she’s doing vs a part time worker at Claire’s who probably doesn’t give a hoot.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Agreed on NTA. I went into this thinking op did it without consent. Obviously not the case. \n\nHer sister is the asshole for this situation 100%.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Can we all just stop saying “going against the grain?” It always ends up being the majority opinion",
          "id": 57,
          "comments": [
            {
              "score": 8,
              "content": "It's as bad as \"unpopular opinion, but\"  \n  \nJust say what you want to say without qualifying it with some bullshit. Especially when 99% of the time your qualifier isn't true in the first place.",
              "id": 58,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "It genuinely wasnt at the time chill",
              "id": 59,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "Against the grain, LOL it's almost entirely NTA",
          "id": 60,
          "comments": [
            {
              "score": 5,
              "content": "I imagine at the time they commented it wasn’t?",
              "id": 61,
              "comments": [
                {
                  "score": 4,
                  "content": "yes exactly thank you!",
                  "id": 62,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "like the other person said, I posted very very early when there was only five others and they all called her the asshole",
              "id": 63,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "I agree.  NTA.  You sacrificed your own emotional wellbeing and sense of honor for your niece's physical well being.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Your poor niece, having to grow up with your her as a mom.\n\nNTA, obviously.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": ">Going against the grain here\n\nWhy would this be against the grain? This seems like a validation post mostly bitching about her sister. Really hard to imagine anything other than 'NTA'.",
          "id": 66,
          "comments": [
            {
              "score": 7,
              "content": "Some people go with a proximal ethical position - if you were the one doing the wrong action, then you're wrong, regardless of your reasons or intentions.",
              "id": 67,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3209,
      "content": "NTA - that’s fucked up and you should have a serious talk with your sister about your ethics and why you don’t pierce babies (family or not). If she can’t respect those boundaries this kid is going to have a messed up momma",
      "id": 68,
      "comments": [
        {
          "score": 971,
          "content": "Thank you! I've had similar debates with her for years, she's had a bunch of badly done piercings because she didn't want to pay professional prices and stuff, so I didn't really stand a chance of getting through to her",
          "id": 69,
          "comments": [
            {
              "score": 268,
              "content": "Moreso you should talk to her about respecting boundaries and personal choices in general and not just this particular case.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Your health and your family’s health are definitely worth paying more for. You get what you pay for.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I bet if you talk with your sister again that she tries to play it off with something about how she's just trying to take your good advice about safe piercing by making sure you do it instead of some other place. Just remember that's complete bullshit because instead of taking all of your advice she decided to hold her own daughter hostage to get you to do what she wanted.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "Where is your mom? A child consenting for another child should never have happened.",
              "id": 73,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 2,
              "content": "Gosh if she's like that I really hope she'll handle aftercare properly.\n\nOr ugh get some cheap ass earrings that will irritate the ears.\n\nOur daughter had hypoallergenic earrings from the piercer for the first 2 months so it heals properly.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "She doesn't want to pay professional prices? Bruh it's $20.. she cant even respect herself enough to pay $20 to get a piercing that will be done correctly?\n\nSource: I have several piercings all coming from different shops all at the price of $20.",
              "id": 75,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "Yep. Mentioned in a comment up thread that it’s pretty weird to do that to a kid when they’re not old enough to decide for themselves.",
          "id": 76,
          "comments": [
            {
              "score": 34,
              "content": "While it doesn't seem to be applicable in the case of OP's sister, it can be a cultural thing. I had my ears pierced when I was 2, and so did all of my girl cousins on my dad's side, who are South American. Earlobes aren't as big a deal as cartilage piercings, although in all of our cases they were done in better places than a Claire's.",
              "id": 77,
              "comments": [
                {
                  "score": 3,
                  "content": "Pretty common in parts of the US as well.",
                  "id": 78,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "It used to be more common I think. I had mine done at like 1 or something.",
              "id": 79,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "In my culture, all babies included boys are pierced. Didn't really think about how it could bad before reading this.",
          "id": 80,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "OP’s sister is a child raising a child",
          "id": 81,
          "comments": [
            {
              "score": 4,
              "content": "Was about to say sister is 18, way too young to be having a kid.  Hell we aren't fully developed mentally until 25.",
              "id": 82,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1098,
      "content": "NTA if you are (reasonably) sure that your sister was not bluffing and she would have done it at Claire's.\n\nIt seems that she was pretty committed to have it done anyway, so she is definitely TA for all the reasons that you listed. There was no good way out of this, if you had stuck to your principles your niece would still have had her ears pierced. People will do stupid stuff, especially young people who think they know better. At least you made sure it was done with love and care and sterilization, and thanks to you it will probably turn out great!",
      "id": 83,
      "comments": [
        {
          "score": 379,
          "content": "I am so sure she would have got them done, she was dead set on it. And thank you! I hope they turn out fine and stay even!",
          "id": 84,
          "comments": [
            {
              "score": 214,
              "content": "Not only is your sister manipulative, she used her own daughter as the hostage of this negotiation. \n\nWhile you may have done your baby niece a favor, you enabled your sister and continue to condition her with reward. Just, be aware what’s happening. I don’t get the sense that you’re cognizant of how unhealthy your sister is and how your giving is ultimately making her worse due to her behaviors actually being rewarded by you. \n\nDo you want your niece to be raised by your sister’s behaviors this way?\n\n(Or maybe this is a one time exception and she never acts this way.)",
              "id": 85,
              "comments": [
                {
                  "score": 57,
                  "content": "In general, I agree that OP needs to reconsider what she is willing to cave for. But in this scenario the alternative was the possibility that her niece might’ve had a bad procedure done, gotten her ear butchered, or maybe even infected, when its well within OP’s ability to do it cleanly and correctly. Maybe the sister was bluffing, but maybe she wasn’t, and OP ceded for their niece’s sake.",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yeah, it's just so wrong that her sister was literally threatening her own infant daughters safety in order to manipulate OP into doing what she wanted (and even worse because what she wanted was stupid, pointless and wrong on many levels)",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 70,
              "content": "[deleted]",
              "id": 88,
              "comments": [
                {
                  "score": 61,
                  "content": "I was 13 when I got mine pierced and they stayed even. I know it's anecdotal but that's my experience. \n\nMy daughters are still toddlers, but I plan on letting them get their ears pierced when they are a) old enough to ask and b) I'm reasonably sure they can care for the healing piercing with minimal help.\n\nEdit: OP is NTA",
                  "id": 89,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Mine were pierced as soon as I could hold my head up on my own and they’re even I think. But I also don’t remember it. Not super relevant to the post but I can relate to this I guess. \n\nAlso NTA, the only way to ensure it’s being done right is doing it yourself",
                      "id": 90,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "My daughter’s ears were pierced by the top body piercer in my city. He will not do piercings on children under 6 because of the possibility of uneven holes, so she got them for her 6th birthday.  (She started begging when she was five.)",
                  "id": 91,
                  "comments": [
                    {
                      "score": 4,
                      "content": "My girls got their ears pierced when they were that age too. It’s a huge “big girl” moment and exciting for them when they make the decision. It’s also a learning lesson that sometimes things hurt, and that’s ok. \n\nI can’t imagine taking a tiny baby and doing something painful to them when they can’t understand and for no good reason. It sucks with vaccines, but that is for a very good reason and has to be done.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "My sister and I both got ours done when we made our first communion (near the end of 2nd grade so we would have been 7). Neither of us have had any issues. My cousin who had them done as a baby has had issues though.",
                  "id": 93,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Mine were pierced as soon as I was able to say “ears pierced” (my mom wanted it to be my first words so I could get them done 🙄) and mine are even. HOWEVER they did get infected as a child, I lost a lot of earnings by playing with them, and one of my friends that got hers pierced as a baby had her’s hang on her pillow and it ripped through her whole earlobe. I never wear earrings now and didn’t as a child if I had a choice, and my holes are never gonna go away bc every time they grew together my mom would just poke it out with an earring. My holes are a little bent inside from doing this so much, and there’s so much scar tissue around the holes that they’d never grow in. I haven’t worn earrings in over a year and I probably wont for another, but I guarantee you I could stick an earring in my ear then.",
                  "id": 94,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I was seven, and I asked for it for my birthday. My mom watched over me cleaning them every night, but it was my responsibility. I think that’s a reasonable time to get it done.",
                  "id": 95,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "'love care and sterilization' isnt the biggest risk though? the biggest risk is that a baby who has no concept of having metal shoved through their body will itch and pull at a painful area, possibly ripping the piercing out of their ear and disfiguring them for life. OP doing the piercing was not a safe option. It was less shitty than Claires but still shitty.",
          "id": 96,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 508,
      "content": "NTA- saved your niece from getting poorly done piercings.",
      "id": 97,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 377,
      "content": "ESH but tbf your sister put you in a really bad position. She wouldn’t listen to you as a professional piercer and basically blackmailed you into saving your niece from a potential disaster job. Take comfort in that and if there are any issues down the line know that responsibility lies with your sister. You only did what you did to protect your niece as best you could - even though you know that meant doing (slightly) the wrong thing.  I’m so sorry for you.",
      "id": 98,
      "comments": [
        {
          "score": 149,
          "content": "I think you mean NTA, hah. I know if it were my niece I woulda done the same damn thing. Luckily my sister wouldn’t ever do this in the first place.",
          "id": 99,
          "comments": [
            {
              "score": 44,
              "content": "\"You don't need an opinion of your own, here take mine!\"",
              "id": 100,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 96,
          "content": "Thank you so much",
          "id": 101,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 86,
          "content": "So how is OP the asshole? Her choices were do them herself in a professional sterile environment, or let some 18 year old mall Claire’s minimum wage employee do it. And she’s an asshole in this situation? Get out of here with that bull.",
          "id": 102,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 45,
          "content": "How is this ESH? OP did the only ethical thing given the situation. If you have to shove someone out of the way of a falling brick (for whatever reason) is it ESH because pushing people is bad?",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Except that they don't lie with the sister. Legally and ethically they lie with the piercer who didn't say no.",
          "id": 104,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 310,
      "content": "Tell your sister she’s an asshole. I had my ears pierced at Clair’s and they uneven and won’t heal over (I no longer want piercings) and the experience was mildly traumatic. Not the piercing itself, that was pretty painless, but the fact that I was screaming and crying and my mom just held me still instead realizing I didn’t want my ears pierced!!",
      "id": 105,
      "comments": [
        {
          "score": 46,
          "content": "How old were you?",
          "id": 106,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 37,
          "content": "Claire's was horrible. I got mine pierced there and the scars extend out of the piercing and on my lobe. I haven't worn ear rings in five years and legit still have piercings. Every now and then it still hurts.",
          "id": 107,
          "comments": [
            {
              "score": 13,
              "content": "They put two marker pen dots on my ears, got the left one right and missed the right one completely. I was given £15 worth of gift vouchers and a free “correction piercing” once the wrong one had healed.. 20 years later and it never healed (and I never went back!)",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "I haven't had earrings in for about 30 years, the holes ate there and I have to constantly monitor them and release some sort of a build up that gets infected if I don't clean it regularly.\n\nWas done with a piercing gun in some cheap jewellery shop.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "I got mine pierced at Claire's too. They did my right ear perfectly fine, left ear they broke the earring somehow, second attempt worked but it was somewhat sideways where it's hard to get an earring in. After looking at this thread I got lucky compared to others too, no scarring or anything. Didn't use earrings for five years and they never closed, luckily I like them again. Fuck Claire's man. OPs sister is crazy for considering Claire's when she knows it's bad.",
          "id": 110,
          "comments": [
            {
              "score": 5,
              "content": "I got mine at Claire's. The left one is fine but the right one was crooked or something and it would hurt if I tried to put earrings on. Sometimes when I put on earrings it felt like I was piercing it again. For some reason I don't have that problem any more and I don't know why.",
              "id": 111,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I had mine pierced at Claire’s too. Also uneven. I was like ten, but still. I will have uneven earrings for the rest of my life.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 205,
      "content": "NTA but I understand that you feel awful because you didn't stick to your values/ boundaries. \nNot a big one, but your sister is the AH to insist and to blackmail you to do it till you agreed.\nI hope you taken get over it soon, and take comfort in the fact that they are healing properly, but also learn that agreeing like that make you feel wrong.",
      "id": 113,
      "comments": [
        {
          "score": 23,
          "content": "> Not a big one, but your sister is the AH\n\nyou’re right - she’s not a big asshole, she’s a huge gaping asshole",
          "id": 114,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 169,
      "content": "NTA. Your sister was going to do it at the mall. You at least made a bad choice a little better. Your sister is TA. Babies aren’t dress up dolls.",
      "id": 115,
      "comments": [
        {
          "score": 2,
          "content": "This. Piercing the ears of infants is tacky as hell.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 131,
      "content": "NTA  but don't let your sister forget why you did it. If the girl once she grows up doesn't want them don't let your sister blame you for the piercings.\n\nHonestly I think piercings a 5 month old baby's ears should be illegal. Would they have actually done it at Claire's?",
      "id": 117,
      "comments": [
        {
          "score": 56,
          "content": "They pierce anyone at Claire’s, under 16s with parental consent. I’ve seen multiple toddlers and babies sat or being held in the chair as I’ve walked past in my town.",
          "id": 118,
          "comments": [
            {
              "score": 16,
              "content": "Scary. Then OP did the right thing piercing her ears.",
              "id": 119,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "I’ve heard of pediatricians piercing patient’s ears.",
          "id": 120,
          "comments": [
            {
              "score": 6,
              "content": "Yes. I saw a pamphlet at my pediatrician’s office.\n\nMy daughter is 2 and I haven’t pierced her ears.  Part of me wanted to, but a bigger part thought it may have been cruel.",
              "id": 121,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "The hospital I delivered my oldest in offered to do it. Body modification needs to be banned before age 13, and even limited at that point.",
              "id": 122,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "There's literally no other reason for it besides selfish vanity reasons on behalf of the parents. I got my ears pierced as a gift when I turned 10 because \\*I\\* wanted them pierced.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I worked at a piercing place that wasn't Claire's, but we would pierce babies as long as they were 3 months and older. Picture a three month old. They're tiny. I was only seasonal and didn't have to pierce. I chose to do a few, but I ALWAYS refused babies.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 108,
      "content": "NTA, better you than Claire's.",
      "id": 125,
      "comments": [],
      "relation": "Support"
    }
  ]
}