{
  "post content": "Context: I (20F) am going to school at a university (this is important for context). My mom has not ever really supported the fact I wanted to go to a bigger school as she went to community college. About 2 years ago I was in a car accident and I decided to sue the person responsible for the accident (damages were over $10K, medical bills over $30k). My vehicle was beyond repair and insurance only offered me $1,500 after it was all said and done. I tried everything and I am left with severe neck and back pain. I also have trouble with strength in my arms and legs. The driver drove drunk and hit me going at an unreasonable amount of speed. It lead to my car flipping over multiple times and needing surgery after. \n\nRecently we went to court and although I only asked for $55K in court, the judge required him and his insurance company to pay $150K to me for damages, medical, and as personal relief as well. I just got the first part of the check on Monday and my mom insisted I give her the entire check ($25K) so she can have some spending money. After I told her no and told her I would be using it for college expenses as I still have three years left, she told me I am not responsible enough to handle it. I explained I am meeting with an accountant on Friday and we are going to open up an account specifically for this and I won’t touch the money unless I absolutely need to. She still didn’t like that and called me the a-hole for not giving her the check. Her biggest reason after I talked to my grandma was “I gave her life. I’m entitled to something”. I am really considering cutting contact with my mom if she continues to behave this way but I am wanting to better my future. So AITA for this?\n\nEdit: Wow. Thank you all so much for the advice. I am blown away by this community I’m not gonna lie. You all have really helped me see what I thought I was in the wrong for. I did end up calling both an accountant and financial advisor and we have a game plan set for where money will be going. I also decided I am going to start a will in the event something were to happen to me. I have that attorney appointment next week. I am gonna be nice and give my mom something out of that but if she goes before me, I can easily have it fixed. On the other hand, my fiancé and I both had a sit down conversation with my mom. We not only showed her some of the comments on this post but explained to her the necessity of me still having an education and job after I get the last few checks. I am going to school to work in business/healthcare management so who knows…. In 10 years I could be a board member of a hospital or running my own hospital lol. Mom did finally see where she was in the wrong and apologized but that isn’t going to fix everything right now. I still don’t trust her but time will tell how she feels. Thank you all again for helping me because honestly I really felt like at some point I’d have to give her my money. So seriously everyone thank you!\n\nUpdate: Hey y’all, it’s been a few months so I wanted to let you guys know my progress. My money is currently secure in a savings account that only I can access. It’s with a bank I do not typically bank with and no one but my MIL knows the name of the bank. She has been really supportive and helpful through this process. I have been making major progress in physical therapy and should be done by summer of next year. I also joined a sorority at my college and while I know probably not the best money move, the benefits outweighed the cons for me. My mom and I are also both going through intense individual and family therapy to help with our issues that have stemmed back for years before the settlement. So we are working things out but right now, I am not living with her nor am I financially supporting her. My fiancé (as of October) just found out we were pregnant and will be telling his mom on Christmas. We are very excited for what seems to be a bright future ahead of us. My financial advisor has also helped set up my account to where a small portion was put into a stock that is doing really well at the moment and I plan to sell it before the recession. Overall, I’m doing well guys. Thank you all again for your opinions. I have really appreciated it.",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I would be judged for not giving my mom my check and I may be the asshole for this and wanting to cut off contact with my mom.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA, Cut contact. Being a mother is a privilege, a challenge, a job, but above all a blessing (even in the most difficult circumstances). She doesn’t deserve repayment for 1) a blessing and 2) a choice she made by having you. Sounds like you’re FAR more responsible with how to use this money.",
      "id": 3,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. You are not responsible for your mother’s life choices. Now, if she helped you physically/financially after the accident I’d probably give her something but she is in no way entitled to your money.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "No child owes their parents anything. They chose to have you and she did nothing to earn a penny of that money.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": " NTA, Her argument is BS. \"I gave you life so i'm entitled to something\"? Sorry no. She is the one that CHOSE to give you life, you didn't ask for that, and that certainly doesn't entitle her to anything from you. Continue doing what you're doing.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Going NC with your mom sounds like it'd be a good idea.\n\nSpend the money on your education, not on 'spending money' for your selfish mom!\n\nYou've made great choices so far, keep on making them.\n\nEdit: you are clearly very responsible, unlike your mom.\n\nNTA",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "My brother's gf in 7th grade received a settlement after being hit by a reckless truck driver. It was a large amount, as she had injuries that would trouble her for the rest of her life and even keep her from ever having kids.\n\nYou would not believe the things her parents spent it on. Improvements to their whole house (she got her own bedroom), a huge in-ground pool (for her physical therapy), pretty much every other expense she had down to groceries came out of the money, even the car they bought to drive her to doctor's appointment. Lo an behold, by the time she graduated high school, it was pretty much gone. \n\nAnd then they sold the house and pocketed all the extra money gained from the improvements and remodeling that she paid for. She didn't even get the damn car.\n\nDo not give anyone a dime, that judge didn't slap all that extra money on there for no reason, you are going to need every penny of it. \n\n&#x200B;\n\nNTA",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. You should look into chiropractors that specialize in muscle adhesions. This is scar tissue which makes your muscles 'sticky' and causes them to work incorrectly and pain. There aren't very many around yet, but it would be beneficial to get evaluated by one",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": ">“I gave her life. I’m entitled to something”.\n\nYou didn't ask for her to birth you. You don't owe her shit, OP. So sorry your mother is like this.\n\nEDIT: Also just wanted to add it feels really gross your mother is trying to profit off your situation.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA.  It’s your money and using it in this way is sensible.  Your mother chose to reproduce and is not entitled to a financial reward for doing so.",
      "id": 11,
      "comments": [],
      "relation": "Support"
    }
  ]
}