{
  "post content": "So how to begin with this...I realize that on paper I am totally the asshole but when you dig deeper into my motivations I'm hoping its more of a grey area that anything else and maybe even I did the right thing. \n\nWhen I was a teenager my dad bought me a classic 1972 Ford Bronco. It was my true passion and I don't recall a memory from high school that somehow doesn't involve that truck. Plus my dad and I would spend hours and hours working on it together and we went through that especially father/son rough patch when I was teenager it was always that Bronco that brought us back together. I made a huge mistake and sold the truck when I turned 19 and my dad died of a heart attack two months later so while not logical, I've always felt a karmic connection between the two events. \n\nWe had a baby in early February. she is our first and the light of my life. My wife is doing well but she's back at work and she's realized that she hates all the day cares we've tried and really wants to be a stay at home mom and plus she's still very hormonal from delivery, lack of sleep and breastfeeding so she's having a rough time and is angry a lot. I guess I need to say this. \n\nTwo weeks ago I was driving through our town's warehouse district and saw a Bronco that was pretty beat up but resembled mine. I stopped just for nostalgias sake and the owner came out and let me take a look inside. My dad and I had glued a wheat penny under the dash as sort of security measure so I just sort of checked and goddamned if it wasn't MY BRONCO! \n\nI asked him if he'd ever consider selling it, he said actually someone was on I-25 as we spoke from Colorado to buy it for $21000. I freaked out and asked him if I could buy it right then and there for $23000. He said if I could come up with the cash, yes. I had been procrastinating setting up a 529 so I had $12000 in savings that my wife's parents had given us, I maxed out my credit card to Venmo and my mom bought down a check for $4000 and I fucking drove away in my old car. It was like a dream come true. Like a literal dream come true. It needs a lot of work I can't afford right now but it's mine. Like in my driveway mine. Again. I can't even describe what a joy this is. \n\nMy wife and her parents are furious with me. They feel I was deceptive, that a \"real\" man would have sacrificed anything and everything so my wife could go stay at home with his kids and that's setting aside that they gave us the money for a college fund. My point is my daughter is only 6 months old, we have 18 years to set up a college fund of her. But this Bronco means everything to me and if I wouldn't have acted it would have been gone forever. Now it can be that same connection between me and my kids. To me it's the literal meaning of happiness.\n\nLike I said on paper--asshole...whole story--grey area. How do you guys see it?\n\nEdit: had no idea this would go so one way. I guess I messed up. I talked with my mom and she is basically going to buy the bronco from me in order to refill the college fund and pay off the credit card. The $4k will be a gift and she’s going to give me whatever I need to restore it. She’s always been awesome to me and she’s rather the money be spent now than wait for me and my sisters inheritance. Sorry to get everyone so mad at me, I was thinking with my emotions and acted badly\n\nedit2: are the “mommy bailed you out” comments really necessary ? I found a solution and it’s coming from me and my sisters inheritance so it’s not like I’m not paying for it on my own eventually.\n\nEdit 3: my inbox is so buried I have no idea what those icons are that are where gold used to be. Does anyone know what those are ?\n\nEdit4: I’m getting a 403 error whenever I try to respond, not sure what that means but I’m still reading because honestly I’m afraid to go home even with the great news I know my wife is going to be upset for one reason or another\n\nEdit5: does anyone know what 403 error means? I messaged the moderators but they must be busy /u/SnausageFest since you’re a mod, do you know? I can’t respond to any posts and get the “status 403” whenever I try. Thanks!\n\nEdit in the morning: I couldn’t figure out why I was getting so many private’s  but I guess this must be locked now. I didn’t tell my wife that my mom bailed me out and lied and Said I found a buyer for the bronco. I’ll figure out how to cross that bridge when I get there but my wife was so relieved that I “had come to your senses” I don’t want to disappoint her. It’s going to take all my lying skills to pull this one off over the next few years.",
  "id": 1,
  "comments": [
    {
      "score": 32032,
      "content": "Jesus dude, yes, YTA.\n\nWho spends $23K without so much as speaking to their spouse first? Assholes do.",
      "id": 2,
      "comments": [
        {
          "score": 10619,
          "content": "It's beyond the pale. I made a somewhat controversial comment on a thread yesterday that I couldn't imagine making a several hundred dollar purchase without discussing it in depth with my spouse. Several thousand dollars, without discussion at all, with money from a college fund? \n\nCall me an asshole, but I'd think about divorcing this person. This isn't someone I trust to be my partner.",
          "id": 3,
          "comments": [
            {
              "score": 4528,
              "content": "Agreed 100% that it's grounds for divorce.",
              "id": 4,
              "comments": [
                {
                  "score": 2873,
                  "content": "I seriously hope OP either realizes how bad they fucked up and how fucked his whole mentality is (taking your childs money, not consulting his wife over a major purchase, looses the victim mentality, etc) or his wife leaves his ass.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2445,
                      "content": "someone who falls for the \"someone is on their way right now to buy this if you don't!\" scam, let alone for $23,000 is probably not very healthy mentally.  \n\n&#x200B;\n\nLet me be an asshole and make assumptions: \n\nHaving a baby could make him feel like he's getting old, and losing control of his life, and this reckless spending might be the last thing he has control over/ be able to buy? Could be depression or a mid-life crisis kind of deal.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1679,
                      "content": "He doesn't. See his second edit: to pay back the money, his mom is buying the car with money from his *and his sister's* inheritance. So he's stealing from his sister to pay for stealing from his daughter. Dude's never going to learn.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 631,
                      "content": "Don't forget that he maxed out his CC also.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 66,
                      "content": "'My wife's angry all the time, I dunno, must be the hormones' - this guy probably.",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "I hope she leave and take the baby (that he doesn’t care about) and the car (bought with her parents money) with her.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 718,
                  "content": "I’d be halfway to my mother’s house with the baby before that car even pulled into the driveway. Jesus Christ.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Seriously. I'd be like, have fun with your new car. I hope you enjoy living in it because there is no way you're coming back home. I can forgive a lot, but stealing from our child and my parents would be a deal breaker.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Yep. Hope that muffler can suck, cuz I’m out!",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 19,
                      "content": "I'm trying to imagine that phone call with my mom. Telling her that my wife had emptied our bank account and maxed out our credit card on a car without telling me, especially if I had a newborn and a lot of the money was *from* my mom. Jesus Christ. That would be such a horrible phone call.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1949,
              "content": "We have an agreement that we don't need to discuss the money we spend on hobby stuff as long as we keep it reasonable... and we still break it with big stuff.\n\nIt's a respect issue to keep your SO in the loop, but also it's a practical issue for me. I need *someone* in my corner to talk me down if I am tempted to throw down serious $$ on some stupid sentimental nonsense. OP's wife could have been that person for him. The person who could say \"I know you love and miss your dad. There's more practical ways to honor his memory, and one is to make sure you're a great dad to your own kid.\"",
              "id": 15,
              "comments": [
                {
                  "score": 1363,
                  "content": ">\"I know you love and miss your dad. There's more practical ways to honor his memory, and one is to make sure you're a great dad to your own kid.\"\n\nThis is a loving and appropriate response.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Just want to chime in and say wow, what a great line.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 39,
                      "content": "This would have been if the guy had given the wife a chance. I'm guessing when he pulled in the driveway, the response wasn't so warm.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "I don’t have an SO but any “out of the norm” purchase I run by friends - ones that are intimately acquainted with my financial situation. Impulse buying screws over a lot of people (and this seller with “some dude is coming from where fucking ever with $25000” knew what he was doing).   If I had an SO I would definitely use them as my secondary but-check on an emotional purchase.   Particularly $23000 for a car he doesn’t need and which needs a lot of work?",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Also, if he didn't ask she couldn't say no. The whole \"it's easier to ask for forgiveness than permission\" does not stretch this far.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1344,
              "content": "Not to mention he basically stole $12,000 from his daughter and put his family $10K in the hole dude is trash.",
              "id": 21,
              "comments": [
                {
                  "score": 1024,
                  "content": "On top of that, it wasnt even his money. It was money given by his wifes parents",
                  "id": 22,
                  "comments": [
                    {
                      "score": 576,
                      "content": "To add to that his mother is giving him additional funds to cover what he already spent from his in-laws but it’s fine cause in the future it’ll be his AND his sister’s inheritance anyway. Might as well spend it all now since it’s there! Sister can get an IOU",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "THIS. this makes me so mad. THIS WAS NOT HIS MONEY TO SPEND. What a piece of shit.\n\nEdit: a word. Also especially bad as it wasn’t even His parents money COME ON",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "PLUS he's saying this car is the *most important thing* to him and is *the embodiment of happiness.* Dude has a 6 month old, but she comes in distant second to a FUCKING BRONCO. 🤦 I'm sorry, this just really grinds my gears. What a fucking tool.",
                  "id": 25,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 939,
              "content": "Also, why the actual fuck is his mother encouraging this behavior? Why did his mother bring him a check for 4 grand? Why is his mother buying him out of this mistake?\n\nThis guy sounds like my manchild brother in law.",
              "id": 26,
              "comments": [
                {
                  "score": 443,
                  "content": "It makes it less hard to wonder how he thought this was okay. Sounds like Mommy cleans up his messes a lot. \n\nAlso fuck his edit with “it was my money anyway because inheritance”. No. It’s your mom’s money, period; you have no idea what she might want or need to use it for herself in her years to come. It’s not your eventual money paying for it, it’s your MOM’S money and she’s using it to bail your childish ass out so you don’t have to face consequences for your actions.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 57,
                      "content": "[deleted]",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 222,
                  "content": "Yup. Be a man and get off the tit, OP.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 655,
              "content": "Consider also that the money was supposed to be for college 18 years from now. With interest, that $23,000 could have been ~~hundreds of thousands~~ many dollars by the time college came. Now, it will be $0.",
              "id": 30,
              "comments": [
                {
                  "score": 16,
                  "content": "In 18 years compounded at 5% annually it would total $55,352. Just FYI.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 496,
              "content": "Yep. My ex and I had an agreement that anything over $100 that didn't come out of our personal accounts (we did a yours/mine/ours split) had to be discussed and preapproved by both parties. Generally it was just a quick text 'hey hun, i found a great deal on a carpet for that space in the living room, can i grab it?' but it ensured that no one was being taken advantage of, like the wife in this situation.",
              "id": 32,
              "comments": [
                {
                  "score": 15,
                  "content": "My husband and I have a very similar situation set up. All our account are shared, but we agree to discuss anything over $100.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 90,
              "content": "Was that the cell phone thread per chance? Where the wife bought an iPhone or whatever?",
              "id": 34,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1563,
          "content": "$12k was money That His WIFES PARENTS gave them for the baby. Fucking hell, YTA. Is the car even worth that much to resell so you can save your marriage?",
          "id": 35,
          "comments": [
            {
              "score": 725,
              "content": "I love he's like \"*I* had $12k that my wife's parents gave us\" - he doesn't have shit. It was given to both of them with the intention of it helping their child. What a pos",
              "id": 36,
              "comments": [
                {
                  "score": 220,
                  "content": "Right like there's so many levels of fucked it could have been.  And it's the WORST one!  Like it could have been money HE saved for the kid, and it still would have been bad.  Money THEY saved for the kid, worse but still partly his.  Money HIS parents gave them, which his mom seemed ok with it so that wouldn't be too bad.  Money given to THEM for whatever, that they tentatively agreed to save and he spent.... Really fucking bad but maybe he can make it up... \n    \nBut no.  It was money another person gave to his kid, that he only had temporary control over due to his legal status as parent.  And he stole it.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 59,
                      "content": "This. My dad stole money my grandfather had left me as inheritance for college. I was a minor and he had access, so he stole it. I want to say I’ve forgiven him after 30 years, but we do not have a great relationship. It has nothing to do with money, there is no respect or trust for that act and many, many others like it.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 33,
                  "content": "Seriously. Even aside from the ridiculousness of spending that amount of money without consulting your spouse, who you share finances with, I can't believe this guy even thought that he was entitled to SPEND his wife's parents' money, which they sent to set aside for their grandchild, on ANYTHING that had nothing to do with his daughter.",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 32,
                  "content": "I know! The entitlement knows no bounds.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "But the truck is the *definition of happiness*, everyone!\n\n\nNot a lifetime with his wife, not the daughter his wife just conceived, but this beat up truck with a penny glued to the dash. Pure, unadulterated happiness.",
                  "id": 41,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "And CREDIT CARD. Those 7k would feel like 25k VERY soon. YTA",
              "id": 42,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1008,
          "content": "Check out the edit.\n\nHis mom's bailing him out, and he's sorry to US, but not a word about how he treated his wife.",
          "id": 43,
          "comments": [
            {
              "score": 1081,
              "content": "But mentioned she’d been “hormonal”,  Apparently that somehow justifies blowing $23,000?!",
              "id": 44,
              "comments": [
                {
                  "score": 949,
                  "content": ">my wife is hormonal and angry\n\nno she's angry because you went into debt and blew your daughter's college fund on a truck that's so beat up you can't even drive it. Self awareness at it's finest.",
                  "id": 45,
                  "comments": [
                    {
                      "score": 339,
                      "content": "She's angry she married and had a baby with such a selfish, irresponsible dumbass.",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 114,
                      "content": "And the token \"I guess I should mention that\" Jesus Christ.",
                      "id": 47,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 89,
                      "content": "I hated that he worded it like that. Like, yes, she may be full of hormones from having the baby but it seems like a shitty justification akin to saying someone's angry because of PMS",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 60,
                      "content": "My ex husband kept telling people I was angry, had post partum depression etc no I was just mad at him for the 1-100 stupid inconsiderate things he did daily. It came out when the baby was born because you can't be selfish with a baby or the baby will die, E.g you can be 3 hours late to meet me for dinner but can't be 3 hours late feeding a small newborn (ok 3hours would not kill the baby but you get the point)",
                      "id": 49,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 39,
                      "content": "I bet he doesn't help with the baby at all and just makes life more difficult for her.",
                      "id": 50,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 34,
                      "content": "When men (typically ) use   The hormone thing  to gaslight makes me Rage . Hormones don’t make you impervious to logic and blind you from. Being able to form opinions. Hormones don’t invalidate the persons feelings about a given topic",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "I'm always bitching about how annoying this sub has become (well not always. Once or twice, but I think it on a regular basis). Finally, a good post!\n\nThe unreasonable hormones, spending the money HER PARENTS gave for their grandchild. Mommy bailing him out, taking from \"his inheritance\", like her money is already his and who cares if she happens to live longer than she planned (I'm sure 25k plus interest would sure come in handy if she ever needs in home care or has to move). I can finally get my asshole fix\n\nEdit- although after reading his actual comments in here, there's no way this is real. I could see the post being real, but his comments are just ridiculous",
                      "id": 52,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 417,
                  "content": "I think he mentioned that because he thinks she's overreacting and would otherwise be less angry with him. Never been pregnant, but had killer PMS - it doesn't make you irrational, it drastically reduces your ability to tolerate bullshit. That said, her anger is wholly rational, regardless of hormones!",
                  "id": 53,
                  "comments": [
                    {
                      "score": 69,
                      "content": "That's the best description of PMS I've ever seen and I thank you for opening my eyes.",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 58,
                      "content": "I'm currently pregnant and have never been so easily enraged in my life. I *do* get mad over stupid little things, because I just can't have a mild reaction to anything right now. But I do recognize when it's something stupid that I'm mad about, and I'll let my husband know that so he can just let me stew and chill a bit.\n\nThat said, if OP were my husband, even if I wasn't pregnant, he wouldn't be anymore. Fuck if I'd stay with someone willing to throw all our money and then some down the drain over a sentimental whim. Bonus for him thinking that I was overreacting due to hormones and not the fact that *he threw all our money and then some down the drain.*\n\nIf being married to an absolute dumbass is a hormone, then hell yeah it's her hormones!!",
                      "id": 55,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 55,
                      "content": "> *PMS - it doesn't make you irrational, it drastically reduces your ability to tolerate bullshit.*  \n>  \n>I love this line soooooo much.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "You know what else makes you angry, being freaking angry.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 393,
              "content": "It's so ridiculous. Probably why he behaved this way in the first place, his mom is an enabler.\n\nPisses me off more because my wife and I are working as hard as we can to save money to buy a house later this year. I literally texted her earlier to see if it was alright for me to buy a $60 game because we communicate about this stuff.",
              "id": 58,
              "comments": [
                {
                  "score": 269,
                  "content": "This whole post pisses me off because OP was lucky to be gifted money for his daughter's college fund, and he used it for his personal use. My parents had to work extra hard to out aside money for me and my siblings. And he's just spending money willy-nilly.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 21,
                      "content": "The interesting thing is that he phrases it as if this is a once in a lifetime opportunity. When in fact there are plenty of these cars floating around. He could have planned on getting one, saved up some money, gotten a loan at a good rate from a credit union, and done this all with forethought.\n\nInstead he just had to do this right now.\n\nAnd he's upset because he thinks his wife will be upset at him even though he got the good news that he's been bailed out, for \"some reason.\" \n\nHis moral reasoning is literally that of a child! Kohlberg's stage 1: \n\n\" • **Stage 1. Obedience and Punishment Orientation**. The child/individual is good in order to avoid being punished. If a person is punished, they must have done wrong.\" And by extension, if you don't get punished, you didn't do anything wrong.",
                      "id": 60,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 217,
              "content": "if i was his sister i'd be so pissed that some of my inheritance was going to pay for his fuck up.",
              "id": 61,
              "comments": [
                {
                  "score": 36,
                  "content": "Why did his mom do that to begin with? It's grossly unfair. My mom would have told me to get that stupid car on Craigslist ASAP and try to recover even 75% of this idiotic purchase.",
                  "id": 62,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "As the sister of a couple of fucked up golden children who have been given all of our potential inheritance, assuming she is an adult she probably wrote off any money from her mom years ago. I'm sure this is a pattern if Mom was willing to drop 4k initially and then pony up the whole 23k",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 21,
              "content": "Wonder what the fuck he plans to do when his mom eventually isn't around to bail him out. Hopefully his wife sees this as a huge lesson, divorces this \"man\" (attitude of a little boy, so hard to call him a man), and distances herself as much as possible from this asshole.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 554,
          "content": "He went into debt for a nostalgia trip, I can’t even explain how upsetting this must be to college aged kids reading this right now. 12000 is enough to put me and my sister through 2 years at community college. At the end, we would have transferable credit to pretty much any 4 year university of our choosing. I’m just.... let’s cancel this guy already\n\nEDIT; This guy lied to his wife again??? Rip, good luck staying married",
          "id": 65,
          "comments": [
            {
              "score": 63,
              "content": "Yeah and if they started with 12000, it’d be significantly more by the time their child actually hit college. With the way student debt is right now, that kind of money is literally life changing for a young person and the fact he chose a car over that, thinking the nostalgia would be worth more to his child than an affordable education (I doubt he actually thinks that, but that’s what was implied as a justification)...yikes",
              "id": 66,
              "comments": [
                {
                  "score": 40,
                  "content": "As a college student from a family living paycheck to paycheck and having far less than $12000 in savings, graduating in a year with four times that amount in debt and no savings of my own, I am beyond outraged by this guy. I don't know him and yet I'm actually shaking from anger at his irresponsibility, his complete lack of awareness to the huge mess that he's created which is impacting his entire family, and his inability to even show remorse for what he's done, regardless of whether or not he actually comprehends the severity of his actions. \n\n&#x200B;\n\nTo put this short, OP is an asshole and so much worse.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "$12k was enough to pay for 1.5 years at my State College. Jesus Christ man.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 39,
              "content": "12,000 now with the time value of that money in 18 years with tax free growth. He stole 40 grand from his infant daughter",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 20,
              "content": "And 12000$ plus 18 years of compound interest is... YTA.",
              "id": 70,
              "comments": [
                {
                  "score": 16,
                  "content": "Oh my GOD the interest... if that money were to spend 17 years in my term deposit savings, I’d have $19000. Y’all, this is the dumbest shit I’ve seen since last Tuesday",
                  "id": 71,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 442,
          "content": "And in his post he says \"and maybe even I did the right thing.\"  He's absolutely delusional.",
          "id": 72,
          "comments": [
            {
              "score": 82,
              "content": "But it's his wife who's hormonal...",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 401,
          "content": "On top of the fact that he blew the money, it wasn't even money he had earned and put away for the kid, it was money his in-laws had put into the account and cc debt to match. He'd be the asshole in my book even if he wasn't married and had only done this to himself!",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 332,
          "content": "I’m hoping this isn’t real as I can’t imagine someone doing this to their family and claiming “a grey area.”",
          "id": 75,
          "comments": [
            {
              "score": 48,
              "content": "not only that, but the \"solution\" is his mom is now using the inheritance for he and his sisters to dig him out of this. talk about entitled. if i was his sister i'd be so pissed that some of my inheritance was going to pay for his fuck up.",
              "id": 76,
              "comments": [
                {
                  "score": 29,
                  "content": "His sister should run away with his wife tbh",
                  "id": 77,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I ship it.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "More than just a grey area\n\n> I'm hoping its more of a grey area that [sic] anything else and maybe even I did the right thing.",
              "id": 79,
              "comments": [
                {
                  "score": 17,
                  "content": "Honestly baffles me that OP could in any way entertain the idea that he could have possibly done “the right thing.” WTF??",
                  "id": 80,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 310,
          "content": "If my wife didn't kill me for something like this her parents would",
          "id": 81,
          "comments": [
            {
              "score": 167,
              "content": "My dad is obsessed with my husband. He would never talk to him again if he did something like this.",
              "id": 82,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 35,
              "content": "*My* parents would if I pulled this type of stunt",
              "id": 83,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "Not to mention OP’s dad probably would have been *severely* disappointed in him.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 166,
          "content": "Not to mention, it wasn't even him and his wife's money, it was his kids money! Like wtf",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": "An asshole that knows he is doing something wrong so he waits until the deal is done",
          "id": 86,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19154,
      "content": "wow, I have an almost 7 month old and your post literally ruined my day. YTA for this line alone:\n\n>she's still very hormonal from delivery, lack of sleep and breastfeeding so she's having a rough time and is angry a lot. \n\nReally? She's not angry because her husband is the type of person who blew a fucking college fund on a junked out car? \n\nWow this one really affected me. I'm going to leave this and try not to check back in because I'm heartbroken for your wife and daughter.",
      "id": 87,
      "comments": [
        {
          "score": 4479,
          "content": "I'm not married or have kids but this would be a deal breaker for me. I couldn't call the divorce lawyer fast enough and double down on child support.",
          "id": 88,
          "comments": [
            {
              "score": 3070,
              "content": "> double down on child support.\n\nLol, dude maxed out his credit card on to venmo (which adds a 2.5% fee, so he spent even more on this nonsense) with no real plan to pay it back. How much child support do you think this poor woman would get to see?",
              "id": 89,
              "comments": [
                {
                  "score": 1976,
                  "content": "$3.50.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 782,
                      "content": "about tree fitty",
                      "id": 91,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 34,
                      "content": "It was about this moment that I started to realize this wife of his was in fact the god damned Loch Ness monster",
                      "id": 92,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "Damn loch ness monster not paying child support.",
                      "id": 93,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 668,
                  "content": "This is the kind of guy to tell the judge \"But your honor, I spent all my money on a car, I can't pay child support!\" and I'm sure the judge will laugh him outta the courtroom",
                  "id": 94,
                  "comments": [
                    {
                      "score": 276,
                      "content": "And force the sale of his precious old car too lol.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 327,
                  "content": "They can garnish wages for child support. At least she'll have that.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 245,
                      "content": "[deleted]",
                      "id": 97,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 49,
                  "content": "OMG that's even worse! Damn. I have no words...",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "He even admits he doesn’t have money to fix it up from there. So if it breaks down he has a 23k redneck lawn ornament.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1174,
              "content": "Dude how beautifully tragic though. You sell the truck and connect it to your father's death. Then you find the truck, you own it, you feel whole again...and your wife *immediately* leaves you, taking the baby. \"Tears Of A Bronco\", starring James Marsden, Jessica Chastain, and Anna Kendrick* as the baby.",
              "id": 100,
              "comments": [
                {
                  "score": 158,
                  "content": "Animated Baby*\n\nJames Marsden always needs a CGI navigator.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "Still a better plot than many movies. Let's tell it from Wife's POV, since she's the sympathetic character here. A loving heart, she married this guy thinking he needed some help and direction with his life after the death of his father, but he betrays her with the Bronco while she struggles with being a new mom. We can have a nice, tense scene where she's literally mulling over murdering him, but decides that she needs to be there for the baby and just leaves. Guy goes to move in with Mom, who gets upset when she sees how cavalierly he talks about/treats his 'inheritance' while she is still alive, sees how she has messed up raising him, and throws him out. He ends up sleeping in the Bronco, which gets totaled due to his bad driving. Trying to think a way to bring sister into this. Maybe she's a lesbian and ends up marrying the wife, after consoling her for her brother being such a prick, and they live happily ever after with the baby.  Mom tragically dies later because she can't afford her chemo, and doesn't tell anyone she needs treatment because she spent that money on the Bronco, so he ironically actually DOES kill a parent over the stupid truck.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1656,
          "content": "If my husband did this I wouldn't even be able to look at him without foaming at the mouth for at least a week. I'm devastated on behalf of his daughter and wife.\n\nOP you need to Dave Ramsey the crap out of your life right now. You made a HUGE mistake and you are quite frankly lucky your wife hasn't left you *yet*.\n\nThis truck means absolute happiness to you? You stole the happiness away from your wife who would've LOVED to be a SAHM. Now she can't do that because y'all are broke as heck.\n\nAlso, CREDIT CARDS ARE NOT THE SAME AS CASH. You seriously, seriously screwed up. You did not have the funds to do this. You are borrowing from your future.\n\nEdit: OP if you read this and want to know how to fix things? Sell the truck yester-freakin-day and buy yourself a small toy version for nostalgia's sake.\n\nIf you don't sell the truck? I hope the two of you are very happy together for the rest of your life, alone.\n\nEdit 2: Everyone keeps replying about how the wife wouldn't be able to be a SAHM with their financial state. Y'all are forgetting that they are paying for fulltime daycare for an infant. Where I'm from that's $1,500 a month. Could she have been a stay at home mom before? Maybe, we don't know for sure. Can she be a stay at home mom now? No, because she has to shovel her freakin husband out of debt.",
          "id": 103,
          "comments": [
            {
              "score": 645,
              "content": "I am so trying to leave this thread because it's actually making my heart hurt for his wife and daughter. But he keeps saying things that are more stupid than the last.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 127,
              "content": "I like how dave ramseying is a verb now.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": ">I'm devastated on behalf of his daughter and wife.\n\nImagine if he wasn’t able to have his mom bail him out by buying the car. \n\n“Yes, darling, I know you wanted to go to college and come out debt free but daddy needed to relive his youth. Yes, I know the car can’t drive so it’s useless, but have I told you how my dad and I got through the tough times in our relationship by working on it?”\n\n“Dad, I just came to say you’re not invited to my graduation party. And I’m not going to call you anymore”",
              "id": 106,
              "comments": [
                {
                  "score": 43,
                  "content": "Even *with* his mom bailing him out..... His wife will never want to see that truck again if they stay together. It will just remind her that their family were almost in a dire financial situation because of his selfishness. \n\nWhile I get that getting a bailout from his inheritance works to keep them where they were... It's still money that he used without his wife's agreement (I don't mean as the bandaid money, but as the initial payment for this stupid truck). It's still 20k+ that is not coming to their family later. I wouldn't be able to get over this one at all if this were my spouse, on behalf of myself *and* the poor child in this situation who almost had a *future* taken away... Just for her father's *nostalgia*.\n\nDude. If that truck is happiness to you, good job. You've stated so with your actions. Your wife and daughter should be your focus and a point of happiness for you *right now*. I hope your wife wises up and divorces your ass before you unilaterally make more emotional and impulsive decisions that wreck her and your daughter's future.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "My ex-husband did this, except worse.  Our daughter was 2 weeks old, and he came home after being MIA for 6 hours with a brand new, all the bells and whistles, camero.  He traded in his paid off sedan, and got a loan for the remaining $50,000.  When I sat him down and took him through our finances, and showed him there was no way we could pay for it, he said he would take it back.  He didn’t. He hid the car from both me and his family until the (I think) 5 day return policy had passed.  He refused to take responsibility for it,  he blamed me because apparently I should have somehow hunted him down and stopped him from buying it. This was before cell phone gps, and I still don’t understand how he thinks I would have tracked him down.  I would NEVER have thought he was capable of being this person.  But over the next 3 years, the person I married was replaced by a selfish, controlling, irresponsible person.  We ended up having to sell the car, which lost tons of value, for 23,000.  Which meant we were down one car, and owed 27,000 on a loan with nothing to show for it.  I ended up having to go back to work less then 2 months after our daughter was born. \n\nI hope OP’s wife is smarter than me and leaves him now instead of staying for 3 more years like I did.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Right? Rip the damn penny off the truck and keep that... then sell the truck and try and salvage your relationship",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 900,
          "content": "I have a 5 month old, and I can't even imagine the hell I would have rained on my So had he pulled this stunt with me. In fact, I'm pretty sure I would have come to the conclusion that my kid and I would be better off without this financially irresponsible moron in our life and would have divorced his ass (and forced him to sell the car as a part of the divorce settlement). But I'm probably just hormonal from lack of sleep and breastfeeding. What an asshole!",
          "id": 110,
          "comments": [
            {
              "score": 571,
              "content": "but some guy from Colorado on I-25 was coming right now to buy it!!! What was he going to do, NOT give a stranger $23,000 for an old rusty car that no longer passes inspection?",
              "id": 111,
              "comments": [
                {
                  "score": 396,
                  "content": "Yeah, that dude saw a desperate fool and took him for every penny he was worth.  Seriously, a 72 Bronco (47 years old!!!) in need of lots of work for $23,000?",
                  "id": 112,
                  "comments": [
                    {
                      "score": 117,
                      "content": "That's my biggest question. That is a shitload of money for an old beat up car.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "OP there was no guy from Colorado conveniently on the way right then and there. Not only did you make a horrible decision you were legit swindled. \nAlso you did not even check the VIN to see if you had actually owned it!",
                      "id": 114,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 201,
                  "content": "His dad and him got through the hard phases of his teenage years with it! \n\nNever mind the fact OP just strained his relationship for years to come with his own daughter. She’s not going to be happy her dad was willing to blow money that was hers for his own selfish wants. And she will find out. Somehow, she will.",
                  "id": 115,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I have an 8 month old. You know what my husband did when I was hormonal and tired? He bought some formula and took half the night time feedings. He didn't go out and buy a freaking car to make himself feel better.",
              "id": 116,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Definitely hormonal and lack of sleep. Who can't see that he absolutely loves this ~~piece of junk~~ truck and that his love for the truck more than makes up for how badly he screwed over his wife and child?\n\n/s for those who need it.",
              "id": 117,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 470,
          "content": "You missed \"I guess I need to say this.\" Like, no dude, you really did not.",
          "id": 118,
          "comments": [
            {
              "score": 359,
              "content": "Yeah it had no relevance at all. I thought it was going to come up again — but nothing. Why did you say it OP? Because you figured people would sympathize and take your side if you framed yourself as a victim of your wife being irritable after birthing your child?",
              "id": 119,
              "comments": [
                {
                  "score": 100,
                  "content": "I had thought the point of that line was going to be to highlight how his wife ain't feeling so hot lately and he was going to support her decision to become a SAHM.  Turns out it was meant as a justification to completely disregard her feelings so fuck her I guess.\n\nI can't believe this post is real.  Like this can't be a real person.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Yep I thought she did something crazy due to hormones or whatever and in retaliation he bought the car? Idk.  But like, SOMETHING other than \"I am annoyed with my wife right now so I decided to blow her parent's money on my car to get back at her. \" ***Yikes***",
                      "id": 121,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 61,
                  "content": "He was *hoping* it would come up again when everyone told him he was not the asshole because his wife was just being angry and hormonal.",
                  "id": 122,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 56,
                  "content": "And then in the edit he's like \"don't want to go home because my wife will probably be angry about something or another.\" Like, dude!!! She's not getting angry out of nowhere! Maybe look at your actions?",
                  "id": 123,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Ouch just read that after you pointed it out. And if it’s that bad he shouldn’t be avoiding her... couples counseling my dude. Which would probably benefit her greatly. This dude seems to have no self awareness. Of course something like this isn’t going to be over in a day... trust takes longer than one day to repair.",
                      "id": 124,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 39,
                  "content": "Yeah the minute he said that I started seeing red. But hey, maybe because I'm a new mom with a seven month old and I'm angry and hormonal.",
                  "id": 125,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 101,
          "content": "Same. I have an 8mo daughter and I was angry and sad for them too.",
          "id": 126,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 94,
          "content": "I think what he was meaning was that his wife probably had better ideas on how to spend that money if she'd wanted to spend it. Perhaps by taking extra time away from work to finish healing and getting back to herself, not to mention spending time with a still new baby.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 71,
          "content": "“Keep in mind her judgement may be off because she just had my kid and I’m sexist, but I spent money given to US by HER PARENTS for OUR CHILD and instead of saving it I spent it on a useless gas guzzler. But it was one my daddy and I built, and now he’s dead! So there’s NOTHING else to remember him by! Certainly not me, or his first grandchild. I also had to ask my mommy for more money to get it, because I can’t put any of my money in, and I can’t afford to fix it up more. But anyway, am I in the wrong here? Am I the asshole?”\n\nOP sounds like the useless manchild none of us want to be married to.",
          "id": 128,
          "comments": [
            {
              "score": 21,
              "content": "Seriously! And he did this in the context of his wife seriously wanting to try having longer at home with their infant - instead of trying to facilitate for her and their child to have better lives, he decided to go into debt for a completely useless truck because of sentiment. To top it off, he didn't even discuss it with his wife first.\n\nYTA 100%",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "OP does sound like the type of person that would ask an woman who was justifiably angry about something if she was “on her period” or shrug her of as a “hysterical woman”.\n\nAny even if he didn’t mean it in the way sexist pigs describe their wives, you think he’d have a little more consideration for the woman he loves and knows is going through hell.",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "Honestly fuck any man who refers to his wife as “hormonal” to excuse his own bad behavior.",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "The line that got me was \"this car means everything to me\" immediately after talking about his daughter",
          "id": 132,
          "comments": [
            {
              "score": 23,
              "content": "That and \"to me it's the literal meaning of happiness\" because it makes it quite obvious that his wife and daughter don't mean everything to him and aren't his source of happiness. At least he'll have his truck there to comfort him when they leave him and want nothing to do with him!",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14004,
      "content": "> I had $12000 in savings that **my wife's parents had given us**, I maxed out my credit card to Venmo and my mom bought down a check for $4000\n\nYour in laws gave you guys $12k so y'all could get a head start in life as a family and you blew the lot on top of an additional $7k in credit card debt, all without a single word to your wife and the mother of \"the light of my life\"?\n\nYTA.",
      "id": 134,
      "comments": [
        {
          "score": 5033,
          "content": "Jesus Christ if I didn’t think OP was enough of an asshole already, I completely skimmed over that detail and this is just beyond comprehension that he would do that. He just straight up STOLE $12K from his wife’s parents, in addition to the baby, of course everyone is pissed!!\n\nAnd OP, your mom is an asshole too for enabling this selfishness.\n\nEdit: And why is the word \"earmarked\" in quotes in the title?? There was nothing ambiguous about what that money was for.",
          "id": 135,
          "comments": [
            {
              "score": 2758,
              "content": "Not to mention he didn’t even spend the money on something decent. A fucking Ford Bronco that’s older than death. WAT.\n\nEdit: wow, gold! Thank you! 😍",
              "id": 136,
              "comments": [
                {
                  "score": 1419,
                  "content": "But it's going to be a bonding experience with his kids when  they grow up! /s\n\nSeriously, that car is already over 40 years old, it won't even survive to his kid growing up. Even if it did, it would be a sign that he didn't care about his child as much as he did a car",
                  "id": 137,
                  "comments": [
                    {
                      "score": 1067,
                      "content": "\"Hey daughter, I love this car more than you. Let's bond over it! No touching.\"",
                      "id": 138,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 47,
                      "content": "I as a car enthusiast cannot describe how awful of a person OP is. \n\nThat being said, nearly every classic car show I go to has *genuine* 50s and earlier vehicles. I've seen prewar British cars plenty of times. Vehicles that are the least reliable, most rust prone things in existence. Literally 80 years old, and these guys were *racing them* through mountain roads. \n\nCars can survive longer than you think.",
                      "id": 139,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 34,
                      "content": "Mom why is dad forcing this Bronco thing with me? I like my hoverboard just fine. Daughter, have I not told you the story of how your father and I got divorced?",
                      "id": 140,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 995,
              "content": "My mother contributes $100 a month to our son’s college fund (we do $200 and make a lot of sacrifices to do that much). That money is sacred. I have it set up so that her money doesn’t even touch our accounts. I wanted to make it 1000% clear that her generosity went directly to her grandson, and not used to cover some unexpected expense.\n\nI want to punch the wall thinking about those grandparents wanting to give their granddaughter such a wonderful gift, and have it taken from her by her own father.",
              "id": 141,
              "comments": [
                {
                  "score": 269,
                  "content": "But why is college even *necessary* any more? His daughter might have a running Bronco when she grows up now??? (And for *ONLY* $23,000) \n\n/s.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 67,
                  "content": "How much scrimping did the grandparents do to make that sacrifice? Saving over years...gone in an instant.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 65,
                  "content": "My in-laws also contribute to our kids' college funds. That ish goes straight to a 529.\n\nMy parents spent all of our college funds building their dream house.",
                  "id": 144,
                  "comments": [
                    {
                      "score": 30,
                      "content": "Sounds like they’d totally approve of OP’s purchase. Sorry they sucked, but I’m happy to know your kids will be better off!",
                      "id": 145,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 900,
              "content": "I skimmed over it too. The edits are worse. Mommy is buying the car instead, and is doing so by using both his and *his sisters'* inheritance. Dude can't go a day without stealing from someone.\n\nWife needs a divorce. Shouldn't even have to fight for custody. Her husband is a thief who's happy to get himself and every person around him into crippling debt on a whim. Not only that, but she should be watching her credit score, and checking for fraudulent accounts and credit cards. She should be doing the same for the baby.",
              "id": 146,
              "comments": [
                {
                  "score": 337,
                  "content": "I’m guessing from the edit that OP was spoiled as hell growing up and that’s why he is the way he is today.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 218,
                      "content": "His mom just hands him over $4000 no question and then buys the car back from him with even less questions, screwing over her daughter in the process. OP is definitely a mamas boy",
                      "id": 148,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 86,
                      "content": "Dingdingding.\n\nPeople who grow up in homes that enable them financially like this lack any consideration for the situation. They have no concept of the value of money, because it's just \"always there\" and whenever it's not your parents just hand you more. \n\nOf course it doesn't seem weird to drop $23,000 on something when you've never had to learn how important each of those $1 are. \n\n\"Why is it such a big deal I spent the money our parents gave us? They have more money, and it's our inheritance anyway, it's not like we aren't paying for it ourselves after all.\"\n\n\"No, really, there's nothing unusual about mother dropping a cool $23,000 to help make my wife and her parents feel better. It's my money, after all, from my inheritance. She's not \"bailing me out\" lol, be serious guys.\"\n\nYou know what a bailout is? Saving someone from something they can't fix themselves. You know what an outrageous bailout is? Saving someone from their own stupidity. \n\n$10 (because I'm a poor bastard) says the mother doesn't see anything wrong with it either. Considering she's going to foot the bill for the car to be repaired in any way it needs to be. Sounds almost like she's part of the problem.",
                      "id": 149,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 58,
                  "content": ">She should be doing the same for the baby.\n\nI didn't even think of this....but yeah OP sounds like the sort-of asshole who would open credit cards in his kid's name as well to pay off his debts. Hopefully the wife can lock the kid's credit somehow. I know you can do it as an adult and hopefully you can for a child - I would think nothing else a judge would order it reading this case.",
                  "id": 150,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "Oh wow I just saw the edits. This guy can’t be for real.",
                  "id": 151,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "He keeps saying it's his (and sister's) inheritance like he already has the money, dude if your mum is alive it's not your inheritance yet, it's just straight up your mum's money!",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "“Dude can’t go a day without stealing from someone” 😂😂",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "The edits are SO BAD.\n\n>I found a solution and it’s coming from me and my sisters inheritance so it’s not like I’m not paying for it on my own eventually.\n\nUmm... His inheritance is still his mom's money (for now). She could technically spend it all before she dies and he'll have nothing. The fact that he's already considering her money his is the definition of entitlement \n\n> I know my wife is going to be upset for one reason or another\n\nHe still can't admit she's going to be mad at *his* mistake? He's acting like she's getting mad for some unknown reason. Take some responsibility, man!",
                  "id": 154,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 16,
                  "content": "I'm sure this will go over so well when his sisters find out that part of their inheritance is going to bail out OP's poor stupid financial planning and it won't even be their car. I have a feeling this is just another thing in a long line of their idiot brother getting bailed out and rewarded. A good man will buy back the car from mom in full so the sisters get their share back and you know learns from his mistakes but from the sounds of it that ain't OP.",
                  "id": 155,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "It's earmarked just like the money for the Nintendo Switch was \"earmarked\" for kitchen pots and pans, of course",
              "id": 156,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 79,
          "content": "Just look at how he phrases it: \n\n\"**I** had $12000 they had given **us.**\"\n\nThat's some asshole thinking right there.",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "This was the first detail I wanted to highlight and I had to scroll down to get to it.  It's not a gray area, lol.  That money wasn't his, it was for their grandchild and he stole it. Lol. This guy is top-notch off his rocker.",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Had time to call his mom and time for her to DRIVE THERE and bring a check but not even 5 minutes to call his wife... yikes. He purposely avoided calling her so she couldn’t say no when it was already sitting in the driveway. He knew what she would say so he just did what he wanted anyway and was just going to make her deal with his decision.\n\n“My wife is going to be upset for one reason or another” like it’s her fault for not understanding the insanity. Dude needs a reality check.",
          "id": 159,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "The wording here is telling too. The in-laws gave their *granddaughter* money via her parents. The inlaws hadn't even really given it to them as a couple. What does OP say? \"***I*** had $12,000...\"",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9609,
      "content": "YTA, its not a grey area, you used your kids college fund for a car.",
      "id": 161,
      "comments": [
        {
          "score": 3767,
          "content": "plus went into additional debt. just using the college fund would be bad enough but he took on another $10k in debt. what an idiot.",
          "id": 162,
          "comments": [
            {
              "score": 1591,
              "content": "In credit card debt that he doesn't have the money to pay back so their credit score is definitely taking a hit.",
              "id": 163,
              "comments": [
                {
                  "score": 803,
                  "content": "And probably at 20+% interest if he can't even scrounge up $10k in cash.",
                  "id": 164,
                  "comments": [
                    {
                      "score": 734,
                      "content": "But he's so happy with the car. Yaaaay.",
                      "id": 165,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 381,
                      "content": "I just checked with my chase card, a cash advance comes in at a 27.24% interest rate.  According to bankrate, that $7k cash advance will cost him over $15k over 17+ years if he only pays the minimum.  Jesus christ OP.  Your daughter will be going off to college at this point.",
                      "id": 166,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 172,
                  "content": "To heck with the credit score, they're not going to get a low enough utilization rate to be able to use the credit score. That interest is going to pile up hard.",
                  "id": 167,
                  "comments": [
                    {
                      "score": 146,
                      "content": "1972 Broncos basically pay for themselves.  /s",
                      "id": 168,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 188,
              "content": "And don’t forget half the money was his what his wife’s parents gave for the college fund",
              "id": 169,
              "comments": [
                {
                  "score": 167,
                  "content": "Yeah “Aita if I take all of the money given to my child by my WIFES parents” lol what was OP thinking making this post?",
                  "id": 170,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 934,
          "content": "He stole from a literal baby.",
          "id": 171,
          "comments": [
            {
              "score": 649,
              "content": "And his wife. She wanted to be a stay-at-home mom. Now, they're in debt - no way she can stop working.",
              "id": 172,
              "comments": [
                {
                  "score": 411,
                  "content": "Financial infidelity is real.",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 246,
                  "content": "Plus, now that she will have to keep working, they will have to spend a fortune on a daycare and babysitters which she doesn't feel comfortable leaving her baby in. I cannot imagine how I would feel in her shoes if my spouse made such an insanely expensive purchase without me.",
                  "id": 174,
                  "comments": [
                    {
                      "score": 62,
                      "content": "[deleted]",
                      "id": 175,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "Don’t forget his wife’s parents! They were the ones that gave them the 12k. They will never make mistake again. OP your parents in law will now never trust you with money again, and when your daughter is old enough to go to college they will be the ones to come out and say ‘here is your college fund’ and will look like the heroes and good people and you will look like the bad kid who can’t be trusted with alone in the room with a plate of cookies, because you can’t be.",
                  "id": 176,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Even outside of that, the financial insecurity would rock me. We have an infant and now, on top of everything else, I need to be worried about ordering too much formula at one time and now we can’t pay the electric bill? Forget staying at home, their current day care could close in the middle of the night, their only other option could be $250 a week more expensive, and now suddenly they are screwed. Forget her college account, this kid doesn’t seem to have a financial cushion to protect her because her dad is a child himself.",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 482,
          "content": "And is a junked 1972 Bronco worth anywhere near $20,000?",
          "id": 178,
          "comments": [
            {
              "score": 334,
              "content": "Seriously though.... You could get a brand new car for that.\nI understand the sentimental value but.... This is still insanity",
              "id": 179,
              "comments": [
                {
                  "score": 45,
                  "content": "That's not how it works for \"car guys\" they hardly ever make logical decisions when buying cars, it's an emotional investment, cranked up to a 100 on OPs case since it's the car him and his late father worked on, if you tell a car guy not the spend 50k on a used X car when you can buy a new but different one for the same amount or less they'd laugh in your face.\n\nI've seen some sink thousands of dollars into a car for modifications then sell it for less than what they paid for it and lose the money on everything they installed. \n\nOP is still the asshole because he has a family and an spouse that he needs to consult before spending that much money.\n\nHonestly I think he didn't consult her because he knew she would say 'absolutely not' and it was easier for him to ask fo forgiveness than ask for permission.",
                  "id": 180,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 20,
                  "content": "He had time to call his mom for $4K but not his wife? Why is earmarked in quotation marks when his in-laws gave the couple that money for a college fund? What is up with his mom that she’s so willing to bail him out and is letting him keep the fucking car as part of the bargain? \n\nThere are so many red flags here you could make a quilt. Biggest one of all being that he sees this as a profit and not as a colossal fuck up he did nothing to fix.",
                  "id": 181,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 246,
              "content": "Sadly yes, my dad was looking at Broncos from the 70s not long ago and they were running in the 30k range. \n\nOP is still an idiot and asshole for not discussing it, stealing a college fund, maxing cards, and borrowing from mom, for a vehicle he can't even use because he states he can't afford the repairs.",
              "id": 182,
              "comments": [
                {
                  "score": 187,
                  "content": "It sounds like this is a completely uncared for 1972 ford bronco. I looked it up, and one that was showing obvious signs of use and wear (but mechanically sound, which I doubt this one is) is worth about $18,000.",
                  "id": 183,
                  "comments": [
                    {
                      "score": 359,
                      "content": "I sincerely doubt the seller was “just about to meet some guy” with 21k.  He probably saw how excited OP was and quickly thought up a crazy number on the spot.",
                      "id": 184,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 171,
              "content": "I came here to say this so I looked it up on autotrader. Some get really expensive. But that being said, most are in pristine condition and are around 48k-50k. Near junked I'd put at maaaybe 10k and that's stretching it. Finding parts and repairing will be pricey so I'd drive it down to around 5-7k. No way dude had 2 different people offering over 20k for it",
              "id": 185,
              "comments": [
                {
                  "score": 180,
                  "content": "Clearly this dude rolled up and was salivating, and the other guy played him like a fiddle",
                  "id": 186,
                  "comments": [
                    {
                      "score": 58,
                      "content": "\"Oh this is your childhood car? That's a shame because someone is only a few hours away about to pay 15... 21 thousand dollars for it.\"",
                      "id": 187,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "The second he lost his shit over it being his car that guy knew he had a sucker. There definitely wasnt a guy literally on his way to buy the car that moment",
                      "id": 188,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 166,
              "content": "it is if there is \"a guy from Colorado on I-25\" on his way to buy it, RIGHT NOW!!@!#!",
              "id": 189,
              "comments": [
                {
                  "score": 39,
                  "content": "He’s coming with uhh 19? No... 21, yea 21K... like right now!",
                  "id": 190,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 28,
                  "content": "Hot singles in your area are interested in buying this Bronco.",
                  "id": 191,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "This is totally real, I'm the guy from Colorado.",
                  "id": 192,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 17,
                  "content": "This is the part that irked me the most. So the previous owner is ready to fuck over some random dude whom he already promised to sell the car if OP can get 2k extra \n\nYeah something tells me OP has never been house hunting",
                  "id": 193,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 197,
          "content": "His Daddy gonna kick his ass from beyond the grave",
          "id": 194,
          "comments": [
            {
              "score": 166,
              "content": "if his dad is as good a dad as he thinks, he's probably horrified at what his son has done.",
              "id": 195,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "Therapy to work through trauma and grief would have been cheaper than projecting onto this money sink.",
              "id": 196,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 122,
          "content": "Plus it seems most of the money wasn't even his to spend if given by the grandparents......",
          "id": 197,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 34,
          "content": "Had it been necessary for transportation it could be understood. People go through rough times and sometimes it’s necessary to dip into savings for survival. But not for a $23k sentimental and useless junk heap.",
          "id": 198,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7611,
      "content": "YTA. The backstory doesn’t make you any less of an asshole it just explains why you acted like an asshole.",
      "id": 199,
      "comments": [
        {
          "score": 3760,
          "content": "I think the back story makes him *more* of an asshole....",
          "id": 200,
          "comments": [
            {
              "score": 2781,
              "content": "\"Hey Dad in memory of what a great father you were I'm going to fuck over my ~~son~~ daughter\"",
              "id": 201,
              "comments": [
                {
                  "score": 1005,
                  "content": "No, it’s his daughter. If it was his son, he probably would have said he bought the bronco ‘for him’.",
                  "id": 202,
                  "comments": [
                    {
                      "score": 444,
                      "content": "Oh, he's already said something like that elsewhere in the comments. He spouts off about how his Bronco is supposedly worth $80,000 (in mint condition, whereas he still needs to put in $10k just to make it decent,) and that surely that'll be worth WAAAYY MORE by the time she's 17/18 and going to college, AND they'll have their own memories with the vehicle.\n\nSafe to assume, I don't think he foresees the 'happy memories he'll make with his daughter' will include this purchase being the reason why his wife might leave him, or all of the family strife this will/has caused.",
                      "id": 203,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "Man I will never get passing vintage cars down to the males in a family line. \n\nMy father wants to give his ‘65 Ford Falcon to one of the grandkids. \n\nLike, fuck that. None of them nor their parents have been nearly involved in the process as much as I have, or my mom. But heaven forbid his daughter have a fucking kick ass vehicle. The *men* deserve it obviously.",
                      "id": 204,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "*\"This car means everything to me\"*. Unlike his wife and kid.",
              "id": 205,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 273,
          "content": "It definitely provides context that he'd be justified in spending some serious money on therapy -- but that's probably still not $23k.",
          "id": 206,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 215,
          "content": "Did you see the edit where his mom is bailing him out of this mess at his sister’s expense? Crazy.",
          "id": 207,
          "comments": [
            {
              "score": 34,
              "content": "I can't even imagine what his sisters will think when they find out his mom gave a big chunk of their inheritance to him for an old Bronco regardless of how much it means to him. His sisters get absolutely nothing for it.",
              "id": 208,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 117,
          "content": "The backstory literally makes it worse. \n\nIf he had skimmed a few hundred, maybe one or two g's from his kid's account that he and his wife had saved the money for with all the nostalgia and \"I really hope I can use this same truck to form a bond with my daughter someday,\" sure. Less of an asshole. \n\nBut this was gift money, not for him, that he didn't earn, and that he used ALL of. Plus fucking up a credit line. *And* he manages to shit on his poor wife at the same time. Like wtf.",
          "id": 209,
          "comments": [
            {
              "score": 46,
              "content": "I understand you might think I'm an asshole but does it help if I told you I think my wife is a hormonal bitch sometimes?",
              "id": 210,
              "comments": [
                {
                  "score": 22,
                  "content": "As soon as I saw he wrote that his wife was \"hormonal\" I knew he was an asshole.",
                  "id": 211,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Seriously. I have this little game I play with myself on this sub where I try to make a decision with just the title and then see if the description changes my mind. With this one I was pretty much 100% before even reading. There's nothing that can make this okay.",
          "id": 212,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5661,
      "content": "i hope this isn't real.\n\nthis is one of the worst justifications for theft that I've seen in a while. \n\nyou're so selfish.",
      "id": 213,
      "comments": [
        {
          "score": 1755,
          "content": "I’m mostly of the opinion this can’t be real, right?  It’s just one asshole thing after another - like the Asshole Perfect Storm.  Someone’s shooting for the Reddit Bigtime",
          "id": 214,
          "comments": [
            {
              "score": 564,
              "content": "Agreed, it's like he has a bingo asshole card and just picked 5 asshole moves to incorporate into a story.",
              "id": 215,
              "comments": [
                {
                  "score": 784,
                  "content": "Let's see: wrote off his post partum wife's legitimate anger as overly hormonal, stole from a literal baby, made a large purchase without consulting his partner, wracked up considerable debt with no plan on how to pay it off, and puts his nostalgia boner ahead of his child's future. \n\nIs that a bingo?",
                  "id": 216,
                  "comments": [
                    {
                      "score": 223,
                      "content": "That's a bingo!",
                      "id": 217,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "And parents throwing large sums of cash at adults. It's like a machine learning generated AITA post.",
                      "id": 218,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 221,
                  "content": "He didn’t need the “free space” in the middle 😂",
                  "id": 219,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 222,
          "content": "Yeah I’m not sure if this one can be real it has to be a troll. I’m not sure if people that make decisions like this actually exist.",
          "id": 220,
          "comments": [
            {
              "score": 227,
              "content": "Imagine this scenario. You find a truck you want to buy. You put together your child's money from your inlaws and money from your credit card. You still don't have enough! You call your mother and tell her your brilliant plan and she brings you a cheque for $4K...",
              "id": 221,
              "comments": [
                {
                  "score": 147,
                  "content": "Oh man you’re right. This would also require a dunce of a mother.. I think we might need r/karmacourt for this one boys",
                  "id": 222,
                  "comments": [
                    {
                      "score": 149,
                      "content": "I mean, he could have told mom he needed $4k for his dream car and left out that he had already bankrupted his family and stolen from his baby. I could see her believing that piece of crap was worth $4k for the sentimental value.",
                      "id": 223,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 44,
                      "content": "If he played the “But Dad would have wanted...” card on her I can see how she fell for it.",
                      "id": 224,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 147,
          "content": "I'm pretty sure Venmo's rolling weekly limit for transactions is $2999.99 (which is the upper limit, given only to those who have verified their account, its even less if you haven't), so either his financial breakdown isn't accurate, or this is not real. Or maybe I just really hope this isn't real because this is a level of assholery where I am kind of rooting for a divorce, which makes me feel icky.",
          "id": 225,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4359,
      "content": "Jesus Christ. YTA. You're not only the asshole, you'll be lucky if you don't end up divorced. I would have left you that day because I would absolutely never be in a relationship with anyone who \n\n1 made a purchase of that amount - WITHOUT DISCUSSING IT FIRST\n\n2 maxed out their credit card for a memory - WITHOUT DISCUSSING IT FIRST\n\n3 borrowed money from other people on a whim - WITHOUT DISCUSSING IT FIRST\n\n4 put our daughter's financial future at risk\n\nHonestly, 4 would be the smallest issue because, as you say, she's young. But the complete financial and communication betrayal, your utter selfishness and disregard for your family, and your amazing levels of disrespect for your wife would mean I would never be able to trust you again.\n\nYou are a terrible husband, father, and partner. Grovel until your knees bleed, sell the stupid bronco, and hope she doesn't run fast and far with your kid.",
      "id": 226,
      "comments": [
        {
          "score": 1798,
          "content": "Don't forget  \n5 Can't afford to actually use the thing he bought.",
          "id": 227,
          "comments": [
            {
              "score": 629,
              "content": "Yeah, that came later. That he needed an addition 20k ish to get it working. Christ.",
              "id": 228,
              "comments": [
                {
                  "score": 31,
                  "content": "Holy shit, really?",
                  "id": 229,
                  "comments": [
                    {
                      "score": 58,
                      "content": "Not to get it running, but putting 20 grand into a used Bronco isn't out of the question depending on it's condition and how far he takes the restore/paint/body/engine/suspension/interior. \n\nWe don't have to worry though, because OP definitely doesn't have any money to spend on it. Yay!",
                      "id": 230,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "That’s just the money they would have used to pay back the massive debt he just created. \n\n\nI am honestly blown away by how selfish this guy is. I sincerely hope we read a TIFU in 6 months about this guy’s wife leaving him over this.",
                  "id": 231,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "Would 6 be that his mom took money from his AND his sister’s inheritance to pay back the money? Or did I read OP’s second edit wrong?",
              "id": 232,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 681,
          "content": ">sell the stupid bronco\n\nI'd be surprised if he doesn't come home from work some day to find his wife has taken a sledgehammer to it. Can you imagine how much she fucking hates that car and everything it represents right now?",
          "id": 233,
          "comments": [
            {
              "score": 652,
              "content": "also 23k for a 72 bronco? He got played for a fucking fool. He let out that it was his car and had sentimental value. If I were the seller I would have asked for 30k from a chump like that.",
              "id": 234,
              "comments": [
                {
                  "score": 266,
                  "content": "He'd probably still have found a way to mortgage his soul to buy it.",
                  "id": 235,
                  "comments": [
                    {
                      "score": 273,
                      "content": "Seriously. He said it needs alot of work. One in \"great\" condition looks to cost 25-27k. He got fucking scammed. That guy could have taken him for a few more grand.",
                      "id": 236,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "OP doesn't seem like the type to mortgage *his own* soul.",
                      "id": 237,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 213,
          "content": "Add a 5. Completely disregarded goals you set with your spouse for your family - her being a stay at home mother. I know the song says 'all you need is love', but love don't pay CC debt.",
          "id": 238,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2545,
      "content": "YTA.\n\nThis whole story is a reflection of your priorities. You have a wife and a child who presumably love you very much, and in-laws who are generous in helping you and your wife provide for your child's future needs. And yet when you get an opportunity to show your commitment to all of those wonderful people OR do something that is super incredibly meaningful to you and only you, you don't hesitate to disrespect your wife, cheat your in-laws, and steal from your child. What YOU wanted trumped what every one of them would have though or felt about your actions.\n\nYou're trying to justify what you did by saying \"It'll be my daughter's and we'll have such good memories and it will be worth so much more and we'll recoup the money I foolishly spent.\" And, in truth, you could make great memories with your daughter in this car. However, you could make great memories with your daughter with any car. This car is only important because it makes the memories better FOR YOU, meaning even your justification is selfish.\n\nOn top of that, ask yourself why you didn't pause for 30 seconds and call your wife to ask her about this purchase before you made it. Was it because you didn't even think about her because you were so focused on yourself? Was it because you didn't think her opinion mattered because this was SO important to you you didn't care what she thought? Was it because you had a sneaking suspicion she'd say no and wanted to ask for forgiveness instead of permission?\n\nI get that it was important to you, but $23K is a LOT to spend on something that is only important to you, and is just a slap in the face to those involved when it wasn't even your money to spend in the first place.",
      "id": 239,
      "comments": [
        {
          "score": 722,
          "content": "Like he could have spent money treating his wife because it seems like she's in a really sensitive place right now and instead of showing her how much she means to him he is doing this? I'm all for people taking care of themselves by buying themselves stuff (retail therapy works, people) but he used ALL of their money. \n\nThe most immediate concern is not about his daughter's college fund but in the case that there is an EMERGENCY.",
          "id": 240,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 238,
          "content": "By the time kiddo is ready to drive it the car will be nearly *70* years old. What the fuck kind of moron is OP exactly? Would've just been sweeter if he took the penny from the car and moved on, knowing he's started a new chapter in his life with a wife and family that loves him. What an asshole.\n\nYTA OP.\n\nEdit to add: 1972 Ford Bronco? Just looked it up and imo this car is ugly as fuck. You betrayed your family for a lemon of a Tonka truck? What the fuck.",
          "id": 241,
          "comments": [
            {
              "score": 64,
              "content": "Right? I get how it was pretty wild running into your beloved childhood car with the penny underneath. Take the penny and a picture and move on.",
              "id": 242,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 89,
          "content": "Didn't even take the chance to talk him down on the number, check the VIN, make sure that car actually ran (and ran well), fuck man. You're impulsiveness is fucking you and your family over. Hopefully you can sell it at a similar price in a few months when you can't afford payments",
          "id": 243,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Or did he not call his wife because he knew she'd be furious and would rather apologize than ask for permision",
          "id": 244,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2430,
      "content": "YTA. If that car is more important to you than your child's education, your wife/her parents' trust, your credit score, your/your daughter's/your wife's financial security, you should divorce your wife, leave your child, and marry the car. You did not consult your wife and spent tens of thousands of dollars (the majority of which was communal savings for your daughter's college fund that was a gift from your in-laws) without so much as a phone call, yet you had plenty of time to contact your mother to help you in this hare brained scheme. This was irresponsible to an honestly cruel degree. College takes time to save up for, and the $12,000 could've sat and accrued some amazing intrest if you had stopped to think. Plus, this car is already pushing 50 years old. It's not worth that kind of money in my opinion- and even if it was, you've traded MAYBE five to ten more years of it running (with constant and expensive repairs) for your daughter's future and your relationship with your wife. That's a spectacularly bad deal to carry for the rest of your life for a few more years of reminiscing about your dad. I'm sorry you lost him so early, but I can't imagine any parent thinking this was a good idea- your mom included. I'd mark that everyone sucks just because your mother took it upon herself to prioritize a car over her granddaughter and daughter in law, but your wife doesn't deserve even the slightest implication of being in the wrong over your stupidity.",
      "id": 245,
      "comments": [
        {
          "score": 720,
          "content": "Even his DAD would have told him this was an insanely stupid and bad idea.",
          "id": 246,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 647,
          "content": ">but your wife doesn't deserve even the slightest implication of being in the wrong over your stupidity.\n\nBut she was moody, and hormonal, and breastfeeding, and angry still /s\n\nShe’s real angry now that she realizes she just sacrificed her body to give birth to some selfish dumb fucks kid.",
          "id": 247,
          "comments": [
            {
              "score": 59,
              "content": "His mom is also an asshole for giving him money for a fucking toy (only as long as he didn’t lie to her about the whole thing).",
              "id": 248,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "> \n> But she was moody, and hormonal, and breastfeeding, and angry still /s\n\nLuckily he fixed that. She is now angry for objectively correct reason without any \"emotions\" as wriggle room for him to dismiss her.",
              "id": 249,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "“You should divorce your wife, leave your child, and marry the car” \n\n🤣🤣🤣 almost made me pee my pants on the treadmill",
          "id": 250,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1780,
      "content": "YTA holy shit. You spent so much money that was not remotely yours to spend. You basically stole from your in-laws, your wife, and your daughter",
      "id": 251,
      "comments": [
        {
          "score": 393,
          "content": "Came to say this. If it had just been his own savings, that would be extremely stupid but... ya know, his money, and yes, he'd have 18 years to save it back up. He'd be an asshole for not clearing that purchase with his wife regardless, as they are now a team! But knowing it was a GIFT from his in laws? holy SHIT! I'd be furious, I'd probably seek a divorce on the grounds that he legitimately stole from the wife, her parents, and the baby. Disgusting.",
          "id": 252,
          "comments": [
            {
              "score": 42,
              "content": "Exactly! The story would’ve made it closer to a grey area if he could’ve afforded the car. But holy shit going into credit card debt on top of wiping out your in laws gift money for your child, that’s monumental levels of being an inconsiderate asshole",
              "id": 253,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "> But knowing it was a GIFT from his in laws **for his daughter**? holy SHIT! I'd be furious\n\nFTFY, dang OP, YTA big time.",
              "id": 254,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 61,
          "content": "He's now also stealing from his sister, since Mommy Dearest is bailing him out, and taking money out of his AND his sister's inheritance directly to 'cover the cost', as per his newest update.",
          "id": 255,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "And after seeing the edit, he ended up essentially stealing from his sister too!",
          "id": 256,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}