{
  "post content": "I (21 F) and my childhood bestie. Have always been friends and she got engaged 5 months ago to her boyfriend of 6 months. We had planned our weddings since we were 14 and she wanted a castle wedding with a ballgown. Two months ago she found her dream castle in which she booked the wedding in 4 months. She just asked for a 280 dress for us plus for us to pay 1/10 of a 2000 wedding dress there's 6 bridesmaids which is 200 dollars plus a 14000 Bachelorette party which 2333.34 per person and a 600 bridal shower. The total is 2,913.34 which i can't afford i am still in university and finish in a few months  before the wedding but I am 100,000 in debt. I told her I can't pay for her wedding dress and 14000 Bachelorette party. Not even including the flight. She wanted us to also pay for makeup and hair we are not allowed togther. She also wants my hair dirty blonde I am a red head and can't dye it back. She also wants us to get her wedding gifts from the registry and pay for our own dinner. I told her at this point I can't afford that and she freaked out saying I am an A-hole cause it's her big day and I helped her plan it at 14. I told her I am not in a financial situation to do this but I can try to work my butt off to afford it. AITA if I tell her I cant afford this i don't want to ruin her wedding and our friendship.\nSo I ask AITA\nUpdate guess what he called offthe wedding and now she is trying to get a refund in everything and the down payment back and dropped out of university i feel kinda bad but karma is a b**ch",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "NTA. You cannot be held to a promise you made when you were 14. Life circumstances change. You have to take care of yourself first and that includes finances. She's asking a lot from all of you.",
      "id": 2,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA",
      "id": 3,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. Yikes an entitled bridezilla. Just tell her you can’t afford it. You love her and would like to be there for her big day but just financially strapped. If she’s a true friend she’ll understand. If not, move forward.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Why the hell does a bachelorette party cost 14k!??\n\n NTA at all, shes asking way too much of everyone especially bc I'm sure shes aware of ur current financial situation. Its common to have bridesmaids pay for their own dress and flight, maybe makeup but def not her dress and crazy expensive party.",
      "id": 5,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. Bridesmaids don't pay for the wedding dress. And they don't have to dye their natural hair color away. If you don't have the money you don't have the money.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. This isn’t a wedding. It’s a fundraiser at $3,000 a plate for OP. For that price, I better get a boob job as my bridesmaid gift since she wants Malibu Barbie as her bridesmaid.",
      "id": 7,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "Hoo boy, if this has not yet been cross-posted to brideszillas, it will be soon! You are NTA, but sounds like you need a new bestie, because she's a major AH.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "I have never heard of a bridesmaid being expected to pay for a portion of the bride's dress. I imagine this \"friend\" doesn't even really want the groom.  She just wants the wedding.",
      "id": 9,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "My favorite remark is that you helped her plan this at 14. Point out to her that you are no longer 14 and now have grown up responsibilities and realistic ideas. She will need to work and save up for what she wants, and she may want to reconsider that a 14 year old's ambitions may not be what she should aim for as an adult.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Jesus Fucking Christ, I am so tired of people who want to have a wedding they so obviously cannot afford, and expect other people to pay for it. This appears more like extortion than an invitation to be a bridesmaid. A six month relationship? Fuck me, the marriage will probably not last that long. If she was truly your friend she would understand. She is not and does not. Time to cut her loose. 110% NTA",
      "id": 11,
      "comments": [],
      "relation": "Support"
    }
  ]
}