{
  "post content": "Hello everyone, \n\nI'm chronically ill and I've lived alone for 5 years\nRecently my illness got so bad I had to quit my job and move in with my grandpa\n(He raised me)\n\nHe has leg issues and pain but swears he is okay and won't make a doctor's appointment, I've been begging him to make one.\n\nHe wants to sit in the dark all day and watch TV and he has done nothing in the past 5 years to keep up with the house. \nIt has two bathrooms and the floor caved in one of them so it's locked and nobody can go in there. \nThere's holes all in the floor, and the place is absolutely disgusting. There's mold everywhere, every appliance is so dirty. My sister and I have to beg him to shower so he won't stink.\n\nI asked him to make a doctor's appointment and take me with him because he lies and tell the doctors he is fine. He is a pathological liar.... he makes stuff up all the time. \nI have cleaned the whole house to help him and to also give me peace of mind about staying here. \nBut now I cook every meal and clean... which I don't mind but I am constantly in my own pain. \n\nI asked him today if he was depressed because the microwave had mold in it and he uses it everyday. So I cleaned it, and asked if he needed mental or physical help, because the condition of the house is not sanitary.\nHe got defensive and told me he is fine and I need to mind my own fucking business. \n\nI grew up in this house, it was beautiful when my Nana and him were together. But she did everything and he would just sit around and be mean to her. \n\nI'm mad at him for letting the house become this disgusting, it's literally falling down\n Around us. Why didn't he ask for help, or tell anyone, or reach out? \n\nEarlier I was doing the dishes and I asked him where he wanted me to put them, he said on a tray he had..... and it was moldy. So I told him I'm not gonna eat anything that touches that and it needed to be cleaned, which I wouldn't mind doing.\n\nHe says I'm ungrateful.\n\nBut I truly think we all deserve a clean and habitual home.\nAlso my twin sister has lived with him for years and she's able bodied unlike the two of us. So I'm mad at her too for sitting in filth. \n\nSo guys... am I an asshole? \n\n\nI've decided from this point on if something bothers me I'll just keep it to myself and clean it. \nBut I don't know how much longer this house will be liveable, despite my best efforts.",
  "id": 1,
  "comments": [
    {
      "score": 23,
      "content": "This sounds like something else may be going on like dementia or Alzheimer’s. If you can get him to a doctor, I would ask about it. NAH.",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "Agreed",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "NTA unfortunately often older people tend to just be happy in their environment and not want to admit they need help (even though they clearly do) because they don't like change and want to be able to live independently etc. \n\nSorry you have to live in such an unclean environment but good on you for trying to make it as nice as possible.",
      "id": 4,
      "comments": [
        {
          "score": 5,
          "content": "I've got it as clean as it can be. And hopefully I won't be here too long. \nThank you for sympathizing with me 😭😭😭",
          "id": 5,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA. You can’t help people unwilling to help themselves. If you’re concerned about your grandfather, please call your local Office on Aging. Tell them about the home, the problems, his pain/leg issues. They may be able to help. Best of luck.",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Ok..  Not wrong for feeling it is gross, but yta for saying it to your grandfather in that way\n\nFirstly, with my older sisters and mum aging- having a large age gap makes a huge difference. Their eyesight is getting worse, and it takes effort to focus to look at details. \n\nCleanliness takes effort. Sometimes trying very hard to clean doesn’t pay off as their body betray them and miss parts or make things dirty quickly. \n\nNo one likes staying in a dirty place, but it takes its toll on people. You need to put in effort to get clean. But you don’t have the mental/physical strength to clean either. So you just stay put and justify that it’s ok. \n\nMy suggestion (which is very very hard to do), is to get the place cleaned up, then basic maintenance will be less overwhelming for him. I’m not sure where you are but there are people/organisations that can/will help.",
      "id": 7,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I am an asshole because I'm telling my grandpa his house that he is allowing me to stay in is gross. \nI think it's making me and asshole because I should keep my opinions to myself\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 8,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHello everyone, \n\nI'm chronically ill and I've lived alone for 5 years\nRecently my illness got so bad I had to quit my job and move in with my grandpa\n(He raised me)\n\nHe has leg issues and pain but swears he is okay and won't make a doctor's appointment, I've been begging him to make one.\n\nHe wants to sit in the dark all day and watch TV and he has done nothing in the past 5 years to keep up with the house. \nIt has two bathrooms and the floor caved in one of them so it's locked and nobody can go in there. \nThere's wholes all in the floor, and the place is absolutely disgusting. There's mold everywhere, every appliance is so dirty. My sister and I have to beg him to shower so he won't stink.\n\nI asked him to make a doctor's appointment and take me with him because he lies and tell the doctors he is fine. He is a pathological liar.... he makes stuff up all the time. \nI have cleaned the whole house to help him and to also give me peace of mind about staying here. \nBut now I cook every meal and clean... which I don't mind but I am constantly in my own pain. \n\nI asked him today if he was depressed because the microwave had mold in it and he uses it everyday. So I cleaned it, and asked if he needed mental or physical help, because the condition of the house is not sanitary.\nHe got defensive and told me he is fine and I need to mind my own fucking business. \n\nI grew up in this house, it was beautiful when my Nana and him were together. But she did everything and he would just sit around and be mean to her. \n\nI'm mad at him for letting the house become this disgusting, it's literally falling down\n Around us. Why didn't he ask for help, or tell anyone, or reach out? \n\nEarlier I was doing the dishes and I asked him where he wanted me to put them, he said on a tray he had..... and it was moldy. So I told him I'm not gonna eat anything that touches that and it needed to be cleaned, which I wouldn't mind doing.\n\nHe says I'm ungrateful.\n\nBut I truly think we all deserve a clean and habitual home.\nAlso my twin sister has lived with him for years and she's able bodied unlike the two of us. So I'm mad at her too for sitting in filth. \n\nSo guys... am I an asshole? \n\n\nI've decided from this point on if something bothers me I'll just keep it to myself and clean it. \nBut I don't know how much longer this house will be liveable, despite my best efforts.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "INFO: Does your grandpa have any kids currently in the picture? Is your Grandpa open to having an outsider come help clean?",
      "id": 10,
      "comments": [
        {
          "score": 1,
          "content": "I asked him if he'd be interested in a home nurse to help him and he said no.\nAlso said he wouldn't allow me to hire someone to come give it a good deep clean. \n\nI think this is my responsibility now. So I'll just have to do as much as I can",
          "id": 11,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Nta, sounds like this is who your grandpa is. You said your Nana did everything and he just sat around and was mean to her.",
      "id": 12,
      "comments": [],
      "relation": "Support"
    }
  ]
}