{
  "post content": "This situation is a bit of a mess. I'll just mention the relevent conflict at hand.\n\n\nSo My wife Liz and I have been married for 7 years. we have preschool age kids, and because we currently live in the same city as my parents. Mom would take the kids while my wife and I work.\n\n\nLiz is the one with a much larger income, she got an even better job opportunity that is requiring us to move to another city. I agreed since I could easily find a job in my field in the city we're moving to. but after my family heard we were selling the house to move, hell broke loose.\n\nSunday, mom and Liz got into a huge fight because Liz told mom we'll move away and hire a babysitter for the kids so she's no longer \"needed\". mom said she doesn't want her grandkids moving away, even said we should let the kids live at her house while we move. Liz laughed at her and mom lost it basically saying that Liz was an ungrateful witch and that her grandkids moving will only happen over her dead body. they began exchanging harsher words and Liz snapped and told mom to butt out of private matters that don't concern her. and said that she had no right to decide things regarding the kids. Mom firmly told her she was dead wrong and proceeded to tell her that she, as an involved grandmother, knows her rights and she will be taking Liz and me to court to ensure she still gets to see her grankids. Liz was in shock, she looked to the left and saw me sitting there not saying or doing anything. She told me to check my mom but I told her she was being unfair to mom and that mom had to feel upset because she will no longer be able to see her grandchildren - I honestly told Liz that she was a bit selfish to not consider my mom's feelings and her crucial presence in the kids life first. Liz started arguing with me saying she couldn't believe I didn't stand behind her and defend her after hearing mom saying she'd get the court involved. I said mom was upset and can not be blamed for her reaction. Liz started yelling at me calling me unsupportive and an enabler then went home with the kids, insisting my family is MY problem and I should handle it although this whole moving thing was her idea.\n\nSituation hasn't been resolved and Liz and mom are getting more intense in their fights. I choose to stay out of it because both have valid arguments but Liz has called me awful for not siding with her after seeing how mom spoke to her and being okay with the fact that mom was willing to cause us issues in court.\n\n\nAITA? I get that Liz wants my support but I feel like mom has been punished through no fault of her own after being a loving grandmother to my kids.",
  "id": 1,
  "comments": [
    {
      "score": 54413,
      "content": "YTA. Your mom threatened to **take your family to court so she can get custody of the kids** (she wants them to *live* with her). That is a disproportionate reaction to being told that someone is *moving*. Are you okay with moving to a new city? Sounds like you are. Why would you ever let anyone threaten your wife with court for doing something incredibly beneficial for your family? Why would you let someone **threaten** you instead of offering to get on a plane to see you?",
      "id": 2,
      "comments": [
        {
          "score": 17196,
          "content": "YTA your mum is threatening your family. And she could very well actually gain custody of the kids depending on how much and how long she takes care of them for. Omg YTA op. Your wife and children should be your first priority always, not your mothers feelings over *moving*",
          "id": 3,
          "comments": [
            {
              "score": 12933,
              "content": "The chances of the grandmother getting any real custody in the described scenario is zero. The chances of grandmother preventing the move with a family court’s authority is zero. At best there may be an order to allow the grandparents some annual time set aside for a visit (which in this case could actually backfire on grandma because the mom may now decide to only let her see the kids as little as the court requires after all this drama, rather than any sort of friendly visiting whenever’s convenient. I would.)\n\nGrandparents rights generally are for when there is a loss of a parent and the other parent is withholding the grandchildren after a relationship has already been established, or the parents are somehow abusive/neglectful. It is not for keeping responsible parents under grandma’s thumb.\n\nThe bigger issue here is the drama and hassle grandma is causing and the lack of boundaries OP is setting with his family. \n\nOP, YTA",
              "id": 4,
              "comments": [
                {
                  "score": 5948,
                  "content": "All of this is true.  But it can also be a money game.  If someone can afford lawyers then you need lawyers to defend yourself.  You can be right and still lose.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2682,
                      "content": "Nope, unless she flat out lies, money will get her nowhere with this. This is no what grandparents' rights means, under the law. A judge would get overturned and probably investigated if he gave this woman custody in this situation, again, unless she outright lied about abuse. Eve then, she'd have to have some proof.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 882,
                      "content": "No. Stop talking out of your ass. No family court would grant custody to grandparents in this situation, even if the parents had to proceed pro se. \n\nIn any event both OP and his wife are employed so your comment is both wrong and irrelevant.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 25,
                      "content": "No - that’s not true. Grandparents will never  be given custody  over parents just because they’ve babysat - only if there’s abuse involved",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "Been there and done that.  My sons grandparent told my aunt, I have more money and will win.  No one wins.  \n\nOP, get your head out of a dark place and be on your wife’s side.  \n\nYTA",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 5005,
              "content": "Former foster care caseworker here. OP’s mom has no legal standing to gain custody of the kids just because she provided free child care. Without clear evidence of abuse and neglect her chances are negligible. She might get visitation if they move within a drivable distance. But the fact that she first suggested and then threatened to take custody of the children is a serious concern and she should no longer be the child care provider. She is going to try parental alienation. OP’s wife should get a nanny. **She could easily coerce the kids to lie and claim abuse at the hands of their parents.**\n\nHey, /u/Thisissue3434 , you should take my suggestions seriously. Between foster care work and adolescent/teen counseling work, I know warning signs when I see them. Your mother has every right to be upset *but she is threatening to remove your own children from your custody* and no matter how bonkers that will seem to a family court judge, the whole process would be traumatic for your children. Every moment she continues to see them unsupervised she has the ability to poison them against you and since you’re moving regardless, she will really damage your kids and cause unnecessary strife and trauma. And if you think it’s not possible for a loving person to coerce children to lie about abuse, the Satanic Ritual Abuse Panic of the 1980s and 1990s would like to speak to you. Very ugly things that were never true ripped children from their families. Please, please take me seriously.",
              "id": 10,
              "comments": [
                {
                  "score": 1967,
                  "content": "Another social worker here. She could also just take the kids next time she sees them. Depending on the laws where you are, police generally won't get involved if extended family won't return children unless there is a court order about the children's custody arrangements.\n\nThe grandmother is absolutely entitled to feeling upset that her grandchildren are moving away, but she has gone nuclear over this with no warning. Definitely proceed with caution wherever she is involved.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 758,
                      "content": "No one believes me when I say this happened to me. Literally no one. Damn it's nice to say it to someone that will believe me.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 422,
                      "content": "Yep. This is true. I had to fight my aunt in court, when she illegally hid my son from me. When police were called, she showed proof that she \"babysat\" for me, and I had to retain a lawyer to get him back, 3 months later. The laws are screwy sometimes, so tread carefully.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 89,
                      "content": "It’s pretty sad that something like that isn’t considered kidnapping simply because they’d be with a family member",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 24,
                      "content": "This is not true.  Atleast not in Virginia. My parents tried to keep my husband and I from our daughter in the same fashion.  We called the cops and the cops were going to arrest them for kidnapping if they didn't give us our daughter back.  We got our daughter back.\n\nWith that said I still wouldn't give her access to the kids.\n\nYTA OP",
                      "id": 15,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "Not a social worker or a parent but would the police really not get involved? Is there no de jure custody arrangement in place with a child’s parents as soon as they are born? Or do you mean the parents would need to escalate it to something criminal like kidnapping before the police will do anything?\n\nJust curious! This sounds so strange to me!",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 9,
                      "content": "This happened to one of my kid’s friends. Kid was kidnapped by non custodial family member and ended up in a murder suicide. Many, many of us knew everyone involved and never saw it coming as much as I do in this post. “Oh my mom would never do that” is total crap. She showed her true colors and it’s terrifying. Don’t subject the kids to her EVER AGAIN. Get a restraining order after you get this either recorded or in writing. She’s unstable.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "There’s a woman I met whose husband allowed his mother to take his son for a visit, just the day. She doesn’t like the wife and took the little boy and disappeared to the biomoms, who hasn’t been involved in the child’s life since he was 2 months old. There’s court orders to return the child but when no one can find them they’re hard to enforce.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 580,
              "content": "Why on earth would a grandparent get “custody”?? Makes no sense if both parents are fine.",
              "id": 19,
              "comments": [
                {
                  "score": 266,
                  "content": "Most they could probably get is forced visitation from/to new state, if they argue maintaining a relationship is best for the kids, but they couldn't get custody or stop the move. A lawyer would tell them this, and the cheapest way to get the most the courts could give would be to talk like rational adults instead of threatening legal action.. but I guess mil thinks she can actually get them to stay, one way or another. \n\nGrandparents don't get custody without parents losing custody for harming or endangering their child. Or death, if one parent dies that opens a door in some states.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 15,
                      "content": "My brother died of cancer a little over a year ago.   My mom sued my SIL to get parental custody of my little nephew (every other weekend, holidays, bdays, etc) and took us to court.  Thankfully in CA the judge tends to side with the surviving parent.    But it took a lot out of us defending my poor SIL against my mom.    Some grandparents have a warped sense of entitlement over their grandkids.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 248,
                  "content": "That's exactly why this entire notion is so laughably stupid. I almost kind of hope Grandma takes this all the way to court, so the judge can laugh in her face and tell her how deeply lost in Lala Land she is, and then saddle her with all legal fees for wasting precious courtroom time over something so ridiculous. Meemaw needs to get a grip.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 113,
                  "content": "Generally for situations where the grandparents were the child's primary cartaker for an extended time and parents try to swoop in and take them back.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 112,
                      "content": "Yep. And to be clear, that doesn’t apply here. It would if the parents were absent, but they aren’t here, grandma is just babysitting.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "This normally only happens when one parent has died and the living parent won’t let the deceased parents continue a relationship with the child, and then they get visitation and that’s it.",
                  "id": 25,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 444,
              "content": "You’re wrong about custody. Connecticut has actually done away with Grandparent rights due to issues like this. I was very glad when that happened and am now a grandparent several times over. I don’t agree with a lot of things that happen to my grandkids but here’s the thing, THEY’RE NOT MINE",
              "id": 26,
              "comments": [
                {
                  "score": 127,
                  "content": "In Pennsylvania, grandparents' rights kick in only if the parent unit is broken (divorce/separation or death) or they had the kids residing with them for a year. Most of the US states have provisions that exclude intact families from grandparents rights",
                  "id": 27,
                  "comments": [
                    {
                      "score": 21,
                      "content": "I was glad when they did away with gp rights because my two youngest have never even met the in-laws due to their mental abuse. My husband and I were on the same page about this  though so it was not an issue.",
                      "id": 28,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 420,
              "content": "[removed]",
              "id": 29,
              "comments": [
                {
                  "score": 772,
                  "content": "Your last sentence is the key - Grandma can make their lives a living hell by making false allegations of abuse & neglect. She's unlikely to succeed in actually winning custody, as social workers aren't stupid and Grandma wouldn't be the first person to think of using false allegations for revenge, but the investigation would be stressful & intrusive. I would instantly remove all access to my children from anyone making those kinds of threats.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 399,
                      "content": "Recently reigned social worker here! Nope, we ain’t stupid. We see this BS right from the time we read the report. In fact, this can backfire on granny big time to where a restraining order could possibly be taken out against her (depending on state law) OR a CPS proceeding and/or agreement is made to where granny CANNOT visit the kids because of her threats, volatile behavior, risk to abscond with the kids, etc.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "Loving grandma doesn’t do this. She should be happy that her grandkids will have a better life and support the move as much as she can. Then go visit them, invite them over for holidays, skype/facetime in between.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 522,
                  "content": "[deleted]",
                  "id": 33,
                  "comments": [
                    {
                      "score": 74,
                      "content": "OP is afraid of his mother’s wrath or something deeper than that.  It’s an old wound.  His wife is correct that OP should be backing her up.  Grandma sounds like a manipulative mother & grandmother and they should definitely move for breathing room and context in a family therapy session.  OP you need to cut the cord from your mama.  It doesn’t mean you don’t love her or are grateful for her looking after your grandkids, it means you have boundaries and you love your wife & family more.   You’ve betrayed your wife’s trust here.  I hope your marriage survives this.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 86,
                  "content": "I believe for the rights to kick in the parents have to refuse access to the grandkids. If a married couple is both on board with the refusal it is near impossible to get over barring very narrow circumstances. YTA",
                  "id": 35,
                  "comments": [
                    {
                      "score": 75,
                      "content": "I know it might differ depending on where they live, but in my state grandparents only have rights to the kids if a parent died or the parents divorced. Otherwise the grandparents can pound sand. \nAlso YTA.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 130,
              "content": ">And she could very well actually gain custody of the kids depending on how much and how long she takes care of them for. \n\nNot really. Grandparents rights are very limited.",
              "id": 37,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 103,
              "content": "I mean, not really.  The only way a court would ever take children away from two perfectly financially stable parents would be if they were mentally unstable,  or physically or sexually abusive. None of which apply here. The grandmother is just massively overreacting. Yes, she won't be able to see the kids *every* day, but they're not moving to the moon. Holidays and vacations are a thing.  OP, YTA you need to sit your mom down and remind her she is not losing her family your just going to beva little father away.  Teach her to use zoom ffs",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "There is 0 chance she will gain custody in any state in the United States. Now if they're elsewhere I have no idea what the law is but even the grandparent rights friendly states are not that friendly.",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Actually, a grandparent would only ever gain custody if they could prove their was abuse going on. \n\nCourt could grant visitation rights, IF the grandparents could prove the parents were willfully not allowing them to visit with their grandkids. \n\nNeither is the case here. They are moving. OP’s wife isn’t saying visits from grandparents won’t be welcome or they won’t be going to visit the grandparents - so there is nothing to contest.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Grandmother would never get custody just because she babysits them. That’s not how it works",
              "id": 41,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1454,
          "content": "YTA. When your mother threatens your wife with taking custody of YOUR children, the appropriate response is to be outraged AT YOUR MOTHER. Going to court to get custody of your grandkids because your son is moving is not normal behaviour.",
          "id": 42,
          "comments": [
            {
              "score": 154,
              "content": "Yeah, if my husband admonished me in front of the woman that just threatened to take my kids I don't think I'd be able to wait to get to the car before calling a divorce lawyer.  This is seriously messed up and it's doubtful MIL is reasonable about everything else and this is just a one off.  Having just gone back and read the post, OP mentions he will only address the \"relevant conflict\", which makes me think there is additional BS going on that isn't specific to this situation.  Hell, MIL may be the reason wife wants to move.",
              "id": 43,
              "comments": [
                {
                  "score": 33,
                  "content": "It is definitely suspish that the MIL ‘suddenly’ turns into this unreasonable nightmare, how many people start at going to court and escalate from there? I’m calling shenanigans on the whole thing, and betting MIL is well and truly established at being demanding and bonkers and wife has found the perfect opportunity to flee. I say run with or without the husband!",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "OP's lethargic reaction makes me think he doesn't even like, let alone value, his kids that much, or his own wife for that matter.",
              "id": 45,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "The fact that OP seems to think this is normal behavior makes me think he needs to check out the raised by narcissists subreddit.",
              "id": 46,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1123,
          "content": "You literally said *nothing* while a mother was threatened with losing her children. Not just any mother - *your WIFE*. Not just any children - *YOUR children*.  \n\nThe ridiculousness of your mother (and the AUDACITY) aside, you are the AH-iest of AH's that ever assholed. \n\nYour mom's feelings were hurt? Cry me a river. What about your wife's feelings? What about your kids feelings? Will they be hurt if they were ripped away from their mother by *their daycare provider?* \n\nI'm a grandma and I am the only \"daycare\" they've ever known. Guess what? They aren't my kids. They belong WITH THEIR PARENTS. If they moved, I'd miss them. And then I'd visit them, like normal fucking people. Seriously. Your poor wife. Wtf.",
          "id": 47,
          "comments": [
            {
              "score": 95,
              "content": "And if I were your spouse, I'd never, ever let your mother in my house, let you take the children to visit or in anyway allow this shit to happen.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 30,
              "content": ">the AH-iest of AH's that ever assholed.\n\nI must find a way to use this IRL. I must! Maybe I'll have it stamped into T-shirts and make it a Xmas gift to AH family now.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "This is the barely restrained fury I was looking for, made all the better since you're a grandma yourself!",
              "id": 50,
              "comments": [
                {
                  "score": 37,
                  "content": "It gets even better - my daughter had my granddaughter when she was 17 so for 3 years that baby lived in my house and was my responsibility while my daughter got her life together. When she was 20 she got married and moved to whole different *continent* taking HER child with her. Of course I was devastated, but it didn't even occur to me to try and TAKE her. She isn't mine!\n\nAt first I was like, okay, I understand grandma's feeling some shit here and maybe she said stuff she didn't mean. But no, in other comments by the OP, grandma is doubling down on her threats and OP is continuing to claim this ain't his problem. He seems to sincerely believe the women are gonna duke it out while he plays Switzerland and he's going to come out unscathed. Like he's just an observer, has nothing invested, ain't got no dog in this fight. He doesn't even realize the irreparable damage he's doing and that is mind boggling.\n\nI am furious! I just want to give that poor woman a hug.",
                  "id": 51,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Post so nice, wish I could upvote it twice",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1071,
          "content": "Maybe I’m reading this wrong but it doesn’t sound like OP is a very involved father. I mean, if his mother threatening to get *custody* of his kids doesn’t bother him, he clearly isn’t a great parent.",
          "id": 53,
          "comments": [
            {
              "score": 823,
              "content": "To be fair he's probably going to be spending a lot of time at his mom's pretty soon.",
              "id": 54,
              "comments": [
                {
                  "score": 304,
                  "content": "Yea, OP's reaction is honestly divorce worthy behavior. Especially when he came to Reddit because he supposedly doesn't even realize he's in the wrong.",
                  "id": 55,
                  "comments": [
                    {
                      "score": 39,
                      "content": "Yup. If I were Liz, I'd have contacted a divorce lawyer already.",
                      "id": 56,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "For sure. Even if OP understands how he fucked up and attempts to right his wrongs, if this were my husband, I would tell him too little too late.",
                      "id": 57,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "🏅",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "This! Came here to say this. I’m not a parent but I feel that if you were a good protective parent, someone threatening to take your kids away would sound some alarms in your head? OP seems very lax about this situation.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Doesn't sound like an involved spouse either. Acting like this doesn't involve or affect him is alarming in a lot of ways.",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Exactly.  OP is acting as though he can sit on the sidelines, like some cooly objective party when in fact it's his refusal to engage that has brought this situation to a head.  This is HIS circus.  Grandma is HIS monkey.  Maybe if he'd ben properly involved all along this wouldn't have become such a conflict.  Now he's refusing to stand up with his wife to the threat of having his family in court?  Absolutely the AH.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 762,
          "content": "YTA and so is your mom.\n\nYour wife is going to make more money for the sake of your children and it sounds like you agreed to that already. Your mom pitches a fit and you immediately change sides. These are you and your wife’s kids, not your mommy’s. Grow a spine and cut the apron strings.\n\nYour mommy’s disproportionate reaction to moving cities tells me her story, you not backing your wife tells me yours. \n\nMy guess is it’s going to come down to your family or your mommy. That’s just sad when you had the chance to step up and deescalate.",
          "id": 62,
          "comments": [
            {
              "score": 88,
              "content": "If OP isn't smarter she's gonna go for the best paying job and serve his momma's boy ass some divorce papers. I can't understand how someone can be this dense.",
              "id": 63,
              "comments": [
                {
                  "score": 28,
                  "content": "She'll definitely never respect him ever again",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 591,
          "content": "for real. she's allowed to have feelings but she is NOT allowed to be swept up by them and have, as you said, a disproportionate reaction. \n\nOP, YTA. you agreed to move, wanted to move, but when it came to breaking the news to your parents you left all the hard parts to your wife. sounds like she does a lot of unnecessary emotional labor on your behalf. she deserves better. \n\nand you and your mom should be old and mature enough by now to understand how terrible she is acting. if not, your wife and kids need some space from your family.. yourself included.",
          "id": 65,
          "comments": [
            {
              "score": 23,
              "content": "Right, grandmom is threatening to blow up the family over a decision op made with his wife and op is \"staying out of it\" because grandmom has valid points??  Seems like the most passive aggressive way ever for op to tell his wife he doesn't really want to move. \n\nOp, your mother is behaving badly and you're totally the ah here.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 516,
          "content": "My mother made a similar threat.\n\nShe then didn’t get to have any contact with her grandson for over a year.\n\nShe was only granted texting rights when she honestly and sincerely apologised.\n\nI doubt she will ever see him in person again as my husband and I don’t want to see her at all.\n\nEdit: YTA",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 331,
          "content": ">I choose to stay out of it\n\n#BUDDY\n\nLike he HAS to know that taking his mom’s side on this is NOT in any way “staying out of it.”",
          "id": 68,
          "comments": [
            {
              "score": 17,
              "content": "Dude sounds like a dead beet of some sorts.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 317,
          "content": "Wait for OPs divorce post where he is SHOCKED it happens",
          "id": 70,
          "comments": [
            {
              "score": 17,
              "content": "He’s gonna be surprised pikachu face when she divorces his ass",
              "id": 71,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 314,
          "content": "> take your family to court so she can get custody of the kids (she wants them to live with her).\n\nUm, grandparents rights is *court ordered visitation*, not custody.  In order for a grandparent to get *custody* they have to prove the parents are unfit.",
          "id": 72,
          "comments": [
            {
              "score": 350,
              "content": "It didn’t sound like OP’s wife ever said she wouldn’t be allowed to visit, just that they’d need another babysitter who was closer. \n\nI think grandma’s completely off her rocker, but it definitely does sound like she was threatening to try to take custody.",
              "id": 73,
              "comments": [
                {
                  "score": 17,
                  "content": "This. If I was his wife, I would reconsider visitation at this point too. Mom is totally out of line.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 169,
              "content": "But grandma doesn't seem to understand that. From what is described here, she thinks she can try for custody. The problem isn't that she has a snowball's chance in hell of succeeding, but that she threatened in the first place. OP should have told her she was out of line.",
              "id": 75,
              "comments": [
                {
                  "score": 12,
                  "content": ">The problem isn't that she has a snowball's chance in hell of succeeding, but that she threatened in the first place. OP should have told her she was out of line.\n\nExactly. This is the crux of the issue here, and OP, being the \"just no SO\" here, let his mother abuse his wife with threats. He'll be lucky if he stays married.",
                  "id": 76,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18307,
      "content": ">insisting my family is MY problem and I should handle it although this whole moving thing was her idea.\n\nIt may have been her idea, but you agreed to it. If you had an issue with moving, you should have had that conversation with your wife. Agreeing with it to your wife's face and then letting your mom do the dirty work of fighting her about it is cowardly and passive aggressive. The fact that you are continuing to sit there like a bump on a log while your relatives harass your wife is failing hardcore as a spouse. \n\nGet your mother out of your marriage or you won't *have* a marriage.\n\nYTA.",
      "id": 77,
      "comments": [
        {
          "score": 4799,
          "content": "“Insisting my family is my problem” \n\nLike that’s wrong? Does OP hear himself? 😂",
          "id": 78,
          "comments": [
            {
              "score": 1284,
              "content": "When married or in a serious relationship its the easiest way to solve conflicts. If it's my family I will be the one to resolve this. If it's my husbands family he will do the talking.",
              "id": 79,
              "comments": [
                {
                  "score": 298,
                  "content": "Yup. I have had some massive blow up arguments with my family when I was growing up (noting ridiculous, just standard rebellious teenage crap). I haven't even had a disagreement with my in-laws and I don't know how I would handle one because its a totally different relationship. The same applies for my wife.",
                  "id": 80,
                  "comments": [
                    {
                      "score": 99,
                      "content": "Exactly. If your relationship with your in-laws blows up there is usually no turning back. You will never forget and it's very unusual to forgive. But with your mom you could have epic arguments and a few hours later you could hug it out. Lol.",
                      "id": 81,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Well, there seems to be a reason why his spouse makes more money. Our antagonist doesn't seem to be too bright",
              "id": 82,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1380,
          "content": "Not only is he the AH, he’s being incredibly financially irresponsible - whose money is his wife going to have to use to pay a lawyer when your mother files this lawsuit? Grandma will lose, and OP and wife will be footing the bill for a lawsuit they could have avoided if OP grew a pair and stuck up for his wife. Just think of all the things they could be using that money for if they weren’t spending it on a lawyer.",
          "id": 83,
          "comments": [
            {
              "score": 1177,
              "content": "ah but wifey earns *more than him*\n\nand if they move, she'll have a betterer job and even morer money\n\nWhy use your big boy words and say you dont want the changes, when you can just let your mother try to control, manipulate & bully your wife for you",
              "id": 84,
              "comments": [
                {
                  "score": 426,
                  "content": "Bingo. You nailed it. This dude is feeling emasculated and has opted to pout and let the women figure it out. Ten bucks says the midlife crisis car is next.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 83,
                      "content": "Midlife crisis car that the wife pays for.",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 37,
                      "content": "He won't have money for the midlife crisis car after paying his divorce lawyer",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "And no car if there is no wife who makes more to buy it.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "And the midlife affair with an 18 year old intern at his workplace!",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "If wife is smart she may as well spend the money on the lawyers and do a proper job and get rid of MIL and the husband who apparently is still holding on to those apron strings for dear life.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 25,
                  "content": "I wish I could upvote this more.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "It won't go to a judge. Not unless Granny lies through her teeth about abuse.",
              "id": 92,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 632,
          "content": "She's right, your family is 1000% your problem. I would be devastated if my partner let an in law treat me like that. OP should tell his mom that she will be dealing with him from now on and not let her contact the wife any more",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 525,
          "content": "Yeah I can’t get over the fact that THEY together told his mom that THEY were moving, and when his mom got upset and fighting with the wife, he’s suddenly siding with mom?? THEY are moving. THEY broke the news to grandma. And suddenly it’s HER problem?? \n\nI’m pretty sure OP is scared shitless of his mom.",
          "id": 94,
          "comments": [
            {
              "score": 22,
              "content": "I can see why you can be like.\n\n“Yea baby my mom wanted grands and to be in their lives heavy and it’s okay for her to be sad”\n\nTaking the kids is the line tho and not stepping in when your mom and wife clearly have beef is dumb as fuck.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 447,
          "content": "Hey OP cut out family court altogether and go straight to divorce court. Wife keeps the kids and you move back in with mommy. \n\nYTA - big time.",
          "id": 96,
          "comments": [
            {
              "score": 107,
              "content": "And then he’ll get 50% custody, and guess who will be taking care of the kids and dripping poison in their ears about their horrible, hateful mom during dad’s custody time?\n\nDivorce is probably Grandma’s best dream. She’ll get her baby boy back and she’ll get to play mom with her grandchildren 2 weeks out of 4.",
              "id": 97,
              "comments": [
                {
                  "score": 67,
                  "content": "Aw - but she will be moving for her work as she is the majority bread winner. Enjoy spring/winter break and 2 weeks in summer.",
                  "id": 98,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "50/50 only works if the parents are in reasonably close proximity, *especially* once the kids start school. And even then it can be tricky, as I know from experience.\n\nIf she's relocating far enough away that they're selling their house? Odds are they won't be close enough for 50/50 while he stays latched onto mommy's left one. At best, if it's only a few hours away? Alternate weekends and part of the summer. At worst, if it's further than that? Like u/Stitch-point said: spring/winter breaks, alternating holidays, and a couple weeks in the summer.",
                  "id": 99,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "This is the best solution TBH.",
              "id": 100,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 445,
          "content": "[removed]",
          "id": 101,
          "comments": [
            {
              "score": 252,
              "content": "[removed]",
              "id": 102,
              "comments": [
                {
                  "score": 144,
                  "content": "[removed]",
                  "id": 103,
                  "comments": [
                    {
                      "score": 49,
                      "content": "[removed]",
                      "id": 104,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 282,
          "content": "It suddenly became “her idea” and not “a great opportunity” when his wife told him he had to deal with his family himself. He’s a real winner.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 151,
          "content": "Indeed, OP needs to remove his balls from his mother's handbag.",
          "id": 106,
          "comments": [
            {
              "score": 16,
              "content": "She only gives those to him when it is time to make grandchildren. \n\nAll the grandchildren am belong to her now.",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "And honestly at this point, if I were the wife I would NOT be using grandma as the babysitter anymore even if they don’t move. A relative absurd enough to suggest my children live with them instead of their parents is way too unstable to ever have unsupervised contact with my kids ever again. \n\nAnd a husband who doesn’t stand up for his wife is going to find himself single in no time. \n\nYTA OP. Major asshole and a total coward.",
          "id": 108,
          "comments": [
            {
              "score": 12,
              "content": "That part. I wouldn't feel safe leaving them alone at that point. I made that mistake once, I missed a single phrase said to me, and I lost custody of my kids for four weeks because someone else decided she had \"rights\" to my children, because they had spent a few weeks with her over the summer while I moved house. She lied to the court...much like I bet Granny will too.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": ">won't have a marriage.\n\n\nIf that happens I hope the kids won't stay with the crazy grandma.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12729,
      "content": "LOL you're spineless, and YTA. Thats your family and kids, your mother doesnt get to decide and at no point does being upset allow you to be unhinged like your mom. \n\nAbsolutely pathetic behavior.",
      "id": 111,
      "comments": [
        {
          "score": 1607,
          "content": "This was my thought. Maybe his wife's raise will bring in enough money for him to buy a spine.",
          "id": 112,
          "comments": [
            {
              "score": 931,
              "content": "Or wife a divorce",
              "id": 113,
              "comments": [
                {
                  "score": 138,
                  "content": "Tbh after an event like what OP described I think that's inevitable now.  Even if OP repented, wife with money coming has already had thoughts to plan an exit.",
                  "id": 114,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "🔥🔥🔥",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Or an easy divorce!",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 697,
          "content": "Seriously, I can’t imagine his wife will want to stay married long term. He’s already married to his mommy. I can’t even comprehend not standing up to my own mother when she threatens to take my children. What an absolute wimpy response.",
          "id": 117,
          "comments": [
            {
              "score": 41,
              "content": "This is exactly what I thought. For OP's sake, he better hope they've had an extraordinarily rock-solid relationship up until this point, because I think siding with someone THREATENING TO TAKE YOUR KIDS would instantly be a marriage-ending offense for most moms.\n\nYTA in a huge way, OP.",
              "id": 118,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 349,
          "content": "WAS his family. I’d be looking at a divorce lawyer. Honestly, divorce is probably the easiest thing for OP’s wife anyway. She’s the breadwinner, so more money for her - win. No more spineless husband - win. If grandma is gonna get custody anyway then she can share it with the spineless ex-husband - win.\n\nOr legal battles, constant drama, pressure from the husband to move back, irate relatives piling on with only half the story, blah blah.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 242,
          "content": "YTA.  Dish rag",
          "id": 120,
          "comments": [
            {
              "score": 8,
              "content": "Happy Cake Day!",
              "id": 121,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 97,
          "content": "Exactly. He obviously bs’ed to his wife, and now is letting mommy fight the battle for him since he clearly agrees with her.",
          "id": 122,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 91,
          "content": "I can understand being upset.  But my word was MIL seriously overstepping boundaries here.  She’s not the kids parents she doesn’t get to decide where they live and what they can or\ncan not do.  I’m also betting OP’s wife has had some issues with MIL overstepping and parenting the kids already.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "haha I was like \"PLEASE be fake.\" He's lucky he HAS a wife. I can't.",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "Oh he has a spine, it’s just reserved for telling his wife she’s being selfish when his mom calls her a bitch and threatens to take their kids.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 24,
          "content": "Pathetic is such a great way to describe this. He has said he doesnt agree with his mom but makes zero moves to say so because it would be rocking the boat. He is totally fine with his wife being the punching bag and then acts like its his wife's fault theres a fight in the first place. Jesus christ! total spinless jellysfish.",
          "id": 126,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "Yeah, I know it sounds awful, but I seriously hope OP’s wife leaves him unless he grows a pair QUICK.",
          "id": 127,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9018,
      "content": "YTA.  YTA. YTA.\n\nAre you effing serious!!!!\n\n* OP said:\n*  **told her she was being unfair to mom and that mom had to feel upset because she will no longer be able to see her grandchildren - I honestly told Liz that she was a bit selfish to not consider my mom's feelings and her crucial presence in the kids life first**\n\nYOU ARE THE BIGGEST ASSHOLE FOR THIS.   \n**HOW do you stand back and NOT support YOUR wife.**  You ARE placing ALL OF THE BLAME ON YOUR WIFE.  \n Look at how easily your mother went disrespectful to your wife. *Grandma can jump her ass on a plane or use the all of these APPSs such as FACETIME/ZOOM/ SKYPE/ WHATSAPP/TEXT/DUO etc etc etc to see her precious grandchildren*  \n\n\n* **Your Mother can not dictate what you and your wife do in your lives**  \nYour Mom does not financially provide for your children. She is involved in Babysitting and being a grandmother.\n\nI hope when your wife finishes with your mother in court, she goes straight to divorce court and leaves your sorry self with your \"MOMMY\"\n\nDude you are such the ASSHOLE.",
      "id": 128,
      "comments": [
        {
          "score": 2965,
          "content": "> she was a bit selfish to not consider my moms feeling first \n\nHm how come *he* didn’t consider his moms feelings before deciding to move? he agreed to move and now that his mom has an issue with it hes all like “it’s her fault everything’s her fault this move happened completely without any thought or consideration from me I had nothing to do with it”",
          "id": 129,
          "comments": [
            {
              "score": 362,
              "content": "[removed]",
              "id": 130,
              "comments": [
                {
                  "score": 31,
                  "content": "I also had to delete half my comment because it was calling OP and his shit mom what they really are.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 27,
                      "content": "oh look at what OP said 2 hrs ago in a comment thread   \nDude is effing delusional \n\nThisissue3434\r    OP\r   2 hr. ago\r  \nno I'm not but I do get that she (OP's Mom) was upset and probably didn't mean what she said in a moment of rage but I (OP) told Liz that it's better that we solve this peacefully and try to get on my mom's good side by maybe reaching a compromise though mom is completely against moving away.",
                      "id": 132,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 300,
              "content": "Exactly. He thinks he can just go through life as a passive passenger and not take responsibility for any decisions because they are not his. That’s not how life works. OP sounds like he’s completely spineless to his wife and his mother. Now he’s caught in a fight between them and he doesn’t know where to hide.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "He probably thinks, \"I'm not the one whose getting a raise! It's your job making us move and even though I agree, it's your problem, wife!\" Ffs this guy is gross. When people don't prioritize the family they made over the family they make up, that's an issue.",
              "id": 134,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Right, how did his mommy make it to their house without hearing the news from OP first?  Did he not care at all about his mommy’s feelings?!\n\nOP is thr most clear cut asshole in all the history of am I thr asshole.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "He probably doesn't actually want to move, but lacks the spine to stand up to his wife too, so was hoping mummy would fight for him.",
              "id": 136,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 236,
          "content": "My poor man’s gold for how this hits so squarely on the head. \n\n🏆🏆🏆🥇🥇🥇🎖🎖🎖🎖\n\nAlso ETA: OP\n\nHow the f far is your new city???? Heard of planes, trains and automobiles???",
          "id": 137,
          "comments": [
            {
              "score": 18,
              "content": "My family moved as far as you could while still staying in the continental US when we were in grade school. My grandma felt the same way as OP’s mom- so she moved with us. There are plenty of solutions that don’t involve suing your loved ones.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "u/KeepLkngForIntllgnce   thank you so much :D",
              "id": 139,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 218,
          "content": ">told her she was being unfair to mom and that mom had to feel upset because she will no longer be able to see her grandchildren - I honestly told Liz that she was a **bit selfish to not consider my mom's feelings and her crucial presence** in the kids life first\n\nHe agreed to the move, and then blamed it on Liz...\n\nI keep wondering whether OP really wants to move.\n\nAlso, I'm wondering why OP didn't break the news to his mother himself, but had his wife do it.",
          "id": 140,
          "comments": [
            {
              "score": 39,
              "content": "He did not say anything, because he KNEW how his mother would act and this being so.... ALL of the blame was to lay on Liz's shoulders. He still gets to be Mommy's Good Boy.",
              "id": 141,
              "comments": [
                {
                  "score": 10,
                  "content": "Talk about having your cake and eating it too. What a snake",
                  "id": 142,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "because OP probably lets his wife do all of the heavy lifting in life...",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 188,
          "content": "I wish I could upvote this 100 times YTA DUDE",
          "id": 144,
          "comments": [
            {
              "score": 7,
              "content": "I'll see your hundred and raise you 500!",
              "id": 145,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 81,
          "content": "The wife is the literally the one providing which makes this all the more insane to me. His mom is quickly going to get herself banned from ever seeing her grandkids and he's just fine with the self destruction I guess. YTA",
          "id": 146,
          "comments": [
            {
              "score": 17,
              "content": "yeah, if I was Liz, I would make sure Granny had SUPERVISED VISITS... I do not trust her  \nOP sucks as a Husband. He might be a good father. But his role a Husband is F-  \nPlus he is a Mama's Boy to boot....",
              "id": 147,
              "comments": [
                {
                  "score": 8,
                  "content": "Oh 100%. She needs to cease all grandmother babysitting immediately in the meantime. Do not let that woman watch those kids jow",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "> His mom is quickly going to get herself banned from ever seeing her grandkids\n\n20 bucks says he'd smuggle grandma into the house when the wife's away against her wishes.",
              "id": 149,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": ">she was a bit selfish to not consider my moms feeling first\n\nSeriously, OP?  Why do your mom's feelings take priority over\n\n* Your wife's feelings\n* Your family's financial health, which will be improved by your wife taking this new job\n* Your children's wellbeing (your mom is causing strife and stress in the family, and will undoubtedly escalate given the chance\n* Basically, everything related to your nuclear family\n\nUntie those apron strings, take a good hard look at how irrational and selfish your mother is behaving, and support your wife.  Or lose her.",
          "id": 150,
          "comments": [
            {
              "score": 9,
              "content": "I wish I had an AWARD to give to you.... because so many people are saying what about Granny's Feeling.... Granny did not push those little ones out, nor does she financially support them...   \nshe `\"babysits\" ... that's it  b a b y s i t s....`",
              "id": 151,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Hey OP, how come you’re not making the big bucks so your family doesn’t have to move? I mean, if you made more money, your darling mommy wouldn’t have “to feel upset because she will no longer be able to see her grandchildren.” It sounds like you’re the loser in this scenario with what you’ve posted. \n\nAnd why on earth can’t your mother see the kids after you move? Has she ever heard of cars, planes, trains, hotels, etc? Zoom?",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Okay but have you considered how his mom feels? /s",
          "id": 153,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "His mom is probably one of those creepy ones that are obsessed with their son(s). Absolutely disgusting and pathetic in every way.",
          "id": 154,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7289,
      "content": "YTA.  You married and had kids with Liz, not your mother.  Are you really okay with your mom threatening to take your children?",
      "id": 155,
      "comments": [
        {
          "score": 654,
          "content": "He ain't going to be married for much longer.",
          "id": 156,
          "comments": [
            {
              "score": 204,
              "content": "And then he’ll need his mom as a free babysitter because you know this dude doesn’t look after his own kids.",
              "id": 157,
              "comments": [
                {
                  "score": 78,
                  "content": "He probably babysits them occasionally when none of the woman folk are around",
                  "id": 158,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 181,
              "content": "Homeboy is going to be real Pikachu faced when his breadwinner wife leaves him and gets custody of his kids.",
              "id": 159,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 49,
              "content": "Facts",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3335,
      "content": "YTA x 1000.\n\nYou should've put your Mom in her place, and in no uncertain terms. Her behaviour and threats are outrageous! \n\n(Or maybe, when your wife and kids move, you should stay behind with your Mommy?)",
      "id": 161,
      "comments": [
        {
          "score": 471,
          "content": "This probably would make him happier.",
          "id": 162,
          "comments": [
            {
              "score": 284,
              "content": "At this rate I think it'll make his wife a lot happier too.",
              "id": 163,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 243,
          "content": "I *cannot* get over this:\n\n>I choose to stay out of it because both have valid arguments\n\nShe wants to *take your children away from you*. How on *earth* is that a valid argument?",
          "id": 164,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 92,
          "content": "She's already ruined at least one person she's raised, she really shouldn't get the authority to do that to any more",
          "id": 165,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Mommy said \"i know my rights\" lmaaaooooo\n\nYTA",
          "id": 166,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 13,
          "content": "The fact there movie FOR HER JOB!! not just because but so she can get more money to raise there kids.",
          "id": 167,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "This is honestly hilarious. I don’t think that this man is fixable, his wife should leave him without a second thought",
          "id": 168,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2804,
      "content": "Lol, waiting for the “my wife wants a divorce and I don’t know what I did wrong” update. YTA, and a soon to be divorced and living with your mom asshole, but at least she’ll still get to see your kids when you get visitation! Silver linings",
      "id": 169,
      "comments": [
        {
          "score": 612,
          "content": "Me too.   \nI am going to save this post, so I can come back and see him crying and whining   \n\n\nHis next post is going to look like: I live with my Mommy. My EX Wife is in another city with a new husband. I see my kids once every 6 months. I still love her but my Mommy did not overstep demanding her \"Grandparents Right and disrespecting her\"",
          "id": 170,
          "comments": [
            {
              "score": 258,
              "content": "Yeah, “ over my dead bodys’ comment from mom was ridiculous… anything that she says after that can be said to my lawyer. And id he keeps it up, hubs can too",
              "id": 171,
              "comments": [
                {
                  "score": 22,
                  "content": "Yeah, MIL overstepped all of the boundaries with that one",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "The \"over my dead body\" is exactly where I'd have become livid.  Really?  Well, then, I'll go ahead and get the shovel.  Would you mind sitting or kneeling?  It will make the bludgeoning easier.\n\n(Please note that it's just a snarky remark that would likely pop out, but no actual violence because violence is bad. It's simply a logical response to \"over my dead body\" comments, particularly if that person has no standing.)",
                  "id": 173,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "As soon as she threatened going to court I would be pulling all contact and finding a lawyer.  All communication would be made via lawyers after that.",
                  "id": 174,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "Yep. The wife clearly can support herself and kids without OP’s help.. as well as hire any type of lawyer.",
              "id": 175,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 284,
          "content": "Hope the wife has a prenup.\n\nYTA What marriage vows did you take that said you WON'T stand by her side when she's attacked by someone threatening to take her and your kids?",
          "id": 176,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 97,
          "content": "And the wife will have a major piece of evidence at court that OP was OK with his mother trying to take his own kids away from him.",
          "id": 177,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "The wife deserves so much better that the spineless dum dass op is, hope she realizes it soon.\nYTA op",
          "id": 178,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2699,
      "content": "looks like poor Liz will be going to court twice.\n\nonce for a restraining order for your overbearing psycho mother, and the second to divorce your spineless self.\n\ngood thing she has the income.\n\nYTA",
      "id": 179,
      "comments": [
        {
          "score": 304,
          "content": "I was just thinking OP is going to court for custody but not against his own mom.",
          "id": 180,
          "comments": [
            {
              "score": 67,
              "content": "Let's be real, he doesn't seem to care about custody at all since he's cool with his mom trying to take his kids away",
              "id": 181,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 90,
          "content": "Let’s just hope she has a prenup to save her finances",
          "id": 182,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Don't forget full custody too, if she's smart (which she clearly is).",
          "id": 183,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1745,
      "content": "YTA- your mom has raised her kids, she doesn't get to insult your wife and threaten court dates because you guys are moving.   Support your wife or you'll be back living with your mom as well. No one is punishing your mom, it's called life and things happen.",
      "id": 184,
      "comments": [
        {
          "score": 452,
          "content": "YTA.  Grow a spine & stick up for your wife & your agreed upon decision.\n\nYou're moving as you agreed that it is best for your family & their future.  \n\nGrandma doesn't get to override the parents decision because she doesn't like it.  There should have been an immediate stop put to that nonsense.\n\nYou don't say that the grandkids will be kept from grandma, just that you will be changing cities.  I'm guessing grandma might be able to come visit and that grandkids might be able to visit them (but at this point not without mom & dad lest grandma not send them back).",
          "id": 185,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "And since OP’s wife is relocating for a job with better pay, arguably a better quality of life for the kids, OP may lose the battle to stop his wife from relocating even if they divorced. \n\nOP is just shitting all in his nest.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1322,
      "content": "Info: Do you agree with your mom that the kids should stay with her after you move?",
      "id": 187,
      "comments": [
        {
          "score": 718,
          "content": "The wife should just leave the whole husband behind at this point. His enabling won't get any better.",
          "id": 188,
          "comments": [
            {
              "score": 373,
              "content": "I was already leaning towards YTA, but I would like him to try and explain how he can justify leaving his kids behind and for how long that would be ok with him. \n\nAdditionally, GPR would allow her to see the kids, not get custody of them. And no where in there did he indicate that his wife said they are moving and will never let his mom see the kids again.",
              "id": 189,
              "comments": [
                {
                  "score": 344,
                  "content": "Exactly, seems he is secretly resentful and insecure of wife's greater salary (otherwise why include it in the post?) and is using this issue with his mother to make her feel bad about herself (calling her SELFISH, really? Seems there wasn't any pushback until he saw he had mommy's backup).",
                  "id": 190,
                  "comments": [
                    {
                      "score": 88,
                      "content": "Ok, get out of my brain! :)",
                      "id": 191,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 59,
                      "content": "He said it because that’s how he blames his wife for his mom being upset and justifying her upset because his mom comes before his wife and family",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Agreed. Like how is that relevant. I wonder if this is why Liz wants to move",
                      "id": 193,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 28,
                  "content": "Grandparents rights is visitation. They basically get as much time as co-parents do. Does OP want to see his kids all of Christmas? Too bad, his mom has visitation on Christmas Day they just get Christmas Eve. Does he want to see them for their birthday? Too bad, his mom has visitation that day. Planning on a family trip? Too bad, have to make sure it’s not on “grandmas weekend.” You want to avoid “grandparent rights” like the plague.",
                  "id": 194,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 93,
              "content": "I hope his wife finds this post and uses it in the divorce proceedings.",
              "id": 195,
              "comments": [
                {
                  "score": 13,
                  "content": "I wish we could get a post from the wife’s POV and then subsequent divorce updates.",
                  "id": 196,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    }
  ]
}