{
  "post content": "I'm turning 22 in a few days and I have been asked what cake I would like. I wasn't expecting any cake because I'm an adult now and I have a 1 month old son, so I haven't put much thought into it. But I naturally answered that I wanted a red velvet cake because it was my absolute favorite and I don't get to eat it but like once in 5 years because I just don't think about it much. I don't eat sweets much (not counting pregnancy) so I was thinking, why not? \n\nThen I was given a lecture that I'm not the only one eating cake so I should get a flavor that everyone can enjoy. I understood this so I said why not get a vanilla or chocolate cake for everyone and then I can get a small 1st birthday type red velvet for me then. \n\nThen I was given a lecture about appearing selfish to the guests. And when I didn't want to back down and give up the red velvet cake I was accused of being an A-hole. \n\n\nI don't feel like I'm the A-hole here but I want to find out the truth. If I am the A-hole then I'll apologize and surrender the flavor I want and just have cake by myself a few days later or something.\n\n\nEdit: the people asking then lecturing me is a tag team of 4 women who are not related to me. It's my boyfriend's bothers wife, her mom, her sister, and their friend.\n\n\nEdit: (UPDATE) it's been 3 hours since I asked you guys AITA and according to the 200+ comments and advice I've gotten I can now say I'm NTA. Now I feel kinda sad that I wasn't able to recognize for myself that I wasn't the A-hole. I made this post to help me because I had such anxiety over it and felt horrible. My bf finally got home from work and when I told him he was livid. He called his brother to have a personal talk with him about his inlaws. I didn't want to cause any more drama but hopefully the little talk will help me not be treated like that in the future. \n\nAlso to answer some of you guys questions and also to clarify. \n\nI can't uninvite them Because I didn't plan the party. I was just gonna spend my day watching tv and helping my newborn with his tummy time to strengthen his neck. My Bf's brothers inlaws were the ones that wanted to be \"nice\" and throw me a party since I never had one before. So I kinda felt like the A-hole because I didn't want to be rude to the people who were \"nice\" enough to throw me a party. \n\nAlso I live with my bf and son in the basement of his brother and wife's house due to financial issues. So I'm forced to see her and her family very often. But we hope to be moved out by Christmas this year. \n\nTHANK YOU ALL FOR THE JUDGMENT AND ADVICE! ❤️❤️❤️ Someone said I should just get my own big red velvet cake and eat it Infront of them while they had their \"boring\" cake 😂😂 I kinda want to do this but I also don't want to cause more drama. \n\nMy birthday is August 19th so I might come back with an edit and let y'all know what I actually end up doing. Thank you guys!\n\nEdit UPDATE BIRTHDAY 08-19-2022: \nso I ended up cancelling the party. I know they wanted to throw it for me but I just didn't feel like doing anything. I was already kinda upset in general about past birthdays and family forgetting me (close family like sisters and stuff) so I just stayed up till 5am watching the Goodfellas because I haven't seen it. Then I slept till 7 to feed my baby then slept till 12. Then I hung out with bf watching YouTube and eating left over pizza. Then he took me out to dinner with his brother, his daughter, his other brother, and her gf (she is my friend. It's not the one being mean over cake). The waitress became my friend, and then I drove home (I really wanted to drive..) everyone at dinner came over and then just as I was about to go to bed, everyone began to sing and a red velvet cake with my name on it came dancing out (bf was dancing lol) I wasn't expecting cake Because at that point I didn't care anymore. After cake I went to bed and that was the end of it ❤️ I had a blast. And the AH apparently got some karma, because she and the others got sick and wasn't in attendance. \n\nThank you everyone for letting me know about whether or not I was the AH. Also thank you for all the recipes and advice!!! Also HAPPY BIRTHDAY TO THOSE WHO HAVE THIS BIRTHDAY WITH ME!!!!",
  "id": 1,
  "comments": [
    {
      "score": 4382,
      "content": "NTA\n\nI don’t know who in their right mind would ask someone what flavour they wanted for THEIR BIRTHDAY then lecture them about why it’s rude to have it. It’s not everyone else’s birthday. Whoever is offering and then lecturing u sounds like a controlling AH",
      "id": 2,
      "comments": [
        {
          "score": 1247,
          "content": "Sounds like whatever answer OP gave they would have had an issue with. \n\nOP, ignore these miserable beings. Buy your own red velvet cake and enjoy every single bite.",
          "id": 3,
          "comments": [
            {
              "score": 575,
              "content": "You are so right. OP suggested vanilla and chocolate (and, let's face it, red velvet is just a fancy chocolate)... you can't get more generally accepted than that. There was no way to win on this one.",
              "id": 4,
              "comments": [
                {
                  "score": 303,
                  "content": "That's what I was going to say, red velvet is just chocolate with pizzazz",
                  "id": 5,
                  "comments": [
                    {
                      "score": 193,
                      "content": "Chocolate that makes your poopies a little reddish a'cause of all the red food coloring to tint the chocolate.\n\n**Edit: The red hue is, in fact, caused by beet juice! Can't believe this is my first time hearing it at 57 years old. Everyone has always said it was red food coloring, which at least is a common misconception. So, I don't feel 100% stupid... just 90%.**\n\n**Edit 2: I now have been informed that it IS, in fact, red food coloring. This comes from someone who has made and eaten \"a ton of them.\" I'm going to research it because now I'm curious. A fine example of why I love reddit, because how else would I have known about the mysteries of red velvet cake?**\n\n**Edit 3: Beet juice or food coloring? Weigh in on [AskReddit](https://www.reddit.com/r/AskReddit/comments/wn5lcz/settle_a_bet_every_opinion_welcome_what_causes/?utm_medium=android_app&utm_source=share).**",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "Red velvet cake, unlike chocolate, is traditionally topped with cream cheese frosting, maybe that was their problem? But who says no to cream cheese frosting??",
                  "id": 7,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Traditional red velvet cake does not have cream cheese frosting. It has a frosting with a cooked base, that is not sweet at all. That is why I & most people use the cream cheese option",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "You had me vigorously opposing your comment in the first half, but then you redeemed yourself at the end. I put cream cheese icing on everything! I've got a midnight snack carrot cake waiting for me as we speak. Cream cheese icing, of course.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "\"But who says no to cream cheese frosting??\"    I think we can give lactose-intolerant people a pass on eating cream cheese; but otherwise, your sentence could be instructive for those who need more happiness in their lives.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 34,
                  "content": "I don't know a single person who doesn't like red velvet cake. Had she asked for something like coconut or lemon, maybe I'd understand. But who doesn't like red velvet?! It's not an acquired taste, it's just normal cake with red food coloring and cream cheese frosting. NTA.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I am a single person, and I despise red velvet - as a subset of chocolate, which I hate the taste of and am also allergic to anyway! Discovered rhe allergy when people forced me to eat chocolate as a kid because not liking it is \"weird\" and \"wrong\". I have broadened your horizons, muahahahaha!",
                      "id": 12,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "NTA. But what is wrong with lemon?! J/K But, lol, my partner goes out of his way every year to try to find me a delicious(and not Lemon Pledge tasting) lemon cake. He always has a rough go of it with finding one, since my birthday is in February and a lot of places seem to not have it in rotation on their menus until warmer months. He bought me a lemon cookie just this evening, and will grab me a small Nothing Bundt Cakes lemon raspberry cake while it’s featured this month. And he does all this while not really caring for it, but because he cares ***for me***.  \n\nI couldn’t imagine asking someone their fave flavor and then being all “Yeah, that’s not gonna work for me”!",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "👋Now you know someone who doesn't like red velvet cake! I loathe chocolate with the fire of a thousand ~~subs~~ suns.\n\nNot as much as I loathe autocorrect, though.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "But still, it's *their* birthday! I believe you should get the kind of cake you want for your birthday. My friend LOVES lemon everything, so every year I make her a lemon cake, even though I hate lemon cake. Because it's her birthday, and she gets her favorite cake.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Or, the ringleader of this group had a very specific answer in mind and expected OP to prove her \"gratitude\" for planning a party by ordering the instigator's favorite instead of her own. This sounds like some kind of asinine test.",
              "id": 16,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "Just tell them to get whatever flavour they want, and then don't go to whatever celebration they are hosting.",
          "id": 17,
          "comments": [
            {
              "score": 14,
              "content": "Or request chocolate cake with red food coloring.",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "This is what I'd do. OP go get YOUR OWN red velvet cake and enjoy it on your own (or with Bf). How dare they dictate to you how to celebrate YOUR Birthday?!  Just tell those ninnies get what ever cake they want, you won't be there for it.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "My dad when my birthday rolls around every year because my sister Is picky so I have to get a cake (always vanilla) that she'll eat. So tired of vanilla cake.",
          "id": 20,
          "comments": [
            {
              "score": 94,
              "content": "My brother is my mom's Golden Child, and he doesn't like chocolate. Not an allergy, he just doesn't like it.  My sister and I were only allowed vanilla birthday cakes growing up because it's what he likes. Shockingly, our preferences were never given consideration on his birthday. \n\nWhen I was planning my first wedding I said I was planning on red velvet cake and my mom, in absolute horror, asked, \"Aren't you going to have something that [brother] can eat?\" I completely lost my shit on her, had a delightful red velvet cake at the wedding, and I now have a rule that I get the chocolatiest cake I can find for my birthday every year. \n\nNTA, OP. Get your favorite cake!",
              "id": 21,
              "comments": [
                {
                  "score": 22,
                  "content": "Omg. For my birthday I'm not very confrontational. But if it was my wedding... I'm getting what I want, the only other opinion that matters is my future hubby. He doesn't like red velvet and prefers the white vanilla cake with vanilla frosting (not buttercream or whipped icing) so I was thinking if he ever proposes and we are planning wedding cake I was thinking a 2 layer cake that's not touching, one just vanilla and the other red velvet to celebrate both of us.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 3,
                      "content": "it's \"funny\" how by thinking the way that your inlaws propose, I would hate every birthday cake I got... I mean, hate chocolate cake or cakes who are super sweet in general  \n\n\nI guess they would flip for asking year after year for peanut cake",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "Thst how my sister Is. My when I reached sixteen finally took that into consideration but still try to force it on me. Last year wait when I turned 20 he got me a cheap peanut butter cake that he liked. I hated it and he knew. This year 21st birthday chocolate everything",
                  "id": 24,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Jeez. Sounds like you and me just need to go indulge in whatever we want on our own. Self celebration.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "My grandmother was this way. Wouldn't even show up to a party where the cake wasn't vanilla and there was only vanilla ice milk. There couldn't even be a second cake or other flavors of ice cream in the house because of cross contamination. (She had imaginary, ever changing \"allergies\") I never got my choice until I was in my teens. And even then it was my other grandmother making lemon pie for me and my grandfather to share since our birthdays were only a few days apart. To this day my \"birthday cake\" is a lemon pie just to spite a woman who has been dead for 25 years.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Sounds horrible. Sorry u have to endure that",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "After my dad was diagnosed as a diabetic, my mom asked if she could make an angel food cake for my birthday (less sugar, I guess?).  I figured that one year wouldn't hurt. After that, she never asked again, and made it *every* year. I like most cakes, but angel food is like eating a mildly sweetened nerf toy - it's just plain nasty.",
              "id": 28,
              "comments": [
                {
                  "score": 7,
                  "content": "That's what iffy angel food is like.  Good angel food can be very good indeed, though that's harder if it's made with artificial sweeteners.  \n\nTry [this](https://www.bhg.com/recipes/desserts/cakes/angel-food/angel-food-cake-tips/) recipe some time, if you wish, with actual sugar; I've been told by a few people that they don't generally like angel food cake but they really like that one.  Unless requested otherwise, I usually top it with whipped-cream frosting and fresh berries.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Thanks. I bookmarked the recipe- no promises though, but I might attempt it before the year's out.\n\nAnd my mom making it near inedible by using artificial sweeteners shouldn't have surprised me (a *lot* of nasty things were created by her using Sweet n Low and/or carob), but I've only ever had hers, so I never had anything to compare it to.  After I moved out I've slowly been re-trying types of foods that were on my Never Again list and discovering that I actually like them. I have no idea what she was doing to/with those recipes, but man, it's been a night-and-day experience.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "My dad diabetic to but he eats a piece. I've gotten him to eat healthier but he felt bad because my 21st birthday sucked.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Is it a US thing to have only one cake for everyone? Where I'm from, we always have at least 2 cakes because not everyone likes the same stuff. The birthday person (or for any other celebration) picks a flavor and then the person planning the party picks another flavor for those who might not like the one that was picked. It would solve OP's issue here, although I believe OP should skip the party and get herself a lovely red velvet cake and enjoy it by herself.",
              "id": 32,
              "comments": [
                {
                  "score": 5,
                  "content": "Yep, usually one cake for everyone in the US unless it's a really big party (though some supermarket sheet cakes come with half of it chocolate and half vanilla or the like).  Sometimes at weddings there's also a separate \"groom's cake\" with different flavor/decoration.\n\nThere are some exceptions.  A friend who loves to bake now throws \"cake parties\" for her birthday -- she'll make around five different kinds of cakes for everyone to sample, usually with at least one gluten-free and often one vegan option.",
                  "id": 33,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "I mean I understand if you aren't the one ordering the cake/picking it up or paying etc or if you just want to keep the leave, but get whatever cake you want and celebrate with people that actually know who the special day is celebrating!",
              "id": 34,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "COMPLETELY agree.  I often offer to bake cakes for friends' birthdays, and I make whatever they want (though with a caveat if it's something I haven't done before).  My partner doesn't like cheesecake, but I made his father an apple caramel cheesecake recently because it was his day and that was his choice.",
          "id": 35,
          "comments": [
            {
              "score": 26,
              "content": "Exactly. Nobody else’s decision should matter expect for the person it’s about. And don’t offer if you’re not going to make what they want (unless like u said you’re not sure how to make it)",
              "id": 36,
              "comments": [
                {
                  "score": 19,
                  "content": "I'm always game to try a new recipe; I just warn people if I haven't made it before that I can't be sure how it will turn out, and offer a rain check for a later replacement if it fails.  I'm baking a German chocolate cake for a friend next week, using a terrific [recipe](https://www.yammiesnoshery.com/2013/12/the-best-german-chocolate-cake-in-all.html) she found and requested a few years ago that's now one of my most-requested cakes.  \n\nThe most unusual request so far was probably the vegan carrot-cake cookies, which were much tastier than any of us had dared hope and which I'd gladly make again.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 6,
                      "content": "That food looks amazing",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "If we had to take everybody's opinions on cake into consideration for someone's birthday, every birthday cake would be vanilla.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Exactly. I often make German chocolate cake for my mom's birthday, and I hate German chocolate cake. But it's not my birthday. We have a rule that everyone gets to ask what they want for dessert and for dinner. I say dessert because my late dad often asked for a \"Halloween\" pie for his birthday.  The pie is great, BTW. Chocolate cookie crust, with vanilla ice cream and orange sherbet alternated as the filling, with an orange flavored chocolate sauce poured over the entire thing. Then it's frozen hard. It's Halloween colors, but it's so tasty it works all year round, especially in the summer when frozen pie is particularly good and you don't want to turn the oven on.",
              "id": 40,
              "comments": [
                {
                  "score": 2,
                  "content": "Okay, that sounds amazing.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Same here. My husband and BIL prefer vanilla and berry or vanilla and citrus combos so that is what I bake them or buy them. My husband also loves choc and PB so I made him that cake a different year.\nI have never been asked and then lectured about my bday cake preference by anyone. If I know a guest has an allergy I avoid serving the allergen food at the party though for safety.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Agreed and of course NTA. Enjoy your birthday cake on your special day!",
              "id": 43,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Red velvet cake is chocolate with red dye and cream cheese frosting.. Who doesn't like a chocolate cake?",
          "id": 44,
          "comments": [
            {
              "score": 4,
              "content": "I could take or leave most chocolate cakes, but I can't stand cream cheese so the frosting makes red velvet a firm \"no\" from me.\n\nAnd yet, if someone else in my family wants a red velvet birthday cake, I just... won't have any cake? It's not that big a deal. Plus OP asked for red velvet, not something outlandish. This is an easy NTA!",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "👋",
              "id": 46,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "It really sounds like the lecturer is a giant controlling ass hole.",
          "id": 47,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "My guess is the ones objecting don't like red velvet, I would be the petty person and get each of them a red velvet cake on their birthdays. And be hurt if they didn't act like they loved it.\n\nNTA your birthday, your cake choice.",
          "id": 48,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Also, red velvet is chocolate?",
          "id": 49,
          "comments": [
            {
              "score": 1,
              "content": "That’s what I thought as well",
              "id": 50,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Right and red velvet cake is literally chocolate cake. You can Google it. What they don't like is the cream cheese frosting. NTA everyone should choose the dessert they want on THEIR birthday.",
          "id": 51,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "NTA. I recognize this pattern very well. These people aren't nice, they're are hostile. I think it's a passive agressive power play that you can never win as engaging means losing. Don't engage, put up firm boundaries and avoid these people (NC or LC) if possible. \n\nThis sounds exactly like a thing my mother could do. Offer a supposedly nice thing to look like a nice person for the outside world. Than turn it around by slowly take it away (e g. adding extra conditions I don't want/need for her own benefit, or add unrealistic conditions) and trying to make you feel like a bad person while she will present herself as a saint. And when you call her out she will play the victim and she will say she was just trying to do something nice and I misunderstood her and don't understand it. For the outside world she will make it seem like I'm the A H.\n\nIt took me years to recognize this. I still don't understand that someone could have such a low self esteem that they will use (passive agressive) manipulative tactics to put others down to make themselves feel/look better and be totally okay with that. But as a result sometimes I still have difficulties to see I am not a selfish, bad person when I put up boundaries and make my own choices in life. So OP should definitely not blame herself or be hard on herself for not recognizing the BS instantly!",
          "id": 52,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 728,
      "content": " NTA. It’s your birthday and the cake flavor should be one you like. Besides a red velvet cake is basically just a chocolate cake you make with buttermilk and cream cheese frosting. \n\nIts a normal flavor - whoever is putting up a stink about it is dumb.\n\nETA: there are other differences. Red velvet usually includes a small amount of vinegar which helps create a fluffy cake and it usually uses less cocoa powder than a traditional chocolate cake.",
      "id": 53,
      "comments": [
        {
          "score": 340,
          "content": "I didn't know that about red velvet cake. It's been my absolute favorite for my whole life (since I was introduced to it) and I never knew WHY I liked it. I always thought it tasted like chocolate but not at the same time.",
          "id": 54,
          "comments": [
            {
              "score": 149,
              "content": "That would be the chocolate! Haha - I think red velvet ends up with a more complex flavor and better texture than the usual chocolate. My husband really likes them so the first time I actually made one was when I realized its pretty much just a chocolate cake variation!",
              "id": 55,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 65,
              "content": "Red Velvet cake is chocolate cake dyed red with food coloring with cream cheese frosting. Whoever put up the stink about it probably has never tried it and that person is TA. You are NTA",
              "id": 56,
              "comments": [
                {
                  "score": 76,
                  "content": "Did you know that red velvet cake was a naturally occurring red brown color due to a chemical reaction between the cocoa powder and the acid in the buttermilk? We only add the color in now for that bright, vibrant red. I love food history and science.\n\nWhoever suggested chocolate is definitely TA. OP is NTA at all.",
                  "id": 57,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Agree on NTA, not on the make up of red velvet cake. True red velvet cake is made with red Dutch processed cocoa powder. Before relatively recent updates to Dutch processing caused cocoa powder to turn black instead (makes excellent Oreo tasting cake and frosting btw) it used to leave it that awesome reddish brown with a slight change to the taste. As others have said added vinegar and such changes make for a fluffy wonderfully delicious red velvet cake ^-^ People who want to go for the blood red look do add coloring sometimes, but it’s not really something I find useful.",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "Right? Who doesn't like red velvet cake?\n\nNTA",
          "id": 59,
          "comments": [
            {
              "score": 20,
              "content": "My husband. But it’s actually the icing—he doesn’t like cream cheese icing. One of the few weird things about him.",
              "id": 60,
              "comments": [
                {
                  "score": 8,
                  "content": "Lol! My partner doesn't really like any sweets. Such a travesty. I could just eat red velvet cake for the rest of my life.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Oh I can sympathize. I tried to bake my way through the pandemic but my husband made me stop. Blamed me for finally tipping his A1C over the top. Quilting was next….",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Neither does mine, more red velvet cake for me! There’s a bakery that we go to that sells it with small chocolate chips inside and cream cheese frosting, it’s the best.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Look for the recipe with boiled/cooked icing: flour, milk, sugar, butter, vanilla. Doesn't taste at all like what you'd expect a boiled icing to taste, this is more like a buttercream. It was the only icing I had ever eaten on a red velvet cake before my sister and I quit speaking 6+ years ago. (Wish I'd gotten the recipe.) I love cream cheese frosting, but hate it on red velvet, it just doesnt taste right after having eaten the cooked frosting for so long. Just be aware that the frosting can be tricky. Sometimes it whips up right away after cooking and cooling while at other times it can take upwards of half an hour. FWIW, my sister seemed to think that the humidity had something to do with it. Regardless, it's sooo worth the effort!",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Absolutely. I make all my cakes from scratch and the buttermilk + cocoa will tinge it slightly red naturally.",
          "id": 65,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -19,
          "content": "Fun Fact; people can be allergic to red food colouring. For some people, like my sister, it causes horrible migraines at best. And red velvet cakes are basically red food colouring.",
          "id": 66,
          "comments": [
            {
              "score": 25,
              "content": "Actually, if you make it properly then there isn't coloring added. The chemical change with the vinegar and cocoa powder turns it red.",
              "id": 67,
              "comments": [
                {
                  "score": -3,
                  "content": "Yeah but you know they are going to use a mix which for sure going to have dye in it.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "You can just leave the red food coloring out of it then. The cake will still taste the same. Originally red velvet did not have food coloring in it.\n\nNot all modern cocoa powders will react with the vinegar to turn red nowadays - so people add red coloring. You can either omit the dye or make it another color if you want. \n\nI’ve made many a “blue velvet” cakes around the holidays when red food coloring is sold out.",
              "id": 69,
              "comments": [
                {
                  "score": 7,
                  "content": "You can add beet powder to get it red if its that important too",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 300,
      "content": "Jesus Christ. It’s YOUR birthday it is not rude to get a flavor you actually Enjoy!\n\nWhat is incredibly rude is asking someone what they want FOR THEIR BIRTHDAY and then arguing and lecturing them like an AH \n\nIdk if this is a parent, a partner, or a friend but they are not someone I would want to spend any time around.\n\n Please try to surround yourself with people who care about your feelings over the imaginary feelings of others.",
      "id": 71,
      "comments": [
        {
          "score": 128,
          "content": "It's my partners sister in law and her family. Sadly we live with them because If we didn't we wouldn't be able to afford formula for our 1 month old. I want to move out tbh but I gotta do what I gotta do for my baby.",
          "id": 72,
          "comments": [
            {
              "score": 92,
              "content": "Ask your partner to get you a red velvet cupcake since your SIL will probably do her own thing like a controlling weirdo.",
              "id": 73,
              "comments": [
                {
                  "score": 5,
                  "content": "Walmart carries a very nice selection of cakes and pastries. They will usually have small cakes ( individual size) as well as full size ones. They always have red velvet with cream cheese frosting.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "They are extremely selfish.   Was she spoiled as a kid or something?",
              "id": 75,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "NTA. Is there a Nothing Bundt Cake near you? Get partner to get you one or several of those, and let the group have something they will eat. Happy birthday, and I hope you get to move soon, but respect for doing what you need to do for the little one.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 137,
      "content": "NTA Why would anyone ask you what kind of cake you want for your birthday then proceed to berate your choice on the flavour you picked. \n\nIf people don't like what you pick, tough luck, its your birthday not theirs.",
      "id": 77,
      "comments": [
        {
          "score": 7,
          "content": "Two years ago I was asked what kind of cake I wanted.  I specified a particular ice cream cake.  I was given something entirely different.\n\nLast year I was again asked what kind of cake I wanted.  I specified the same particular ice cream cake.  I was given an entirely different ice cream cake.\n\nThis year I bought my own damned ice cream cake and ate ALL OF IT myself.  F them.  Happy 52 to me!",
          "id": 78,
          "comments": [
            {
              "score": 1,
              "content": "This is the way!!",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 98,
      "content": "NTA? wth it’s your bday lmao you wanna cut & eat the cake you like sooo ? what’s the point of having a party if you’re not even gunna enjoy it & I find your solution to be an easy one that makes everyone happy! Personal sized for you & a different flavoured cake for the guests. WIN-WIN ! happy bday btw 🥳🥰",
      "id": 80,
      "comments": [
        {
          "score": 54,
          "content": "That's what I thought! I was confused when I was told it was rude to do. I thought I solved the problem.",
          "id": 81,
          "comments": [
            {
              "score": 17,
              "content": "You solve the problem by telling them you have plans and not going to theirs.",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "You did solve the made up problem. Tell them you're washing your hair that day and you can't go to the party.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 92,
      "content": "NTA. You're not asking for a dill pickle-flavored cake. It's red velvet, which is really just a mild cocoa flavor. I don't understand why that's so wildly different from vanilla or chocolate (which some people don't like either). As Ricky Nelson once famously sang, \"You can't please everyone so you got to please yourself.\" I say get your red velvet cake and enjoy it.",
      "id": 84,
      "comments": [
        {
          "score": 47,
          "content": "I love that quote ❤️ and if anyone ever asked me for s dill picked flavored cake I would ask can I try it LMAO that sounds delicious and disgusting at the exact same time.",
          "id": 85,
          "comments": [
            {
              "score": 13,
              "content": "I would want to try one, too.  I'm actually imagining what kind of flavour/sweetness balance you would have between the cake and icing.  Would the cake have more of the flavour?  Would the icing?  I'm tasting this in my mind right now, and I wish I had one just for shits and giggles.  I'm not even pregnant.  ^(Oh my gosh, could this become a specialty pregnancy cake?  Why am I being weird about a damn dill pickle cake?!)\n\nETA:  Ummmm......  Look what I just [found](https://www.delish.com/cooking/recipe-ideas/recipes/a56102/pickle-cupcakes-recipe/).",
              "id": 86,
              "comments": [
                {
                  "score": 3,
                  "content": "Just bookmarked that recipe. I may have to surprise (horrify?) my 14 year old with a batch of those. (No bourbon in the icing, of course.)",
                  "id": 87,
                  "comments": [
                    {
                      "score": 2,
                      "content": "... The recipe only calls for three tablespoons. Unless your 14-year-old is a recovering alcoholic, you can go ahead and leave it in.",
                      "id": 88,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 78,
      "content": "NTA. If they wanted a certain flavor of cake, why would they ask you what you wanted?!? Plus it’s for your birthday! And it doesn’t matter how old you are. My partner and I are much older and we still request what kind of cake we want for our birthday.",
      "id": 89,
      "comments": [
        {
          "score": 43,
          "content": "Really? I always thought once you become an adult no one would care anymore because it's not \"cute\"",
          "id": 90,
          "comments": [
            {
              "score": 55,
              "content": "That makes me sad. It seems like you don’t have people in your life that want to make you feel special on your birthday just because you’re an adult. My 36th birthday is at the end of the month and I know my mom will ask me what I want for birthday dinner and birthday dessert even though I’m going to be in my late 30’s. I think you deserve that red velvet cake. ❤️",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "I’m forty-freaking-nine and I get birthday cake. Actually I usually get birthday pavlova because it’s MY BIRTHDAY AND I GET TO HAVE WHAT I WANT YEEEEAAAAHHHH. And you should get what you want for cake too! If they didn’t actually want to give you a cake you like they shouldn’t have asked, sheesh.",
              "id": 92,
              "comments": [
                {
                  "score": 4,
                  "content": "I absolutely LOVE pavlova and request it every year",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "We have a friend who doesn't really like cake so he gets pie for his bday each year.",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "I just ordered myself a fancy birthday cake - bailey's flavoured - and a side of cupcakes - salted caramel - for next month. I'm almost forty and it's been a rough few years. Having cake and sharing it with friends is something I'm looking forward to.",
              "id": 95,
              "comments": [
                {
                  "score": 8,
                  "content": "Bailey's flavored cake is making me wish I got fancy bday cakes. I normally get grocery story stuff.",
                  "id": 96,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Okay, but some of the grocery store cakes are amazing! I bought red velvet cupcakes to a party once, and a friend's husband, was like, I LOVE red velvet and those were amazing, where did you get them? Me: Vons!",
                      "id": 97,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "No girl, you deserve something special on your birthday no matter what. Cake, cupcake, donut, whatever. It doesn’t matter how old you are! Get the red velvet cake and ignore those losers.",
              "id": 98,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I found out last month when I visited my bf for his 23rd bday that bday cakes were still a thing lol I haven’t had one in years… I think my last one was when I turned 18. I’m 23 now… last year I had lunch with my Nmom and then spent the rest of my bday with my dogs. They were much better company than my mom haha. But of course you would never be TA. One yr when I was maybe 12 or 13, we were at my brothers house visiting for Christmas (my bday is Dec 23) and I didn’t get a cake or was even allowed to open ip presents until his kids went to bed cause they didn’t want the kids upset they couldn’t open up presents early. But my dad ended up surprising me with a tiny cake from Carlos Bake Shop. We had to hide the cake as well until the kids went to bed. It was a struggle but the cake was delicious. Get the cake you want in the size and style you want. Maybe have fun with you SO and make it together! And if they want to make a cake in the flavor they want they can but at least you’ll have the flavor you want! Best of luck and happy birthday!",
              "id": 99,
              "comments": [
                {
                  "score": 6,
                  "content": "[deleted]",
                  "id": 100,
                  "comments": [
                    {
                      "score": 0,
                      "content": "That’s true. But they’re spoiled (they’re better now that they’re older but at the time they were so spoiled.) now I just don’t pay any attention to my bday. If someone does something for it, cool. If they don’t, cool. It’s just another day in the year tbh. I’ll celebrate others but I think I just prefer mine to be forgotten. Except when I request the day off. I don’t mind saying it’s cause it’s my bday 🤣",
                      "id": 101,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Hell no. As an adult, you can eat a whole damn cake at one sitting if you want to. Cute has nothing to do with it. In my family, birthdays get cakes. Sometimes they might be small ones, sometimes full size. Depends. My 94 yr old mom isn’t going to eat an entire cake for herself, so I get her a small one, or tiramisu, that she absolutely loves. My husband doesn’t cook, but he’ll buys me a birthday cake every year. I make his cakes. He‘ll be 74 this year. We only get one birthday a year. Everyone deserves a cake.",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "OP that's very naive thinking. Becoming an \"adult\" isn't a hard cut-off death sentence! You don't have to rob yourself of joy to \"fit in\" with outdated ideas of adulthood!",
              "id": 103,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 54,
      "content": "NTA \n\nQuestion: What cake would you like for your birthday new mother?\n\nAnswer: Red Velvet. \n\nResponse: No, you're wrong. Just because it's your birthday you can't have the cake you like because we (the coven) don't like it. We'll get what we want you can have a cupcake.\n\nNTA, definitely NTA. Oh my, you poor thing. Happy Birthday 🥳🎉🥳.",
      "id": 104,
      "comments": [
        {
          "score": 39,
          "content": "But she can't even get her own cupcake bc that's selfish according to them.",
          "id": 105,
          "comments": [
            {
              "score": 23,
              "content": "Right? During the second lecture I was close to saying \"fine I'll just eat some icecream from my PERSONAL tub\" but I held my tongue because I'm not confrontational...",
              "id": 106,
              "comments": [
                {
                  "score": 20,
                  "content": "My sister’s catchphrase is “asked and answered” it started with her kids when they were young and would try to please please pleeeease but the older she got the more she adopted it for everyone. She just doesn’t answer the same question twice. \n\nMean cake planners: What kind of cake would you like?\n\nBirthday person: Red velvet\n\nMean cake planners: Noooo that’s selfish. What kind of cake should we get? \n\nMy sister: Asked and answered. Anyone want to watch Jeopardy?\n\nIt’s awkward AF sometimes but still never gets old to me.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Time to start being a little confrontational. Don’t let people walk all over you to keep the peace.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 36,
      "content": "NTA. And you do NOT need to apologize.\n\nThis is like that famous quote by Henry Ford about the model-T car: \"Any customer can have a car painted any color that he wants so long as it is black.\"\n\nTell them: \"Next time why don't you just tell me the flavor of cake _I want_ at the start?\"\n\nPersonally I would tell them to go ahead and just get a chocolate one... and then I'd bring my _own_ red velvet cake and eat it in front of everyone. But I'm a bit of an AH.",
      "id": 109,
      "comments": [
        {
          "score": 16,
          "content": "I mean... 🤷 Sometimes I guess we need to be AH to survive. I want to do this but at the same time I SUCK at confrontation.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 36,
      "content": "Nta whoever you are talking to obviously doesn't want to do more than the bare minimum while also getting the a flavor they want (which is not red velvet).  I hope you have an amazing birthday though!",
      "id": 111,
      "comments": [
        {
          "score": 10,
          "content": "Thank you ❤️☺️",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}