{
  "post content": "      A little Backstory: I may have phobia called Haphephobia (self diagnosed from research) where I hate the idea of people touching me, but I never was sexually harassed and I hate showing affecting. Which included, saying or texting I love you,. I also have a mild case of Agroaphobia where I hate going outside during the day, it makes me very anxious to go outside, sometimes I think the brink of a panic attack.  \n\n      Some issues I have had: These have been accusing ever since my fear of being touched started to rise around 10 or 11. At first, I have confused why it repulsed to be hugged by my family. I began asking them to please not touch me or hug me because it makes me feel trapped and scared. They always ignored me and continued to forcefully hug me saying, “It’s just a hug we are your family.” over the years have gained a very deep hatred for them with the lack of them even trying to understand. There have been many screaming matches and me running away for a couple of hours to calm myself down. My mom (39F) always tells me I’m overreacting and I should open up more because the fear of being touched isn’t supposed to hold up for family, even though I have expressed it does.. \n\n   A cut down version of the situation: \n\n On Christmas, they wanted to take a picture and told us to stand next to each other. I didn’t want to put an arm around my brother or sister (19F). They began telling me to just do it because it was just a picture and my began trying to force his hand around my shoulder. I flinched back scared and my mom rolled her eyes annoyed and told me never mind. I was pushed and said to just accept I hate being touch. She quickly snapped back it was not normal, and I yelled at her what’s not normal is that none of you are accepting I hate it and keep trying to force it and somehow turning it back into me. She said she didn’t want to get into an argument over something so stupid. I quickly told her she sucks as a good parent and shouldn’t have had kids if you weren’t ready to be an adult about things like this. I sat in my bed crying silently and hyperventilating from my brothers arm reaching for me while they began taking picture of my sister and brother hugging and laughing about now it looks good without the weirdo. Today, they are acting like nothing has happened and are confused about my shut off attitude? \n\n   So AITA for telling her she sucks at parenting for not being a grown up?\n\nUpdate: Officially diagnosed with Haphephobia by a professional. Since then, I have now been treated as a “freak”. I am not allowed in family photos because the no touching makes it “not so family like” and I am still forcefully hugged and touched while they laugh at me. I believe they aren’t ever gonna change and I should accept this as my new normal..",
  "id": 1,
  "comments": [
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n ---\n\n I believe I am TA because a I feel like I have been blowing this whole thing out of of proportion and should just get over my repulsing feeling of physical touch.\n\n---\n\n Help keep the sub engaging!\n\n#Don’t downvote assholes!\n\n Do upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 2,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "[deleted]",
      "id": 3,
      "comments": [
        {
          "score": 1,
          "content": "I edited the post because I want to clarify that I was not crying and pouting about being the weirdo. I’m used to being called stuff like that. I was crying in discomfort and fear of the fact that my brothers arm was coming near me and them tryna push me toward him. Also the lack of their understanding and remorse over the years, I have cried and begged for them not to touch me. I am legally not allowed to set an appointment at 15 without supervision of a legal adult.",
          "id": 4,
          "comments": [
            {
              "score": 1,
              "content": "Info: have you told your parents that you need therapy? Sorry they treat you that way! Soft YTA for saying that to your mom, but I understand why you lashed out. It’s not easy to feel misunderstood & they’ve been insensitive. Have you tried to have a sit down serious talk about this? Or do you only bring it up in moments that make you feel uncomfortable?",
              "id": 5,
              "comments": [
                {
                  "score": 1,
                  "content": "I have told my mom maybe I need to see a professional but she says okay then never set an appointment. I have sat now and talked to all of them calmly and explained how is makes me feel repulsed and trapped. It’s always two outcome. First one is where they say they are family and when they touch me it shouldn’t be uncomfortable. Second they say oka we understand and I feel happy (I no longer get excited after this happening multiple times) but then the in a few hours they are forcing hugs and arms around shoulders.",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "ESH you need to convince your mum to take you to a therapist for an actual diagnosis and treatment to improve the fear, or go yourself bc it seems like you’re probably old enough to sort that out. Your mum also sucks bc even though you don’t have a diagnosis she shouldn’t force you to do stuff that makes you extremely uncomfortable and brush it off like it’s nothing. Maybe if you get a professional diagnosis and get them to explain it to her she will stop being a dick about it",
      "id": 7,
      "comments": [
        {
          "score": 1,
          "content": "is your vote ESH bc op doesn't have a professional diagnosis?",
          "id": 8,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. I’m the same (hate to be touched by anyone). Your family needs to accept how you feel and they need to be more considerate.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n      A little Backstory: I have phobia called Haphephobia (self diagnosed from research) where I hate the idea of people touching me, but I never was sexually harassed and I hate showing affecting. Which included, saying or texting I love you,. I also have a mild case of Agroaphobia where I hate going outside during the day, it makes me very anxious to go outside, sometimes I think the brink of a panic attack.  \n\n      Some issues I have had: These have been accusing ever since my fear of being touched started to rise around 10 or 11. At first, I have confused why it repulsed to be hugged by my family. I began asking them to please not touch me or hug me because it makes me feel trapped and scared. They always ignored me and continued to forcefully hug me saying, “It’s just a hug we are your family.” over the years have gained a very deep hatred for them with the lack of them even trying to understand. There have been many screaming matches and me running away for a couple of hours to calm myself down. My mom (39F) always tells me I’m overreacting and I should open up more because the fear of being touched isn’t supposed to hold up for family, even though I have expressed it does.. \n\n   A cut down version of the situation: \n\n On Christmas, they wanted to take a picture and told us to stand next to each other. I didn’t want to put an arm around my brother or sister (19F). They began telling me to just do it because it was just a picture and my began trying to force his hand around my shoulder. I flinched back scared and my mom rolled her eyes annoyed and told me never mind. I was pushed and said to just accept I hate being touch. She quickly snapped back it was not normal, and I yelled at her what’s not normal is that none of you are accepting I hate it and keep trying to force it and somehow turning it back into me. She said she didn’t want to get into an argument over something so stupid. I quickly told her she sucks as a good parent and shouldn’t have had kids if you weren’t ready to be an adult about things like this. I sat in my bed crying silently while they began taking picture of my sister and brother hugging and laughing about now it looks good without the weirdo. Today, they are acting like nothing has happened and are confused about my shut off attitude? \n\n   So AITA for telling her she sucks at parenting for not being a grown up?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 10,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "[deleted]",
      "id": 11,
      "comments": [
        {
          "score": 1,
          "content": "its not petty and an actual diagnosis likely won't change the behaviors because it's an issue with not respecting op.",
          "id": 12,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Plus doctors can easily misdiagnose and there is plenty of research available for someone to speculate what they may have. Not everyone is comfortable or can afford to go see someone.",
          "id": 13,
          "comments": [
            {
              "score": 1,
              "content": "[deleted]",
              "id": 14,
              "comments": [
                {
                  "score": 1,
                  "content": "“Each year in the U.S., over 12 million adults who seek outpatient medical care receive a misdiagnosis, according to a recent study by BMJ Quality & Safety. That translates to about 5 percent of adults, or 1 out of 20 adult patients.Aug 9, 2019” 5% = 12 million people lol.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 1,
                      "content": "[deleted]",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "If her symptoms align and she obviously hates being touched then there is definitely an issue, diagnosed or not. Her mom is disrespectful for not taking the daughter to get checked out and listening to her feelings + acting and saying the things she does. Grow up. It’s “petty” to you because you don’t understand how touch makes the girl feel. NTA",
          "id": 17,
          "comments": [
            {
              "score": 1,
              "content": "[deleted]",
              "id": 18,
              "comments": [
                {
                  "score": 1,
                  "content": "The mom isn’t a therapist and since you’re so hellbent on people getting diagnosed by doctors it’s hypocritical for you to say the mom is doing what a therapist would. A therapist wouldn’t immediately jump to having the girl being touched either, that would take multiple sessions. What op said was out of being unheard by her own family, which is a huge blow to her and will affect op her whole life. The mom is the one having an inappropriate reaction by getting angry, ignoring op, and not getting her help. Seeing you blame it on the kid makes me hope you don’t have any of your own.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 1,
                      "content": "[deleted]",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Thank you for this advice. Though I have tried to convince her to take me to an specialist. She says even if it was really diagnosed it should not apply to family. In her eyes, a daughter should be comfortable with her mother’s touch no matter what. I will continue to talk to her about the appointment but thank you!",
          "id": 21,
          "comments": [
            {
              "score": 1,
              "content": "I’m so sorry you’re going through all of this, family should respect boundaries and create a safe environment. \n\nI have agoraphobia and aversion to physical contact - the only people I feel even remotely ‘comfortable’ with receiving it from are my mother and my current bf  (and several other phobias), and it’s taken 30 years for my family to finally understand and respect my boundaries. I still try to grin and bear it, but I can only imagine how much it hurts to be disregarded like that, especially with such a severe phobia. I hope you can reach out to someone that may be able to hasten change, is there a staff member at your school that you could reach out to for help facilitating therapy? \n\nPlease know that I by no means believe you’re TA. You may have said something harsh, but had she not pushed you to this point you wouldn’t have felt the need to say it. Stay strong, I know it’s hard, but there’s hope. Take care.",
              "id": 22,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "[deleted]",
              "id": 23,
              "comments": [
                {
                  "score": 1,
                  "content": "to op, please don't let your lack of official diagnosis stop you from looking into this condition and ways that people who have it cope! even if it turns out that you don't have this condition the coping mechanisms you may be able to find through it could help :)\nalso the 'skepticism' does make her a bad mother. she may not want to admit that her child has some sort of problem but that doesnt mean its okay for her to continually traumatize her child or allow for the siblings to also traumatize op.",
                  "id": 24,
                  "comments": [
                    {
                      "score": 1,
                      "content": "[deleted]",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "I agree with you wholeheartedly.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "absolutely NTA. I see other people in the comments saying it was harsh to say your mother sucks at parenting because of her denial and ignorance towards your feelings. I dealt with something similar growing up- my mother is a narsassist and emotionally + mentally abusive. I HATED being touched as a kid, it made me ridiculously uncomfortable and gave me panic attacks. my mother would ignore that ( and other things ) bc she thought she deserved to be able to touch me. she also let my sister do the same. they would pin me to couches to hug me even when I was screaming and crying, begging them to let me go. \nand as much as I'd like to say I turned out fine, the whole thing contributed greatly to the PTSD I got from living with her for 18 years & to this day I still get freaked out by being touched.",
      "id": 27,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA.",
      "id": 28,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Soft YTA for self diagnosing and for what you said to your mum, no matter how true it is.\n\nI feel like if you approached them with the solution of going to a professional to actually find out what's up and be officially diagnosed, you'll then be able to be given the help you need, ergo then you might in time become a bit less uncomfortable with physical touch.\n\nYou seeing a pro about this is a win win for everyone.\n\nI know it sucks, but very few people do things for other people without it benefiting them in some way.\n\nFrame it around how the official diagnosis, therapy etc will benefit them over you. Don't ask them in the same way you've asked before. You've got to sell it to them.",
      "id": 29,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "YTA. You are diagnosing yourself which is a very dangerous thing to do. People have a tendency to start googling symptoms and before they know it they think they have all sorts of illnesses that they don’t actually have. You yelling at your family is not ok and understandably your family is not going to listen to your diagnosis of yourself.",
      "id": 30,
      "comments": [
        {
          "score": 1,
          "content": "im not all for the idea of self dx either but sometimes its better than nothing, especially when you are not getting support from the people who are supposed to provide it. and especially if someone is unable to seek a professional one, for whatever reason. also, phobias are relatively small when it comes to self dx'ing. I get intensely disgusted and repulsed looking at clusters of holes to the point that I will actively avoid looking at things that resemble that. therefore its pretty safe to say I have trypophobia. \nthat being said, op's aversion to touch could be attributed to an underlying condition like another commenter said so seeking a professional opinion is a good idea.\n\nalso your family should listen to your feelings and boundaries. this family is not doing that. that is not ok.",
          "id": 31,
          "comments": [
            {
              "score": 1,
              "content": "His/her family wanted to take a photo. That takes like what? 30 seconds? It’s not like they wanted to wrestle OP. And what makes self diagnosis so bad is that you can start to think you have certain symptoms because that is what fits the diagnosis you think you have. You start googling one symptom you actually have, get possible results of what it could be, multiple symptoms are listed with each one and then you start to go “well yeah I am tired in the mornings””well yeah my hip sometimes hurts” and before you know it you start having all these “symptoms” that aren’t real but they fit a certain diagnosis so obviously it must be what you have.OP has diagnosed herself/himself with a serious very rare phobia. That is not a smart thing and who says that OP can’t be experiencing stronger reactions to touch because that is what the diagnosis says someone with that phobia experiences? It can all be in their head. And without a doctor saying that OP is correct about their diagnosis who knows what they really have. Or even if they have anything at all.",
              "id": 32,
              "comments": [
                {
                  "score": 1,
                  "content": "human compassion takes what? 0 effort? if someone does not want to be touched they should not be touched. whether it is parents, siblings, or friends, boundaries deserve to be respected. whether or not they think it is dumb or an overreaction.\n\nI don't doubt that the brain can create symptoms based off external factors and thoughts. that does not happen 100% of the time. you don't know the ins and outs of op's brain. neither do I. however, as op stated, these feelings have persisted for at least 5 years and result in emotional distress. a therapy is a good course of action but as stated in the comments, their mother seems to be unwilling to provide op with that privilege. \n\nalso it should not be assumed that op's symptoms are self-made ( for lack of a better term ). I know self dx isn't the same as a professional dx. but that isn't essential to the background of the question- op's feelings, emotions, and boundaries are.",
                  "id": 33,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Of course it matters if these symptoms are self made or not. OP could have a serious phobia or they could not. It could all be in their head. Why should the family recognise OPs self diagnosis as some sort of truth? Because OP googles something and think it fits their symptoms? Ok sure. And it seems to me like the family recognises OPs issues (whatever they are) for the most part. They just wanted to take a photo for like 30 seconds. That’s it.",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}