{
  "post content": "Not going to be very long here...my wife and I had our first child last August. We were lucky enough to have our insurance completely cover a certain genetic test that would allow us to find out the gender extremely early so we decided to have a gender reveal party (cliche, I know...). Well we invited a lot of friends and family to this, but one friend in particular said she wouldn't come because she was having trouble getting pregnant and that it was hard for her to be happy for us given her circumstances...no big deal right?...Fast forward to now...she is pregnant and all of a sudden wants everyone to be happy for her and wants to talk all the time about her child and expects everyone to be happy for her. Maybe I'm a spiteful A*hole but I'm having a tough time being happy for her.  AITA?\n\nEdit: Maybe I should have included a few small details. 1) I haven't congratulated her *YET* ...I fully intend to.\n2) We struggled to get pregnant as well. So I fully sympathize with infertility.\n\nEdit 2: Thank you for all the responses. It's pretty clear to me that I've been the A*hole here. Trying to justify not congratulating a friend based on their past actions is petty and I am not going to be that person. Thank you all!",
  "id": 1,
  "comments": [
    {
      "score": 243,
      "content": "NAH. Or ESH. It could go either way actually. She was entitled to her feelings when you were expecting your child, and you are entitled to your feelings now that she is expecting.  A little bit of empathy on both your parts would have gone a long way.",
      "id": 2,
      "comments": [
        {
          "score": 162,
          "content": "Her: \"I can't be happy for you having a kid\"\n\nHer: \"Be happy for me having a kid!\"\n\nI don't take infertility lightly, that sucks. But you have a right to feel like she is being a little hypocritical.",
          "id": 3,
          "comments": [
            {
              "score": 48,
              "content": "This is exactly my point. Of course I plan to congratulate her because I am not THAT petty.",
              "id": 4,
              "comments": [
                {
                  "score": 128,
                  "content": "Well then your point is ridiculous because the two aren't comparable. \n\nYou got pregnant at a time when she was struggling to get pregnant sue to ongoing fertility issues, the extent of which it doesn't seem like you're aware of. \n\nShe got pregnant when you had already gotten pregnant. Whatever issues you had were irrelevant because you're having a baby. \n\nSee the difference?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I’d say we need more info as to how the friend acted aside from not attending the gender reveal party. Saying she was having a hard time being happy for OP could mean different things. If she congratulated OP in general and just didn’t attend the party, that’s understandable. But if this was constant behavior at the time, than that makes them a flaming hypocrite because you can still be happy for a friend and extend good sentiments even if you’re going through shit. But again, INFO needed.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 86,
                  "content": "The difference is that your friend was never being petty toward you while you’re being petty toward her. \n\nDeclining the party invite for the sake of  her mental health is not the same as you going out of your way to avoid congratulating her. Mental health and infertility issues are such personal topics—how invalidating of your friend do you have to be not to understand how she felt and then to purposefully not show happiness for her?",
                  "id": 7,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 35,
              "content": "Everyone deals with stress and grief differently though. It isn’t fair to compare mental states. The friend literally could not mentally cope with a gender reveal party. OP is just being spiteful. Also I feel like it’s a lot more socially acceptable to decline a party invitation versus go out of your way not to congratulate someone on their pregnancy, especially a friend who’s opened up to you about infertility.",
              "id": 8,
              "comments": [
                {
                  "score": -12,
                  "content": "[deleted]",
                  "id": 9,
                  "comments": [
                    {
                      "score": 10,
                      "content": "The post was already edited before I saw it. Honestly no one is going to be anywhere near as excited for a friend’s baby as the friend herself. I definitely get the sense OP isn’t excited for the friend, but it’s clearly due to simple disinterest and pettiness vs.  the friend genuinely struggling and being honest that she couldn’t attend a gender reveal. \n\nBeing disinterested and spiteful isn’t equitable to legitimately having mental distress, and saying congratulations isn’t the same as attending a party either.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "It doesn't go both ways because one party has a valid excuse and the other is being openly and actively petty.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -2,
          "content": "This",
          "id": 12,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 202,
      "content": "YTA.\n\nInfertility is a *bitch* to go through and some women can't be around baby stuff during the tough times.",
      "id": 13,
      "comments": [
        {
          "score": 24,
          "content": "I’m with you up to a point with this.  You don’t shit on someone else’s good time because you can’t have what you want.  She could have just as easily said she had a schedule conflict, but she said I can’t be happy for you because X but then wants him to be happy for her?  It’s like a couple of four year olds.",
          "id": 14,
          "comments": [
            {
              "score": 89,
              "content": "no, she was honest, because if OP had said \"lets get toghether another time\" the girl still would not have been able to handle it.  When you are desperately trying for a baby or have miscarried and someone else gets pregnant, as much as you want to be happy for them, your emotions and hormones usually will not allow you to pretend.  I have been trying for a baby and as much as I would be thrilled to find out someone else is expecting, I would not be able to hold my composure without crying my eyes out, no matter how happy I was for them.  This is the reality when you are trying month after month to get pregnant and it doesn't happen.",
              "id": 15,
              "comments": [
                {
                  "score": 59,
                  "content": "And if you can’t be honest about your pain with your friends, what the hell are they for?",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Or you know, you could be an adult and communicate your emotions to a friend with the hopes that they’ll have the emotional capacity to empathize and support you?",
              "id": 17,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "[deleted]",
              "id": 18,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Yeah, I can see that. Some people just can't and maybe she didnt want to lie? I dunno.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": -24,
          "content": "[removed]",
          "id": 20,
          "comments": [
            {
              "score": 13,
              "content": "[removed]",
              "id": 21,
              "comments": [
                {
                  "score": -10,
                  "content": "[removed]",
                  "id": 22,
                  "comments": [
                    {
                      "score": 8,
                      "content": "[removed]",
                      "id": 23,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Right after I had a really devastating and painful, drawn-out miscarriage I was invited to a baby shower and I truthfully said thank you so much for thinking of me but it is too painful. Never thought I’d acted like a bitch and everyone involved was so understanding.",
              "id": 24,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/wiki/index#wiki_1._be_civil)\n\nPlease [review our rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index) before posting again.\n\n[Message the mods](https://www.reddit.com/message/compose/?to=/r/amitheasshole&subject=/r/AmItheAsshole&message=Please+link+to+post+or+comment+for+context+[we+cannot+review+without+this+info]:%0D%0DDescribe+your+question+in+detail:) if you have any questions or concerns. Please do not reply to this comment with an explanation, argument or apology and instead use modmail.",
              "id": 25,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 143,
      "content": "YTA - just say congratulations, why is that so hard to do?  Besides gender reveal parties are dumb.  Respect her where she is (and was).  It’s not easy to be in her shoes.",
      "id": 26,
      "comments": [
        {
          "score": 20,
          "content": "Completely agree with everything.",
          "id": 27,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -14,
          "content": "I plan to, we were in the same boat for quite a long time so we fully understand how it feels to see friends get pregnant while we were unable to.",
          "id": 28,
          "comments": [
            {
              "score": 23,
              "content": "Were you invited to a gender reveal and expected to paint on a happy face while going through fertility issues or just the fertility issues?",
              "id": 29,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 111,
      "content": "YTA because she had a reason to miss your gender reveal (no one really cares about the gender like you do I promise). I never want children myself but I know how hard infertility can be and some people can’t be around baby stuff at all because it’s just too painful of a reminder. You literally have no reason to not congratulate her except pettiness.",
      "id": 30,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 60,
      "content": "YTA. You should have respected the pain it would have caused to go to a party right then. Sounds like a big bash so it's not like you were lacking guests without this one friend. There's nothing for you to be unhappy about, you've had your child and now she's getting hers. Holding her not coming to a party against her is petty.",
      "id": 31,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 55,
      "content": ">2) We struggled to get pregnant as well. So I fully sympathize with infertility.\n\nYTA, if you \"fully sympathize\" with infertility then you should be elated for your friend that they were able to get pregnant. What are you holding a grudge for?",
      "id": 32,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 29,
      "content": "YTA.\n\nHer reason for not wanting to hear about your wife's pregnancy was it made her sad. Why exactly are not congratulating her, spite, to enforce some weird moral equality? Being a dick to someone who was dick to you is ok only if they didn't have a valid reason.",
      "id": 33,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 23,
      "content": "YTA.\n\nInfertility isn't some \"she's being rude by not coming\" it's one of those things that really tears people apart. I have a cousin who struggled with infertility, I've consoled her many times after one of our other cousins got pregnant or someone had a baby. It's a very difficult thing to go through.",
      "id": 34,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 21,
      "content": "YTA (probably) and totally being petty. Maybe she is being OTT, in which case just as her to cool it on the baby talk. However our do really need to congratulate her.",
      "id": 35,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 14,
      "content": "Info: how is your friend trying to force everyone to be happy about her pregnancy?\n\nESH, and I’m making the assumption that your pregnant friend is somehow trying to make everything about her pregnancy excessively. I’ve met those people before, and when it’s important life event - marriage, pregnancy, divorce, etc everything else ceases to exist for the person and for those around them. \n\nI don’t think there’s anything wrong that your friend did by confiding in you that gender reveal party would be hard for her. We had a few losses before we had our son, I’m pregnant again but seeing other pregnant women, baby showers, etc can still be challenging to attend. I mostly miss naivety that a positive test leads to a baby in the end, and I sometimes (especially now) can’t control my emotions very well and I avoid those events if I can’t be 110% happy for them and push my sadness aside.",
      "id": 36,
      "comments": [],
      "relation": "No"
    }
  ]
}