{
  "post content": " \n\nThis started like two weeks ago. My friend (14M) and I (14M) were going to hang out at a McDonald’s but something happened with my mom at work so I had to take my little sister (10F) with me. My friend was annoyed because he didn’t want to babysit and so that sucked for him, but it got worse when he started making fun of her for having “cat eyes” because of how big they were. This upset her and I told him to stop but he didn’t. After he said “cat eyes” for like the fiftieth time, I just started meowing at him. We did this for a while and he knocked it off and it was funny for a while. It ended up being a fun day in the end.\n\nThe next time at school I saw him in algebra and he asked me about my cat-eyed sister. I started meowing at him and we did this for a while. Then the next time I saw him in the hall I meowed at him again. I also did it when I saw him in the bathrooms and also since we have four classes together, I did it every time I saw him.  After about three days he told me to stop but I didn’t want to. I’ve basically been meowing every time I see him and he’s been trying to avoid me, but considering we have 4 classes together he’s going to have a rough time.\n\nI think the biggest issue came up about two days ago when we had a group presentation that was assigned last month. We had to talk for ninety seconds for each of our parts and I got nervous and talked to fast. So to fill up time I just meowed. Some people found it funny, some people found it stupid. My teacher told me to be better prepared, but my friend yelled at me in the hallways afterwards for humiliating him in front of the class. Which I didn’t, because I meowed at my classmates, not him this time. \n\nMy sister thinks it is funny. Nobody else does. One of my other friends (15M) said I should go here so I did. AITA? Thank you.\n\nPS: My other friend told me that ⅓ posts get deleted for being too weird because of Rule 8 and he thinks this is too weird. According to him “there’s some pedantic redditors who refer to r/thathappened every time something unordinary happens. therefore you will be required to provide evidence.” Can someone tell me what this means? What counts as evidence? I have emails between me and my friend arguing about this. Do I attach them here?",
  "id": 1,
  "comments": [
    {
      "score": 59,
      "content": "I was gonna go N-T-A until it started to affect your schoolwork during the presentation, so ESH (because tbh it was funny otherwise). Your friend is definitely the asshole for making fun of your sister's facial features, but you should have just had a mature conversation about how it's not cool to mock people's facial features",
      "id": 2,
      "comments": [
        {
          "score": -6,
          "content": "Okay, I sort of get it but why does it only matter when it affects my grades? Grades are a result of my own choices so how can I be the asshole only when it has to do with my grades, and not when it's annoying to others. Sorry for the questions, I'm genuinely wondering haha...thank you for replying.",
          "id": 3,
          "comments": [
            {
              "score": 14,
              "content": "I don't know how it works at your school but when I was a student (\\~5 years ago now) many group presentations had a solo and group grade that would be averaged (unless you and other members went to the professor and said that person X is not pulling their weight). So if you meowing during a presentation had potentially affected yours, his and your other group members grades, that is not cool.   \n\n\nEither way, at this point a conversation is warranted. Good for you for sticking up to your sister though",
              "id": 4,
              "comments": [
                {
                  "score": 1,
                  "content": "A true conversation would be if he meowed back at me.\n\nAlso group project grades are individual only.",
                  "id": 5,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 27,
      "content": "ESH, might have been funny at first but not after days of it and your friend needs to stop picking on little girls",
      "id": 6,
      "comments": [
        {
          "score": 5,
          "content": "cool, why is your poop holy?",
          "id": 7,
          "comments": [
            {
              "score": 7,
              "content": "Haha! It's just one of the user flairs assigned based on how many top comments you've had...I think there's more info on it in the rules/wiki/about section of you're interested, look for user flairs",
              "id": 8,
              "comments": [
                {
                  "score": 10,
                  "content": "Ohhhh thank you shitmaster, I worshit you greatly",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 18,
      "content": "ESH - He was wrong for making fun of your sister, but you meowing at him for days is just strange. What is your endgame here? At this rate everyone at your school is going to think you are the weird kid who meows all the time.",
      "id": 10,
      "comments": [
        {
          "score": 3,
          "content": "I mean it’s kind of too late to change that isn’t it",
          "id": 11,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 12,
      "content": "Okay, it's time to stop the meowing now. Don't let your friend make fun of your sister, but be willing to accept him as a friend again if he apologizes. And be better prepared for your school work. ESH except your sister who can think anything she wants is funny but that doesn't mean you should do it.",
      "id": 12,
      "comments": [
        {
          "score": 7,
          "content": "I agree with you but I also think it's a hilarious way to make somebody stop bullying somebody else. Very creative. Our of place in a presentation setting, but otherwise funny",
          "id": 13,
          "comments": [
            {
              "score": 3,
              "content": "Purrfect",
              "id": 14,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I don't want to be his friend anymore though, I found meowing at him to honestly be more enjoyable because he's just kind of mean.",
          "id": 15,
          "comments": [
            {
              "score": 6,
              "content": "Good realization to come to and no reason to keep the friendship if you don't want it, but if you continue to meow at him, then YOU'RE THE BULLY and YOU'RE the one who is mean...",
              "id": 16,
              "comments": [
                {
                  "score": 2,
                  "content": "I’m mean because I go meow?",
                  "id": 17,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Yes, he's told you several times to stop. Doing something harmless (like meowing) becomes bullying when the other person lets it get to them, precisely because it is so harmless. Doing something that is driving the other person nuts but that is kind of ridiculous makes it very hard for them to articulate why it is getting to them.\nYou are violating their boundaries in a very insidious way, please just trust us when we say this is not okay and stop.",
                      "id": 18,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "I was hoping you'd say something like \"it's been weeks now and I'm starting to lick my private parts\"",
      "id": 19,
      "comments": [
        {
          "score": 6,
          "content": "Stage two of my transformation into a catboy",
          "id": 20,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "ESH. the constant meowing when you see him got to stop. He learned his lesson, (i hope), not to call or refer to your sister as cat-eyed. you are lowkey harassing him now. \n\nalthough your intentions during the presentation wasn't referring to him, anyone in his position will feel like it's being directed to him. also, he needs to properly apologized to your sister.",
      "id": 21,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "ESH he should apologize to your sister, but you did take the meowing too far when he asked you to stop. Even if you didn’t mean to embarrass him, you have, and by now you probably made your point. Apologize to him and ask him to apologize to your sister. If he doesn’t then you can decide what to do from there; remaining friends anyway, remaining friends with the ultimatum he cannot insult your sister, or parting ways and not being friends any longer, or etc etc.",
      "id": 22,
      "comments": [
        {
          "score": 2,
          "content": "He won’t apologize to my sister...I already asked. I don’t want to apologize to him either",
          "id": 23,
          "comments": [
            {
              "score": 3,
              "content": "Well then at this point you both neither need to move on in your friendship without either of you apologizing or just break off your friendship.",
              "id": 24,
              "comments": [
                {
                  "score": 1,
                  "content": "Okay so let’s say hypothetically someone (not me because I don’t like bakugan, I liked Pokémon more) instead of meowing just talked consistently about bakugan or something to my friend and he found that annoying. Is that also bullying?",
                  "id": 25,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I would think that would just be more like being rude/annoying than bullying. I suppose if the friend asked him to stop and he did not then perhaps it could be bullying? It seems as if you all are just better off not being friends.",
                      "id": 26,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "ESH except your sis. Your pal for making fun of your lil sis, of course. And the both of you didn't stop when asked to.\n\nHowever, with regards to the group presentation thing... as someone else has said, anyone in his position would take it as you referring to them. Furthermore, you got lucky. If you had a jerk of a teacher, they could've just took off some marks or even decided to unfairly whack the whole group for barely any reason.\n\nStill, good on ya for sticking up for your sis.",
      "id": 27,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "ESH that’s just weird",
      "id": 28,
      "comments": [
        {
          "score": 0,
          "content": "Why though...I’m not hurting anyone",
          "id": 29,
          "comments": [
            {
              "score": 2,
              "content": "Do you want people to bully you and think you’re some weirdo? Because that’s what they will think. Normal people dork meow at others",
              "id": 30,
              "comments": [
                {
                  "score": 0,
                  "content": " Doesn’t that make them the assholes for bullying?",
                  "id": 31,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NTA, don't stop until he sincerely apologizes directly to your sister. be careful about it at school though, don't let it affect your grades.",
      "id": 32,
      "comments": [
        {
          "score": 1,
          "content": "Yeah this was my original plan but people are saying not to",
          "id": 33,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}