{
  "post content": "My fiancé is American, I am French and we are currently spending time in Paris. Today we had my friend wedding where most of the people were French native speakers.\n\nWe arrived at 11am, had a brunch, the wedding ceremony then finish the afternoon by having dinner & talking. Some people spoke a bit with my fiancé in english but of course a lot of french was happening. At around 7pm, my fiancé said she was tired and thirsty of her zero sugar drink at home and wanted to leave. We left almost right away even if I would have loved to stay longer and enjoy the rest of the day.\n\nOnce at home, we had her sugar-free drink and she started to get dressed and preparing some props for visiting Paris and taking pictures of her (she is doing some photography work). I immediately reacted as I found that unfair that she wanted to go out right now as I though she wanted to rest at home and was tired of the day, and I would have wanted to stay longer at my friend wedding.\n\nShe started sulking and laying silent on bed. I come and cuddle her and said that it's ok we can still go and take her pictures wherever she wants. She got crazy about me saying that and starting to yell about she spend 8 hours in a place with all french speaking person just for me and I should not complain about wanted to go take pictures with her. I stayed calm and try to spoke clearly but unfortunately I got some insults (you are an asshole, go suck your friend d\\*\\*k, and so one) and she throw out some cloth in my face. She started to say that spending 8 hours for me is not enough and I should not be demanding to spend more time at my friends place.\n\nI am really sad about her reaction, but AITA here for saying that?",
  "id": 1,
  "comments": [
    {
      "score": 42,
      "content": "ESH the two of you need to learn how to communicate better with each other. Had you both had an honest conversation from the start the entire argument could have been avoided.",
      "id": 2,
      "comments": [
        {
          "score": 5,
          "content": "Thank you, yes I know communication is sometimes giving us issues specially on sensitive topics.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 22,
      "content": "ESH/YTA. I’m very conflicted here, but I think the whole situation is weird. Honestly spending eight hours at a wedding where you don’t speak the language sounds terrible. I can understand the frustration at the photos, but is that a way she chooses to unwind? Because an 8 hour wedding sounds exhausting and she might want some time for herself, and that might be the way she does it.",
      "id": 4,
      "comments": [
        {
          "score": 2,
          "content": "Fortunately everyone did communicate with her (some people were asian and fluent in english). But I know it was a long day for her and I clearly enjoyed a lot more than her since I was with my best friend. Thank you!",
          "id": 5,
          "comments": [
            {
              "score": 5,
              "content": "I’m glad she was able to talk to some people, but I imagine it was still pretty stressful. Are weddings in France typically that long? Just curious bc American weddings usually aren’t but I’ve only been to a handful of American weddings.",
              "id": 6,
              "comments": [
                {
                  "score": 3,
                  "content": "Yes they are, it's also sometimes continue the next day :D",
                  "id": 7,
                  "comments": [
                    {
                      "score": 4,
                      "content": "That sounds like a fun celebration! Honestly I think the big thing your fiancée had was probably just the culture shock of how long the wedding was. If you’re not really prepared for how long a ceremony like that is I can see why it would be so jarring.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11,
      "content": "I want to know why the hell there are a lot of people saying Y T A when she's acting like a maniac. She is calling you names and throwing things in your face like a fucking child. She should have communicated like an adult and didn't lie saying she was tired. She lied to you to leave the wedding and then started getting resdy to explore Paris. I understand that spending all day around people you can't exactly understand is overwhelming but it's a *wedding*. She couldn't let you have just one day? How entitled.\n\n**NTA.**",
      "id": 9,
      "comments": [
        {
          "score": 0,
          "content": "Thank you, that is also my first reaction when she proposed to do something else.  \nIt's not everyday that an event like that is happening! \n\nI also get the point of being hard for different culture to spend that much time feeling not at \"her place\" which everybody is talking about though.",
          "id": 10,
          "comments": [
            {
              "score": 4,
              "content": "The thing is she was your plus one. She *agreed* to go to the wedding with you plus she was aware that people were going to be hard to understand. She shouldn't have accepted if she feels the need to decide when you guys are leaving places. Especially a wedding you had to travel to.",
              "id": 11,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "The thing is she was your plus one. She *agreed* to go to the wedding with you plus she was aware that people were going to be hard to understand. She shouldn't have accepted if she feels the need to decide when you guys are leaving places. Especially a wedding you had to travel to.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "Ummmm, NTA.  \n\nNot that it’s a requirement to know the language of places you visit, but she’s staying in France and marrying a French man.  She better get used to the language.  \n\nYou were at a friend’s wedding and should be able to enjoy without making it about her.\n\nHer insults were completely uncalled for.  Truly crazy ramblings.  It sounds like she has anger issues.  \n\nI hesitate to say anything based on this incident alone but for all the red flags listed above...think long and hard on what your future brings with this woman.",
      "id": 13,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "NTA your girlfriend is rude, and why does she not know at least a little bit of french\n\nWhen going to another country you should at least try to learn the language",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "ESH. Her getting mad was unnecessary but I completely understand why 8 hours was a bit much for her with almost everyone speaking French when that's not her native language. Honestly, 8 hours is a long time to be at a wedding even if everyone speaks a language you understand. I'm an introvert so that may play into it somewhat but I've never been at a wedding that lasted so long and if I was I would have politely excused myself way sooner. Some sensitivity that these aren't her friends, they're yours, and you're putting her in a prolonged situation where she can hardly communicate would go a long way.",
      "id": 15,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "I think ESH, but I'm a bit biased because my social battery runs out quite quickly and *eight hours* at a wedding would be my nightmare, especially if I couldn't communicate with all the other guests properly. Taking photos is also a way that I might unwind/relax after a long day, so I sympathise with your girlfriend. I don't think your comment was fair.\n\nThat said, she lost your temper and used language to you that wasn't acceptable, so she definitely isn't innocent either.",
      "id": 16,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA.\n\nI once had a bf from Taiwan, who spoke in Mandarin Chinese with all of his friends. Some spoke a little English. Many were nice enough to at least try to include me as best as possible. But unfortunately, the days were still rough, and in some events I'd even turn down going because I felt like I weighed him and the group down. That being said, I always tried to give him and his friends a chance to hang out no matter the language barrier, even if it was a little awkward.\n\nI can get where it'd be hard for her, but it also wasn't about her. It was *your friend's wedding.* It was about *your friend*, and she should have been thankful to be invited (even as a plus one). Clearly, she just wanted to use the wedding as an excuse to hang out in Paris. Her behaviour is narcissistic and entitled. What a shitty thing to do, claim to be tired so that you leave a wedding (that I assume you traveled for) and then immediately rush to go be a tourist.",
      "id": 17,
      "comments": [
        {
          "score": 2,
          "content": "I completely understand you on the language barrier here, hanging out with two different native speaking people can really bring some awkward moments!\n\nBTW, I am living in Paris, so we have plenty of time to visit & travel around the city.",
          "id": 18,
          "comments": [
            {
              "score": 1,
              "content": "Its definitely tough, but the thing is, there events clearly for \"you\", and there are events clearly for \"her\". For example, one of the days I turned down was actually a trip with all the Taiwanese kids (we met a language school in Japan for reference so there were a lot) to Tokyo Disney. It sounded great, but I instead went to a museum with my English-speaking friends and had a blast. We agreed to have our own days. I would, however, go some dinners with them all. It was tough but the important thing was him being surrounded by friends/important people, and I got that same opportunity on other days, where he'd only go with me and my friends.\n\nIs your fiance living in Paris? If so, it honestly makes even less sense, since then there's literally no excuse to go out and do all of this photo stuff that day.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "YTA. She spent eight hours at a party where she could barely communicate with anyone. That's a helluva long time. Then you got pissy that she didn't stay longer and basically said the only legitimate reason she could want to leave was if she was too tired to leave the hotel. She was already very gracious to you today.",
      "id": 20,
      "comments": [
        {
          "score": 4,
          "content": "She sucks to because she should’ve communicated how she was feeling. He’s not saying that was the only legitimate thing he’s mad that he wanted to stay longer and she had to lie to him to get him to leave. All she had to do was say that it’s been 8 hours and she wanted to do some photography work and wanted him to come. Hell Im pretty sure she knew before band how long they’d be out and she could’ve addressed it then and come up with a plan.",
          "id": 21,
          "comments": [
            {
              "score": 2,
              "content": "The plan was explained from the beginning and dinner was normally included (yes French dinner are really late compared to American one, and we start to have dinner at 8/9pm to finish at around midnight; which we probably did not have that the same idea of dinner in mind both of us)",
              "id": 22,
              "comments": [
                {
                  "score": 3,
                  "content": "You expected a 13 hour commitment for a wedding? Language barrier or not that's insane",
                  "id": 23,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Haha, well that's not insane for us, but I get it could be for some other culture :)",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "I still think ESH but not much cause it just seems like things weren’t fully communicated well.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I really think communication is our big issue here unfortunately in both side :( Thank you",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "She said she was tired and wanted to leave. That was true. Then after a brief break in the hotel room she was ready to go out and take some pics which is much more restful than being at a big social event where you can't communicate with people well. She communicated fine. Yes, the fight got out of control but he's the asshole in the situation overall.",
              "id": 27,
              "comments": [
                {
                  "score": 3,
                  "content": "To me being tired means she wanted a nap at the very least. They went back she got a drink and got ready to go right back out. Doesn’t sound like she was tired was more just ready to go and wanted to take photos and expected him to come. Plus the names calling and telling him to suck his friends dick alone makes her an asshole. Op confirmed that she knew the whole plan, which means she knew this would have been a 12 hour affair at least and she had plenty of time to voice her concerns or what she wanted to do before letting it build up and explode on him.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 2,
                      "content": "You can be too tired for one event and not too tired for another. Especially an 8 hour wedding, that's exhausting. But it's mostly the interaction that wears on you, so something peaceful and relaxing like taking pictures is often a way to recharge from a big social event.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "Well, she talked to everybody as people were all talking to her in english, but yes I got annoyed that a wedding is not happening every week \\^\\^ Thank you!",
          "id": 30,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "NTA\n\nHer wanting to go home after 8 hours out is normal, and you were accommodating after she asked.  I don't know about the going out part.  I don't know how far you are from Paris, and if that really would be exhausting or not (though I suspect you might be y t a in that respect since people have different ideas about how to relax).  But her comments were way over the line, and she should expect people to speak French in France.  I'm American btw, and when I live abroad I don't mind that people speak in their own language, even if I don't really understand it that well.",
      "id": 31,
      "comments": [],
      "relation": "Support"
    }
  ]
}