{
  "post content": "So my s/o knows I never cared for dogs, they’re just not my cup of tea. I wouldn’t harm one what so ever. I just don’t like to be around them.  I don’t find them cute. Entertaining or lovable.  The majority of them  gross me out.  (For some reason I do really love pugs) Plus the fact that I’m extremely allergic to them anyway. \n\n\nMy s/o and his ex share a dog, he normally gets the dog one week every month.  I’ve met the dog once. It was a nightmare, it constantly wanted to be around me no matter how much I tried to ignore it and not make eye contact. And I got the worst allergies ever. It sucked existing around it.  But I endured. I didn’t treat it badly. I always ended up either moving away from it or picking it up and putting it back on the floor whenever it wanted to snuggle me. \n\nMy s/o always hyped up his dog.  And that’s cool. I get loving your pet.  I just don’t really care to hype up the pet with him.  Today is his week with his dog, and he tried to get me excited about it. And hype up with him. I gave him a monotoned “yay” and replied “cool” while on my phone. Honestly not really caring. He got upset telling me that I could at least try to be excited for him.  I responded by being sarcastic and faking enthusiasm which made him even more upset.  So now he’s ignoring me and playing with his dog and making passive aggressive remarks everytime I pass by.  Like “it’s okay. The majority of us love you being here” while glaring at me. Which got under my skin in which I said “I’m sorry I don’t care about your damn dog”\n\nI just feel like I haven’t done anything wrong. He knew from day one that I don’t care about dogs.  That includes his dog. Did he think just because I love him means id love his dog?",
  "id": 1,
  "comments": [
    {
      "score": 30,
      "content": "ESH. Your boyfriend is an AH for trying to force you to become a dog person, but you're being an AH by responding with sarcasm and fake enthusiasm. You need to have an adult conversation where you make clear to him that for various reasons, you really just don't like dogs and that's not going to change, and he needs to accept that.",
      "id": 2,
      "comments": [
        {
          "score": 9,
          "content": "Agree with the ESH.  The BF was excited about his dog coming to stay.   Obviously his dog makes him happy.   OP doesn’t have to share in his enthusiasm but the least she could do is be somewhat supportive of her partners happiness.   BF needs to understand that she’s just not a dog person and he shouldn’t get butthurt if OP doesn’t have the same level of excitement. \n\nIt’s just a bad mix and probably will be an area of contention in this relationship.",
          "id": 3,
          "comments": [
            {
              "score": 0,
              "content": "And she's pregnant! This ought to go well. As soon as that baby is born, I have no doubt she'll be telling him that the dog can't come anymore, the dog can't go near the baby, etc.",
              "id": 4,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -3,
              "content": "Right, she could at least come up with some generic compliment like \"Oh, he has a sweet face\" or whatever.",
              "id": 5,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Hard agree, both being AHs to each other.",
          "id": 6,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "But he had the dog before she came along!",
          "id": 7,
          "comments": [
            {
              "score": 5,
              "content": "From the OP: \"He knew from day one that I don’t care about dogs.\"",
              "id": 8,
              "comments": [
                {
                  "score": 8,
                  "content": "That's where she and I differ. If I was highly allergic to dogs, I certainly wouldn't start a relationship with a guy who gets his dog visits every month for a week. Unless there's a professional cleaning service coming in right after the dog leaves, there's still going to be dog hair and dander everywhere. It would be a dealbreaker for me.",
                  "id": 9,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "I changed my mind. Completely agree with you here!",
          "id": 10,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16,
      "content": "NTA.  Seriously though, there are so many posts of dog people and non dog people being in a committed relationship, then being surprised when it causes issues.  This is not an issue that can be compromised on!",
      "id": 11,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 13,
      "content": "The least you could do is be excited to be around this thing that is poison for your body. NTA",
      "id": 12,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 12,
      "content": "Eh, you could both work on your communication and your use of sarcasm instead of talking it out was a little asshole-ish.  Bigger picture:  your partner is a dog lover and you're not.  It sounds like you're not compatible.",
      "id": 13,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 9,
      "content": "YTA, you don't have to like his dog but you don't have to shit on his parade either.",
      "id": 14,
      "comments": [
        {
          "score": 2,
          "content": "I am happy that he’s happy.  As stated in the why I may be ta post.  I’m just not going to pretend to  do so every time it happens when he knows my feelings towards it.  I wasn’t making a big deal about my dislike.  I was simply trying to mind my business",
          "id": 15,
          "comments": [
            {
              "score": 4,
              "content": "Sounds like you were pretty openly negative about it.",
              "id": 16,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "NTA…but he loves dogs and is no the s/o for you.",
      "id": 17,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NTA \n\nBut do you have to see him for that week?? \nAssuming you're not living together would it not be easier to keep away for a week",
      "id": 18,
      "comments": [
        {
          "score": 5,
          "content": "I’m temporarily living with him as I’m close to my pregnancy due date, and rather go into labor while he’s there than in my own  place of living",
          "id": 19,
          "comments": [
            {
              "score": 4,
              "content": "I feel like you should have mentioned you are very pregnant. Your body is already out of your control in so many ways, plus you have to be careful about medication, making the allergy issue worse. I would say it's a very fair ask that the dog not come over for a bit, until you're done breast-feeding.  He should be able to take the dog to a dog park or something.",
              "id": 20,
              "comments": [
                {
                  "score": 6,
                  "content": "I genuinely don’t mind him having the dog around, we’ve made some agreements so that I can tolerate it when around.  Like no being in the bedroom.  And him instantly washing and vacuuming when the dogs gone.  And keeping a close eye on it so it doesn’t sneak in and play with me.  I don’t wanna get in the way of his one week with his dog, I’d feel guilty about it. I just also don’t want to be forced to pretend to care",
                  "id": 21,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I really don’t think he’s asking you to pretend to care about the dog, he’s asking you to care that he’s excited about something that he loves. Like if he scored tickets to a concert for a genre of music you didn’t care about and he was like omg I get to do this super fun thing! And you were just like “yeah uh huh great” with this meh energy. That’s a complete bummer. Is it so hard to muster up the energy to say “I’m happy that you’re so excited for this, I like seeing you happy”",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Who said she's going to nurse her baby?? I don't remember reading that.",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I sincerely hope your baby doesn’t develop your allergy as I don’t think your bf would put him or her first.\n\nESH for getting involved with someone that is so incompatible and bringing a baby into it!",
              "id": 24,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "The only thing you’ve done wrong here is be a complete YTA. \n\nIt doesn’t have to matter to you, but it matters to your SO, meaning you could be happy for him. But, you choose to see only your feelings and act as if you give a shit less about his. \n\nI don’t think he thinks because you love him you’d love his dog too, I just think he thinks you’d give a tiny bit of a shit because it means a lot to him. \n\nHis dog legit seems cooler than you, jus sayin’",
      "id": 25,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "NTA you've already told him before - since day one you said - that you don't care for dogs, you're further in the relationship and he really should've gotten the hint by now and not expect you to suddenly act super hype when you've made it clear with words and actions that you don't care for the dog. Maybe this would have worth a less sarcastic response but it's been long enough and it's kind of ridiculous that he thinks you're going to act differently this time.",
      "id": 26,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA, though a more straightforward approach might be nice: I love you and am happy you are excited to see your dog, but I am allergic and do not like dogs.",
      "id": 27,
      "comments": [
        {
          "score": 1,
          "content": "He had the dog before she came into the relationship.",
          "id": 28,
          "comments": [
            {
              "score": 0,
              "content": "Yes, which makes me wonder how he didn't know this already",
              "id": 29,
              "comments": [
                {
                  "score": 4,
                  "content": "But why didn't SHE know she should tell him? The dog was there first. It's should be have been a dealbreaker from the beginning, not later.",
                  "id": 30,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I am with you. When I say how did he not know, I mean how did they go this long without her telling him or him picking up on clues. I'm debating whether to change my vote.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "Something tells me this isn’t a long relationship.",
                  "id": 32,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I think she's pregnant!",
                      "id": 33,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 1,
                      "content": "Exactly.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}