{
  "post content": "I F30 have been with my fiance \"Ned\" M36 for a year and a half. He has a 5yo son with his ex girlfriend. They don't have a custody arrangement but he has him most of the week because the mom is currently sick. His son is lovely but I noticed that Ned takes him everywhere he goes, including places that aren't child friendly and we have an issue with that now but we're working on it.\n\n\n\nHis son's 5th birthday was days ago, Ned took us out to a restaurant to celebrate. The place was nice and looked a bit unfitting for the occasion because it was a somewhat expensive place.\n\n\nAnyways, We ordered food then got the birthday cake which was a surprise to me because I thought we were going to celebrate at home...so we could be free to sing and play however we wanted. I still had no issue with that til Ned started singing the \"happy birthday song\" to his son. I was stunned I almost drop my plate. He was singing it at the top of his lungs not even looking around or paying attention to how many people staring at us awkwardly. I felt so embarrassed I kept whispering for him to stop but he ignored me. Of course my future stepson was hyped and a little too active which isn't good when we're at a public place. I expected the staff, the manager, anyone to get involved and stop him but no one did. In fact some woman came up to us and offered that she \"help him take a video recording\". I wasn't in it at all. I froze in my seat looking stunned and a little angry.\n\nHe looked at me later asking what was wrong. I didn't say anything except \"thanks for finally noticing!\" he didn't understand what I meant and I didn't explain til we were in the car. I flatout told him that he embarrassed me the second he started singing in the restaurant. He looked shocked saying he didn't get why I would be embarrassed by him celebrating his son's birthday and cheering him up. I told him we could've done this at home when we'd be more comfortable and free. He took it as in I was ashamed of him and his son but I denied it and said that it just felt awkward and embarrassing to maybe because I've never been in this situation and also judging from the restaurant we were at. He said that his son's mom is sick and he's trying to do all he can to cheer him up and that all families do that and no one had an issue with that except me then when I tried to explain, he got mad and said he no longer felt like talking.\n\nWe haven't been speaking since then. It appears he's still salty about me saying what I said and insiating that I see him and his son as an embarrassement.\n\nAITA? I think he's being too harsh with the whole ignoring me thing instead of talking it out.",
  "id": 1,
  "comments": [
    {
      "score": 43160,
      "content": "He gleefully sang happy birthday to his child, whose mother is sick, while you sat there sulking in your anger. \n\nAre you applying to be a evil stepmother by any chance?\n\nYou prioritize not being embarrassed over a fun moment between a father and his son. The restaurant staff didn’t think it was inappropriate. It doesn’t seem that you are a good match for someone with kids. \n\nYTA.",
      "id": 2,
      "comments": [
        {
          "score": 29784,
          "content": "YTA\n\nYou should not marry someone with a 5 yr old kid that they love. You are going to be absolutely SHOCKED at how often they will embarrass themselves in public to have fun with their kid. \n\nI don't think your knickers would survive the trauma.",
          "id": 3,
          "comments": [
            {
              "score": 8088,
              "content": "Oh, I truly hope he leaves her for the kid’s sake. Also, why would she be embarrassed about something that is cute and not embarrassing at all? Ugh\n\nYTA",
              "id": 4,
              "comments": [
                {
                  "score": 3102,
                  "content": "Right! I would be so in love seeing my man sing happy birthday to our children.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2635,
                      "content": "My husband is my 6yo nephew’s favorite person and let me tell you, when hubs sings happy birthday to my nephew it’s with his whole chest. It’s the cutest most adorable thing I’ve ever seen, never once would I imagine it to be embarrassing",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1148,
                      "content": "Right? OP, what is wrong with you? His mama is sick, he’s FIVE and his daddy did something special for him. If I was in that restaurant I would have sang with your fiancé. We sing happy birthday to our children in nice places. NO ONE cares. Everyone thinks it’s sweet and then the moment moves on. Please get over yourself. YTA",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 522,
                      "content": "'Salty' Ned sounds like a great Father -- I trust that he is not going to make his kid have to deal with OP much longer.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 186,
                      "content": "Bc to OP it’s not “our children” it’s “his kid.”",
                      "id": 9,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "You said something that hit the nail on the head without meaning to. You said \"our children\" and I think that is where she has the issue. Its not her child but her soon-to-be step child. I bet a dollar to donuts if it was a child, they had together she would have been singing right along with him.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "If my man prioritized his kid’s happiness and special day over the possibility of judgmental looks  from strangers in a fancy restaurant, I’d marry him even faster.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "My fiancé sang happy birthday to ME, his adult fiancée, in a fancy restaurant when it was just the two of us. It embarrassed me but in the most endearing way as he was really showing his love and celebrating me instead of caring what others thought. The neighboring table even joined in. It was a good laugh. How negative is OP to not even come around and celebrate her future step son?",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I am child free. I said I'd never be with someone who has kids. My current partner (of 7 years) is a great dad and co-parent. Honestly, that was one of the things that made me realize he's a good man. If he didn't do \"stupid\" things to show his son how loved and important he was, I would be concerned",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 567,
                  "content": "For real. If she doesn’t set this man free…I hope he sets himself free. This woman is one hundred percent giving off the vibe that when she talks about her/their family, it won’t include her stepson. The older he gets, the more of a chill he will feel. \n\n“Your son is too loud. He’s too messy. Why does he have to live here half the time? I just wanted it to be OUR family.”\n\nThis is not the relationship for her.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 252,
                      "content": "\"His son is lovely but I noticed that Ned takes him everywhere he goes.\" She literally complained that father spends time with son. Next she'll be making coats out of dalmatian puppies.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 562,
                  "content": "I read your comment as, \"I hope he leaves her for the child's cake\" which also fits pretty well.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 326,
                      "content": "She doesn't deserve any cake",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 272,
                      "content": "I would leave this woman for cake",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Imagine if OP made him choose between her and cake",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 461,
                  "content": "I don't understand why people like OP date people with children. Jesus H Christ, singing happy birthday in a restaurant is fucking normal. I remember being a kid and being excited as fuck for staff at the Olive Garden to sing happy birthday to me.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 144,
                      "content": "Yeah, she thought the manager would stop him. More likely he felt bad that the staff didn't join in.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 130,
                      "content": "[deleted]",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 144,
                  "content": "No kidding, Im always singing and dancing and being silly at the store or where ever I am with my daughter (17 months) because it makes her happy. And hopefully it'll teach her not to care what others around her are thinking as long as shes being her authentic self.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Don’t ever stop!!! My son is now a tween and gets embarrassed sometimes but when we cuddle he still talks about how he loves us laughing and singing together! That is what they will remember!",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "I have found I can do all kinds of stuff when I have kids with me. If a sing and dance by myself it is weird. Me and a kid and everyone just smiles at the kids and ignores me.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I 100% would be embarrassed. This is totally something my husband would do, and I have severe social anxiety and would probably want to hide under the floor.\n\nHOWEVER, I would never berate him for it. Just because a situation is something that makes me uncomfortable, doesn't make it wrong.",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Me too it is far too often we read about absentee dads and here is one who is trying to make his sons birthday wonderful and she has to pout like she is younger than the son.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Not only was she embarrassed but she expected the manager and wait staff to get involved. As if they were going to tell him to stop? I have worked at fancy restaurants, no one has a problem celebrating like this.",
                  "id": 28,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "First thing I did was check how long they’ve been together: 1.5 years. Immediate reaction? “Oh good, it won’t be that huge of a deal to leave her.” \n\nYTA.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Exactly. What a boring woman. These people who think \"everything is embarassing\" not only miss out on fun themselves but usually dont even let their kids have fun. I should know because I am one of those unfortunate kids.\n\nIt was so cute and sweet of the father to do that! I would join with the loud singing if I were in Op's place",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 777,
              "content": "He even…..\n*gasps*\n….takes his child out in PUBLIC with him!!!!\n\nWhat will the neighbors say????\n\nOP - YTA\n\nIf you find children to be so burdensome and embarrassing, why on earth would you be with somebody who sounds like an amazing father with a very active role in his sons life???",
              "id": 31,
              "comments": [
                {
                  "score": 18,
                  "content": "Because it sounds like OP’s boyfriend has money based on the expensive restaurants and “non child friendly places”. That’s why she’s with him. Hopefully he realizes she isn’t suited well with his embarrassing lifestyle.",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 18,
                  "content": "These pearls stay clutched lmao",
                  "id": 33,
                  "comments": [
                    {
                      "score": 9,
                      "content": "Honestly it’s quite impressive. Where do these people get the necklaces that hold up to all that tugging?",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 700,
              "content": "Absolutely agreed.\n\n>His son is lovely but I noticed that Ned takes him everywhere he goes\n\nSomeone with this mentality towards a father and his 5 year old son *should not be dating someone with a 5 year old son.*\n\nThe fact OP feels like they're right and saying \"thanks for finally noticing\" after being petty is an appropriate response makes me really hope her fiance puts his kid first and dumps her asap.\n\nOP, YTA",
              "id": 35,
              "comments": [
                {
                  "score": 293,
                  "content": "Exactly! She definitely has an issue with the child being around. Possibly bc the attention is on him more than her. “Thanks for finally noticing”.. as in “finally you took the attention off of your 5yr old son on his bday long enough to look my way and give me the attention I’m clearly being petty about and I’m silently brooding over this whole night” doubt it was just the bday song that pissed her off. She is JEALOUS of a 5yr old! Husband needs to go.. it will get worse.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 19,
                      "content": "You nailed it on the jealousy and the father is her fiance. I hope the guy dumps her soon or he and his son are going to be miserable soon.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Nope not just wanting attention.she puts on  airs AND a front.. everything was about the nice restaurant and how she thought both she, he and the son should act and what others must think.\n\nMommy dearest on steroids.\n\n She would be a nightmare stepmother and think rhe son should be grateful she deigns to let him stay in his dad's life.  Ugh🤮🤮",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Can you imagine if it were a daughter?",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Yep. OP is definitely YTA. I'd also like to point out her response and subsequent argument with fiance was almost definitely noticed by the son and there's a decent chance he feels like it's his fault for celebrating his birthday. OP should not be around this kid anymore.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Ok this. Does she think you can crate them like a puppy?",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "The ‘thanks for finally noticing’ was the last straw for me. I pray OP’s fiancé dumps this brat.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 364,
              "content": "Omg, this. Her fiancé sounds like a sweet father. If a moment of pure joy somehow embarrassed her, she is not cut out for this and will only harm that child. \n\nReally, kids do some truly embarrassing things - and that is just part of parenthood. [Kids chaotically embarrassing their parents](https://www.buzzfeed.com/hannahdobro/kids-chaotically-embarrassing-their-parents)",
              "id": 43,
              "comments": [
                {
                  "score": 8,
                  "content": "Thank you for the laughs. As a parent, this was great.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 262,
              "content": "> I don't think your knickers would survive the trauma.\n\nTruer words were never spoken.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 218,
              "content": "Yes thank you!! Not everyone is good with kids/wants to be around them or deal with them and that’s FINE. What’s not fine is to insert yourself in a child’s life and suck this much about doing nice things for a child. \n\nOP - YTA, adults sing to each other in restaurants, if someone walked over offering to take a video I highly doubt it was as out of place as you’re making it sound. It’s great your partner includes his son by bringing him everywhere, as long as his child acts appropriately I see no issue, he’s actually teaching his son how to behave by doing this. You should prob rethink a relationship with a parent if you don’t like their child being included in daily life and your partner singing happy birthday to their kid in public.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 198,
              "content": "This is very very good advice. I am someone who gets absolutely mortified by things like people singing happy birthday to me or someone close to me in public, but I have on many occasions, humiliated myself for the sake of my nephews’ happiness.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 157,
              "content": "When my niece was five. She did my hair and makeup. I looked positively frightful. She was so proud of the job she had done. \n\nSo I went out in public like that. I would do it again. \n\nYTA",
              "id": 48,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 129,
              "content": "Note how nobody, staff or other customers, came up to complain. Because nobody else cared that much, even if some of them might possibly have found it inappropriate. YTA",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Y'all.  She was so stunned that she almost dropped her plate.\n\nMy, my, my.  I thought dramatic people had a fun side.\n\nYTA.  I'm single now, and there are things I had to decide before I started dating again.  Kids are not off of the table for me, and barring any baby mama drama, a five year old kid would be awesome in my book.  I'm silly.  I love kids.  I would have brought the house down singing birthday wishes to that little boy.  Jazz hands.  End scene tipping bowler hat.\n\nIf you're going to date anyone, you have to ask yourself if you're willing to tolerate children or not.  If you can't, leave single dads alone.  The kid always suffers the most.  Don't be selfish.  \n\nAlso, please remove the massive stick up your butt.  Big boring baby.",
              "id": 50,
              "comments": [
                {
                  "score": 13,
                  "content": "Why didn't she have the plate on the table like a normal person? That line bothered me way too much. I've never been in a position to drop my plate at a \"fancy\" restaurant because I don't pick it up.",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1163,
          "content": "Did she ever consider the other dinner's reaction was because of her reaction? I'd be uncomfortable with watching a woman sulk instead of joining in!\n\nBut nope, OP never considered she, not dad or child,  looked embarrassing.",
          "id": 52,
          "comments": [
            {
              "score": 539,
              "content": "On the odd occasion I've been eating at a place and a group have started signing happy birthday, I've joined in 😂 other random diners have done the same too!",
              "id": 53,
              "comments": [
                {
                  "score": 436,
                  "content": "I’ll never forget when I turned 40 and a table full of drunk dudes joined in on singing happy birthday to me loudly!! After they were done they yell happy birthday Beverly! Even though my name is not Beverly and starts with a “D” I loved it!! My grandma’s name was Beverly so I took it as a sign that she was there with me in spirit lol! By the way, this was an expensive restaurant in a wealthy neighborhood and no one gave a shit about the singing. OP is a massive AH.",
                  "id": 54,
                  "comments": [
                    {
                      "score": 140,
                      "content": "I’ve been that drunk person! Three friends and I were at Applebees having some drinks to cheer up our friend. This lady was celebrating her 50th birthday with her husband. It was like a Tuesday. She ordered us a big dessert to share and told us about her plans for her real party the following weekend, said we come come if we promise to sing again. She told us her secrets of life. It was probably just to cheer up our sad friend but the birthday girl, named Mary btw was so excited.",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 140,
                  "content": "YTA. He was celebrating his son birthday that probably wasn't being easy with his mom being sick.\nI don't if it's from the country I'm from, but everyone in the restaurant joins when people are singing happy birthday to someone, which is funny because when it comes to part where you sing their name you notice the silence that comes with it 😂",
                  "id": 56,
                  "comments": [
                    {
                      "score": 11,
                      "content": "**\"... HAPPY BIRTHDAY DEA**R ^^nurnurnur , **HAPPY BIRTHDAY TO YOU!!!!\"**",
                      "id": 57,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 114,
                  "content": "It's my favorite thing when I go to restaurants and the staff sings happy birthday to someone! One glorious Saturday at my favorite Tex-Mex place, there were four different parties celebrating birthdays. My hands were sore from clapping along, and it was the best!",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "saaaaame! the best is when people send cake around. I even had that happen on my 40th birthday! I was like score--free sugary appetizer lol",
                  "id": 59,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 107,
              "content": "I mean it's not the embarrassing thing some restaurants do where the servers sing a song and put on a show. This is literally a man singing the happy birthday song which doesn't take more than what 15 - 20 seconds depending on how fast he's singing. There's a reason why people were told to sing the happy birthday song to time yourself so you properly washed your hands it's just long enough but also not too long.\n\nAlso can't get passed how OP was embarrassed that a 5 year old was acting all excited and happy because his dad surprised him with cake on his birthday. A child not being the epitome of \"seen not heard\" is somehow embarrassing? OP is in for a shock when she has own kids. Or is just because it's the stepson, specifically, the problem because he's not following the old \"seen not heard\" rule?",
              "id": 60,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "One diner even offered to video the occasion of which OP was not part of and why would she be? She was too embarrassed to also sing and celebrate the child's birthday. OP needs not date people with children if she's going to be a stick in the mud. I hope he dumps her and her high horse attitude.",
              "id": 61,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "And then she's complaining she isnt in the video. So when they look back on it they can be reminded of how much of a buzz kill his ex was? YTA op,",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I think she was looking through anti-rose-colored glasses, and possibly found the 2 or 3 people who were annoyed while most of them didn’t mind in the least.  I hate to be sung to on my birthday, but will happily join in singing for a child or any adult who enjoys it.\n\n(I actually hate to be sung to at home as well - I don’t know what to do with myself when the center of attention.)",
              "id": 63,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This! Those other people were probably wondering why op was acting weird about it smh",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "i am a grouchy childfree lady. i *still* would probably have joined in at the restaurant, and have sung happy birthday to my countless adult, childless friends in bougie restaurants. people weren't mad, because by and large  they DONT HATE FUN.",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "My thoughts as well. Or that she was just projecting and wildly misinterpreting their expressions. But that the entire restaurant was upset and uncomfortable that a dad sang a ten second song to his little boy is kind of pushing believability.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 662,
          "content": "Dude some other benefactor at the restaurant came to take their video 🤣. The others were actually enjoying it, I don’t see why OP felt they were looking at her awkwardly. \nLol get that stick out of your a, OP. YTA",
          "id": 67,
          "comments": [
            {
              "score": 572,
              "content": "The other lady probably noticed that she wasn't taking photos or video and was surprised, so she graciously volunteered. That lady = the real MVP.",
              "id": 68,
              "comments": [
                {
                  "score": 410,
                  "content": "Especially since she cropped grouchy stepmom out of the video.  That woman's the hero we all need.",
                  "id": 69,
                  "comments": [
                    {
                      "score": 216,
                      "content": "Loved that part! She didn’t want the kid to look back in a few years and ask who the weird lady was at his birthday. 🤣",
                      "id": 70,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "lol she did that on purpose.",
                      "id": 71,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "She’s not step mom yet! Thank God. Hunny’s getting waaaay ahead of herself.",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 140,
              "content": ">I don’t see why OP felt they were looking at her awkwardly\n\nProbably because her sulky face made a beautiful moment... awkward. Glad neither Dad nor child was affected by her sulks in the moment.",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "The fact that she wasn't included in the video says literally everything. The person recording saw OP having a meltdown because a dad was singing happy birthday to his kid and decided to step in and record the moment (minus the person actively trying to ruin the moment)",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Oh, I know why the other people were looking at her awkwardly. But not for the reason she thought.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 270,
          "content": "Lmaoo \"applying to be evil step mother\"",
          "id": 76,
          "comments": [
            {
              "score": 69,
              "content": "I think she stands a good chance at getting the job. Unless of course, the boss man decides he would rather just get a regular step mother.",
              "id": 77,
              "comments": [
                {
                  "score": 7,
                  "content": "The man appears to love his child, so I'm confident he will find  a better applicant.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 221,
          "content": "And I bet that the other people didn't really care one way or another. With OP already deciding it was The Most Embarrassing Thing EVER, she probably interpreted the looks of indifference and curiosity as people criticizing her. Except that other woman who offered to help taking a video, she sounds lovely.\n\nAnd OP was not only pissed off about a father showing love to his son, she seems to also expect him to read her mind, got mad when he failed to do so, and is now giving him the silent treatment.\n\nAlso, I'm preeeeeetty sus as to OP minimizing the wife being \"sick\", it makes it sound like she has the flu, but the fact that Husband has full custody currently, that mom couldn't attend the birthday dinner, and that husband is trying everything he can to cheer him up, makes me think it's way more serious than simply being \"sick\"",
          "id": 79,
          "comments": [
            {
              "score": 21,
              "content": "I thought the same, to be honest, regarding the co-parent's illness. OP is TA regardless, but I have a feeling it might be even worse than it seems. I hope Ned reconsiders the engagement...",
              "id": 80,
              "comments": [
                {
                  "score": 7,
                  "content": "I was thinking the same thing. Like maybe on the mild side, having crohn's actively making her ill (far from even remotely mild). Family member of mine had active Crohn's disease for YEARS. Thankfully it went into remission and while people say you never actually get over having Crohn's, she did and doesn't have to take medicine for it anymore. On the bad side, my thoughts were mom (5 year old boy in post's mom) is battling some malignant cancer and the chemo is making her severely sick (as well as the cancer) or even lyme's disease.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 112,
          "content": "Staff was relieved they wouldn't have to sing.",
          "id": 82,
          "comments": [
            {
              "score": 9,
              "content": "yeah a cake showed up, who brought the cake, i’m sure they weren’t surprised nor cared",
              "id": 83,
              "comments": [
                {
                  "score": 16,
                  "content": "Also plenty of restaurants are happy to have people celebrate parties at their restaurants. It brings in more money and all the customers have to do is call in to either reserve space for a big number of people and/or to let them know you're bringing in a cake and they'll keep in the back for you so it can be served when it's time for dessert. Everyone wins. The guests don't have to worry about making food and the restaurant makes money. Yeah like you said the restaurant does not care and definitely knew.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Thing I read was they brought out a cake which where I am high end places don't sell cakes in the whole unless pre-ordered or dropped off so presumably he spoke to staff beforehand. How self involved op must be not to realise staff fetching the cake probably meant he had approval.",
          "id": 85,
          "comments": [
            {
              "score": 6,
              "content": "It was probably an Olive Garden but she thinks kids don't belong anywhere but McDonald's.",
              "id": 86,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": ">I noticed that Ned takes him everywhere he goes, including places that aren't child friendly and we have an issue with that now but we're working on it.  \n\nI got this far and was at YTA. It didn't get better as OP kept talking.  \n\nAnd in case OP actually reads this, when you're a parent you tend to take the little humans everywhere. It's part of parenting. Even more so if one is a parent whose kid is experiencing something potentially traumatic like a mom sick enough to be unable to care for him. In such cases lot of places become child friendly out of necessity. If kiddo is not causing problems, then who cares if he goes to an expensive restaurant?",
          "id": 87,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 15,
          "content": "I don't like public birthday songs either, I find them mortifying, but this was for a KID. Suck it up, OP.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "YTA. He did nothing wrong, and you're a jerk. Also you have really weird opinions about what is embarrassing and your partner is clearly not on the same page. Plus you seem to be bad with his kid. You should pack your bags and move on to someone whose life is better aligned with yours.",
          "id": 89,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 17803,
      "content": "It's not embarrassing to sing Happy Birthday to a child. \n\nIt is, however, **super** embarrassing to look pissed off at a person singing happy birthday to a child *at the same table as you*. \n\nYTA.",
      "id": 90,
      "comments": [
        {
          "score": 4210,
          "content": "Of course people we’re looking out of curiosity and probably wondering if they should join. They probably saw her face  and were confused why she looked upset. Sounds like she embarrassed herself.",
          "id": 91,
          "comments": [
            {
              "score": 1720,
              "content": "I love the “we could have been more comfortable at home.” Sounds like OP was the only one uncomfortable and made it wildly more uncomfortable for everyone else by being angry about a 5 year old getting excited for their birthday..I hope the little boy didn’t notice any of this",
              "id": 92,
              "comments": [
                {
                  "score": 654,
                  "content": "She \"flat-out explained it\" in the car. I think the kid got an earful. I am sad for the kid.",
                  "id": 93,
                  "comments": [
                    {
                      "score": 322,
                      "content": "That part bummed me out too, I actually doubled back and re-read it because it just seemed cruel to do in the car right in front of him. Hopefully his dad gained some insight into what type of woman his fiancé really is.",
                      "id": 94,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 277,
                  "content": "World definitely revolves around her.  Poison.",
                  "id": 95,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 439,
              "content": "Exactly. Good on that kind lady for cutting OP out of the video and capturing a sweet moment for father and son.",
              "id": 96,
              "comments": [
                {
                  "score": 227,
                  "content": "The true MVP of the story, helped OP not have to be embarrassed over seeing the video or having to explain her attitude whenever the video is shared, and helped the father still have a good time with his kid and be able to look back at it without thinking about his soon to be Ex.",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "How can it be that OP is both embarassed by the song and angry about not being in the video with a face like three urangutangs were peeing on her shoes. Make a choice and live by it, OP, but you can't have both here. \n\nYTA",
                  "id": 98,
                  "comments": [
                    {
                      "score": 8,
                      "content": "“Three orangutans peeing on her shoes” cracked me up.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Right easier to edit her out now...",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "I join in in clapping and whoo hooing when I’m at a restaurant and the staff sings their birthday song.",
              "id": 101,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Maybe why she wasn't included in the video",
              "id": 102,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I always join in at restaurants when someone is singing the birthday song. Even if they are at the other side of the restaurant. THAT embarrasses my kid but she's 12 so everything I do does.",
              "id": 103,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 948,
          "content": "_\"Thanks for finally noticing!\"_\n\nI hope for this guy and his kid's sake that he runs for the hills. OP was upset that this guy dare take his kid to a nicer restaurant for his bday. Then, OP was pissed that he dare sing happy birthday. And, then OP was livid that he ignored her attemps to ruin the evening with her sour attitude.\n\nOP, to be blunt, try as you might, the evening wasn't about you. Good on this guy for making his kid's bday memorable despite the mom being sick and ignoring your antics. Also, the kind lady didnt capture you in the video because she wanted to capture a lovely moment sans your hostility that was in full display.",
          "id": 104,
          "comments": [
            {
              "score": 117,
              "content": "I feel like dad and kid will watch that video back in the near future and be glad OP isn't in it at all",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Pouted until he noticed, instead of acting like an adult. \n\nYTA",
              "id": 106,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Oh, the passive aggressive silent treatment. Sulking until someone notices and asks you what’s wrong. Excellent communication skills. A+.",
              "id": 107,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 419,
          "content": "[removed]",
          "id": 108,
          "comments": [
            {
              "score": 169,
              "content": "Exactly! OP was clearly seeking attention and wanted to make a show of being pissed. Thankfully the dad expertly paid her dust.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Fiancé and hopefully not becoming a wife! \nYTA.",
              "id": 110,
              "comments": [
                {
                  "score": 4,
                  "content": "Truth. I just hope this man has the clarity of mind to get himself, and his son away from this walking pile of red flags.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Not husband. Fiancé. And I hope he leaves her while he still has the chance.",
              "id": 112,
              "comments": [
                {
                  "score": 9,
                  "content": "Tell him to hit up that lady that offered to take a photo",
                  "id": 113,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 379,
          "content": "Im really confused on the “he takes the kid everywhere even places that don’t allow kids. We’re working on it.”\n\nDoes OP think this child is a dog you leave at home? Why do they keep going to “places unfit for children” when they have a CHILD with them?\n\nIm kind of curious what place this is that OP is saying isn’t child friendly/not appropriate for happy birthday songs. Like some super fancy places do not allow children under ten but the dad sounds so caring I imagine he took the kid to a family friendly place for the kid’s birthday.",
          "id": 114,
          "comments": [
            {
              "score": 26,
              "content": "My kiddo eats meat...like A LOT. When she was 4 she saw a fancy steak house (think Ruth's Chris) when we were in the city. I had made some extra cash that month (I was a single mom, no support) so I took her in and got her a steak. I don't eat meat nor could I afford to eat myself so we just sat together. We made such a racket giggling and laughing. At 10 she still remembers \"steak monster\" and the restaurant (just a joke we made). I took my kid everywhere because we wanted to be together. When I met my now husband he joined in too. We still take her aost everywhere to the point we joke after 7 years we've only been on 8 dates lol",
              "id": 115,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Maybe he takes his kid to the movie theater with them but they don't actually watch children's movies? That's the only reasonable explanation I can come up with. Also, at least where I am, children are allowed to watch movies at the theater if they are under the listed age limit but go with their parent(s).",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "Because the dinner wasn't all about OP.  She is jealous of a 5 year old.",
          "id": 117,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "Exactly. If they were judging your table,  guarantee they were judging you",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Poor OP. What kind of childhood did she have to think you’re not supposed to sing happy birthday in front of other people?",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "I'm just imagining myself as a child free diner. I hear an eruption of a \"Happy Birthday\" solo so, naturally, I look over. At first, I'm smiling because this is a fun, joyous thing. And then I see a third person at the table. Who isn't singing. And appears to be . . . sulking? I'd be, like, \"WTAF? That's super weird.\" And I would no longer be smiling. Thinking about the weirdo apparently upset by a child's birthday. And then I lock eyes with the third person. Who takes my lack of joy as confirmation that the *singing* is the problem here.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13136,
      "content": "YTA. “He has a 5 year old that he takes everywhere and we are working on that problem.”\n\nThe kid is 5!!!! Sounds like if it were up to you, you’d leave him in the car and crack a window. FFS, you obviously should not be dating someone who has a child because you are way too engrossed in yourself.",
      "id": 121,
      "comments": [
        {
          "score": 4267,
          "content": "Right? My boyfriend has an “being a good parent” problem I’m trying to correct. What a nightmare",
          "id": 122,
          "comments": [
            {
              "score": 1059,
              "content": "Yeah, like how dare a father want to spend time with his son, and in public too?  /s",
              "id": 123,
              "comments": [
                {
                  "score": 647,
                  "content": "And on his birthday for Christmas sake\n\nEdit: that was supposed to be Christ’s sake but I kinda like Christmas sake.",
                  "id": 124,
                  "comments": [
                    {
                      "score": 163,
                      "content": "Christmas sake is a lot better in my opinion lol",
                      "id": 125,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "I though it was intentional! Stealing it!!",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Good Lord-if this is the reaction for a kids birthday, the reaction to a kids Christmas will be another whole level of embarrassing situation for this woman.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 555,
              "content": "Why can't women like OP hook up with deadbeat dads instead?  Pair off and leave everyone else alone.",
              "id": 128,
              "comments": [
                {
                  "score": 491,
                  "content": "[deleted]",
                  "id": 129,
                  "comments": [
                    {
                      "score": 157,
                      "content": "This is such a true statement and it breaks my heart.",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 144,
                      "content": "Jesus, this statement gave me chills. I never thought of it that way, but you're right. There are people like this.",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "True. When I started dating my partner of ten years now, I had a cousin who told me that I needed to do what I could to push his son out of his life. Guess who I pushed out instead? My stepson is 13 now and my favourite person on earth.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "It's a real thing I found when I starting dating again. Guys would actually rage at me that I was cancelling our date cuz my kid was sick/babysitter cancelled etc. One actually said if I wanted things to work with him I had to put him first...over my then 3 year old. Blocked. My now husband is quite aware and totally accepts that our child is numero uno always.",
                      "id": 133,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Whew you said that quiet part loud",
                      "id": 134,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Not to mention, she is 30. There are plenty of men in their late 20’s, 30’s and even 40’s that have never had children. She doesn’t have to date fathers at all.\n\nBut you know that if/when she has her own children, she will think the sun shines out of their butts, and will have completely forgotten about “embarrassing” stuff like this - most likely she will be the type of mom who think her children are nothing but saints and the second coming of Jesus, to the detriment of every other person around her.",
                  "id": 135,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 235,
              "content": "The horror. Someone's a good parent. A good fucking father. And all I can think about is ME. And OMGZ! How embarrassing he is to/for ME! \n\nFFS OP. Yes, YTA! Grow. The. Fuck. Up.",
              "id": 136,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 40,
              "content": "😂😂 too real",
              "id": 137,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "I wish a lot more parents had that problem!!!",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "OP is mad that she’s not his priority. She shouldn’t be dating someone with kids it sounds like.",
              "id": 139,
              "comments": [
                {
                  "score": 8,
                  "content": "Not only that she isn’t his priority, but that she’s not his priority on the kids own birthday.",
                  "id": 140,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Seriously. He needs to run.",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "The rare moment when everyone's saying you should break up but not for OPs benefit.",
              "id": 142,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 480,
          "content": "Translation: I am attempting to force this kid out of his fathers life.",
          "id": 143,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 361,
          "content": "Can't believe he won't simply crate train the child -- OP, who fell out of a Dickens novel apparently",
          "id": 144,
          "comments": [
            {
              "score": 12,
              "content": "Is her last name...Murdstone?",
              "id": 145,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Just chain 'em up in the yard with a Happy Meal.",
              "id": 146,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 258,
          "content": "Yep!\n\nWe take our young kids places that other people don't expect children to be...  like on week-long canoe trips to Isle Royale National Park, or 10 miles into the backcountry of Yellowstone, and yeah, we get some weird looks.\n\nOP's upset her boyfriend took his kid to a RESTAURANT!  It's very clear she's not used to being around children and has no perspective for what is normal for parents.",
          "id": 147,
          "comments": [
            {
              "score": 220,
              "content": "To be fair, my husband and I were occasionally upset about kids at adult centric locations because we paid lots of money to have a babysitter and a child-free night out.  But we're talking about toddlers running around while the sword dancer is trying to perform.  Or children crying in a truly high end restaurant and the parents doing nothing about it.\n\nWe had no objections when we were at a nice seafood restaurant and there were elementary aged kids at the next table because they were soft spoken and well behaved, as befitted the environment.  And I was impressed when the chef sent out PBJ \"sushi rolls\" for the kids, alongside the seafood, to ensure they had fun and something they'd for sure enjoy if the grown up food wasn't to their taste.",
              "id": 148,
              "comments": [
                {
                  "score": 101,
                  "content": "THIS! OP talks about places that \"aren't child-friendly\" but there is no such place, there are only children who don't know how to behave and shouldn't be in such places . . . and those children DEFINITELY exist, and are many, but there are also plenty of kids who DO know how to behave appropriately in more upscale restaurants, theatres, etc., and it sounds like her fiance's son is one of them.\n\nWe started taking my oldest nieces to nice restaurants very young, but the expectations for their behaviour were laid out clearly, they were always given things to distract them (crayons, paper, books), and on the RARE occasion that they'd start to fuss they were removed from the restaurant IMMEDIATELY before they could bother anyone. But 9.5 times out of 10 they were beautifully behaved and we'd get compliments from waitstaff about how sweet and polite they were, even as 3- and 4-year-olds. They'd eat all kinds of things, and they loved how nicely THEY were treated when they behaved nicely. \n\nOP is such an AH. There is nothing wrong with taking the 5-year-old to nice places if he enjoys them and behaves well. And given that his mother is ill, it's honestly lovely that his father is taking this time and doing special things with him.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 173,
                      "content": "> OP talks about places that \"aren't child-friendly\" but there is no such place\n\nCome on now, let's not be extreme. Toddlers acting out because you brought them to a 3-hour Chekhov play for example are not \"badly-behaved,\" they're toddlers whose parents don't understand what is age-appropriate for them. There are MANY places that are not child-friendly, not just because they contain inappropriate content but because kids of a certain age can't be expected to sit through an experience that offers them nothing without getting bored and restless.\n\nWho knows what OP specifically means by this but even very well-behaved children occasionally have bad reactions to being brought places that aren't appropriate for them. I guarantee the actual parents of your nieces have a horror story or two, every parent does.",
                      "id": 150,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 44,
                      "content": "Really? She's the ah. But there are non child friendly places...unless you take your kids to strip bars, dance clubs , and bars. 🤪",
                      "id": 151,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": ">OP talks about places that \"aren't child-friendly\" but there is no such place,\n\nWell the Prince and Princess of Wales did feel that a full day ceremony would not be appropriate for  4-year old Louis.  They did of course decide that the 7 and 9 year olds would be fine and decided to let them accompany the adults.   It was a *child-focused* decision.   Here the OP hasn't said anything at all about the child's behavior -- nothing about his being loud or fidgety -- she just doesn't think he should have been there because her boyfriend treated him like an honored little guest and no one else objected.   She's not step-mom material.",
                      "id": 152,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": ">PBJ \"sushi rolls\"\n\nCute!\n\nMy 4yo loves sushi rolls, and my 7yo likes sashimi and nagiri but is a bit put off by rolls that have too much stuff in them...  it's funny what kids like when they see their parents eating it and don't think about it too much!\n\nBut yeah, when they're running around, it's time for the parents to take the kid outside for a bit.  We've definitely been in casual restaurants where one of our kids is just not in the mood to sit still, and one of us will take them out to run around in the grass around the parking lot while we wait for the food, kid(s) come back in to eat, and if need be the other parent will take them back outside when the kid(s) done so the other parent can eat.\n\nDoes it suck a bit?  Yeah, but that's what you have to do sometimes if the kids are just not in a position to sit still (usually happens when we've been traveling and they haven't been sleeping/napping on schedule, or otherwise their routine is off, so we think we're eating at a safe time, but instead it becomes Chaos-Time!)  That's just the responsibility you agree to as a parent!",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 180,
          "content": "Bold of you to assume OP would think about the child enough to crack the window.",
          "id": 154,
          "comments": [
            {
              "score": 14,
              "content": "OMG, dying at this comment.",
              "id": 155,
              "comments": [
                {
                  "score": 8,
                  "content": "Dying with you, omg I’m in bed laughing quietly to myself so I don’t wake any of my roommates up",
                  "id": 156,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Exactly, someone might hear him and then she’d be so embarrassed.",
              "id": 157,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 105,
          "content": "\"Working on that problem\" really got to me. A lot. \n\nHis child is not a problem. Taking him everywhere is not a problem. \n\nIt's fine not to like kids, it's not fine to put yourself in a position where you will have to parent them and love them when you can't stand them. Which she will have to do, if she marries this guy, whether she likes it or not.",
          "id": 158,
          "comments": [
            {
              "score": 7,
              "content": "Yeah I thought that he was going to be trying to bring a kid to a bar or something 21+. Instead, it was a restaurant that looked expensive. Do you think OP would be upset with being treated to a dinner at this place and a cake on her birthday? I doubt it. But apparently only adults can have nice things in OP's mind.",
              "id": 159,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 75,
          "content": "I think she wants the child in the trunk",
          "id": 160,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "\"That problem\"\nNo, op, YOU are the problem the child's father needs to work on - getting rid of.",
          "id": 161,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "I'm assuming she thinks any place that doesn't have a cartoon mascot or just a regular store is \"not for kids\" because she makes that whole thing seem he's taking the kid down to the bar with the boys Friday nights when it's probably the basic places single parents have to go and don't have someone to watch the kid while they go.",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": ">Sounds like if it were up to you, you’d leave him in the car and crack a window.\n\nShe'd obviously put him in a crate first, she's not some psycho",
          "id": 163,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7643,
      "content": "Info:\n\n>I was stunned I almost drop my plate.\n\nWhy were you holding a plate aloft? It's the small details that always make me question the veracity of a story.",
      "id": 164,
      "comments": [
        {
          "score": 1540,
          "content": "I thought this too. Why would you hold your plate above the table at a restaurant",
          "id": 165,
          "comments": [
            {
              "score": 976,
              "content": "Watch it be a buffet.\nThat’s all I could think.",
              "id": 166,
              "comments": [
                {
                  "score": 993,
                  "content": "A really fancy buffet, where Happy Birthday would be out of place? I can't see it!",
                  "id": 167,
                  "comments": [
                    {
                      "score": 341,
                      "content": "Right? I mean i can’t imagine this fancy restaurant with everyone holding their plates above the table. OP, I feel like i need a description of this place. what are we having here? what makes it so posh that joyous singing for 15 seconds is mortifying?",
                      "id": 168,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 187,
                      "content": "Golden Corral! It's got \"golden\" right in the name, so of course it's fancy!",
                      "id": 169,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 4,
                      "content": "They were celebrating the birthday at a well known adult centric location - Golden Corral.",
                      "id": 170,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 54,
                  "content": "But why would they be in line at the buffet during the cake celebration?",
                  "id": 171,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Maybe she spins plates while she sits at the table? Sure sounds like a clown from the way she behaves",
                  "id": 172,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "There’s Brazilian restaurants that have salad bars in addition to the rotation of meat.",
                  "id": 173,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Maybe the OP was doing a plate spinning show for entertainment.",
              "id": 174,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1029,
          "content": "See also lines like \"I froze in my seat looking stunned and a little angry.\"\n\nWhen it's a story that you are telling as something that involved you, you don't describe yourself as *looking* angry/stunned (as if you're on the outside looking in, unless maybe you looked in a mirror at that exact second), you describe yourself *being* angry/stunned.",
          "id": 175,
          "comments": [
            {
              "score": 717,
              "content": "Maybe she caught her reflection in the plate as she nearly dropped it?",
              "id": 176,
              "comments": [
                {
                  "score": 94,
                  "content": "💀💀💀",
                  "id": 177,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "This is the only correct answer.",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 212,
              "content": "Maybe this is all a plot for a story OP is writing and wants to know how the readers would feel and to see if it's a good addition to their book.",
              "id": 179,
              "comments": [
                {
                  "score": 114,
                  "content": "[deleted]",
                  "id": 180,
                  "comments": [
                    {
                      "score": 39,
                      "content": "[deleted]",
                      "id": 181,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "It's very poorly written and not believable. I give it a D-. Would not buy this book.",
                  "id": 182,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 38,
              "content": "I also find with stories like this that they give away too many hints revealing that nobody other than the designed-to-be-unreasonable OP was bothered by the situation. If this was real, OP wouldn't be telling us that they expected others to speak up but that no-one did - or the \"one woman did come forward... but only to offer to film!!\" which is so knowing it might as well be accompanied by a wink. A real unreasonable person would genuinely think everyone else there was embarassed as well, and you would get that described completely uncritically.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Damn nice catch.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "I think she was saying it was \"SO\" obvious that she was angry that anyone could see it. She was mad at him for not noticing and even commented on that.\n\nThe whole thing is bizarre. I've heard of people being embarrassed about their own birthday song...but to be embarrassed about a 5 year olds birthday? Sheesh.",
              "id": 185,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 465,
          "content": "Yes, that little detail made me 99% sure that this is merely a rage bait creative writing activity (particularly the details with the sick mother, the wanting to cheer the son up with happy birthday to make the father sound more sympathetic, “working on” the fact the boyfriend is taking a 5 year old everywhere, and the fact they didn’t really attempt to justify their POV). \n\nSometimes the YTA posts get more attention, clicks, awards and karma than the very clear NTA ones.",
          "id": 186,
          "comments": [
            {
              "score": 158,
              "content": "Sometimes I swear this sub is flooded with fictional stories designed to crowdsource an approximation of human morality for AI.",
              "id": 187,
              "comments": [
                {
                  "score": 12,
                  "content": "God help us all if any AI morality algorithms are based on this sub.",
                  "id": 188,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "I agree with you entirely, and I’ll still eat it up cuz this bs is my tabloids. Cheap, mindless, fictional drama",
                  "id": 189,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 56,
              "content": "This sub honestly is beyond insane with fake stories. I saw a 4chan campaign a few months ago encouraging people to make fake stories in this sub so its likely a combo of that and karma farmers.",
              "id": 190,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 166,
          "content": "Maybe she meant her jaw dropped and her upper plate of dentures almost fell out! (heh)",
          "id": 191,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "She was probably licking it like a toddler since she has a tendency to act like one.",
          "id": 192,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 31,
          "content": "This, plus the, “we’re working on that problem” thing about bringing a 5 year old everywhere make me think this is fiction. Too evil to be real.",
          "id": 193,
          "comments": [
            {
              "score": 8,
              "content": "Yeah deliberately meant to provoke",
              "id": 194,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Also, \"I froze in my seat looking stunned and a little angry.\"\n\nHow does she know that she looked stunned and a little angry?\n\nDid she go back and review the security tapes to see the look on her face? Has she been practicing her \"stunned and a little angry\" face in front of the mirror for years, just waiting for an opportunity like this? Is she a professional actress, fully in control of all her facial movements, and if so, was the stunned and a little angry face just an act? Or, for some reason does this restaurant, unlike every other restaurant, have a giant mirror in front of the customers, so people can watch themselves eating?\n\nIt's another small detail that brings the veracity of this story into question.",
          "id": 195,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "[removed]",
          "id": 196,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "Obviously, they were holding it up so that someone would put a piece of CAKE on it.",
          "id": 197,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "This has to be fake. The bit about the cake being a surprise. ..I admit, I haven't been to many fancy restaurants, but I doubt they serve whole ass birthday cakes that a 5 year old would want. And if they brought a cake with them, how do you not notice that? \n\nAgain, this has to be a fake story to get people riled up.",
          "id": 198,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3047,
      "content": "**YTA**\n\nThe kid is only 5, but you're the one acting like a child. It's natural that his dad wants to celebrate with him. Who cares if someone hears him sing? You should be grateful that you have a BF who makes it clear that he loves and wants to celebrate with his little boy.\n\nAre you ready to be with someone who has a child? Are you willing to share your BF's time, focus, and attention with his son? Because the son should be his priority.",
      "id": 199,
      "comments": [
        {
          "score": 252,
          "content": "Agree. How desperately insecure have you got to be to get embarrassed by a dad celebrating his little boy's birthday?\n\nOP, there are shitloads of deadbeat dads out there who want nothing to do with their kids, perhaps one of those would suit you better.\n\nYTA. So much.",
          "id": 200,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2812,
      "content": "> my future stepson \n\nBold of you to assume you’re still getting married \n\nYTA",
      "id": 201,
      "comments": [
        {
          "score": 424,
          "content": "Oh, I can guarantee that won't be happening with her attitude. The fiancé now sees what she's really like and won't want anyone like her around his son.\n\nHer language about him speaks volumes. Apparently, he's 'a problem'.",
          "id": 202,
          "comments": [
            {
              "score": 120,
              "content": "Especially after going quiet on her. Sounds like he’s ghosting her lol \n\nYta",
              "id": 203,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "I mean ... They've been together for a year and a half, they're currently \"working onthe issue\" of him surrending too much time with his son, and he sees no red flags. He's so blind to them he asked her to marry him. I don't have as much faith in this dad as you.",
              "id": 204,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 15,
              "content": "How dare he *checks notes* sings his son happy birthday in public and tries to be a good father! The audacity!",
              "id": 205,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 72,
          "content": "Ex future step son at this point hopefully",
          "id": 206,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Saying the thing we’re all thinking.",
          "id": 207,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2272,
      "content": "Unless the restaurant stepped in and said something... I'm going to say YTA.\n\nEven at upscale restaurants, I've seen people sing happy birthday plenty of times.  The only thing that seems odd about this situation is that you did not join in singing.",
      "id": 208,
      "comments": [
        {
          "score": 613,
          "content": "[deleted]",
          "id": 209,
          "comments": [
            {
              "score": 79,
              "content": "Totally agree!",
              "id": 210,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "My 65yo FIL always brings us to a nice restaurant for all the kids birthdays, and always sings Happy Birthday with help from the staff, and has them take a table picture. It is ridiculously common",
              "id": 211,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "You’re absolutely right. I never had so many birthday celebrations until I started working in fine dining. There’s a tag in the reservation notes for it. We put a card on the table and bring a free dessert with a sparkler. People freaking love it- kids and adults alike. 99% of the time the tables around love it. We as a staff don’t sing but plenty of the tables do and others join in. If there’s a kid at a table not celebrating anything but they see a sparkler on another table and get excited, we’ll bring one out to their table just to make them happy. Life is hard enough. Let people be freaking happy and enjoy a birthday, especially a kid. YTA.",
              "id": 212,
              "comments": [
                {
                  "score": 7,
                  "content": "[deleted]",
                  "id": 213,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Not at an upscale for a 5 year old but then again op could be talking about an olive garden or red lobster lol\n\nEdit: Either way upscale restaurant or not  just because staff doesn't do HBD's doesn't mean singing it to your child when you ordered a cake is wrong at all. Maybe he could have told her hey I also ordered cake to sing HBD so it wasn't so shocking or surprising to her but either way he's NTA",
              "id": 214,
              "comments": [
                {
                  "score": 14,
                  "content": "I’d imagine if kids weren’t allowed, though, the restaurant would have listed that. I was at a nicer restaurant a few weeks ago that banned kids during dinner (along with limiting photography for the privacy and peace of other patrons). Though, even then, two tables celebrated birthdays and everyone was happy to wish them happiness. \n\nI think OP is overthinking it.",
                  "id": 215,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 373,
          "content": "OP says they “ordered food then got the birthday cake”.  So presumably, as is normal, the restaurant waitstaff knew ahead of time, brought the cake out, and plated it and so forth.\n\nThe only version of this that might be a problem for a restaurant is if you don’t give them a heads up and suddenly pull a cake out of a duffel bag.",
          "id": 216,
          "comments": [
            {
              "score": 74,
              "content": "My dad did this to me once. I told him to never do that again 😂",
              "id": 217,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 37,
              "content": "My family has a restaurant that we go to for a lot of celebrations. They usually give us an area that we can put presents and dessert on. We leave some dessert for them as well. We've been going there forever. It's a really nice place. \n\nMy grandmom would call to make a reservation and they would say \"Hello Grandmom!\" They even gave her a bottle of the plum wine she always gets there for mother's day during the pandemic. They put it in the box with the rest of the carryout.",
              "id": 218,
              "comments": [
                {
                  "score": 7,
                  "content": "That's so sweet!",
                  "id": 219,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Exactly. They knew a song was coming.",
              "id": 220,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 101,
          "content": "Pretty much if you bought a cake singing hbd is expected if not by the waiters then your dining party. Methinks you need someone childless atm if you’re this easily embarrassed. YTA use this forum as an eye opener to analyze your discomfort.",
          "id": 221,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 93,
          "content": "But its SO EMBARRASSING that the 5 year old got more attention than her!",
          "id": 222,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "I’ve been at super fancy restaurants and seen people sing happy birthday. It’s not a big deal! And especially if the kid’s mom is sick… let him have a good, silly time with his dad on his birthday. Jeez louise",
          "id": 223,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1287,
      "content": "You sound insufferable.",
      "id": 224,
      "comments": [
        {
          "score": 164,
          "content": "OP probably: \"I was just looking forward to clubbing a sack of baby seals while I crossed names off my revenge list later. That caring loving bastard had the gall to patent his child...\"",
          "id": 225,
          "comments": [
            {
              "score": 15,
              "content": "I'm enjoying the idea of patenting a child. You'd make some good money! Of course, you'd have to patent a slightly modified child \\~20 years later to continue the cash flow. Maybe add a finger or two.",
              "id": 226,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 56,
          "content": "THIIIIIIIS",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Imagine how many birthdays she would ruin while working as a waiter",
          "id": 228,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "I can’t believe she typed this whole story out without thinking every step of the way that she is a huge asshole and cares more about what others think of her.",
          "id": 229,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "I’m keen to know what the places that she seems “aren’t child friendly” are. I’m betting they are, they’re just places she doesn’t want kids to be",
          "id": 230,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1285,
      "content": "YTA.  If it had actually been an issue, the staff would have intervened.  They didn’t.  Given that the only actual response you got from *anyone* was unequivocally supportive, I think you’re *wildly* projecting your own embarrassment at having attention called to you in public, and you need to acknowledge that as your problem instead of taking it out on your partner.",
      "id": 231,
      "comments": [
        {
          "score": 378,
          "content": "Yup. \n\nOP, it's fine if you're not comfortable drawing attention in public -- but if that's the case, when your fiance asks you what's wrong, you say \"Sorry I get very uncomfortable with that kind of attention in a public place, but don't worry I'll be okay, I'm glad \\[son\\] had a good birthday.\" \n\nOr you talk to your fiance later and say \"Sorry I know this is my issue, but I'm so uncomfortable with that sort of thing, would you mind letting me know in advance when you plan to do something like that so I can prepare myself\" or something along those lines. \n\nBut based on this and some of your other comments in the post, it sounds like you might not have an accurate concept of what is normal/acceptable childhood behavior to begin with.",
          "id": 232,
          "comments": [
            {
              "score": 12,
              "content": "That's a reasonable way to handle it. Not \"thanks for finally noticing\" like a bratty teen.",
              "id": 233,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "100% this.   ^^^\n\nOP, You and your fiance need to communicate. Plans should be made in advance and agreed upon. If you have social anxiety, that could have been taken into account by the person you plan to spend the rest of your life with, but only if you talk about it. Go to marriage counseling before tying the knot. \n\nAs far as the negativity around his child, you need to realize you will, and should, come second to the kid. I fear that if the two of you have children together, there will be a lot more AITA posts coming from you about how you treat his child compared to your child together. The kid is part of the package deal if you marry this person. \n\nOP YTA. You need to mature a bit more, and for heaven's sake, communicate!",
              "id": 234,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 50,
          "content": "And also, even if it was a disturbance and someone was actually annoyed, then SO WHAT??\n\nRestaurants are open to the public and singing the happy birthday song to a child takes no more than one or two minutes! I could maaaaybe understand OP’s discomfort if he threw his son an actual party there, brought balloons and was actually disruptive but he didn’t. He sang ONE SONG, a short one, to celebrate his child and probably making this little boy’s day while he’s away from his mom. The horror.",
          "id": 235,
          "comments": [
            {
              "score": 19,
              "content": "His mom who is also sick enough to where the little boy can't see her as often. Understandably the kid is bummed so taking him somewhere nice and being silly to cheer him up makes sense.",
              "id": 236,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I think she's jealous of the attention the kid is getting. Seems like that kind of person.",
          "id": 237,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 782,
      "content": "YTA \n\nYou clearly have a problem with the child - \n\nhe takes him every where he goes ??? On his custody days he would want to spend as much time as possible with his son as possible- if you are not comfortable with it then you need to seriously rethink your  involvement with a father of a child\n\nAs for getting upset with your bf singing happy birthday in a restaurant to his child - that did not even stop him from singing … YTA a million times over",
      "id": 238,
      "comments": [
        {
          "score": 246,
          "content": "Also he’s 5. He kinda has to take him everywhere he goes, you can’t leave a 5 year old alone!\n\nYTA OP",
          "id": 239,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 30,
          "content": "The childs mother is sick too thats why he has the child more often. A very nice birthday at a restaurant is probably to help the child feel better too due to the mother being sick. Like can you imagine its already confusing enough that parents aren't together, mom is sick and dad has a GF.",
          "id": 240,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "‘he takes him everywhere he gos’ has got to be the weirdest comment I’ve ever seen a step parent figure write.",
          "id": 241,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    }
  ]
}