{
  "post content": "\n\nHi. This a minor conflict that me f31 and my boyfriend m33 had this week. We've been together for 9 months. He's a pediatrician and I have a job at an elementry school. He's sweet and makes me feel happy whenever we're togetger.\n\nHe was missing me lately and been wanting me to visit and he was too busy so I only got the chance to visit yesterday.\nWe sat down in the living room in his apartment and he was about to make some coffee when the door rang 13 minutes after I arrived. He went to take a look through the hole then returned and asked me to get up and follow him to the kitchen. I asked why but he didn't say. He had me enter the kitchen and said his 2 friends who are his work colleagues (doctors) came to visit and he wanted me to sit tight for few minutes til they leave. I was confused I asked why not let me just meet them and he said no not like this and asked me to not come out the kitchen til they leave then went to welcome them.\n\n\nI sat still waiting as the time passed. They stayed for an hour and I started calling Donnie but he didn't answer me. I felt uncomfortable and couldn't wait anymore after I was ignored like that. I just took my purse and walked out the kitchen and told Donnie that I got bored of waiting for his friends to leave then said I was leaving and walked through the door immediately feeling upset.\n\nHe was stunned and so were his friends. He called me later saying what I did was disrespectful and rude. He said he asked me this one favor and I didn't do it. I replied that I left because of the treatment I recieved nomatter how much he tells me to make myself at home I was still a guest and I was made to feel like I was less than his doctor friends but he swore it wasn't like that and that he considers himself lucky to have known me but still said what I did was not cool and leaving like that and saying what I said infront of his friends was wrong of me.\n\nI'm adding more information to make few things clear.\n\nEdit1 I already met his family and other people but none of them is in the same field he's in. We also meet publicly\n\nEdit2: He claimed that they were talking about stuff I wouldn't understand and I'd feel awkward sitting there not knowing what they were talking about.\n\nEdit3: he said I should've made myself busy making dinner in the kitchen instead of waiting til his friends leave since we agreed to eat dinner together but I ruined our plans.",
  "id": 1,
  "comments": [
    {
      "score": 30130,
      "content": "He’s either ashamed of you or he’s got a  girlfriend at work. This isn’t a minor issue it’s a deal breaker. I hope he’s your ex now. NTA",
      "id": 2,
      "comments": [
        {
          "score": 9083,
          "content": "NTA. He is waving all the red flags and you’d be stupid to ignore them.",
          "id": 3,
          "comments": [
            {
              "score": 7526,
              "content": "And that edit, she was supposed to be making him dinner too while hiding out of sight?   \n WTF!!  Anybody with an ounce of pride in themselves needs to dump that AH!",
              "id": 4,
              "comments": [
                {
                  "score": 2562,
                  "content": "And he didn’t even say anything about dinner when he was hiding her away. He made it sound like they'd be gone soon. Is she supposed to be psychic? And what if the coworkers heard her working in the kitchen and started smelling delicious food? Wouldn't that make them curious about who's in there? Oh, is the dinner for us too? Turns out she only made enough for two - now he's mad she didn't psychically know to make enough for 4!!\n\nShe can't win in this situation. He didn't want her heard or seen, and he's trying to cover by blaming her for not starting dinner. What an ass.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 953,
                      "content": "C'mon, she's a **woman** in a **kitchen**, what else was she supposed to do? /s",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 880,
                      "content": "Dinner for 3; OP is \"the help\".",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 576,
                  "content": "Is it 1952????\n\nEdit - Cause sometimes quips sound better in my head and don't translate well to text ... I was responding to the post above me to say ... Right?? Like is it 1952??",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 461,
                  "content": "…and SILENTLY making him dinner at that. Because it would be weird AF if his friends hear noise from the kitchen when she’s meant to be hiding in there 😳",
                  "id": 9,
                  "comments": [
                    {
                      "score": 99,
                      "content": "Oh I'm sure he would've just said she was his maid/chef or something.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 387,
                  "content": "Did he basically say get in the kitchen and make me a sandwich? O.o",
                  "id": 11,
                  "comments": [
                    {
                      "score": 19,
                      "content": "I hope OP has a higher bar than that, for her sake.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "He forgot sudo",
                      "id": 13,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 6,
                      "content": " But he said it politely.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 332,
                  "content": "I came here to point out the fact that he expected her to “busy herself” in service of him while he “talked about things she wouldn’t understand” with a bunch of doctors. That’s stepping way out of line. The audacity is through the ceiling & I hope she doesn’t come back to his kitchen again.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Display of arrogance and self-absorption. He and his friends are too \"smart\" to have to put up with OP while they visit. I know a lot of doctors like this. Have sued a few.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "The \\*only\\* way this makes sense is if they were talking about a patient, and confidentiality would have been broken if there was someone not involved in their care in the room.  AND, that would have had to be said beforehand, AND, OP should have been introduced, and then informed that there was business to discuss that she couldn't be present for, legally.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 76,
                  "content": "This!!! AND he said they were talking about things she wouldn’t understand, so he doesn’t think she’s intelligent or can keep up with their conversation sounds like BS and hope he’s a big fat EX!",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Worse yet, she ruined HIS plans by not making dinner.  She needs to get out of this relationship.",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "That edit had my jaw dropping. Excuse me, ***what???*** It's not her house, she shouldn't be making *anything,* and it's *his* fault their dinner plans were ruined because he couldn't tell his friends he had plans already. Any \"man\" who tried to pull that shit with me would never hear from me again.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "And what? Scrub the toilet, mop the floors, iron his clothes? What a weenie! NTA",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "But don't women just naturally start cooking when they're left in the kitchen for a while? /s\n\nHonestly, this thing just got worse with every single edit.",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1601,
              "content": "\"You should've made yourself busy by preparing dinner\"\n\nDude, wtf",
              "id": 23,
              "comments": [
                {
                  "score": 502,
                  "content": "Friends: \"What's that noise?\" Op's ex: \"Oh, it's the maid making us dinner\" 😂",
                  "id": 24,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Bangmaid*",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "That’s what I thought!  He would have probably told them it was the maid or something…",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 266,
                  "content": "[deleted]",
                  "id": 27,
                  "comments": [
                    {
                      "score": 168,
                      "content": "Yeah, I'd throw the whole jerk-face out and find someone who isn't embarrassed by me",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "No no. Just him and his guests. She can eat later. Maybe.",
                      "id": 29,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 216,
                  "content": "This line makes him sound like the classic douche “go to the kitchen and make me a sandwich”",
                  "id": 30,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 107,
                  "content": "Basically told her to shut up and make him a sandwich",
                  "id": 31,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Start by slicing him very very thin.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "Seriously my eyes were nearly popping out of my head with that line.",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "That was exactly what I said out loud when I read that edit 😄",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Wouldn’t the friends hear her making dinner and be like excuse me who is that? This is such a stupid thing for him to say.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I bet he would also want her to make as little sound as possible as to not \"disturb my friends\"",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Just be super loud dropping pans, banging pots, etc. Then cook something highly aromatic like garlic. You wanna play games doc? seriously.\n\nNTA",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 182,
              "content": "Doesn’t seem like op will take them seriously",
              "id": 38,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "🚩 #1. Oh no my work friends are here hide in the kitchen \n\n🚩 #2. An hour later they're still here and ive not checked on you once \n\n🚩 #3. We'll be talking about things 'you wont understand' i dont want you to be uncomfortable \n\n🚩 #4. 'You should've just made dinner' \n\nThis man is juggling red flags and shes calling it a circus",
              "id": 39,
              "comments": [
                {
                  "score": 8,
                  "content": "If she wants to be naive that’s fine but don’t look anyone in the eye after and say you had no clue",
                  "id": 40,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "He’s the Red Flag color guard in the Macy’s Thanksgiving Parade.",
              "id": 41,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Just … NO. A hard AF, “No!” Oh, and yeah, NTA.",
              "id": 42,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "[deleted]",
              "id": 43,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3559,
          "content": "100% he has a work girlfriend.  I hope news of this got back to her.",
          "id": 44,
          "comments": [
            {
              "score": 1062,
              "content": "Even if he doesn't, the only valid reason for something like that would be if they had to talk about something medically confidential.....and seeing as I doubt that was the case, best case scenario is that he's embarased of her for some reason......and that's still a dealbreaker.",
              "id": 45,
              "comments": [
                {
                  "score": 1253,
                  "content": "Medical people are used to this, and we just don’t talk in front of other people or we do it without identifying information. This guy is a douche and he’s getting some action at work. OP is better off moving on.",
                  "id": 46,
                  "comments": [
                    {
                      "score": 570,
                      "content": "Yeah my mom and her best friend are nurses in the same department; they would just…not talk about patients in mixed company. I’ve hung out with them loads of times together; they just don’t discuss patients by name or identifying details. \n\nWhatever shady thing is going on, here, it’s really, really not “misguided attempt at patient confidentiality”. Anyone who suggests that’s the case is reaching so hard down into the barrel of “benefit of the doubt” that they’re getting untreated splinters.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "NTA. He either has a girl at work, OR he's ashamed of OP for some reason, OR (at best) he's some manipulative control freak. One of these is absolutely 100% true, and whichever one it is does not matter. OP, leave him.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "And even on top of that, you would still give your SO a heads up, introduce them, and then say “alright we’re going to head over to X area of the house and talk about work.” You don’t lure someone into the kitchen and tell them to wait, oh and expect an impromptu meal. What a weirdo! The whole thing is shady. \n\nI can’t think of a single valid reason to behave that way.",
                      "id": 49,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Teachers and staff who work with children are the same, you never identify them by name or age to people outside of the school, I tend to use pseudo names like Angry kid if the story involves more than one kid.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "As a doctor, I can tell you there is nothing confidential that requires a spontaneous 1 hour conversation - usually it’s summed up in a few quick sentences and an opinion asked for, maybe a few follow up questions and answers.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Plus the fact that it happened at his apartment and not the clinic/hospital is a pretty solid giveaway that its probably not medically related.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "Or if there was something personal and private going on in one of his guests lives that OP didn't have a right, or need, to know.   But if that was the case then he needed to have let her know that and should have kept the conversation short. Instead he hid her way like some shameful secret. That's not ok.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Well he did say \" no not like that \" when she wanted to meet them. Soooo yeah",
                  "id": 54,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "That’s what I’d think, but he secretly hid her away before letting them in. Which is just…weird.\n\nLike, if there was something confidential or whatever they needed to discuss, letting them in, introducing her, and then asking her to step out of the room for a few minutes would at least make a bit more sense/be less weird.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Seems telling his coworkers were shocked when she came out of the kitchen .",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "NTA  Dude's a typical player. 100% he has one at work, also somebody at the cafe, another a few towns over, all thinking they're his girlfriend and not just another piece of ass. I've known quite a few of these boys. Accidentally married one, in fact. \"Run\" is my advice.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "I said this in another comment but he’s possibly in BIG trouble at work for whatever reason.  Like lawsuit/firing offense.  Or he’s lying completely about his job.",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "This is how the “work girlfriend” and I found out about each other.  I called him at work.  His office mate answered the phone.  He asked me to leave my number and I just said to tell him to call back his girlfriend.  Whoosh!  ALL of the office knew almost immediately.  She and I got in contact to compare notes and both broke up with him.",
              "id": 59,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Or trying to get with someone. I knew someone like this and he conventionally had called his girlfriend his \"friend.\"",
              "id": 60,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1765,
          "content": "Exactly this. NTA. All I could think is that she's the main gf since she has met his family and he has a side piece at work and doesn't want his coworkers to know hes cheating. This is NOT minor.",
          "id": 61,
          "comments": [
            {
              "score": 368,
              "content": "Right!!   No matter what, jobs are like high school.  It’s going to get around quick, drama will ensue, and op just needs to remove herself right now. \nNTA",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 281,
              "content": "My guess- His sidepiece is married and ranked higher than him. If she finds out he has a gf, she will be pissed and take it out on him professionally \n\nDamn! His mistress is controlling, just like him!",
              "id": 63,
              "comments": [
                {
                  "score": 15,
                  "content": "One vagina policy from a domly domme?",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Please go outside. Life isn't some stupid episode of Grey's Anatomy.",
                  "id": 65,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 123,
              "content": "He could be in the closet to his family but is out at work. No matter how you slice it there is no excuse. NTA 100%",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "I thought about this - but I showed my bf the thread and he said “what if he’s embarrassed that he’s not dating a doctor and all his doctor friends are” so there’s that angle too.",
              "id": 67,
              "comments": [
                {
                  "score": 9,
                  "content": "I wondered that too.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1513,
          "content": "if hiding her away like some shameful secret wasn’t enough of a deal breaker on its own, him suggesting she should have just played housewife and COOKED HIM DINNER while he’s busy pretending like she doesn’t even exist is enough to dump this man on his sorry ass this very second and never speak to him again. \n\nhe doesn’t respect you, OP. at all. you deserve better.",
          "id": 69,
          "comments": [
            {
              "score": 752,
              "content": "I was going to comment the same thing! There is NEVER a good explanation for why she would \"need\" to hide in the kitchen when his work buddies are there, or anyone else, for that matter.\n\nBut, not only is he too chickenshit to have her meet his friends, COOK ME DINNER WHILE I'M DISRESPECTING YOU?! WTF?\n\nGirl, move on. He's an ass and not even worth 2 seconds of your time.",
              "id": 70,
              "comments": [
                {
                  "score": 185,
                  "content": "I could see it if they were going to talk about stuff covered under HIPAA, maybe. But even then, a quick \"hey, this is my gf, gf this is such and such from work. They want to talk about a patient, do you think we could have some privacy for a few minutes? I'm so sorry,\" would have worked. Something fishy is going one here. \n\nNTA, op.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 69,
                      "content": "and it would be a few minutes only, probably over the phone, and he wouldn't mention any identifying details. like why the hell didn't he tell his buds it was great to see them but please come back another time???",
                      "id": 72,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "She should've started using pots and pans like a marching band in the kitchen to prove a point. That would've resolved the issue of meeting his colleagues real quick. He may be a doctor but he's also a loser.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 258,
              "content": "Yeah, I was thinking as I read, \"there had damned well better be a very good reason behind this\" and then I got to the dinner part and said, \"nope, nope, nope, no reason is going to be good enough to cover this level of disrespect.\"",
              "id": 74,
              "comments": [
                {
                  "score": 151,
                  "content": "genuinely think this post raised my blood pressure from the amount of pure, unadulterated rage it awakened inside of me. i’d literally rather die than let any man disrespect me like this.",
                  "id": 75,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Absolute same. Preach, sister.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "BRB, gotta go take my blood pressure meds a little early....",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Good news at least, OP's only been with the guy for 9 months. She definitely got the warning flags given to her before she would have had a chance to get too terribly invested in the relationship.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Yeah, I pretty much lost interest in any reason he might have had before that point.\n\nThere are, theoretically, reasons someone might want to ask one's partner to leave so that one might discuss some important matter with some colleagues.  Something on the level of \"they have uncovered a dastardly plot\" important.\n\nBut anyone with an ounce of respect for said partner would immediately provide that reason, or at least an apology that a reason could not be given.  There would be a, \"Hang on guys, OP's in the kitchen and I told her we'd only be a  few minutes.\"   \n There would be a recognition that *this was a really weird thing that just happened and it requires an explanation.*\n\nSTBX BF didn't even seem to think OP was owed any explanation at all.\n\nThe, \"You wouldn't have understood.\" and, \"Why didn't you just cook dinner, sweetie?\" were pretty much redundant by then.\n\nAt this point, given the I'd say that the *best* case scenario is that the boyfriend is embarrassed by OP on some level.\n\nNTA.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "The only potential reason I could come up with is if he and his colleagues were going to talk about medical cases at their practice and couldn't have her in the conversation.  But for that, he should have given his apologies and told her to head home.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 81,
              "content": "And like, how would that even work anyway? The friends aren't going to hear someone banging around in the kitchen and wonder who else is home? Maybe doctor = huge house where the kitchen is really far from the living room",
              "id": 81,
              "comments": [
                {
                  "score": 16,
                  "content": "Or he would’ve played it off like he has a housekeeper/cook.",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "this part honestly made me think he doesn't even think of her as a person, with thoughts and feelings of her own. especially the part where she was just supposed to *stay* there the *whole time* and she *wasn't even 'allowed' to leave.* like wtf? you can't just stuff an entire human being in a closet (or a kitchen) when visitors come around like you might with sex toys or a porn collection or whatever. she's a *person.* only the bf doesn't seem to have gotten that memo. he thinks she exists to serve his pleasure, whether or in bed or in the kitchen. like wtf? she comes to visit expecting to spend time with him and gets stuffed in the kitchen, and he expects her to not only be completely fine with this, but *start working on dinner* while she's in there?! I just don't even have words for how disrespectful that is. he just wants a little Stepford wife he can treat however he wants and never get anything but perfect, smiling obedience.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Pots and pans and running water and oven buttons and microwaves *all make noise* how did he expect her to not be heard while making his dumb ass food? I hope she dumped him right in the biohazard trash where he belongs with the MEDICAL WASTE.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 596,
          "content": "Nta.  This is also what i think.  He's only nice and caring to you when it benefits him.",
          "id": 85,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 376,
          "content": "That was my first thought he probably already had a relationship",
          "id": 86,
          "comments": [
            {
              "score": 455,
              "content": "My first thought. He’s not actually a doctor. Maybe something else like a nurse or simply a different job. I’ve heard of people saying they’re doctors or lawyers to impress dates.",
              "id": 87,
              "comments": [
                {
                  "score": 189,
                  "content": "I remember a case where a man killed his wife and little kids when his lies about being a doctor were uncovered.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 145,
                      "content": "Oh there are a few crime cases like that. There was one where the son arranged to have his whole family killed rather than admitting he didn't graduate. The parents took the whole family out to dinner as a pre-celebration of his graduation, and when they got home, a hired killer was waiting for them all. The son \"miraculously\" did not get injured, and the father survived, despite horrific injuries, then had to sit through his son's trial, wondering what the hell had happened to his life.",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "The Jean Claude Romand case",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 174,
                  "content": "PSA — Physicians in the US have a very significant online footprint, including national databases. Google someone who claims to be a physician or check their name against the National Provider Index if they seem to be full of shit.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 71,
                      "content": "100%  \n\nIf OP sees this, they can look him up by first and last name [here](https://npiregistry.cms.hhs.gov/). It will sometimes show their credentials too (which would verify whether he's an MD vs PA or RN...etc).",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "This immediately brought “Dirty John” to mind for me.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Legit the premise of Dirty John !",
                  "id": 94,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 338,
          "content": "Or OP could be the side piece and not know it.\nEither way, huge red flags.  NTA",
          "id": 95,
          "comments": [
            {
              "score": 240,
              "content": "She has met his parents and other hospital work buddies.   This was just him being an ass.",
              "id": 96,
              "comments": [
                {
                  "score": 354,
                  "content": "I met my “mil” and “bil” and still I was the side piece…",
                  "id": 97,
                  "comments": [
                    {
                      "score": 199,
                      "content": "That happened to my friend once. She met the parents, friends, etc, dated six months. And then found out he was married with three kids. She noped out so fast.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "My dad brought his side piece home for the holidays, while telling her he and my mom were divorced. Not one of those assholes told my mom or the girlfriend about the other, even though they knew my dad was lying.",
                      "id": 99,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 289,
                  "content": "So in my case, I had like a year of \"seniority\" to the other woman. And as such, I'd already met some people in his life (but not others). There was some slight overlap in the sense that his neighbors saw both of us around at different times, but neither of us was approached (people minded their business, unfortunately). The ones I had not met was his boss and coworkers, and so she became the date that was taken to work functions. She felt like she was getting folded into his life, and where she was excluded (because I was present in those circles) he had excuses to tell her. Like he would have for me the couple of times I tried to tag along to some work picnic and such. I talked to her so I know. We both got the same lies and were kept in separate circles. \n\nWho is the main and who is the side piece doesn't matter. Both women are just unfortunate enough to know a man like that, and should leave him.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 180,
                  "content": "No, she said the other friends were not in the same field.\n\nHe 100% has a work gf.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 75,
                  "content": "Ahhh....that's right, she did say that.  It's just him being the ass then.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 89,
                      "content": "Its still disgusting.   I bet he is handsy with the nurse/medical assistant and he thought she would find out",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Just remember, they are HIS family, not hers. They are probably well aware and very used to his antics, if not his very role models. \n\nAlike attracts alike, it also breeds alike. I cash bet anybody whose parents know about their infidelity, one or the other (or both) led by example. \n\nToxic families gonna Toxic. Just like haters gonna hate. It's what *they do*.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 188,
          "content": "Most probably a work romance who can help get him ahead in his career, not someone that he wants to be with long term since he's already introduced OP to his family. What a jerk move.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 165,
          "content": "Been there. I have an ex whose family and neighbors I met, we went everywhere together...  except I never got to meet anyone from his work or go anywhere near his job. Ended up that he had another secret girlfriend for several months.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 117,
          "content": "This was my thought. He definitely is hiding something. He either thinks OP is too dumb to mingle with his doctor friends, and is embarrassed by her, OR he has a work girlfriend.",
          "id": 107,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6443,
      "content": "[deleted]",
      "id": 108,
      "comments": [
        {
          "score": 3675,
          "content": "Don’t forget that he also expected her to be in the kitchen, cooking for them, alone. He has zero respect for her.",
          "id": 109,
          "comments": [
            {
              "score": 1493,
              "content": "Yeah just stay in the kitchen out of sight and cook my dinner. Maid or girlfriend?",
              "id": 110,
              "comments": [
                {
                  "score": 753,
                  "content": "I wonder what he would have told his colleagues if they heard noise in the kitchen…I mean, was he going to say it was the cook? The maid? This guy is a mess.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 20,
                      "content": "good point!!",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 415,
                  "content": "Bangmaid is a term I've heard before.",
                  "id": 113,
                  "comments": [
                    {
                      "score": 88,
                      "content": "Ok. I've been on reddit ages. Never heard the term. Seen it three times in the last hour...",
                      "id": 114,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 171,
                  "content": "If I had a maid, I wouldn't treat her the way Dr. Dickhead treated OP",
                  "id": 115,
                  "comments": [
                    {
                      "score": 83,
                      "content": "All I can hear in my head is this on an intercom:\n\n\"Doctor Dickhead, to the Nurse's station. Paging Doctor Dickhead.\"",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "Or mom.  This guy sounds like a 10 year old who hates having his mom around when he has a playdate.",
                  "id": 117,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "As someone already said in a reply in the top comment, OP would be _bangmaid_",
                  "id": 118,
                  "comments": [
                    {
                      "score": 4,
                      "content": "That’s how I felt in my marriage. I was giving and he was taking. Well, I gave him the ol’ heave-ho! Being single is way better than a bad marriage.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 231,
              "content": "If he didn't want his friends to know she was there, how was he going to explain someone cooking in the kitchen? That makes no sense? Dinner's don't just cook themselves? Not all dinner's take an hour? What's she supposed to do 30minutes later when it's all done? Eat by herself and then him chide her for her letting it get cold for him?\n\nThis is just all around fucked up. There is absolutely NO GOOD explanation for why he stuffed her in the kitchen. None. Nada. Zip. Any reason he could give just translates to \"I think you are beneath me\" or \"I don't want the OTHER chick to find out\".\n\nDitch him.",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 85,
              "content": "Wouldn’t it also be bizarre if there were noises/smells coming from the kitchen? I guess maybe not if OP’s “bf” told his friends it was his other gf cooking……",
              "id": 121,
              "comments": [
                {
                  "score": 8,
                  "content": "\"my housekeeper is cooking dinner\" it'd kinda fit with his awful behavior.",
                  "id": 122,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 71,
              "content": ">Don’t forget that he also expected her to be in the kitchen, cooking for them, alone. He has zero respect for her.\n\nI guess his plan for if they noticed her was to pretend she was \"the help?\"",
              "id": 123,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "I have an awful feeling he only thought of that as a last minute save, so she would feel mortified that \"she\" was the one who ruined their romantic time together.\n\nHow was she even supposed to know what to cook for dinner? Who invites someone over for dinner and then \"there's the fridge, I'll be with my friends in the other room, but don't call me.\"",
              "id": 124,
              "comments": [
                {
                  "score": 26,
                  "content": "Exactly! He wasn’t expecting them to come over and panicked because, for some reason, his coworkers can’t know that OP is his girlfriend. Next, he blew up at her for “disobeying” him and blowing his cover. He feels entitled to having her serve him and do what he says. Now, he’s gaslighting her into thinking that any normal person would assume that they were supposed to cook dinner so he and OP could have a nice evening after his friends finally left.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I hope she listens to everyone here telling her to run because that is a glimpse at the rest of her life if she stays.  Her playing dutiful housewife while he gets his way in everything because he's a doctor, and respected, and she's just some silly teacher.",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "You know don’t let them know your here but make noise in the kitchen cooking.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 331,
          "content": "Or Option 3: he's not really a doctor. Maybe these were actual work friends from....the grocery store down the street? Idk.",
          "id": 128,
          "comments": [
            {
              "score": 36,
              "content": "Oooooh it's a twist!",
              "id": 129,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Oo I like this theory…because usually the nicest people go into pediatrics and this seems really out of character. It’s not a lot of money or glamor for medicine. I wonder if he told her he was a pediatrician because she’s a schoolteacher.",
              "id": 130,
              "comments": [
                {
                  "score": 15,
                  "content": "I like this theory too. By saying “you wouldn’t understand what we were talking about” he really meant “you don’t understand the pressures of stocking turkeys this time of year”",
                  "id": 131,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "There is an option #4. This brought back bad memories for me. I had a boyfriend who invited me over, who missed me terribly our evening started great and we ended up in the bedroom hot and heavy. Then there was a knock at the door. It was close to midnight so he was like, WTH who could be here this late and left me in bed, in the middle of having sex to see who it was and \"get rid of them and come right back to me.\" Well, two hours passed before he finally came back to bed. I found out later in the relationship that he was addicted to coke and it was one of his drug buddies bringing him some really good shit. I had no idea he was out in the living room doing lines of coke cause obviously that was more exciting than me.  I was very naive about drugs then I knew no one who had ever done anything but maybe a little pot. I dumped him when I found out but he had me fooled for a very long year.\n\nETA OP huge NTA. Major red flags dump his disrespectful ass. Its shady no matter what the reason!!",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 257,
          "content": "I got the vibe that he wanted her to meet his colleagues under more impressive circumstances. \n\nHe sounds like the type of person who's obsessively concerned with social status.",
          "id": 133,
          "comments": [
            {
              "score": 189,
              "content": "[deleted]",
              "id": 134,
              "comments": [
                {
                  "score": 130,
                  "content": "Assholes love to pull a Reverse Asshole and accuse their victims of whatever bullshit *they* actually did.\n\nIf there was an Asshole How-to Manual, this would be the number one rule!",
                  "id": 135,
                  "comments": [
                    {
                      "score": 18,
                      "content": ">Reverse Asshole \n\na prolapse, if you will",
                      "id": 136,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 9,
                      "content": "THIS, OP! Beware of how he tried to gaslight you.",
                      "id": 137,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Yep, classic DARVO.",
                      "id": 138,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "He won't be able to introduce OP now to work people once the gossip mill starts. \"Oh, is this the gf he was hiding in the kitchen until his colleagues left?\" And he will have brought it on himself.  \n\n\nOP deserves better than a cad like this.",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yeah exactly, I'd be surprised if OP didn't see him in a different light after a stunt like that.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 43,
              "content": "That is so *weird*, though! I would be totally weirded out if I was one of op's boyfriend's friends that came over and witnessed this.\n\nIt's really bizarre",
              "id": 141,
              "comments": [
                {
                  "score": 8,
                  "content": "the problem with people like this is that their friends never make them accountable to the behaviour, they all enable and no one cares for the other person dealing with assholes like that, some people think its funny...so the behaviour never changes...all she can do is leave the guy and dont give the jerk another chance.",
                  "id": 142,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "I think the way she walked out was pretty impressive. They won't forget her in a hurry.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 96,
          "content": "I can’t believe he told her she should have made dinner. Fuck that asshole.",
          "id": 144,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "It sounds like he’s embarrassed she isn’t a doctor. She’s met his family and friends *not in his field* but he wouldn’t let her meet his doctor friends. He must’ve lied about what she does (and is scared it’ll come out if she engages with them) or something. Sounds like he sucks and he’s rude af even if that’s not the case. Any decent human would do better than this. 😂",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 3,
          "content": "This situation is so weird. OP, can we get an update once the mystery is solved? \n\nSo much of this makes no sense. Why the kitchen instead of the bedroom, where you have a lower probability of being discovered? Couldn’t he get rid of them sooner? Is he friends with criminals on the lam? Did they split a winning lotto ticket? Are they planning a 19th century style revolution?",
          "id": 146,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 4087,
      "content": "NTA - that’s crazy sketchy and raises so many red flags.\n\nI immediately would think either they are doing something illegal, or your are probably the “other” woman that he doesn’t want them to know about. Either way, there is a zero percent chance that you hiding in the kitchen was innocent or nothing to worry about. He’s the one hiding something. \n\nGood on you for standing up for yourself.",
      "id": 147,
      "comments": [
        {
          "score": 2035,
          "content": "But he is already ok with me meeting his family (I met both his brother and sister) and we've met countless times in public as well. He's never made me feel like I was being hid before. Then this happened and it shook me.",
          "id": 148,
          "comments": [
            {
              "score": 3935,
              "content": "There’s a girl at his work then.",
              "id": 149,
              "comments": [
                {
                  "score": 762,
                  "content": "Not necessarily. Maybe he wanted OP to 'get to work' in the kitchen, and then impress his coworkers with his domesticated girl. Chick on the side at work might be a better out come?",
                  "id": 150,
                  "comments": [
                    {
                      "score": 393,
                      "content": "Disgusting, but entirely possible.",
                      "id": 151,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 135,
                      "content": "Well if he effectively communicated this, it would be a different story.",
                      "id": 152,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "but without meeting her first?  surprise!  here's dinner and a random woman in my house",
                      "id": 153,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 10,
                      "content": "If that were the case he’d have introduced her first. He was asking her to HIDE.",
                      "id": 154,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 5,
                      "content": "Nah, that does not make any sense because then he would have left the door open to the kitchen so they would actually be able to see her.  Most likely he either is ashamed of OP or he has a GF at work. Or the third, but much less likely, option is that these were not actually colleagues but some people he does some illegal stuff with.",
                      "id": 155,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 45,
                  "content": "Yeah that’s definitely what it seems like. Honestly tho the reason behind it doesn’t matter. It’s unacceptable treatment no matter what",
                  "id": 156,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "Or he goes out with his coworkers to pick up randoms and wants to keep that option open.",
                  "id": 157,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 2480,
              "content": "NTA All you need is the one time of him being an AH to end it. Shall we count the ways he disrespected you in this one post?\n- Misses you sooo much but can't be bothered to come to your place \n- Misses you sooo much but allows his coworkers to interrupt your limited time together \n- Hides you in his kitchen like he's ashamed or embarrassed by you. THIS REFLECTS ON HIM not you\n- Leaves you alone in the kitchen FOR AN HOUR \n- Ignores your calls even though you're you're putting up with his bs\n\nThe biggest one:\n- When you do leave instead of being ashamed of his behavior and apologizing like crazy he's twisted it around to the point you're wondering if you're the AH!!!\n\nYou deserve better. This man does not care for you, he doesn't respect you or your time. Level up and drop him",
              "id": 158,
              "comments": [
                {
                  "score": 910,
                  "content": "Don't forget edit 3! This \"man\" said she could have made dinner and has ruined the night!!!",
                  "id": 159,
                  "comments": [
                    {
                      "score": 504,
                      "content": "That his argument is she should've started making dinner SENDS ME with the utter audacity",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "AND the sexist, garbage excuse that *she* needed to stay out of sight because if she didn’t, *she* would feel awkward sitting there while they spoke in very advanced, smart-man-only, magical science tongues in front of her.\n\nPutting the blame on her in the guise of being considerate of what he says her feelings would be is another example of twisting things to blame her. Notice he didn’t even ask her if she’d want to meet them even if they talk about work stuff. Nope, he just made that decision for her. It’s like his doctor friends don’t speak English, only Magical Man Sciencese, so they couldn’t have possibly even said hello to her. He was just saving her from her own stupidity and womanness, and should be heralded as a saint, apparently. \n\nI feel bad for OP because it sounds like she’s stuck in a confusing place with someone who doesn’t behave like an ass 100% of the time (but who does? All abusive people have normal or even nice moments. If things were as black and white as we might wish, it would be a lot easier to see the truth and leave someone without feeling obligated to make a tally sheet). OP is trying to rationalize his behavior because it conflicts with times he hasn’t hidden her and gaslit her, and it’s so hard and painful to think that the nice person you thought you knew isn’t really that nice. \n\nThe shitty mistreatment is one thing. The gaslighting elevates this really shitty thing he did to another level entirely. He’s treating her like an object who exists to accommodate his needs, not a person.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Gaslighting to high hell....",
                      "id": 162,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "I came here to say this, you put it perfectly!!",
                  "id": 163,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Absolutely. He's gaslighting her and hopefully she recognizes that she needs to get out of the situation before he pulls out more emotionally belligerent tactics out.",
                  "id": 164,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "But thank God this is only a minor conflict!",
                  "id": 165,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "The reason why this comment is so good is its entirely full of reasons based on his behaviour.\n\nIt doesn't attempt to delve into the reasons why he kept OP waiting. Everyone's so fixated on him being embarassed or seeing someone else, like AITAs are a plot to solve (I'm guilty of the same, it's interesting to do), but the reality is its not so important for a verdict. Imagine OP is neither embarassed or cheating and there is some genuine reason even OPs partner being ill. No reason excuses his behaviour. He's still being an AH. An hour is still too long, etc. That is why I don't feel it matters so much.\n\nIt still doesn't make OP an AH and her partner still is lacking in consideration. Still expecting her to cook for him. Still doing all of these things mentioned above. \n\nThe reason doesn't really matter. His actions and consequences speak for themselves. The easiest way to recognise someone doesn't care about you is that they don't really think about how you feel.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "EXACTLY!!!! I do t have any coins but here are some awards! Lol 🥇🏆🎖🏆",
                  "id": 167,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 504,
              "content": "He's dating someone at the hospital",
              "id": 168,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 311,
              "content": "You've met his family but he won't let you meet his work friends? Also notice he didn't let you meet his parents or older generation of his family. This man is ashamed of you and is trying to dance around it.",
              "id": 169,
              "comments": [
                {
                  "score": 311,
                  "content": "I have been the Side Piece unknowingly until later and this is exactly how he treated me. We went out in public but not his usual haunts and always ended up in bed. And I met one friend but no one else. It sucks to be the last to know",
                  "id": 170,
                  "comments": [
                    {
                      "score": 6,
                      "content": "Same",
                      "id": 171,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 108,
                  "content": "Yep and you'd be surprised how many ppl are okay with helping a cheater. \n\nA friend's asshole brother asked me to pretend to be his sister to meet someone he was seeing bc my friend refused to do. Of course I refused but he eventually got someone else 🙄 \n\nEta: I forgot to include that their MOTHER was in on it too and helped the despicable squid by meeting his side piece. His mom was *\"best friends\"* with his fiancee!!!\n\nMoral of the story, ppl can be unbelievably evil and cruel",
                  "id": 172,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Despicable Squid that’s my new band name",
                      "id": 173,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "My ex brought the girl he was cheating with to his brother’s wedding. And apparently had been bringing her to hang out with them for a while. While we were still living together. So they clearly knew he was cheating.",
                      "id": 174,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Dear u/Rose-thorn6554. This is the worst case scenario. You're the FWB for now",
                      "id": 175,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 107,
              "content": "I met all my ex’s family many times, even went on holiday with them. I never met any of his work colleagues and was deliberately kept away from any scenario where that would happen. I’m pretty much 100% certain that was because he was sleeping with someone at work.",
              "id": 176,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 79,
              "content": "I know of girl that met the guys parents (which I would also take as a good sign of transparency normally) and his friends and they would all go out together - meanwhile he had another girl he was going to marry and everyone knew about it (his mom/friends) and not one of them told her… \n\nMy instinct is that he was hiding you exactly what you felt because he was ashamed of you, maybe since your job is not being a doctor - but what he did was awful and he is TA without a doubt! \n\nIf he was proud to have you on his arm and you had plans (which if a little more rare for you) when his friends came over he should have introduced you to them and vice versa (maybe he is afraid of getting judged but it’s inexcusable in any case) \n\nI kinda wish you had said in front of his friends- I’m sorry you wanted to me sit in the kitchen, while your friends were here, but I’m done and noped outta there (so they would have been clear it wasn’t you saying  don’t want to meet them and choosing to stay in the kitchen until they left - the way it’s worded in the post it could be interpreted that way) \n\nIf he doesn’t think you are worthy, in the same class as him, don’t have the same education/professional status, whatever the reason - you know all you need to know (and I hope will end it and find someone who values and cherishes you and is excited to show you off)",
              "id": 177,
              "comments": [
                {
                  "score": 9,
                  "content": "He sounds so condescending like she's not as smart so she can't be in the same room. \"u wouldn't understand\". How dare he?",
                  "id": 178,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 70,
              "content": "It doesn’t matter if it introduces you to family. \n\n1. If he does have a girlfriend they are not gonna snitch on him \n\n2. He could still have a girlfriend and they dunno about her\n\nJust break up with him huge red flags u r not too far into it cut your losses now before there’s more to lose",
              "id": 179,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 67,
              "content": "Bruv. The only way this is in any way acceptable is if he let's you meet them, but then says they need a quick 5 minutes to chat about some patient stuff at work they cannot disclose, even then it'd likely have to he someone you know. Not entirely sure how HIPAA works but they take it seriously. That said, it should be quick and done. You arent Harry Potter to be shoved under the stairs whenever it's convenient for this asshole...\n\nIn this case hes just an asshole and is hiding you from them because he's either ashamed of you, or he has a side piece they know but you don't, which he is passing off as his GF.\n\n>he considers himself lucky to have known me but \n\nIs this lost in translation? Or did he actually say know/known? Who says I'm lucky to know my girlfriend? That sounds like something I'd say to a coworker after I quit to go to a new job, zero affection. LOL. Ditch this cretin, he sounds like an idiot.\n\nNTA OP",
              "id": 180,
              "comments": [
                {
                  "score": 8,
                  "content": "Also, any patient discussions should be while they're at work, not socializing",
                  "id": 181,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Families will lie for each other. I've seen it first hand. He has someone at work is my guess.",
              "id": 182,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 24,
              "content": "I met my ex's family and we met in public too and it turns out I was the other woman. His family knew. He didn't ever introduce me to his friends though, turns out they were her friends too. Family covers for each other though. It sucked but trust your gut and the urge you had to leave. NTA.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Or he’s not a doctor…",
          "id": 184,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3318,
      "content": "Girl…this is a minor conflict? \nAre you a doormat?\n\nPlease do yourself a favour and reevaluate your self worth cause you deserve better. This is breakup material, sorry.",
      "id": 185,
      "comments": [
        {
          "score": 974,
          "content": "No. I'm not like that but usually I'm a person wuth so much patience and slow reactions especially if I'm not understanding the situation completely.",
          "id": 186,
          "comments": [
            {
              "score": 2257,
              "content": "There are a few options:\n\n1) he is ashamed of dating a school teacher in front of his coworkers so he is trying to hide you from that side of his life\n\n2) he is dating someone at the hospital and is trying to hide it.\n\n3) he likes someone at the hospital and is trying to keep his options open\n\n4) he wanted to have the \"my girl cooks and takes care of everything for me\" image in front of his peers.\n\n5) his coworkers are assholes and he doesnt want to shake things up\n\nHonestly, I cant think of a GOOD reason for that behavior. This should not be \"small\" for you. It doesnt have to be a deal breaker but it should be a big deal for you to figure out.",
              "id": 187,
              "comments": [
                {
                  "score": 1352,
                  "content": "6) he's intimidated by one of his work buddies and thinks that if OP meets him, OP will leave for the better option.\n\n7) his work friends are asses and he knows it but doesn't want to call them out, nor let OP know his taste in friends.\n\n8) he's lying to OP about something work related (he's actually a nurse instead of a doctor or something) and doesn't want it to come out.\n\nDoesn't have to be hiding OP from his friends. Could be that he's hiding his friends from OP.",
                  "id": 188,
                  "comments": [
                    {
                      "score": 463,
                      "content": "That last one hadn’t occurred to me but now that you’ve brought it up it seems like a SUPER viable explanation to me. Especially if this is an LDR (sounds like it might be) it seems likely that this AH thought he’d be able to get away with a lie like that almost indefinitely. If it’s not another girlfriend, it’s this for sure.",
                      "id": 189,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 151,
                      "content": "Oooo #8 didn’t occur to me, that’s a good one, but I think it would be hard to pull off for longer than a month or so.",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 146,
                      "content": "9) he is just seeing if he can make OP actually degrade herself this way and get away with it.\n\nAlmost all abusive partners throw out tests like this to see how far they can push it, which feel disorienting and out of place after a honeymoon phase. This guy did NOTHING to avoid this situation. He opened the door after looking through the peep hole, welcomed them in, and visited at length without rushing them out. All of that doesn't fit with someone leading a double life of some kind (hiding a work lie or a side gf). If this guy was hiding something he'd have done everything possible to keep these worlds apart. He took his sweet time, I think on purpose.",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Oh wow, you're good. So was the person above you. Dang, I never would've thought of that stuff",
                      "id": 192,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "9) He was selling her to his surgeon friends for her organs. \n\nShe was going to cook dinner, and he was going to dope her food, and his buddies were going to carry her off to be parted out.",
                      "id": 193,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "9) He actually thinks OP is too stupid to listen to a conversation about medicine.",
                      "id": 194,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "But they wouldn’t know he had a domesticated girlfriend if she stayed hidden in the kitchen. If he’s introduced her, but she’s said ‘Lovely to meet you but I’m busy fisting a turkey’, that would be different. \n\nThis is not minor. NTA",
                  "id": 195,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "9) he and his work friends are doing something sketchy with their access to medical supplies/drugs and he doesn't want her to find out",
                  "id": 196,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "If Number 4, why wouldn't he be okay with OP introducing herself quickly to the coworkers before she starts cooking? If Number 4, then he isn't projecting \"*my girl* takes care of everything,\" he sends the message that \"I also sleep with *my servant.\"*",
                  "id": 197,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "He's not a doctor",
                  "id": 198,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "Or 6. He’s not a paediatrician and didn’t want her to find out.\n\nEither way, this dude sucks. NTA",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 92,
              "content": "The dude sounds sketch",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 80,
              "content": "I also just saw your edit and WOW seriously dump this guy",
              "id": 201,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 22,
              "content": "You should have kept busy MAKING HIM DINNER.\n\nYOU were the rude one when he ignored you for an hour. \n\nHE decided you would be lost in conversation and unable to keep up. \n\nHE decided you should pretend to not exist (or make him dinner). \n\nWhat redeeming qualities does this guy have? \n\nNTA\n\nPS. Getting the feeling he has spun some tails about you at work …",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "he is taking advantage of your patience and kind heart. run. fast.",
              "id": 203,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "If anybody ever treated my daycare teacher who my kid loves with all their heart the way your boyfriend treated you I'd want to rip his eyes out. And the psycho is a pediatrician.... \n\n\nYou both work with kids!!! I can think of a million interesting conversations u could have had with them",
              "id": 204,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You are being trauma bonded how much are u gonna put up with? He will keep on pushing boundaries he won’t care cos he know u will just take any shit from it",
              "id": 205,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Well, I think you've understood it now. \nHe's nothing and doesn't deserve you!",
              "id": 206,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "There is nothing else to understand here. He treated you like a DOG and you're wondering if YOU\"RE THE AH????\n\nGirl.....seriously....lose the dope and move on. He's not worth this.",
              "id": 207,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "A doormat would've sat there until they left, you didn't. Good on you. NTA",
              "id": 208,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1164,
      "content": "NTA he was embarrassed of introducing you to his friends. Next time don’t tolerate that kind of treatment. Either leave immediately or spring up on them in the first minute and tell them exactly what your boyfriend requested then leave.\n\nSounds so sketchy!",
      "id": 209,
      "comments": [
        {
          "score": 774,
          "content": "Yes I had the same conclusion since he was okay with me meeting other people who aren't doctors which what his friend circle is made of.",
          "id": 210,
          "comments": [
            {
              "score": 949,
              "content": "I'm a doctor.  Many of my friends are doctors.  My boyfriend is not a doctor.  We all hang out because it doesn't matter.  \n\nYour (ex?) bf is a dick.  \n\nFYI:  Pediatricians are probably the least respected among physicians.  If you want to knock him down a peg, tell him you'd rather date a \"real doctor\" and watch him explode.  (no offense to pediatricians, just to that particularly douchy one)",
              "id": 211,
              "comments": [
                {
                  "score": 130,
                  "content": "Why are they the least respected?",
                  "id": 212,
                  "comments": [
                    {
                      "score": 413,
                      "content": "I'm guessing that anything dealing with children gets an automatic downgrade due to childcare being seen as women's work.",
                      "id": 213,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 141,
                      "content": "Because it requires the least amount of time and the residency has the lowest standards. They're down there with Family Medicine. Conversely, it's much harder to get into a dermatology or surgical residency. Per my cousin who's a pediatrician.",
                      "id": 214,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "For the record, I believe this is true for pediatricians, but not pediatric specialties. I work for neurosurgeons, and they're all in awe of the one peds neurosurgeon in the group because none of the rest could deal with kids with brain tumors or spinal deformities.",
                      "id": 215,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 91,
                  "content": "LOLOL I said that to an asshole chiropractor I dated once. \n\nWas worth it to see him turn purple raging at me",
                  "id": 216,
                  "comments": [
                    {
                      "score": 90,
                      "content": "To be fair, chiropractors *are* quacks.",
                      "id": 217,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "Aren't chiropractors like physical therapists with a side of alternative medicine? That's not even close to being a doctor. Seems like dude was just getting angry at the truth.",
                      "id": 218,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "I don't wholly disbelieve in chiropractors--I think some of them are really very good at what they do--but I do for some reason object to calling them \"doctor.\" It feels disrespectful to real doctors and to PhDs, who've gone through so much more schooling and training.",
                      "id": 219,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "Omg I kind of wanted to mention this but I’m not a doctor and didn’t feel like it was by place, lol. My bf is an ortho and I remember him joking with some of his buddies that if they were to fail their ortho boards they could always just go to peds. It’s the bottom of the barrel among physicians. Also, when we met years ago I was a bartender and he was (is) a spine surgeon, I ALWAYS met his doctor friends, including his attendings during residency and fellowship. OP needs to leave bc thus dude has a work gf or maybe lied about being a doctor in the first place?",
                  "id": 220,
                  "comments": [
                    {
                      "score": 45,
                      "content": "I think with the whole \"we're going to be talking about things you wouldn't understand\" comment he may also just think she isn't \"smart enough\" to meet his doctor friends. Which is also a big red flag.",
                      "id": 221,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Bottom of the barrel? I know many people who did extremely well on their boards and chose to go to pediatrics. Every single person that I know in pediatrics picked it because they love working with kids and not because it was their back up specialty or because their board scores weren’t high enough. \n\nHope you don’t have any kids with your bf. I wouldn’t want you to have to take them to a pediatrician since they’re basically crap to you guys.",
                      "id": 222,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": ">FYI: Pediatricians are probably the least respected among physicians. If you want to knock him down a peg, tell him you'd rather date a \"real doctor\" and watch him explode. (no offense to pediatricians, just to that particularly douchy one)\n\nBoomer Doctor mentality right there. I have no intention of going into pediatrics, but this is a shitty thing to see coming from a physician.",
                  "id": 223,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Seems like a pretty crappy view to hold, part of the toxic prestige heirarchy in med. They're just the doctors who treat kids, not very respectable?",
                  "id": 224,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "Cries in Pediatrician",
                  "id": 225,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "If she really wants to mess with him that way, she should say she found a nice nurse anesthetist.  They make more than pediatricians, and that's a definite sore spot for anyone working in peds.\n\nEdit: I don't agree with the mindset, but I'm not above usong people's prejudices and classism to insult them.",
                  "id": 226,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Even better!  \n\nSeriously, you couldn't pay me enough to work as a pediatrician.  They deserve some sort of hazard pay.  It's not the kids most of the time, it's the parents.  It has to be orders of magnitude worse than when I did my peds rotation in med school, because now they have to compete with Dr. Google and Mommy Blogs.  And the ones I know are genuinely nice people; they deserve better.",
                      "id": 227,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 249,
              "content": "Are you 110% positive he is an MD? Have you seen his diploma from medical school? Maybe he is actually a tech or something and didn't want his buddies to blow his lie. 🤷\n\nETA: Over 150 up votes! Thanks! That's my highest yet! 😊",
              "id": 228,
              "comments": [
                {
                  "score": 53,
                  "content": "If they’re in the US, there’s a National Provider Index online that’s open to the public and OP can search for his name. \n\nIt’s REALLY easy to verify physicians (MDs or DOs) in the US.",
                  "id": 229,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 52,
                  "content": "OH, SNAAAAAP\n\nWhaaaaaaaat??? That would be crazy, good theory",
                  "id": 230,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Ooooooh. That's a good one\n\nObviously there's something really big missing here.",
                  "id": 231,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 127,
              "content": "Reevaluate your relationship, anyone that would do that to someone they claim to care about is rude.\n\nDoctor or not.",
              "id": 232,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 23,
              "content": "Then he's embarrassed by you. There are only so many reasons why you hide people, if there isn't someone else in his life that they know, then he's embarrassed or is involved in something illegal. Either of which is pathetic of him.\n\nIf it was just \"we're going to have convos that you won't understand\", then he would have at least introduced you and asked if you can start making dinner and he'd join you in a bit. He wouldn't hide you before they came through the door and ask you to sit there while they were here. \n\nHonestly, I think you should run for the hills.\n\nNTA",
              "id": 233,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "A few  scenarios stand out. \nHe’s lied about his job and doesn’t want to be found out. \nHe’s talked you up to his workmates and your appearance didn’t match his talk on the day the turned up. Ie maybe he said you were a smokin hot high flying exec (which you could be) but on that day you were a regular chick in sweat pants (perfectly normal) and his ego didn’t want them meeting you in that regular state. \nYou’re the side chick. (Unlikely given you’ve met his family). \nMy vote is option 2.",
              "id": 234,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 116,
          "content": "Why would there be a next time?  He showed you who he is, believe him. Get out.",
          "id": 235,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 869,
      "content": "NTA. \n\n>He called me later saying what I did was disrespectful and rude.\n\nWell, he's the expert on that.\n\nI'm betting he has a \"work\" girlfriend and that's why he compartmentalizes his life.",
      "id": 236,
      "comments": [
        {
          "score": 158,
          "content": "As bad as this seems, that was my first thought right away. Why else hide the fact that you have a gf around your colleagues? That doesn't make sense.",
          "id": 237,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "Ooh I assumed he wasn’t even a doctor but that makes more sense!",
          "id": 238,
          "comments": [
            {
              "score": 13,
              "content": "If OP is in the US, you can verify if he’s actually a doctor pretty easily online. The work girlfriend may be harder to track down.",
              "id": 239,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "This was my exact thought after I gave him the initial benefit of the doubt and thought they might be discussing patients but that doesn't seem to be the case here. \nOP you're NTA for walking out like that at all.",
          "id": 240,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Yes! Either this or he has his eye on someone at work and doesn’t want it getting around that he’s in a relationship",
          "id": 241,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 406,
      "content": "NTA, sounds like he was hiding you, maybe he has a another partner?",
      "id": 242,
      "comments": [
        {
          "score": 174,
          "content": "I don't think so since he's very open about me with family and other people in his life who are not in the same profession as him.",
          "id": 243,
          "comments": [
            {
              "score": 675,
              "content": "He's hiding you from work colleagues, so either he's got something going on with someone in his field, or he's a freakin' weirdo and you can do better than that. He treated you badly, and I LOVE your exit. NTA.",
              "id": 244,
              "comments": [
                {
                  "score": 204,
                  "content": "Or he's not even a doctor!!! \n\nI'm enjoying all the theories way too much",
                  "id": 245,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Ooooh I love it! Definitely a possibility and a great twist!",
                      "id": 246,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 87,
              "content": "If he has introduced you to parents and non-work friends, it's very likely he has a girlfriend who's integrated into his work circle (possibly a coworker or someone he met through a coworker) but who isn't allowed to meet his parents and friends. You and she would have inverse spheres of his life you're allowed to move through.",
              "id": 247,
              "comments": [
                {
                  "score": 37,
                  "content": "Apparently she hasn’t meet the parents. Just his siblings",
                  "id": 248,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Ohhhh damn….yeah, she’s the side chick.",
                      "id": 249,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "Or maybe work girl hasn’t gotten there yet but that’s just because she’s newer and OP was around before work girl, so she met some family back when he was a less desirable lowly med student. \n\nNow that he’s a doctor he wants to Warner Huntington III her Elle Woods in favor of Dr. Vivian Kensington, but he’s holding onto Elle for now since Vivian won’t get serious yet and he wants to have a yo-yo girl he can yank back to him as a place holder just in case Vivian dumps him.",
                  "id": 250,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 4,
                  "content": "Ooooof",
                  "id": 251,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 57,
              "content": "Girl, open your eyes! My ex cheated with one is his office coworkers, when I would go to his office she would hide in the bathroom like the hood rat she was. You don’t deserve to be treated like this!",
              "id": 252,
              "comments": [
                {
                  "score": 14,
                  "content": "What a fuckin dumbass! Why on earth would she hide if she really worked there?\n\nLol it's like ppl WANT to get caught. So dumb. Glad that douchenozzle is an ex, girl!",
                  "id": 253,
                  "comments": [
                    {
                      "score": 8,
                      "content": "She was hiding because she was scared that she was going to find out and beat her ass",
                      "id": 254,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Thanks!! There was soo much stupid shit they did. Like he did not have her phone number in his contacts, (but has everyone else’s) when I would call the office she would give me attitude and shit like that. The one thing that confirmed the cheating was once I called the office and she answered the phone and screamed at me for calling him and he DEFENDED HER!!",
                      "id": 255,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Oh Rose, he definitely has someone else. If thousands of us can see it I hope your eyes open. Good luck",
              "id": 256,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "do you know if he was dating someone in this field prior to dating you?",
              "id": 257,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "I had an ex introduce me to all of his friends, brothers and even his mom, who then came to my house for coffee to meet my mother, while being 100% still married and with no conflict in his marriage. Sometimes family members just know and are okey with this behavior. And if they don’t know, then it’s a work gf, since usually people don’t mix family and work. This is all assumptions, but still, the big red flags are there and shouldn’t be ignored. He disrespected you and assumed you would be a  doormat. Walked you to the kitchen and asked you to wait patiently and and asume that you should cook for him while he’s talking “important” stuff with his coworkers? Hell no. Also I’m a doctor and let me tell you that I have enough friends who date a non doctor and still have nice conversations even when 80% are doctors. He tried to hide you from his coworkers, then accused you of being disrespectful, basically blaming you for everything. Put yourself first, because for him your not a priority.",
              "id": 258,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Theres also the chance that when he goes out with \"the boys\" he hooks up with anyone he meets. You may be his only \"girlfriend,\" but I doubt you're the only one he is sleeping with. Alternately, he is stringing you along until he meets someone else.",
              "id": 259,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Then he has to be ashamed of you and that’s no better. Does he think that’s his and the doctor friends shit don’t stink? They are not better than you. There is really no excuse for how he treated you so I would end it.",
              "id": 260,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "That's what I thought too about my long term bf too. I met his family. I met others in his life. He was sweet. He was kind. He was there for me when I needed him. So I thought.\n\nWhen something ridiculously similar to the above happened to my face, I too denied it. I denied it. I hung onto every lie like it was a life raft. Love isn't a faucet you can turn off even to the worst people in your life and that can be confusing/blinding as you decide to confront what is unimaginably incongruous behavior from someone you still love!\n\nAnyway, turns out he had a specifically certain circle of friends with whom he was dating and fucking around from the near start of our relationship.\n\nI was about your age too. I've since moved on and found love.\n\nNext time, confront him while he's hanging out with his friends. If there's something up, it should come out. I hope for your sake it's something like he fell a year behind in his schooling instead of well, the lowest common denominator explanation.\n\nOtherwise, move on, love and trust go hand in hand. That's not a concern you want to wake up to for decades as you continue wasting time with this person.\n\nNTA\n\nEdit - the mere fact that he would insult you with \"we were talking about stuff you wouldn't understand\" is a huge neg and is also one of the many insecurity driving things my ex did to me to keep me \"grateful.\"\n\nPlease heed my words. And everyone else's. I don't know you but my heart goes to you and it's going to be okay.",
              "id": 261,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Maybe he has someone at work he has his eye on, or is in a flirty situation with, and he doesn’t want anyone to know he is in a relationship to keep his options open",
              "id": 262,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 337,
      "content": "NTA.\n\nYou might be the sidepiece. \n\nI can think of no justification for keeping a girlfriend one has been dating for NINE months hidden away while other friends or work colleagues visit. None.",
      "id": 263,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 170,
      "content": "NTA \n\n>This a minor conflict that\n\nNo this is a major conflict. \n\n>They stayed for an hour and I started calling Donnie but he didn't answer me.\n\n>\nEdit2: He claimed that they were talking about stuff I wouldn't understand and I'd feel awkward sitting there not knowing what they were talking about.\n\n>Edit3: he said I should've made myself busy making dinner in the kitchen instead of waiting til his friends leave since we agreed to eat dinner together but I ruined our plans.\n\nHe just showed you his true nature. He thinks you cannot speak with doctors because you wouldn't understand. He expected you busy yourself making dinner instead of spending time with him.\n\n>He was missing me and been wanting me to visit and he was too busy so I only got the chance to visit yesterday.\n\nYet he has done nothing to prove he misses you. He let you time be interrupted and usurped for more than an hour.\n\nIs this really the kind of relationship you want to be in?",
      "id": 264,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 147,
      "content": "NTA.\n\nThe only thing that might explain his behavior is that he is seeing someone else, and at least one of the visitors knows that person and might tell her about you.\n\nSo not only is he treating you badly when you are around, he is cheating on you when you are not.\n\nDump him.  You can do better.\n\nEDIT: and see a doc about STDs.",
      "id": 265,
      "comments": [
        {
          "score": 18,
          "content": "I'm not on the side chick train. I think this might has been a test. Had his buds show up just after op arrived. Put her in the kitchen alone and see what she does. \n\nIf she freaks and leave, test failed. \n\nStarts cleaning, cooking, and being domestic in general, test passed. \n\nIt's fucked up but what I think this was.",
          "id": 266,
          "comments": [
            {
              "score": 7,
              "content": "And if this is the case, Op is still right for leaving because any partner putting another partner through a disrespectful \"test\" like this deserves to get dumped.",
              "id": 267,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}