{
  "post content": "Disclaimer: My mom was a single mother for most of my life and I in no way am implying there is something wrong with or shameful about being a single mother.\n\nI have this “friend” Olivia. We aren’t really close, but we belong to the same large social circle (so we have a lot of mutual friends). We were having a zoom “party” when she announced she was pregnant with her boyfriend of one year. No one in our friendship group has met this boyfriend but we all gave her our congratulations and told her we’d love to meet the father when lockdown ends. Olivia got a really coy smile on her face and told us we all knew him already, but she would officially introduce us when the pandemic was over.\n\nA few days later a smaller group of us were chatting and my friend “Emma” mentioned that another couple (Tom and Sarah) in our group were most likely going to get a divorce soon. This small group consisted of all of my personally close friends (which would normally include Sarah). Emma told us, with Sarah’s permission, it turned out Tom was Olivia’s baby’s dad and when she made that comment during the zoom call it confirmed Sarah’s suspicion and she snooped and found evidence. According to Emma, Olivia intentionally got pregnant (poked holes in the condom) and only announced it when she was no longer eligible for an abortion to force Tom to leave Sarah for her. Tom has told Sarah that he has no plans to be a dad to the baby no matter what happens between them.\n\nAt the next zoom party (neither Tom nor Sarah were present) Olivia broke down crying. She told everyone her boyfriend got cold feet about being a dad and broke up with her. That she would now be forced to be a single mother and that she needed her friends more than ever. Everyone was giving her sympathy (including the friends who knew the truth). She started making plans on how we would all “chip in” to help her get things for the baby before it arrived. This is when I started laughing. \n\nShe demanded to know what I found so funny and asked me if I was shaming her for being a single mother. We got in an argument which ended with me telling her she deserved to be a single mother and she made her bed so now she should lay in it. She started crying again and disconnected. \n\nSomeone else explained the whole Sarah/Tom/Olivia affair to everyone present who had no idea. Our friendship group is split. Half, whilst on Sarah’s side, think we should still be sympathetic to Olivia too because she is going to be a single mom and would need us to be her support system (she has no family here and has a low income so will need financial help most likely). The other half think Olivia is a homewrecker and neither her nor Tom deserve any sympathy. Some people are now saying they will no longer attend events if Tom or Olivia are invited. Olivia’s best friend called me a bitch for turning the group against her and said I was slut-shaming her, which I wasn’t. \n\nAITA?",
  "id": 1,
  "comments": [
    {
      "score": 5459,
      "content": "NTA.\n\nOlivia DID make her bed. She's a manipulative liar, and while I really hope this isn't the case, she'll probably end up using the kid as a pawn in her games too.\n\n(Tom is also a lying AH for being a cheater and not stepping up to his responsibilities, but in the context of this post, OP is def NTA)",
      "id": 2,
      "comments": [
        {
          "score": 1892,
          "content": "I agree with everything but “step up to his responsibilities.” Why should he be responsible for a kid that he had no intention to create? Poking holes in condoms is reproductive coercion.",
          "id": 3,
          "comments": [
            {
              "score": 1386,
              "content": "exactly, sexual assault is no joke and while i usually don’t pity cheaters, it’s impossible to deny that Tom is a victim in this. also, if i slept with any of my friends’ bfs on purpose, got pregnant, and didn’t say anything until it was too late to get an abortion (i’d never want to, but if), i’d get beat up no question. now i’m wondering why olivia is still part of the friend group/why her friends tolerate cheating and sexual assault so passively.",
              "id": 4,
              "comments": [
                {
                  "score": 511,
                  "content": "Agreed. \n\nJust one of these actions would be enough to make me reconsider a friendship, but all of them combined? \n\nHow is she not immediately kicked out of the friend group? \n\nFrankly, I would never want to risk her turning that drama cannon in my direction.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 83,
                      "content": "Exactly, it's awful enough that she did to anyone at all, but she did that to someone in the friend group!!! She deserves no more friends",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 64,
                      "content": "I feel like she’s getting a pass because pregnant women are angelicized by society.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "Right?? I once reconsidered a friendship purely because the friend was cheating with a *stranger*. Let alone someone I knew and cared about.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": ">How is she not immediately kicked out of the friend group? \n\nBecause her friends are just as bad? I have read something like \"Friends are like a mirror\".",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "Some of them may feel bad for the baby and are willing to put up with her to help support the baby.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 82,
                  "content": "It might be because they feel like the kid needs support even though Olivia doesn't deserve it. A innocent child will be here sooner rather than later despite he/she/they are a product of rape by deception committed by their mother. Thing is if you support Olivia it allows her to A) keep the child when she is most likely the definition of a unfit parent. People who do this shit don't actually care about children as people. Also B) possibly tells Olivia that she is entitled to not have to deal with the consequences of her actions and that she wasn't wrong to do it and its ok to use her child as a prop. Like she already is doing before the child is even here.\n\nOn the flip side being firm but maintaining Olivia's trust could make it easier for them to talk her into giving the baby up for adoption. Although if they aren't calling her out for it and setting firm boundaries, they are assholes to Tom, Sarah, and the future baby. As well as themselves for letting them be used to fix her fuck up.",
                  "id": 11,
                  "comments": [
                    {
                      "score": 41,
                      "content": "NTA either way,\n\nBut yes, this is an actual moral dilemma if we think about the child that will come.\n\nOlivia is indeed likely unfit to care for it on her own. But she shouldn't feel like her friends just condone her behavior in this ordeal. Calling her out and a firm stance is a thing I'm all for, yet not letting her and her baby plunge to their demise entirely.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I wish I had an award for you because you summed up everything that's wrong perfectly.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 40,
                  "content": "NTA  so glad to hear it called sexual assault, because that is what it is.",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 190,
              "content": "Doesn't count when it's a bloke that gets fucked over though, he's still on the hook, and it's fucking disgusting. \n\nTom's a AH for cheating, but he's still been royally fucked over by Olivia.",
              "id": 15,
              "comments": [
                {
                  "score": 58,
                  "content": "Olivia is the big super villan aka the big ah. And Tom is the small crook aka the small ah",
                  "id": 16,
                  "comments": [
                    {
                      "score": 37,
                      "content": "He's still a rape victim.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": -1,
                  "content": "I feel it’s comparable to him getting shot in the leg while breaking in to someone’s house...he should’ve assume nothing good would come of it and there was a high probability of certain repercussions.",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 125,
              "content": "Exactly here poking holes in condoms is a crime no matter if it's a woman or a man that does it, Olivia is a criminal and while Tom sucks for being a cheater he DOESN'T deserve to be forced to take \"responsibility\" or pay for being a victim of (what in my country is) sexual assault. Olivia is an abuser.",
              "id": 19,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "Not just reproductive coercion i'd argue it's also rape. Both are bad but never ever sabotage birth control. Your damaging a person's autonomy and taking away a persons ability to assess a situation accurately and evaluate risk, hence removing the possibility of them being able to consent.",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 26,
              "content": "We liyerally only have the wive saying dhe did this. Emma was not there when thus happened so it vould be a lie by Tom to make himself look better.",
              "id": 21,
              "comments": [
                {
                  "score": 102,
                  "content": "OP states that Olivia admitted it herself in [this comment](https://www.reddit.com/r/AmItheAsshole/comments/iej9tv/aita_for_laughing_at_my_friend_for_becoming_a/g2h4um0/?utm_source=share&utm_medium=ios_app&utm_name=iossmf).",
                  "id": 22,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Thank you. I had not seen this comment. :)",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "NTA.\n\nYou got a point there majesticspacecat",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Totally with you on this. He didn’t consent.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Exactly and he can take that liar to court and win.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "Olivia should go to jail.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I'm just wondering how we know she poked holes? Did she tell someone and they spilled? Or is it just that \"he wore a condom so how could i have happened?\" \n\nEta: Blabla found the answer like 30sec later.",
              "id": 28,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 154,
          "content": "Tom was raped. Poking holes in a condom is a form of stealthing, which is a form of rape. He may be an asshole for cheating. But the baby wasn't his fault.",
          "id": 29,
          "comments": [
            {
              "score": 1,
              "content": "Not raped he know what he was doing. This was Sexual Entrapment by her causing to father a child he had no intention of creating. He is still guilty of sticking his dick in her.",
              "id": 30,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 142,
          "content": "She poked holes in the condom. That’s reproductive coercion. He doesn’t need to “step up” for that violation.",
          "id": 31,
          "comments": [
            {
              "score": 16,
              "content": "He will still be hooked up for child support. So much for male reproductive rights!..... 🙄\n\nBut at least he can't be forced to be play the role of a father.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 135,
          "content": "I also don’t understand when people expect their friends to “chip in” to help them support their baby?  I’ve never heard of such a thing? Friends are not there to financially support you.",
          "id": 33,
          "comments": [
            {
              "score": 10,
              "content": "Right! Like my friends would pitch in and help because they love me but I would never expect them to.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "even then, why would you have the audacity to expect people to chip in to help you support a baby that was conceived through you raping someone? to me, she's probably going to make everyone do the work while she relaxes and neglects the kid.",
              "id": 35,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 1,
              "content": "Probably because such assholes don't have much money on their own and must have estranged their families. Or feel entitled to others support even if they have money and family(which might be as bad as them).",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": "To be honest, Olivia made someone else's bed and expected no repercussions for that. Tom deserves for his marriage to fall apart for cheating on his wife, but he didn't deserve a baby trap or for her to tamper with their contraception.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Tom's only 'responsibility' is to own up to being a cheater. He owes Olivia nothing.\n\nAnd you sound like a sexual assault/reproductive coercion apologist.",
          "id": 38,
          "comments": [
            {
              "score": -1,
              "content": "I didn't say he owes Olivia anything.\n\nI'm aware of how reproductive coercion workes, and I am absolutely not an apologist. My aside about Tom's \"responsibility\" was not towards Olivia, who sucks, but towards this poor kid, who pretty much all my sympathy is reserved for. In my mind, the \"responsibility\" I mentioned was taking responsibility for cheating, not for being the victim of reproductive coercion. I could have been clearer about that, my apologies.",
              "id": 39,
              "comments": [
                {
                  "score": 3,
                  "content": "He doesn't owe the kid anything either.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 0,
                      "content": "The second part of my response clarifies this.",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "tom is an AH for being a cheater, that much is true but he doesn't actually have a responsibility to this kid he never wanted. like cheating is bad but it's not as bad as fricking raping (maybe the wrong term, I'm pretty sure it counts as rape because the sex happens in different circumstances than tom consented to but it might be sexual assault, I'm not a lawyer so I don't know) Tom",
          "id": 42,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "NTA. Olivia might just be a new type of messed in the head. Poking holes in condoms, if a man did it to force a woman to leave her husband for him, would be considered reproductive abuse.\n\nIn the words of one of my favourite YouTube comedians, “You made your bed, so get fucked by an asshole in it.”",
          "id": 43,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": ">using the kid as a pawn in her games\n\nI agree. Thanks for pointing that out. Lots of people forget kids are the real victims. They aren't pawns nor \"quick fix\" to relationship problems.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "You do realize that it is considered rape to sabotage condoms like that, right? Maybe edit your post and cut out the accepting responsibility shit.",
          "id": 45,
          "comments": [
            {
              "score": 1,
              "content": "I addressed and clarified this a few hours ago in another comment.",
              "id": 46,
              "comments": [
                {
                  "score": 1,
                  "content": "How is it his responsibility?",
                  "id": 47,
                  "comments": [
                    {
                      "score": 1,
                      "content": "Taking responsibility for cheating. Like I clarified.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1357,
      "content": "NTA I would’ve laughed in her face, too! What a horrible woman to purposely get pregnant with a baby the dad didn’t want and which she couldn’t afford. Not to mention lying and having an affair for a year and then being coy while the WIFE was on a zoom meeting???? She’s deserves to laugh at and shunned. \n\nI feel bad for her bday, though. And Tom should pay child support.",
      "id": 49,
      "comments": [
        {
          "score": 618,
          "content": "> Tom should pay child support.\n\nKnowing him he won't if he can help it.\n\nedit: Yes what Olivia did is awful and I've realised that asking Tom to pay child support probably isn't fair. My anger at him definitely clouded my judgement when I first replied.",
          "id": 50,
          "comments": [
            {
              "score": 805,
              "content": "Baby trapping is sexual assault. I have zero sympathy for her. This was entirely of her doing and as such it's entirely on her own head.",
              "id": 51,
              "comments": [
                {
                  "score": 296,
                  "content": "THIS he was assaulted why tf would he pay for the child?!",
                  "id": 52,
                  "comments": [
                    {
                      "score": 182,
                      "content": "Because child support is not a punishment.\n\nChild support is the right of the child.\n\nIt sucks for Tom, but the kid still deserves food and shelter and clothing and education, and should not be punished for the sins of their mother.\n\nAdoption might be the best case scenario, here. Tom sounds like he would be happy to sign away adoption papers if Olivia asked him too.",
                      "id": 53,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "he does not pay her he pays the kid, small but significant difference. \n\nalso NTA OP",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -22,
                      "content": "Because he willingly had sex? And pregnancy is one of the possible outcomes of sex. If he didn’t want to be trapped, he shouldn’t have cheated. Both Tom and Olivia suck",
                      "id": 55,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 117,
                  "content": "[deleted]",
                  "id": 56,
                  "comments": [
                    {
                      "score": 43,
                      "content": "I was just going to comment: could you imagine that being your mom??? Good grief...The levels of deceit in such a revolting entrapment...What a nightmare of a person.",
                      "id": 57,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "That sucks. Hopefully the courts can help.  I feel a tiny bit bad since he didn’t want kids, tried to prevent them, and was tricked into having one. But not THAT bad since he was cheating on his wife.",
              "id": 58,
              "comments": [
                {
                  "score": 45,
                  "content": "I don't think he should have to pay child support since Olivia circumvented his birth control. \n\nTo me, this is no different than if I consent to sex with a condom and the guy removes it partway through without my consent (which is called \"stealthing\" btw). In this scenario, I had not consented to unprotected sex, so I would consider that to be sexual assault. Given that, I also consider poking holes in condoms to trick a guy into unprotected sex to be sexual assault. (I should note that stealthing hasn't been legally recognized as sexual assault in all jurisdictions. For example, I believe the UK is one that hadn't done so yet.)\n\nI'm all in favour of men having to pay child support for \"oops\" babies. Whether it's because they were careless and didn't take precautions, or because birth control failed, it doesn't matter. Unless society completely changes how children of single parents are supported and changes access to abortion/birth control, the men should be required to pay. But when the man didn't even consent to the sexual act, it was forced on him? It seems highly inappropriate to seek child support for the child conceived by him being sexually assaulted. \n\nHowever, I seriously hope Sarah dumps his ass. He's a major asshole for cheating.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 6,
                      "content": "[deleted]",
                      "id": 60,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": "Why should Tom pay child support?\n\nOlivia is the one who chose to have the kid, she was the sole decision maker, not Tom.\n\nWhat she did was literally rape, lying about being on birth control is rape, consenting to sex under false pretenses is rape.",
          "id": 61,
          "comments": [
            {
              "score": 93,
              "content": "I believe legally here he would have to pay if she can prove paternity but I do agree that reproductive coercion is an awful thing.",
              "id": 62,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Child support is not a punishment. Child support is the right of the child, even if adults view it as a punishment, and children should not be punished (inadequate food, shelter, clothing, education) for the \"sins\" of their parents.\n\nThis really sucks for Tom, though. Adoption sounds like the best case scenario here, rather than Olivia resenting it its whole life as the Trap Baby That Didn't Trap Tom.",
              "id": 63,
              "comments": [
                {
                  "score": 59,
                  "content": "[deleted]",
                  "id": 64,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Pregnancy is a known potential outcome of sex, and no contraception method is 100%. If Tom willingly had sex, he knew that pregnancy was a potential outcome.\n\nIf Tom did not want a child with Olivia, then he should not have been having sex with Olivia. If Tom does not want children EVER, then Tom should have looked into sterilization.\n\nChild support is not legally viewed as a punishment, it is put into place as a legal right of the child to ensure that the resultant child has their basic needs met. \n\n**Consequences can feel like punishment, though, when you didn't want that potential consequence.**",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "[deleted]",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 32,
                  "content": "Making a person who was raped take care of or pay for the product of that rape is a punishment.",
                  "id": 67,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "Child support is something that you have to pay when you are partly responsible for bringing life into the world.\n\nTom was not partially responsible for this, Olivia was completely responsible for it.",
                  "id": 68,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 0,
              "content": "Because someone has to and state does not want to pay that and instead writes a law that says who is going to pay, justice or not.",
              "id": 69,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -6,
              "content": "His cum=his dime\n\nBut the story sounds like a crock.",
              "id": 70,
              "comments": [
                {
                  "score": 9,
                  "content": "You've never met anyone crazy?",
                  "id": 71,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": -7,
              "content": "Because even though what Olivia did was disgusting, Tom knew or should have known no BC is 100% and this could have happened either way.",
              "id": 72,
              "comments": [
                {
                  "score": 16,
                  "content": "But it wasn't a failure in birth control that caused it.\n\nOlivia is 100% responsible for the pregnancy in this case, which means the burden should fall on her",
                  "id": 73,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Right but legally the court won’t care if she caused it or not. Not the least of which is it be impossible to prove in court that her tampering caused it vs accidental from birth control failing.",
                      "id": 74,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 52,
          "content": "> Tom should pay child support.\n\nTom was raped.",
          "id": 75,
          "comments": [
            {
              "score": 17,
              "content": "Doesn't matter, unfortunately, there was a kid (13-14) in the states who was raped by a female teacher, she had the kid, guess who's on the hook?...",
              "id": 76,
              "comments": [
                {
                  "score": 15,
                  "content": "Not to mention the backpay with interest since she sued when he was 18.",
                  "id": 77,
                  "comments": [
                    {
                      "score": 9,
                      "content": "I didn't know about that bit, JFC!!!!\n\nI give up...it's as bad as forcing a female rape victim to co-parent with the rapist...and yes, I know this has happened in the past.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 45,
          "content": "Pay child support for being baby trapped? If a guy pulls off a comdom during sex is rape then a girl poking holes in the condom is the same...",
          "id": 79,
          "comments": [
            {
              "score": 10,
              "content": "I mean looking at it from a legal sense, he might be forced to pay",
              "id": 80,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "Imagine claiming a guy with a wife is your boyfriend. And expect him to do boyfriendy business. You're just a mistress with a shitty man trapping plan. Lmao.\n\nImagine sticking your dick in crazy along with cheating on your wife and expecting the crazy to just let you go no strings attached.",
          "id": 81,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Why should he pay child support",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 1,
          "content": "[removed]",
          "id": 83,
          "comments": [
            {
              "score": 2,
              "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
              "id": 84,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 727,
      "content": "> She started making plans on how we would all “chip in” to help her get things for the baby before it arrived.    \n>  \n> Half, whilst on Sarah’s side, think we should still be sympathetic to  Olivia too because she is going to be a single mom and would need us to  be her support system (she has no family here and has a low income so  will need financial help most likely) \n\nFor me it's not even so much the whole homewrecker/poking holes in the condoms thing (which is already horrendous), but more so the fact that this woman decided to get pregnant whilst on a low income and not in a secure relationship and now expects you all to 'chip in' because you happen to be friends with her. I cannot stand that kind of entitlement and complete lack of responsibility. It's so dumb, and she's completely delusional calling another woman's husband her boyfriend and thinking that sabotaging birth control will make him stay with her. You and your friends are not responsible for her stupid decisions, and you should not spend one penny on her and her kid. \n\nNTA for laughing, I would have done the same out of sheer incredulity.",
      "id": 85,
      "comments": [
        {
          "score": 360,
          "content": ">I would have done the same out of sheer incredulity.\n\nHonestly, it was definitely an incredulous laugh. It just came out lol.",
          "id": 86,
          "comments": [
            {
              "score": 77,
              "content": "Knowing the information you knew at the time while watching cry with her \"my boyfriend\" BS there's NO WAY I wouldn't have laughed as well.",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "I seriously probably could not have helped myself. Having someone tell me that she expected me to help pay for a baby she intentionally had against the wishes of the person whom she was cheating with on his relationship just to break up his relationship is such a clusterf@@k that how could  anyone not laugh?    Why on earth do so many people think that they’re entitled to financial support from their friends for utterly stupid intentional life choices? \n\nDEATH thinks such basically evil people should be replaced with cats. This would improve everyone’s life.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Do not feel bad about the laugh or blowing this situation up. It is so much easier make major changes before the baby arrives but you can't make good ones when you don't have the right info. She needs to know exactly how little support she will have. Hopefully she chooses adoption but at minimum she can start working on getting the aid she will need.",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "I’d react the same way. Usually friends are eager to buy things for their friends babies.  I know I’ve gone above and beyond for a couple of my friends but it’s because it was my choice to, not an expectation.  If one of them was like I expect this I wouldn’t buy a thing.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 272,
      "content": "[deleted]",
      "id": 91,
      "comments": [
        {
          "score": 26,
          "content": "It is also so so unfair to the child!! Definitely NTA. I feel so bad for this kid who is already being used as a pawn by a clearly unprepared or committed birth mother. I hope she adopts the baby out. Also that’s considered sexual assault in some places if you mess with protection without telling the person. And is most definitely abuse. Everyone who enables her and doesn’t openly disavow her action is an asshole.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "No don't fuck Olivia. That's how we got in this mess to begin with.",
          "id": 93,
          "comments": [
            {
              "score": 1,
              "content": "[deleted]",
              "id": 94,
              "comments": [
                {
                  "score": 3,
                  "content": "Tom is an asshole. But Olivia acting this way could have been with any guy. A guy she doesn’t know wouldn’t know she is crazy.",
                  "id": 95,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Dude I was just making a joke. Tom is wrong in this situation but Olivia is horrible and kind of a loony imo",
                  "id": 96,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "Getting assaulted isn't Karma and its sick of you to say thst.",
                  "id": 97,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 131,
      "content": "NTA - she pulled a lot of manipulative stunts to get what she wanted, then when things fell apart wanted everyone else to come to her rescue and help her through this. \n\nMaybe...don’t use pregnancy to force someone to get a divorce? I’m no relationship expert, but cornering a significant other is not a great way to start a new relationship.",
      "id": 98,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 95,
      "content": "NTA\n\nShe intentionally wrecked a home. Tom is a cheater. Sarah is the wronged party.\n\nWhy should she get sympathy for babytrapping a married man and then lying about the circumstances of the father not being involved? She’s an asshole. So is Tom.",
      "id": 99,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 87,
      "content": "Info\n\nIs there any *actual* proof that she sabotaged the birth control? Where did this information come from?",
      "id": 100,
      "comments": [
        {
          "score": 137,
          "content": "> Is there any actual proof that she sabotaged the birth control? Where did this information come from?\n\nSarah forced Tom to call her when she confronted him and Olivia admitted it to him/them.",
          "id": 101,
          "comments": [
            {
              "score": 67,
              "content": "Then NTA.\n\nShe made two horribly bad decisions in a row. One may have been forgivable, to a degree, but sabotaging birth control definitely is not. She got what was coming to her.",
              "id": 102,
              "comments": [
                {
                  "score": 76,
                  "content": "That is sexual assault. If someone wouldn’t consent to sex knowing the truth about their sexual encounter, that is assault.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Yeah, which is why I said it is not forgivable.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "Why does this even matter? Olivia is a home-wrecker and ruined a marriage in her own friend group. OP did nothing wrong by laughing in her face, I would’ve done the same.",
          "id": 105,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "[deleted]",
          "id": 106,
          "comments": [
            {
              "score": 10,
              "content": "Well, the difference is that in one case, Olivia would be a cheater, and in the other, she'd be a cheater *and* a sexual assailant. One is certainly worse.",
              "id": 107,
              "comments": [
                {
                  "score": 1,
                  "content": "[deleted]",
                  "id": 108,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Depending on the country/state, Olivia would be a rapist for sabotaging birth control.\n\nSo Olivia accidentally getting pregnant while, still bad, wouldn't warrent this kind of response from the friend group.",
              "id": 109,
              "comments": [
                {
                  "score": 1,
                  "content": "[deleted]",
                  "id": 110,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 66,
      "content": "NTA. I hate the term slut shaming. It is one thing to hate on someone for how they look, dress or even how many people they hook up with but to say that someone can't be held responsible for meddling in someone else's relationship because \"girl power\" is just a bad faith argument.\n\nThis girl played a game and lost that's not sexual freedom.",
      "id": 111,
      "comments": [
        {
          "score": 48,
          "content": "I saw a comment on another thread that sums this up- affair shaming is not shut shaming.  You absolutely should be ashamed of participating in an affair and when you make the choice to do it you lose the right to any sympathy when it goes tits up",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 65,
      "content": "I’m team no olivia or tom tbh",
      "id": 113,
      "comments": [
        {
          "score": 35,
          "content": "Me too!",
          "id": 114,
          "comments": [
            {
              "score": 80,
              "content": "Can we have a team Sarah? Poor Sarah.  I don’t understand why the friend group hasn’t dumped Olivia and Tom and just kept Sarah.",
              "id": 115,
              "comments": [
                {
                  "score": 66,
                  "content": "Definitely team Sarah! \n\nIf Olivia wasn't pregnant they probably would've but now she's guilt tripping people into feeling responsible for her. \n\nTom is super popular so honestly I'm not surprised certain people in the group aren't willing to just drop him. I, personally, will be dropping him but I have always been more Sarah's friend than his.",
                  "id": 116,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 60,
      "content": "NTA. I had friends like this. She brought it on herself.",
      "id": 117,
      "comments": [],
      "relation": "Support"
    }
  ]
}