{
  "post content": "I am starting to feel bad about this incident and I want reddit to tell me if I am the a-hole or not.\n\nSo today I was walking my dog and I was zoned out. I was listening to my podcast, I had a song stuck in my head, and I was also talking to myself. I had a lot going on in my head. The only other things I was really paying attention to besides what was going on in my head was my dog and if people were walking in my direction so I could make sure we could get out of the way. This is how I am most walks btw, I am zoned out doing my own thing with no real intentions of listening to strangers when I am out and about.\n\nSo we are walking, minding our own business when this lady (who is ahead of me) says something to me, I take my headphone out, but I didn't really process what she said. I assumed she just said hi because I think I have seen her before, so I moved into the street and kept walking like I usually do. Suddenly her dog is up next to my dog and she's yelling at me.\n\nIt is important to note that she had a little cast thing on her right arm that was pinning her arm to her body, so she only had one functioning arm to control this dog. (He was like a medium sized dog, maybe a husky mix?\"\n\nShe said \"Why couldn't you have just done what I asked and stopped walking?\" I apologized out of utter confusion because I honestly was not paying attention to what she was saying. And then she told me to keep walking so I did.\n\nIt didn't occur to me until after I had already walked away that she had asked me to stop walking so that she could get into her house with her dog. Now in the moment I don't feel like I was the AH because if you can't control your dog, you obviously shouldn't be walking your dog. Maybe she didn't have anybody else who could take her dog out, but you shouldn't rely on strangers to stop what they are doing to comply with what you want them to do.\n\nNow that I have calmed down a bit, I feel like I am kind of the AH. Maybe I should have been paying more attention to what she was saying to me? Maybe I should have asked her to repeat herself, and I feel kind of bad now that the moment is over.\n\nSo reddit, am I the asshole for continuing to walk when someone told me not to?\n\nIn compliance with dog tax, here is my dog- [https://imgur.com/a/VtDESih](https://imgur.com/a/VtDESih)\n\nEdit: I am going to try and be more aware of my surroundings from now on. Just to make it clear I wasn't on autopilot walking blindly, I was paying attention to things ahead of me and I was watching my dog. From now on though, I will make it a point to keep my volume down so I can pay more attention around me just in case something like this happens again. Thanks for all the judgement's and feedback. ",
  "id": 1,
  "comments": [
    {
      "score": 21,
      "content": "NAH, this kind of shit just happens in life\n\nIf you actually heard her ask and ignored her then yeah you'd be TA... but in this case, no",
      "id": 2,
      "comments": [
        {
          "score": 0,
          "content": "Thank you for paying the r/pettax , much appreciation. NTA, but I would start paying attention to your surroundings for your safety.",
          "id": 3,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 11,
      "content": "NAH - you're NTA but neither is she. Dog's need to get out and exercise, especially one of that size. She's can walk her dog.\nBut it's not your fault you couldn't help her out and stop walking. Just an honest mistake.\n\nI imagine she yelled mostly out of frustration and possibly this was not the first bad thing to happen to her that day.",
      "id": 4,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "I might be pushing it.. but if someone is so busy in their head, not to mention listening to a podcast, isn't that something you could notice? I mean, hypothetically, if the old lady was me I think I would have noticed the fact that you were not \"open for a conversation\" as your eyebrows must have been frowned and or staring ahead like people do when they think or wander. Therefore not expect that you would hear me if i spoke to you. Not to mention - you were wearing headphones, also something noticeable. NAH.",
      "id": 5,
      "comments": [
        {
          "score": 1,
          "content": "I'm not sure if she did, I mean I did look at her and smile, but that's mostly because it's the polite thing to do. It's me acknowledging her as I was moving out of her way. It's also been kind of a common occurrence for someone to say something to me in passing even though I had my headphones on, maybe she still expected me to hear her? I'm not to sure.",
          "id": 6,
          "comments": [
            {
              "score": 2,
              "content": "Might I ask why you are bothered by this? Her dog suddenly stood next to you.  What is the harm?",
              "id": 7,
              "comments": [
                {
                  "score": -1,
                  "content": "The surprise of it? The not knowing if her dog, who was bigger than my dog, was going to do anything? Also her yelling at me for the way her dog reacted. And I dont want my dog to attack her dog. Things happen, I have learned from this incident, so hopefully nothing like this will happen again. Also her dog didn't stand next to me, he went to sniff my dog, which I didn't trust.",
                  "id": 8,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "NTA. She needs to teach her dog to walk properly on the lead. The fact it can’t do so isn’t your problem. Its a shame you didn’t hear her but that still doesn’t make you TA. Also, very cute dog!",
      "id": 9,
      "comments": [
        {
          "score": 1,
          "content": "Thanks!",
          "id": 10,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NAH. Just a kind of crappy misunderstanding. Maybe this was just another in a long line of pooey things that happened to her that day and that’s why she shouted at you but you’re not an AH",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 4,
      "content": "YTA but only for this reason: anybody could cry “help” or “watch out” or “we gon’ Rob this bitch” and you could end up in a lot of trouble because you weren’t aware of your surroundings and what was going on around you. Lower the volume, or take them out - just be aware a bit more because we don’t live in a perfect world, and someone zoned out and with headphones on is definitely more vulnerable than someone who is paying attention and is alert to their surroundings.",
      "id": 12,
      "comments": [
        {
          "score": 1,
          "content": "Thank you for your feedback I will try and be more aware of what is going on around me from now on",
          "id": 13,
          "comments": [
            {
              "score": 0,
              "content": "It sucks I felt I had to give that feedback and you can’t zone out when you like, where you like!",
              "id": 14,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "YTA for not being aware of the world around you. You’re lucky your dog wasn’t attacked by another dog",
      "id": 15,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "Soft YTA. If you don’t hear someone or process what they are saying, just ask them to repeat themselves. You put her in an incredibly stressful position which you could have easily avoided. I’m confused why you think her dog should not be walked in this situation, I don’t think that’s a reasonable request when her request was.",
      "id": 16,
      "comments": [
        {
          "score": 1,
          "content": "In the moment I didn't really know what to do, but to keep moving. Also I don't think her dog should just not be walked. I get that she was injured, but if you are injured and can't control your dog, you should find someone who can help walk your dog until you heal. Though I understand that some people can't get help with walking their dog. I think there were things we both did wrong in this situation, hopefully if I get put into another situation like this I will be better. Thanks for the feedback.",
          "id": 17,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. \n\nIt's perfectly fine for her to request that you keep your dog back for a minute. \n\nIt's perfectly okay for you to decide not to do it and/or not understand her request. \n\nIn the end, it's up to her to make sure the way is clear for whatever it is she needs to do. That means that if she knows her dog will get aggressive, then she needs to *look* before she changes direction and be prepared to take action if something unexpected happens. Taking action doesn't include scolding passersby.",
      "id": 18,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA. Your dog - your responsibility.  Her dog - her responsibility. Also, earphones are so common now, she could BTA for assuming you heard her",
      "id": 19,
      "comments": [],
      "relation": "Support"
    }
  ]
}