{
  "post content": "I (30f) am getting married in 6 months. I have a younger brother (27m) whose relationship of 7 years ended three months ago. The reason of the break-up was that he cheated on his former girlfriend with the girl he is currently dating.\n\nHis former girlfriend was like a sister to me, we grew to be really close during these past 7 years and I was really disappointed on my brother he had done such a thing to such a sweet person. I was really excited to have this girl in my bridal party. Now she won't even be at the wedding for obvious reasons, and on top of that my brother expects me to invite his current girlfriend. I really don't want her there. Even if they had started dating in a \"normal\" way (like, not cheating) I'm not sure I would want to invite someone I met only a few months prior to the wedding day (I've been planning my wedding for longer than I've known this person!). Also knowing that this new girlfriend really hurt my \"ex-sister-in-law\" and the fact that she is the main reason she won't be there not there, would make me really mad and sad every time I saw her at the reception. I'm so mad at my brother too, cause what he did is awful. The only reason he is still in the wedding list is because I know my mother will start drama if I don't invite him.\n\nI don't think I'm the a-hole, but my brother and my dad are calling me a bridezilla and my mother is telling me I'm ruining the day for her. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 5480,
      "content": "NTA, your wedding your rules - and your family can get all the way off your back for you not wanting someone to come that you don't really know.  \n\n\nEdit: some people have rightly pointed out that \"your x your rules\" isn't a good enough reason, and I think that's fair.  \nEssentially what I'm saying is.  \n\"You're completely within your rights to set the terms for who's invited to your wedding, especially as you don't know them and you feel greater loyalty to someone else that could be hurt if you invite them. Afterall, it is YOUR wedding\".",
      "id": 2,
      "comments": [
        {
          "score": 1486,
          "content": "OP sounds like a lot better person than the rest of her family.",
          "id": 3,
          "comments": [
            {
              "score": 699,
              "content": "The audacity of the mom saying OP is going to ruin her day",
              "id": 4,
              "comments": [
                {
                  "score": 304,
                  "content": "That's what I was thinking! Sounds like a mom living vicariously through her DAUGHTER'S special day!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 156,
                      "content": "Momzilla",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "I've noticed a lot of women end up having the wedding their mother always dreamed of.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Lol, I took the \"her\" not to be her the mom, but her the gf in question--whoch also is a wtf statement.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 62,
                  "content": "[deleted]",
                  "id": 9,
                  "comments": [
                    {
                      "score": 51,
                      "content": "Uninvite the whole family, have the good friend in wedding party. Problem solved!",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 45,
                  "content": "I know it's my wedding and it should be \"all about me\" and all, but I also want it to be a happy day for my family and friends... And my mum is using that to make me invite my brother's new girl cause \"he won't be fully happy unless she's there\".\n\nI'm especially mad cause my brother's bullshit behavious is now tainting the way I feel about my own wedding by 1) making a person I really care about, who was gonna be one of my bridesmaids, not be there anymore and 2) causing drama within the family cause now my parents are taking his side for some reason.\n\nLike I said, if I had my parent's support I wouldn't even invite him and I would have his ex (my friend) there...",
                  "id": 11,
                  "comments": [
                    {
                      "score": 16,
                      "content": "I say this with all the respect I can muster....Fuck your parents and fuck your brother.\n\nIn 10 years you're going to look back on this day and its either going to be your day or your brothers because that's how your parents are framing it. \n\nHe made his bed, let him lay in it. \n\nHe gets his feewings hurt not being able to go to your wedding? Should have thought of that before he fucked up. \n\nHe is going to get faced with what he did in the form of invasive questions from family at the wedding? His fault. \n\nCan't stand having people judge him for his mistake? Again, see the first question.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "What are your partner's thoughts about all this?\n\nI know it's not always feasible, but I would do what my sister did. I would have your real wedding with just your friends that can keep a secret at the local courthouse or in Vegas, then let your family think the wedding they are attending is the \"real\" one. It also takes some of the stress away from the wedding day being perfect because you already had a great wedding surrounded by the ones who support you the most!",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "He can't be happy for 3 hours without her attached to his hip? That doesn't sound healthy.\n\nYou don't want this girl in your pictures.\n\nWhen he breaks up with her in 3 months, he conveniently won't remember all this drama. And he's not the one who will have the wedding pictures forever.\n\nHe can have plenty of wedding pictures with her when he married her.... Or if he marries her!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "It should be all about you and your partner.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "You invite bros new gf = you mad\nYou don't invite her = your family blaming you, which will ruin the day.\nYou don't invite your brother and tell your parents they have a problem they don't need to show up either,  and suddenly you have a drama free wedding day,  because the drama isn't there and your ex sil/friend is there. Seems like a no-brainer to me.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Wow! Following your manipulative mom’s train of thought, it’s ok for you not to be fully happy so long as your brother is fully happy. Has your brother always been the family Prince? NTA.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 38,
                  "content": "My jaw DROPPED at this!?\n\nOP its NOT YOUR MOMS DAY",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Yeah I’m still trying to work through that line of thinking… I mean from what op has said isn’t mum ruining the BRIDE and GROOMS big day by them having to invite someone the bride doesn’t want there for mum to not bitch? Which has resulted in someone they do want there being unable to attend….\n\n\nI need some painkillers cause my head hurts now…",
                  "id": 19,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Right?",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 377,
              "content": "[removed]",
              "id": 21,
              "comments": [
                {
                  "score": 320,
                  "content": "I would definitely let him know that if he dared to show up with her against your wishes, that you will publicly embarrass her so bad she will cry. Let’s see if she’s still eager to come after that.",
                  "id": 22,
                  "comments": [
                    {
                      "score": 113,
                      "content": "While normally I would tell someone with this idea to grow up, in this case this is absolutely PERFECT!  Especially with everyone bullying OP to invite the affair partner!",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "Naw, this is a situation that security guards are hired for. Someone to quietly escort wedding crashed non-guests out of the wedding—as well as anyone else who might put up a fuss about it.  The bride’s peace of mind is well worth the investment in security. \n \nThis assurance might be enough for almost-SIL to come as a guest to the wedding.\n \n(NTA OP, btw.)",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 73,
                  "content": "Did you not read the post fully? She wishes she could remove him from the guest list without causing drama. She doesn't care if he is there because of his behaviour",
                  "id": 25,
                  "comments": [
                    {
                      "score": 23,
                      "content": "That’s how I read it. Stick to your guns OP.\nNTA.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 29,
                  "content": "Since she doesn’t seem to want him there either, that seems like plus.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "It sounds like OP is okay with that, as she invited him to prevent their mom from throwing a warbler.",
                  "id": 28,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 11,
                  "content": "[removed]",
                  "id": 29,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Bot stole from [this comment](https://www.reddit.com/r/AmItheAsshole/comments/11zvadi/aita_for_not_wanting_my_brothers_new_girlfriend/jdessme).",
                      "id": 30,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 7,
                  "content": "If ut were me I'd be hoping he would skip it, 2 birds 1 Stone\n\nOp is nta",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Having a cheater at a wedding has got to be bad luck, so him deciding to not come sounds like a win to me. Plus mom can't bitch about him not being invited if he IS invited and chooses not to come.",
                  "id": 32,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I hope he doesn’t steamroll and bring the mistress anyways",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 2,
                  "content": "/u/Ordinary_Roldsfg is a bot that stole this comment: /r/AmItheAsshole/comments/11zvadi/aita_for_not_wanting_my_brothers_new_girlfriend/jdee5oz/",
                  "id": 34,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 0,
              "content": "I'm impressed she uninvited the ex given how often that doesn't happen in this sub",
              "id": 35,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -12,
              "content": "[deleted]",
              "id": 36,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 381,
          "content": "And I would use the argument that “my wedding is not going to be the family event to introduce your new gf aka your affair partner to the extended family”. There is a time and a place and your wedding doesn’t have to be it. Especially when you don’t approve of the relationship. NTA",
          "id": 37,
          "comments": [
            {
              "score": 152,
              "content": "You're a good person, my argument would be \"judging by the actions that introduced her to our family I don't think she holds the values to partake in a celebration of love and commitment; neither does you btw so I suggest you stop pestering me and get your act together\".",
              "id": 38,
              "comments": [
                {
                  "score": 38,
                  "content": "I agree. Rescind invites to all three of them tbh (mom, dad, cheating bro).",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "Neither does brother",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -3,
              "content": "Agree with you on the first part. But op is his sister. She's no one to \"approve\" or not his relationship. You can not like how they got together, yes, but you don't have to give any approval for your brother to date someone new, regarded of the way he started dating.",
              "id": 41,
              "comments": [
                {
                  "score": 0,
                  "content": "[removed]",
                  "id": 42,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Sorry, but what's this ? Is this a dig ? I'm relatively new and I don't know what this implies...",
                      "id": 43,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 143,
          "content": "Agreed! And OP, get a trusted friend to be on the look out and kick out your brother when he inevitably brings the new girlfriend to your wedding.",
          "id": 44,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": "Op should remove her brother and invite his ex instead.",
          "id": 45,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 54,
          "content": ">your wedding your rules \n\nI really think this sub should bring in a rule that \"your [blank] your rules\" isn't a good enough reason why someone is or isn't the AH. There are lots of times when someone's rules are what make them the AH. I don't think that's the case here, but it'd be nice for the top rated top level comment to explain a little bit beyond \"your rules, do what you want\".",
          "id": 46,
          "comments": [
            {
              "score": 13,
              "content": "Fair enough, this is just a quick and easy way of explaining it.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "\"Your [event], your rules - unless those rules are unreasonable/present an overwhelming burden to your guests, are unfair/based on bigotry, or are applied asymmetrically to selected people for no good ethical reason.\"",
              "id": 48,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -4,
              "content": "Your wedding your rules, but what if mom and dad are laying out most or all the $ for their only daughters wedding? Sure, still your rules, but you better be willing to pick up the tab with all the talk of uninviting the parents. And unless you have kids approaching wedding age, you don't really know the emotional impact to a parent when their only daughter gets married. It IS a big day to parents of the bride.\n\nBride is NTA, but maybe she should have a heart to heart with her brother. She seems more vested in the old GF then her brother. I'm not condoning cheating, but if he cheated after 7 years, something is up, or that relationship was already long dead. Not an excuse! Be a man/woman and end it. But whatever the story, discuss it.",
              "id": 49,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 45,
          "content": "NTA. I would still have the ex, my friend, in my bridal party, if she was willing. And the homewrecker can stay home, brother, too, for that matter.",
          "id": 50,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 29,
          "content": "How about OP’s wedding budget, and she can decide on whom to spend it?\n\nDoes u/Prior_Bodybuilder_57 have any parameters on who gets a +1? When my friends got married, their rule was married, engaged, or living together. This eliminates anyone dragging in some random or boy/girlfriend of the moment, and, yes, it applies to family, too.",
          "id": 51,
          "comments": [
            {
              "score": 4,
              "content": "That kind of more or less objective rule really is a better, simpler reason to exclude her.  The other question is how large is the wedding.  If there are going to be 10 people there, then fine don't invite someone you barely know.  But if there's going to be 200 there's probably at least one other person you've only met a couple of times if at all.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "But then he might move in with her just to be able to bring her to the wedding!",
              "id": 53,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "[deleted]",
          "id": 54,
          "comments": [
            {
              "score": 7,
              "content": "fair point, added some clarification.",
              "id": 55,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 5,
          "content": "Get all the way off her back? Wowowowowow",
          "id": 56,
          "comments": [
            {
              "score": 5,
              "content": "It's super easy, barely an inconvenience.",
              "id": 57,
              "comments": [
                {
                  "score": 3,
                  "content": ":O",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "When I married my ex-husband, my brother +1 changed from his fiance to his new gf. I didn't like his new gf but I didn't want the headache of telling him he couldn't bring her. On the day, I was able to avoid her & still had a lovely day. Too bad I was not able to switch out the guy I married though 😅😂",
          "id": 59,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2628,
      "content": "NTA, you choose who you invite on your wedding. \n\n>and my mother is telling me I'm ruining the day for her. \n\nThis is funny.",
      "id": 60,
      "comments": [
        {
          "score": 187,
          "content": "Agreed!!",
          "id": 61,
          "comments": [
            {
              "score": 278,
              "content": "I'd disinvite my mom when she said that too .... then agin my family knows and would be silent about this. This is OP's day and mom needs to keep her feelings to herself. It's not about her.",
              "id": 62,
              "comments": [
                {
                  "score": 52,
                  "content": "Mom seems way too mentally invested in the wedding. Your guests are those that you and your fiance choose, not your mom's choices. I wouldn't invite such a short term acquaintance either, and they could well not be together by the time of the wedding.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 91,
          "content": "For real. Like she's the effen bride.",
          "id": 64,
          "comments": [
            {
              "score": 94,
              "content": "The mom: “and I took that personally”",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 64,
          "content": "The \" ruining the day \" part really got me too . Good thing it's  not  how her mom feels about the  day   that matters here ....at all...even a little...or the cheating brother for that matter. How they and everyone else feels on the wedding day is irrelevant \n.",
          "id": 66,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "\"Really? Your day is ruined? I lost a sister and a bridesmaid because little bro broke her heart. He wasn't mature enough to end the relationship properly, and he was fucking this other girl behind sister's back, and now has the audacity to demand I invite the homewrecker who imploded my bridal party and drove my sister bridesmaid away from not only being my bridesmaid but attending the event at all. But please, tell me in detail about how MY actions are out of linea at MY wedding.\"",
          "id": 67,
          "comments": [
            {
              "score": 24,
              "content": "These were exactly my arguments. All she said was \"well, your brother is your actual family and you'll regret not having him at your wedding when you look back\"...",
              "id": 68,
              "comments": [
                {
                  "score": 23,
                  "content": "\"Your sister is your actual family, and you'll regret refusing to attend her wedding when you look back.\"\n\nFixed it for your mother, she's directing her comments toward the wrong offspring",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Which is why he’s still invited (which is generous considering he sounds like an AH and you don’t really want him there).  If he chooses not to go because his affair partner gf isn’t invited, that’s ON HIM.  Obviously NTA.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Nope. You won't",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Yes. But from the mother’s reaction, I think we can see how OP’s brother got so entitled. Mom shouldn’t be thinking that her daughter’s wedding is an appropriate event to be her cheating son’s affair partner’s debut with the family, and also seems heartless with respect to the now ex-girlfriend that they’ve known for years.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "Seriously! It’s not her day to ruin! NTA, op.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1874,
      "content": ">I really don't want her there.\n\nThat's a complete sentence. No need for explanations. Your wedding.\n\nHe can choose not to go, and that's his right, but... again, your wedding,\n\nNTA",
      "id": 74,
      "comments": [
        {
          "score": 584,
          "content": "And if he chooses not to go, the former SIL CAN!!! I see that as a WIN WIN!",
          "id": 75,
          "comments": [
            {
              "score": 201,
              "content": "Or...push it one more notch.\n\nBrother is invited.\n\nSo is former SIL. \n\n&#x200B;\n\nHe can of course not go.",
              "id": 76,
              "comments": [
                {
                  "score": 50,
                  "content": "But if anybody starts any bull while there, they get the boot.",
                  "id": 77,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 26,
                  "content": "Former SIL is super welcome to come if she wants, but she doesn't wanna be anywhere near my brother. Which I understand. And my brother is always in for a party. He won't miss my wedding for the world since all our cousins will be there and two of them are close friends with him, besides cousins.",
                  "id": 78,
                  "comments": [
                    {
                      "score": 22,
                      "content": "Then don't give him a plus 1 and he'll still come to party. (Make it clear that she can't be someone else's plus 1 either)",
                      "id": 79,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "This reminds me of khloe kardashian invited adriana (rob’S ex) to her wedding because Rob cheated on Adriana.. all the girls dancing and Rob become their purse holder",
                  "id": 80,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Make her a bridesmaid 😈",
              "id": 81,
              "comments": [
                {
                  "score": 19,
                  "content": "She already was",
                  "id": 82,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 33,
          "content": "She doesn't want her brother there either. \n\nI say uninvite him, but let mum have a plus one, and she can bring him. It's just formalities but it does extend the fact that even he isn't really wanted there, just tolerated for someone else's sake, and that a plus one can't bring a plus one.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "But you see, psychologically \"really\" means that you can be pressured into something, depending on the tone.\n\n\"I don't want her there, she's not invited.\"\n\nMaybe add \"anyone who tries to smuggle her in will be booted from the wedding alongside her\".",
          "id": 84,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Giving this imaginary award because I don't have an actual one\n\nNTA OP but dont budge you're allowed to have people who are actually important to you\n\nTell your mom you can always cut the brother off if she doesn't back off NOW THAT WILL *REALLY* RUIN THE DAY FOR HER",
          "id": 85,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1189,
      "content": "NTA, in fact, you could disinvite your brother and re-invite his ex and still be NTA. It's your wedding invite who you want.\n\nEdit, want not what.",
      "id": 86,
      "comments": [
        {
          "score": 171,
          "content": "YES. Anyone who thinks its ruining the wedding can also not come.",
          "id": 87,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "That sounds like the way to go, honestly. OP said she is only inviting her brother because her mother would give her a hard time, but her mother is already giving her a hard time so at this point she might as well invite the person she actually wants there, the ex gf.",
          "id": 88,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "Yes! Op, do this! 😂",
          "id": 89,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "This is what she should do. She clearly wants former SIL there more. The people she wants there definitely take priority over someone she doesn’t want there at all.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 549,
      "content": "NTA. Invite whomever you want to YOUR wedding. But your mom telling you that you’re ruining YOUR wedding day FOR HER seems funny af when it’s your wedding.",
      "id": 91,
      "comments": [
        {
          "score": 73,
          "content": "Tbh I think OP would have a better time uninviting the brother so his ex and her friend can come. Mother can F off.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Seems pretty clear who the favorite child is",
          "id": 93,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 502,
      "content": "NTA - so your mom said you're ruining the day for her by not inviting your brother's GF of 3 months?  I guess she supports what your brother did?\n\nAnd your dad and brother think you're a bridezilla for not inviting his GF of 3 months after his actions caused you to lose one of your bridesmaids?\n\nWow.  How are you so normal when your family is like that?  I'd offer to uninvite the lot of them if they keep pushing.  Your wedding is about you and your future spouse.  Nobody else.",
      "id": 94,
      "comments": [
        {
          "score": 138,
          "content": "I'd already be disinviting. Brother for even asking me to bring her, mom for telling me I'm running my day for her, and dad for calling me a bridzilla.  Your outta here ill use the money for catering to hire a bouncer.",
          "id": 95,
          "comments": [
            {
              "score": 39,
              "content": "I can imagine Oprah excitedly telling each of them \"You get un-invited to the wedding! You get un-invited to the wedding! You all get un-invited to the wedding!\"",
              "id": 96,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -11,
              "content": "So, who’s paying?  That’s what matters.  You’re parents paying the lions share, then your wedding is basically their house….and their house their rules.  If you’re paying most of it, then it’s your party, and your rules.  So, which is it?",
              "id": 97,
              "comments": [
                {
                  "score": 3,
                  "content": "Lol no",
                  "id": 98,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Lmao ya im paying for my wedding for the exsactly that reason. My mom, aunt ect will have no say and will not go if they are little sh**s.",
                  "id": 99,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Just elope and then have a big nice reception and spend the wedding money on a really nice honeymoon!",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "It’s almost like it’s her mother big day and not hers.",
          "id": 101,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 304,
      "content": "\"I don't think I'm the a-hole, but my brother and my dad are calling me a bridezilla and my mother is telling me I'm ruining the day for her.\"\n\nWell your cheating brother can just eff right off, his opinion on the matter is of zero importance. Frankly if it were me I'd embrace the Bridezilla title full on by inviting his ex and disinviting him all together. \n\nLet's see how they like *that.* \n\n(Probably don't do that though, stirring up that kind of drama is no way to kick off a healthy marriage, and cathartic fantasy aside, I wouldn't *actually* do that.) \n\nAs for your mother... \"the day\" isn't for her, it's for you, so her opinion doesn't matter much either. \n\nFrankly, your brother has some brass even for considering bringing his cheatsy girlfriend in the first place, but not in a good or admirable way... more like in the \"wow, that's bold, you're an idiot\" kind of way. \n\nNTA",
      "id": 102,
      "comments": [
        {
          "score": 112,
          "content": ">cathartic fantasy aside, I wouldn't actually do that.\n\nOh, but I would. However, I am an AH and a petty one at that. My stance would be, if you keep mention brother's new GF coming to my wedding, you will be uninvited. It MY wedding, not yours.",
          "id": 103,
          "comments": [
            {
              "score": 26,
              "content": "I'd like to think sometimes that I'm a petty AH, but mostly I just play one on Reddit lol \n\nI'm too conflict avoidant irl. \n\nIt's something I've been working on though and despite pissing off certain abusive members of my family, it sure has been good for me to learn how to set strong boundaries and stand by them no matter what. Has strengthened my marriage and my relationship with my kids even. \n\nSometimes, there is a right time, to be a total AH. \n\nOP, this is one of those times.",
              "id": 104,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "I mean, as long as her new husband is on board with it as well then I don't see any problem in disinviting the brother and the parents. 🤷 Bc if there's drama and he's willing to stand next to her through it, or at the very least step aside for her to deal with and at least support her behind the scenes, then her family will have absolutely no ground to stand on and can be ignored if needed.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Ma'am or Sir you are exactly my level of petty and I am HERE FOR IT for this one.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I would absolutely do what you described. But I also don’t care about causing conflict. My therapist tells me I find comfort in chaos 😬🤷🏼‍♀️",
          "id": 107,
          "comments": [
            {
              "score": 8,
              "content": "Well, that can be a strength I suppose, since life pretty much is chaos lol although I imagine it puts a strain on the people around you. : / \n\nIn any case, best of luck on your journey",
              "id": 108,
              "comments": [
                {
                  "score": 8,
                  "content": "It can and has. I’ve been in therapy for it and have made a lot of positive strides in moving that energy towards the right kind of chaos and also learning to sit with the calm. Thank you",
                  "id": 109,
                  "comments": [
                    {
                      "score": 4,
                      "content": "That's awesome! good on you for that growth! \n\nYou're welcome : )",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "Throw the whole family away.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 100,
      "content": "*my mother is telling me I'm ruining the day for her.*\n\nI'm sorry, I thought it was YOUR wedding...\n\nAnd if it is indeed YOUR wedding, it seems YOUR and your future husband's opinions are the ones that count.\n\nEnjoy your wedding\n\nNTA",
      "id": 112,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 93,
      "content": "NTA. Invite his ex and disinvite him entirely.",
      "id": 113,
      "comments": [
        {
          "score": 4,
          "content": "This",
          "id": 114,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 56,
      "content": "NTA. It's YOUR wedding, you're allowed to curate the guest list. Of course, your brother is also allowed to skip it, so don't be shocked if that's the case.",
      "id": 115,
      "comments": [],
      "relation": "Support"
    }
  ]
}