{
  "post content": "I pay for a cleaner to come clean my flat once a fortnight through a company. Usually I never have a problem, I come home to a clean flat. Yay. \n\nToday I got home from the gym and she was still here. Weird, but k. I guess I was early. I sat on my sofa and we talked, she left very quickly. It was only after she left that I realised the panelling of my bath is broken. My landlord was very happy with that phone call. /s\n\nThe company is insured so I’m not losing money, but I’m honestly furious she didn’t tell me about the break. I’m sure it was an accident, but she was in the same room as me and never bothered to tell me!\n\nMy family are telling me to keep her because she usually does an amazing job and this is the only problem I’ve had, that she’s a mother and this is her livelihood. But I don’t know if I could trust her again, it feels like she honestly expected me not to notice the massive hole on the side of my bath.",
  "id": 1,
  "comments": [
    {
      "score": 18,
      "content": "NAH. You're a paying customer and expect a certain level of service. She likely didn't tell you what happened for the same reasons your family is telling you to let it go. I doubt her company lets her go for this, least I hope not. \n\nYou'd be an incredible customer if you acknowledge the issue, talk to her and tell her you're disappointed but understand things happen, and don't want to get her in trouble because this is her livelihood. Ask her to tell you if anything happens in the future, and I'm sure she would.",
      "id": 2,
      "comments": [
        {
          "score": 5,
          "content": "I hope they don’t as well. She does a good job cleaning and she’s really nice. My only problem right now is the fact she didn’t tell me about the damage. She didn’t even message me about it. I really don’t want her to lose her job (although that might happen no matter what I say, I had to call her boss about the damage so their insurance would pay for it.)",
          "id": 3,
          "comments": [
            {
              "score": 1,
              "content": "I hear you, and having your home damaged is a hard thing to just let go. But as you said, she does a great job and (guessing?) nothing like this has happened before. It's worth chatting about, have her present the info to the company to soften the blow, and have them call you to say you're frustrated but understand things happen.\n\nI don't want you to feel guilty for doing essentially the thing I told you to do, but I get the sense you're also looking out for her and I think it could be handled more tactfully to ensure her livelihood is protected.",
              "id": 4,
              "comments": [
                {
                  "score": 3,
                  "content": "I’ve already called the company about the damage. I had to because my landlord needed information about who was paying. I said that it probably was an accident and that all I cared about was it getting repaired, so I think it went ok?",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Sounds like you handled it just fine in this situation. Gotta get it fixed and didn't point a finger, said it was an accident.\n\nHope you don't ask for a different cleaner. Bit of an established relationship with your current person who just had an accident this time and didn't handle it totally professionally. That happens. New cleaner might be worse and less invested, you never know!",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "NAH, but she should have told you about the damage.",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "NAH, but instead of switching cleaners talk to her and let her know to tell you if something like that happens and that you won't get mad. You would be building a relationship with her and it could be more beneficial in the long run. If you still plan on changing cleaners you're still NTA.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "NTA, she should have told you. Her choices have consequences, and this was a huge breach of trust.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "Bro Ik she’s nice and a mom whatever but do u really want someone who is dishonest around your place and belongings when ur gone? Not worth the risk in my opinion",
      "id": 10,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI pay for a cleaner to come clean my flat once a fortnight through a company. Usually I never have a problem, I come home to a clean flat. Yay. \n\nToday I got home from the gym and she was still here. Weird, but k. I guess I was early. I sat on my sofa and we talked, she left very quickly. It was only after she left that I realised the panelling of my bath is broken. My landlord was very happy with that phone call. /s\n\nThe company is insured so I’m not losing money, but I’m honestly furious she didn’t tell me about the break. I’m sure it was an accident, but she was in the same room as me and never bothered to tell me!\n\nMy family are telling me to keep her because she usually does an amazing job and this is the only problem I’ve had, that she’s a mother and this is her livelihood. But I don’t know if I could trust her again, it feels like she honestly expected me not to notice the massive hole on the side of my bath.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH - shes with a service. Its not like you are directly firing her.",
      "id": 13,
      "comments": [],
      "relation": "No"
    }
  ]
}