{
  "post content": "New poster here. \n\nSome background: I (F31) been married for 3 years to husband (M37), we are a mixed race couple. Since before we got married SIL (F31) has been generally unpleasant - for example making snide comments about my job, which she finds v. dull, taking issue with me whenever she visits our home as I always request guests to take off their shoes, etc. Says it’s imposing and I’m treating people like they are dirty. Little things really but quite annoying as these comments keep on coming and we have to meet frequently - she is close to my husband, who dotes on her. I always just shrug off her remarks as feel like she’s just baiting me for an argument and succumbing to that would pretty much lower me to her level. I’ve overheard her telling my husband that she thinks I’m fake cause I’m always smiling. \n\n I recently gave birth via c-section. SIL visited shortly after my baby’s birth, took one look at her, then asked if I was sure if she was my husband’s since she looked “too chocolatey” , and maybe the real dad was black or brown (husband is white). SIL said this before all the other fam members from my husband’s side gathering around the baby. Husband laughed, everyone else fell silent, then she went on and on while she and husband bantered about daughter’s possible dad. I didn’t know what to say, just sort of stared at her in a shocked haze.\n\nAfter everyone left, I told my husband he was an idiot to not realise SIL was insulting both him and me and she was being racist and I didn’t want to see her again - especially not while I was recovering from a hole in my belly and couldn’t even sit up without hurting. I cried and it physically hurt to cry. Husband says she was just joking and I am overreacting by a mile, that I don’t know her like he does and if I was so upset, why didn’t I say anything. I told my family, they were v pissed.\n\nThis felt like the last straw so I banned SIL from our house and from seeing our little girl indefinitely. Husband v. reluctantly delivered the news - I told him it was either that or I’d go stay with my sister with our baby. SIL reacted by crying and saying she didn’t mean to be racist or offensive but since I don’t believe her, I’ve just ignored her. Husband is v. unhappy with me, says I forced him and won’t give SIL the opportunity to apologise, for something she didn’t even know she was doing wrong etc. but I really don’t want to see her. MIL also unhappy, said SIL has the right to see her niece, and being tired has made me unreasonable. Still standing my ground on this, but AITA?",
  "id": 1,
  "comments": [
    {
      "score": 7510,
      "content": "NTA. But seriously, your husband is the bigger problem here. He just sits there, laughs and *participates* when your SIL says incredibly insulting, racist things to you?! That's despicable and he's still telling you you're overreacting instead of trying to make it right. This is a huge issue in your marriage. Your SIL is just the symptom, not the cause.",
      "id": 2,
      "comments": [
        {
          "score": 2674,
          "content": "The thing is, it's only going to get worse.\n\nIf the husband is letting this slide *now* and is refusing to nip it in the bud, who knows what kind of racist crap that child is going to be exposed to, courtesy of his family. That kind of mistreatment leaves real emotional/mental wounds. He needs to wake the hell up now.",
          "id": 3,
          "comments": [
            {
              "score": 1486,
              "content": "That's the problem, the OP\"s husband has always let his sister get away with denigrating his wife and his whole family has no doubt said things behind her back -- which is why is mother has the nerve to run her mouth off about their \"right\" to see and abuse the child.   Her husband never stood up for her, he was too busy enabling his sister.   Now that the OP is a mom, she has no choice but to get these racists out of her life.",
              "id": 4,
              "comments": [
                {
                  "score": 642,
                  "content": "You know what, you're right. Judging by the SIL general disregard for the OP's feelings, talking about her behind her back and other snide little comments, it's clear that the husband never really had her back in the first place. :(",
                  "id": 5,
                  "comments": [
                    {
                      "score": 506,
                      "content": "That’s sad. It’s scary as a black person approaching interracial relationships because you never know which one of the family members are gonna be racist, it’s even worse to realize that your SO is also racist by excusing shitty, racist behavior",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 168,
                  "content": "This. This. And this!\n\nIf I were to give the OP's husband the benefit of the doubt, that he dotes on his sister and she ribs him. That's fine because he's okay with it. It is no longer fine when you are not. He's considering the sister and the mom's feelings but not his wifes. Which is a huge problem.\n\nIf she had a better relationship with you, and you were okay with 'jokes' it would be fine. But even if you were, the second you say enough that's it. Maybe if the baby had come out super white, and she joked, are you sure you're the mom. And then didn't keep repeating the joke it could be funny.\n\nI don't believe it was a joke. I think she knew what she was doing. I think a long talk between you and your husband is needed. If your husband isn't understanding you, counseling is needed.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 122,
                      "content": "Its typical \"missing stair\" bullshit. The sister is probably emotionally manipulative and mean and its been easier for decades to just pretend its funny or whatver and get everyone to just pretend its fine.\n\nYou're right it wasn't  ajoke. Everyone knew it wasn't a joke. Husband is a coward who would prefer to force his wife to put up with insulrs instead of challenging someone else.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 47,
                  "content": "This. Racist-apologists are equally as bad as the racists themselves, and *none* of them deserve to be around that baby and subconsciously teach her to hate herself and her skin. Get rid of them.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Yes this is on point. As a mother of two biracial girls I cannot stress enough how toxic this behavior is.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 98,
              "content": "I agree. It might be time to leave him entirely for a while and let him figure out whose side he needs to be on. If it isn't yours, don't move back. He needs to educate himself on race.",
              "id": 11,
              "comments": [
                {
                  "score": 2,
                  "content": "Yes, that last part is key. He needs to educate himself. The part where you said “figure out what side he needs to be on” needed that caveat because if he chose her purely because she gave him an ultimatum, and he didn’t want to give up his new family and infant child, and *not* because he realized his family is *thoroughly* fucked up, she still has a problem on her hands.",
                  "id": 12,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 88,
              "content": "My dad let my grandmother get away with this type of behavior.\n\nNeedless to say, I wasn't close to either of them.\n\nStand your ground and fully explain your feelings to hubby OP. You'll see what he is made of.\n\nNTA",
              "id": 13,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "Yes. That child is a recipient of their racist attitudes too. SIL and husband both will be trivialising the mother's AND the child's experiences while also subjecting them to racism from within the family too.  Imagine having a father (forget the aunt) who is a racist when you are a POC?!",
              "id": 14,
              "comments": [
                {
                  "score": 25,
                  "content": "Indeed. I've given my (white) mother an earful over much less, because I'm not going to have my non-white daughter grow up hearing casual racism from her grandmother.\n\nNTA obviously.\n\nIn addition, re your MIL saying you're tired. Yes, you are very tired! You've had major surgery, and have a tiny human to look after constantly. This is the exact reason that they should be mindful that your BS tolerance is extremely low, and to cut you some slack, even in the hypothetical situation where they in fact weren't TA. But of course they are here.",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Yep, OP’s husband has an issue with his daughter’s skin color. He’s disappointed his mixed-race child has a darker complexion than he envisioned. His attitude is absolutely sickening, ignorant, and yes racist.",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "“You don’t know her like I do.” So... you always knew she was racist? NTA. Time to have a serious talk with hubby about racism.",
              "id": 17,
              "comments": [
                {
                  "score": 2,
                  "content": "And I guarantee if her husband were to read this thread, his response would be “These people don’t know her like I do. 600 people, who have absolutely zero stake in this, *must* be wrong because if they had any sense they would be on-board with my victim shaming and would consequently question her up the wazoo about why she didn’t push through the physical and emotional pain of a c-section/child-birth to put an end to my and my sister’s flagrant racism toward my newborn child herself?!”",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 248,
          "content": "Ugh not only that the MIL who says SIL has a “right” to see her niece. Bye. You don’t have any rights to this child at all.",
          "id": 19,
          "comments": [
            {
              "score": 80,
              "content": "My grandmother has tried this with me, saying my AH of a brother has a right to be in my child's life and she refused to let it go and kept badgering me so now she is also not apart of my kids life\nOP stand your ground no one has a right to your child but the people who created her and you need to look at what type of influence you want around her growing up\nNTA",
              "id": 20,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "[removed]",
              "id": 21,
              "comments": [
                {
                  "score": 1,
                  "content": "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**",
                  "id": 22,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 131,
          "content": "100% accurate comment\n\nNTA- Your hubby OP is a Y-T-A & sticking up for SL makes him a huge A-Hole & you have every right to keep your baby away from a racist person. As for the M.I.L trying to pass off your feelings to being tired says a lot about that whole side of the family. There's so many 🚩🚩 in your post I'd seriously think about having an all out conversation with the hubby & no one is stopping him from going over to see her but I'd stick to never allowing her back into your home.\n\nDefinitely NTA & congrats on the birth of your baby.",
          "id": 23,
          "comments": [
            {
              "score": 11,
              "content": "This.  NTA and Mazel Tov!",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 124,
          "content": "EXACTLY. This woman just gave birth. She's tired, she's exhausted, she's in extreme pain. This is her big moment to celebrate with the family the occasion for which she's waited nine long months.\n\nCue AH SIL making insensitive, racist and frankly offensive remarks and husband, instead of shutting her down, just ..laughs? At someone implying that OP cheated on him and this is clearly not his child because SKIN COLOR? Hardy har har. They're so hilarious. \n\nIf I was you OP, I'd literally not want to see my husband for a while either. It's not his place to forgive SIL for something she did to you. And to make it seem like you're overreacting on top of that when they're all being racist. \n\nAt the end of the day, it's your kid. Not your MIL's or your SIL's. They can go practice their clown routine elsewhere.",
          "id": 25,
          "comments": [
            {
              "score": 54,
              "content": "Actually, worse than just laughing. Noticed this upon re-reading:\n\n>Husband laughed, everyone else fell silent, **then she went on and on while she and husband bantered about daughter’s possible dad.**\n\nAbhorrent and disgusting behavior.",
              "id": 26,
              "comments": [
                {
                  "score": 8,
                  "content": "Wow, I didn't even notice that part on my first read through. That is disgusting",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "He’s absolute trash in my eyes. Inexcusable. It’d be one thing if he was joking around with his SIL on who the dad is because the child didn’t have the dad’s features (still not okay, still asshole behavior), but to joke about the child not being his because it’s too dark is a whole new low. And the fact that everyone else fell silent only further proves that the husband *knew* it was fucked up as did the sister. I mean, everyone else in the room fell silent. And instead of chuckling and backpedaling to try and save face, the SIL continues *and* the husband joins in? Husband needs to don a trash bag and sit on the curb at this point.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 82,
          "content": "It's probably said further down but it's not just the racist comment it's the fact that she practically implied the wife was sleeping around too, and the husband just laughed that off. Maybe the baby isn't his since you can't produce sperm without the balls he is clearly missing.",
          "id": 29,
          "comments": [
            {
              "score": 5,
              "content": "🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇🥇",
              "id": 30,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Agree. NTA, but you should take a good hard look at your relationship with your husband. If he treats you like this, then how will he treat your child? Or potentially worse, he and his sister might poison your relationship with your child with their racist crap.",
          "id": 31,
          "comments": [
            {
              "score": 1,
              "content": "Certainly won’t poison the relationship with the mother, they’ll poison the relationship with the husband’s entire side of the family, and most of all, the husband for being a shit father who not only never stood up for his child against racist adults, but participated in it since her birth. Also, this is how children of color develop self-hate. It certainly comes from external sources like your environment and the media, but it only strengthens when it’s reinforced by the people who are supposed to love you. These people are gross.",
              "id": 32,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "I completely agree OP is NTA but her husband sure is! It makes me sick because if she would say all of those things in front of OP imagine the jokes she makes when she is not around and her husband laughs at them. I do not understand how some people can’t see the fault in their words and actions. Especially at a time like this when it’s plenty of resources and videos explaining racism. OP I think you have other things to worry about besides your SIL. I hope your c section heals and you feel much better.",
          "id": 33,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "On top of that, she outright stated that OP cheated on her husband! OP is NTA, her husband and SIL are simply for having that entire conversation in front of *family!*\n\nEdit: Corrected for misunderstanding it.",
          "id": 34,
          "comments": [
            {
              "score": 1,
              "content": "Openly stated that she'd likely cheated, and OP's husband just laughed and 'jokingly' furthered that accusation.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "OP, I am so sorry you're going through this. You got insulted during a very vulnerable moment and your husband threw you to the wolves after you just had his child cut out of you.\nYour SIL never had a chance to apologize for something she didn't know was wrong? An 8-year-old would know it's wrong. She KNEW it was wrong. But she didn't care because she has probably been enabled her whole life and never had to face consequences. Besides, if she truly wanted to apologize I'm pretty sure she'd find a way.\nAnd the MIL saying she has the \"right\" to be in your baby's life? Yeah. Guess where the entitlement came from. Nobody has that right, just you and your husband.\nYour husband is the biggest problem here though. He not only doesn't have your back, he is gaslighting you into thinking you're overreacting \"a mile\"? They are all putting the blame on you, after they insulted you and made you cry right after giving birth? That is so disgusting...",
          "id": 36,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I agree....the husband should have shut it down immediately. It's never funny to joke about if someone is someone's parent or not. She was straight up accusing the OP of infidelity! OP is very much NTA while her husband is an asshole for refusing to take her side.",
          "id": 37,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1947,
      "content": "NTA. That’s a super inappropriate thing to say RIGHT NEXT TO A WOMAN WHO JUST GOT A BABY RIPPED FROM THE GUTS. The fact that your husband is just totally fine and defending this behavior is a bigger problem in the long run though.",
      "id": 38,
      "comments": [
        {
          "score": 627,
          "content": "Also ima add on What the MIL said about the “right”. SIL has no right over her niece she has no authority or anything that states she has the right to see her niece i would say OP should put her foot down if not this will get a whole lot worse",
          "id": 39,
          "comments": [
            {
              "score": 94,
              "content": "Arr, tis a bad deal when fam'ly gits in yer dirty laun'ry, yar it tis.  Yer as innoncent as yer wunnerful new babe, congrat-yerlations on'nat.  Bannin yer SIL migh' fine fer the time bein' but ye may 'ave ter soften yer stance in awhile, yar but on'y ye kin dee-side when anuff time gone by, arr.",
              "id": 40,
              "comments": [
                {
                  "score": 78,
                  "content": "I’m not gonna lie i almost had a stroke reading that XD, but i agree",
                  "id": 41,
                  "comments": [
                    {
                      "score": 32,
                      "content": "Aw gramps is off his meds again",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I'm not native English speaker and this post left me so confused..",
                  "id": 43,
                  "comments": [
                    {
                      "score": 21,
                      "content": "“Oh, it is a bad deal when family gets into your dirty laundry [implied family secrets]; yes, it is.  You’re as innocent as your wonderful new baby; congratulations on that.  Banning your sister-in-law might be fine for the time being, but you may have to soften your stance in a while; yes, but only you can decide when enough time has gone by.”\n\n(“Arr” is pirate for umm or uh or other non-words used when the word you want isn’t quite there.)",
                      "id": 44,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "It's written in pirate.",
                      "id": 45,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 1,
                  "content": "I love you",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 48,
              "content": "my brain stopped functioning when i read that.. in what world does the SIL have any legitimate “right” to see her niece. make it make sense 🤢",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "I would say \"If she feels that her brother isn't the father than she definitely has no right and can stay away until she realizes how toxic she is.\" OP is the parent and has every right to keep anyone she wants away from her child. Especially as it gets older and can understand how the words will affect them.",
              "id": 48,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 126,
          "content": "tbh it was SO inappropriate that I kept misreading it. “You mean your husband laughed at her bizarre insinuations, turned to YOU, and you and he bantered about the hypothetical dads you could’ve been getting wet and wild with to embarrass his family into shutting up. Right? ...Right?”\n\nI would have found that cute! OP, If you two were so strong in your relationship and confident where you stand that you could hear that nonsense, think ‘well that’s some BS,’ and shovel it right back, that would be charming. For reddit, anyway. \n\nBut this is...this is your /husband/ being real confident in where he stands, and it’s on top of you. He thinks that he can say what he wants, dance around on your dignity and your physical pain, and not face any consequences.",
          "id": 49,
          "comments": [
            {
              "score": 92,
              "content": "This is definitely not equity.  \n\nI'm a product of an interracial marriage--mom is black dad is white essentially. Before I was born, when my parents went to visit my father's family, my grandmother had a fit about something else, and my mom got caught in the cross hairs and grandmother said some really racist stuff to her.  Was never told exactly what but I can guess. \n\nMy parents didn't visit them again for four years and my grandparents were expected to shape the hell up before their first grandchild (me) could have a relationship with them. \n\nAnd they did. They changed.  They loved me and my brother unconditionally and spoiled us like grandparents do.  And they loved my mother too because they *knew she never needed to forgive them for their awful behavior but my mom did anyway*.  Grandmother realized what she did was wrong and appreciated that my mother did not go no contact for the rest of time, and that she was *lucky* to know me and my brother.\n\nI say all this to say to OP--this was my dad respecting my mom when she encountered racism from his own family.  He acknowledged it, and stood beside her when they had to protect my mom from ugly vitriol from his own mother.  And no, no one on either side of the family had the \"right\" to be in my or my brother's life if they were being awful people, let alone racist. \n\nIf your husband cannot see that this is toxic and disrespectful to you, this marriage is unsustainable unless you think going crazy over time hearing all this stuff is worth it for love.  In my book, it ain't. \n\nP.s. god forbid what the hell is this SIL going to say to your kid when they're old enough to take it in? You have every right to keep your child away from that insidious garbage from day one of her life.",
              "id": 50,
              "comments": [
                {
                  "score": 5,
                  "content": "I agree. I think the husband needs something to help him realize just how bad it was.",
                  "id": 51,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Like seriously though with EVERYTHING that’s happening right now - he STILL doesn’t get that this shit is not ok?!\n\nI think OP leaving might help him wake up but boy oh boy OP should not have to ‘teach’ her husband that OP or their shared child should NEVER be the butt of his sister’s so-called jokes - the racism she and he exhibited in front of his family just cemented to EVERYONE there that it’s a-ok to disrespect his wife and even their shared child is not off limits.\n\nAny love I had for a husband who did this and then attempted to gaslight me into believing I was somehow the one in the wrong would be the death knell for that marriage .\n\nNone of this shit is ok. He NEEDS to go do his own learning - something he should have been doing when the thought of marrying OP entered his head.",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Yup. If anyone does this to you again, make them explain their \"joke\". Pretend you don't get it. \n\n\"Oh so wait the joke is that I cheated on my husband with another man. I dont rely get it whats funny about that?\" \n\nAsk your husband, explain the joke. Which part of \"he is too dark to be your kid\" is hilarious?",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "Even **if** we take all the racism out, in what world is it okay to berate a woman who **JUST HAD SURGERY AND DELIVERED HER BABY** about who the fucking father is?? Like she says she didn’t mean to be racist, but even if we believe that and momentarily ignore the racism, she was still doing something **extremely** vile!!",
          "id": 54,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1198,
      "content": "NTA - As a lawyer, please deliver this message to MIL - there is no legal right to see a niece. If you can’t respect a parent - no right to see their child. Also, no one has the right to tell a person of color what is and isn’t racist. That’s up to you. Your husband is an asshole as well.",
      "id": 55,
      "comments": [
        {
          "score": 13,
          "content": "[deleted]",
          "id": 56,
          "comments": [
            {
              "score": 12,
              "content": "Cool story bro.",
              "id": 57,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Please drop some divorce advice as well because at this rate...",
          "id": 58,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 801,
      "content": "NTA.  Times a 100.  But your real problem is your husband, who joined in the nasty jokes and is now offering excuses for his awful sister.  Also, who are these entitled jerks?  MiL is trying to convince you by claiming SiL has “the right” to see your baby?  I think you and your husband need counseling, to say the least.",
      "id": 59,
      "comments": [
        {
          "score": 186,
          "content": "OP needs a divorce - husband and his entire family of origin (FOO) have shown what racist asswipes they are, and that they value their own racism than their own relationships.",
          "id": 60,
          "comments": [
            {
              "score": 127,
              "content": "OP needs a counselor and her husband needs to read \"between the world and me\".  and if, after counseling (for husband to be clear), and the opportunity to abjectly apologize, he continues to fail, then lawyer.",
              "id": 61,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "That’s fucking extreme. And quite honestly terrible advice. What they need is someone. To help him realize just how terrible he had been by not standing up for his wife, not ruin a relationship.  Now sure, if he can’t get through that then yeah. People can’t just go straight to divorce",
              "id": 62,
              "comments": [
                {
                  "score": 1,
                  "content": "What is terrible is what his sister said. What is extreme is that it was directed towards AN INFANT CHILD and that the father of that child took part in such a disgusting, classless, racist act. What’s more extreme? The husband tried to gaslight his wife into thinking SHE was the problem. Her husband and the SIL are grown adults. This whole scene would’ve made my mouth drop had I witnessed it at age 12. They’re despicable and being that this isn’t a one time instance, that the husband has continuously enabled this behavior, the OP has every right to consider ending the relationship. She is a mother now and has to consider the character of the people not only she, but her child, are surrounded by.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "I would go stay with my sister and really think about whether that marriage was serving me, and what kind of damage that family could do to my child. Op is NTA.",
          "id": 64,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "The SIL also seems like she would be one to brag in the future about having a niece that is a POC. Please cut out toxic people even if the are family. Do what’s best for you and your baby.",
          "id": 65,
          "comments": [
            {
              "score": 1,
              "content": "OR she could be the type to talk about the rest of her family in normal tone, but when mentioning her brother’s niece, feel the need to whisper a disclaimer “*but, she’s black*” and then precede to giggle about whatever she feels she just insinuated.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 327,
      "content": "You should leave your husband for thinking that behavior is even remotely acceptable.\nWho says that about a baby.",
      "id": 67,
      "comments": [
        {
          "score": 291,
          "content": "Forget the baby, who says that about their wife, RIGHT AFTER she had the baby? This kind of reminds me of the post where the husband got his son DNA tested because he was darker than he thought he should be. Also to add craziness is the lady stating that her grandson looks like her husband (his grandfather) so DIL must have slept with him.",
          "id": 68,
          "comments": [
            {
              "score": 45,
              "content": "[deleted]",
              "id": 69,
              "comments": [
                {
                  "score": 21,
                  "content": "I sincerely hope it's a troll, otherwise she's had a serious break with reality. She was talking about doing a DNA test and getting a sample from her husband while he was asleep.",
                  "id": 70,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Don't suppose you have a link for this one?\n\n\nEdit. Found it! \n\n https://www.reddit.com/r/AmItheAsshole/comments/hozdvv/aita_for_telling_my_dil_her_baby_looks_like_my/?utm_medium=android_app&utm_source=share",
                      "id": 71,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "Many people don’t realise that genetics are pretty wacky. There was a black couple that had twin babies and because of some white ancestry way back when, one twin was black and the other was white- like pale, ginger haired. Mixed race babies can look like a mix or can strongly favour one parent. There was an equal chance that OPs baby could’ve been as white as the driven snow.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 320,
      "content": "NTA. You had every right to stand up to your SIL and check her for her disgusting racist comment. It's not funny, period. Keep standing your ground on this matter, she should know that it's not okay to talk like this.\n\nAs a black woman, I would have done *exactly* the same thing. IDGAF, no way in hell would I any kind of bigoted shit to be said about my children. I don't care if it's the inlaws saying it, they can get lost. Contrary to what the MIL claims, they have no legal right to see your baby. The SIL reaction is very manipulative as well, she's basically painting herself as the victim when confronted with the reality of their actions.\n\nMore to the point, your husbands reaction is ultimately the most disturbing thing here. He sat there and laughed at this racist shit? You've just gone through a major operation and you're physically and emotionally vulnerable and he didn't even have your back in this situation? He had the nerve to *laugh* along with his sister? And make you feel bad for standing up to her?\n\nAs your partner and the father of your children, he should be supporting you and defending you, not dismissing your valid concerns. As a white person, he really needs some educating on this matter. Being in an interracial marriage, this is something you guys *need* to sit down and discuss for the sake of your children.",
      "id": 73,
      "comments": [
        {
          "score": 7,
          "content": ">\"...while she *and husband* bantered about daughter's possible dad.\"\n\nHe didn't just laugh along.  He joined in.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Honestly for this sister's sake, she can't leave that baby alone with her husband's family at all. I probably would go as far to even say her husband. I don't know how you can come back from that.",
          "id": 75,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "I would have kicked my husband out of the hospital too! That is disgusting.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 125,
      "content": "NTA.  You, my dear, are the Heroine who just brought a child into this world.  SIL better learn to cater to YOU if she wants to have a comfortable relationship with her brother or ever see her niece at all.  MIL can go suck an egg.",
      "id": 77,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 124,
      "content": "Hell no, your SIL was way out of line. NTA, I am so sorry you were treated this way!! it doesn’t matter if she “meant” to be racist or offensive, her words WERE racist and offensive. I mean the way I see it, she was implying you had an affair. Joking or not, that’s not ok. \n\nGenetics are a weird thing and sometimes we don’t look exactly like both of our parents. I mean both of my parents have dark hair and I have blonde hair but they’re without a doubt my biological parents. Honestly I’m confused and concerned that you’re husband wasn’t outraged that she would imply he wasn’t your daughter’s real dad.",
      "id": 78,
      "comments": [
        {
          "score": 41,
          "content": "Yup. My little cousin is half white Half Haitian and he has dark skin and the only thing that is similar to his white dad is his hair. Genetics are weird af.",
          "id": 79,
          "comments": [
            {
              "score": 9,
              "content": "My kids are half Haitian too. My daughter looks obviously biracial but my son is so much darker especially since they've been spending a lot more time outside.",
              "id": 80,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "Both my parents are dark haired with dark eyes, meanwhile I popped out blonde- my ma says I resemble her female cousin but she was also blonde as a child and we both have heterochromia (hers is more pronounced than mine though). Genetics are fascinating and rarely ever work how you think they will.",
              "id": 81,
              "comments": [
                {
                  "score": 5,
                  "content": "Indeed! I thought that my daughter would get her asian sperm donor's hair, but she ended up getting my caucasian brown hair, with the exact same slight curl. But to a certain extent, some of his mother's chinese features show up more in my daughter than him.",
                  "id": 82,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "Genetics are super weird! My best friend’s son is a quarter black and he looks like he could be full-blooded except for his very light grey eyes. My boyfriend looks like he might be a mix of white and Italian and one of those who tans really easily, but he just did a DNA test. His dad was adopted as a baby and never knew his parents so didn’t know his heritage and we were all shocked to find that my boyfriend is more than a quarter African, specifically Nigerian. \n\nAlternatively, my mom’s entire family always had been told that they were strongly Native American and almost all of them look like it. Dark hair, dark eyes, tan skin, strong cheekbones. I came out super white with blonde hair and blue eyes like my dad. A few of us did DNA tests and there’s not a single drop of anything not white in us. No native. Not even a little bit. All British and Scottish and Irish. Traits portray themselves weirdly.",
          "id": 83,
          "comments": [
            {
              "score": 13,
              "content": "My family did DNA tests (sadly after my Dad had died, so we couldn't test his) and it turned out that I got just about the most Italian genes I mathematically could, and my sister is much more Polish. All our lives, she sunburned and I tanned, and she's got the Polish ankles my grandmother's sisters had. It's amazing how two full sisters (we share 52% of our genes) can have wound up with such weird individual mixes.",
              "id": 84,
              "comments": [
                {
                  "score": 7,
                  "content": "....Polish ankles",
                  "id": 85,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "What are Polish ankles?",
                  "id": 86,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1,
              "content": "White and black are not genetic phenotypes is why",
              "id": 87,
              "comments": [
                {
                  "score": 2,
                  "content": "True! But things like face shape tend to be fairly prevalent along some shared bloodlines ex: the Roman nose. My boyfriend happens to look incredibly traditionally Italian, even though it makes up less than 5% of his genetic makeup. Recessive and dominant traits are cool that way.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I agree with everything you said, except the race stuff.  I think what you are illustrating, is that while genetics make total sense, arbitrary racial categorizations are “super weird”.  Your pedigree determines who you are, and yet if you go back more than about 5 generations your mix of ancestry will be quite different from any one individual ancestor.  I believe the “drop of blood” refers to an old pseudoscience racial theory where you can be “white” and then a “single drop of blood” could somehow taint your whiteness.  As you mentioned it you can have about 1 liter of Sub-Saharan African blood (at least in terms of proportion of ancestry), and yet your ancestry isn’t obvious to an observer.\n\nAnyway, appreciate the thoughtful reply.  I just wish that we a as a society/civilization could move beyond the outdated concepts of race.",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Ngl, I see it as worse than an affair. She accused her of having an affair AND accused her of intending to lie and have him raise her affair baby as his own.",
          "id": 90,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 100,
      "content": "**NTA**   Your husband thought it was a joke to engage in racist jokes with his sister about *his own child*?   And now he is unhappy with you?   At the very least, your husband is a jerk.  He thinks it's important to enable his racist sister and give her an opportunity to give you a fake apology so she can come back with yet another insult to you and your child.   His priorities are messed up, he should have shut her down in the hospital and stepped up to protect you and his child from his sister.    He's proven that he's yet another white man who thinks white people get extra passes.\n\nYou should have dealt with him and this kind of stupidity a long time ago.   You baby should never be exposed to her, even in a group and he should be in counseling to deal with his own enabling of her racism.\n\nWhen you leave his ass, she's going to tell him that's proof that she was right, that you were cheating on him.  Then when you divorce his ass,  he can let her console him as he makes his child support payments.",
      "id": 91,
      "comments": [
        {
          "score": 43,
          "content": "And since she will convince him to get a paternity test, watch as he realizes he destroyed his family on the word of his bigoted sibling.",
          "id": 92,
          "comments": [
            {
              "score": 7,
              "content": "There was a post by a white guy a couple months ago who did exactly this after his wife pointed out that he doted on their light skinned daughter but not their dark skinned son.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 84,
      "content": "NTA and your husband is going to have to learn to recognize racism as your husband and the baby’s father. He doesn’t get to be oblivious to that crap anymore, he needs to step up  and stop enabling it.",
      "id": 94,
      "comments": [
        {
          "score": 80,
          "content": "I'm always baffled by white people who get into interracial relationships and somehow manage to remain oblivious to the racial animus that permeates our lives.   The OP's husband has actively enabled his sister's disrespect for his wife for their entire marriage; thereby emboldening her to become more explicit in her racism.   He has repeatedly turned a blind eye to what's been in his face all along and now, when the OP is fed up, he is *still* more concerned about his sister's feelings than being concerned about his wife and child.   If he can't step up now, there is really no long term future for his marriage.",
          "id": 95,
          "comments": [
            {
              "score": 1,
              "content": "It’d because the mind isn’t that easy. One  can see someone say something and when you have no connection to it, it’s easy to rightfully call it out. The emotion goes to the words , but you create these filters about people you grew up and love and it’d sometimes hard to fully break those. But, I do understand , like... if I was with someone and my brother said that, I’d beat his army loving ass",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "ah jeez that's grim to think about :( you're totally right. if he doesn't step up he won't just be enabling but also actively perpetuating racism in his own family toward his own kid",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "I’d say it’s too late at this point. He’s married with a mixed race child and still doesn’t know. At this rate he’s not going to realize there’s a problem until the child is in elementary school and something happens - and that’s far too late for my taste. There have been way too many opportunities as of late for people to learn more on this subject and do better. Seems like he’s willfully ignorant and needs to go.",
          "id": 98,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "I think there is a difference between obliviousness and extreme willful ignorance, and unfortunately I think OP's husband is in the latter category. I mean, I know people can be stupid, but there are very few people in the world who wouldn't understand that \"this baby is too dark skinned to be yours\" is a fucking outrageously racist thing to say. At best OP's husband just doesn't care enough about racism to do anything about it, and at worst he's racist.",
          "id": 99,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}