{
  "post content": "My mother, I love her great Mom, but we were going out party of 15, we were at her house prior to going out to a chain restaurant and she had a cake she wanted to bring to the restaurant. I said you can't take your own cake to a restaurant that sells desserts. \n\nMy argument, that I told her was that it puts the server in a bad position since most likely it's against the chain restaurants rules, their manager might tell them to cut it off, then they in turn feel like an asshole for having to tell us we can't bring outside food in and then feeling like they are risking their tip, and I think my mother would get upset as well. Just mad inside you know like a Mom.\n\nShe didn't agree, she left the cake we returned after the restaurant and we all ate. My nephew lives closer to the restaurant he didn't want to drive all the way back but still it's just you can't bring outside food is my position only because I think it sucks for the server or a family owned place I definitely say no. \n\nMy Mom was angry at my position. AITA?\n\nEdit: Never knew of a cake cutting fee, just seemed crazy to bring in outside food to a restaurant to me. Kind of like a slippery slope, I don't like Pepsi so I brought a 2 liter of Coke for the party. \n\nI called my Mom said I was wrong and it is fine as long as we call ahead, I apologized.",
  "id": 1,
  "comments": [
    {
      "score": 32,
      "content": "[deleted]",
      "id": 2,
      "comments": [
        {
          "score": 5,
          "content": "Exactly, you ring and ask the question",
          "id": 3,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 20,
      "content": "Info: did anyone call the restaurant to see if bringing a cake was okay?",
      "id": 4,
      "comments": [
        {
          "score": -13,
          "content": "No call just assumed would be against the rules.",
          "id": 5,
          "comments": [
            {
              "score": 16,
              "content": "YTA (slight though) - next time ask. They would have likely allowed it. And wouldn’t care that you’re bringing in your own dessert.",
              "id": 6,
              "comments": [
                {
                  "score": 2,
                  "content": "I like the (slight though). I was ill-informed about current restaurant etiquette. I apologized. She said it was okay. But it's got to make her happy I agreed now she is right.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 0,
              "content": "...well done.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "NAH some restaurants look down upon it, some are totally fine with it and some charge a cake cutting fee of sorts. This is 100% a situation where the best course of action is to call the restaurant and ask. Assuming they would or wouldn’t find it acceptable is lame. Just ask next time.",
      "id": 9,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 6,
      "content": "YTA\n\nIt's very common to bring your own cake and have it served for a cake service fee.\n\nSounds like you strong-armed your mom.\n\nETA: and made your cousin drive all the way back for nothing.",
      "id": 10,
      "comments": [
        {
          "score": 1,
          "content": "He didn't drive back, that was her point was he wouldn't want to drive it back. Really just seemed like it was something people just did and didn't know anything about a cake cutting possible charge. I just thought they would be like no that isn't allowed.",
          "id": 11,
          "comments": [
            {
              "score": 2,
              "content": "Ah, I understood it differently.\n\nThanks for explaining that point.\n\nWhy didn't you trust your adult mom to know?\n\nStill YTA for me.",
              "id": 12,
              "comments": [
                {
                  "score": 1,
                  "content": "I'm an adult also, just she is older and think sometimes older people are just like I'm going to do this bc that's what I'm going to do attitude.\n\nI've worked in a restaurant and I was just thinking this adds like 15 messy plates you stack so both messy on each side with icing and you are kinda of getting a free pass.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 3,
                      "content": "I mention her adulthood more in the sense of 'she's a grown up, why doubt her.\"\nI'm just surprised you've never heard of it,but maybe its not done where you are.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "Just FYI a ton of restaurants let you bring your own cake, just cut it yourself and bring your own paper plates and utensils.",
      "id": 15,
      "comments": [
        {
          "score": 3,
          "content": "Yep, restaurants I worked at did this and even would store the cake in the fridge if needed. Usually they’d offer the server a piece or cake or even give the rest to the staff after. It was a win for us most of the time cause we got cake.",
          "id": 16,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "TIL, will tell my mother I was wrong.",
          "id": 17,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NAH.  I get both points, but I'll say as someone who worked in a ton of restaurants during college: they won't care",
      "id": 18,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 3,
      "content": "NAH. There is a very simple solution to this. You call the restaurant before going or check when making the booking and ask if you are allowed to bring your own cake or not. Some restaurants allow it, others don’t. Some allow it but charge a fee. Then if the restaurant policy allows it you do it and if not you don’t bring your cake or go elsewhere. Simple! No need to have a pointless argument over whether it’s “fair” or not!",
      "id": 19,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited.***\n\nMy mother, I love her great Mom, but we were going out party of 15, we were at her house prior to going out to a chain restaurant and she had a cake she wanted to bring to the restaurant. I said you can't take your own cake to a restaurant that sells desserts. \n\nMy argument, that I told her was that it puts the server in a bad position since most likely it's against the chain restaurants rules, their manager might tell them to cut it off, then they in turn feel like an asshole for having to tell us we can't bring outside food in and then feeling like they are risking their tip, and I think my mother would get upset as well. Just mad inside you know like a Mom.\n\nShe didn't agree, she left the cake we returned after the restaurant and we all ate. My nephew lives closer to the restaurant he didn't want to drive all the way back but still it's just you can't bring outside food is my position only because I think it sucks for the server or a family owned place I definitely say no. \n\nMy Mom was angry at my position. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 20,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 21,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NAH, it's just cake. Why didn't y'all just call the restaurant  and ask a manager what their policy is?",
      "id": 22,
      "comments": [
        {
          "score": 0,
          "content": "I thought it was preposterous but also most likely common. I just thought puts them in bad situation to choose.",
          "id": 23,
          "comments": [
            {
              "score": 1,
              "content": "Worst case scenario they say no. Especially if you make it clear that you’re not changing your reservations if they say no. That, I think, makes it more likely they want to please you. Because instead of having just a good time, you’ll have a great time because they did you a “favor.”",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}