{
  "post content": "So my girlfriend needed to pick up her friend from across town and I had to go with her because her parents knew she had to go with me. My girlfriend's driving makes me SO uneasy. She has already almost hit a pedestrian, and has made some ridiculous driving decisions while I was in the car. All in all, girlfriend sucks at driving, with all due respect.\n\nHer car is outside her parents' bedroom window so her mom can literally look outside and see that I'm in the passenger seat. She wanted to take her own car to put gas in it. I'm okay with my girlfriend driving when there's barely any traffic and especially pedestrians. But at night, everyone is going home and people are out driving like idiots. I told her she can drive another time, and I should drive across town.\n\nBy the way, this friend has her own car and can easily drive, but chose not to because \"she doesn't like driving.\"\n\nMy girlfriend put gas in her car and we were ready to go, and I told her she shouldn't drive at night because it's a bit more risky. She started yelling at me and I got tired of it so I just gave her the keys. On the way there, she cut off a handful of people and the way she stops the car is so bad that I can't take it anymore. She promised me I will drive home on the way home, and she started getting mad at me again.\n\nI don't feel good about her driving at night, because she has a permit and you can tell by the way she drives that she is an amateur. She sometimes strays in between two lanes, and if a cop happens to pull her over, I'm screwed too, since  I'm not old enough to be in the car with us two by ourselves if she is behind the wheel. Now I am the one who gets in trouble too.\n\nI told her and her friend that we picked up and they started ridiculing me. I don't want to break the law when it was easily avoidable, and if I get caught, I would get a hefty fine.\n\nSo AITA for trying to not let my girlfriend drive?\n\nEdit: I am 18 years old. For this to not be illegal, I have to have a license and be over 21 or 25. I’ve had my license for a year and a half, but if we get pulled over, I’m breaking the law as much as she is. I can save myself by playing dumb, but am I really going to do that to my girlfriend?",
  "id": 1,
  "comments": [
    {
      "score": 86,
      "content": "ESH. She sucks, you suck, her parents suck. Don't get in the fucking car with her driving. It's not hard. \n\n>if a cop happens to pull her over, I'm screwed too, since I'm not old enough to be in the car with us two by ourselves if she is behind the wheel",
      "id": 2,
      "comments": [
        {
          "score": 8,
          "content": "if he gets in trouble too is he even old enough to drive at night?  i get the whole terrible driver thing but it sounds like neither are legally allowed to drive at night. ESH",
          "id": 3,
          "comments": [
            {
              "score": 17,
              "content": "Atleast where I am, an adult over 21 with a license has to be in the car, if someone with a permit is driving. It sounds like OP is licensed, but not over 21.",
              "id": 4,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "I’m allowed to drive by myself or with passengers since I have a license. I’m allowed to drive whenever. She’s not allowed to drive at all unless a person of 25 years or older with a license is in the car. Does that make sense?",
              "id": 5,
              "comments": [
                {
                  "score": 5,
                  "content": "ahhh, yes makes sense. for sure she should drive. she’s breaking the law in top of being a really careless driver. NTA",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "BTW, ignorance of the law is not a defense in most places.",
                  "id": 7,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "NTA - He gets in trouble because he's in the car with a permit-only driver. OP is legally allowed to drive at night because he has his full license. He shouldn't even be in the car with her right now.",
              "id": 8,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 16,
      "content": "NTA - I see where everyone is coming from and I'm completely in denial.\n\nI agree he doesn't need to get in the car but when his girlfriend drives like an idiot he'd be worried and want to go with, he wanted to make sure shed be safe and she clearly didn't want anything to do with safety at all so at the end of the day she is the ass here. \n\nMaybe he is a \"teenager\" but he sure has more common sense then his girlfriend who shouldn't even be able to drive nor should she have possession of the keys for endangering peoples lives. \n\nI dont know if you'll read this but I think you should have a serious conversation with her or her parents, and explain she's endangering peoples lives and you're only trying to keep her, and the people safe.",
      "id": 9,
      "comments": [
        {
          "score": 3,
          "content": "Thanks for your well thought response. You probably hit all points to the best they possibly can. I will talk to everyone involved. Thank you!",
          "id": 10,
          "comments": [
            {
              "score": 3,
              "content": "Very welcome :)",
              "id": 11,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": ">>I agree he doesn't need to get in the car but when his girlfriend drives like an idiot he'd be worried and want to go with, he wanted to make sure shed be safe and she clearly didn't want anything to do with safety at all so at the end of the day she is the ass here. \n\nBut how does him accompanying her while she drives make the driving any more secure? Genuinely curious. While he might be able to yell at a danger she didn't see, I'd highly doubt it makes the driving safer, if he'd do any more than that (pointing out safety hazards while driving).\n\n\n>>I dont know if you'll read this but I think you should have a serious conversation with her or her parents, and explain she's endangering peoples lives and you're only trying to keep her, and the people safe.\n\nI agree totally.",
          "id": 12,
          "comments": [
            {
              "score": 2,
              "content": "I see where you're coming from but itll be natural instinct if she (someone he loves) is putting herself in danger.",
              "id": 13,
              "comments": [
                {
                  "score": 1,
                  "content": "Even though it's natural instinct, since it isn't a professional driving teaching car (with pedals at the second front seat), nor is OP a learned (or allowed) supervisor for her driving, the natural instinct just endangers one more person. OP.",
                  "id": 14,
                  "comments": [
                    {
                      "score": 0,
                      "content": "But the thought was still there of his natural instinct, she is in the wrong for this full situation, if she didn't have the stupid idea of going to pick up her friend when she knew whe wasnt allowed to drive without someone there then none of it would have happened. OP is not at fault for natural instincts and trying to keep her safe.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "Why limit her to driving during the day if her driving is that bad?",
          "id": 16,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 8,
      "content": "Info: if you are that concerned about her driving why are you in the car with her at all?  Let alone driving at night.\n\nSounds to me you need to have a serious talk and stop getting in the car with her if you want any hope of her getting the hint.",
      "id": 17,
      "comments": [
        {
          "score": 0,
          "content": "I don't know tbh. I'm scared of her driving but like I had to go with her this time because she had to pick her friend up.",
          "id": 18,
          "comments": [
            {
              "score": 13,
              "content": "No you didn’t? There’s no reason why you HAVE to go with her",
              "id": 19,
              "comments": [],
              "relation": "No"
            },
            {
              "score": -6,
              "content": "I kind of doubt that... if you’re that scared take a bus or Uber or ask a friend.   You sound slightly controlling.",
              "id": 20,
              "comments": [
                {
                  "score": 1,
                  "content": "He sounds controlling for wanting to keep his girlfriend safe? What planet are you on.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 2,
                      "content": "For « selectively » controlling how she operates her vehicle.  I stated that before.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": -3,
                      "content": "Puh-leese.\n\nSo does he need to escort her in public at all times because potential rapists? Does he need to handle all sharp objects because people can DIE?!\n\nGet over it. This isn't a her safety thing. It's a his comfort thing. And if she isn't doing things herself, she isn't improving.",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "Info: If I understand it correctly, you have a valid driving license, but are not old enough to oversee your gf's driving?\n\n\nESH.\n\n\n~~Regardless of that YTA. If you're afraid while driving with someone, don't.~~",
      "id": 24,
      "comments": [
        {
          "score": 3,
          "content": "Yes. I am 18 with a license, but to be a passenger with a driver who only has their permit, you have to be like 21 or 25. I don't know exactly but it isn't 18.",
          "id": 25,
          "comments": [
            {
              "score": 3,
              "content": "Thanks. \n\nSo ESH. As the one with the valid license it's your responsibility to be old enough to oversee someone with a permit.* Nonetheless should your girlfriend never be on the streets without anyone old enough with license.\n\nAnd like I said, if you feel uneasy getting driven by someone, get out.\n\n\n*and you have a responsibility to everyone to minimize the risk in public traffic. If she isn't allowed to drive, then she shouldn't.",
              "id": 26,
              "comments": [
                {
                  "score": 1,
                  "content": "You got something wrong here. To be a supervisor of someone who has a permit, I have to have a license and be over 25. I’m only 18. It’s technically not my legal responsibility and can get in trouble if pulled over. \nThanks for commenting and contributing to the debate. You brought up some good points though.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 2,
                      "content": "But I thought, you'd get into trouble with her at the wheel and only you in the car, wouldn't you? \n\nWhile it may not be your legal responsibility and you can't get in trouble for driving with her, you're only endangering yourself by letting her drive you. And I'm talking moral responsibility for you here.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 5,
      "content": "ESH\n\nYou suck for allowing her or her parents pressure you into allowing her drive illegally.\n\nHer parents suck for allowing her to drive illegally.\n\nShe sucks for driving illegally.\n\nSide note that many insurance agencies will refuse payout and/or consider her 100% at fault in the case of an accident because she is *driving illegally* and the car should not be on the road in the first place.\n\nShe shouldn't be on the road and you need to stop enabling her and her parents to allow her to drive illegally.",
      "id": 29,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "ESH.\n\nLet's be clear. You did not HAVE to go with her. You in the car added nothing to the legality of her driving. With or without you, her driving is illegal unless there is someone 25 or older in the car. If anything, you being in the car is only going to make her driving worse, because now she's getting emotional. On top of that, you're willingly putting yourself in danger by getting into the car with an unsafe driver, while providing no benefit to the situation. \n\nWhere are her parents in all this, beside creepily looking out the window, watching their daughter put her life and the lives of others in danger? Makes them TA too...\n\nIf I were you, I'd be reporting her, because she's a danger to herself and others sitting behind the wheel of a 3,000 pound killing machine...",
      "id": 30,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***The following is a copy of the above post. This comment is a record of the above post as it was originally written, in case the post is deleted or edited. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo my girlfriend needed to pick up her friend from across town and I had to go with her because her parents knew she had to go with me. My girlfriend's driving makes me SO uneasy. She has already almost hit a pedestrian, and has made some ridiculous driving decisions while I was in the car. All in all, girlfriend sucks at driving, with all due respect.\n\nHer car is outside her parents' bedroom window so her mom can literally look outside and see that I'm in the passenger seat. She wanted to take her own car to put gas in it. I'm okay with my girlfriend driving when there's barely any traffic and especially pedestrians. But at night, everyone is going home and people are out driving like idiots. I told her she can drive another time, and I should drive across town.\n\nBy the way, this friend has her own car and can easily drive, but chose not to because \"she doesn't like driving.\"\n\nMy girlfriend put gas in her car and we were ready to go, and I told her she shouldn't drive at night because it's a bit more risky. She started yelling at me and I got tired of it so I just gave her the keys. On the way there, she cut off a handful of people and the way she stops the car is so bad that I can't take it anymore. She promised me I will drive home on the way home, and she started getting mad at me again.\n\nI don't feel good about her driving at night, because she has a permit and you can tell by the way she drives that she is an amateur. She sometimes strays in between two lanes, and if a cop happens to pull her over, I'm screwed too, since  I'm not old enough to be in the car with us two by ourselves if she is behind the wheel. Now I am the one who gets in trouble too.\n\nI told her and her friend that we picked up and they started ridiculing me. I don't want to break the law when it was easily avoidable, and if I get caught, I would get a hefty fine.\n\nSo AITA for trying to not let my girlfriend drive?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 31,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 32,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA. If you feel unsafe with her driving, you have no obligation to be in the car.",
      "id": 33,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Get pulled over she can get her permit suspended too for 6 months.",
      "id": 34,
      "comments": [],
      "relation": "No"
    }
  ]
}