{
  "post content": "My wife and I have a six month old baby girl. She's mostly a SAHM, she works two half days a week and her sister watches the baby. I work full time and go to school one day a week. We've always had an arrangement where she takes care of the household duties (cooking, cleaning, and now baby care) while I happily support her monetarily. Honestly, we are both living our dream life and my wife does an absolutely spectacular job taking care of me and our little one.\n\nOn the weekends, we share baby duty. We usually make sure each of us gets our own alone time to do whatever we want. However, our girl has hit a bit of a sleep regression, waking up every two hours--since my wife breast feeds, she's always taken care of the baby full time overnight. She's a light sleeper and unfortunately has insomnia, whereas I am a deep sleeper and wouldn't wake up for baby cries anyways .\n\nRecently my wife has been asking me to wake up with the baby both days on the weekends so she can get an extra hour of sleep. Baby wakes up around 7am. I get the baby dressed and take over for that hour.\n\nBut sometimes, I want to be the one that gets to sleep in an extra hour. I brought this up to her and she says while she's happy to let me nap during the day, she really needs that hour bc she can't nap like I can. We got into an argument about it, and she said I'm being very insensitive when I know she is very exhausted and cant nap during the day and she struggles going back to sleep every time the baby wakes up. But I'm exhausted too, work wears me out, and school days are long... and I sometimes want the hour in the morning. I don't want to spend my off time napping, I want to play videogames and chill out.\n\nI've gotten mixed opinions on who is in the wrong here, or if there even is anyone in the wrong. AITA for asking us to share mornings off for sleep?",
  "id": 1,
  "comments": [
    {
      "score": 59553,
      "content": "YTA, if she's taking all the night duty because you don't wake up, then you get the morning duty when you do wake up so she can catch up on her lost sleep in the night. You want a morning off, give her a night off.",
      "id": 2,
      "comments": [
        {
          "score": 27672,
          "content": "But… but… video games!",
          "id": 3,
          "comments": [
            {
              "score": 14124,
              "content": "I was so close to giving a N A H because new babies and sleep is hard, but then we got to \"video games\".....  Nope!  YTA OP!  You can't have both nights and mornings.  And your video game time might have to just suffer for a while....",
              "id": 4,
              "comments": [
                {
                  "score": 12129,
                  "content": "My vote for YTA was confirmed when he said he doesn’t want to spend his free time napping. \n\nIf you, OP, did not want to make sacrifices personally, physically, financially, emotionally, and mentally, then you should not have had a child. I hope you get a grip on this and sort out your priorities so that this baby has a healthy 18 years living with you.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3525,
                      "content": "I'm never certain why people choose to have kids and then complain how hard it is. Yah. Like, duh, being a parent is hard. But this is what you asked for. Once you choose to bring a life into this world, that child becomes YOUR world.\n\nEdit: I just want to rephrase what I said, when I say \"complaining\", I mean people who imply or outright say they don't want to be a parent anymore. I suppose it seems obvious to me that parenting is tough work and there's always going to be minor to larger issues that come with it. And I do occasionally sympathize with parents whose situations are not ideal. In OP's case, he just wants to play video games instead of tend to the baby he helped create, and I find that unacceptable complaining.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2266,
                      "content": "I suspect that OP'S wife never gets to nap or stay up late on the computer,  gaming or doing whatever,  as she has to be on call all night and first thing in the a.m at least 6 days a week.  This dude seems to have weekend days free to nap or game or do whatever he feels like.  \"Wah, Wah, I have to get up for an hour to look after my child and it messes up my nap and game time Wah Wah\".  I have done both sides: working full time and being a SAHM for an infant and I can assure you, the SAHM job is 20 times more exhausting.  I also nursed my baby and he was very colicky so he nursed every 2 hrs in the night and didn't nap in the day.  I was totally exhausted as I'm sure your wife is. You try getting up every 2 hrs every single night for a week then stay up all day for 1 week then come back and tell us you deserve to sleep in over your wife.  You should be getting up both mornings and give Jr a bottle so your wife gets to sleep until 10 or 11am. Then when she takes Jr, you should race to the kitchen and cook her breakfast. \n\nI guess everyone knows how I'm voting but just to formalize it YTA!!",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1482,
                      "content": "I was YTA at 'support her monetarily' when she still works half the week while doing all the home duties.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 472,
                      "content": "I also don’t understand how he’s supporting her monetarily when she works two days a week AND is responsible for cooking and cleaning and baby care. My dude is doing well less than he should.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 252,
                      "content": "My husband chooses sometimes to spend his free time playing video games instead of napping. He doesn't care for napping in general and only does it when he's exhausted. I usually choose to nap in my off time but sometimes get caught up in my phone and don't end up falling asleep. We each make our decisions and live with them. In OP 's case, with his wife taking all the night wakings, a single hour in the morning two days a week is the least he can do.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 197,
                      "content": "He doesn't want to spend his time napping because he wants to sleep in and doesn't need the extra nap anyway because he doesn't do overnights.  \n\nHe's basically not losing any sleep, and doesn't want to give his wife, who suffers from insomnia AND does baby care overnight, 2 measly hours on the weekend.  \n\nHe is absolutely YTA here.  Definitely agree with this.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 104,
                      "content": "I'm really not sure what he thought would happen when the baby was born.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 27,
                      "content": "“I want to have a morning to sleep in! Who cares if my wife is exhausted because she’s on overnight baby duty every day and can’t nap like me during the afternoon, I wanna play video games!”\n\nSounds like someone who wasn’t prepared to be a parent - not one that’s equally involved, anyway. Sure, it’d be nice to play video games instead of nap. Why not do that then? Don’t nap! OP should try that for a while and see what it’s like to not catch up on sleep for a while. Alternatively, his wife should get an air horn and wake his ass up overnight every time to baby wakes up. He can see how difficult that sleep schedule is for a while. If he still thinks his video game time takes priority over having a more rested wife - which is better for her health, physically and mentally - then he needs to grow up. He could also pay up for some sort of child care on one day each weekend, so both of them can catch up on whatever they’d like for a few hours.",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "I laughed derisively when I saw \"I don't want to spend my free time napping.\" Dude, if you were legitimately ACTUALLY sleep deprived, you would WELCOME every opportunity for sleep, video games be damned.\n\nSource: have kids. Including twins. My \"free time\" when I wasn't breastfeeding the twins was spent napping. And sleep was all I wanted at all hours of the day and night. I didn't give a flying *fuck* about video games because I was *that sleep deprived.*",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "My vote for YTA was confirmed when I found out OP wasn't the mother.",
                      "id": 15,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 734,
                  "content": "Same. Nothing wrong with liking to play video games but you shouldn’t prioritize it over your spouse’s literal welfare. Plus this is just a temporary phase, so it’s not like he won’t be able to get back to his more usual weekend routine once the baby gets a little older and starts sleeping through the nights again. \n\nSacrifices must be made when you have a kid. And it should be both parents shouldering that load, not just one. \n\nYTA.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 1072,
                      "content": "'My wife wakes up every two hours in the night to feed the baby from her own body and now she's asking for some time in the day to sleep so that she doesn't lose her mind. But what about my video games ☹️??'",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 228,
                      "content": "Exactly. My son is 7 weeks old and my husband works full time while I stay home. I do all the nighttime duties and even pump after I feed him so in total it takes me 1-2 hours to go back to sleep. Only for him to wake in a few hours so I get like 3 hours. On the weekend he usually takes him in the morning so I can rest a little because I too can't nap during the day. I cook dinner, do the dishes, tidy up and take care of our other son after school. He has never asked for a weekend off. We both love video games but we often don't get to play. I know it'll be different as he gets older. This is just how it is in the beginning.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "I get wanting to sleep in on your days off, I really do. However, the first few years of a baby- you don’t get that luxury. Hell, I’ve worked 2nd shift for 18 years, this is the first year I’ve actually been on first. You want to discuss the lack of sleep with an infant, toddler, while also working 2nd shift? I was even a gamer, stayed up playing until 3am and was up by 6am every single day. I was much younger (early 20s) and could swing it. Today, absolutely not lol. However, my son is now 15 and I finally got that luxury to sleep in. 9AM lol. \n\nDudes an YTA.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 148,
                  "content": "My husband pretty much stopped video games at night when the kids were that little. We were both too tired. He would play a bit in the day when they napped or if they were happy watching from a bouncer. When the youngest was 1.5ish we started doing a weekly hangout night where friends would come over to play with us after kids went to bed. When we moved away this turned into a once a week online thing. As the kids have gotten older and more independent his gaming has gone up because we actually have some time to relax now and get every else done, finally. But yeah, during the early months and years those hobbies go to the wayside a bit. And that's ok, that's the way it should be. It isn't forever, even if it's a bit disheartening in the moment.",
                  "id": 20,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Don't forget, his \"mostly\" SAHW does *everything* in their home *and* works 2 half days *and* wakes up every 2 hours with the baby!\n\nThis poor woman. Hopefully this is the wakeup call OP needs.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Even without the video games comment, she's only asking for 2 hours a week. I feel like given everything she has gone through and is going through, that's not a huge ask.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 14,
                  "content": "He says he doesn't want to spend his \"off time\" like that. I wonder what the wife's \"off time\" looks like with her being responsible for all the household tasks, cooking, care of baby AND exclusively breastfeeding. Which is a full time job by itself. \n\nOP, as a mom who was in exactly your wife's position, I can attest to the fact that the extra hour or two of sleep she is asking for can mean the difference between her surviving this stage or having a mental health crisis. Chronic sleep deprivation is no joke. Do you really want the person who is home alone with your child all day to be on the brink of a physical or mental crisis? I am sure she is a wonderful person who would never usually be reckless or cruel, but this scenario is how babies get smothered when mom passes out on the couch, or shaken, or have the house burn down around them because she fell asleep while cooking, or get into car accidents, etc etc. Sounds like you are getting a good night's sleep every night, when is the last time she got one? Probably sometime back in her early second trimester, if she was lucky. YTA, and your wife is never going to forget how you didn't have her back during this extremely difficult time.",
                  "id": 23,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "My YTA came with the “how spectacularly” the wife looks after both the baby AND him. That’s a two-way street in adult-land.",
                  "id": 24,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Really? OP's wife does *all* of the domestic labor and takes care of him (by his own admission), meaning wife gets no time off from her 'job.' It's not equal at all. He needs to pull his weight in household and childcare duties or else his wife will end up burnt out and resentful. \n\nYTA OP, and need to contribute more at home. It should be 50/50 domestic labor when you get home from work or school.",
                  "id": 25,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Yeah, the priority list is:\n\nFamily>work>home>naps>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>video games",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 916,
              "content": "Omg. Exhausted wife wants an hour of sleep due to baby’s sleep regression and her being a milk machine every 2 hours  but I’d rather deny her rest and play video games. WTF",
              "id": 27,
              "comments": [
                {
                  "score": 331,
                  "content": "[deleted]",
                  "id": 28,
                  "comments": [
                    {
                      "score": 24,
                      "content": "This!\nMy husband and I played together a lot before having a baby. And in the beginning he would play only when I said it was ok (like when baby and i were sleepingor when i wanted some stimulance free time, because moms get overstimulated). Later on we would play together when baby was asleep for daytime naps. And in periods where the sleep patterns were f**ed, we just wouldn't play.\nI also breast fed full time and my husband also worked full time. It's a give and take kinda thing, you make it work as a team, but make sure everyones basic needs are met BEFORE you start thinking about your own free time.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "This. When we got old enough, my dad played with us. We loved video games. Dad doesn’t play anymore of course now that he’s hit middle age, but my brother is 20 and plays all the time. Even I played some during COVID quarantine. You can play WITH YOUR KIDS when they get older if they want to. It’s not like dude can never pick up another controller again.",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 165,
                  "content": "Especially because he can probably still play video games while watching the baby!! Damn, dude!",
                  "id": 31,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 49,
                  "content": "But but but he's exhausted too! Because school and work are tiring!",
                  "id": 32,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 23,
                  "content": "But he’s so busy from working to support her monetarily! That’s why she has to take charge of all the cooking and cleaning and baby care, _in addition to working part time._ /s\n\nMy dude, if she’s working part time, she is also contributing monetarily, and you need to do your part in the home.",
                  "id": 33,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "One hour is not enough extra sleep for her. Why the one hour limit? Does he go in and wake her? AH",
                  "id": 34,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 423,
              "content": "Y’all, I don’t know what the hell it is with video games and certain people, but it is like it brings out this inner selfish child in adults.\n\nI know we can make the argument that anything can be treated as an addiction of sorts, but it just seems to be a running theme with video game addicts.\n\nPlenty of people play video games and are perfectly fine, but we also get crap like this post here where an adult loses their mind and refuses to take care of responsibilities because of video games.\n\nIt is like they morph from an adult to a twelve year old or something the second that console comes out.",
              "id": 35,
              "comments": [
                {
                  "score": 218,
                  "content": "When I first started playing WoW, I played with a \"friend\" (and I use that term VERY loosely) who used to routinely get ENRAGED when their toddler would interrupt her by being hungry. I felt so sorry for that kid.",
                  "id": 36,
                  "comments": [
                    {
                      "score": 93,
                      "content": "Awww! I remember the days. When my son was a toddler, I’d play during his naps if I wasn’t going to nap. Sometimes he would wake up 45 mins or 2 hours. The group of gamers I always partied with were awesome. They would even talk to him through the tv because I had a headset but you could still hear chat through tv. \n\nFunny enough, when I quit playing video games, my old gamer buddies friended my son (when my son was older) and play Apex with him. I was like, “ain’t that some shit”.",
                      "id": 37,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "That poor kid :(",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 91,
                  "content": "It really is like that. I think for some people, it hasn't quite sunk in that their life has changed since they were a college student (they have more responsibilities and obligations and can't just do whatever they want anymore) and having their game time interrupted forces them to confront the fact that things are very different now, and not likely to ever be the way they were when they were younger. And a lot of them freak the fuck out about it, because *oh no I actually really preferred being able to do whatever I want, and I can't exactly put the baby back where it came from.*",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "So, I’ve got a theory. There is a pretty large portion of the population who uses video games to “relax“ but a lot of video games are not meant to actually be terribly relaxing. \n\nGames are designed to maximize the time you play them. Many dole out accomplishments (aka dopamine hits) gradually and sparingly. You are intended to grind on them for a while to make progress (looking at you, Elden Ring.) Others are nominally shorter because there are defined bouts, like Fortnight and it’s ilk, but they also require major time to develop skills. There is no “ceiling” to how good you need to get because there is always another skill tier above you, up to pro. Also, even if you are comfortable with the tier you are in, like a slot machine the game is designed to keep you coming back. The wins and losses are often by a hair, so if you lose it’s tempting to try “just once more” so you don’t end with a disappointment.\n\nAs a parent, what you need is efficiency. You need to relax, but you need to spend a short amount of time doing it, and you need to be positive that the relaxation is going to come at the end of it. So a game where you feel frustrated because you didn’t get much done, or a game where you can end on a loss, is a really bad fit.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "The military has called in multiple professionals to mitigate the issue of service men being so enthralled in games that their infant dies of starvation and neglect. Not talking one or two events. It’s a real issue.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 179,
              "content": "Personally I want time to play video games and sleep in and chill out. That's why I'm NOT having kids.",
              "id": 42,
              "comments": [
                {
                  "score": 18,
                  "content": "Exactly. I know I can be selfish and would hate to give up my free time for a baby. So I’m making sure I don’t have a baby. I also spend loads of time playing video games. Which isn’t an issue because my stuff is taken care of and I don't have a baby. \n\nIt’s that easy.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 76,
              "content": "As if playing video games with a cuddly baby on one's lap or in a baby carrier isn't the sweetest part of parenting.",
              "id": 44,
              "comments": [
                {
                  "score": 18,
                  "content": "I played Xbox nonstop while on maternity leave, even mastered breastfeeding while doing it. But once they hit 12+ months, there's no more of that. She was constantly on the move. I cherish those few months we got together just cuddling on the couch all day and night.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "🙄She 6 months old, therefore she’s portable. Put her in a Baby Bjorn and wear her whilst playing video games, FFS. If the noise is too bothersome for her, *you* can wear a headset and play baby-friendly music. \n\nYeah, you’ll have to hit “pause” every so often for bottles and diapers. \n\nBecause let me break it down for you: your wife is waking up every two hours. That means no complete REM cycles for her. That’s going to affect her memory and executive functioning, not to mention her immune system. \n\nYour video game scores can take a temporary hit.",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "The way men prioritize video games over their children and spouses is horrible",
              "id": 47,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1559,
          "content": "this comment is incredibly insensitive. OP spends all day taking care of...checks notes.. his video games.",
          "id": 48,
          "comments": [
            {
              "score": 966,
              "content": "and so is yours. Not only does he take care of video games he's also in charge of chilling out. How could you forget?",
              "id": 49,
              "comments": [
                {
                  "score": 416,
                  "content": "But there was one important information in he commented that you all missed! He makes his own lunch! I mean, how can you expect more from him? /s",
                  "id": 50,
                  "comments": [
                    {
                      "score": 170,
                      "content": "He TRIES to make his own lunch when she tells him she’s overwhelmed, you mean. Clearly he’s overextended himself and is in desperate need of her support. /s",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "That POOR MAN! (Clutches pearls).",
                      "id": 52,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 192,
                  "content": "That's.....(counts fingers)...two whole things. No wonder this poor man is exhausted. I struggle just juggling one!",
                  "id": 53,
                  "comments": [
                    {
                      "score": 18,
                      "content": "This reminds me of the Futurama episode where Bender clones himself to get out of work. \n\nBender: Hey, guys, quit reminiscing and grab me two cigars.\n\nLeft Bender duplicate: One thing each?\n\nRight Bender duplicate: Sounds fair.\n\nBender: Wait. Make that four cigars.\n\nBender duplicates: [in unison] You want us to do four things?",
                      "id": 54,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "wow.  it looks like I'm the asshole.  I've go at lot to think about tonight...while i chill and play video games.",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1492,
          "content": "Oh dear god. YTA. She is up aaaaall night. She does not get breaks like you in the week. She is asking you to get up at 7. A defined time. Go to bed earlier if this is an issue. She is surviving. I doubt she is living her “dream life” if this small request has been so poorly supported by you.",
          "id": 56,
          "comments": [
            {
              "score": 470,
              "content": "I was on paid maternity leave until my kid was six months old and although it wasn't totally terrible, I do not remember it being my \"dream life\"",
              "id": 57,
              "comments": [
                {
                  "score": 495,
                  "content": "B-b-b-but isn't that what all women want? To be run ragged over a newborn and not have their spouse care an inch for their happiness or sanity?!?!   \n/s",
                  "id": 58,
                  "comments": [
                    {
                      "score": 327,
                      "content": "yeah really \"The way she's a light sleeper really works out for us well in that I get to sleep when I want and have energy to do video games with my free time, and SHE gets BONUS free time with which she raises our child because shes awake ALL THE TIME but also has to be awake when Im video gaming and having naps!\"  she made 1 request to help her with a little extra sleep which is already hard for her, after doing all the late night feedings this is so far beyond a small ask.  op is massive AH is this for real",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "Some men have this fantasy in their head that all women just radiate sunshine and positivity every second we are around babies. \n\nNow I adore babies. I’m a nanny and a former preschool teacher. I have over 22 years of experience with kids under the age of 2 and I truly adore what I do. \n\nBut it’s still hard as hell. And I’m only able to be as good as I am at my job bc *it’s my job.* I get to go home and sleep through the night. I get my evenings and weekends to myself. I work about 45 hours a week, and then I’m OFF. \n\nParenting is hard for both men and women- but women end up beating the brunt of it. And then some dads don’t spend enough time with their baby so they don’t know how to comfort them and get them to settle- so if mom is home she hears the crying and eventually just takes over. \n\nIt’s a vicious cycle and I think OP needs to grow the fuck up. Her life isn’t the only one that she be radically different.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "I got 11 weeks paid maternity leave and I was so. Fucking. Happy. To go back to work at the end 😂 granted, I worked part time which was a really good balance for me but GOD DAMN, mat leave is not a vacation hahaha",
                  "id": 61,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 262,
              "content": "Seriously, and it's not like 7am is all that egregious.\n\nLike, yea, it's pretty early, but it's not like he has to be dressed, bright-eyed and bushy-tailed at that hour - he can roll out of bed, change a diaper if needed, have some breakfast and chill with the baby - it's not like 6 month old kids require a lot of running around.",
              "id": 62,
              "comments": [
                {
                  "score": 180,
                  "content": "After a full night of restful sleep no less",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "My first child used to get me up at 5am he is so lucky.\n\nThis guy is a mega AH",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I got stuck on this “dream life” comment also. My first thought: would she agree with that statement? Or is she the one who is busy creating the “dream life” while he is chilling and playing video games?\n\nMy second thought: omg he’s gonna get roasted here!! 🍿",
              "id": 65,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 546,
          "content": "The use name of OP is just \"tired dad\"?! He sleeps every fucking night! Why is he tired? Just because one hour? Maybe his wife should wake him every two hours for one weeks, than he sees what tired is\n\nYTA",
          "id": 66,
          "comments": [
            {
              "score": 238,
              "content": "That is my thinking. She should wake him up with her and the baby at midnight, 2:00, 4:00, and 6:00, pull on his nipples for half an hour each time, then let him go back to sleep for the whopping 90 minutes in between. Maybe he’ll understand why she’s asking for that extra hour. \n\nOP is a massive asshole. Massive.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "\"I'm a heavy sleeper and I just won't wake up when the baby cries!\"\n\nHmm, how convenient.",
              "id": 68,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Even waking him up won’t give him the full experience, since her body is literally making food for their child constantly. \n\nYTA OP. My god, YTA.",
              "id": 69,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 8,
              "content": "You seriously haven't tried being tired in any way, shape or form if you have a baby and still manage to sleep all night.\n\nAnd the baby wakes at 7. Give me a ducking break! Get back to me when you're kid's done sleeping in and decides to wake up at 5 like all other babies.\n\nI just can't with this guy doing absolutely nothing around the house and just about nothing baby related, and yet he has the audacity to whine about looking after his kid so his wife doesn't drop dead from the stress she's under.",
              "id": 70,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 445,
          "content": "[deleted]",
          "id": 71,
          "comments": [
            {
              "score": 44,
              "content": "If I had an award I would give it to you. That hour she is asking for isn't a want. It is a fkn necessity.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 410,
          "content": "My ex tried this with me and it was my psychologist that gave him the come to Jesus talk - that in her experience the number one thing that contributed to post natal depression was lack of sleep. More sleep would immediately alleviate symptoms. \n\nOP step up. Take the mornings. YTA.",
          "id": 73,
          "comments": [
            {
              "score": 73,
              "content": "This is still validating to read.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "I am so grateful to have had access to a psychiatrist through a reproductive mental health clinic near me, she approved all my meds as pregnancy/nursing safe and told me how important sleep was. We combo fed our kids from day one just to make sure I got solid sleep breaks.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 410,
          "content": "Couldn't agree more. I've been in ops partners situation. I can't nap while my partner can and the lack of the occasional sleep in after being up all night nearly killed me. \n\nDo better op",
          "id": 76,
          "comments": [
            {
              "score": 114,
              "content": "Me too. My husband and his entire family can sleep on a chicken’s lip at a moment’s notice. So can our kids now they’re grown. I can’t. He says I try too hard. Honestly, between the in-laws and now the cousin’s partners (my kids’ generation) it’s a standing joke that the family all sleep while we’re still awake. So he gets to catch up on sleep during a weekend afternoon or early evening after work, while I’m awake from dawn till dusk",
              "id": 77,
              "comments": [
                {
                  "score": 68,
                  "content": "On a chickens’s lip? I’ve never heard this expression. All I can think about is buddy the elf saying “what’s a chickens lip? I want one!”",
                  "id": 78,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 31,
                  "content": "a chickens lip, that's amazing! lol new favourite saying. Right up there with my coworker describing someone as \"looking like a fresh stick of gum\" meaning they were all fancied up lol",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 23,
                  "content": "I tell my husband that he has an off switch in his butt because he can sit down and go to sleep instantly. I only nap if I am sick or utterly exhausted",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 373,
          "content": "Right? He gets to sleep all night uninterrupted 7 days a week and he thinks he is deserving of sleeping in an extra hour on weekends while his wife wakes up at least every 2 hours all night every single night of the week?",
          "id": 81,
          "comments": [
            {
              "score": 36,
              "content": "But, but, but….he cAnT wAkE uP fOr bAby CrIes",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Exactly. He’s having a full night’s sleep every night. Why does he need a nap? And why does he not get that when she’s awake every 2 hours every night, that one extra hour is the bare minimum he can give her.",
              "id": 83,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 354,
          "content": "YTA. Having a baby is not a time of your life for having time for yourself. All of your energy needs to go to your baby, your spouse, and your home. If that means you have to give up video games, that’s what you do. You are now a parent. Once everything is taken care of, and that includes laundry and dishes, then you can sit down and play video games.",
          "id": 84,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 323,
          "content": "Her: I wake up to feed the baby multiple times a night and never get to sleep for more than 2 hours at a time, can I please have one extra hour of sleep 2 days a week?\n\nOP: No you can't. My 8 hours of uninterrupted sleep isn't enough, I need more. Also, I need video games more than you need sleep. You're supposed to be sleep deprived, fuck you [wife's name]. This is your dream life, why are you so ungrateful?\n\nFucking..... \n\nYTA",
          "id": 85,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 16029,
      "content": "YTA - You don't think she wants to just chill out and do something on her own time? She's working too by not just going to work, but also taking care of the baby. The least you could do is give her some time to sleep in. She's right; you can nap and do whatever, she can't. And unless you're going to offer to take over the feeding through formula, the ONLY time she gets a break is if baby is sleeping or she's off to work.\n\nGive up your extra hour of sleep; give it to your wife, who does so much.",
      "id": 86,
      "comments": [
        {
          "score": 3833,
          "content": "These rigid division of duties seem silly to me. If you see something that needs to be done, and youre right there, do it. Throw in load of laundry or get it out of the dryer and fold. See a weedy flower bed? Take care of it. Make a salad to go with dinner. Miss some gaming times and let your partner sleep in some mornings.",
          "id": 87,
          "comments": [
            {
              "score": 2308,
              "content": "Counter argument: For a lot of people, anything short of a defined division of responsibility results in them feeling 100% of the mental load even if they aren't doing 100% of the physical load. \n\nFor example, until my husband and I defined \"shifts\" for getting up with our then-newborn, I would wake fully every single time baby would cry. Half the time my husband would be the one to get out of bed, but I'd be laying there thinking, \"is he getting up? Or should I? Who has done it more?\" And then when he did get up, I'd lay there and think, \"I feel guilty now that he's up, maybe I should have done it.\" And I wouldn't get back to sleep until he returned to bed. It was awful. But once we had shifts, I could open one eye, check the clock, go \"not my problem\" and fall immediately back to sleep. We both got significantly more sleep when we knew what was expected of us then when we tried to avoid hard schedules. \n\nWhen you have a very limited amount of time and energy and a LOT to do, you're in a constant mental battle of \"what should I be doing right now?\" Which means you can never truly relax. When you know what is expected of you, you can decide how to prioritize to get it all done.",
              "id": 88,
              "comments": [
                {
                  "score": 539,
                  "content": "We do something like this - if its hubby's job, I stay out of it, don't even think about it (unless its super behind).  This legitimately reduces my mental load; I don't have to hound him to do dishes - thats his responsibility, he'll take care of it.",
                  "id": 89,
                  "comments": [
                    {
                      "score": 446,
                      "content": "We use the Fair Play Cards (a literal deck of cards with all the physical and mental tasks of running a household) to make sure our workloads are roughly even and that we're clear on responsibilities. \n\nMy husband now has the \"cleaning\" card. That doesn't mean I don't clean - I actually enjoy scrubbing and wiping things! - but him having that card means I *don't* walk around the house thinking, \"that needs to be dusted, that toilet looks grimey, those stairs need to be swept.\" I can walk around blocking out all the dirt and wait for him to say, \"honey, let's set aside a couple hours on Saturday for a deep clean.\" It has improved my life and enhanced my enjoyment of my home tremendously!",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "[removed]",
              "id": 91,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1464,
          "content": "Not only is she working, but she is enabling OP to work by providing childcare -for free- for their joint child which he would otherwise have to partially pay for. But no, he \"supports her monetarily\". She's supporting you asshole",
          "id": 92,
          "comments": [
            {
              "score": 1473,
              "content": "Exactly. Married fathers' promotions are built on unpaid labor by mothers.",
              "id": 93,
              "comments": [
                {
                  "score": 304,
                  "content": "I don’t think I’ve ever heard it put more succinctly than you just did. I wish I could upvote this more than once.",
                  "id": 94,
                  "comments": [
                    {
                      "score": 51,
                      "content": "I’m reading “Invisible Women” and the book talks a lot about this. Like I need to get regular breaks from it because it often has me *seething*.",
                      "id": 95,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 263,
              "content": "And she does all the cooking and cleaning. What does she even need him for?!",
              "id": 96,
              "comments": [
                {
                  "score": 239,
                  "content": "He even said she takes care of HIM and the baby. Sir, she is not your mother. Take care of your own damn self!",
                  "id": 97,
                  "comments": [
                    {
                      "score": 35,
                      "content": "TAKE CARE OF YOUR OWN DAMN SELF!",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "She’s also the live in maid and cook.. I’m failing to see the equity in any of this arrangement. 🙄",
              "id": 99,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 415,
          "content": "“When she’s off to work”\n\nAND YET HE SAYS HE CONTRIBUTES MONETARILY IN EXCHANGE FOR HER DOING ALL THE CHORES AND BABY CARE. \n\nIf she is working part time, then OP can’t pretend he is funding their lifestyle and exempt from house work!",
          "id": 100,
          "comments": [
            {
              "score": 12,
              "content": "Right? SAHM where?",
              "id": 101,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 281,
          "content": "Anyone who thinks their stay at home parent partner does less work than them because their job is at home is automatically TA in my mind",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 278,
          "content": "Exactly this! She wakes up all night to breastfeed while he is sleeping. It is selfish that the two days that he is able to help he complains about not getting the extra morning sleep & losing video game time. The audacity is wild!",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 256,
          "content": "The woman works 24/7. Responsible for all the domestic and child care work except for the the days when she goes to a job and works there, then comes home and works overnight to fed and care for her child and this man can’t give her an extra hour of sleep? She’s not even really sleeping in, if he’s up at 7, she’s up by 8. That’s a very little ask. I’d assume guy is sleeping in way later than 8am if she’s up with baby. The lack of empathy or even attempt to understand her pov. YTA. Do better dude. Like try take the baby out of the house for a weekend morning, a walk or visit with family/friend, and let the woman sleep.",
          "id": 104,
          "comments": [
            {
              "score": 34,
              "content": "I'd bet money he has never taken the baby out alone, or even been home alone with the baby.",
              "id": 105,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 195,
          "content": "What you mean \"her own time\"? Doesn't seem like she has any.",
          "id": 106,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 46,
          "content": "The poor woman probably hasn’t had a decent night sleep in a year between pregnancy and baby.  And he’s worried about video games",
          "id": 107,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 39,
          "content": "And he’s already doing none of the household chores.. he’s living a peachy live, getting taken care of like a child.",
          "id": 108,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "So much this! Their arrangement already seemed tilted in OPs favor... and now baby is up constantly at night and OP thinks this is a reasonable ask?!? He wants to play video games and is upset that his wife is advocating for herself **for a basic need of survival**. Good gravy YTA OP. I'm not sure how he thought this might go well for him",
          "id": 109,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 14147,
      "content": "I needed night time support from my partner when my child was a newborn. He didn't take it serious and it took more effort from me to wake him up to help than it was to just do it myself. I stopped feeling like a human. The resentment never went away. We divorced when the kid was 2.",
      "id": 110,
      "comments": [
        {
          "score": 3928,
          "content": "I felt like a zombified cow for ages. I feel this in my soul",
          "id": 111,
          "comments": [
            {
              "score": 1604,
              "content": "I feel the term “zombified cow” in MY soul, and now I have an appropriate description for my life. Thank you.",
              "id": 112,
              "comments": [
                {
                  "score": 47,
                  "content": "I'm here to tell you it gets so much fucking better. \n\nIf you had told me five years ago I would be living my ultimate dream that died LONG before my baby was born, I would NEVER believed you. But I am. And it's the best part of my life. I HAVE a life, outside my house. And it's filled with little souls I get to nurture and encourage and love, without going through the he'll stage ever again. AND I GET TO USE MY REAL SKILLS. It gets better. Promise.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 934,
              "content": "Indeed. I spent the first two years of my son's life in a perpetual daze of \"I know I've forgotten SOMETHING\" and just telling myself that as long as I hadn't lost the kid, the house, or my job, everything else was small potatoes.",
              "id": 114,
              "comments": [
                {
                  "score": 276,
                  "content": "I have 3 under 5 so I've spent most of the last 5 years like that, I don't know if it will ever come back.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 186,
                      "content": "It gets better. Once your youngest hits around 5.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 148,
                      "content": "You will. And you'll forget how exhausted you were. I mean, you'll 'remember' it was bad, but 20 years later and the exhaustion is different. Not quite as bone-penetrating.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "Our brains are permanently physically changed by pregnancy and birth. Mom brain is an actual scientific phenomenon. It... doesn't get better, but you get used to it? I develop coping mechanism for it like I do for my ADHD, because it doesn't get better, you learn to manage it better.",
                      "id": 118,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "It will get a lot better. Promise. I also had three under 5 at one point and my second cried nonstop for over a year. They are now tweens/teens and life is so much easier. It’s hell when you’re in it but it gets a lot easier when they are older.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 107,
              "content": "It's been more than 20 years, but I still hear the relentless whir-whuuuurr of the breast pump, echoing away as I sat in the storage closet.",
              "id": 120,
              "comments": [
                {
                  "score": 36,
                  "content": "For me someone says the word “mastitis” and it’s like my boobs seize up and I feel like I’m going to puke",
                  "id": 121,
                  "comments": [
                    {
                      "score": 19,
                      "content": "No…. Not MASTITIS!!!!! I had it 5 times with my middle son. My milk was green. And then he’d get thrush… \n\nYeah. That sucked.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "You got a storage closet? I got a roach infested decommissioned gym shower. I once had to call my boss to come kill a roach that was repeatedly charging at me while I was hooked up to my pump.\n\nAfter that, they allowed me to use my bosses office instead, as long as I didn't lock the door. Who could have seen it coming when the head of our division walked in without knocking while I was in the middle of pumping?",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "The breast pump sounded like it was saying “pink belly, pink belly” over and over again in my sleep deprived, NICU haze.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "10 years.  I've been awake for 10 fucking years.",
              "id": 125,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "My impression of milking cows is that you hook them up to the machine or milk them and the milk just geysers out of them. Whereas breastfeeding was a fucking brutal coal mine of misery with trying to not have bleeding nipples and never knowing if your newborn is getting enough milk. Self-flagellating zombie cow?",
              "id": 126,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "My sister was definitely feeling the zombified cow thing when her baby was new. Our parents tried to help out as much as they could but she was still dragging. I switched to night shift work (which actually works out better for me and my delayed sleep cycle) and on my nights off I went and chilled with the baby so my sister could sleep. It was so rewarding to spend that time with my nephew and to help my sister out in a way no one else could. Now baby is sleeping through the night all on his own but I’m still “on call” if he’s sick or something on my weekend so my sister can get some rest.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Neither my 3.5 year old or my 9 month old sleep through the night. The description definitely feels accurate.",
              "id": 128,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 2412,
          "content": "Ditto!  I was so tired, I'd burst into tears if I couldn't find something at the supermarket.  My family was out of state so I had to depend on my husband.  He took weaponized incompetence to a a whole new level.  It was less stress and work just to do it myself.  \n\nI dropped the 220 pounds toddler a few years later.",
          "id": 129,
          "comments": [
            {
              "score": 709,
              "content": "My partner is great and we split sleep 50/50 and i still feel like I wanna die of exhaustion sometimes. I can’t imagine what OP’s wife is going through.",
              "id": 130,
              "comments": [
                {
                  "score": 180,
                  "content": "Same here. I do nighttime feedings, he does nighttime diaper changes and getting baby back to sleep if necessary. I still sometimes feel like I’m going to fall asleep at work.",
                  "id": 131,
                  "comments": [
                    {
                      "score": 168,
                      "content": "What worked for us was shifts + bottle feeding at night. I took 10pm-2am, husband took 2am-6am. If either could get to sleep before 10 or sleep after 6, that was just extra sleep time. That meant we each got at least 4 hours of uninterrupted sleep. If we hadn't established that system, I would have died. Probably by falling asleep at the wheel on the way to work.\n\nI do remember one particularly bad week when the baby was really sick. I hadn't slept in days. I went to work and there was a hotel within walking distance. I spent the whole day staring out my office window at the hotel, picturing their beds and debating just going to get a room and sleep. Ultimately I ended up sleeping in the backseat of my car for an hour.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 83,
                  "content": "My partner and I do different shifts so we both get pretty much uninterrupted sleep. My partner has always been a night owl, going to sleep around 6am, so he takes the baby all night whilst I sleep. He only wakes me if he really needs a hand (like if a bottle is taking too long to warm up so he asks me to breast feed).  Then I’m the morning I take the baby whilst my partner sleeps the normal time he’s used to. We kinda just split the afternoon between us then.",
                  "id": 133,
                  "comments": [
                    {
                      "score": 37,
                      "content": "Not gonna lie, wanting to do shifts was a... not insignificant part of why I wanted to do formula feeding. It didn't help that I had a c section, so my milk took forever to come in, and baby had difficulties latching, but somewhere around 2 AM in the second week when I just could not get the screaming baby to latch I realized that actually, formula IS worth my sanity and sleep. The midwives weren't happy, but, eh. They aren't here at 2 AM.\n\n\nOur system is pretty much like yours-  husband does night shift until 5 AM on weeknights, and I do 5 AM until he finishes work. He's lucky enough to have a super flexible schedule, so he stays up all hours gaming with the monitor next to him and I get some sleep, then he sleeps in until 10:30 or so before work. I'll often take a wake up or two before 5 if he comes to bed earlier (that usually means he needs the sleep), but we figured if he was going to be up all night gaming anyway he may as well be on baby duty.\n\n\nWhat do you do on weekends? Same thing?",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "That's exactly how I feel when reading this. I have a great husband, and it was still really, really hard. I can't imagine being in this situation. I would have broken.",
                  "id": 135,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I dealt with this too (military spouse). No help from family and my husband was 0 help. We are in the process of divorcing now and I've moved in with family. The help and support I have now has literally made me cry. I wish I had left so much sooner and had help with them when they were babies.",
              "id": 136,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 652,
          "content": "My husband made getting support from him as difficult as possible, because he knew that would make me stop asking for it.  He was right, I stopped asking.  And then I realized if I was doing everything myself, I might as well do it for one less person.  We divorced when the kids were 1 and 4.",
          "id": 137,
          "comments": [
            {
              "score": 221,
              "content": "These stories break my heart. Marriage and parenting are partnerships. It kills me to read these stories where one member of the team just doesn’t get it.",
              "id": 138,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "My SIL found out about a year ago that my brother's job \\*does\\* offer paternity leave, but he elected not to take it. They're divorcing.",
              "id": 139,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 611,
          "content": "I could never get my ex to understand how much work a baby and a household were, and I was also working full-time. I divorced him when the baby was one.",
          "id": 140,
          "comments": [
            {
              "score": 225,
              "content": "Holy shit, working full time AND raising a baby AND looking after the household? I work full time and split household chores with my husband and that leaves me exhausted so fair bloody play to you - I'm glad you divorced him!",
              "id": 141,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 174,
              "content": "I was working full time (with a one hour commute each way), going to school full time, and raising a newborn/toddler. Cherry on top was that my husband was in the military so we were 3000 miles from family and friends, I was completely on my own. Birthed my daughter alone while he slept and refused to wake up. The damage done to my brain is irreversible, I used to be witty and intelligent, read books and got straight A's. Now I can hardly string a sentence together without forgetting what I was saying, which is severely affecting my job. \n\nMy doctor actually ordered an MRI that showed severe, deep white lesions all over my brain which are common in severe PTSD/depression cases. I still can't drive on highways without having a panic attack because I fell asleep so many times while going 85mph down the road. Drove off the road a few times but thankfully never crashed into anything. My husband made me wake up every time with her even though she was mostly formula fed, I took her to and from daycare (which was on the military base he worked at), and he still played his video games in the evening after work. I stayed up past 2am most nights doing assignments for school. I am broken beyond repair and my daughter will never have a sibling because of it.",
              "id": 142,
              "comments": [
                {
                  "score": 54,
                  "content": "Holy fuck. Fuck that. I hope he's an ex.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 53,
                  "content": "I’m so sorry.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 28,
                  "content": "I’m so sorry, and I hope this turd is gone and no longer draining you of your spirit. You deserve so much more than this. I hope you know that. If you’re scared of going it alone, believe me, it will be 1000X EASIER without the burden of him. Love and strength to you.",
                  "id": 145,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Oh man. I hope things get better for you. This made me so sad to read.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 111,
              "content": "Yep. Working full time, did all the meals, all the laundry and chores, and 99.5% of the childcare, (including of my stepson). Leaving him made me human again. And I don't model that being unloved and devastated is acceptable.",
              "id": 147,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 314,
          "content": "Same girl. Same. Except I put up with it through 3 children. We divorced last year and my girls are ages 2, 4 and 5. He would throw such a fit and be so nasty after I woke him. It wasn’t worth it. I did 100% of the childcare and paid for 100% of our living expenses from my savings while he played video games and got high 24/7 as he refused to get a job. Shit, I had to have my sister come watch the girls if I even wanted a shower.",
          "id": 148,
          "comments": [
            {
              "score": 102,
              "content": "Wow! I’m glad you divorced him! He sounds like a loser. He didn’t work for the whole 5 years you guys had kids?",
              "id": 149,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 197,
          "content": "Just yesterday I fell into a half sleep-walking state while watching the kid. I found myself literally dreaming *while* being able to hear everything around me, and answering the toddler when he talked. I’ve never been so tired in my life. Feeling like an inhuman zombie is the only way to describe it. \n\nOP is TA.",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 159,
          "content": "My newborn is 5 weeks today and this is exactly how I feel. It is more work and more stressful waking up my husband to help. He’s extremely grumpy and irritable and it makes the whole feeding session miserable. Like, get over it. I HAVE to wake up every three hours to pump regardless if he gives our son a bottle during the feeding session. It’s causing a lot of resentment because he goes downstairs to sleep on the couch and gets uninterrupted sleep…",
          "id": 151,
          "comments": [
            {
              "score": 174,
              "content": "And reading these stories is why many young women don’t want to get married or have kids. The women subs are filled with this while the male ones just worry about things that aren’t life threatening.",
              "id": 152,
              "comments": [
                {
                  "score": 62,
                  "content": "THIS. I for one am glad every time I hear of another woman my age who doesn't want kids and doesn't want to deal with men anymore, let alone get married. I got lucky with my husband, who is a true partner, but the odds are certainly not in our favour. And then some men have the nerve to also abuse, rape, and murder us? And call US shallow and petty and self-centred? Like?????",
                  "id": 153,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 27,
              "content": "Yeah my ex would go downstairs to get uninterrupted sleep in the guestroom...even on nights when I worked the next day and he didnt. He NEVER once had one of those nights where you rock the baby to sleep after a feeding, pacing endlessly back and forth in the hallway.",
              "id": 154,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Then this is when you need to decide shifts and stick to it. Don't care if he's grumpy, he's waking up. \n\nIf you don't sort this now it will get worse",
              "id": 155,
              "comments": [
                {
                  "score": 25,
                  "content": "He works 10 hours shifts 4 days a week. So we do shifts on his days off, but not on the days he works. And even then, he’s so miserable during the nighttime feedings it’s almost not worth it to wake him up. He better be grateful because once I’m back to work there will be no more “well I’m going to work so I can’t take a nap whenever like you can” excuses, he’ll have to help for night feedings. I’m also the main wage earner, so it’s important I get adequate sleep so I don’t lose my job.",
                  "id": 156,
                  "comments": [
                    {
                      "score": 23,
                      "content": "smh, he already sounds like a freeloader, unfortunately.",
                      "id": 157,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I have a 6 week old and it's exhausting. My husband started taking a night feed for me so I could get a longer chunk of sleep. Instead of pumping during that time, I pump after my next feeding session. I'm not sure how great that is, but my supply has been fine and I think I've only woken up engorged a few times. Having him take the 4am/5am feeding has helped me feel a little more human.",
              "id": 158,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": "Same, there is a reason he's my ex partner now.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "This makes me angry for you!! The weaponized incompetence boils my blood!!",
          "id": 160,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 47,
          "content": "Like your ex, I also don’t wake up easily (diagnosed hypersomniac). That’s why once I do wake up, I take over the baby duties as soon as my wife and I are sure I’m past the point where my body will fall back asleep.\n\nI make sure that my wife gets a similar amount of sleep (if not an hour or two more since her sleep through the night is often broken). I also go to bed extra early on weekends so I can more easily get up in the middle of the night. \n\nOP, YTA. I want to play games and chill too, but that’s not a priority for a while anymore. I’ll take it where I can get it, but it’s WAY more important that me and my wife get adequate sleep so we can stay sane and handle the unexpected times where sleep is extra elusive.\n\nOnce your baby girl gets a bit older and sleeps through the night or a little extra longer in the mornings, then you’ll start to get a bit of time here and there. Until then, do everything you can to make sure you and your wife are both as rested as possible.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10781,
      "content": "RIP OP\n\nYou're going to be buried in the YTA judgements here.\n\nShe works PT, takes care of baby, has to do all the housework, has to do all of the night feedings, can't sleep.... but sure, you'd like an hour.\n\nYou are out of the house all week, and you do what, spend one hour a day \"helping\" to take care of your kid? And would like more time to play games?\n\nYou have no idea what her day looks like, do you? Take three days off, and send her on a mini vacay to sleep somewhere, and see all the stuff that she does on a daily basis, on repeat.",
      "id": 162,
      "comments": [
        {
          "score": 1650,
          "content": "I remember that age. I would have liked more time too. I might have used it to shower or gone to the loo alone!  For what it’s worth, I breast fed our babies, hubby got up, changed nappies, brought them to me in bed for feeding, then took the baby back to its bed. Sometimes I barely registered it was happening. \n\nDo better OP.",
          "id": 163,
          "comments": [
            {
              "score": 722,
              "content": "I literally pinched a loaf, pulled my pants up to my thighs, carried her to him, plunked her down, and went back to finish sh!tting. I will never forget that and so many other moments. I can’t believe I have to prod my child’s father to interact on Christmas morning. These men are so tuned out. We need to start expecting more because we deserve more.",
              "id": 164,
              "comments": [
                {
                  "score": 209,
                  "content": "Absolutely we deserve better. Their children deserve better. I hope things get easier for you.",
                  "id": 165,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 58,
                  "content": ">We need to start expecting more because we deserve more.\n\nThat's why I'm glad every time I talk to a woman my age or younger who is childfree and happily single. There aren't nearly enough good men out there worth reproducing with. It should not be compulsory.",
                  "id": 166,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Agreed. We have a 6 week old and my husband changes her diaper and brings her to me to feed her since I breastfeed",
              "id": 167,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "My husband did this for me too. So grateful for him and his help.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 442,
          "content": "She does all that and she has to provide food to another human. Which means she has to watch what she eats/drinks. Oh and her hormones aren’t settled.\n\nHe’ll never fully know what it means to do her role.",
          "id": 169,
          "comments": [
            {
              "score": 41,
              "content": "Nope, because he would have to think of her as a human being and not just a prop or supporting character--since he's the main character, of course.",
              "id": 170,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 185,
          "content": "Sending her on a vacation wouldn't even count, because I bet she is cooking for him and cleaning up after him, as well. She'd have to stay there and have him do everything for her that she does for him, and let her have full nights sleeps AND naps. Also, while three days may give a glimpse, nothing can compare to months of sleep deprivation (every single night without a single night off or straight sleep) and the havoc it causes on mental health",
          "id": 171,
          "comments": [
            {
              "score": 20,
              "content": "And she’d still have to pump and likely miss her baby! Even if the mini vacation is what she needed and wanted!",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "He said that she handles ALL household tasks. Literally what is this man doing for his family? Oh you pay for shit? if the government can take over your role as a parent, you are a bad parent.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 34,
          "content": "I shudder to think how OP would leave the house for his wife to come back.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "When I was a new mom, my days off were the two days I spent in office. They were a fucking luxury compared to caring for an infant. Fucking YTA",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "The wife works 200 hours a week and the husband works a grueling 40 hours!! He needs a break!",
          "id": 176,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "But he said they’re both living their dream life 🙄",
          "id": 177,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5510,
      "content": "YTA - so you get a complete full night uninterrupted sleep because you don’t wake up (deep sleep, whatever) to feed/change your child and you still want more sleep? Your child wakes up at 7am…. That’s pretty conservative really…. Mine are up at 5am…. The joy…. We did take it in turns to sleep in when they were little but that’s because we BOTH took turns at night…..\n\nEdit to add -> what’s the difference between an hour in the morning and an hour in the afternoon???? Still wasted hour you can’t play video games and chill……",
      "id": 178,
      "comments": [
        {
          "score": 1347,
          "content": "Because now in addition to an hour of sleep (whether afternoon or morning) he has to spend an hour taking care of his child (the horror)",
          "id": 179,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 514,
          "content": "My eldest never really slept well as a baby and was up every 2 hours no matter what. My youngest sleeps like a champ but only for 5 hours every night. Sleep is precious in my house. If you choose to do other things rather than sleep, that's on you. \n\nBut never, ever cry to me about your baby waking at 7. That is luxury",
          "id": 180,
          "comments": [
            {
              "score": 113,
              "content": "My youngest woke up every 2 hours at night, and never napped for longer than 20 minutes.  She liked to get up for the day at 4:30am.  I considered it a victory when I pushed that time to 5:30.\n\nShe's nine now and she still gets up before 7.",
              "id": 181,
              "comments": [
                {
                  "score": 105,
                  "content": "My youngest is 9. We had to make it a rule of not getting out of bed until 530am. Let me tell you, no one lets him spend the night more than once.",
                  "id": 182,
                  "comments": [
                    {
                      "score": 85,
                      "content": "My nephew was like this! My sister bought him a clock and drew on it in marker saying he could get up and play quietly but shouldn’t come out and wake people until the marker line. Lol",
                      "id": 183,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "My toddler slept til 7am one day. It’s the only time in two years and I honestly wondered if he was breathing as I fumbled for the video monitor. He was. So I laid back down and marveled at sleeping til 7 AND waking up on my own. I felt so rested that day.",
              "id": 184,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": ">But never, ever cry to me about your baby waking at 7. That is luxury\n\nMy baby was a late sleeper and I never dared complain to any other mom.  I knew I was soooooo lucky.  It's only since she turned 6 that she's started waking up regularly before 7:00 and I still don't complain.  My sister's kid was up at 4:00 every morning!  Yikes.  \n\nSome people are so fricken clueless.",
              "id": 185,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "My 16-month-old is an early riser. 5-6am every morning. She’s never slept until 7. If I had slept all night and my kid didn’t wake up until 7, I’d consider that sleeping in. (But I don’t sleep all night – thanks, insomnia!)",
          "id": 186,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5139,
      "content": "YTA - she's perpetually sleep deprived and an extra 1-2 hours on the weekend can make all the difference. Meanwhile, you get a full night's sleep EVERY SINGLE NIGHT",
      "id": 187,
      "comments": [
        {
          "score": 376,
          "content": "Then they’re so confused when they end up divorced and single dad’ing it a few years later.",
          "id": 188,
          "comments": [
            {
              "score": 7,
              "content": "Yup. Situation was reversed in our case where I was sahd and overnight duty every night since day one for both kids. Me with insomnia, getting 1-2 hours of sleep per night (now cured! I can sleep wherever, whenever now. Except at night in my bed. I'm awake til I know the kids dont need me. Even on nights they're not with me! Lol) and she would spend every night sleeping from 10:30pm til 9:30am. Then get up, make herself a breakfast shake, and go lock herself back in the bedroom. Yes, postpartum depression is real. No, they will not (usually) talk about it. I couldn't even get her to see a therapist. Things kept getting worse where the only times she'd come out of her room were to start an argument, in front of the kids. So one night near the beginning of a fight that was escalating, I said \"look. Just.. just stop. I want out. I want a divorce.\" She said \"good. Get the papers and I'll sign.\" And here we are.\n\nNow they're 4 and 5 and we've had separate households for just over a year now! Truly the dream life, my man. 🙄 But in all seriousness, life, for both of us, is infinitely better. And now we get along and are coparenting well. Had you asked me Last year? I'd have said no chance would we be talking except for kiddo stuff. Now? Eh, we're just old friends. I never understood how my aunt and uncle got along after their divorce, but now I do and gained a ton of respect for my aunt. \n\nWhew, long rant lol",
              "id": 189,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 23,
          "content": "If OP isn't careful his wife's insomnia can lead to post partum psychosis. You know....the illness that makes overworked and sleep deprived moms kill their babies just to make it stop.\n\nBut sure - he want to have time to play video games 🙄",
          "id": 190,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3912,
      "content": "YTA, you would rather play video games then help your exhausted wife get an extra hour of sleep?! Why do people marry people like you?! My husband was constantly trying to take our kids so I could get sleep (especially when I was up nursing every few hours).",
      "id": 191,
      "comments": [
        {
          "score": 1267,
          "content": "OP, you are a horrifically bad partner and father based on this post and your comments. She is doing everything and you're complaining thst you don't get to sleep in and play videogames.\n\nI swear, this sub is convincing a whole generation of women to never marry and never have children with men. This is just pathetic. And no, your autism card doesn't cut it. YTA and if you don't learn hard and fast I hope she leaves you, because her and your kid deserve much much better than this.\n\nEdit: made clear I was addressing OP and not the above commenter.",
          "id": 192,
          "comments": [
            {
              "score": 796,
              "content": "What I hope, deep in my heart of hearts, is this sub illustrates to the younger generation ALL the red flags to look for in order to prevent them from contractually committing their lives to adult children, and effectively ending the toxic cycle.  My daughter- she’s 11, and she knows what’s up, because the cycle ENDS WITH ME",
              "id": 193,
              "comments": [
                {
                  "score": 115,
                  "content": "The ultimate red flag for me was if they made my life harder, not easier, they weren't it. When I was younger, it would take me years to see it, but as I got older,  I could spot certain behaviors within a year, and I would peace out. Now I'm with a man who continues to make my life easier, even with a baby in the picture now. He makes me want to make his life easier too, and that's another sign to look for as well.",
                  "id": 194,
                  "comments": [
                    {
                      "score": 17,
                      "content": "This is so true, and still my test- you’re right though, it takes a few weeks to know for sure if they make it easier or harder.  But for me that’s much better than 12 years!  Lol",
                      "id": 195,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "That’s a sermon I’ll listen to!",
                  "id": 196,
                  "comments": [
                    {
                      "score": 7,
                      "content": "Thank you.. this was the perfect ego boost!  I wish I could take you around everywhere with me, lolol",
                      "id": 197,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 36,
              "content": "[removed]",
              "id": 198,
              "comments": [
                {
                  "score": 11,
                  "content": "[removed]",
                  "id": 199,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 25,
              "content": "Seriously, it seems like a disturbing number of men are calculating exactly how much free time and games they can squeeze in by dumping chores on their wife's shoulders.",
              "id": 200,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Where is this autism card he tried to play?! \n\nI am an autistic mom with 2 young kids (1 also diagnosed with autism). Autism is no excuse for being a bad parent or a bad partner. If you made the choice to be someone's partner and a parent, then there is no excuse for acting as selfish and entitled as OP, autism or not.",
              "id": 201,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "I feel heartbroken for this woman who I don’t even know. What an awful situation to be married to such a selfish horrible partner. I hate this for her.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 526,
          "content": "We marry people like OP because they totally walk around in a 24 hr facade up until marriage- then bam you’ve got your hand cuffs on, and realize you just signed up to take care of an adult baby.\n\nETA: Thanks for the award!  Looks like I’m not the only one that fell for the switcheroo.",
          "id": 203,
          "comments": [
            {
              "score": 84,
              "content": "100% this is my husband. He said he want to be the one to stay home, that he would help out at night etc. I learnt pretty quickly that wasn't going to happen but not helpful when you have a baby. Now I don't necessarily begrudge the night time part seeing as he wakes at 4am in the morning and work until 6pm (with breaks in between) but man reality is different to what I was promised haha",
              "id": 204,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 38,
              "content": "And enough people will bombard you with messages about \"just *helping* him\" and \"being *understanding*\" and \"nobody is perfect\" so you're basically being gaslit from all directions for having expectations of your partner being an actual adult.",
              "id": 205,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "I doubt anyone will see this bc I'm so late, but this is important info that needs to be shared, even if it's only with one person.\n\n\nPpl always ask women why we marry these men, but you're so right that we often can't know they're terrible until it's too late. This is supported by MANY studies, including:\n\nMen who share housework equally before having kids tend to suddenly start doing much less after their first child is born. \n\nMen stop doing housework to assert masculinity if their wife/gf starts earning more than them, even if it's bc he has no job. So the argument that women are expected to do more housework only bc men work more outside the home & women are expected to be the 1 to quit jobs & stay home with kids only bc men earn more...it's about fairness & just makes sense... not bc she's a woman...is BS! The saddest part is women feel guilty for being the breadwinner, so they do it all voluntarily anyway. It's called Gender Display/Deviance Neutralization.\n\n\nJust 1 child or 1 job change can make a great marriage turn nto a misogynistic nightmare fast. Sometimes we ignore red flags, other times it's impossible to know until it happens.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 108,
          "content": "Yeah, with this attitude OP will end up divorced. Wife is doing WAY more work then him.",
          "id": 207,
          "comments": [
            {
              "score": 19,
              "content": "And when she files, he'll act blindsided and whine about how she never *told* him what to do with the baby, and why don't women want to *work* on marriages, boohoo",
              "id": 208,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "I married someone like this (only WAY worse).  Honestly, when we had babies I was blown away by how little he helped and how much he put on me. Later he divorced me and called me the lazy one.   I wasn't making enough money for him and doing 100% of the cleaning.",
          "id": 209,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2302,
      "content": "Give her my contact info I'll keep her happy.",
      "id": 210,
      "comments": [
        {
          "score": 228,
          "content": "Yo another Redditor and I got you. We're willing to pitch in for the divorce on her behalf and the new marriage license to marry you.",
          "id": 211,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 135,
          "content": "This might be the only comment that actually gets to him.",
          "id": 212,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 109,
          "content": "I wish I could upvote this more",
          "id": 213,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "I just know this dude will be shocked when he's served divorce papers and he'll tell everyone it was completely out of the blue :D",
          "id": 214,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 38,
          "content": "Is this Yung Gravy's secret Reddit account",
          "id": 215,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 22,
          "content": "Lol",
          "id": 216,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2243,
      "content": "I have read your post and some of your responses. I am honestly blown away by how selfish you are and how you don’t seem to see it. But actually I think you are more than aware of it and are perfectly okay with being selfish so long as all your needs are met.\n\nAs a former breast feeding mother I completely understand where you wife is coming from. Her body aches, her hormones are out of whack, her nutrition might not be great, and she is exhausted mentally and physically. It is a kind of tired that you will never understand.\n\nYour wife need rest. She is verbalizing to you that she needs help. And she’s not asking you to help by feeding the baby overnight with pumped breast milk. Because god forbid, you wake up in the night. She’s simply asking you to let her catch up on the rest she’s not getting right now.\n\nI don’t think you can understand just how quickly someone can lose themselves when they become and mom and breast feed. Her entire existence has become 100% about someone else. And she does it every day. And she takes care of you. So who takes care of her? What will it take for you to realize she needs help since her asking for it didn’t seem to be enough? \n\nIt’s time to grow up. It’s time to put the needs of your wife and baby ahead of your own because that is what it means to be a parent and a husband and an adult. Stop congratulating yourself for making your own lunches on occasion. Stop patting yourself on the back for giving her a break when you get home. A break that I am sure is really just her doing laundry, or cooking, or bathing. Those are not breaks. \n\nYour child deserves better from you. And your wife cannot be the parent she wants to be when she is exhausted and unsupported. This is how marriages end. Because she signed up to be your wife, not your mommy. \n\nTo put this into perspective for you, think of it this way. If your wife disappeared tomorrow, your entire life and home would be in shambles. If you disappeared tomorrow her life would be pretty much exactly the same except for that all important break when you get home from work. You shouldn’t be okay with that kind of imbalance in your relationship. \n\nYTA.\n\nETA: wow thank you all for the awards, I’ve never gotten one! I’m glad so many people have had the experience of breast feeding but with much more help than OPs wife.",
      "id": 217,
      "comments": [
        {
          "score": 907,
          "content": "> To put this into perspective for you, think of it this way. If your wife disappeared tomorrow, your entire life and home would be in shambles. If you disappeared tomorrow her life would be pretty much exactly the same except for that all important break when you get home from work.\n\nIf OP reads nothing else, I hope he reads this. \n\nA lot of women realize their husbands are deadbeats and that it’d be easier to do it without them and just collect alimony and child support than have to take care of them AND their kids. One less mouth to feed.",
          "id": 218,
          "comments": [
            {
              "score": 89,
              "content": "Yep, and from what my single mom friends have told me, it's easier mentally to not have to worry about \"what is he doing/not doing rn to help, and why\" or trying to convince him to do something.",
              "id": 219,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 374,
          "content": "That last paragraph... I felt that so much in my marriage. My husband didn’t get it until I finally gave up and divorced him. And then it was all “oh my gosh I had no idea how much work I was putting on you!”  A little late for that. My life barely even changed. His life, pretty much everything turned upside down. It was pretty telling.",
          "id": 220,
          "comments": [
            {
              "score": 66,
              "content": "I had a couple serious relationships with men that I ended after repeating voice problems, needs, and making requests and nothing changes. They were both SHOCKED when I ended it. Bruh I’be been telling you, you just didn’t give a fuck if I was unhappy as long as I was nearby to be your… comfort object? I’m not a fucking blanky",
              "id": 221,
              "comments": [
                {
                  "score": 19,
                  "content": "Lol yeah mine was “blindsided” 🤣\nRiiiiight. Because a decade of me trying to get you to participate in life together and finally giving up isn’t enough warning.",
                  "id": 222,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "Mine went back to his mommy…. Lol",
              "id": 223,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "I remember being on the phone with my sister one day when my oldest child was an infant and telling her what a zombie I felt like. She said “Could I have helped prepare you? Would you have believed me if I’d tried to warn you ahead of time how tired you would be?” I said “No way, I would have thought you were exaggerating.” \n\nYou absolutely can’t grasp that level of sleep deprivation until you’ve experienced it. It’s not “I haven’t been sleeping well lately.” It’s total physical, mental, and emotional exhaustion for months on end. And I had a considerate, helpful husband. Wish I could give OP’s poor wife a hug and send her for a nice long nap.",
          "id": 224,
          "comments": [
            {
              "score": 15,
              "content": "This!!!! By the time my daughter was 8months I started to have seizures from feeding every 1.5-2hrs. I ended up developing Lupus and PP thyroid issues. My husband helped so much too. We have 3other daughters. He was amazing. I cant imagine having a husband like OP. I would have died. Ive gone through 5yrs of brain radiation, I was 10x more exhausted when Breastfeeding then the 5yrs I was going through radiation.",
              "id": 225,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "This right fucking here. My comment doesn’t even touch this. I’m so mad I couldn’t put it into words. Had I read thru and found this first I wouldn’t have said shit. This comment is perfect. Absolutely fucking perfect. Spot the fuck on. Where’s the tylenol?",
          "id": 226,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "So well said. If a breastfeeding women doesn’t get rest then they can’t make milk to support their little one. You get to sleep uninterrupted every single night, but you’re expecting her to wake up all night AND get up in the morning so you can sleep…. More?",
          "id": 227,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "Once I got into a huge fight with my husband because he never helped me pack for the baby even we were going on a trip. His response was, “You know what the baby needs, I don’t.” I responded with, “And you don’t see anything wrong with not knowing how to take care of your own baby?   What would you do if I died tomorrow?” That was the moment everything changed for the better.",
          "id": 228,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2202,
      "content": "INFO: When was the last time your wife got more than 6 hours of sleep in a row?",
      "id": 229,
      "comments": [
        {
          "score": 598,
          "content": "And after you are done with work/school, what do you do? \n\nAfter at that same time, when she has worked and been sahm, what does she do? \n\nBecause that time should be 50/50. Not all her responsibilities. \n\nDo you relax and eat food she’s cooked? Who does dishes? Baby baths? Grocery shop? Clean? \n\nWho has the mental load? Who know the name and number of the pediatrician and the next appointment? Who knows if the clothes need to be bigger.? who packs lunches and knows the the kid will eat?\n\nPoint is - sahm isn’t “doing nothing and relaxing” - it is WAY more than I full time job. And I’ve done both. \n\nSo 50/50 add up UNINTERRUPTED hours of sleep. Are you really worthy of another one? \n\nWhat is she doing while you play video games? Does she have a time that she can do whatever - take a bath, read a book, play games - but that time should be equal. \n\nYou don’t work until 5 so she can be your slave 24/7. You BOTH get off at 5 and then split the things needing done. \n\nYou’ll get the morning when you take a night. \n\nYTA\n\nAnd read a book : this is how your marriage ends by Matthew gray. Seriously. He found out.",
          "id": 230,
          "comments": [
            {
              "score": 143,
              "content": "He’s the guy who wrote that famous essay “She Divorced Me Because I left the Dishes by the Sink”.  The OP should read that essay at the very least.",
              "id": 231,
              "comments": [
                {
                  "score": 7,
                  "content": "https://www.huffpost.com/entry/she-divorced-me-i-left-dishes-by-the-sink_b_9055288\n\nSharing for anyone who wants the link.",
                  "id": 232,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "Fucking preach! As a breastfeeding mom who is on night duty and working.. The consideration in the morning is nice. Or would be nice.",
          "id": 233,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    }
  ]
}