{
  "post content": "So I've been seeing a therapist for a whole bag of issues including anxiety, low self-esteem and trust issues. She's been amazing so far and has been a great outlet so far. Anyways, last week she did something that kind of hurt me, and Ik looking for advice on how to go forward with this.\n\n2 weeks ago she told me she was sick and couldn't make it, but this isn't the part that upset me: people get sick all the time and need to stay home from work, so that was no big deal. I was a little bummed, but it was no bug deal. So last week I showed up to the office and waited for a while before someone asked me who I was there to see, and a few minutes after I told them another person came out and told me my therapist was out for the week. I never had any heads-up or anything, and I feel kinda hurt over it. \n\nRejection sensitivity is fucking me up rn even though I know that was probably just an innocent mistake anyone could make. Rejection sensitivity makes me feel nauseous, dizzy, it makes me feel like there's a hot iron on rhe back of my head, and like there's a hole in my chest. Rejection sensitivity makes things as normal and small as this hurt.\n\nI know I'm really sensitive to this kind of thing, but I don't know if I'm being overly sensitive. But if I am being overly sensitive, and my therapist is supposed to help me work through this stuff, would it be the right move for myself to bring this up in our next session? I'm afraid if I bring it up I'll be an asshole if it makes her feel guilty or like she's bad at her job, because she's not; she has nothing to be guilty over and she's great at her job. But on the other hand, I feel like I need to get this off my chest and it's her job to help me work through this kind of thing. I also feel like it would overall be the right move to just talk about this and clear the air.\n\nI know that she's not an AH here, but I'm wondering how I should go about this or if I should bring it up with her at all.\n\nTL:DR\nMy therapist didn't let me know she was going to miss a session, and I'm not sure if/how I should bring up that it made me feel shitty.",
  "id": 1,
  "comments": [
    {
      "score": 5,
      "content": "NAH. You would absolutely not be the AH to bring up that this is messing with you. Trust is the single most important thing you need from your therapist - how are you supposed to open up to them if they don't feel like they are a consistently safe presence in your life? I have left therapists for similar reasons, because I need to have safety in that relationship.",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "This. Transference (dealing with feelings from your past that get transferred onto situations with your therapist) is literally the point of a bunch of kinds of psychotherapy, so it’s extremely appropriate to bring this up with OP’s therapist and talk through the feelings, strategize how to deal with them, explore the origins, etc.",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "NTA - bring it up. Like you said, you're there to work through these kind of feelings. Frame it as \"nobody let me know that abc / I wasn't told xyz and this is how I felt about it\" if it's easier than saying \"you did this.\" Realistically if there was a serious enough health problem for her to be out for a couple weeks, it *should* have been someone else(colleague, assistant, receptionist)'s responsibility to cancel her sessions.",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I want to know if I'd be TA if I bring up how I was hurt by not getting any warning about the cancelled appointment.\n\nI think I'd be TA for bringing it up because it might make her feel guilty for what probably amounts to an innocent mistake. I also feel like I should bring it up because it's my therapists job to help me work through emotions like this, and I think clearing the air now would make future sessions better.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA\n\nIt is very important to speak openly with your therapist, especially if it involves something they have done that triggers you, that way you can work through it and find a solution together. \n\nIt would be the same if their style of therapy was not working for you, they need to adjut to make it person-centred.\n\nIn this case you should absolutely have been informed that they would not be there, even if that kind of a thing is not a trigger for you it should still be standard procedure to do so. I am sure it was just a mistake and they are only human but it gives them a chance to acknowledge their mistake and how you feel about it. \n\nIf they are a good therapist they wont be offended by this, trust me, they tend to have thick skin and should not take this to heart.\n\nAlso congrats for working through therapy!",
      "id": 6,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I've been seeing a therapist for a whole bag of issues including anxiety, low self-esteem and trust issues. She's been amazing so far and has been a great outlet so far. Anyways, last week she did something that kind of hurt me, and Ik looking for advice on how to go forward with this.\n\n2 weeks ago she told me she was sick and couldn't make it, but this isn't the part that upset me: people get sick all the time and need to stay home from work, so that was no big deal. I was a little bummed, but it was no bug deal. So last week I showed up to the office and waited for a while before someone asked me who I was there to see, and a few minutes after I told them another person came out and told me my therapist was out for the week. I never had any heads-up or anything, and I feel kinda hurt over it. \n\nRejection sensitivity is fucking me up rn even though I know that was probably just an innocent mistake anyone could make. Rejection sensitivity makes me feel nauseous, dizzy, it makes me feel like there's a hot iron on rhe back of my head, and like there's a hole in my chest. Rejection sensitivity makes things as normal and small as this hurt.\n\nI know I'm really sensitive to this kind of thing, but I don't know if I'm being overly sensitive. But if I am being overly sensitive, and my therapist is supposed to help me work through this stuff, would it be the right move for myself to bring this up in our next session? I'm afraid if I bring it up I'll be an asshole if it makes her feel guilty or like she's bad at her job, because she's not; she has nothing to be guilty over and she's great at her job. But on the other hand, I feel like I need to get this off my chest and it's her job to help me work through this kind of thing. I also feel like it would overall be the right move to just talk about this and clear the air.\n\nI know that she's not an AH here, but I'm wondering how I should go about this or if I should bring it up with her at all.\n\nTL:DR\nMy therapist didn't let me know she was going to miss a session, and I'm not sure if/how I should bring up that it made me feel shitty.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "NTA.  Any professional you have an appointment with owes you the courtesy of a heads up if the appointment can't be kept.  It's the least you could do.  If a friend stood you up with no notice, you wouldn't be happy about that, would you?  No, you'd expect your friend to explain and apologize.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NAH. The information you give here about what it felt like would be really good for your therapist to know.",
      "id": 9,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "NTA. I know this concern comes from a place of anxiety and i'm truly happy you're working on it, but you don't have to worry about making her feel bad. I'm a therapist and if i was in her place (because i have been in a situation kinda similar to this) i would be grateful if you told me, as i might not be awere of that mistake and you deserve an apology for that. \n\nI'm always glad when my pacients, especially the ones who are dealing with anxiety and trust issues, are able to tell me this type of things as i know it's hard for them. It is a HUGE step and it could help your sessions to take the right directions according to your current needs, problems and progression.",
      "id": 10,
      "comments": [],
      "relation": "Support"
    }
  ]
}