{
  "post content": "I started seeing a guy roughly a year and a half ago. He has a 9yo (almost 10) daughter named \"Chrissy\". I have an 11yo son as well. We met each other's kids 3 months back and last month they started having weekend visits here. It's been a super hard adjustment for me especially. The kids get along for the most part but I'm just having a really hard time. My son has always been a fairly good kid and hardly ever given me issues. He never drew on walls or broke anything of importance or talked back (aside from occasionally, obviously, no kid is perfect) and he was always super quick to ask permission to touch my stuff. I personally think I lucked out and I knew that not all kids were as well behaved as my child but I wasn't ready, I don't think. I'm just overwhelmed. \n\nSo, since she has been doing weekend visits here (she stays in my guest room) she has destroyed a lot. Rips holes in the mattress and then says they were already there (they weren't), draws on the walls and windowsill with make up and marker, she even takes my new feminine pads to her room and will cut them up. She has put a hole in my wall and said it was already there. I can buy a brand new thing of shampoo and conditioner and it's 100% gone and in the trash by the end of her shower, which lasts 45 minutes every single time. She stomps her feet and slams doors when we have to speak to her and knocks things off the walls. She is generally a good kid but she is so fucking destructive. \n\nWhat really set me off was her coming here this weekend with her dad (my son was at his father's) and I was called in to the office to do a signing which would only take roughly an hour max. So I left them here without me. Well, when I got back she was sitting at the kitchen table with all my photo albums laying in front of her, cutting out the faces and everything else on these photos and gluing them to her \"scrapbook\". Photos that I cannot get back, as they were printed out YEARS ago when I was in foster care and those were the only copies I had. Photos of my dead friend as well. I went to my BF, who was on the phone outdoors and told him they needed to leave, explained the situation and told him I was fucking done. Those photos, as stupid as it may be, were a huge part of my childhood and now they are destroyed. I told him I was done speaking to him about his daughter destroying my shit and it was time to go. He thinks I'm an AH for throwing a year and a half down the drain over some pictures. Am I?",
  "id": 1,
  "comments": [
    {
      "score": 21248,
      "content": "NTA that shit would piss me off too. He sounds like a bad father. Curious what his responses have been to her destroying your stuff in the past. If he doesn’t respect your property he doesn’t respect you.",
      "id": 2,
      "comments": [
        {
          "score": 11195,
          "content": "He has the same \"You know you can't do that\" talk. That's literally it. The same conversation every single time. He's said it so much to her that she will literally say it with him and then be like \"yeah dad, I know, you've already told me\" and then she will be good for like a day and go right back to it.",
          "id": 3,
          "comments": [
            {
              "score": 5529,
              "content": "He’s just doing the bare minimum to keep up appearances",
              "id": 4,
              "comments": [
                {
                  "score": 2901,
                  "content": "...This is less than the bare minimum, dude.\n\nThe bar was on the ground and homie dug a hole to avoid it...",
                  "id": 5,
                  "comments": [
                    {
                      "score": 867,
                      "content": "The bar is in Hell and this dude is playing limbo with Satan.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 163,
                      "content": "The hole was already there",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Correction the daughter dug the hole… in the mattress in the wall lol",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 520,
                  "content": "[removed]",
                  "id": 9,
                  "comments": [
                    {
                      "score": 918,
                      "content": "and the fact he was on the phone while she was doing it (probably not watching her)",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 18,
                  "content": "Less than, he's not even supervising her. He left her alone in someone else's home he knows she likes to destroy. Maybe she acts out because he ignores her or maybe she keeps doing it cuz there are obviously no consequences for doing it. Get rid of them before your son starts picking up those bad behaviors.",
                  "id": 11,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1224,
              "content": "If he thinks he’s doing the right thing, you should let him read this post and how mostly everybody thinks a ten year old acting that way needs more than just “can’t do that sweetie.”",
              "id": 12,
              "comments": [
                {
                  "score": 851,
                  "content": "I had to re-read this three times to make sure I got her age correctly. I could have sworn I was reading about a 3-year-old and even my very rambunctious son never even did CLOSE to this much damage at that age. JFC.\n\nI firmly believe (save for some unique situations) that how a child acts is a direct reflection of the parent and who they are, characteristically. No way in hell would I put up with that and I would 100% dump a man who had no control (or desire to control) their child.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 744,
                      "content": "It’s clearly more than that. This isn’t just mischief—the girl is acting out, because something is very wrong.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 342,
                      "content": "I think you're on the right track, but viewing children as mere reflections of their parents is a bit of a shallow take. They're absolutely going to mimic behavior that they favor, but children are just as capable of acting in spite of their upbringing than in accordance with it. Who they choose to become is absolutely informed by the parents actions, but the individual behaviors that result can definitely be a mixed bag.\n\nOur kid is 10, and I am near certain that he has a diagnosis for narcissistic personality disorder or similar looming in his future. His refusal of humility and self accountability are not traits from his mother, and they're not from my example. It is possible that this is hereditary from his bio-father, but I don't have enough info to draw conclusions there. \n\nI cannot begin to explain the time and mental effort that has gone into trying to guide him towards empathy and honest introspection, to get him to acknowledge how he impacts those around him. \n\nHis behavior is driven by these traits. Traits that are not otherwise displayed in the home or extended support structure. There have been numerous times where trying to combat these traits has proven counter-productive. Learning how to effectively correct and guide him has been far from straight-forward. \n\nThe point is, the behavior is counter to our example. It's counter to what we find acceptable, and we don't condone or excuse the poor behavior. He acts as he does in spite of our efforts and guidance. We're learning and adapting, trying new things (some work, some don't) and doing our best not to repeat our mistakes.\n\nIt's easy to dismiss children as being little more than mimics. There is a stage in their life when that description is accurate. But they're also a unique person, and have their own motives and desires as such. It's not as simple as 'parent does/is x, child does/is x'. Sometimes they meet humility with arrogance, sometimes they respond to honesty with dishonesty, sometimes they manipulate those interacting in good faith. And the opposite of all those are true as well. I've met some great people that came from a really horrible family.\n\nOverall, I would encourage you to judge a parent by how they respond to their children's poor behavior rather than by the behavior itself. Even a pattern of behavior may involve parents who are genuinely trying to find an effective approach but struggling.\n\nAs for OPs situation, from what little info she's given it doesn't seem like the girls father is attending to the behavior with any seriousness. Repeatedly approaching the issue in a way that has proven ineffective isn't much of an attempt at correction, it's just trying to smooth over the moment.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Very good points. NTA.",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "A 10 yo doing any of this is suuuuper weird. Ten year olds are way over the drawing on walls, destroying stuff for fun phase.  \n\nProbably stuff she does for attention which she's clearly not getting from dad. So she keeps pushing and pushing to get a reaction. \n\nAnd dad doesn't give a f....",
                  "id": 17,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 904,
              "content": "Explains why she had no boundaries. Her father doesn't bother to enforce them. \n\n9-10 years old is too old to not already know you don't take other people's stuff without permission and you don't break other people's things. \n\nI've only ever heard of 3 or 4 year olds drawing on walls. Never a kid that old.",
              "id": 18,
              "comments": [
                {
                  "score": 241,
                  "content": "That's what I was thinking. Seems a bit old. Maybe little girl acting out unhappy with parents separation taking it out in OP?",
                  "id": 19,
                  "comments": [
                    {
                      "score": 195,
                      "content": "Except dad's reaction doesn't support this being unusual behavior. It's obviously totally acceptable to him. HUGE bullet dodged. \"Thrown away\" time? Nope. Taking it back so no more time is wasted with this jerk and his spawn.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 64,
                      "content": "Agree, she's doing this out of spite to the gf. She is probably a great girl at her mom's,  until mom gets a bf.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "How about just dad ignoring her when she has her time with him. Look! He's on a call. Not even paying attention once in maybe a 1/2 hour!",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "Maybe but that's his problem, not OP's. Those two would never darken my door again.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "That's what I thought. Her destruction seems to be ramping up from fixable incidents like drawing on walls to irreparable ones like cutting up the photos. \n\nDad must've been outside on his phone for quite some time for her to be able to find the photo albums, get them all out then start cutting them up and glueing them into her book. Maybe she's desperate for attention and the only she gets from him is the negative which is better than none. Or maybe she's escalating hoping that *this* will be the one that makes op breaks up with her dad? \n\nWho knows and without all the info it's impossible to know but op you're definitely NTA. If she's getting worse you don't know what the hell she's going to do next and it's not worth keeping them around to find out.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "I was thinking something like that, too.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 230,
                  "content": "Exactly. That is in no way age appropriate. Small children draw on walls because it seems fun and they don't know any better. Almost 10 she is purposefully being destructive and trying to piss OP off",
                  "id": 26,
                  "comments": [
                    {
                      "score": 142,
                      "content": "Daughter wants Daddy all to herself. If she's gotta destroy walls and cut-up old photos, then she'll do it.\n\nNTA, OP. Dump the guy pronto.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "Meh, don't forget neurodivergent kids. My 10yo still does stuff like that. My 4yo is better with boundaries than my eldest. \n\nThat being said, my eldest gets a lot of special help",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "My 2YO will draw on the wall. When I remind her we don’t do that, she says “uh-oh! I clean!” She gets a sponge, I spray the cleaner for her, and she washes the wall. \n\nOP’s bf sounds like a trash parent who is ignoring his kid’s needs.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Right? I'm like, drawing on walls? 10? \n\nThis stuff is deliberately malicious and not at all normal behaviour for a 10-year-old. She needs help, but that's her dad's problem, not OP's.\n\nAlso, NTA. I would be *devastated* if my old pictures were destroyed. I don't think I could look at the kid again, personally.",
                  "id": 30,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 767,
              "content": "I don't think you're throwing away anything of value by ending this relationship. He's an absolute garbage parent. There's no future with someone like him.",
              "id": 31,
              "comments": [
                {
                  "score": 112,
                  "content": "I agree! You dodged a very large bullet!",
                  "id": 32,
                  "comments": [
                    {
                      "score": 86,
                      "content": "Nearly a cannonball",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "And, it\n Will\nGet Worse.",
                  "id": 34,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Legit, trash taking itself out.",
                  "id": 35,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 695,
              "content": "Just jumping on here OP as I had a similar destruction happen (it was a baby cousin). I took the pieces to a photo shop and they restored them all for me! You cant even tell. My gran also had some old photos from the 60's that were faded beyond recognition restored after finding a company online. \n\nYou may well be able to get at least some of those photos restored.",
              "id": 36,
              "comments": [
                {
                  "score": 354,
                  "content": "Yes, and OP, just FYI there's an incredibly kind & giving community here on reddit where people do restorations for each other, r/estoration, you can get those photos restored, at least some of them!  Keep all the pieces.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 200,
                      "content": "Tagging OP to be sure:  u/PoloPurr did you see the post directly above and the one above that, suggesting a photo store or r/estoration where they might be able to fix some of them?",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "If OP has all the pieces I’d be happy to fix them for free",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 211,
                  "content": "And then take ex-bf to small claims for whatever the restoration cost is.",
                  "id": 40,
                  "comments": [
                    {
                      "score": 27,
                      "content": "And add in a replacement mattress, cost to repaint the walls, and any other damage!",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Good, I wanted to point that out too. It's amazing what restorers can do, they probably will come out looking better than they did before, and OP can have copies. Even get some blown up to hang on the wall or put on the mantel.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Just tagging u/PoloPurr  to say that we had this done for the only photo of Mom and Dad when dating. It had smoke and water damage. Mom and Dad couldn't believe how great it looked.\n\nSo take the entire scrapbook to them. Tell them exactly what you told us. They'll do right by you.\n\nEdit: And like others said,  r/estoration  might be able to help with some of it, too, esp making you digital files you can print out.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 261,
              "content": "OP, I have 4 kids, 2 boys and 2 girls, with the youngest being almost 10 as well. \n\nWhen I tell you my kids *NEVER* did anything like what you've described, I mean that, and that of course includes my daughters. My almost 10 year old is high functioning autistic and even though he's had uncontrollable outbursts, he's STILL never done anything at destructive as your bf's child. \n\nShe needs boundaries, rules, and some active parenting, and it doesn't sound like she's getting that at all, at least not with her dad. Honestly, do you want to spend the next 8ish years with him when he's letting this behavior slide, especially since it'll likely only get worse in her teen years?\n\nLastly, I understand what you mean by having photos you can't get back, and how emotionally devastating it is when they're destroyed, especially in a manner which was entirely preventable. Don't ever let someone gaslight you like he did with the \"throwing away a year and a half over this\" bullshit, and if he says it again, you should reply \"Hell yes I'm tossing our relationship over this.\" NTA *AT ALL*",
              "id": 44,
              "comments": [
                {
                  "score": 113,
                  "content": "How much/many of the things that are important to you will be dismissed by him?\n\nAll of them.\n\nRelationship time is never wasted. At best & worst we learn our tolerances and boundaries and most importantly find your NO.\n\nThis is it.\n\nHe does not act in best interests of all involved w relationship. He never will.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 150,
              "content": "And that right there is what you tell him.  It isn't over the photos.....it is the accumulation of all she has done and the fact that he does nothing to fix it. \n\nHe would rather slough you off than discipline her and possible have her stop wanting to see him so he gives in rather than risk it.   She is going to be a treat in a few years!",
              "id": 46,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 71,
              "content": "I'd have left long ago, damn.",
              "id": 47,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 46,
              "content": "It seems he wants you to do the disciplining. If not corrected she's going to grow up like a spoiled brat. That's not nice.\n\nAnd all he can do is talk?\n\nAnd with regards to the photos. If you can add back those faces that she cut, you can scan and reprint. And maybe repair them.\n\nNTA",
              "id": 48,
              "comments": [
                {
                  "score": 11,
                  "content": "I disagree...I think he doesn't want to to be disciplined... I think she's doing all that stuff to break them up",
                  "id": 49,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 7,
                  "content": "This right here. Line them back up, scan, and maybe see if someone with some photoshop skills can fix any discrepancies.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "My younger nephew ( a distant cousin's little one) first came to my place when he was around 2yo, he's learned to ask before taking toys, asking for pencils, he gives you puppy eyes because he knows where I keep snacks. Kids as young as that know boundaries because someone has taken the time to teach them. \n\nNo-one tough her, but that's on her parents. Not on you. They can go and destroy someone else's things. You are more patient than me, or at least have more self control.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Sounds like the girl is doing this on purpose to drive a wedge between her dad and OP.  I would bet she has done this before.",
          "id": 52,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "The problem is he thinks it’s the photos…it not about the photos…he has a terribly misbehaved child.\n\nWhat was he doing where she had time to find the album and all the supplies needed to cut and paste?\n\nGood for your for not wasting more time in a relationship that was not going to bring you joy. \n\nNTA",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "NTA at all.  Wonder how he would react if his daughter destroyed things that he holds dear.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Bruh you got more upvotes than the post lol",
          "id": 55,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6064,
      "content": "NTA. It wasn’t over pictures, is he stupid? It’s about the disrespect he’s been allowing to happen and that was the last straw for you. \n\nHonestly good kids don’t do that stuff, if any of my stepkids done those things I’d have done the same as you. It’s just plain rude.\n\nEdit to say: I’ve read this 3 times and it’s annoyed me more and more on your behalf.",
      "id": 56,
      "comments": [
        {
          "score": 1829,
          "content": ">is he stupid\n\nSeriously.  At this point she should dump this guy, not because of what his daughter is doing, but because he's obviously an idiot.\n\nAt some point it's just not worth educating someone this dense.\n\nOP, it sucks, but this guy has made it clear his daughter's completely inexcusable behavior will always be more important than showing you basic respect and consideration.  I don't think there's anything left for you here.",
          "id": 57,
          "comments": [
            {
              "score": 648,
              "content": "These are very deliberate things. Not like playing ball in the house and breaking a vase. These are premeditated, it’s disturbing tbh.",
              "id": 58,
              "comments": [
                {
                  "score": 342,
                  "content": "Yup.  Daughter is not happy her dad is dating.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 30,
                      "content": "THIS WAS MY FIRST THOUGHT AS WELL",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "INFO when did OP get together with the girl's dad, and when did the dad's relationship with the mom end?",
                      "id": 61,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Who the hell rips a hole in a mattress",
                  "id": 62,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 314,
              "content": "I think it's deliberate. He knows exactly what he's doing. He hasn't bothered to raise this child, and he's not going to; he's looking for a babysitter who can handle the kid AND who is weak-willed enough to let him guilt her about the results of HIS complete inability to parent. And he's only mad because the babysitter didn't work out. OP dodged a Howitzer.",
              "id": 63,
              "comments": [
                {
                  "score": 8,
                  "content": "Exactly this. Plus, why would he care if he doesn’t have to suffer the consequences? It’s OP’s house and stuff after all.",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "She has dumped him, hence him whining she \"threw away 1.5 years over some photos.\"",
              "id": 65,
              "comments": [
                {
                  "score": 14,
                  "content": "She's obviously second guessing her decision, or she wouldn't have written this post...  I'm just asserting she has multiple reasons to hold the line!",
                  "id": 66,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "> At some point it's just not worth educating someone this dense.\n\nNot only is it 100% not worth it, it's most likely not possible. Cut your losses, OP.",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Agreed and I think she did dump him according to the post.",
              "id": 68,
              "comments": [
                {
                  "score": 6,
                  "content": "Yes, just hoping she keeps it that way...  she has multiple reasons to do so at this point!",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 90,
          "content": "Agreed. The complete disrespect from the child and her father is why OP is ending the relationship. It would just get worse if OP stayed in the relationship because the father is obviously not doing anything to control his child.",
          "id": 70,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Even if it were solely about the pictures, it's her right to be pissed off about the destruction of her property. I am with you...this guy's \"parenting\" sucks.",
          "id": 71,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "It wasn’t and it was.  I think she must be looking for attention or protesting the move in, because this is not stuff that happens accidentally.  Maybe them moving out will giver what she wants and she’ll behave, but I think she and dad need therapy to work through whatever is driving this.\n\nBut it was about the photos because she has escalated to something irreplaceable.  As spendy as a mattress is, I don’t know many people with an emotional attachment to them.  And I do think 9yo knows this (perhaps not to the level of only reminders of friend who passed, but knows this is personal).",
          "id": 72,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "I think he knows, or is suspicious, his daughter is purposefully targeting OP. So it's not the general parenting of stopping bad behaviour but having to deal with his daughter being upset he is moving into a new relationship. And that would mean harder conversations like leaving and moving in again when she is ready.\n\nAll damage has been targeted to OP. Her house, her makeup used to deface her house, her furniture, her shampoo and conditioner, her photos. \n\nI am suspicious that he is being obtuse because he doesn't want a big issue to deal with.",
          "id": 73,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "This \nI’ve read it once and I’m feeling so agitated and upset for OP. \n\nYour ex sounds like trash. I’m glad you’re looking after your boundaries and your son/yourself.",
          "id": 74,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "seruously what is he on though? it isn’t *entirely* about the photos, but cutting up someone’s photos that they had carefully stored in *photo albums* is an *incredibly* big deal, and a huge violation. people will literally take time they can’t really afford to grab their photos before escaping a house fire! \n\nphotos are important! anyone who says they aren’t is the outlier, and I’m side eyeing him so bad for downplaying how greatly his daughter hurt OP with this",
          "id": 75,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3020,
      "content": "NTA. That sounds heart-rending. After all the previous incidents, why wasn't he supervising her? He's at fault as much as she is.",
      "id": 76,
      "comments": [
        {
          "score": 2076,
          "content": "He is always on the phone with his father. His mother is ill and they live in another state so his dad calls very often with updates and stuff and I totally get that but the second he leaves the room his daughter is destroying something.",
          "id": 77,
          "comments": [
            {
              "score": 1577,
              "content": "OP, don't get rid of the cut up photos. They can be stitched together in photoshop, turned into digital photos and printed good as new.",
              "id": 78,
              "comments": [
                {
                  "score": 943,
                  "content": "I'm late here, but I will 100% restore at least a couple of them in Photoshop if you upload decent scans - professional photog/retoucher. /u/PoloPurr\n\nComing from someone uneasily sentimental.. I'd be devastated. I don't have any photos from before 13~ and it makes me cry regularly knowing they're in a landfill. I will gladly help if you need.",
                  "id": 79,
                  "comments": [
                    {
                      "score": 121,
                      "content": "That is so kind of you. I hope OP sees this. The tech is amazing now (I have zero experience with any of it) but I really hope you manage to return some of her mementos to her. Thank you for being so good.\nI’m the same in that I am quite sentimental and I have a disability which causes me big memory losses so my photos are of great importance to me. I would laugh off holes in walls and stuff but I would be devastated if someone destroyed my photos just like OP is and honestly I think the anger would eclipse any emotion I felt for the partner so I would do the same and call time on the relationship. So many people here obviously identify with your loss OP, you are NTA and deserve better.",
                      "id": 80,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "That's such a kind offer, I really hope OP takes you up on it. \n\n\nSorry to jump on this thread with this request but do you have a website or anything for your services?",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 294,
                  "content": "So definitely don't let the kid's \"scrapbook\" go if it contains even a partial photo of OP's",
                  "id": 82,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 136,
                  "content": "r/picrequests might be able to help!",
                  "id": 83,
                  "comments": [
                    {
                      "score": 16,
                      "content": "There's r/Photoshoprequests too.",
                      "id": 84,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 44,
                  "content": "This!!",
                  "id": 85,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "/u/PoloPurr did you see this?",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1577,
              "content": "Sounds like she is acting out to get his attention. Sadly, she is way too old to behave this way. My kid, my step kid & grandkids all knew better by 4ish. I recently got custody of my granddaughter & weve had 1 acting out incident but she just turned 6 & her life was upside down b4 we got to her (like crazy stuff).",
              "id": 87,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 184,
              "content": "He should leave his kid with her mother then.\n\nI will never understand why some people take their children out of their other parent's house to leave them without care.",
              "id": 88,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 138,
              "content": "If your kid is frequently destructive, and you're at someone else's home, then you take the phone call in the same room as them. Or at least where you can see them the whole time. Doesn't seem like rocket science. He just doesn't care what she does. You are definitely NTA!",
              "id": 89,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "If he can't take a phone call without her destroying things, especially things that don't belong to her, he needs to work with the other parent and get individual and family therapy because clearly there is something wrong, or the kid needs some kind of respite care because of a disability.\n\nAnd if he's constantly on the phone because of family issues, perhaps he should work with the other parent and adjust custody so that the family issues don't interfere with his parenting time.\n\nEither way, not your circus, not your clowns.",
              "id": 90,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "This tells me she has self control, she just chooses not to use it. I think she wanted her dad and you to break up. If he’s a good father, he’ll put her into therapy. Not your problem. No way should you have to tolerate this constant destruction from an almost 10 year old. That’s nuts. NTA.",
              "id": 91,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "This is absolutely not an excuse to let a child destroy someone else’s belongings. I feel so sorry that what she ruined is irreplaceable. He needs to take responsibility for his fucking child. \n\nNTA",
              "id": 92,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 10,
              "content": "Does she every destroy *his* stuff or is it just yours?",
              "id": 93,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "A person can talk on the phone and watch their kid at the same time.  It's not hard.",
              "id": 94,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "Ask him what he’d feel if every picture of his mom stopped existing.  Tell him that’s what happened to you.  Also see if you can get back any pieces she took.  Take the scrapbook back if they are in there.",
              "id": 95,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "He is much, much more at fault than she is.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2648,
      "content": "Holes in mattresses? Cut up pads? Wasted shampoo and conditioner? Holes in walls?\n\nThose arent accidents,  that's all done on purpose.\n\nAnd the pictures? That's deliberately malicious.\n\nEither daughter has some serious mental health issues or she is trying to break y'all up. Or both. And her dad enables her,  then probably wonders why he cant keep a girlfriend.\n\nBe done with them and don't look back.\n\nNTA",
      "id": 97,
      "comments": [
        {
          "score": 383,
          "content": "The father is enabling her bad behaviour. That’s criminal behaviour. She’s not OPs child to parent the guys made his bed now he can lay in it.  You’re right deffo don’t look back or be guilted into a relationship. What happens if she goes from vandalising your home and belongings to hurting you and your son? (Big jump yes but not impossible - she knows she can get away with anything because she’s not being punished)",
          "id": 98,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 257,
          "content": "None of that is normal for a soon to be 10 yo. I know OP thinks their kids is really good, and I  can vibe with that as I got a real good son too, but there's a middle ground of behavior you can expect from a girl this age and this ain't it. Even if she's doing it on purpose, there's still got to be mental health issues going on. I was a screwy 10 yo as that's when my alcoholic father walked out on us but even I didn't go to these lengths for attention. Boyfriends daughter needs help and the real AH here is the dad (and mom) of this child.",
          "id": 99,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": "OP needs to send him an invoice for all the shit she destroyed. Maybe when he sees a monetary amount put on her destruction he’ll get his head out of his ass.. but I wouldn’t count on it.",
          "id": 100,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 85,
          "content": "Daughter has serious mental health issues. Yikes 😬🚩🚩🚩",
          "id": 101,
          "comments": [
            {
              "score": 4,
              "content": "I think it's either mental health issues or she's on the spectrum. She isn't doing typically 9-10 year old things. I think they just think she's bad. But there is enough going on. The shampoo soap dumping is one",
              "id": 102,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 80,
          "content": "OP also mentions in a comment she only starts destroying stuff when dad leaves the room.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "She should sue him for the damages to her home. Maybe costing him money will get his attention.",
          "id": 104,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "This!! \n\nThe dad is an AH for failing to parent his child. This could have been avoided early on. He allowed her to run free with this behavior and has the gall to blame you! \n\nI’m impressed you told them to go. NTA OP",
          "id": 105,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1586,
      "content": "NTA. Also she is NOT a “good kid”. Holy cats, I wouldn’t have dreamed of doing a quarter of the crap she has done at that age. Can only imagine my parents’ reaction.",
      "id": 106,
      "comments": [
        {
          "score": 455,
          "content": "Not to go all new age parenting, but there are not good and bad kids. There are only kids with different needs. This little girl is struggling with something fierce and crying out for attention. She NEEDS something. What, I cannot even speculate, but there is something in her life that is completely out of balance. 9 year olds do not destroy things for no reason.\n\nThis does not mean that OP is an AH or did anything wrong. It is not her kid. The BF is a huge AH though. He or someone else in this kid's life is screwing her up royally. She is being neglected in some why.",
          "id": 107,
          "comments": [
            {
              "score": 67,
              "content": "This! I am not a parent yet but I have taken a child development class and have a child psychology book in my library. For a 9, almost 10 year old to act the way she is acting something is going on and she is screaming for attention the best way she can, OP is not an AH, one it’s not her kid and second the photos where some pretty personal stuff so it makes sense that would be the straw that broke the camels back. Kids are sucky communicators unless they are taught how to properly communicate which I’m guessing the little girl hasn’t been taught that. The best thing they do when they truly need something is destroying things and it’s frustrating and sucks. But unless someone knows what’s really going on in the girls life your best guess is good as mine.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "I'm willing to bet that she gets attention when he's not dating and the last girlfriend ran away quickly when she turned destructive (because she got attention for acting out). This time just took longer, and more calculated and escalated destruction. Who knows what else is going on in her life. I saw it in a few of the students I tutored.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "My thoughts exactly. That’s not normal behavior for a 9 year old",
              "id": 110,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 448,
          "content": "She's only 9 too! Imagine what her teen years will be like *shudder*\n\nHuge bullet dodged op.",
          "id": 111,
          "comments": [
            {
              "score": 105,
              "content": "My parents would have beat the ever loving fuck out of me if I even thought about cutting out family photos for a ‘scrap book’",
              "id": 112,
              "comments": [
                {
                  "score": 28,
                  "content": "I would have got my ass handed to me well before the pictures if I had tried any of that as a kid. Some of it is typical toddler behaviour, the drawing on walls and using all shampoo/conditioner, I used them to make bath “potions” but holes in the wall/holes in the mattress 100% NOT normal",
                  "id": 113,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Nailed it with the toddler behavior. But this kid is 9 👀",
                      "id": 114,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "How did she even put a hole in the wall? Only thing I can think of is she bumped/pushed something in to it, but even as an adult I would struggle to do that and it would probably hurt me more than the wall. The fact a 9 year old managed that is concerning.",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "The hole in the wall would've been what got me a hole a in the yard.",
                  "id": 116,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 18,
              "content": "She'll see her on the news probably",
              "id": 117,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "reminds me of my sister taking all my belongings and destroying them. she was a bad kid then, she’s an even worse person now",
              "id": 118,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "\n>Imagine what her teen years will be like  \n\n\nbeheading cats, eventually people.",
              "id": 119,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 134,
          "content": "That stood out to me as well. OP said she was a good kid, but destructive.  NO.  She is also very dishonest, which is worse than the destruction.",
          "id": 120,
          "comments": [
            {
              "score": 50,
              "content": "True! Lying about the holes in the mattress and walls already being there, plus probably other lies as well.",
              "id": 121,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Yeah that struck out at me as bad judgment. I can't classify a destructive person as \"generally good\". That kid sounds wildly out of control",
              "id": 122,
              "comments": [
                {
                  "score": 15,
                  "content": "Keep in mind, in my country, nine years old is most likely to be fourth grade, maybe just starting fifth grade. She can multiply. She knows what she's doing is wrong.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 94,
          "content": "Right?!?!\n\nThis kid is BEGGING for someone to set some boundaries. She is pushing and pushing and pushing because she wants attention. Dad needs someone to explain basic child psychology and parenting 101 to him",
          "id": 124,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 52,
          "content": "Her behavior is bad, yes. The father is not only allowing the behavior, he's not giving consequences to head off the behavior. \n\nThe guy is a bad father for not supervising his child in a house they are guests of.\n\nMy daughter would never have behaved this way, even as a toddler. Not because she knew better, but because I supervised her and would not allow it.",
          "id": 125,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 27,
          "content": "I have a 5yo daughter who is a tornado of creativity and destruction. And she doesn't draw on walls. She asks me before using my makeup. She does not damage furniture and walls. If my crazy 5yo knows enough to not do shit like this, so should a \"good\" girl twice her age. This is NOT normal 10yo behavior. These are things an unsupervised 2yo would do. She either has had no parenting her whole life, or is going through something with all this change. Either way, she needs help, and it's very alarming that your bf doesn't recognize this and instead dismisses the behavior as well as makes you out to be an AH",
          "id": 126,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "The terms \"good kid\" and \"bad kid\" are so harmful. At 9 years old, that kind of behavior is not indicative of whether or not she's a good person. It's indicative of a need she's not having fulfilled. Something is going on that she needs more help with. Not the OP's job, to be sure, but calling her a bad kid isn't helpful to anyone.",
          "id": 127,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yeah I read that and I was like generally good kid my ass",
          "id": 128,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Oooof. My parents would have murdered me until I was dead and buried me under the floorboards for doing that to someone else’s property, especially IN THEIR OWN HOME. Not that it would have been better had Chrissy done these things in any other home but that’s just an added layer of insult to injury.",
          "id": 129,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 627,
      "content": "NTA. And OP if you saved the pictures scraps and get to scan them I would love to restore them for you or do the best I can so you can print them again or at least have a digital copy.",
      "id": 130,
      "comments": [
        {
          "score": 657,
          "content": "Unfortunately most of the pieces she cut were slivers and I don't even know where half of them are. I tried looking because I know there is restoration but it looks like she may have taken most of it with her or something. They aren't in the trash.",
          "id": 131,
          "comments": [
            {
              "score": 413,
              "content": "What has her father done this whole time?!? Most children  the daughter's age don't rip holes in mattresses, walls , destroy other peoples personal belongings etc.  What was the boyfriend doing while this kid was poking around your stuff? Has he addressed any of her behaviors ? Does she have developmental delays or other issues preventing her from understanding  appropriate behavior?",
              "id": 132,
              "comments": [
                {
                  "score": 139,
                  "content": "Mine was AWFUL for destroying things. Sharpie all over walls and dolls, clothes cut up, doll hair cut off like GI Jane, torn papers/books she’s brutal on crayons too. She’s getting better but it was terrible until about 6/7 years old. And even she never targeted other peoples stuff because she knows it’s not ok.  I definitely agree that at 9/10 this kid should have way more self control, and it’s NOT normal that’s she’s destroying things all the time. I have spent years combatting the same problem and my kid is only 8 and we’ve managed to get her to stop almost completely. There’s surely something else going on here",
                  "id": 133,
                  "comments": [
                    {
                      "score": 58,
                      "content": "My nephew was insanely destructive! He broke everything- Multiple tablets, laptops, bedding, lights, toys, decorations, beds, windows, a table, drawing on walls, emptying toothpaste tubes down the side of the wall. Basically, if you could see it, he would destroy it somehow. It was the craziest thing and I have never seen anything like it!\nI thought he would always be that way, but he grew out of it though around age seven. Nine is much too old to not know better. This girl knows what she’s doing.\n\nNTA!",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 173,
              "content": "Really? After all that and he didn’t even make her give them back? Even if they are cut up. Yeah, not ok.\n\nNTA at all.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 134,
              "content": "Wait you didn't take the scrapbook? Oh my God I'm oh my God my heart hurts for you",
              "id": 136,
              "comments": [
                {
                  "score": 125,
                  "content": "OP I'd go over to his place and get the scrapbook. I'd be ferocious for those little bits.",
                  "id": 137,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 63,
              "content": "Sorry You let her walk out with her 'scrapbooks'?",
              "id": 138,
              "comments": [
                {
                  "score": 69,
                  "content": "Yeaaahhh, there is no way that child would’ve left my home with the pieces of my photos in her little “scrapbook.” No fucking way. I also hope OP’s ex has paid or will pay for all the damage his daughter has done to OP’s home and her belongings. \n\nThis is absolutely insane to me! Ex’s daughter is very clearly acting out in big ways and ex needs to take her to a child psychologist or some other trained professional to get to the bottom of it— a 9 (almost 10) year old is way too old to be engaging in this type of behavior. Ex needs to wake tf up and start being a parent to his daughter, pronto!",
                  "id": 139,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Maybe the girl hid the pieces in her pockets or something",
                      "id": 140,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 61,
              "content": "It's in her scrapbook. You should have cut out pages which had your photos in her scrap book. Girl would know how that feels and you have a chance at restoration. I doubt darling dad would give you that scrap book. He is AH.",
              "id": 141,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 44,
              "content": "I'm so so sorry that this happened to you OP. Don't let him make you think you're overreacting. I'd be crying my eyes out over losing such sentimental things and that's NORMAL.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 41,
              "content": "This is something she needs to return and her dad needs to have enough responsibility to make sure those pieces are returned.",
              "id": 143,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 33,
              "content": "Is it possible to ask your ex if they have any of the pieces? \n\nI’m so sorry this happened to your photos op",
              "id": 144,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": ">PoloPurr\n\nCall your boyfriend and tell him to bring her scrapbook which contains those photo pieces back to you ASAP.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "You need to pressure the father to give back her ‘scrap book’ maybe pretend to give him hope of getting back together to get them and leave as soon as you have the photo scraps. Idk whatever you can.",
              "id": 146,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 605,
      "content": "NTA\n\nBF’s daughter has no boundaries and BF isn’t willing to enforce any. That shows a lack of respect for you. Good riddance.",
      "id": 147,
      "comments": [
        {
          "score": 134,
          "content": "I don’t think the child has no boundaries- I think she isn’t comfortable with her daddy dating. She may view OP as “replacing her mommy” or “taking her daddy away from her”. It’s only been about 90 days since they met the kids. The child is lashing out over being uncomfortable. The child isn’t right and it 100% needs to be addressed but guess what that’s part of what dating with kids means. The dad needs to step up and address it but the child is behaving like a child. She’s upset and lashing out over adjusting to her dad dating someone.",
          "id": 148,
          "comments": [
            {
              "score": 31,
              "content": "Yes, she's uncomfortable with dad dating, but she also has no boundaries. A 9-year-old kid with normal boundaries wouldn't dream of doing the things this girl has done (holes in the walls and mattresses, sharpie on the walls, cutting photos....). IF they did any of these things, the parent would enforce the boundaries. This dad did nothing at all, that's why her bad behaviour escalated. She desperately needs some limits limits, and dad is not providing them.",
              "id": 149,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Doesn’t really matter why she has no boundaries… she has no boundaries.",
              "id": 150,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 288,
      "content": "NTA. And I’m very sorry for the loss of your sentimental items.\n\nAnd yes, kick them both out. Her for destroying your property and him for his cavalier attitude about it.",
      "id": 151,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 286,
      "content": "Holy crap, NTA. None of this seems like \"normal\" behaviour for a child of that age. Unless she has some kind of developmental delay (I'm presuming not,  as it isn't mentioned) she is well past the age for all of these behaviours. I'd expect a preschooler to have issues with writing on walls and destroying photo albums. The destruction of mattresses, holes in walls, etc, seem like actions designed to drive you away for whatever reason,  and they appear to have worked.  \n\nI'd suggest getting Chrissy into therapy or family counselling, regardless of whether or not you continue to date her dad.",
      "id": 152,
      "comments": [
        {
          "score": 159,
          "content": "> *I'd suggest getting Chrissy into therapy or family counselling*\n\nAbsolutely.  This child sounds very, very angry.  If she is this out of control now, her adolescence will be a train wreck.  \n\nNTA",
          "id": 153,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 233,
      "content": "NTA. You didnt  throw a   year and half   down the drain due to pictures, no you did it because he doesnt parent and your home is getting destroyed, he doesnt respect you.",
      "id": 154,
      "comments": [
        {
          "score": 47,
          "content": "Literally, HE threw a year and a half down the drain for the reasons you stated!\n\nNTA, OP",
          "id": 155,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}