{
  "post content": "Ok so I turned 18 last December and have asked my dad if I could have a party since before then since my older sister had one a few years back when she turned 18. And main reasons/excuses/whatever for not having them have been the lack of time and money. I don’t even want anything huge just invite some friends to party and drink (legal age to drink is 18 here) and I hoped to host it at home for one night (same as my sister) especially since I haven’t been able to host a birthday party in the past couple of years due to Covid I was hoping I could have one since I turned 18 and it was kind of a big deal at least in my opinion and thought hosting it at home wouldn’t cost that much. But now it’s been over half a year and I still want to have the party but I feel weird and like an a-hole asking for it because money has been somewhat though for the past few years and I would have to ask my step mom and siblings to stay somewhere for a night if I had the party and also since it is closer to my next birthday but at the same time I feel like turning 18 is a bigger deal than turning 19 but anyway Reddit what’s your opinion and if you feel like I’m the a-hole please explain why so I can try to not be in the future\n\nEdit: also as to why I don’t just throw my own party since I’m 18. For a couple of reason including the fact that I’m currently a student without a job so I really don’t have the money to  rent a place where everything costs 3 times what it would if I did it myself and also my sister got to have her party at home but that could just be the sibling rivalry and jealousy talking",
  "id": 1,
  "comments": [
    {
      "score": 5,
      "content": "Youre 18. Throw your own party.",
      "id": 2,
      "comments": [
        {
          "score": 2,
          "content": "I agree with you.  Sometimes you have to give yourself what you wish others would give you. And if op throws their own party it can be the way they want it",
          "id": 3,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "Op you can throw your own party and ask people to contribute with something like a potluck to help keep the cost down or you could put a few bucks away every chance you can and have it next year",
      "id": 4,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": ">I would have to ask my step mom and siblings to stay somewhere for a night if I had the party \n\nI don't understand why they should they leave their home for a party you are describing as: \n\n>I don’t even want anything huge just invite some friends to party and drink\n\nMy parents threw football parties that sound wilder than that, and even as young children, we didn't leave our house during those.\n\nI'd say NAH. It sounds like there are legitimate reasons why you didn't get a party on or about your birthday. And there's nothing wrong with you wanting to have one. Though at this point in time, you may as well wait until the next birthday.",
      "id": 5,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) asked for a birthday party after over half a year since it was my birthday (2) it’s been over half a year since my birthday and is closer to the next one and money is a bit tight right now plus I’d have to ask my family to have the house for a night\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 6,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOk so I turned 18 last December and have asked my dad if I could have a party since before then since my older sister had one a few years back when she turned 18. And main reasons/excuses/whatever for not having them have been the lack of time and money. I don’t even want anything huge just invite some friends to party and drink (legal age to drink is 18 here) and I hoped to host it at home for one night (same as my sister) especially since I haven’t been able to host a birthday party in the past couple of years due to Covid I was hoping I could have one since I turned 18 and it was kind of a big deal at least in my opinion and thought hosting it at home wouldn’t cost that much. But now it’s been over half a year and I still want to have the party but I feel weird and like an a-hole asking for it because money has been somewhat though for the past few years and I would have to ask my step mom and siblings to stay somewhere for a night if I had the party and also since it is closer to my next birthday but at the same time I feel like turning 18 is a bigger deal than turning 19 but anyway Reddit what’s your opinion and if you feel like I’m the a-hole please explain why so I can try to not be in the future\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 7,
      "comments": [],
      "relation": "No"
    }
  ]
}