{
  "post content": "Throwaway account \n\nI (36 male) have a 16 year old daughter named Jane. Jane is a great kid and was really close to my mom until she passed away a year ago. My mother gave one piece of her jewelry to her children before she passed away. I was given her engagement ring. \n\nI have been planning a proposal to my girlfriend, Laura (30 female) for about 6 months now. Jane is from my previous relationship (her mother and I were never married). I’ve been dating Laura for about 5 years. \n\nI told Jane I was going to propose. She was happy about it and asked to see the ring. I told her I’d be using my mothers ring and Jane looked upset so I asked her what was wrong. She said she had assumed the ring would be hers since she is my daughter. I explained the ring was given to me and there are other heirlooms (small items like rosary beads) she can have. \n\nFor clarification I do have the money to buy a ring but the sentimental value of this ring is why I wanted to use it. Laura also helped us take care of our mom while she was sick and they were close. \n\nI proposed to Laura with the ring and she said yes. After this happened Jane cried to her uncle (my brother) about it and he understands both points. His wife thinks I’m an AH so do some other family members. I obviously can’t take it back from Laura when I already proposed. \n\nAITA?\n\nEdit: \n\nThe ring was given to me not Jane. \n\nLaura has known my mother her whole life our mothers are best friends and have been hinting we should get married as long as I can remember.\n\nUpdate: \n\nMy daughter and brother decided to call my father to come to my house and talk to me. Laura was out to dinner with her friends. \n\nMy daughter and brother explained to my father their thoughts on the situation. I stayed quiet while they explained their point so that my father could really hear what my daughter was saying and so I could also hear her out. My father is a marine veteran and very blunt. \n\nMy father stopped them and said he’s heard enough. He said my mother would have wanted Laura to have the ring and Jane isn’t showing fhe maturity to receive an heirloom right now. He told her he’s disappointed in her entitlement and that she needed to get her attitude in check by his next visit. He also reminded everyone Laura’s been family for years even before we were together even if it’s not by blood. \n\nMy daughter said yes sir and isn’t happy about the outcome but accepts my father saying this is what my mother wanted.\n\nFinal update: \n\nSince everyone wants to know Laura’s take here we go. I told Laura what was going on and that Jane is upset. I also told her the ring is hers now and she can decide who it is eventually passed down to. I know a lot of people won’t agree with this but it’s what I’m doing. \n\nWe have a pre nup in the works for other properties we own. Laura suggested adding the ring just for secure minds and we agreed we would add that it would be given back to the family if we were to divorce. \n\nLaura will not be passing on the ring unless she passes away. That is my fathers request to her and she is honoring that. \n\nWe have spoken to Jane and I have explained all of this. I’ve explained she’ll always be my daughter and that won’t change. She understands. She apologized to Laura and me for her behavior and explained she was just upset. Laura had a one on one talk with her as well about how she loves her and isn’t trying to replace anyone or change the family dynamic we have. Jane seems to feel better.\n\nUpdate: \n\nLaura might be pregnant. Jane does know.\n\nUpdate: \n\nThe ring has been added to our will. We have decided to continue the tradition I started of the ring going to a son to give to his wife. If we do not have a son then the ring will go to a grandson or to my nephew. Since the ring will not be given to anyone until we pass we are not telling Jane that has been added to the will.",
  "id": 1,
  "comments": [
    {
      "score": 13711,
      "content": "After reading all your comments, YTA. \n\nOf course, you can speak to your fiancé and tell her that you hurt your child and made a mistake.  You communicate with her and buy her a new ring.\n\nBefore reading your comments, I was N A H.  Your daughter’s feelings are valid, it’s a family heirloom.  But you are correct too, it’s your ring, your fiancé was close to your mother.\n\nBut your comments make it clear that your an AH.",
      "id": 2,
      "comments": [
        {
          "score": 4553,
          "content": "He’s trying to Justify his actions. Because OP thought he would come on here and everybody would be on his side.   Only to find out that it seems like 95% of the people here think he’s  an AH.",
          "id": 3,
          "comments": [
            {
              "score": 2134,
              "content": "I'm actually surprised and glad that people are calling him an AH. I expected every comment to be like \"NTA she is not entitled to it\"",
              "id": 4,
              "comments": [
                {
                  "score": 3959,
                  "content": "In a vacuum, I don't *not* feel that way. It was given to OP, he's using it for its intended purpose, it was never promised to Jane, and being denied the ring won't materially affect Jane's life the way being denied, like, support for college would.\n\nI think the crux of why OP's being an asshole is just... the bigger context, what this all kinda says about how he's treating his kid and navigating a blended family. Jane was very close to her grandmother (and per comments her mother's in prison, so having another maternal figure in the family is probably a big deal). And now OP is getting married. I don't think kids should get to veto their parents' partners just to be resistant to change, and at a certain point you just have to adjust, but OP, in choosing to pass the ring to his partner instead of his kid, is symbolically communicating some fucked up things. That Laura was more meaningful to his mother than Jane was. That Laura is generally more of a family member than Jane is — especially because, given that it's an heirloom, Jane's probably envisioning the ring passing to her much-younger half-siblings, cementing the \"You'll have a cohesive age-appropriate nuclear family with your *real* kids and I'll be an awkward shameful hanger-on\" anxiety that a lot of kids in her position have.\n\nOP's actions just seem almost *designed* to twist the knife in every insecurity and grief that Jane has. Like yeah, it's OP's ring to do with as he likes, and in the grand scheme of things a material object itself is not that important. But Jane is a child, grieving an important maternal figure *while* adjusting to OP's marriage and the changes it'll bring to her home life *while* coming from what's likely a background of a fraught relationship with her bio mother and general instability. She wanted to feel connected to her grandmother, and feel secure in her place in her family. The fact that OP is obtuse and defensive about that his daughter's emotional needs here... upsetting, and I hope it doesn't speak to a bigger picture of how he generally treats her.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 741,
                      "content": "I will happily admit to being obtuse if someone can show me why, but I did not get nearly as much out of the OP's postings as others seem to have.  I wonder if there is some \"unwritten family jewelry\" rule of which I am unaware.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 540,
                      "content": "The crux of everything wrong with this subreddit is people like you that think you can read into the lives of multiple people, discern their qualities and even their thoughts and motivations, all based on a couple paragraphs about a single subject.   \n\n\nThis subreddit is about discerning if an action or statement in the context of the moment is \"asshole behavior\" not whether or not you sages will judge their entire lives and their souls.   \n\n\n>She wanted to feel connected to her grandmother, and feel secure in her place in her family. The fact that OP is obtuse and defensive about that his daughter's emotional needs here... upsetting  \n\n\n**HIS MOTHER GAVE HIM A WEDDING RING AND HE USED IT TO PROPOSE TO THE WOMAN HE LOVED HOW IS THIS ABOUT HIM RAISING HIS DAUGHTER?**",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 183,
                      "content": "It’s his ring if grandma had wanted Jane to have it she would have given it to her",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 165,
                      "content": "I agree with your first paragraph. You actually listed out all the ways the OP is NTA, and that's what OP should be, NTA. The engagement ring was given to OP, not Jane. It was given and intended to be used exactly as OP had used it, to propose to his wife with it. The wife then becomes a member of OP's family and then passes it on to the next generation. That's exactly how family heirlooms work, and I'm sure it was the same way how the grandmother received her ring as well. There is NOTHING WRONG with what OP did.\n\nYour second paragraph seems to make sense on the surface, but it does not explain one thing, \"why does Jane need this particular ring to feel connected to the grandmother\"? You are forgetting that Jane probably had already inherited other things from her grandmother, so why does she want this specific ring to \"remember\" her by? Should Jane get the ring just because she wanted it? And if the grandmother really wanted Jane to have the ring she would've given the ring to Jane, not OP.\n\nThis post actually showcases how easy it is to manipulate the opinions of the average Redditors. Just add a child to the story and suddenly the OP is TA. Suddenly Jane is the \"real\" granddaughter and the wife is just an outsider to the family, and the future children of OP and his wife are just \"half grandchildren\" to OP's mom.\n\nJust think, would your opinions change if it was OP's niece demanding for the ring, instead of his daughter? I bet most people would be saying that OP is NTA and telling the niece to go pound sand.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "This just smacks of zoomer entitlement and obsession with material things IMO. His fiancee is going to wear the ring for its intended purpose. His daughter is 16. What is she going to do with an engagement ring? And why is everyone ignoring grandma's wishes? She gave the ring to her son, the intent is so obvious.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 23,
                      "content": "I just feel like this is reaching. Like REALLY reaching.",
                      "id": 11,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 22,
                      "content": "He's not marrying his daughter - why would he give her an engagement ring?\n\nWhat is she going to do it with? Take a vow of celibacy?",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 15,
                      "content": "But like that’s not how engagement rings work…it’s given to someone to um get engaged not keep passing down and never used. That makes no sense.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 10,
                      "content": "You’re literally making up a story about this family to justify your feelings.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": ">But OP, in choosing to pass the ring to his partner instead of his kid, is symbolically communicating some fucked up things. That Laura was more meaningful to his mother than Jane was. That Laura is generally more of a family member than Jane is\n\nThis is the most dramatic interpretation of this possible.\n\nIt is so utterly *normal* for a child to use an heirloom ring to propose to their fiancee. People come on AITA to talk abut that all the time! It's even sweeter because Laura took care of her future MIL when she was sick and was close to her.\n\nThere are other item that Jane can get from her grandmother. The simple truth is she wanted and expected this specific thing and she's upset that she didn't get it. It's OK to be upset, but it's absurd to attribute these expansive malicious communiques to this action. This is OP's *mother.* He's her son. Jane's not the only one who had an important connection with the woman and a vision for what to do with the ring. The difference is the ring was actually *his*.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "Yeah I don’t get it. It clearly seems like his mother was hoping for him to propose to his fiancé considering her long relationship with her mother…\n\nIf the ring was meant for the granddaughter she would have left it to her. Plus if she did have it then what? She would give it to a future partner to then propose to her with?",
                  "id": 16,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Can you explain why Jane is entitled to the ring? Over all the other grandchildren?",
                  "id": 17,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 471,
              "content": "I particularly love how he edited the post to highlight the parts he thinks justifying himself while ignoring all the reasons he's the AH.\n\nIf you have to misdirect to make your point, you're always the ah.",
              "id": 18,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 148,
              "content": "YTA Come on, man. Rosary beads? Daughter should take precedence over your fiancé. It’s a family heirloom  from her grandmother. YOU aren’t going to wear it. My grandmother promised me her diamond ring. She designed it, and the stones were from her mother’s ring. I’m the oldest granddaughter and we were very close. When I was abt 38, she said it was time, and gave me the ring. I don’t have sisters, daughters or granddaughters, so when the time comes, I’m going to pass my jewelry on to my nephew’s daughter. She’s in her mid teens now, and a lovely girl. Actually, my mom and I were talking about what to do with all of her jewelry as well. A bunch is in a safety deposit. I’m encouraging her to sell some of the costume jewelry. She has some nice pieces. My dad was always buying her things.",
              "id": 19,
              "comments": [
                {
                  "score": 39,
                  "content": "Yeah OP's not going to wear it, why do you think his mother gave it to him then? Did it have something to do with the girlfriend that she wanted him to marry?",
                  "id": 20,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "Your grandmother promised you. Hers did not. Simple.",
                  "id": 21,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "I mean, that only says that your family doesnt have unmarried men. Op is unmarried man, who's mother was telling to op to finally to propose. This ring is basically the last message to him to finally propose. If granny wanted to the girl to have a ring - she would have gave it to her. But the message here is clear - she wanted him to propose with it. And rosary is very acceptable memento of grandma.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "What the heck else do you get from a grandmother? Rosary beads seem appropriate.",
                  "id": 23,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 15,
                  "content": "What Jane would do with the ring? Propouse someone? It is not her ring, she and a lot of ppl here can not respect that.",
                  "id": 24,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "This past Christmas, my mom gifted her jewelry to us, her daughter's and granddaughters, that my dad has given her over the 60 years that they've been married. She did it so she could see us enjoying the jewelry. It's very special and a symbol of their love and the family that they have created. Maybe your mom should give it as gifts before she passes.",
                  "id": 25,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I’ll suggest that to my mom. She has two granddaughters. One is NC. The other is single, and is an aeronautical engineer. Don’t think she wears much jewelry, but I’m sure that she would appreciate the sentiment of a gift from my mom.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Right. She gave YOU the ring. Like his gave HIM the ring. HIS ring. If she wanted Jane to have it, she'd have given it to Jane. It's an engagement ring not a heirloom ring. She wanted him to propose with it. Why is this so hard for people?",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 5,
                  "content": "Why does a sixteen-year-old need an engagement ring? What *other* intention would a mother whose son has been dating her best friend's daughter for four years have with giving him the engagement ring? Why is OP an asshole for doing what he wants with his own property without catering to his teenage daughter's every whim?\n\nYour grandmother specifically gave you the ring. Jane's grandmother did not do that. She gave it to her son, who I again point out was in a long-term relationship at the time with someone she loved.\n\nIt's wonderful that you want to pass your grandmother's ring to your nephew's daughter, but you see how this is completely your choice? OP gave his ring to his *wife*.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "What actions is he trying to justify? I really don’t understand what everyone thinks this guy did so wrong?",
              "id": 29,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3002,
          "content": "I skimmed through OP’s comments and I’m not really sure why you shifted from NAH to YTA – I probably just missed one, but anyone want to fill me in on what in them makes him the AH?\n\nI… Think it’s a little weird someone feels like she’s supposed to inherit her grandmother’s engagement ring, when it was given to her father (with, as far as I can tell, there was no discussion it was intended from him to, or suggested that he was, going to pass it down – at least, that’s what he says in the comments).\n\nI mean, *traditionally*, when mom/grandma gives their engagement ring to their son/grandson, it’s so that they can use it to propose to the woman they love, etc. Of course, it’s A) not *usually* handed down on her death bed, and B) not usually someone with a kid out of wedlock.\n\nWhich… Is why I’m sitting at NAH, and asking why the shift. OP’s intentions seem… Normal, and very in-line with societal norms. Unless OP’s mother wanted it to be an heirloom passed down to her granddaughter (at which point IDK why she wouldn’t have just given it to her, and/or asked OP to hold it in trust for his daughter…), I… Don’t think he’s doing anything wrong?",
          "id": 30,
          "comments": [
            {
              "score": 1229,
              "content": "Exactly. My vote is NTA. It makes no sense that the daughter would just assume it'd be given to her. I'm shocked at all the AH judgments.",
              "id": 31,
              "comments": [
                {
                  "score": 827,
                  "content": "Because OP brother's gave the jewelry heirlooms they received to their daughters, but OP found out after he proposed to his girlfriend, so it signifies is not a family tradition to give the inherited jewelry to their kids, otherwise OP would've know about that. And his girlfriend is the daughter of his late mother's best friend. Girlfriend knew the mom since childhood and helped to care for her, so I don't get the AH judgment either, makes no sense\n\nNTA",
                  "id": 32,
                  "comments": [
                    {
                      "score": 640,
                      "content": "I also have a feeling that his mom gave him that ring because of who he was with. Seems like her telling him it’s time and maybe to remember the two moms always trying to put them together.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 17,
                      "content": "I haven't seen it mentioned anywhere, but I'd LOVE to know what jewelry the brothers received because that also makes a difference!\n\nLike, \"unmarried son receives mom's engagement ring\" has a very clear, established use case! But \"married family-man son receives mom's earrings/bracelet/necklace\"? Unless he's planning to make a very specific fashion statement or mount it in a shadow box, what is there to do with it other than immediately keep handing it down?",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "His brothers did what they wanted they’re already married",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 4,
                      "content": "Ahhh so that's why the daughter assumed. I don't think she's the ahole either. Why wouldn't she think she'll get the ring? She's a child, and she saw that her cousins got their heirlooms, of course she will think she will also get heirlooms because she will think that's how it works. Like OP still did nothing wrong but I can see why the daughter is upset. She thought the ring would go to her.",
                      "id": 36,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "No it doesn’t? It doesn’t signify a family tradition. It may be what he wanted to do as its woman’s jewelry and what will he do with it? It makes perfect sense to give it to his fiancé and when his fiancé dies I’m sure his daughter will get it. That’s how heirlooms work. One generation to the next as they die.",
                      "id": 37,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 443,
                  "content": ">I'm shocked at all the AH judgments.\n\n\nI'm not, it's pretty standard for this sub. This story involved a father making a decision that upsets his daughter and a step parent. People lose their minds in these kinds of stories.\n\n\n\nSeriously so many comments are implying that Laura is not real family and even going so far as to say this single act means OP is ditching his daughter to create a new family.",
                  "id": 38,
                  "comments": [
                    {
                      "score": 227,
                      "content": "I … hate this sub sometimes. That’s such a twisted way of seeing things. I’d never imagine a daughter would be given her grandmothers engagement, when her father has a partner to be proposing to that his mother loved and wanted in her family. The objection feels very entitled and nonsensical",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 16,
                      "content": "big 16 year old girl energy in these comments.",
                      "id": 40,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 16,
                      "content": "Ok, cool, cuz I thought I was crazy. I’ll never forget the “my dad won’t buy another 30K wedding for me” post... Entitled to the max",
                      "id": 41,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 154,
                  "content": "I'm sticking with NTA as well. I don't see how any of his comments make him the AH. It literally makes no sense for the grandmother to give the granddaughter her ENGAGEMENT ring. Usually, the engagement ring is given to the son/grandson because they want them to use that ring to propose to someone they love. Of course, that doesn't me they HAVE to, but that's typically the reason. I could see her being upset if it was her grandmother's wedding ring, as that is typically given to a granddaughter if they are close. Again, this isn't always the case, but this has been my experience.\n\nI think the father's best move is to sit down and talk with his fiance and suggest passing the ring his daughter's boyfriend/girlfriend for him/her to propose with. This way the ring stays in the family and the daughter gets the ring when it is appropriate.",
                  "id": 42,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 125,
                  "content": "Right there with you. \n\nAnd nobody has even CONSIDERED that Laura could choose to pass it on to Jane (or her partner) when she gets to that point and is getting married, or she could let Jane have some of the stones from the ring to use for her own engagement ring and replace them in hers. Like…the kid is 16. She’s likely got plenty of time before she gets to that stage in her life. \n\nI also don’t think that it was a coincidence that the ONE piece of jewelry his mom left him was an engagement ring after she’s been hinting at him that they should get married. She did that for a purpose.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 14,
                      "content": "I’m surprised there aren’t more comments about the mom giving that specific piece of jewelry to that specific son for a reason. NTA.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I vote NTA. Since Jane and her grandmother were so close, seems like grandma would have given the ring to Jane if she wante# her to have it.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "It's also assuming that her future fiancé will be ok with her using the ring.  What if he has a ring that's special to him that he wants to give to her?  It's the proposer's decision on the ring when THEY propose.  I understand she's disappointed but the ring was handed down to him....his fiancé has known his mother her entire life and helped care for her.   He inherited the ring so it was his to use as he liked.",
                  "id": 46,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "My mom got my grandmother’s engagement ring when she passed. My mother has let all the grandsons know if they want the ring for their wives, they are welcome to it, whoever asks. If none of them do, it’ll come to me. Do I care if I don’t get it? Not really, I already will be getting a ring that was my great grandmother’s. But it would be nice to pass along to my daughter, because she shares a birthday with my grandmother.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "It’s a reflection on the really insane parenting ideals that seem to be the norm right now.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 374,
              "content": ">skimmed through OP’s comments and I’m not really sure why you shifted from NAH to YTA\n\nI did too and I'm so confused by these comments. Since when are fathers expected to gift their daughters engagement rings? Wouldn't she get a ring from her future partner? What am I missing?",
              "id": 49,
              "comments": [
                {
                  "score": 70,
                  "content": "Adding to your thoughts, wouldn’t OPs mum have said something specifically (if in a will) if OP was meant to hold onto it until the right time for his daughter? It seems it was clearly gifted/bequeathed to him and he is letting it add value to his life by proposing with his long time gf. Seems OPs mum seems to think he’d need it? Added bonus that OPs fiancée has known his mother a very long time too.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 291,
              "content": "I have no idea why the top comment is calling him an AH. The grandkid isn’t entitled to the ring. If grandma wanted to leave her something, she would have. I actually have an inkling that OP’s mom gave a male kid her ring intentionally assuming he’d use it to propose to Laura. NTA.",
              "id": 51,
              "comments": [
                {
                  "score": 84,
                  "content": "Right? Like, OP’s mother knew Laura, was lifelong friends with her mother, and regularly hinted they should get together, up until a year ago when said matriarch passed away, shortly after giving OP her engagement ring.\n\nIf OP’s mother *didn’t* want him to use it to propose to her, I’d be shocked. Hell, she probably hoped he would do it *before* she passed, as the ultimate passive-aggressive “YOU SHOULD REALLY PROPOSE TO HER BEFORE I DIE” hint.\n\nBut then, my mother still thinks I should marry my father’s best friend’s step-son, the one who makes a living off reiki crystal healing and shit, while I’m the absolute antithesis of anything “mystic” or faith-based; so I’m a little biased in the realm of enduring the never ending hint-dropping.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 284,
              "content": "I haven't skimmed OP's comments and this response is not about this post but rather in general, but it is often suggested that heirlooms NOT be given to spouses marrying in to the family, because giving them as a gift means they legally don't have to give them back, and if they split up then the spouse can legally keep the heirloom. Legal caveats apply to engagements rings, etc.",
              "id": 53,
              "comments": [
                {
                  "score": 207,
                  "content": "It’s suggested but lots of people still do it.\n\nIf he’s been with the GF for years and the GF was the mother’s best friend’s daughter, I would think Grandna expected he would give it to her? Hence why he got it and none of the other siblings?",
                  "id": 54,
                  "comments": [
                    {
                      "score": 198,
                      "content": "[deleted]",
                      "id": 55,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 8,
                  "content": "It depends on the heirloom, I have never seen an instance where someone who is getting engaged gets passed down their mother/grandmother's wedding ring and it isn't used in the proposal. Just because it means that there's a possibility it's lost in case of a divorce passing down engagement rings as an heirloom is almost always so it can be used as an engagement ring. It's not like his grandma passed down an heirloom necklace that meant the world to the daughter and he just gave it as a present to the fiancé.",
                  "id": 56,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Depends on the state and who breaks up.  Many states say if the person getting the ring breaks up with the person giving, the ring returns to the giver.   That's my state law as well.",
                  "id": 57,
                  "comments": [
                    {
                      "score": 4,
                      "content": "I think it's more that the ring is considered part of the marriage contract.  If the terms of the contract (the legal marriage) are not met, then the ring gets returned.  If they are (i.e. the marriage certificate is signed), then out of luck.\n\nGrandma's intention was pretty clear, and fiance has a right to the ring during her lifetime if they marry.  Daughter is not entitled to anything.  The ring was her Dad's legacy.  Whatever he leaves her (and I hope he's arranged for her not to be cut out if fiance outlives him, as remarrying parents should do) will be hers.  \n\nIf this couple have another child, the ring might very well go to that child instead since the ring will also have accrued meaning for Stepmom.  That's going to be hard for Daughter to swallow, but if it does she's going to have to accept that will be Stepmom's right.  They could have no further children and fiance could leave Daughter everything, but Daughter can't count on that.  Fiance is 30, and this marriage might very well produce at least one child.  There are just so many heirlooms to go around, and eventually someone is going to get one while someone else doesn't.",
                      "id": 58,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "People are carrying on like it's some generations old heirloom, it was his mother's engagement ring that presumably his dad bought to propose to her with. High sentimental value for sure, but not old and passed from heir to heir only.",
                  "id": 59,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "The spouse marrying INTO the family becomes a part of the family.  The legal caveats are pretty much antiquated, at this point.  Gift law is normally applied by most jurisdictions, not ancient betrothal law.",
                  "id": 60,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            },
            {
              "score": 177,
              "content": "Yeah I'm not quite sure about that. My husband gave me his grandmother's ring as an engagement ring and while I do intend wholeheartedly to give it to my daughter if she wants it, he wouldn't have just immediately assumed to give it to his child over his wife. The cherry on top too is that the fiance was close to the grandmother! It just doesn't make a lot of sense...",
              "id": 61,
              "comments": [
                {
                  "score": 68,
                  "content": "My husband’s mom always intended to give him her engagement ring, specifically for him to propose with it if he wanted to. She made it clear it was going to him regardless of what ring he chose to use.\n\nHis sister was unhappy about it, but we’ve moved past it, I think. I’ve known SO many male friends who have/had the same arrangement with their mothers. Like, I can think of 8 friends right off the bat, married and yet to be married. It’s not unheard of at all and I’d say even it’s common in a lot of places in the US, at least. NTA from me, it seems weird that the daughter would assume she’d get it if there was literally no hint at it going to her. I understand that there are traditions of jewelry going to daughters, but as I said, this is a relatively common thing for mothers and sons in my experience.",
                  "id": 62,
                  "comments": [
                    {
                      "score": 4,
                      "content": "OP also mentioned he had other possessions from grandma to give to his daughter. It’s probably one of those cases that she got an idea in her mind, got her hopes up. And was disappointed when it happened. I don’t think she’s a bad kid for it, but people react differently to grief. What weirds me out is that a lot of commenters seem upset that the daughter isn’t getting a specific heirloom and not about the fact OP wants to honor his own mother’s wishes. Children are attached to their park as much as their grandparents, and nobody seems to be considering how his mother’s death may be affecting him as well. (Totally not his daughter’s fault. Just surprised at a lot of commenters).",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 90,
              "content": ">Laura has known my mother her whole life our mothers are best friends and have **been hinting we should get married** as long as I can remember.\n\nThis update solidifies the NTA vote for me. Clearly his mother gave him the ring so he could propose to Laura. I don't understand the AH votes either.",
              "id": 64,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 73,
              "content": "Exactly. I don’t think OP is an asshole, this seems very normal",
              "id": 65,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 64,
              "content": "Apparently his brothers are passing their mother's heirlooms to their daughters.",
              "id": 66,
              "comments": [
                {
                  "score": 169,
                  "content": "[deleted]",
                  "id": 67,
                  "comments": [
                    {
                      "score": 81,
                      "content": "Exactly, if my brother gives his kid a brand new car for their graduation, that doesn't make me an asshole if I don't do the same for my kid.",
                      "id": 68,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 71,
                  "content": "Maybe his brothers are already married, or didn’t get engagement rings handed down. It’s not comparing apples with apples",
                  "id": 69,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 39,
                  "content": "Good for them, but that doesn't bind the OP to do the same.  If his mother wanted the Granddaughter to have it she would have given it to the granddaughter.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "Also it's an engagement ring...you're meant to engage with it. Mum probably got it from Dad, I don't she got it passed down by grandma",
                  "id": 71,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Yeah but what are those heirlooms? A pair of earrings given to a son, vs an engagement ring given to a son, is a VERY different context",
                  "id": 72,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "That's their choice.  Also, didn't grandma give her something?",
                  "id": 73,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 60,
              "content": "Glad it's not just me. Seriously confused myself",
              "id": 74,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 40,
              "content": "I skimmed through a lot of comments format he OP and I'm like... The rosary would be way more meaningful to the dtr than that ring and he is getting a prenup and said he would give it to her future spouse to propose to her with... I ... How is he the AH?!?! Maybe he is exaggerating to make the daughter seem worse but still NAH",
              "id": 75,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 472,
          "content": "Did he delete some comments?  I'm completely missing whatever made it clear he's an AH.\n\nIf OP's mother wanted to give the daughter the ring, she would have given the daughter the damn ring.\n\nIt's bizarre to me to assume that OP's mother didn't give her single son her engagement ring with anything other than the express intention that *he* use it to propose to a future wife she wasn't going to be around for.  WTF?",
          "id": 76,
          "comments": [
            {
              "score": 195,
              "content": "I am very confused too. His mother gave him the ring, she knew he was in a long-term relationship, he says she and his fiancée’s mother had hoped they would get married. It sure sounds like she knew he’d use it to propose. \n\nMy grandmother told me she wanted me to have her diamond earrings after she died but my immediate family was away for my brother’s wedding when she passed and they held the funeral services. My aunts and uncles had her buried with the earrings on. It hurt but I don’t hold it against anyone…things happen and life is tough and confusing when people die. I’m happy to have her rosary and a couple other things.",
              "id": 77,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 292,
          "content": "I don’t understand why he couldn’t have both with some tact and communication. Tell Laura you know Jane would want family ring, but you also want Laura to have it. “Hey Laura, when Jane is ready to get married I will upgrade your rings and Jane can have family heirloom” if Laura’s not cool with that, then he can just buy her a new ring and save heirloom for Jane. Tell Jane, “hey Jane I know this means a lot to you. Laura meant a lot to grandma too. I’m proposing with grandmas ring, but it will be yours when the time comes”",
          "id": 78,
          "comments": [
            {
              "score": 53,
              "content": "Exactly my thoughts, thank-you for expressing them perfectly!  Done deal, everyone's happy.\nOP and Laura have loads of time to have a replacement ring designed however they want.  A replica or whatever blows their hair back by then. Jane gets it, all good.  Compromise is a powerful tool.\nWhy is it assumed Laura would be tyrannical about an alternative plan?  Like the ring is more important than Jane??  \n\nShe's been in OP's family forever, helped take care of OP's Grandma. AND, has a great relationship with Jane who wants happiness for her stepdaughter as well.  Assuming she'll, or Jane for that matter will both freak out at a compromise are jumping to a lot of conclusions.  Communication is another great tool.  Not all women lose their gotdam minds over rings like immature idiots.  They all need (the 3 of them) to talk it out openly so Jane feels better, and feels included.  Whatever they decide... that's what will be best starting out their new blended family on a healthy foot.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Unless HE wants Laura to have it because the ring is his not his daughter.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 5,
              "content": "Why? The ring is OP's as given to him by his own mother. His daughter has no right to it. What woman wants to be proposed to with a loaner ring? He's used it to propose, it belongs to his fiance now. That's it. There is no need for a compromise when the daughter has zero right to the ring. The fiance knew OP's mom her whole life, took care of her on her death bed and OP's mom wanted him to marry her. Finally there was no stipulation that the ring should go to the daughter by grandma. So, OP should not give into his daughter's tantrum and promise his fiance's ring to his daughter now or in the future. It's not hers and not even his anymore.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 147,
          "content": ">Of course, you can speak to your fiancé and tell her that you hurt your child and made a mistake. You communicate with her and buy her a new ring.\n\nAnd of course he can speak to his daughter and tell her that the ring was never hers,  was never promised to her, there was never a presumption by anyone but her that it would be hers, and it's NOT a mistake when a parent gives a child a wedding ring to use it for their own marriage. It's actually very normal.    \n\n\nNone of you claiming he's the asshole ever offer up a justification for why he is not entitled to the ring HIS MOTHER GAVE HIM. It was *HIS* MOTHER. Not his daughter's mother. **HIM**. HIS MOTHER. THE ONE WHO RAISED **HIM**. *NOT HER*. SHE PERSONALLY GAVE **HER SON** THE RING. But somehow he's an asshole for using it? That alone is bullshit. But further **HIS MOTHER** knew his fiance and loved and cared for her too?   \n\n\nThe CHILD in this story just felt greedy and wanted it out of the blue, so you determine this man's entire life and soul to be bad? No explanation at all. No logical step process where his feelings, his relationships don't matter.   \n\n\nWell shit. I was REALLY close with my grandparents. I spent more time with them in their final years than either of their children. I feel like I should have inherited their money and property. I guess my father and aunt are ASSHOLES for not giving me what their parents left them because I felt bad.",
          "id": 82,
          "comments": [
            {
              "score": 21,
              "content": "THANK you!",
              "id": 83,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 20,
              "content": "Look at the update even his father who was married to OP's mom didn't agree with the daughter getting the ring and had said he was disappointed in her.My guess is the ring must have been really beautiful and now this child want it and is throwing a tantrum when she didn't get it.And I'm really glad there sane people in here.\n\nWatching them call him Asshole just made loose my mind.\n\nNTA OP.",
              "id": 84,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "You're right, apart from (hopefully) the greedy part.\n\nIt's a time of grief, it's easy for someone to feel left out and like they were valued less than others by someone they loved. I can understand a teenager feeling disappointed by not having a special thing from them, I think it can feel really important at that age, especially something as intimate as jewelry. Especially when her cousins ended up getting something.\n\nBUT... Everything else, yeah. Obviously NTA and why the fuck are so many entitled sounding redditors saying he is? So confusing, these answers.",
              "id": 85,
              "comments": [
                {
                  "score": 6,
                  "content": "Most of her cousins got absolutely nothing at all, plus Jane was offered other things and had turned them down because she only wants that one ring",
                  "id": 86,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 147,
          "content": "What is with you people? The girl feels entitled to a ring that was not given to her and you're all on her side? It was given to the OP to decide what to do with it, just because a child had decided she wants it it doesn't mean she should be given the ring.\n\nThe daughter needs to be taught, she won't always get what she wants just because she throws a tantrum and complains to a few people. I hope the OP will not give in.\n\nNTA",
          "id": 87,
          "comments": [
            {
              "score": 25,
              "content": "I get the feeling that a lot of people are projecting their own personal problems with their fathers onto OP. NTA",
              "id": 88,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 124,
          "content": "I’m so confused with the YTAs. Am I missing something?",
          "id": 89,
          "comments": [
            {
              "score": 70,
              "content": "I don’t understand it at all. Just because the daughters upset doesn’t mean she automatically has a claim over the ring. I don’t see where OP is wrong here at all",
              "id": 90,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 23,
              "content": "No, you're not.  The people claiming he is the AH are missing a defensible argument, though.",
              "id": 91,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 14,
              "content": "I'm right here with you! So confused!",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "People thinking sadness means parent did wrong. Why can’t she accept other things of grandma? In fact, cousins didn’t get grandma’s engagement ring. They got other stuff",
              "id": 93,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 52,
          "content": "I disagree it was given to op and not the daughter while her feelings are valid and it’s sad she was upset but she was never promised the ring it is her father’s inheritance so to speak NTAH",
          "id": 94,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 14,
          "content": "I don't get it . Why would he be an asshole ? He got the ring from HIS mother. It's an ENGAGEMENT Ring . Why would he not use the ring for an engagement ??\n\nIf it was some other piece of jewellery i would have considered him an asshole . \n\nHis fiancee has known his mother for majority of her life and his mother approved her . I think she would have been happy about it too.",
          "id": 95,
          "comments": [
            {
              "score": 11,
              "content": "That's where you're wrong, all the spiritual mediums on this sub have concluded the mom actually meant for Jane to have it, case closed",
              "id": 96,
              "comments": [
                {
                  "score": 10,
                  "content": "Of course! How could we have missed something so obvious?! ^(/s)",
                  "id": 97,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 13,
          "content": "She can be upset but it crosses the line into deranged entitlement when you think you deserve someone's inheritance more than they do.",
          "id": 98,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2421,
      "content": "YTA\n\nThe ring should have been Jane's. \n\nFind out if Laura would accept an exact duplicate of the ring and exchange that for the heirloom for Jane.\n\nOtherwise I predict you will have a very unhappy daughter who will resent both you and her future stepmother for a long time. \n\nIf I were Jane, I too would be deeply hurt that a ring that belonged to my grandmother was given to a non-blood relative.",
      "id": 99,
      "comments": [
        {
          "score": 3852,
          "content": "If the ring \"should have been Jane's\", then her grandmother SHOULD have given it to Jane. But she didn't. She gave Jane something else, and GAVE the ring to her son. Jane isn't entitled to something just because she wants it.",
          "id": 100,
          "comments": [
            {
              "score": 694,
              "content": "OP said all the other uncles gave their children the heirlooms the grandmother gave them, so it's reasonable that OPs daughter thought she would get this heirloom, too.",
              "id": 101,
              "comments": [
                {
                  "score": 2225,
                  "content": "Whatever his brothers decided to do with the items left to them is irrelevant. That was THEIR choice, it didn't mean he had to do the same. He was dating a woman who was the daughter of his mother's best friend. A woman his mother knew for her entire life, and who helped care for her while her health declined. It is extremely likely, that the reason OP even got the engagement ring from mom, was because she had a good idea that he would use it to propose. Otherwise she could have told him to keep it in trust for his daughter.",
                  "id": 102,
                  "comments": [
                    {
                      "score": 494,
                      "content": "I agree with you, and besides it's kinda weird wanting an engagement ring from anyone other than a romantic partner. What's the daughter gonna do with it, give it to her bf so he can propose with it?",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 176,
                      "content": "I think you are absolutely right.\n\nMy mom has very specific instructions for whenever she passes that she wrote into her will: I, as her only daughter, inherit all of the jewelry. However, I am responsible for making sure her granddaughters (my nieces) also receive some of the jewelry, which yes, absolutely. I will also make sure my sisters-in-law also have pieces. However, I alone will keep my grandmother's wedding and engagement rings. It's in her will to prevent fighting over those items.\n\nOP's mom wanted OP to have the ring, and it doesn't matter what the siblings have done. Jane should not automatically assume it belonged to her, and if OP's mother had wanted it to go to Jane, it would have been spelled out verbally or written into her will.\n\nOP is NTA here.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 104,
                  "content": "A person's kid is not entitled to the same gifts that their cousins get from their parents.   How does that even make sense.",
                  "id": 105,
                  "comments": [
                    {
                      "score": 46,
                      "content": "riiiiiight? i dont get how that made OP shitty",
                      "id": 106,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 14,
                  "content": "The rest of the heirlooms were most likely not an engagement ring.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Which OP found out about it after he proposed",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "The brothers don't get to dictate what he does with his inheritance.  NTA.",
                  "id": 109,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Yeah she'll think that, but that doesn't mean it's supposed to go to her just because she thinks it will. Those uncles chose to give their heirlooms to their children. Of course the daughter will think this is how it works, but that's a misunderstanding. The father did not choose to do that, and it was his choice.",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "Why though?\n\n>My cousins got something! I need to too! Wah!\n\n\nHow is this not the daughter being an entitled brat?",
                  "id": 111,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 6,
                  "content": "That’s a big assumption based on context that OP did not create. Important lesson for the daughter. In no way an obligation of the father. It’s his ring. Super simple concept...",
                  "id": 112,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 3,
                  "content": "There were other heirlooms given to father that he offered Jane.",
                  "id": 113,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 222,
              "content": "I’m confused by the “should’ve been Jane’s.” Lots of moms give their sons their engagement rings to use in proposals. It doesn’t seem weird to me that he’d want to give it to his partner. If he was already married, I’d understand why the daughter would have the expectation of inheriting it.",
              "id": 114,
              "comments": [
                {
                  "score": 209,
                  "content": "Because, in the world of Reddit, a teenager's expectations and feelings are more important than anything else in the world. \"She lost her grandma!\", and.....OP lost his mother, but apparently his feelings don't matter. Too many people are acting like his fiance is some random chick that just came along, and not like the woman who has known his mother for her entire life, had an extremely close relationship, and cared for her when she was dying, while in a long term relationship with her son. His fiance was basically this woman's family already.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 130,
                      "content": "100%. These are the most insanely wrong comments I’ve ever seen jn AITA. The daughter is not entitled to the ring. People are raging at him telling he he doesn’t love her because of this? There is some major emotional damage in some of these commenters.",
                      "id": 116,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 420,
          "content": "If the ring should’ve been Jane’s, the grandmother would’ve given it to her? But she passed it to her son to use. Why is it such a terrible thing for him to use it to propose. That’s normally what happens when mothers pass heirloom engagement rings to their children. They use it for their engagements. Why all the YTAs?",
          "id": 117,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 342,
          "content": "I have a cousin who was in an eerily similar situation. Both the women in his life (daughter and fiancé) had a great relationship with his deceased mother and he inherited her engagement ring. This ring happened to be in a pretty special, intricate setting. My cousin had the diamond removed and re-set into a new band and used that to propose to his fiancé. Then he purchased his daughter's birthstone (which also happened to be his mother's) and had that set in his mother's band. Both his daughter and fiancé were happy.",
          "id": 118,
          "comments": [
            {
              "score": 84,
              "content": "That is such a smart, and honestly, adorable solution to this issue!",
              "id": 119,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "That was a pretty smart solution! \n\nSounds like something straight out of those fables read to us as children lol",
              "id": 120,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Smart *and* thoughtful of him! Sounds like a good dude!",
              "id": 121,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 161,
          "content": "I'm not saying your wrong but I am curious why you feel the ring should be Jane's. OP states that Jane was left jewellery by grandmother specifically and the ring was left to him, if grandmother had wanted Jane to have it wouldn't she have left it to her?\n\nEdit: Typos fixed",
          "id": 122,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "It looked like the grandmother expected it to go to a non-blood relative though. She gave it to her son prob knowing he would propose to Laura. & she had a real bond with her to the point she basically considered her family. Also, Laura took care of her when her health was going down. \n\n\"The ring should have been Jane's\" who said? if it was, it would've been passed down to her instead.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1749,
      "content": "YTA. How is a 5 year relationship mother of an SO become more important than a 16 year bond with a grandma?\nSentimental jewelry is typically passed down from generation to generation and you basically skipped over your daughter. Doing this soon after your mother's passing makes you and even bigger AH!\n\nThere was no reason you couldn't have just bought her a different ring instead of one with sentimental value to your daughter. This decision has certainly injured your relationship with your daughter, perhaps beyond repair as you've made sure she will resent you and your Fiancé. Don't be surprised if in two years she moves out on her birthday and goes NC with you.\n\nETA: Just read your comments about planning to have more children with your SO. You have essentially picked your SO of 5 years over your daughter and plan to have kids that will go in to inherit a piece of jewelry that means so much to your daughter. If you do actually wind up having more kids don't count on your daughter wanting anything to do with them because she will likely resent them as being the proof you chose a potential family with your SO over your existing family.\n\n2nd ETA : OP has clearly been doing some damage control.\nA few things I would like to clear up for new viewers. OP didn't  mention jack about Laura and him growing up together or their moms being Best friends until after I made my initial post. The relationship between the SO of one's child is completely different than one with the child of a family friend. OP only vaguely mentioned Laura helped care for his mom without giving any other details. Nowhere in his original post or comments did OP say anything about his mom insisting that he propose to Laura while on her death bed. OP said his daughter asked him not to propose with her grandmother's engagement ring and he did it anyway. He completely disregarded the feelings of his grieving daughter even though he could afford to buy Laura an engagement ring without breaking the bank.\n\nLegally OP did have the right to do what he did, but morally he was a Major AH.",
      "id": 124,
      "comments": [
        {
          "score": 1591,
          "content": "> you basically skipped over your daughter\n\nNo, the mother skipped over the daughter.\n\nBizarre as fuck to me how much people are stretching to find the guy an AH.  Maybe he deleted some comments or something.\n\nIf, as part of settling up her affairs, a mother deliberately gives her engagement ring to her single son who's in a long-term relationship, she's making a point, and the point isn't \"give this to your daughter.\"\n\nI mean... everyone knows that the law does allow people to leave things to their grandkids, right?  Like, that's literally a thing she could have done if that's what she wanted.",
          "id": 125,
          "comments": [
            {
              "score": 831,
              "content": ">Bizarre as fuck to me how much people are stretching to find the guy an AH.\n\nYeah, I don't get it either. Unless some comments were deleted, I think this is one of those cases where the early comments just took off and here we are.",
              "id": 126,
              "comments": [
                {
                  "score": 492,
                  "content": "Yeah this is BS. OP is NTA and I don’t get how people are doing mental gymnastics to make him out to be one",
                  "id": 127,
                  "comments": [
                    {
                      "score": 212,
                      "content": "It's because a lot of young kids are on reddit, I'm sure. They see themselves as the daughter and would be sad if grandma gave something they lusted after to their dad, who used it to propose to their GF. I'm sure the kid wouldn't be having a fit if it was like her mom that got it. It's all greed at the end of the day.",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 174,
                  "content": "Bro these clowns are burning calories jumping to conclusions. The grandma made a very clear statement.",
                  "id": 129,
                  "comments": [
                    {
                      "score": 38,
                      "content": "And I’m sure he heard that statement is his life too, many times; you need to marry her. The engagement ring to him over everyone else was her final message to continuously remind him to marry gf",
                      "id": 130,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yeah especially finding out the fiance had been a family friend forever.  It's not like she just got here.",
                  "id": 131,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "Yeah, like Jane can be sad about it, but just because she is doesn’t mean she’s entitled to an engagement ring OPs mother gave to him. Giving that heirloom engagement ring to his fiancé would be special & meaningful to him, too. Just being a parent doesn’t mean your child’s feelings and desires now trump all of your own. Especially because there are other heirloom pieces she can have. \n\nOP is using an heirloom engagement ring for precisely the reason heirloom engagement rings are often given - for a son to use to propose with. And I’d image this is exactly what OPs mother expected the ring would be used for. \n\nHe can still be sympathetic to his daughters feelings, and the whole situation of him getting married - but I’m confused by the harsh judgements on this. It’s extremely common these days to have kids and marry someone new and other kids with them etc. I haven’t seen anything from OP that makes it seem like he’s abandoning or neglecting his 16 yr old and “picking his new family” like people seem to think?? \n\nNTA.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Yeah this thread has me baffled, I really don't grasp why he's the asshole here",
              "id": 133,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Indeed, so strange, why would the father have to give an engagement ring to his daughter, and not his fiancee? But yeah, welcome to blended families...",
              "id": 134,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 4,
              "content": "Right? As soon as I read this it was so clear his mother gave him the ring so he could propose with it. \n\nIt's also sentimental to him too. He gets to propose with the ring his father gave his mother.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "In a long-term relationship with the daughter of her best friend, whom she loves, and who *took care of her while she was dying*",
              "id": 136,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 237,
          "content": "I get your point and agree with you. I aswell though feel really sad for Jane that her grandmother didn't leave her something specifically in the will that seems really sad. If it was a bracelet any other piece of jewlerry in my mind it would CLEARLY be given to Jane, and giving it to the fiance would be like choosing her over his daughter. however if a mother gives or leaves a son an *engagement ring* i would assume the intention was that it be used as an engagement ring with her son's fiance in the future. in my experience that's a pretty common heirloom gift to give a son, with that intention? dunno",
          "id": 137,
          "comments": [
            {
              "score": 30,
              "content": "I agree with you.  It's a gift to you that you're obviously not going to start wearing,  and I'm sure she was aware of how close to marriage you and gf were.  I would expect you to give the ri g to your gf too if I were in this position",
              "id": 138,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "His mother picked him over her granddaughter when she gave the ring to him and not her granddaughter.",
          "id": 139,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 10,
          "content": "Why didnt grandma gift to the granddaughter then?",
          "id": 140,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 8,
          "content": ">Sentimental jewelry is typically passed down from generation to generation and you basically skipped over your daughte\n\nWhy are you acting like people never propose to their SOs  with family heirloom engagement rings?",
          "id": 141,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "Wouldn't that make the grandmother the AH for not giving Jane the ring the first place? This is such a reach. OPs mum obviously have him the ring so he could propose. He is NTA.",
          "id": 142,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1342,
      "content": "NTA. His fiance IS GOING TO BE FAMILY. also, engagement rings as heirlooms are traditionally used in proposals. Remember it belongs to the grandmother of Jane, not her mom. \n\nSo the dad has every right to use HIS heirloom that he inherented from HIS MOTHER as he sees fit.",
      "id": 143,
      "comments": [
        {
          "score": 513,
          "content": "I wish I could give this all the awards! Everyone feels like Jane is entitled to this ring BUT SHES NOT! DNA does not entitle you to an inheritance. If OPs mom wanted Jane to have the ring, then she would have left it to her. OBVIOUSLY OPs mom left it to OP because she had hopes he would marry Laura.",
          "id": 144,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 319,
          "content": "Like this subs hive mind has collectively lost it's mind.",
          "id": 145,
          "comments": [
            {
              "score": 128,
              "content": "I think they got confused and read it as it was the daughter's moms ring and not the dads or something...",
              "id": 146,
              "comments": [
                {
                  "score": 17,
                  "content": "I've seen different comments say they were on his side until they read some of his replies. Apparently he made it sound like he doesn't care at all about his daughter's feelings???? \n\nIdk, can't speak facts about OP until I see the specific replies, but ik that's why some people turned.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 21,
                      "content": "OP has i5 right. Jane is not at all entitled to the ring, and the responses from OP don't change that. This sub has officially out grown its britches to the point that  they can't see past their own greed.",
                      "id": 148,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "When new details about situations are coming out in the comments, I get changing your mind, but (I haven’t seen them either) I don’t think that happened here. I think they just didn’t like his attitude, and that really shouldn’t affect judgements.",
                      "id": 149,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 10,
              "content": "This is what you get when teenagers write. They completely dismiss their parents as people with feelings and needs.",
              "id": 150,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "Too many people seem to get high on their own self-righteousness. The amount of people saying things like 'OP you're putting words in a dead woman's mouth, how would you know what she wanted?!' To a total stranger! About HIS dead mum!",
              "id": 151,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 197,
          "content": "I wish I can upvote this to the top! \n\nEveryone is saying YTA but it’s his mothers ring and believe it was given in order to propose to his gf. \n\nJane has no claim on the ring what so ever and shouldn’t have made assumptions to begin with. Heirloom or not it’s something precious to OP that his mother wore for as long as he can remember. Daughter is in the wrong and I hope OP doesn’t cave, it was given to him to propose and he is sharing his mothers ring with his partner that knew her for 3 decades, even cared for his mother while she was sick. It was no stranger but someone who equally loved her like a second mom since their mothers were close friends and grew up together. \n\nJust boggles my mind no one is considering OPs feelings just because he’s a guy given a ring he can’t wear when it seems his mother gifted them the ring to both have and cherish.",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 97,
          "content": "Just can't agree with this more. He hasn't denied Jane a keepsake, heirloom, whichever; it's completely 100% understandable that he'd want to propose to the woman he's going to marry with a ring that has huge emotional significance for him. I do see why she may be upset, but surely there's a middle ground here, like giving her her choice of anything else available to her to choose and promising her the ring will pass to her one day as, even if OP and his fiancee have more children they will not have chance to build the relationship with their grandmother that Jane did? \n\nWhen Prince William proposed to Kate Middleton with Princess Diana's ring I don't remember hearing loads of people complaining that he'd cheated Harry. Just lots of people saying how lovely it was that Diana's ring was passed to Kate so \"his mother didn't miss out on what was happening\".",
          "id": 153,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "I hate how far I had to scroll for this. If he's been with Laura for this long, and per his edits has known Laura his whole life, I'd assume his mom gave him the engagement ring EXPECTING it to be used for this purpose. His daughter's feelings are valid, but I'm sorry OP is NTA",
          "id": 154,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "I’m blown away I had to scroll this far. This sub is Wildin",
          "id": 155,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "Yes! And the fact that the engagement ring was given to a man in a serious relationship, it was likely meant to be used to propose. It's not unheard of practice to propose with your mother's engagement ring, so why is everyone so mad? I understand that Jane is upset, and I understand why, as a 16 y.o. I probably would be, too, but it's not as if she has nothing from her grandmother. There are other things like her rosary. If it is about wanting something the grandmother treasured, Jane should understand one day, even if she doesn't right now.",
          "id": 156,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "Finally common sense. A lot of the commenters are probably young and still feel a sense of entitlement",
          "id": 157,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "It took so, so long to find this comment. Thank you!!!",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Amazing how the commenters have suddenly decided that blood and marriage are the only things that make people family, so the long-term gf is not family. Somehow, I doubt they'll apply that to their own lives if a long-term partner's family decides that they're not family either.",
          "id": 159,
          "comments": [
            {
              "score": 4,
              "content": "Yeah all the 'oh give it to a stranger and lose it when you break up in a year' comments are bizarre.",
              "id": 160,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 930,
      "content": "YTA for proposing with the ring AFTER you knew how your daughter felt about it.  You completely dismissed her feelings.  The best way I see to salvage this is have a conversation with Laura about the ring being an heirloom, it's meaning to Jane, and your hope that it will be passed down to her eventually.  If she's a decent person she'll either (a) agree to this, or (b) suggest getting a different ring.",
      "id": 161,
      "comments": [
        {
          "score": 426,
          "content": "Just because she is upset about something does not mean he needs to change his plans, even if she is his daughter. Just because she wants something does not mean he has to give it to her, even if she is his daughter. Yes parents should care about their children’s feelings but that does not mean they are a slave to them and can only make decisions in accordance with them. She is upset but she is not reasonably upset - by that I mean her reasons for being upset (expecting something that was given to someone else to be hers) are not valid enough for him to change what is obviously special and important to him as well. Grandma was more than able to give the ring to her granddaughter if she wanted her granddaughter to have it. She gave it to the son which says she wants him to have (and most likely use) it. He should definitely be trying to support her dealing with her feelings like any good parent but that does not mean he has to give into those feelings.",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 369,
          "content": "Hey, hate to break this to you, but considering someone's feelings doesn't mean they get what they want.\n\nOP is NTA and all these YTAs are coming from some weird entitlement culture I thought even Reddit wasn't stupid enough to buy into.",
          "id": 163,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "So every time his kid wants something really badly, he is to just give in?\n\nIf grandma wanted to give it to Jane, then she would have. It seems pretty clear that OP's mom gave it to OP with the intent that he use it to propose.",
          "id": 164,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 10,
          "content": "Lmao teenage girls have a ton of feelings. Sure doesn’t mean they’re entitled to anything that literally is not theirs.",
          "id": 165,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 877,
      "content": "I N F O: at any point did you promise to give Jane the ring or say something that could lead her to believe you would?\n\nYTA based on subsequent responses.  Your daughter and her grandma were very close.  You are now giving a very special momento of her grandma to someone else who will in all likelyhood pass it down to someone who never knew the woman.\n\n(Edit typo)",
      "id": 166,
      "comments": [
        {
          "score": 253,
          "content": "That's exactly what I was thinking. Op's kid assumed that it would be passed down to her as the eldest daughter/grandchild, instead of it potentially going to stepmom's first bio child.",
          "id": 167,
          "comments": [
            {
              "score": 11,
              "content": "No it’s not! Again the ring is an engagement ring. The next person who would get the ring would be if OP has a kid who proposes with a ring. That ring would go from proposer to the person being proposed to.\n\nThat is what Grandma is intending to do here.\n\nOP is NTA.\n\nIf grandma wanted Jane to have the ring she would have made it clear in the will. Also read the edit with Grandpa’s input, this is a very obvious NTA.",
              "id": 168,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 136,
          "content": "I mean, that what happens with heirlooms. After a few generations the one getting it doesn't know the person who had it originally. Ops fiance also had a relationship with his mother so, that argument isn't really valid here.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "You do realize op said that the fiancé has known the mom her whole life right, and that both their parents have been waiting on them to get married? Don’t you think that maybe the engagement ring was a final hint being dropped from the mom for him to get married?",
          "id": 170,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "The fiancee and mother were also very close and knew each other all of the fiancees life.... so I don't see how it's any more of a more Important relationship. There are also other mementos, just not the ring",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "The fiancé also knew the mother since she was a kid. They were both obviously close the the grandmother",
          "id": 172,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 766,
      "content": "Your daughter will always be your daughter. Your wife might not always be your wife. YTA",
      "id": 173,
      "comments": [
        {
          "score": 201,
          "content": "I used my grandmother's engagement ring to propose/marry my now ex wife. It was awkward as fuck asking for it back. Now it'll go to my daughter like it always should have.",
          "id": 174,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 17,
          "content": "Wrong. I cut off both parents after finally realizing after 17 years that they were abusive as fuck towards me. \n\nThere is no guarantee that any familial, romantic, or platonic relationship will last forever.\n\nHis mother gave HIM the ring, not Jane. Though she is not unreasonable to have assumed he would give it to her because his brothers chose to give theirs to their respective daughters.\n\nBut he didn't HAVE to conform. NAH",
          "id": 175,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 15,
          "content": "So you are saying never give family heirlooms to significant others ever under any circumstance?",
          "id": 176,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 12,
          "content": "The wife is the mothers best friend’s daughter and was very close to the mother at time of death. It is a stretch to believe that she would be so cruel as to refuse to return the ring in a divorce if OP asked. And weird to assume they’d get divorced anyway.",
          "id": 177,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 9,
          "content": "Yeah but OP was given an engagement ring he wanted to use to get engaged, so what’s wrong with him using it that way?\n\nUnless he plans on getting engaged with the daughter which is a different issue entirely",
          "id": 178,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 7,
          "content": "so should my dad not have proposed to my mom with my grandma’s ring before I was born? Should he have saved it just in case he had a daughter? This is a ridiculous take. In that case no family jewelry should ever be used for engagements or weddings. Their marriage is just as much of a commitment regardless of having a daughter beforehand.",
          "id": 179,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 681,
      "content": "I don’t think you’re an asshole, but I think you should make it clear to Laura that the ring is a family heirloom, and it will go to Jane when she is dating/getting engaged. \n\nLaura is not related to your mother, but Jane is. I think the ring should be temporary for Laura but ultimately go to Jane.",
      "id": 180,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 490,
      "content": "You can fix this whole thing in about 30 seconds by asking Laura if she’d be willing to have the ring passed down to Jane … NOT a future child the two of you have … when the time comes.",
      "id": 181,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 421,
      "content": "NTA\n\nIf your mother wanted Jane to have the engagement ring, she would have given it to her in her will. Simple as that. I wouldn’t be surprised if your mother specifically gave you her engagement ring to propose to Laura since she had known Laura for years, Laura has been there in her time of need and you two have been together for years.\n\nWhy did Jane assume that she was getting her grandmother’s engagement ring anyway? Did your mother tell her that or did she just come up with that on her own? Maybe someone else in the family said that?",
      "id": 182,
      "comments": [
        {
          "score": 178,
          "content": "This.  OP said his mother had been hinting for years that he propose to Laura, it makes sense that she left him the engagement ring with that in mind. NTA.",
          "id": 183,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}