{
  "post content": "So obviously this is a screwed up situation all around. My dad is 58 and a severe alcoholic. I am 22, I have a half sister who is 45 and a full brother who is 24. They live in different states. I did not stay behind to care for my dad but I’ve really been his only support system.\n\nHe has been in and out of rehab, he’s been arrested for public intoxication, public indecency, DUI well over 20 times and numerous other things that would probably break the rules to talk about them. This has been going on as long as I can remember. He is destitute, malnourished and has advanced ARD (alcohol related dementia) which is worse when he doesn’t drink. He can’t work, drive or care for himself in any meaningful way. I’ve been there for all of it while my siblings left a long time ago and have done nothing other than an occasional check.\n\nMy sister arranged for him to be put in a long term care facility (she was not paying for it, state funded) fairly close to me. He was “sober” but was caught several times stealing alcohol wipes to either suck on them. I visited him twice and it was like a horror show, I didn’t realize places like this existed outside of the movies. During one of his coherent moments he begged me to take him out. I told him the second he had access to alcohol he’ll drink again. He said he knew but he’s ready to die and he’s at peace with it.\n\nI talked it over with my husband and we hired a specialist to examine my dad and he said if he drinks he has maybe 6 months left. We did a quick remodel on our house so my dad will have easy access to a bathroom and we said we will buy him a 30 pack of cheap beer a day and he can stay with us until he’s gone.\n\nYes it suck’s but on one hand he has his family, he’s not covered in bed bugs, hes clean and has entertainment. He’s not stealing to fund his habit, he’s not bothering the public and he won’t get arrested. \n\nMy siblings think that he was going to get better in the facility and think Ive signed him up for a death sentence. I told them that they are welcome to move him to a facility closer to them so they can be the ones to visit him and see his food covered in roaches and his baths being wiped down with chemicals. My sister said she can’t because of her “reputation as a real estate agent” (my stomach hurt I laughed so hard) and my brother said he doesn’t want his kids to see their grandpa like that. Both ridiculous excuses but they insist on being angry with me when I’m the one who’s borne all the stress and heartache of seeing this in person.\n\nTo me this allows a man who has made some terrible choices in his life the ability to at least not linger in some hell hole for the next 10 years and die as crappy as he lived…but at least on his own terms \nAITA?\n\nEdit: I can’t believe now this blew up. I’m sorry I can’t respond to everyone but such a sincere thank you to the first few comments and the threads with all the extremely helpful and critical information that my husband and I did not know.",
  "id": 1,
  "comments": [
    {
      "score": 9963,
      "content": "NTA.  You're showing a tremendous amount of compassion in his final stage.  Your heart is warm and it's going to be really awful, but from the sounds of things you're doing the best thing.\n\nSpeak to a social worker where he's staying, get some referrals for home help and home nursing.  You'll find they more than likely offer it for free from more than one place.\n\nEdit: I know because I'm going through this myself. I have no family around and on Friday got the news that I've seen my last Christmas already.  I do not fit the stereotypes on this one, my friends have no idea, and I plan to keep it that way. My worst fear is dying in a hospital.  I just want to stay in my tidy cosy home with my lovely cat and conversations only with people who are being paid to show up to help me around the house. There is no 'make a wish foundation' stuff for sick people who aren't children, which is total crap :)\n\nEdit 2: YES I HAVE PLANS FOR WHERE THE CAT WILL LIVE HAPPILY EVER AFTER.  Please, these condescending remarks are pure self-serving nonsense.  At least respect yourself if you're not respecting me.",
      "id": 2,
      "comments": [
        {
          "score": 2172,
          "content": "NTA but it's going to be so painful. You are showing compassion beyond most could understand here. It's a horrible situation. Please consider counselling for yourself as well. It's important to look after your own wellbeing in this time and after.",
          "id": 3,
          "comments": [
            {
              "score": 679,
              "content": "I couldn't agree more.  People who have never been caretakers do not understand how much it takes out of you.  I took care of my mom after her pancreatic cancer diagnosis.  She signed up for hospice care but stayed home with a nurse coming to the house.  The nurse came once a day, but the rest of the time, it was me.  It was 12 weeks from her diagnosis until she passed.  I didn't do anything for myself during that time, and I ended up physically and emotionally wrecked.  It took me months to recover before I was able to grieve.\n\nOP, please make sure you and your husband take care of yourselves along the way.  It doesn't have to be elaborate,  maybe just a walk around the block or sitting in the park watching the ducks for a while or coffee with a friend.  I  would also recommend finding a support group or therapist so you have someone to talk to.  Just having someone listen to you will be a big help.  Also, NTA.",
              "id": 4,
              "comments": [
                {
                  "score": 251,
                  "content": "I’m huggin you from Texas.  I took care of my mother when she got the stage 4 diagnosis in July of 2020 and by October 1 she was gone.  \n\nI cannot express the amount of sadness I saw when I had to help her onto the portable commode.  \n\nThe shell of a women begging for God to take her and watching her die in my arms.  \n\nI’m going to workout now and remember the good times we had together",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 146,
                  "content": "Having any sort of home nursing or hospice is going to require a physician who can approve the care plans devised by the home nurses. This is probably a good idea since it formalizes and legitimizes your care. It also prevents the appearance of elder abuse and/or neglect. Additionally, ask the doctor along with your dad about a Physician Order for Life Sustaining Treatment (POLST). This is a simple one-page form that allows your dad to state what medically he wants and what he does *not* want as he declines. You should ask him to complete an Advanced Directive for Health Care (ADHC) to allow him to designate someone to make medical decisions for him when he becomes unable to do so for himself. These forms can be downloaded and (at least where I live) do not require an attorney. The POLST requires a physician signature and the ADHC probably ought to be notarized.\n\nIf he becomes a home hospice patient, the focus becomes medications and care to keep him comfortable as he dies at home. He may refuse food or fluids, but you yourself *cannot* withhold them.\n\nIf you are managing his money, accounts, social security or disability benefits or civilian or military pensions Do. Not. Commingle. Funds. (i.e. have his money in your account) It makes accountancy and budgeting difficult and it can have the appearance of embezzlement and fraud. If these funds involve the mail, mail fraud is a very serious crime with severe per offense penalties.\n\nSad to say, but if your siblings are unhappy with the plan you have described you need your dad, while he still can, to formalize his wishes and end of life care. Otherwise there is a real risk that an aggrieved family member could decide to press criminal and civil charges including elder abuse, elder neglect, manslaughter and embezzlement.",
                  "id": 6,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 74,
                  "content": "This is why I went the kind route and got rid of everyone in my universe when I found out my health was failing.  Imagine those scenes from old movies where a kid is trying to make their dog run away so their dad doesn't shoot it, throwing pebbles at it and crying while yelling 'I don't love you anymore! Go on, get outta here!'\n\nThey are under the impression that I hate them and that I'm a bitch.  Nope, I think about them every day but I'm not letting them remember me as a husk.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Tldr; maybe give your loved ones a chance. \n\nThanks for sharing but I hope you might try to keep at least someone loyal in your life. They are adults and hopefully can make the decision to stick with you because they want to, not out of some sense of obligation. It might make them more sad to know you kicked them out in a sense to help them. \n\nBefore my grandpa passed last year, he had told me all my life that if he ever ended up like he did, he did not want me around to see him like that. He helped raise me as basically my dad, we were best friends. He ended up having a stroke and developed some form of vascular dementia, even developed aphasia basically while walking out of the grocery store. I stayed with him even when we had to make the terrible decision to not let him die at home and put him in an assisted living community as my family just couldn't give him the level of care he needed anymore and it was draining my grandma fast as well. \n\nI still visited him every week twice a week and one time he became lucid for a few minutes and asked me to go get his gun and let him go out to the field like he had always said he would do if he got to ve like that, but obviously I couldn't and he asked me to just not visit again as he didn't want me to see him like that. \n\nI just couldn't do it and eventually was in the room with him when he died. Even though I'm still a shithole wreck that others may not see, I'm still glad I stuck with him and didn't let him be alone even though he tried to push me away. \n\nI hope you might be able to give your cherished ones the chance to be with you and help uplift you as well. Sorry for rambling, your posts just kind if hit me hard, I hope you and your cat well!!!!!!!!!!!!! 🐈",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 724,
          "content": "This is the answer.\n\nOP, please know he may not just go peacefully when an organ gives out. Which is possible btw…he may also have severe medical issues before that. It could be slow. Look at qualified nurses and social workers to help you.\n\nNTA I’d say n a h if it were not for your siblings not offering better solutions. It’s fair they find it difficult to let their father die this way. I also see your point, at least he goes out on his own terms.\n\nIt’s not an easy call, and please expect your siblings to react badly in their grief when the time comes. Hopefully they work through that now and save you the trouble later. \n\nI suggest plan on therapy for yourself too, and your family, this will likely affect you all.\n\nI did question why renovate your home instead of paying for a better facility with your siblings contributions? Did you try that??\n\nA good rehab and care combo maybe.",
          "id": 9,
          "comments": [
            {
              "score": 740,
              "content": "You're being kinder than I am. NTA but the siblings are jerks. As a former nurse in nursing homes, I've seen this so many times. A parent gets sick and one sibling steps forward while the other siblings constantly complain that they're doing it wrong but won't take responsibility themselves. (By the way, the one that steps forward is almost always a daughter.)\n\nHe's not going to stop drinking. If she doesn't provide alcohol, he'll just go out - even if he has to crawl - and do whatever he has to to get it. \n\nBut I will say a 30-pack seems more than necessary.",
              "id": 10,
              "comments": [
                {
                  "score": 481,
                  "content": ">But I will say a 30-pack seems more than necessary.\n\nA 30 pack of 12 oz cans of beer at 5% abv is 18oz of EtOH. This is equivalent to one liter of 107 proof spirits. For an extreme alcoholic might this count as maintenance?",
                  "id": 11,
                  "comments": [
                    {
                      "score": 221,
                      "content": "Yes, and it might help him moderate his input relatively when compared to liquor just due to the sheer volume of liquid he'll be drinking.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 199,
                      "content": "Yes, it does",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 186,
                      "content": "I was a litre of vodka a day as a baseline for about ten years. Needed half of that in order to be able to function on anything approaching a normal level. I've been sober now for over ten years, but that's because I had a good support system WHEN IT MATTERED AND I COULD GET BETTER. OP is emphatically NTA, and I hope that if I ever backslide in my old age that someone in my life will show this level of care and compassion if all hope for recovery is gone.\n\nSorry for the tangent, but yes; for a severe enough alcohol dependent, this amount could be termed as maintenance. Although of course everyone processes alcohol differently and there are other variables at play.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 123,
                      "content": "30/day.  I've heard of that.  Access to the bathroom becomes essential.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "My uncles can polish off a 12 pack by lunch.",
                      "id": 16,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 309,
                  "content": "Isn't it also true that suddenly stopping drinking after decades of alcoholism can cause its own health problems? It seems like damned if you do and damned if you don't at that point.",
                  "id": 17,
                  "comments": [
                    {
                      "score": 261,
                      "content": "For this situation if you wanted to actually quit you would taper down or do a medical detox. Alcohol withdrawal for a serious alcoholic can cause DTs and death.",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 234,
                      "content": "alcohol withdrawal is genuinely one of the most dangerous drug withdrawals, can cause seizures and even death if you do it too fast. I know when a pal got a place at rehab a few days away her parents were advised to let her have a beer every few hours to keep her stable till she could get in and dry out safely.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 171,
                      "content": "That's why liquor stores were deemed \"essential businesses\" during the height of the US pandemic response. The very last thing the overwhelmed health system needed were long-term alcoholics in bad withdrawal checking into hospitals en masse.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 71,
                      "content": "I had an uncle who was a hardcore alcoholic.  He was drinking a 30 pack of beer a day, like OP's dad.\n\nHe was hospitalized with cancer, and went into alcohol withdrawal.  They had to put him on IV alcohol to get through it.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 48,
                      "content": "Alcohol withdrawal can absolutely kill a person. Medical detox exists for precisely that reason. To help a person stop drinking without health risks.",
                      "id": 22,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "At the beginning of covid “lockdowns” there were all sorts of people complaining that liquor stores were considered essential. I got tired of explaining that hospitals were overwhelmed with covid patients and didn’t have the staffing (or space) to deal with detoxing alcoholics.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "Alcohol DT's will kill you faster than continuing to drink, and it's not a pretty way to go. Medical detox can work, certainly, but it's a miserable process.",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "Yep, I don't even consider myself a very heavy drinker, but it was enough that when I was in the hospital for a few days, they had orders ready in case of withdrawal.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "My grandmother was a functioning alcoholic but no one in the family wanted to admit it besides my dad (and my mom and me). When she was hospitalized, my aunt refused to tell the doctors. My 150cm grandmother tried to assault a male nurse and a doctor (!), they had to restrain her and then decided to call called my dad who found out my aunt didn't disclose it and told them \"oh yeah, she drinks like one 12-pack of beer a day, plus wine and brandy\". \n\nIt's terrifying.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Yes it does. \nMy dad is the same age as OPs dad and has been a functional alcoholic for 40 years. \nIn the past 3 years he has slowly become less and less functional and started showing signs of ARD as well as other alcohol related issues. \n\nHe is not sober and he will never be, it's too late for that, but he's on a controlled dose of alcohol and living a normal, functioning life. \n\nSobriety isn't always the answer, sometimes the best solution is learning to live with your addiction the best you can.",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 201,
                  "content": "Also a nurse that's done the ltc track and hospice for a lot of years, and you're so so right about all of this. People outside of the field almost never understand or care about the realities of how life is once you're past a certain point. This man can survive maybe 10 years living in hell trapped in a body he destroyed, or 6 months making himself more sick but at least it's shorter and less torturous for him. He probably doesn't deserve the empathy and compassion his daughter is showing, but he's damned lucky to have her. Myself and pretty much every nurse I know that works in eldercare have plans on how to take ourselves out on our own terms when our health fails and we're faced with being trapped in places like that. \n\nBut, 30/day could realistically be his maintenance amount if he's drank as heavily and as long as op describes. Might as well give him the amount that keeps him from causing more harm trying to get more. I also really hope she looks into home health services. If he qualified for state funded live in care then he very likely qualifies for visits a few times a week as long as he isn't violent. I hope she gets help from as many services as she can.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Honestly, at some point he'd not going to be able to get out of bed/be continent/maintain hygiene. OP should plan for what they're going to do when it reaches that point. It'll be bad.",
                      "id": 29,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": ">This man can survive maybe 10 years living in hell trapped in a body he destroyed, or 6 months making himself more sick but at least it's shorter and less torturous for him.\n\nYes!",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 62,
                  "content": "It's less than two drinks per hour. For late stage alcoholism it's reasonable, plus you don't want the stress of him running out and getting DTs.",
                  "id": 31,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 46,
                  "content": "“I used to do a little but a little wouldn’t do, so the little got more and more”",
                  "id": 32,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Such a great lyric. I still use it for D&A clients. They may not know the song... but they absolutely relate to the slide",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "I just keep trying to get a little better, a little better than before",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 36,
                  "content": "This! The siblings are huge AHs. More worried about your reputation than seeing your father? AH! Using your kids as an excuse to not see your father? AH! Unless your kids are somehow physically attached to you, then you can still come up and see him on your own.",
                  "id": 35,
                  "comments": [
                    {
                      "score": 4,
                      "content": "No one is the asshole here. The harm addiction causes is a complex thing. You have no idea the hell this man likely put all of his kids through. My bio mom called me the other day. She's married to an alcoholic who is too far gone. He was drunk and pissed at her and shot himself in the chest with a revolver and collapsed a lung, with the words \"I'm about to change your life forever for the worst.\" And she witnessed it happen and recounted the story to me in the most flat, despondent voice imaginable. Like she was just bored of this. That's just the kind of shit people who are that miserable do. This happened literally like three or four days ago, I'm not saying \"the other day\" for dramatic effect to the story.\n\nThe siblings are likely fed up and angry that they feel OP is being taken advantage of/being naive. They're angry at a man who couldn't choose them over drink. I don't know that guy, for all I know he did his very best to stop drinking. Not everyone is Frank from Shameless. And I'd say most people deserve a little end-of-life compassion. Good on OP, but the siblings aren't necessarily assholes, you have none of the required context to say that.",
                      "id": 36,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 24,
                  "content": "24-pack/day + 2 bottles of whisky/week was what my dad went through. But it might have been 30? It was whatever a “case” of beer was at the time.",
                  "id": 37,
                  "comments": [
                    {
                      "score": 4,
                      "content": "My ex was an alcoholic (and apparently got worse after we broke up) and he was on 24 beers and a half bottle of whiskey a day. It was pitiful. \n\nHe came through it and dried out, but we were in our twenties. If he'd kept going he'd be like OP's dad eventually.",
                      "id": 38,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Sadly, a 30-pack in a day is nothing to a serious/chronic alcoholic.",
                  "id": 39,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "I’ve seen a nonverbal hospice pt sneak out of their home, walk(?) to the liquor store, buy liquor and pour it down their feeding tube once they made it back home. \n\nThe family said the pt had been kicked out of every facility they had been placed in and in home care was the only option.\n\nThe kicker with this was the pt couldn’t walk wo a walker. They usually couldn’t walk from one end of their house to the other; even with assistance. \n\nOh, the pt was nonverbal too. \n\nWhere there is a will, there is a way.\n\nIt was a tiny town, everyone knew everyone’s business. \n\nThe clerk figured it wasn’t their business to police them bc they weren’t hurting anyone else.\n\nIt was obvious this person was suffering and ready to go. \n\nIdk why we allow people to suffer like this. It’s cruel to say the least.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "SW here, to add to your comment, the father has accepted that he isn’t going to stop and knows full well the consequences of his drinking/actions. If anything OP is providing harm reduction while also accepting their father decision. \n\nWe had something similar at my job, but it was medication related. Where the patient chose to stop taking meds, and accepted that they were going to die. The patient was fully competent, and when they were assessed they were in health and fully aware of the consequences of the stopping of medications. We respected there decision.",
                  "id": 41,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 52,
              "content": "Facilities won't let him drink. It's a liability issue.",
              "id": 42,
              "comments": [
                {
                  "score": 35,
                  "content": "Of course not. I meant a better facility with rehab support for father to get proper help and a good accommodation.",
                  "id": 43,
                  "comments": [
                    {
                      "score": 124,
                      "content": "Beer is proper support. This is like putting a dog down, except dogs get more dignity in passing than humans do.",
                      "id": 44,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 91,
                      "content": "I'm sorry to say, but that doesn't really exist. Substance rehabs won't accept him due to his ARD diagnosis because that makes recovery near impossible (and limits independence), and there aren't really any long-term care facilities that also provide substance use treatment. If they exist they are definitely not within an average person's budget. \n\nFrankly, with how reliant OP's father is on his addiction I'm amazed they found a facility willing to take him in at all. Ironically his ARD is probably what made it possible because he could be admitted to their secured dementia unit. You might be able to find a nicer facility with a secure unit, but the nicer the facility, the pickier they can be about who they accept. Unfortunately people with addictions aren't at the top of the list when they can accept some family's sweet little pawpaw who never touched alcohol a day in his life and requires less care which means fewer overhead costs and a larger profit margin. \n\nIf you want some sort of substance treatment in a situation like this, your best bet would be an inpatient psych unit, but that's not even a sure bet.",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 32,
                      "content": "He doesn't want to stop drinking, so detox and rehab would be a complete waste of money and effort.",
                      "id": 46,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 27,
                      "content": "OP says he's been in and out of rehab, so I think that avenue has been explored.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "As someone who's dad went this way, at this point there is no rehab. This is the alcoholic equivalent to hospice. Once alcoholic related dementia is happening there's almost no way back.",
                      "id": 48,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 20,
                  "content": "They should try and see if he qualify for Hospice or palative care. It's often done in the home",
                  "id": 49,
                  "comments": [
                    {
                      "score": 4,
                      "content": "They definitely should. It would be focused a lot more on his comfort rather than treatment or strict regulations.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 31,
              "content": "Not OP, but depending on the renovation, it might have been cheaper than one month of care.  We redid a bathroom to full from a 3/4 and put a wall and door up in a space for about $10k.  Assisted living where we are is $5k a month.  If he needed more intensive care as it seems he does, then it's more.  For the cost of a few months care, dad has what he wants, and they will retain the value of the guest space after his passing.  I think it was financially wise, and more important to the OP, it's what their dad actually requested",
              "id": 51,
              "comments": [
                {
                  "score": 4,
                  "content": "Yeah, the renovations will add equity to their home, because it sounds like now there's a ground floor guest bedroom with an en suite. Plus it has the emotional benefit.",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "Renovating their home might be as simple as putting a bed in a downstairs room. Not pricy at all",
              "id": 53,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "There will be blood. Copious amounts.",
              "id": 54,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "Seems like you may not realize how expensive good care is, a quick renovation is going to be WAYYY cheaper than even 3 or 4 months in an even moderately comfortable facility.",
              "id": 55,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 314,
          "content": "My grandfather died due to alcoholism (or the problems associated with it) before I was born.  The tales my mother recounts of his last few weeks in hospital make his existence sound completely miserable.\n\nNobody wanted him to be an alcoholic and there were many interventions when he was healthy, but by the time he was on palliative care it didn't really matter.  The hospital tried to keep him dry (because why would a hospital allow booze?) but it would make his last few days and hours even more painful.\n\nMy mother wouldn't even sneak alcohol onto his ward.  She would bring it in brazenly.  The nurses and doctors didn't condone what she was doing, but understood and didn't do much more than raise an occasional eyebrow.  Maybe it was a different time in the early 80's, I doubt that would fly in the NHS now.\n\nThe guy was dying no matter what happened, why not feed the habit and keep him at least a little more comfortable in his final days?\n\nShe didn't condone his drinking and for years before his death wouldn't drink with him at all, hoping it would discourage him.  But at the very end, why put someone you love through more painful symptoms when the inevitable outcome is just the same?",
          "id": 56,
          "comments": [
            {
              "score": 350,
              "content": "In hospitals and nursing homes, we do receive orders for alcohol from the Dr. Someone in this man's shoes, I can see not giving it in the nursing home if the goal was to dry him out. I'm a nurse, and I think it's horribly cruel to take away things like alcohol and cigarettes at the end of life. Making them stop now does nothing but add stress, grief, and even physical pain. It's pointless. \n\nNTA OP. Thank you for the kindness you're showing to your father. You're doing the right thing. Best of luck to you and yours. Wishing your dad a pain-free celestial discharge with dignity.",
              "id": 57,
              "comments": [
                {
                  "score": 134,
                  "content": ">Wishing your dad a pain-free celestial discharge with dignity.\n\nBeautifully put!",
                  "id": 58,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 116,
                  "content": "I was a nurse before (currently changing my careers completely now) and I never got extensive with terminal or even seriously elderly patients about the cessation of smoking or alcohol. What’s the point? Why punish them? If that’s the only thing that makes them “happy” in a sense, leave it be. My own Dad passed at 76 in March 2022. He smoked like a freight train. 10-15 years ago, yeah I was all about trying to get him to stop but he didn’t. He lived life by his rules. He was also very stubborn. Miss him daily tho.",
                  "id": 59,
                  "comments": [
                    {
                      "score": 122,
                      "content": "I work in geriatrics, which includes palliative, end of life, and hospice care. Let the 96 year old diabetic have the pie. Not just a piece, let them have the entire thing if that's what they want. That's not how I treat my 50 somethings in rehab. However, I can't stop them!! \n\nI'm sorry about your dad. My mom had lung cancer surgery and still smokes. She's in her early 60s, so I'm just assuming she won't be here for too much longer. Cherishing the time we have together.",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 84,
                      "content": "My mother used to run a care home for older people and their children would be aghast and horrified that dear old mum was being allowed a couple of glasses of wine with dinner, and a sherry before bed because of The Damage! My mother was always very clear that a) dear old mum was paying the care home fees and could have alcohol if she wanted and b) dear old mum was 76 and deserved to enjoy her life. Residents couldn't smoke in their rooms, but if they wanted to sit out in the garden and enjoy a cigarette or a pipe, no one was going to stop them.",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 35,
                      "content": "I'm with you. My dad passed as well several years back. He was a chain smoking, bacon sandwiches with lots of mayo eating (with a side of sweets), never exercising, very happy man. We tried to get him to at least make slightly better choices, but we gave up when he turned 70. He was in his mid 80s when he passed. Oddly enough, lungs and heart held up shockingly well. I'm glad we didn't fight him till the end on this. I'm grateful he got to enjoy his final years in a way he saw fit. Would I give just about anything to see him one more time? Of course. But I wouldn't trade his happiness for more time. He was a grown man, he made his choices, and he was happy with them. That's all anyone can ask.",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": "My dad quit smoking several years before being diagnosed with terminal cancer. He was one of those smokers who always loved smoking and really only quit because of relentless pressure from my mom. When he went into home hospice, my cousin's husband suggested buying him a pack, just so he could enjoy a smoke one last time. The home hospice team fully supported it--said if it would make him happy, what's the harm at this point? It can't get much worse than Stage IV pancreatic cancer. \n\nHe ended up being too sick to smoke them, but my mom, who always HATED his smoking and would never allow him to do it in the house, was 100% ready to help him smoke a cigarette in his bed. I still think that was the right thing to do.",
                      "id": 63,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 3,
                      "content": "For real it makes NO sense. I told my mom if she gets sick/terminal/near the end and wants to pick smoking back up, I'll bring her a carton a day and a handle of bourbon if it makes her happy!",
                      "id": 64,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "My grandmother while dying from Emphysema was snuck in cigarettes by the nurses. They are the true ones who see the suffering. I’m grateful they were willing to ease her pain in the very end. Thanks for what you do.",
                  "id": 65,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Emphysema?",
                      "id": 66,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "During the pandemic and lockdowns, I snuck in a lot of booze for my people!! They already suffered through enough. There's no way Norma isn't getting her nightly thickened Moscato, lol! I'm glad your grandmother had great care. When I first read eczema, I knew you meant emphysema, but I had a good laugh. Auto incorrect strikes again!",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 37,
                  "content": "I remember working in a restaurant as a teenager and having a 90yo regular with renal failure.  I remember when she made the decision to go off dialysis and just do what she wanted til her body gave out.  She was in great spirits and delighted to order dessert (I believe it was a strawberry milkshake) for the first time in a long time.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 6,
                      "content": "After my great aunt died, my nearly eighty year old grandmother and I went into the next town over. We got Italian food, bc my aunt would never let my grandmother. (Aunt took care of grandmother)\n\nI've got a photo of grandma with a grin on her face, oxygen on her nose with a plate of some carb laden food in front of her. It was her last good day. After that, she went downhill mentally and died a couple months later.\n\nI'm glad I took her to get the Italian food.",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "I watched my inlaws dealing with a grandparent who was going to die of cancer. She was a heavy smoker and they took away her cigarettes.\n\nIt seemed like every conversation with her was solely her asking for a cigarette. We bought a vape for her but she really just wanted her cigarettes.\n\nLooking back, it does seem like the wrong decision especially since half the family would smoke around her.\n\nUnfortunately, we lost her too early anyway. And the family and friends who would smoke around her all died not long after of their own cancers they either refused to get diagnosed or treated.\n\nAwful all around and I miss them :(",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": ">I think it's horribly cruel to take away things like alcohol and cigarettes at the end of life. Making them stop now does nothing but add stress, grief, and even physical pain. It's pointless.\n\nI could not agree more! I wish more people would understand that. Thank you for all you do as a nurse!",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 63,
              "content": "My father died due to alcoholism ten years ago.  We also very openly brought him alcohol and nobody tried to stop us.  At that point there was no saving him, so why not make sure he was as comfortable as can be.  \n\nI miss you daddy",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": ">I doubt that would fly in the NHS now.\n\nA lad I went school with who's grandad had unfortunately went down some bad corners said goodbye for the last time at an NHS end of life home and the last photos are him with  grandad in his wheelchair with a tinny of wifebeater and a spliff on the go and this was just before COVID was a thing...\n\nAt the point someone's actively dying it no longer *really* matters does it? Who gives a shit about the long term impacts of ecstasy on the spinal cord when by \"long term\" medicine means decade plus and the woman in front of them has 3 months left, if she's lucky. Who cares that a long term of cocaine is erectile dysfunction when the bloke has maybe a year?",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": ">My mother wouldn't even sneak alcohol onto his ward. She would bring it in brazenly. The nurses and doctors didn't condone what she was doing, but understood and didn't do much more than raise an occasional eyebrow. \n\nReminds me of teenage me taking my granda out of his ward to have a smoke in the early 00s. Poor old lad was dying of lung cancer and asbestosis, and no one but me would buy him cigarettes or take him outside. He was dying anyway, why put him through the hell of withdrawal in his final days? \n\nThe doctors and nurses understood why I did it more than my family at the time.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "So appreciate the compassion in this comment and others supporting OP. Dad's comfort in his last days should be the focus, as it's too late for detox and a 12 step born-again experience with ARD. Much love to OP.",
              "id": 75,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I worked at a hospital in late 80s – early 90s. They did stock beer in the dietary department for severe alcoholics. It's dangerous for them to stop drinking suddenly. The doctor would have to write and order for it, and they would bring in the appropriate amount (determined by the doctor) on the patient's food trays.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Maybe eight years ago I had a patient who was in and out of the hospital for something chronic, I don’t remember what. He was adamant that he wasn’t going to stop drinking, and he’d had severe withdrawals in the past, so the doctor wrote official orders for him to have beer PRN. We kept it in the med room fridge and signed it out like any other controlled substance. I’ve also absolutely heard of doctors stopping by the liquor store on their way into work to bring in something for their CMO patients to drink.",
              "id": 77,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 229,
          "content": "When my grandmother had several strokes that were directly related to her smoking, she was living in a home for a while.  My mom did something similar and had her live with us.  I was so angry that my mom let my grandmother smoke (outside) even knowing it was making her worse.  She sat me down and explained that my grandmother was going to die.  Soon.  Whether she smoked or not, the damage had already been done.  So she wanted to make her as happy as possible while she was still with us.  That was kind of an eye-opening moment for me.\n\nOP's compassion is really showing in her actions and I commend her.",
          "id": 78,
          "comments": [
            {
              "score": 46,
              "content": "The same thing happened to my grandfather, he was a smoker since he was a teenager in the old country. Even after his stroke, my grandmother would sneak in Marlboro Reds for him to smoke in his hospital room and she would be fanning it out the window. He died a couple of weeks later. Nobody else in the family smoked but I still remember my mother and her family smoking reds at the wake and never again since.",
              "id": 79,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 99,
          "content": "With about 6 months left he'll qualify for hospice services and they're usually more lenient with substance use as well. Their focus will be keeping him comfortable for the remainder of his time here.",
          "id": 80,
          "comments": [
            {
              "score": 6,
              "content": "Yes.\n\nDefinitely look into home hospice care.\n\nYou're going to need them.",
              "id": 81,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 70,
          "content": ">My worst fear is dying in a hospital.\n\nAfter watching my mom die of cancer in a care facility like the one OP described, it's my biggest fear as well. She told me she wanted to die but there was nothing she could do about it because she was too weak to wipe her own ass let alone anything else. They just kept her alive until the last agonizing second. If she had been a dog or a cat we would have euthanized her months before and would have considered it the good, right, humane thing to do but if you're a human there's no escape.",
          "id": 82,
          "comments": [
            {
              "score": 56,
              "content": "Ask any emergency medical professional and they'll all tell you that they have Do Not Resuscitate instructions on their file.  Ask for details and they'll tell you why.  When it's done it's *done.* Prolonging life at all costs is mighty cruel.  Years ago I needed CPR for an unrelated issue and my god that thing looks so easy on TV but I couldn't wear a bra or move my arms properly or even laugh without those broken ribs screaming at me for about two months afterwards.  And that's the gentle stuff.  Waking up against your will with brain damage from lack of oxygen, for example, yousa gonna get da braaaaim damage.  Fun! Brain damage AND broken ribs AND your favourite clothes were cut off you and thrown away.  Oooh, yeah.  Sexy.\n\nWe do not do this to pets at all! You've hit the nail on the head with that one.  I'm still 'strongly encouraged' to 'consider' going to rehab again.  Hell, why? Spend my remaining few days hanging out with a bunch of itchy people with no teeth? I've got a dentist appointment in about nine hours for routine checkup, cleaning stuff.  There's no way I'm ending up on the slab in front of all those rich exhausted medical students (giving my body to science: suck it, mum!) with slightly yellowed teeth and calculus buildup.",
              "id": 83,
              "comments": [
                {
                  "score": 7,
                  "content": "Oh yeah, I am an EMT and no way in hell is anyone doing CPR on me for any reason other than using me as an organ donor. \n\nI am fairly young so I can't have a full DNR, mine just specifies that I don't want to get CPR if my prognosis is poor or it means I'll turn into a vegetable.",
                  "id": 84,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Nothing worse than a calculus buildup!  Maybe a trigonometry buildup...maaaybe",
                  "id": 85,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Cos that's just embarrassing!",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 63,
          "content": "I agree with your comment, but I also just want to acknowledge what you've shared in your edit. That truly sucks. I wish you all the joy that your cat and your home can bring you as you approach the end. :)",
          "id": 87,
          "comments": [
            {
              "score": 65,
              "content": "I AM BUILDING A FISH POND! It's directly outside my garden door so I can see it while I'm lying in bed. Gotta hurry up and get the fountain installed before I can't.",
              "id": 88,
              "comments": [
                {
                  "score": 16,
                  "content": "That is so nice! I hope it turns out well. I have a big fish tank, and it gives me such joy and peace of mind.",
                  "id": 89,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Oh, that's so lovely! My dad built a small one in our garden when I was growing up, and I could just get lost watching the fish. I loved how they would drift up out of the depths for food and then dart away again.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 16,
                      "content": "Lovely is the best word for it!\n\nMy most memorable fish moment was while living in England, my husband at the time and I were working together from home and would eat lunch in the park just down the road.  It had a small lake.  People would fish there.  One day we wandered down with our sandwiches and the whole city seemed to be deserted. Not one car, not one person, anywhere.  Ah! England's match in the World Cup was on and everyone was watching it except us.  \n\nNow in this small lake we knew there were fish but didn't expect to see what we did.  Due to no vibration in the ground whatsoever they'd all risen close to the surface to sun themselves on that beautiful day.  They were three foot long carp in all manner of colours.  Hundreds of them, lazily going about their business in the sunshine.\n\nThat was a magical day.",
                      "id": 91,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 62,
          "content": "IANAL, but: I feel like OP should reach out to a lawyer on this case and make sure that they are protected and in the right in their state when making this decision. While I fully agree that it's the compassionate one, I'd hate for them to be charged with something by their terrible siblings upon the father's  death for something like elder abuse. Better to cover all the bases.",
          "id": 92,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "I feel very sorry for your situation. There are no good words to say, I just wish you your tidy cosy home and lovely cat.",
          "id": 93,
          "comments": [
            {
              "score": 28,
              "content": "Thanks.  My cat just dropped a megafart, he's awesome!",
              "id": 94,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 28,
          "content": "Hijacking the top post to share information about Managed Alcohol Programs [https://www.cbc.ca/news/fifthestate/the-pour-treating-alcoholics-with-wine-1.4248072](https://www.cbc.ca/news/fifthestate/the-pour-treating-alcoholics-with-wine-1.4248072)\n\nWhat OP is doing has a lot of scientific backing as genuinely being the best way to help severe alcoholics improve their conditions and even get better.",
          "id": 95,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7844,
      "content": "Social Worker here with years of experience in this area.  You are doing something called Harm Reduction model.  Try Googling it and share info with your family.   But don't expect anyone to understand.   I've been to those facilities and I believe you.  Clean and healthy food is better.  The key here is self determination and respect.   Good luck.  This is going to suck but you are amazing.",
      "id": 96,
      "comments": [
        {
          "score": 1569,
          "content": "This needs to be the top comment. I'm sure the siblings are hurting knowing that their father has chosen to drink himself to death, but OP is trying to create an environment where he is safe and has quality of life.",
          "id": 97,
          "comments": [
            {
              "score": 806,
              "content": "I heard it very often, especially from estranged family who never showed up, that these people get super involved and demanding when it comes to end-of-life care. They refuse to let a brain dead person off the machines, they insist on surgeries or procedures that will only hurt the patient or prolong their suffering.\n\nThis is often done out of a selfish feeling of \"make up\" for the years they didn't spend with the dying family member or didn't care about them. Suddenly they remember about them and want them \"to be around\", because if they died without them having ever made an effort, they would need to live with the knowledge that they messed up.\n\nThese people don't care about the sick or dying person. They care about their fuck up and that's it.",
              "id": 98,
              "comments": [
                {
                  "score": 316,
                  "content": "Ah yes, [the daughter from California.](https://en.m.wikipedia.org/wiki/Daughter_from_California_syndrome#:~:text=%22Daughter%20from%20California%22%20syndrome%20is,to%20prolong%20the%20patient's%20life.)",
                  "id": 99,
                  "comments": [
                    {
                      "score": 189,
                      "content": "\"In California, the \"daughter from California\" is known as the \"daughter from New York\"\"\n\n🤣",
                      "id": 100,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 88,
                      "content": "Wow, there's research and a name for it! Amazing, thank you!",
                      "id": 101,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 54,
                      "content": "Interesting, I didn't know this term. This describes my aunt about her mother to a T.",
                      "id": 102,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "How poetic.\n\nI am writing from CA (I am an Oregonian though) and I am pleased to say that I have always been as supportive as I could to my sister who chose to let our dad back into her house (she eventually had to kick him out, for her own sanity).  \n\nThat's not to say it hasn't been a struggle.  I am so deeply uncomfortable around him (he's a drunk wetbrained sexual predator) that I maintain estrangement. But my sister and I have always done a lot of processing together and I respect her decision to have been there for him, and she respects my decision to be supportive to her but not directly to him.\n\nUgh",
                      "id": 103,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 76,
                  "content": "My half-brother was mad that we didn't force our father to be on chemo when we found out he had stage 4 lung cancer to extend his life. Our father was already in extreme pain, it was why he finally agreed to go to the doctor. My half-brother, who had cut my father out of his life (for good reason mind you), suddenly was pissed we would not force our father to extend his life and be in pain for the max 4 months the doctor said it would give him. It is one of the few things I can't forgive. I get why my half-brother left, our father was horrible to him. It is also horrible to try to demand a person who has stage 4 cancer to get chemo to extend their life and suffering, all for your own selfish wants. My half-brother also refused to visit until our father went unconscious while in Hospice care, all of that posturing, just to refuse to come until my mom told him that our father was still unconscious after 24 hours and looked close to going. He knew our father was in hospice for the week leading up to that, he knew a month ahead this was where it was going. Never came around until our father was not able to talk to him, yet had the nerve to be angry we didn't force chemo. It was insane.",
                  "id": 104,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "It's hard to blame them after growing up with such a father. OP is extraordinarily kind, but I have a lot of sympathy for the siblings as well. They are mourning a father they never had.",
                  "id": 105,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "And let’s be clear: He has *already* drank himself to death. There is no going back. He is past the point of his body recovering from the damage his alcoholism has caused. OP is being extremely progressive in their views on care and end of life support. As someone who works in healthcare, I’ve seen a lot of state run long term care facilities. They are HORRID. OP is doing the right thing. NTA.",
              "id": 106,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Yeah drinking yourself to death somewhere safe around people who aren’t actively abusing you sounds a fuck of a lot better than rotting in a literal hell hole and not even being able to distract yourself from it or your own agony with booze. He would probably end up attempting s****de if he had to stay in that place. Or run away and be homeless on the streets.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "It isn’t a “choice”, but unless someone has the $10,000 a month for a top notch rehab facility (which he’ll need at least a year in) And the fathers consent, this ending is much more civil and compassionate.",
              "id": 108,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 380,
          "content": "the “stealing wipes and sucking out the alcohol” part really got to me. \n\nit sounds like the siblings just want to put their dad out of mind while standing on a moral highground without a second thought for the person they’re harming.",
          "id": 109,
          "comments": [
            {
              "score": 117,
              "content": "My grandpa used to drink his cologne when he couldn't buy more drink. When my dad went to rehab, they weren't allowed things like that and mouthwash for that reason. If someone wants to bad enough, they'll find something. You can't force someone to be sober. At least this way he'll be cared for by someone who loves him and, if he has ready access to alcohol, probably won't be going out where he's a danger to himself or others. Sad.",
              "id": 110,
              "comments": [
                {
                  "score": 28,
                  "content": "My brother did loss prevention at various retail places in not so great areas. He had plenty of stories about the drunks stealing listerine and/or rubbing alcohol to get their fixes.",
                  "id": 111,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "A relative of mine died from drinking hairspray when she was cut off, she had tried innumerable other alternatives as well",
                  "id": 112,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "That is 100% what they're doing",
              "id": 113,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "Honestly, I don't blame them. They, just like OP are the adult children of an alcoholic. The oldest sister was born when her father was 13. They've been presumably been through a lot of the same chaos OP has been through. She's taking one path and they have concerns. I don't blame them for not wanting to take their father in. I took mine in and it had serious consequences for my life. The sister being worried about her reputation is a real thing and I deeply regret some of the things my kid was tangentially exposed to. With a parent like OP's father. There's no winning.",
              "id": 114,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 109,
          "content": "My oldest daughter briefly had to be in a LTC facility (medical reasons). It was a ‘good’ facility, which meant that all the basic needs were taken care of and no one was abused. It was still awful and we got her out as soon as she was stable enough to come home. \n\nI think anyone who has ever had to deal with a LTC facility would agree OP is NTA. Just about anything is better.",
          "id": 115,
          "comments": [
            {
              "score": 21,
              "content": "My maternal great grandma died in one and I hate it. This was also a \"good\" one, but she was still in a room with three other people who were barely responsive and it just stank. just a miserable experience",
              "id": 116,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 48,
          "content": "In Denmark we have state funded homes for people to live in while actively using, knowing that they'll die from it. It's done with no judgment, and people are just supported through whatever time they have left. It's for those who are unable to get sober in any meaningful way, so they don't suffer needlessly and alone.\n\nOP is NTA and a stellar daughter!",
          "id": 117,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 41,
          "content": "Thank you for this comment. I feel this is one of THE biggest reasons no one can agree on an all encompassing method to end homelessness. If people are allowed to use while getting support services, they may eventually stop using. Or if they don't at least they are safe and fed. \n\nThe OP is doing a kind thing by letting her dad live his final days in comfort and safety.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "It's sad that our country allows animals to die with dignity but human beings aren't allowed to make the same choice.",
          "id": 119,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Clinical psychologist replying to say the same thing! I had an Alzheimer’s patient who was smoking pot daily because it’s the only way his life wasn’t painful every day. He’s dying anyway, and at least we can alleviate the physical and emotional pain!",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "What did they expect? That dad would suddenly get sober? That's not how addiction or severe alcoholism works. If people could get sober just cause they wanted to, we would have no addicts. \n\nNTA, OP. You're doing great. Sometimes, people just want to drink or use until they pass. That is their choice for their life. I have seen those state facilities. Fucking horrible. Roaches, bed bugs, people left in beds for so long they have sores. No one is being cleaned or fed because no one cares what happens to addicts. People would rather shuffle them away and not look at them, and don't care how they are treated. \n\nProud of ya. As long as he isn't causing issues in your personal life, by all means. Let him live out his last few days happily than in misery.",
          "id": 121,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "I'm in OP's situation with my mom. She drinks. She uses. She's in congestive heart failure. When she drinks she will blackout for days. Then she'll call the people that supply her with other things and it will escalate. She's either going to overdose or her heart is going to give out. There's nothing I can do to stop her so I try to manage the situation as best as I can. I buy alcohol for her because it's better than the other options. It also gives me an excuse to keep her debit card so she can't access anything else. I live next door so I can supervise her but she can drink as much she wants on her own space. She can party with her friends (as safely as possible,) and I can check on her in the morning. \n\nMy brother is mad I won't make her go to an assisted living facility (I'm her medical power of attorney and durable power of attorney. After her last episode I could have made her move but chose to let her come home.) She would be miserable. She might live longer, probably not, but she would hate everything about her life. She wants to do her thing and she knows it will eventually end her life. That's her choice. I'm not going to try to take it away from her",
          "id": 122,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "I'm so glad you brought up harm reduction.",
          "id": 123,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3207,
      "content": "NTA\n\nIf a 58 year old life long alcoholic wants to drink themselves to death, that seems like their business.\nEveryone is all for body autonomy until it's isn't pretty.",
      "id": 124,
      "comments": [
        {
          "score": 1050,
          "content": "[deleted]",
          "id": 125,
          "comments": [
            {
              "score": 453,
              "content": "Right? Like no shit he's an alcoholic, he was r*ped as a child!",
              "id": 126,
              "comments": [
                {
                  "score": 343,
                  "content": "Not necessarily if the mother was also a child. Sad either way though.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 288,
                      "content": "According to OP, the family gossip is that it was either his mother or his aunt",
                      "id": 128,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 70,
              "content": "13?!",
              "id": 129,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 57,
              "content": "That stod out to me too. I'm hoping it's supposed to be a 35 year old child, not 45. Otherwise OP's dad has had a hell of a fucked up life.",
              "id": 130,
              "comments": [
                {
                  "score": 108,
                  "content": "See OP's comment elsewhere in this thread - it is indeed the fucked up option :(",
                  "id": 131,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Oh God... that poor man.",
                      "id": 132,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 40,
                  "content": "Sadly not a typo. OP confirms in the comments that he was sexually abused as a child",
                  "id": 133,
                  "comments": [
                    {
                      "score": 4,
                      "content": "Yeah, I saw that after. That's awful. Poor man.",
                      "id": 134,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 321,
          "content": "This is how I feel too. At least OP is compassionate towards their father and is helping him to live his last days how he wants.",
          "id": 135,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 60,
          "content": "Jumping on this, if he is having occasional lucid moments it might be worth trying to discuss Do Not Resuscitate orders and Living Wills with him. If he still has capacity, lasting power of attorney for health is also a good idea (this is a thing in the uk not sure if elsewhere) as you could then act as his advocate when he loses capacity.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2305,
      "content": "Can I comment on my post?\n\nCan the guy who keeps sending me private messages accusing this being fake because of the ages just comment here? Or at least read this? \n\nYes my dad had my sister when he was 13. There’s some family gossip that his daughter may actually be his sister or his cousin (meaning she’s my aunt or cousin once removed) but I am not lying about the ages and I’m happy to discuss it publicly. But either you hit the save button one too many times or are really obsessed with my “lie.”",
      "id": 137,
      "comments": [
        {
          "score": 547,
          "content": "You should be able to block them, too, so they can't send you any more messages. That should help.",
          "id": 138,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 264,
          "content": "My paternal great grandma was kidnapped and \"married\"  when she was 12 or 13 and kept in a closet when my great grandfather went to work until she had a couple kids and he figured she wouldn't run away. Some young people have hard lives all around the world, the age is unusual and sad but not impossible",
          "id": 139,
          "comments": [
            {
              "score": 87,
              "content": "My great grandmother was sold to a family to be their house keeper when she was 12 (she always used the word \"sold,\" it was the 1930s so slavery was illegal in the US by this point but they gave her parents a lump sum of money & she was never paid again).\nThe wife died within a year, the man she was sold to married her immediately & got her pregnant.\n\nMy grandmother was raped by a family friend & had twins when she was 15, that was in the 60s.\n\nThat kind of thing used to be EXTREMELY common, & still happens every day all over the world. It's insanely ignorant of that person to think that the ages being tragic makes it impossible. I wish we lived in a world where a 13 year old boy becoming a father is an outlandish story, but that's unfortunately not the case.",
              "id": 140,
              "comments": [
                {
                  "score": 6,
                  "content": "And thanks to a lot of lawmakers in the US, it may just get worse here again. The world is a fucked up place a lot of the time and some people really don’t like facing it.",
                  "id": 141,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 153,
          "content": "You can add this in an edit I believe",
          "id": 142,
          "comments": [
            {
              "score": 279,
              "content": "I’m right at 3000 characters so I wasn’t sure",
              "id": 143,
              "comments": [
                {
                  "score": 158,
                  "content": "Edits don’t count against the 3000 char limit.",
                  "id": 144,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 35,
          "content": "Thanks for clarifying. I couldn't get over that age difference lol.",
          "id": 145,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "Definitely also try sending their name and messages to the mods. That IMO should be a permaban-able offense. That's an extreme breaking of rule 1.",
          "id": 146,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 15,
          "content": "I have an aunt that was 16 when my severely alcoholic grandfather died. He died with over 70 years and i first met her on her funeral.\n\nI have no fucking clue how this old alcoholic was able to inpregnated a woman at that age but ....",
          "id": 147,
          "comments": [
            {
              "score": 3,
              "content": "Men can impregnate at any age. They don't have a \"biological clock\" like women do.\n\nThe only difficult part would be convincing a much younger woman to sleep with him, but it could just be as simple as money.",
              "id": 148,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "Id block them and report them to the mods.",
          "id": 149,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1146,
      "content": "I feel like you’ve done your research here… if there’s really no other way, just death at home w you VS in a disgusting facility alone, you’re making a merciful choice. You have a father who, for all intents and purposes, has fucked his life up and negatively impacted his children’s lives. I think many people would tell him to rot. And as someone in recovery myself, I’d like to believe everyone can stop drinking, but the man does not want to and states that. NTA. The man is dying and he has made his choices to get him here. I think it’s kind for you to let him die comfortably. At least you can live the rest of your life knowing he wasn’t somewhere disgusting, w no family around.",
      "id": 150,
      "comments": [
        {
          "score": 696,
          "content": "Thank you for the kind words and as you can imagine from my experience, I have a tremendous amount of respect for people that find the strength to stick with recovery.",
          "id": 151,
          "comments": [
            {
              "score": 146,
              "content": "Good luck. This is really hard thing to deal with as a 22 year old",
              "id": 152,
              "comments": [
                {
                  "score": 101,
                  "content": "We found a hospice facility that allows smoking for the patients outside. I know people think we are AHs, but he has 3-6 mo the left.",
                  "id": 153,
                  "comments": [
                    {
                      "score": 62,
                      "content": "My grandpa always said he wanted to be told when he had six months left to live so that he could take up smoking again. He died very quickly of pneumonia and didn’t get his cigarette. It’s something I regret. I hope he enjoys his cigarettes!",
                      "id": 154,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "My mother and I both worked in nursing homes earlier in our careers, her as a director of nursing and me as director of social services. We both have always had the view that especially if they're going to die, anyway, let them have whatever they want (as long as it's legal). If they want to smoke, let them smoke, though I had to have policies in place to make sure they did it safely. If they want cake every day, let them eat cake. \n\nMy only concern for OP's father is supervision at home because of the dementia. It sounds like OP has a good head on their shoulders, but I hope that someone is there during the day to make sure he doesn't wander off or anything when he's drunk/confused if he's physically able to do so.",
                      "id": 155,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 49,
              "content": "NTA  but your brother has e good excuse his kids shouldnt see that or be around that.. your sister is self centered...",
              "id": 156,
              "comments": [
                {
                  "score": 112,
                  "content": "Brother has a shit excuse. If he moves dad to a facility close to him he can visit dad while leaving the kids at home. He could even go after work and not even tell the kids he's going there. Brother is using the kids as a get out of jail free card for the effort he is not putting in.",
                  "id": 157,
                  "comments": [
                    {
                      "score": 72,
                      "content": "As a daughter of a drug addict (meth) as well as a daughter of an alcoholic, I understand why his other children don’t want to watch their father kill himself. It doesn’t make them assholes. I love my parents, but I have suffered my entire life because drugs and alcohol mattered more to my parents than loving and raising me. After years of being constantly hurt and disappointed, I had to pull away from them for my own mental well-being. \n\nPlease don’t be so harsh in your judgment of OP’s siblings. All three of them have obviously chosen to deal with their father’s alcoholism and impending death in different ways. None of them are wrong for that. Dad has caused immense suffering for all of his family members that will probably be felt for generations to come. Why should any of them have to watch him kill himself, especially when he has already inflicted God only knows how much pain and trauma in each of his children’s lives?  \n\nI’m sorry OP has to be in the position to even make this decision. Siblings aren’t around to fully appreciate how bad off their dad is, and may think there is still hope for recovery. That was MY knee jerk reaction when first reading this post. However, that was an emotional reaction not a logical, educated one. Maybe OP should do a virtual meeting with dad present so they can see for themselves how ill he is. Include his doctor and a SW or psychologist to help facilitate the conversation so that all his children are on the same page as far as what can be done to give dad a peaceful transition. Personally, I think the only AH here is alcoholism/addiction. OP, I applaud your loving, compassionate spirit and hope that you and your siblings can allow this experience to draw you closer to each other. I’m certain you’ve all suffered enough because of your dad’s alcoholism. It’s stolen your dad. Please don’t allow it to steal your relationships with each other. XX",
                      "id": 158,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "The brother's excuse is complicated and a situation that I was in as a kid as well as working with people like that now. The excuse of not wanting the kids around that comes from many different places. I know with my grandmother it was because my dad had been told by her before she got sick that she hated my dad's kids because we weren't full Italian or full French. It was also around the same time that we also learned that when my dad was very young she had abandoned him, never came home, a few weeks later when his aunt hadn't seen him nor heard from them she came over to find him alone in the apartment. We would always ask why we can't go see her or why even when she got sick we couldn't see her, it was because my dad didn't want us to build a relationship with her and then be \"abandoned\" like he had. he was protecting us from something he had endured. \n\nIn this case with the brother, it sounds like it's the same thing; he doesn't want his children to feel what he felt growing up, even for a short period of time. Now, is it right, not necessarily, but parents will do anything to protect their kids from any form of harm, even if as an outsider looking in it seems so bullshit and cruel. The brother is probably not wanting the kids to make memories of their grandfather and have them be sad or upsetting memories. most people have good memories of their grandparents and of course those same people have the sad ones near the end, but they have the good ones to remember them by. The brother might not want them to have only bad or negative memories of their grandfather and only have those to remember him by. Maybe the brother doesn't want the kids to have a tainted view of him and simply know that they had a grandfather that loved them and was very ill and is now gone. In honest that's far better than having them go and see him while he's in the state he's in. \n\nEven if he leaves the kids at home and goes afterwards, the kids are going to get curious and start asking questions, and if not, they are going to figure it out on their own and then the kids have a choice to make: do they confront their father about it or do they hold resentment and anger over it? This is not something kids should have to deal with at a young age. Then what about the grandfather in this case? We have to ask ourselves if the brother knows that his father would never want his grandkids to see him like this, knowing full well that he has made terrible mistakes in his life with his own kids. The brother absolutely knows more about his father than we do and we can only assume things. Maybe the father had expressed previously not to bring the kids around to see him the way he is, or maybe he feels like he would just be a disappointment to them, much like he feels that his own children might view him as. \n\nIt's easy for you or anyone to label the situation as bullshit and move on because we don't know the intricacies of it, but what I do know is that it's not a simple open and shut response when it comes to dealing with this type of situation. We have to take into account the brother and what he's thinking, the kids and what they are thinking, and the father and what he's thinking. I have seen it time and again where I work and each family has made different choices in the exact same situation, because no one is the same and they know the others involved far better than I ever will.",
                      "id": 159,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 11,
                  "content": "But does the brother really have a good excuse? The brother wouldn’t need to take the kids.",
                  "id": 160,
                  "comments": [
                    {
                      "score": 14,
                      "content": "The brother might also be protecting his children from the way being around his father affects him. I would have rather not seen my mother affected so badly as a child from seeing a parent drink themselves to death. As much as she tried to shield us from reality, every visit hung around the house like a heavy fog of anger and discomfort. It's not just about kids seeing their grandfather directly. It's also about doing your best as a parent to make choices that will help them in the long run. So no, the kids aren't an excuse they are his priority.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "OP, if you happen to see this, I recommend you ensure you have a strong support system and therapy in place if possible. I just watched my mom drink herself to death, and it was... not pretty, to say the least. Once the liver failure led to toxic buildup in her brain, it was \"hiding poop filled depends and rotting food in drawers behind clothing\" level of not pretty. \n\n\nBest of luck.",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": ">has fucked his life up\n\nHe was 13 when his oldest was born, I don't think he fucked up his own life here.",
          "id": 163,
          "comments": [
            {
              "score": 7,
              "content": "OP clarifies in the comments. Victim of sexual abuse by his own father and grandfather to create confusion around the paternity of an underage girl those men were abusing...\n\nNo wonder the poor guy found solace in being too drunk to think",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Sometimes people just lose the fight with their demons and their addictions. It's an awful, horrible reality of life. My cousin drank himself to death and died in his 30s because he neglected himself so much. I'm happy he's at peace.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 718,
      "content": "OP, you're NTA. You have a bunch of terrible options and you've chosen the least awful one.\n\nThe people criticising you have a very unrealistic view of how the world actually works. You can't rehabilitate a 58yo alcoholic *who doesn't want to stop drinking*, and you can't *force* your siblings to contribute to private care.\n\nIf your siblings don't like it, they are free to take over his care. But they'd rather criticise you from a safe distance. So sucks to them.\n\nWishing you and your husband lots of strength.",
      "id": 166,
      "comments": [
        {
          "score": 309,
          "content": "His addiction is so bad that he is sucking on *alcohol wipes* to try and get something.  That isn't something that you can just ignore, he has become dependent on alcohol to be able to function.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Exactly this",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 7,
          "content": "Agreed. He’s an adult, and adults are allowed to make their own choices. He knows the risks, so there’s not much else to do. I watched my great uncle die from alcoholism just this past year. We knew it was coming for at least a decade, but he didn’t want to stop and that’s his choice. It’s going to be very ugly and sad, but being at home with people who care about him is far better than the alternative.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 525,
      "content": "NAH, but please please tell us you have talked this through with a criminal lawyer from your jurisdiction. The last thing you want is to be charged with assisting suicide. The lawyer should be able to advise you how to stay on the right side of the law, and how to document that you are doing so.",
      "id": 170,
      "comments": [
        {
          "score": 173,
          "content": "This! I'm thinking exactly the same: you sign your father out of rehab, and start buying him 30 BEERS A DAY and in months he is dead... I mean... it doesn't look good from the outside...",
          "id": 171,
          "comments": [
            {
              "score": 187,
              "content": "Just for the record, it doesn't sound like he's in rehab, it sounds like the sister placed him in a long-term care facility (nursing home). Probably in their locked dementia unit as well. Nursing homes do not facilitate substance use rehab, only physical rehab. The most a facility like this might do is assist the resident in attending an AA meeting, but the vast majority won't even do that. So he's not receiving active treatment for his alcoholism.",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 67,
              "content": "Unless someone from the outside decides to step up and chip in to help, they should mind their own business. What OP has chosen is to not let her father die in a horrible facility sucking on alcohol wipes. Yes, she should speak with a lawyer.",
              "id": 173,
              "comments": [
                {
                  "score": 2,
                  "content": "The government, mind it's own business with a dead body involved? Unlikely.",
                  "id": 174,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "OP isn't forcing him to drink.  He chooses that himself.",
              "id": 175,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 111,
          "content": "Or elder abuse, or any of a dozen other things that this could be in violation of, depending on where OP is. \n\nOP, your legal rear is hanging way out with this plan and you need to not only consult an attorney but LISTEN if the lawyer tells you this is a no go.",
          "id": 176,
          "comments": [
            {
              "score": 29,
              "content": "Agreed, I can just see the siblings coming out of the woodwork after the fact and blaming OP, demanding she be charged. I have mixed feelings about this plan but right or wrong the fact is its a legal liability without some kind of notarized consent at the bare minimum, and frankly he's not fit to consent anyway.",
              "id": 177,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "To this point, see if you can get a hospice service to make a recommendation about his alcohol intake. If they recommend he keeps drinking (since he is near death, doesn't want to quit, and don't want to trigger withdrawal), having that in writing could protect you from any legal actions the state or your siblings may take against you after his death.",
              "id": 178,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "If he is drinking daily, withholding alcohol or reducing too quickly will cause him to have seizures which could ultimately kill him. It’s sometimes better to supply alcohol in a measured way. 30 cans weak beer may be what his body is used to currently.",
          "id": 179,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Yes and make sure that you have plans in place for his medical bills, or any potential damages etc just so your compassion doesn’t put you in a worse place financially",
          "id": 180,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 262,
      "content": "NTA. As an alcoholic myself and much experience of being around other addicts I can say with certainty that some addicts do not want to and will never stop. For some addicts it will be terminal. \n\nAt least you are giving him some dignity and the chance to be around family. \n\nI am sorry he hasn't found it in him to get better for you and your family at least but I believe you are doing a very selfless thing.",
      "id": 181,
      "comments": [
        {
          "score": 13,
          "content": "Recovering alcoholic here too. The sucking on alcohol wipes really got to me. This disease is so cruel",
          "id": 182,
          "comments": [
            {
              "score": 4,
              "content": "Keep up the good fight! It's a horrible illness that kills so many. It gets easy to forget that after a little while sober.",
              "id": 183,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "The guy who invented AA did so after trying LSD\n\nI would highly recommend to all alcoholics to take a dose of acid, lay down in a comfy place with some water, put on some headphones and listen to the album Music For Psychedelic Therapy by Jon Hopkins\n\nGood luck 🙏",
          "id": 184,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 223,
      "content": "NTA - your siblings put you in an impossible situation and your choice is the least terrible option (in your mind)\n\nAs much as it sucks to enable him, alcoholics will go to great lengths to get drunk. You can’t just cut him off at this point and cure a lifetime of drinking. And obviously a better care facility is the ideal solution, but y’all can’t afford that.\n\nYou should cut your sis some slack though. The real estate game is cut throat, and reputation is everything… /s\n\nEdit: you’re/your",
      "id": 185,
      "comments": [
        {
          "score": 455,
          "content": "Lol it made me laugh so hard…my sister has 15 huge billboards on the interstate into her city with her huge ass dilly Parton hair, her massive fake boobs and actually said to me “people can’t know I have an alcoholic for a dad!” \n\nUmmmm they know.",
          "id": 186,
          "comments": [
            {
              "score": 222,
              "content": "15 billboards, fake boobs, and a real estate agent? Yet she can't afford anything towards a decent facility?",
              "id": 187,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 82,
              "content": "With that kind of reputation, she can at least afford to fork over cash. She doesn't have to be involved, but it's AH of her to not be contributing financially and sticking dad in a state-funded facility when she clearly is a successful enough REA to have billboards -.-",
              "id": 188,
              "comments": [
                {
                  "score": 30,
                  "content": "But why should she have to pay for her alcoholic dad? She has no right to comment on what op is doing, but my guess is she grew up with an alcoholic father that sucked. Most people don't put somebody they love in a state-funded care home if they don't have to. He probably deserved that.",
                  "id": 189,
                  "comments": [
                    {
                      "score": 64,
                      "content": "Then she shouldn't get to make comments on what her 22-year old sibling is doing. If she's not contributing and not helping, then she should stay silent and not judge. It is now no longer any of 45 y.o. business.",
                      "id": 190,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 59,
              "content": "This made me lol 😂",
              "id": 191,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 17,
              "content": "Jesus Christ did I ever LOL\n\nGod bless you child",
              "id": 192,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 6,
              "content": "Your good sense of humour will serve you well!\nMy only advice is to secure the keys to your cars to prevent any accidental ‘delirium brain’ risk of him trying to drive. If wandering becomes an issue, alarms on the doors and GPS watches can be very helpful too. \n\nAll the best to you!",
              "id": 193,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 139,
      "content": "NTA\n\nYour siblings are AH and are living in denial. They would rather criticize you than take responsibility. I'd challenge them to come up with a feasible alternative and arrange it by themselves. I doubt they can.\n\nYour solution seems to be the most humane one.\n\nYou could look into at-home hospice care for your father. It might take some of the burden off you.",
      "id": 194,
      "comments": [
        {
          "score": 161,
          "content": "For sure, we may have to at some point my husband and are fully acknowledging that we may have bitten off more than we can chew. We are also working with a social security disability attorney which may actually pay for hospice care, the trouble is my dad does not want to go into another facility.",
          "id": 195,
          "comments": [
            {
              "score": 63,
              "content": "You are a good person. I have heard of a similar situation with the alcohol induced dementia. His partner allowed him a few beers a day, then his family intervened, took away his alcohol and died a miserable death. He was happy with his partner.\n\nTough decision, but sounds like the right one for him & you.\n\nYour siblings can fo......",
              "id": 196,
              "comments": [
                {
                  "score": 7,
                  "content": "I’ve also heard of physicians prescribing drinks for their end stage patients like these.",
                  "id": 197,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 56,
              "content": "In-Home hospice care is a thing too, they come to your house a few days a week or more, depending on what the situation calls for.",
              "id": 198,
              "comments": [
                {
                  "score": 31,
                  "content": "Yes, I am a volunteer with a hospice agency and much of the work is either in-home or at facilities that aren't specifically hospice facilities. \n\nAs a volunteer, I visit with patients either for socializing purposes, literally just hanging out keeping them company (often when they are in a facility without any family or family not living close by - but not always!) or to provide respite for caretakers when patients can't be left alone. \n\nIn addition to volunteers, the hospice team will include hospice physicians, nurses/nurse's aides, social workers, clergy, providing a very wide range of services to help provide comfort at the end of life. \n\nMy agency also offers to have volunteers sit vigil with families at the very very end of life. This is in the last 24-72 hours of life, when the end is imminent and family members are often sitting with the patient round the clock. The volunteers will take the overnight shifts, encouraging the family to rest or keeping the family company as they sit vigil. I have not done this - I have signed up for shifts (my agency breaks them into 4 hour shifts overnight) but have always received a late night call that my services were no longer needed.\n\nAnd OP, as a hospice volunteer and someone coming up on 8 years of sobriety, if I were asked to take an assignment with your father, I would say absolutely, it'd be my honor. We all deserve as much dignity in death as we can squeeze out of this hard hard world.",
                  "id": 199,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yup, my mom used to be an in-home hospice care taker. It's definitely a good option for OPs father if they can vet the care taker, because I think some would have \"moral\" issues with continuing to give a dying alcoholic booze (to be very clear, I do not think this is morally wrong. I think OP is absolutely doing the right thing.)",
                  "id": 200,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "They are really helpful, too.\n\nThey can help with all the medical issues that come up and usually get a Dr. on the phone in minutes.\n\nThey also help the family and can give you a break.",
                  "id": 201,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "At home hospice agencies are definitely an option. They're also usually more lenient with substance use than traditional home health services. I would recommend at least looking into it. He would probably qualify now, but if you don't think y'all are ready yet it's better to do your research ahead of time rather than when you need it immediately.",
              "id": 202,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "That acknowledgement that you \"may have bitten off more than you can chew\" is basically what your siblings felt for themselves.  Children of alcoholics can often have vastly different opinions and experiences in the same family.  For example, some may have tried to be people pleasing, hoping if they were \"perfect\" their parent wouldn't have a reason to drink, some may have been \"parentified\" taking on parenting of their own parent, and some can be in denial of any problems.  Both of my grandfathers were alcoholics.  In both families,  the oldest often took the brunt of the hardships growing up including, verbal and physical abuse, sometimes including taking punishment for somethng younger siblings did.  The oldest in both also often protected the younger siblings from witnessing a lot, taking their younger siblings to another room or even hiding in a closet.  Now as adults, they have vastly different feelings and memories.  In both families, the older children have almost no fond memories of their dad and carry resentment while the younger siblings talk about great memories and some don't even thinnk their dad really had as bad as a drinking problem as their older siblings remember.  \n\nThis is all my round about way of saying you're NTA, but neither are your siblings. Having a parent with severe alcoholism is traumatic and surviving that truma is hard.  They are dealing with it in the only ways they know how now.  Chances are they've been acting like the parent and taking care of your dad in one way or another for most of their lives and they just can't do it anymore.  And then seeing the sibling they may have spent a lot of energy \"protecting\" from their alcoholic parent's chaos, throw themselves into the chaos, is hard for them to support.",
              "id": 203,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": ">are also working with a social security disability attorney which may actually pay for hospice care\n\nYou should also consult a criminal lawyer to make sure you haven't opened yourself up to legal liability here. \n\nGiven that you've described your relationship with your siblings as \"broken\" in comments, once your dad does they may blame you. Elder abuse allegations can result in serious consequences, especially if the behaviour results in the death of the vulnerable individual. Buying your father alcohol to drink himself to death, especially after a doctor explicitly told you that he will die if he consumes alcohol, may well result in you being criminally charged and prosecuted for your dad's death.\n\nTaking in your dad likely means you have taken on a duty of care towards him. Buying him alcohol could be a violation of that duty. When that alcohol leads to his death, the legal conclusion may be that YOU killed him. So seriously, go see a criminal lawyer in your jurisdiction before you continue with this plan.",
              "id": 204,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Look for in-home palliative care. It is the step before hospice. If you start with in-home palliative care you can usually transition to in-home hospice care when it gets to that point. Make sure you get all the legal documents for power of attorney, DNR, etc all in place before palliative care starts.",
              "id": 205,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "I’d make sure that you are able to get a medical power of attorney as well. I’m sure you know but it’s clear you need to be in charge of his medical decisions moving forward.",
              "id": 206,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "[deleted]",
          "id": 207,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    }
  ]
}