{
  "post content": "My son is 8 years old and recently attended his friend's 8th birthday party. This friend is my best friend's son. I don't let my son have any/much junk food at all and usually he brings his own snacks (for this incident it was carrot sticks and ranch) to events that have a lot of sugary foods.\n\nMy best friend bakes a lot, and made a special chocolate cake for her son's birthday. When it comes to my son, I don't let him have cake. This is personal preference for his health, not for any allergy reasons, and he is not diabetic or gluten free. My son knows he isn't allowed to have cake because of the additives. When he told his best friend this at the party, his friend apparently got upset and told him it was \"good cake\", not bad like I say, because his mom made it, and it was his birthday cake. My son ate cake, got a sugar rush, and crashed, making him cranky for the rest of the day after we left the party. \n\nI told my friend she needs to have some kind of consequences for her son to teach him not to peer pressure other children into eating things they're not allowed to have. She said because it wasn't an issue of allergies or health, that she's sorry my son was cranky but she won't be punishing her son or talking to him about it on his birthday. She says also that she'll just that she'll watch more closely/make sure her husband does in the future, as well as have a chat with him on another day about respecting food habits. (I love my friend, but historically, her and her husband have always said 'yes' to their son and not given him any consequences for anything.)\n\nBoth of us were present at the party and did not see them sharing the cake (they were outside eating in the backyard with their fathers and some other parents supervising while we cleaned up) so it's not an issue of anyone going behind anyone's back, just teaching children boundaries and respect. \n\nI let my son stay for the rest of the party and be with his friend, so it's not like I ruined the day. \n\nAITA for being upset with my friend's son and the fact that she won't punish her son for pressuring my son into eating cake?",
  "id": 1,
  "comments": [
    {
      "score": 64013,
      "content": "God forbid your son experience a moment of joy and celebration.\n\nYTA\n\nFYI - \"sugar rushes\" are a myth.  They have been debunked many many many times by scientists and medical professionals.\n\nThat your son was irritable for the rest of the day was likely because, having had fun at a friend's birthday party, you pissed all over his enjoyment of the party with your ridiculous attitude and over-the-top indictment of the whole party.  I can only imagine your son's embarassment at you having the utter gall to  demand consequences for a kid, on his birthday, who shared his cake with your son (who, by your own admission has NO health issues that would be affected by said cake).    It wasn't the cake that made your son irritable, it was YOU.\n\nI seriously doubt that you being declared the asshole in this will in any way soften your views on such things.\n\nIts perfectly fine to want to make sure that your kids eat nutritiously.  You also shouldn't be a fascist about it.  In fact, the more you try to exert such iron control over it, the higher the likelyhood you will drive your son straight into an eating disorder.   There isn't a doubt in  my mind that your son has a stash of candy at various places.  Because of YOU.\n\n(edit - thank you all very much for the awards!)",
      "id": 2,
      "comments": [
        {
          "score": 17320,
          "content": "Be fair.\n\nHe might not have them *yet*, eight-year-olds are often very obedient.\n\nGive him five to eight years though and that kid's going to be an absolute sugar fiend.",
          "id": 3,
          "comments": [
            {
              "score": 14802,
              "content": "Yup. Ask any kid that was denied sugar by parents. What do they do immediately after being in charge of thier own food? Pick all the marshmallows out of the sugar cereal they weren't even allowed to eat before and just eat them like I did. My older sister was given whatever cereal she wanted growing up and hates sugar cereal now. She is much older. \n\nThis kid will rebel when they are able. And later might even cut mom off entirely if this is not the only area of control she is crazy about, and I'm willing to bet it's not.\nOp yta. Loosen up or lose your kid at 18.",
              "id": 4,
              "comments": [
                {
                  "score": 6658,
                  "content": "Absolutely! This is no different than the kids who grow up with super strict parents and then go absolutely WILD when they go to college and get a little taste of freedom.\n\nOP is setting up her kid to blow right through the freshman 15 in his first *term* let alone year of college.\n\nEdit: well it appears as though my cakeday had especially good timing this year",
                  "id": 5,
                  "comments": [
                    {
                      "score": 7758,
                      "content": "I can personally confirm this. As soon as I moved out, I started to eat EVERYTHING sugary and fatty that I wasn't allowed when younger. Which,  looking at it now, was detrimental to both my physical and mental health.\n\nSo yeah. OP, YTA. Stop this now before you lose your son.\n\nWhy are you so worried about ONE piece of cake? It's a homemade cake (so no additives) and there are no other health reasons for eating a little cake for affect his health. Yes, eating a lot of sugar and fat leads to health issues, but this was *a single piece* of cake on his friend's special day. I understand your concerns about nutritious food, but it seems like you're being a dictator about it.\n\n[Sugar crashes are a myth.](https://www.goodrx.com/well-being/diet-nutrition/are-sugar-high-sugar-crash-real)\n\nHere's the thing - it was never about being able to eat cake. It was so much more than that - having ALL your food controlled to the slightest bit, missing out on a central part of birthday fun every year, and now being stripped of that joy and normalcy the moment he let himself enjoy it. Which is exactly why you DID ruin the day for him.\n\nYou know what? This is the most likely path to eating disorders you could've chosen for your son. From personal experience, making ANY food 100% off-limits will only lead to an unhealthy relationship with that food and food in general. Even now, it's more than likely he's going behind your back for sweets. He's 8 - he isn't old enough to make ALL decisions for himself, sure, but at least give him some agency.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1149,
                      "content": "Careful commenting on this post, looks like its your CakeDay, wouldn't want OP getting mad at you!",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 38,
                      "content": "I agree!  If your child can’t have the little, normal childhood things like birthday cake they get bitter AND develop no self control. He’ll try everything five times when he leaves your house.",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Oh man you always knew who had THAT mom by the reaction to the cereal bar in the dining hall.\n\nTo be fair cereal bars are awesome and I wish they existed still in post college life.",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "Moderation is a wonderful thing and having a treat once in a while is not a bad thing. He’s going to grow up and be on his own one day. And he’s going to discover all these things that you never let him have. When he figures out he likes these things he’ll go overboard because he never learned to do them in moderation. Science has proven sugar rushes and crashes are myths also. YTA for exaggerating the situation and for seeing something happen because of a placebo.\n\nBy your logic he shouldn’t eat pasta or bread because the carbs will raise his sugar level which will eventually crash and make him cranky. Maybe he’s cranky because of the way you treat him. I’m sure it was more about you making a big deal over the cake and not because of the sugar.",
                      "id": 10,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "Happy Cake Day!\n\nI normally don't post these but it seemed especially appropriate to this post.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 17,
                      "content": "Happy celery sticks day.",
                      "id": 12,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 671,
                  "content": "My ex was exactly like this. Wasn’t allowed anything sugary and as an adult ate nothing but sugar. My kids were both allowed a little bit but my youngest always preferred fruit and veg. His dad nicknamed his locust because of the way he could destroy a fruit bowl. As he got older he’d eat sweets but he’s always been more of a savoury fiend. Don’t deprive your kids or they’ll rebel later on.",
                  "id": 13,
                  "comments": [
                    {
                      "score": 26,
                      "content": "Yep that's how my youngest is I give him options for food and let him have sugar when he wants. He prefers water to drink the soda but if we have gatoraid or flavored water (using lemons or berry's to flavor he will drink that too.) \nHe went through the picky stage of the usual Mac n cheese, hot dogs and chicken nuggets and now loves veggies and I even got him to eat baked beans. (😊☺️ He used to gag looking at them) giving kids some control over there food they will make healthy choices in the long run. Usually.",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "And I had to have healthy cereal most of the time but sometimes got sugary cereal as a treat, and as an adult, I have healthy cereal most mornings, and sometimes as a treat I have toast with Nutella.\n\nMy kids eat healthy cereal, but just like my parents did with me, sometimes as a treat we get a box of Coco Pops, or they get one of those variety sample packs where you get a bunch of different cereals ranging from boring to sugary, and you can eat them right out of the bag inside if you want.\n\nAnd on Sundays when we have a nice breakfast as a family, they can have jam or Nutella on their toast. (It used to be peanut butter. My kids think the discovery that I have a mild peanut allergy is *the best thing ever* because we started getting Nutella instead.)",
                  "id": 15,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 185,
              "content": "LOL fair enough",
              "id": 16,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "I also wonder how this kid is going to turn out as a parent. I had some friends whose mom was forbidden from eating junk food/drinking soda, and to compensate for that she let her kids (my friends) eat all the junk food they wanted. One turned out diabetic and the other certainly wasn’t a beacon of good health. Obviously you need to lay down some restrictions on junk food, but I never understood the notion of banning it outright.",
              "id": 17,
              "comments": [
                {
                  "score": 31,
                  "content": "It's the same mindset as abstinence-only sex education, which is the way to go for sure if you want to be a grandparent when your kid is 15.",
                  "id": 18,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 3035,
          "content": "I also just want to hop on this comment and let OP know (from personal experience) that making any food taboo or forbidden is a one street straight to your son having a super messed up relationship with food and will only make him gorge on sugary foods whenever he can get his hands on them. A good rule that I’ve adopted is “everything in moderation.” A little sugar won’t kill him!",
          "id": 19,
          "comments": [
            {
              "score": 934,
              "content": "This. Having sugar framed as a treat only lead me to the \"eating my feelings with cheesecake\" phase of my life. \n\nSometimes you just want sugar and that's okay.",
              "id": 20,
              "comments": [
                {
                  "score": 270,
                  "content": "Yup! I have so many food issues now. Needing a \"treat\" when i have a bad day.\n\nMy friends have a bath or go for a jog, i deal with my emotions through food",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "This mom says sugar is not even a treat, it is completely forbidden even on a birthday. I cant imagine how fucked up this poor kid's relationship with sweets will be.",
                  "id": 22,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 327,
              "content": "That was my first thought, too. OP is setting up their son to have a really unhealthy relationship with food in general, not just junk food. I can understand making sure your kid doesn't eat cake and soda for every meal, but making him take carrots to a birthday party because he can't have cake?? Yikes on bikes.",
              "id": 23,
              "comments": [
                {
                  "score": 25,
                  "content": "This story has to be fake, right? No caring parent would make their kid take carrot sticks to a birthday party and make the kid watch everybody else eat cake...\n\nThey would at least let the kid have a healthy sweet that he normally doesn't get to have...even a fruit at least! I feel any parent who does this deliberately wants their child miserable...",
                  "id": 24,
                  "comments": [
                    {
                      "score": 21,
                      "content": "There’s another post where OP was lied to by their parents about what food they were able to eat so that OP wouldn’t eat any junk food, then found out that they had none of those food allergies and intolerances.",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 29,
              "content": "So much of this. OP is creating a situation where here kid is always the “different” kid at food times. Healthy options are great, but don’t make the kid socially isolated because you have food issues to work out. \n\nYTA. Please let your kid, be a kid while he is still free of adult anxieties about food.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Yup absolutely true, my mother did this to me and I have had a horrible relationship with food for years. I started hiding my intake and eating at friends houses years ago, she started fat shaming me around 14 years old, when I was a size 6. She continues to this day.",
              "id": 27,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "This is exactly what has happened to me. I have guilt around it. So much that, growing up, I would hide the wrappers and such my shoving them places. My mom would, inevitably, find them and I'd get in a shitload of trouble for it.\n\nIt only gets better when you have more control and I'm lucky to be in therapy (for this and other reasons), but it really fucks up your relationship with food.",
              "id": 28,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1824,
          "content": "The tone OP sets doesn't sound like it's coming from concern for her sons health. More so, the control she has over him. \n\nIf it was truly about the cake, it would be, \"you know better\" to her son. \n\nBut instead, it's this big thing because mom has to make sure every inch is accounted for when it comes to what her child does. \n\nSharing a piece of cake is nowhere enough sugar to give a kid a sugar rush. Nor enough to do any damage. \nOP HAS NO LEGITIMATE REASON OTHER THAN \"UNHEALTHY\"\n\nI second you though, it wasn't a sugar crash. It was mom is ruining what little fun and normalcy he was experiencing.\n\n\nI bet OP has had cake, and has little snacks that aren't \"healthy\". \n\nI'm sure if she keeps it up she'll win the game of \"Who's going to the retirement home\"\n\nYTA",
          "id": 29,
          "comments": [
            {
              "score": 1469,
              "content": ">mom is ruining what little fun and normalcy he was experiencing.\n\nSeriously! Who forces their children to bring carrots and ranch dressing (lol, so healthy) to a frigging birthday party if they don't have any food allergies? Oh, that's right. A control freak. Get over your self, OP, and consider checking in with a therapist about orthorexia, before you create an eating disorder in your son, too. YTA",
              "id": 30,
              "comments": [
                {
                  "score": 804,
                  "content": "I understand bringing healthy snacks to events where its like a outing or party and asked to bring it. \n\nBut forcing the kid to stand out from his peers at a social event is the fastest way to a kid who hates their parent.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 188,
                      "content": "seriously this behavior is so well documented that allergists warn parents about ensuring that even with their child's food allergies are varied and severe they need to find ways to allow their children to enjoy culturally relevant food situations because when they don't those children regularly end up sayong \"fuck it\" and eat completely unsafe foods which causes them severe illness or death. Why ANYONE would purposefully push these things on their kids is beyond me.",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 34,
                      "content": ">But forcing the kid to stand out from his peers at a social event is the fastest way to a kid who hates their parent.\n\nAlso forces the kid to be looked at differently at school after this by the other kids. If he has a winning personality, is a good athlete, he'll be overlooked and not bothered, but otherwise.\n\nI'd like to add that I agree with the friend who said she'd talk with her son but NOT on his birthday. It was his day of fun & celebration. I'd be that parent too.  Another day for discussion.  \n\n\nYTA mom. It's good that you want you child to eat clean, but there's a time also to relax your vigilance and let him be. It's only for a couple of hours in the course of a lifetime.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "If I were forced to do that as a kid, I'd rather just not go.",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 384,
                  "content": "Even if they have allergies, most parents will figure out some sort of safe treat so their kid doesn’t feel too different.\n\nTreat, not carrots",
                  "id": 35,
                  "comments": [
                    {
                      "score": 27,
                      "content": "Seriously if someone had given me a carrot and said it was a treat (especially when everyone else is having fucking cake), I would have laughed in their face. Or worse.",
                      "id": 36,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "All she is doing is making this kid hate vegetables because they will think of them as a punishment.",
                      "id": 37,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "I was diagnosed with celiac disease as an adult and know how isolating food restrictions are at a party or any social event. I can’t imagine forcing that on an 8 year old kid FOR NO REASON. Freaking carrots while all the other kids have birthday cake and fun. AYFKM",
                      "id": 38,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "This so much. YTA alone for expecting a kid to eat *carrots and ranch* at a birthday party. Fuck's sake, if they aren't gonna have cake, give them a fun snack at least.",
                      "id": 39,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 26,
                  "content": "The part that gets me is that she doesn’t want him to eat cake because of the ‘additives’.  OP, have you looked at the additives in your ranch dressing?  And if the cake is made from scratch, there may be less additives in that cake than in the ‘healthy’ ranch dressing.",
                  "id": 40,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 395,
          "content": "Yeah the sugar rush has been debunked by scientists repeatedly for decades. I actually did a speech on it my senior year of high school… 12 years ago, with plenty of sources. It basically boils down to hyperactivity actually being caused by:\n\n1. Their environment. Hmm kids being hyper at a party, who’d have thought? Nonsense. Must be the sugar. \n\n2. Parents. Parents expect their children to be sugar high, so they attribute any signs of hyperactivity to their sugar. They also mentally exaggerate how hyper their child actually is, whether consciously or subconsciously. There is also a theory that parents make “sugar rushes” happen by helicopter parenting after their child consumes sugar or in party situations, which alters the child’s behavior in turn. \n\n3. Caffeine. Chocolate has caffeine in it. The amount varies throughout different chocolate products, some to the point that it is insignificant. However, the point remains that if you never give your child any caffeine and then let them have a ton of chocolate, they’ll probably get an energy boost. It’s pretty unlikely that a little bit of cake gave him enough of a caffeine boost to be noticeable. \n\nI can 100% guarantee it was because he’s 8 and at a birthday party. The crash likely happened from him wearing himself out as literally every other human does, especially kids. OP is being insane and owes her friend an apology.",
          "id": 41,
          "comments": [
            {
              "score": 49,
              "content": "Empirical evidence against sugar rush: eat half a dozen krispyKremes, you’ll must likely fall asleep on your couch.\n\nEdit: also, about #2: there’s also a lot of selective memory at play, conveniently forgetting all the times their kids were hyper without sugar.",
              "id": 42,
              "comments": [
                {
                  "score": 26,
                  "content": "well... the things I will try in the name of science.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 316,
          "content": "And even if no eating disorder, a future very unhealthy relationship with junk food. A lot of kids who parents are this strict have difficulty with moderation.",
          "id": 44,
          "comments": [
            {
              "score": 19,
              "content": "Yup, I have 2 toddlers under 4 and they know where all our candy and snacks are. They will often ask for fruits and veggies instead. We still have candy left from Halloween because they'll usually ask for fruit instead.\n\nParenting is tough enough without micromanaging. I hope OP relaxes a little. Also, the sugar thing is a myth. Being around other kids though and playing/letting out a lot of energy...  that'll sure make my toddlers crabby, but it's because they are tired/worked up from an exciting day.",
              "id": 45,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 284,
          "content": "Well said. OP is YTA and a thief of joy. I say let them eat cake.",
          "id": 46,
          "comments": [
            {
              "score": 23,
              "content": "I love that you say that having Marie in your name! Hahaha just missing Antoinette",
              "id": 47,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 193,
          "content": "does anyone else, after reading this, now wish they couldve tried this homemade chocolate cake? im so hungry now",
          "id": 48,
          "comments": [
            {
              "score": 50,
              "content": "are you serious?  you'll get a sugar rush and be cranky for the rest of the day.  No cake for you!",
              "id": 49,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "It's the same reason I can't watch The Great British Baking Show. It makes me *need* cake",
              "id": 50,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 25,
          "content": "I'm reminded of the neighbor boy who threw all of his candy wrappers over our shared back fence behind our garage. Quite a load of wrappers to clean up!",
          "id": 51,
          "comments": [
            {
              "score": 16,
              "content": "My kid has a friend with eating issues. The 1st time she stayed yhe night she ate my kid's entire easter/chocolate/junk stash (my kid likes to save and space it out over the year... We are talking more than a shoebox full). And stuffed the wrappers under the mattress.\n\nAt the time my kid was 8 and friend was 10.",
              "id": 52,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "My brother grew up with a friend whose mother acted like this. No sugar, and no butter or fats.\nAs soon as they were teens and he had money of his own, he’d go to the grocery store, buy a box of Pop tarts and down the whole thing in the store parking lot. My parents tried for years to get child services to intervene because the kids were all underweight and would lose their minds at any event involving food.\n As adults this poor kid and both his siblings ended up with eating disorders. The youngest one weighed 400lbs+ at one point from binge eating. He had a stomach bypass but last I heard was back up to 300lbs. The middle brother died about 10 years ago from complications from anorexia. My brother’s friend is still bulimic and binges and purges in his 40s. All his teeth were gone and he had dentures in his thirties. He’s been hospitalized numerous times with esophageal and stomach problems. My parents saw the mother a few years ago and all she could talk about was how proud she was of her oldest because he stayed thin. Please, please don’t do this a kid. Don’t pass your food issues onto your kids. Moderation really is everything.",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "I really wish people would stop with the sugar rush BS as well. Whenever I point it out I'm told I'm not a parent and don't understand these things.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 21486,
      "content": "YTA It was cake on a special occasion. Your son isn’t being fed cake daily. Also, you have issues with additives in cake, but find ranch to be acceptable?\n\nEdit: I’ve thought about this more and honestly if I was your best friend I would be pissed at you and asking you to talk to your own kid. He made her son feel bad about the cake she made him for his birthday. He felt the need to defend the cake and was upset by what your son said.",
      "id": 55,
      "comments": [
        {
          "score": 8063,
          "content": "Love this comment. Homemade cake wouldn't contain \"additives,\" but flour, sugar, milk, and eggs. I can see avoiding sugar on a regular basis, but this was a special occasion. OP is ostracizing this poor child to prove a point.",
          "id": 56,
          "comments": [
            {
              "score": 3243,
              "content": "Yeah it was the additives comment that sealed it for me when talking about a homemade cake.\n\nOP, YTA",
              "id": 57,
              "comments": [
                {
                  "score": 2424,
                  "content": "But he had wholesome ranch dressing to eat!  We all know there are no additives in Hidden Valley!",
                  "id": 58,
                  "comments": [
                    {
                      "score": 945,
                      "content": "Yeah I don’t see how ranch dressing is somehow better than homemade cake from a nutritional standpoint.",
                      "id": 59,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 468,
                      "content": "I was looking for a comment on the ranch. She doesn't likes additives, literally gives her son sauce filled with additives but complains about the cake which probably has less additives than the ranch 😂😂😂. I meen OP could be making her own ranch but I very highly doubt it.\nEdited to add\nOP YTA",
                      "id": 60,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 305,
                      "content": "But it was *Organic*",
                      "id": 61,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 31,
                      "content": "As long as it’s real DOP Hidden Valley",
                      "id": 62,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "OP probably knows as much about nutrition as my mother did when she forced me to go on an apple only diet.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 915,
              "content": "The fact it was homemade cake is the real kicker. I understand avoiding processed food that is full of crap and a shit ton of sugar to cover the chemical taste of crap…but a homemade cake???",
              "id": 64,
              "comments": [
                {
                  "score": 260,
                  "content": "yeah theres probably still a ton of sugar in a homemade cake but honestly its a child and a special occasion so who really gives a crap? a little isnt going to hurt him. i personally try to limit refined sugars for myself but like fuck would i send my young kid to a birthday party with carrots and ranch lmao op needs to unclench a little",
                  "id": 65,
                  "comments": [
                    {
                      "score": 303,
                      "content": "Like OP could have at least figured out some kind of low/no sugar carrot cupcake or fruit-based treat, but carrot sticks??? That's a one way ticket to getting bullied by his peers.\n\nFYI, OP, carrots have a really high sugar content and ranch is full of additives so who are you even kidding?",
                      "id": 66,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 39,
                      "content": "It's almost as if it was possible to find a middle ground between eating cake 3 times a day and absolutely never eating cake at all, eh?",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "Well, I don't. It could be the crappiest low-grade supermarket cake full of mysterious ingredients you can't pronounce properly and it would still be NOTHING because it is a BIRTHDAY cake on a BIRTHDAY.\n\nYou think she stops at what the kid is allowed to eat? Think of all the other normal childhood stuff that is off limits.",
                  "id": 68,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 22,
                  "content": "And *even then*... for once, at a birthday party, who cares...\n\nP.S. I say this while my mom is a nutritionist, and she's the one who taught me that! \"Healthy\" also includes treats, and even junk sometimes!",
                  "id": 69,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 684,
              "content": "Probably so she can do the sanctimonious mommy-brag of not letting her children eat junk while literally looking down her nose at the other moms when one of them pulls a packaged granola bar from her bag for their hungry kid.",
              "id": 70,
              "comments": [
                {
                  "score": 23,
                  "content": "Sanctimommy!",
                  "id": 71,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 36,
              "content": "I KNOW ! Can you imagine the sadness in the soul of this poor kid with his stupid carrot sticks ….. also sugar rushes aren’t a thing …. Alienating your kids and creating eating disorders on the other hand 100% are YTA …. Your poor kid ☹️",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "No no no, you don’t understand. It’s because cake is *enjoyable* that she doesn’t want him to have it.",
              "id": 73,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1234,
          "content": "Yeah this is a control freak who is going to make their kid look like a freak for the rest of his time at school. This poor kid!!",
          "id": 74,
          "comments": [
            {
              "score": 944,
              "content": "Imagine the poor kid eating carrot sticks while all his friends were eating cake..",
              "id": 75,
              "comments": [
                {
                  "score": 680,
                  "content": "I was the kid that got carrot sticks and a boiled egg, and plain porridge every morning. Guess what, I eat Coco Pops for breakfast every day. YTA OP, let the kid eat some friggin cake jfc.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 121,
                      "content": "Same. And now I eat candy and cakes and shit all day every day and fuck it's a problem.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 23,
                      "content": "Exactly. I was never allowed sugary cereals as a kid and now I eat Capt. Crunch by the handful all day, every day.",
                      "id": 78,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 543,
          "content": "I’m afraid OP is off the wall enough to see these comments and take away ranch as an option as well. OP has yet to comment anywhere so idk. But enough people mentioned the ranch that I feel so sad for the kid.",
          "id": 79,
          "comments": [
            {
              "score": 22,
              "content": "Before long the kid will only be allowed carrot sticks and ice chips.",
              "id": 80,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "The first 5 ingredients of that Ranch are nearly identical to the ingredients in that cake. Sugar is the 4th ingredient in Hidden Valley Ranch. \n\n\n\nI'm guessing this mom watches a lot of crunchy Tik Tok or Instagram and gets all of her \"nutritional knowledge\" from a skinny chick in yoga pants who spams her children for views and money.\n\n\n\nOP, YTA. Here are all the ways that you were rude in this situation:\n\n\n1. Eating sugar every day and in high amounts is bad, yes, but jfc let your kid have a piece of cake every now and then. \n\n\n2. You're also an AH for making the other mom and birthday kid take the blame when *you were there yourself, not watching your child.*  (this should have been point #1, honestly)\n\n\n3. Lastly, I cannot fathom sending one of my kiddos to a BD party with carrot sticks just so I could look down my nose on everyone. \n\n\n4. There are zero \"additives\" in homemade BD cake, but there are plenty in Ranch dressing. Please read a book on nutrition if this is a hill you're going to die on. Add one on disordered eating to boot so you know what's in store for your child(ren).",
          "id": 81,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13201,
      "content": "YTA. 1. Your son is old enough to say no to a piece of cake. 2. You were there so watch your own kid. 3. Science has proven over and over a sugar rush is not a real thing so that was not an issue and your kid was cranky over something else. 4. Lighten up and let your kid have fun, good lord.",
      "id": 82,
      "comments": [
        {
          "score": 4798,
          "content": "Probably cranky about his mom being such a stick in the mud.",
          "id": 83,
          "comments": [
            {
              "score": 2445,
              "content": "For real, like I bet he got home and his whole day was ruined because his mom was pissed off and he is 8 years old and couldn’t have one damn piece of cake without the shit hitting the fan.",
              "id": 84,
              "comments": [
                {
                  "score": 774,
                  "content": "Kid is going to have junk food hidden allllllll over his bedroom when he gets money.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 433,
                      "content": "Oh yeah, this is a recipe for an unhealthy relationship with forbidden foods and secret eating.",
                      "id": 86,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 47,
                      "content": "No way - it'll be eaten way before it has time to be hidden.",
                      "id": 87,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 40,
                      "content": "The awful thing is that she will probably ignore the advice about making sure her kid has a healthy relationship with sugar, and go straight to making a mental note to be even more harsh about it when he's older.",
                      "id": 88,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 29,
                      "content": "And a full blown eating disorder",
                      "id": 89,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 18,
                      "content": "Yup. Frankly, this type of parenting is basically just begging for your kid to develop an eating disorder.",
                      "id": 90,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 1054,
              "content": "If I finally tasted cake and realized my mother had kept it from me for eight years, I'd be cranky as hell.",
              "id": 91,
              "comments": [
                {
                  "score": 315,
                  "content": "And wondering why all the other kids can eat cake without any issues.",
                  "id": 92,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 55,
                  "content": "I'd be mad as hell. Mom is doing the kid no favors.",
                  "id": 93,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 532,
              "content": "A carrot stick in the mud apparently",
              "id": 94,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1294,
          "content": "It’s my number one pet peeve when parents say that their children will have a “sugar crash” or “get hyper”. Kids that are restricted will grow up to over indulge and not know their limits.",
          "id": 95,
          "comments": [
            {
              "score": 474,
              "content": "Same here! A simple google search immediately gives you multiple results saying a sugar rush isn’t a real thing. I just roll my eyes when I hear other parents say that stuff. \n\nI have no problem with my kids having 1 piece of candy a day (the mini size pieces) they sometimes ask for another piece and no big deal but, if I never let them have any they would just go nuts later on in life because I never let them have anything! Same deal with soda, we typically get a soda about once a month or occasionally at a restaurant and guess what? They don’t ask for it all the time BECAUSE they have always been allowed it in moderation and therefore it’s not forbidden fruit.",
              "id": 96,
              "comments": [
                {
                  "score": 117,
                  "content": "My sister said my kids must have been on sugar rush, one day when she came over and I was like what? They always act this way! 😂Jumping and running around is what kids do! Lol.\n\nMy kids can have whatever they want as long as it's safe for kids (no alcohol) but they can't sit there and pig out on it and they don't get it every single time they ask just bc they want it. Everything in moderation is the key!",
                  "id": 97,
                  "comments": [
                    {
                      "score": 30,
                      "content": "My sister once said my daughter must be hyper and needed medication because she wouldn't just sit around at 4 years old and watch cartoons.  I never limited tv but I encouraged and actively pushed activity, especially outside.  She used to get really upset if it rained and she couldn't go out.  Then she had two children of her own and realized that is normal in children.",
                      "id": 98,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 34,
              "content": "Take me for example. No caffeine or soda allowed or in the house. Not even juice. Once I went to friends houses that weren’t warned of this I would drink 6 cans of soda and go buy candy and junk. I had a whole overeating and junk phase for a couple years as a teen.\n\n**edited to add myself and all my siblings have had weight issues or eating disorders since puberty",
              "id": 99,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 216,
          "content": "Kid's probably cranky because he just realized how much yummy cake he's been getting screwed out of over the last 8 years.",
          "id": 100,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 33,
          "content": "5. You’re teaching your kid to have weird/unhealthy relationships with food. I limit my toddler’s junk intake too but cake at a fucking BIRTHDAY PARTY?? No question, he gets to have a (small) piece. What you’re doing, this is how you get kids who binge eat when they’re out of your sight/lie/trade their healthy lunch for shitty food at school when they know you won’t know about it. \n\nKeep your food issues to yourself and maybe see a therapist. Stop putting weird shit onto your kid and teach them health/nutrition, not orthorexia.",
          "id": 101,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 29,
          "content": "All this, *and* she notes that her kid was outside supervised by his father. \nSeems like Dad thinks kid should be allowed cake, to me 👀",
          "id": 102,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 19,
          "content": "He was cranky because he saw that every other kid gets to actually enjoy being a kid and have a fun treat at a party and the only way he can have that is by smuggling a piece of cake from his best friend. I would hate going to a birthday party where everyone was having fun while I’m the one munching on carrot sticks in the corner. Restricting diets on children like this usually has opposite of the intended effect. They will begin stealing and gorging on “forbidden” foods. My niece is a victim of that, it’s sad.",
          "id": 103,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11953,
      "content": "YTA and here's what is going to happen when your son realizes all of the food that he's not allowed to eat.  He's going to sneak it, he will learn to sneak other things, he will have food issues, and possibly a weight problem.  Kids need to be taught that food is fine and we eat in moderation.",
      "id": 104,
      "comments": [
        {
          "score": 1987,
          "content": "Exactly. And in the meantime he is going to be bullied because her mom is going to be perceived as crazy and him like a weirdo.\n\nAlso she doesn't realize how what she says sounds insulting to the other boy. That cutie instead of getting mad shared with his friend, despite the fact that his friend by repeating what his mom said had just insulted his birthday cake. And she wants to punish that good spirit. They are 8, they are not grown ups planning to take over the world.\n\nThe OP should watch the show Rita, episode 2 on Netflix to get a better feeling of how her actions are making her son feel and how it will get worse.",
          "id": 105,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1094,
          "content": "Yes, hi, lifelong eating disorder haver here. Not being allowed any “junk” foods (basically anything processed) just made me crave it all the more. I was wilding for baloney on bleached white bread as a child.",
          "id": 106,
          "comments": [
            {
              "score": 386,
              "content": "Yep.  I wasn't allowed chips of any sort.  As you can imagine, I lived on cool ranch Doritos for a year.",
              "id": 107,
              "comments": [
                {
                  "score": 98,
                  "content": "I was a goblin for Kraft dinner. My mom made macaroni and cheese from scratch, with a roux and everything but I just wanted to eat what everyone else was eating.",
                  "id": 108,
                  "comments": [
                    {
                      "score": 37,
                      "content": "I know I very much hurt my grandma's feelings when I told her I just wanted simple pb&j or baloney sandwiches for lunch instead of the regular lunches she used to send me with. I just wanted to fit in **AND** I really did just love pb&j sandwiches. Still do but they're much more refined and use better ingredients than simple white bread and store bought jams and jellies.",
                      "id": 109,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 22,
                  "content": "I was the same way with soda when I was a kid I went to a summer camp I remember in Middle School and I realized I could drinks soda as much as I wanted. So I drink it too fucking week straight for every meal until I finally got sick of it and I realize I don't have to have soda everyday. And I just clicked and I drank other things",
                  "id": 110,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 128,
          "content": "This right here. It's been proven time and time again that demonizing or stigmatizing certain foods leads to disordered eating - either extreme deprivation or bingeing, and often in combination with each other. OP has set up her son for a lifetime of failure with food. I feel so awful for him.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 37,
          "content": "TW; talk of ED\n\nas someone who developed an ED due to my food intake being limited and sugar being restricted, i can attest to this. your child WILL start to sneak food. He'll most likely do it a lot. I'm speaking purely from experience. He'll be bullied for not being able to eat what he wants like everyone else, an outsider simply because of his eating habits which OP has forced on him. Kids rebel. There WILL be a sugar addiction, weight gain, and possibly even an ED (binge eating) like me. There WILL most likely be an unhealthy relationship with food if OP doesn't ease up.",
          "id": 112,
          "comments": [
            {
              "score": 21,
              "content": "I wouldn’t be surprised if OP has an ED herself. This post SCREAMS current ED and her inability to see past the evils of sugar feels like someone who is trying to exert control over everything in her life.",
              "id": 113,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "At my kid’s old school there was a mom that was a food nazi. She’s check her husband’s spending each day and he’s get in trouble for buying food (she’d pack his lunch; money wasn’t the issue). She’d make comments when parents brought salads to pot lucks because she was surprised that the rest of us knew what veggies were. Her kids weren’t allowed a long list of items, not allergy related.  Whenever those kids were offered food at school, they’d shovel it in their mouths.",
          "id": 114,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "This so much this. I bet the children said something like this. \n\nThe sad carrot kid: “I can’t have cake my mom says isn’t bad” \n\nBirthday Boy “it is not bad! My mom makes the best cake.” \n\nCarrot boy: “but my mom says additives are bad” \n\nBirthday boy: “she just uses eggs, it’s good cake!” \n\nCarrot boy: “oh great!” \n\nProceeds to have the most delicious thing he has ever tasted and is so mad that his mom told him it would be bad. He never eats a carrot again.",
          "id": 115,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "YTA I was also on a very restrictive diet as a kid and it sucked. So sad to have your kid have to eat carrot sticks at a birthday party. At least I got whole wheat cake made with honey.",
          "id": 116,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "This exactly. I was never allowed to eat sugar. My brothers and sister would get candy and I would get nuts. Now I’m obese and struggle with moderation.",
          "id": 117,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 7890,
      "content": "YTA.  The 8 year old kid at his own birthday party offered a piece of cake his mother made for him to your 8 year old kid, his friend, and you want him to have ‘some kind of consequences’.\n\nGet over yourself.   This kid didn’t ‘pressure’ him.  Your son said I can’t eat cake because it’s bad for me (and I have an overbearing mother who tells me that) and the kid just said there’s nothing bad in my moms cake.   Your kid didn’t HAVE to eat it.    He chose to.  \n\nAnd no, neither she nor her husband have any serious plans to discuss respecting food habits,  but they are sure discussing you right now.",
      "id": 118,
      "comments": [
        {
          "score": 2058,
          "content": "100% this. I wonder how much longer you and your friend will actually be friends if this how you handle all life situations. \n\nYTA. It was one piece (was it even a whole piece or did these two kids share a piece?) of cake one time. I can’t imagine being that kid sitting there with some carrot sticks while everyone else is enjoying birthday cake at a birthday party. Just wow.",
          "id": 119,
          "comments": [
            {
              "score": 998,
              "content": "I wonder how many birthday parties this boy WON'T be invited to.",
              "id": 120,
              "comments": [
                {
                  "score": 470,
                  "content": "That’s a big thing. As a mum I would think twice about inviting this kid if I knew mum was going to be like this. These rules for a play date are fine but a birthday party?",
                  "id": 121,
                  "comments": [
                    {
                      "score": 314,
                      "content": "The little boy isn't the problem but no one is going to want to deal with his mom.",
                      "id": 122,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 22,
                      "content": "Right. If it was just a random Tuesday and they always bring cake to play dates and it’s becoming an issue of having it too often, that’s one thing. But unless he has A TON of friends, he’s not getting birthday cake every day. Maybe once or twice a month, if that.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 213,
                  "content": "There’s no way I would want the carrot stick weirdo at my party.",
                  "id": 124,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 128,
                  "content": "This is definitely going to be gosspiped about by the other moms and OP's kid will either not be invited anymore or feel patronized at parties from parents that mean well but just end up signaling the poor kid out with a whole platter of baby carrots and celery all for him.",
                  "id": 125,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 79,
                  "content": "I wonder what treats he has at his own birthday party? Carrot Sticks and Ranch Dressing?",
                  "id": 126,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Maybe once. I know that my kid wouldn't have been thrilled about a carrot stick & ranch birthday party.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 34,
                  "content": "OP would probably be fine with that. You just know she wants her kid friendless and completely dependent on her.",
                  "id": 128,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 525,
              "content": "I wonder why OP’s son is cranky. \n\nEvery kid at the party: having fun and enjoy some junk food \n\nOP’s kid: crunching on some carrots with ranch \n\nOP (to son): you must be cranky and irritable because you had some sugar earlier",
              "id": 129,
              "comments": [
                {
                  "score": 230,
                  "content": "My heart is so broken for this kid.  Like, not only is his TOTAL AH mother setting him up for an eating disorder, but it hurts like hell to be a kid feeling left out.  He doesn't even have an allergy and he can't participate in special occasion food?  He has to watch all the other kids have a slice of birthday cake and have fun, while he sits there left out??  The kid is gonna need SO MUCH THERAPY for the emotional pain, as well as the eating disorder when he learns to sneak treats.  I'm practically crying for this poor child.  YTA u/cakethroawayAITA.",
                  "id": 130,
                  "comments": [
                    {
                      "score": 17,
                      "content": "Right?? Even as an adult, who has lived for years with food allergies, it's really unpleasant to not be able to participate in communal treats at work and stuff. And I can at least have my own versions of treats sometimes. I really feel for this kid and the exclusion he must feel!",
                      "id": 131,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 64,
                  "content": "Also, she says he got a sugar high and crashed, but, like. He was an eight year old at a birthday party? The modus operandi for little kids at birthday parties tends to be—get really hyper, run around like maniacs, and then crash because that is, in fact, what tiny humans do after their natural energy runs out anyway. Like, sugar didn’t have to be involved. Kids hype each other up at parties—there’s loads of stimulation.",
                  "id": 132,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 29,
                  "content": "Tbh, ranch as a frequent snack is way more unhealthy than once in awhile cake.",
                  "id": 133,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 112,
              "content": "I hope the two boys are friends for much longer though. This sounds like such a sweet interaction. The one kid wanting to share the (especially delicious because his mum made it) cake with his best friend.\n\nPunish him? They should have taken a photo and treasured the memory.\n\nAnd speaking of memories, I was a sugar-free kid at my problematic father's insistence. I strongly remember being very young, sitting on the kitchen table at my grandmother's house and spooning delicious refined white sugar into my mouth from the sugar bowl. She didn't stop me either, although I don't particularly recommend this for children. But it was a stupid rule then and it's a stupid rule now.\n\nOP, YTA.\n\n\nEdit: Added missing cake.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "How depressing for that poor kid. Even kids with allergies or intolerances usually show up with a separate treat they can have in all the parties I've been to.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 19,
          "content": ">and the kid just said there’s nothing bad in my moms cake.\n\nAnd the eight year old kid was absolutely right too. Which is more than I can say about OP. Additives? Sugar rushes? Sheesh.",
          "id": 136,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4523,
      "content": "YTA  Let me get this straight, cake=bad, ranch dressing=healthy. Really???",
      "id": 137,
      "comments": [
        {
          "score": 1216,
          "content": "Maybe it was fat free. That immediately makes it okay. :D",
          "id": 138,
          "comments": [
            {
              "score": 1055,
              "content": "There are so many more additives in fat free ranch than “regular” ranch 🤣",
              "id": 139,
              "comments": [
                {
                  "score": 415,
                  "content": "They add...extra sugar!",
                  "id": 140,
                  "comments": [
                    {
                      "score": 87,
                      "content": "Yeah fat-free foods can be such a joke lmao. They'll remove the fat, but it turns out the fat was what was making it taste good, so they have to add sugar in. It's the same with yogurt.",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "That would be ironic because fat free things tend to have more sugar, lol.",
              "id": 142,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 283,
          "content": "I  wonder what OP would say to a cake made entirely of ranch dressing?",
          "id": 143,
          "comments": [
            {
              "score": 39,
              "content": "Add carrots and OP would probably call that a carrot cake 🤣",
              "id": 144,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "Lol that's so dumb. On top of that it's at a birthday party where everyone's having cake..",
          "id": 145,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 3550,
      "content": "YTA  \nJesus Christ let your kid enjoy some cake. The other kid was just trying to be nice.  \nAlso, and I kind of feel bad for typing this as your kid will probably end up just eating carrots from now on, but ranch has additives too. Oh, and sugar rushes are a myth. Your kid crashed because he was tired after a party, not because he ate some cake.",
      "id": 146,
      "comments": [
        {
          "score": 2406,
          "content": "THIS THIS THIS. From the idea that ranch dressing is \"healthier\" than any party snacks or cake, to the idea that sugar is \"bad\" and causes behavioural issues, literally every part of **OP's post is rife with pseudoscientific mommy blogger nonsense, literally none of which is either factually correct or part of genuinely healthy dietary guidance for growing kids.**\n\nShe sounds like an orthorexic nightmare who's going to stunt her kid not only nutritionally but socially by making him \"that weird kid\" who every other kid is painfully aware of because his mom never lets him have ANY treats even though he has no allergies or health issues. **I'll be shocked if this kid doesn't come out of childhood with, at the very LEAST, serious disordered food issues and a big old stamp of social stigma right across his poor little forehead.** Absolutely heartbreaking.",
          "id": 147,
          "comments": [
            {
              "score": 340,
              "content": "As someone who was diagnosed with celiac in her 40s and thus can't eat gluten anymore, I can safely say that food and drinks are the glue of society. Going out with friends? Food. Going out on a date? Food. The holidays? Food. Visiting other nations? Try their food.  \n\n\nFood is huge, socially. And by restricting foods in social situations, she is setting her child up for being ostracized and later getting food issues. Guess what happens if I find glutenfree cheesecake? I ate cheesecake for breakfast. Because I could.",
              "id": 148,
              "comments": [
                {
                  "score": 44,
                  "content": "To be fair, I’m a fan of cheesecake for breakfast just as a matter of principle.",
                  "id": 149,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 162,
              "content": "Preach it! This post disgusts me",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 144,
              "content": "I predict that kid will also get very good at lying.",
              "id": 151,
              "comments": [
                {
                  "score": 26,
                  "content": "This right here. I had a mom like her and I could basically pass a lie detector if I ever had to.",
                  "id": 152,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "When I was in first grade, we had a sleepover for a friend's birthday and were served plain, unsalted, no butter, air-popped popcorn for a snack and whole wheat pancakes with only honey for breakfast the next day. *I'm almost 50 years old and I still remember the crappy weird food I was served at that party when I was five.*",
              "id": 153,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 247,
          "content": "Amen, I came to say the same, sugar rushes aren't real. Kids act crazy because they are excited at a special event, then exhausted afterwards. I'm vegan, and even I think you need to let your kid have some cake. He is going to move so far away from you when he grows up, and you will wonder why. We are all here telling you why, please listen.",
          "id": 154,
          "comments": [
            {
              "score": 38,
              "content": "To say nothing that the kid was cranky after his mom embarassed him \n\n\"HOW DARE YOUR SON AT HIS OWN BIRTHDAY PARTY SHARE CAKE!!! I DEMAND HE BE PUNISHED!!!\"  \n\nI'm sure that had nothing to do with it.",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3063,
      "content": "YTA \nIf you don’t think your child will at some point ( if he hasn’t already) eaten sugary things at school or friend’s houses you are sorely mistaken.\nRestriction and off limits foods and activities are a sure way to get kids to do the exact opposite.\nYou are also setting your child up for issues with food and weight in the future.\n\nNo food is inherently bad, everything in moderation.",
      "id": 156,
      "comments": [
        {
          "score": 1311,
          "content": "I’m also crying at OP feeding her son carrots (hello sugar) and ranch dressing (ah yes. Organic ranch dressing, sustainably sourced in the boundary waters of the Arctic, hand picked by native polar bears and lovingly sealed in packets made of beeswax) instead of a piece of cake once in awhile.",
          "id": 157,
          "comments": [
            {
              "score": 431,
              "content": "And it’s HOMEMADE cake. What additives exactly does she think are so harmful in a homemade cake when ranch dressing is okay?\n\nAnd I can’t even get into the poor birthday boy being told his cake is bad on his birthday. I’d be so pissed off if I was that boy’s mom.",
              "id": 158,
              "comments": [
                {
                  "score": 24,
                  "content": "Right you know how we fill homemade pastries with preservatives? I can't believe I had to go this far to find someone else pointing out her pseudoscience bullshit",
                  "id": 159,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 213,
              "content": "Where can I find that organic, non-GMO, gluten free, vegan, soy free, dairy free Ranch?",
              "id": 160,
              "comments": [
                {
                  "score": 65,
                  "content": "In OP's fantasy land.",
                  "id": 161,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I mean I love ranch dressing but a poor 8 year old at a birthday party…",
              "id": 162,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 426,
          "content": "It’s also super weird to get angry at an 8-year-old for trying to share his special cake on his special day, particularly if your son’s explanation was “the stuff in the cake is bad” instead of “the stuff in the cake is bad for me.”\n\nMy parents didn’t want me eating aspartame as a kid (they were concerned about long-term effects) and it was pretty hard to explain. No sugary/processed food or food with additives, even when eating out or with friends, is taking it very far, though.\n\nAlso, sugar rush isn’t a real thing. Kids just act hyper when parents tell them they expect them to act hyper.",
          "id": 163,
          "comments": [
            {
              "score": 35,
              "content": "Or kids are hyper because they're at a party, with all the running around, playing, screaming ... and they crash afterward because they've used up all their energy.",
              "id": 164,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "This! A good parent teaches self moderation and portion control. All OP is doing is being controlling and setting the son up for health problems/eating disorders later in life.",
          "id": 165,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1698,
      "content": "YTA. You're setting your kid up for an unhealthy relationship with food. \n\nIn regard to this post, the other kid didn't understand why your son was saying that his birthday cake is bad. I don't think an 8-year-old was peer pressuring your child about cake. You're at fault for thinking any child would choose carrots over cake and not teaching your child moderation instead of just saying no to good things.",
      "id": 166,
      "comments": [
        {
          "score": 178,
          "content": "100 %. YTA, it’s totally setting him up for disordered eating, he’ll be sneaking it and eating it behind your back any chance he gets. Teaching moderation is a much healthier way.",
          "id": 167,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Exactly.  This parent if forcing an eating disorder on her kid.  If the kid does stick to it and becomes obsessive with his food as an adult it's not a good thing.",
          "id": 168,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "This is exactly what I was thinking. Kids coming from such restrictive households tend to go pretty wild the second they're out of the house and realize they can eat whatever they want without parental repercussions.",
          "id": 169,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1412,
      "content": "You make your kid bring carrot sticks to birthday parties????? Hello. What about teaching moderation? This is the roadmap to an eating disorder!\n\nYTA",
      "id": 170,
      "comments": [
        {
          "score": 296,
          "content": "Finally someone said this! Everyone is so focused on ranch dressing and \"let him eat some cake from time to tíme...\" I mean, they are totally right, but then there we have 8 year old boy who is forced to eat carrot sticks on children parties. How f**d up is that? Enjoy puberty, OP, it's gonna be a fun one. YTA.",
          "id": 171,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 75,
          "content": "I remember a while back reading Jamie Oliver made his kids take packed lunches to McDonalds birthday parties. And I thought that was bad enough.",
          "id": 172,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "No kid will choose carrots over cake. OP is delusional.",
          "id": 173,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}