{
  "post content": "So, my sister is one of the typical popular girls who just cares about what’s trending, fashion stuff, her friends and how to maintain her popular image among her social circle. \n\nWe have the coronavirus pandemic going on in India and cases are rising rapidly. Also, there have been no social events/meet-ups this year. \n\nNow my sister wants to celebrate her birthday and invite 15-20 friends home. We have a basement that kind of sucks (not that good looking). She’s planning to spend thousands of dollars on renovation, decoration and all sorts of things so that her *high-class* friends don’t judge her or pity where she lives. \n\nShe wants everything to be perfect. Her birthday is a month away but all she talks about is how things are gonna be- what kind of food, a new chandelier, home theatre system etc. \n\nSo I lost my temper and gave her a piece of my mind. I told her she has not done anything worthwhile or ground-breaking in her life to be deserving such a grand birthday. Moreover, I told her to focus on her career and not these stupid functions to merely impress a few people that don’t even care about us. \n\nAITA here?",
  "id": 1,
  "comments": [
    {
      "score": 172,
      "content": "ESH. Who has a party during a pandemic? But also that doesn’t seem like it was your biggest concern with what you said to her and more so just insulted her by basically saying she doesn’t deserve nice things.",
      "id": 2,
      "comments": [
        {
          "score": -41,
          "content": "I'd say it's more of a YTA situation. It's still months away, and having 15 healthy people that have tested negative might not be high risk. I live in a super rural area that's only had 1 case. We're legally allowed to have gatherings of up to 100 people as long as precautions are taking place. \n\nThe OP here however, is just being mean and antagonistic by insulting the sister's character and judging her for being an extrovert.",
          "id": 3,
          "comments": [
            {
              "score": 30,
              "content": "Cause I'm sure they're all going to get tested before coming to the party. Come on man.",
              "id": 4,
              "comments": [
                {
                  "score": 0,
                  "content": "They have free, next day results for testing where I live and temperature screenings at any larger events. Maybe India is different though",
                  "id": 5,
                  "comments": [
                    {
                      "score": 3,
                      "content": "\"Maybe its different\" No shit bud. Use that wrinkly salt mush in your head",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "It's 1 month not months plural",
              "id": 7,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 5,
              "content": "The sister is also wanting to do renovations. When you're spending thousands, you aren't generally doing that work yourself, especially when your concern is looking \"high class\". This isn't just one night if a party, this is a month of people coming in and out of the home to do manual labor, all for what they *hope* will need their status quo. \n\nESH because sister is being short sighted, and OP could've found a better way to say what they did.",
              "id": 8,
              "comments": [
                {
                  "score": -1,
                  "content": "I didn't realize the sister owned the house, and I didn't see anything on the post that said anything about random people coming and going for a month. It's really easy to do a thousand dollars worth or work yourself. Literally just putting in new carpet would cost about that much, and would only take 1 person to do.",
                  "id": 9,
                  "comments": [
                    {
                      "score": 3,
                      "content": "You're not wrong. The post does *not* say that random people would be coming and going. That is an assumption that I'm making based on OP's wording implying that the sister isn't the DIY type of she's so obsessed with her image. It also doesn't say that the sister would be doing the work herself. Both of us are making assumptions here. \n\nThe costs associated with renos and decorating are also highly dependent on location. Do I know how far you can get with 2k in India? Absolutely not. I do know how far you can get with that in the southern US though and to get everything picture perfect in a month would require multiple hands depending on how bad the room is to start with. If we're talking slapping on some fresh paint and getting new furniture, plenty easy. I'll give you that. But again, we don't know the extent of it.\n\nI hadn't seen anyone acknowledge that certain renovations come with new people entering the home (plumbers, delivery guys, carpenters, electricians, etc.) and those people will have likely just come from someone *else's* home, and so on. It's an unneeded risk for a birthday party in a pandemic. Partially because it is really unwise to *have* a party where you have guests that don't otherwise live with you.\n\nBut again, I also didn't say that OP was right either. Everyone involved did/is doing a dumb or mean thing. Hence, everyone sucks.\n\nQuick edit to say that to be honest and throw myself under the bus, I'm kindof bitter about parties right about now. I've missed not only my birthday, but my son's 1 year for the sake of trying to stay safe. It hurts, but it's better than potentially never getting to celebrate the next one. I live in an area where people have taken the \"it's no big deal\" stance and now we're getting overwhelmed by cases. Even though I've done my part since March, I'm still trapped because no one else wants to play by the rules.\n\nAlso adding that I didn't downvote you, nor do I totally disagree with you. There's honestly just not enough info and way too much to speculate on. This post is a giant Devil's Advocate paradise.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 64,
      "content": "ESH.  You are not wrong. What's her deal having a party during corona anyways. However, no need for your insults or for mothering her like that, you are her sister...",
      "id": 11,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 54,
      "content": "So you came here for validation? Your sister is obviously in the wrong but...\n\nESH your sister is being selfish, and endangering your family while also wasting resources. However, blowing up on her and using this opportunity to scold her and talk down on her life is not exactly a good response.",
      "id": 12,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 27,
      "content": "ESH you’re clearly extremely jealous of your sister and have your own issues to work out. She’s allowed to have friends and care about them. Probably shouldn’t be having this party though. \n\nAlso if the renovation is thousands of dollars and including things like a home theater, it sounds like the renovation isn’t just for this one party...",
      "id": 13,
      "comments": [
        {
          "score": -1,
          "content": "Where on earth did you come up with the idea that OP is jealous of their sister?? Looks more like OP understands how selfish and looks-oriented she is.",
          "id": 14,
          "comments": [
            {
              "score": 2,
              "content": "You’re seeing a one sided perspective of this story. The jealousy is in her writing",
              "id": 15,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18,
      "content": "NTA\nInvolve your parents here.  If they support this there likely isn’t much you can do except leave for the day",
      "id": 16,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 13,
      "content": "ESH\n\n&#x200B;\n\nI mean, your motive is sound but your premise is all wrong, instead of focusing on the big issue, like holding a gathering during a goddamn pandemic, you instead choose to attack her character, her achievements (or lack thereof) and giving unsolicited career advice.\n\n&#x200B;\n\nBruh...",
      "id": 17,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 8,
      "content": "go get some friends Miserable Marvin. YTA, it would’ve been a E S H because of the pandemic but the party is months away and you’re just mad because she has a social life and you have..... whatever you have I guess",
      "id": 18,
      "comments": [
        {
          "score": 3,
          "content": "1 month not several",
          "id": 19,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "It's only 1 month",
          "id": 20,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": "NTA. Something tells me your chewed her out because your parents won’t. Also party during a pandemic? Really?",
      "id": 21,
      "comments": [
        {
          "score": -15,
          "content": "Yeah I guess you’re right. She’s really un-ambitious and likes to live in the moment. She has no plans or goals about life. Just wants to party and be social\n\nFind that annoying because I’m exactly opposite",
          "id": 22,
          "comments": [
            {
              "score": 12,
              "content": "There’s definitely a balance here between not imposing your views on her but at the same time letting her know that this lifestyle isn’t sustainable in the long run. \n\nThough being from an Indian family myself, I know parents tend to invest more time and money into supporting guys’ goals than girls, so bear that in mind.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5,
      "content": "ESH. Even without the pandemic it is shallow and tacky to be so obsessed with ones own image that they resort to spending ridiculous amounts of money (they likely don’t have) on material luxuries. Factoring in the pandemic, it is incredibly selfish to put your little party over the health of your friends and family. Millions of people around the world have had to cancel weddings, parties, vacations etc for their safety and the safety of the public. She can miss one birthday party. \n\nHowever, that does not discount the fact that you swung real low to make your point. By your own description, your explanation of your dissatisfaction with her was personal, vindictive, unnecessary, and outright rude. You would easily be NTA if you just kept your wits and explained it like an adult. But nope. ESH.",
      "id": 24,
      "comments": [
        {
          "score": 1,
          "content": "You’re making assumptions. Who said she doesn’t have the money? I don’t disagree with your judgement, pandemic alone, but let people spend money on what they want.",
          "id": 25,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3,
      "content": "Yta",
      "id": 26,
      "comments": [],
      "relation": "Support"
    }
  ]
}