{
  "post content": "Hi I (36f) have a brother (34m) who is getting married to his girlfriend now fiancé. They are planning a for next summer once hopefully the pandemic is over. They are planning to have a child free wedding and while I don’t object to that (it’s their wedding they get to do whatever makes them happy) I informed them that I wouldn’t be able to attend due to my kids (8 month and 4 year old).  My brother got kind of defensive and said I couldn’t just t get a babysitter. I tried to explain that I already work a demanding job and feel like I miss out a lot on my kids life’s and it doesn’t seem fair for me to got on 3 day vacation without them. My brother then went on to say this is why he is never having children because they make you unreliable and I got kinda defensive about comment. So I ended the conversation there. I understand why my brother would want me at his wedding, we don’t have a huge family and our father passed away when I was 18 and he was 16. I get that but also have this commitment to my kids that I feel like I sometimes fail because I chose to have a more difficult job.So aita\n\nEdit:  So I think there is some confusion. I work a lot like my job is up to 45-50 hours weeks. I chose my profession, and it does make a relatively good income but in the Bay Area that just means middle class but I could get a sitter I’m just not really comfortable with that. I work the whole week because my jobs doesn’t really have a set schedule. I don’t get to spend as much time with my kids as I like and that’s on me but I can’t justify (to myself) to not prioritize them. My brother and I have an okay relationship we used to be closer but grew apart once I got married and had my own family. My extended family doesn’t see a problem with me not attending the wedding as long as I send a gift and I already planned on doing that.\n\nUpdate: so I ended up talking to my brother again on a shared video call with our mother. Mom staying out of this and staying neutral ( I get that we both kind of suck). I explained the guilt I feel and my brother said he kind of has resented and dislikes my children for a long time  and I don’t know how I exactly feel about that. I asked why and he said they just made us grow apart faster. He started talking about how after I started graduate school I changed and he felt left out. I guess it had been building up for a decade. I think I want a relationship with my brother so I hoping we talk this out more but he said some things that me put in a weird position. I’m going to try to have a walk in the park with him this week so that we can safely see each other and maybe work it out.",
  "id": 1,
  "comments": [
    {
      "score": 27,
      "content": "ESH\n\nNot a fan of your brother's reaction. But  many people work \"demanding\" jobs and still find the time to attend important family events. You also don't need to not take them and miss 3 whole days. You can take them and arrange for child care at the hotel. You will be away from them for the rehearsal dinner, which would mostly be when they are asleep, and for the wedding itself, which is what, 7 or 8 hours at most including the reception?\n\nNow, if the real issue is that you don't think you can afford the trip or afford hiring a sitter, that is a different matter. But if it is just about feeling bad that you miss a weekend with your kids, you need to examine your priorities a bit.",
      "id": 2,
      "comments": [
        {
          "score": 7,
          "content": "They don't know anyone in the city enough to have them babysit and they don't have anyone in the home town. I think it's so unreasonable to have to get a stranger to watch your kids for 3 days.",
          "id": 3,
          "comments": [
            {
              "score": 7,
              "content": "The wedding wouldn’t last 3 days, they only need a sitter for a few hours. I do understand the point about a stranger watching your kids, but I used to babysit part time and worked with a professional nationwide company and had more than a couple jobs in hotel rooms.",
              "id": 4,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 4,
              "content": "They don't need a stranger for 3 days. They need someone for the rehearsal dinner (which they could even skip most likely) and the ceremony/reception. There are many resources available to find safe, reliable sitters. If the issue isn't money, this is doable.",
              "id": 5,
              "comments": [
                {
                  "score": 1,
                  "content": "I’m not leaving my child with a stranger for any reason in the world, ever.",
                  "id": 6,
                  "comments": [
                    {
                      "score": 5,
                      "content": "Ok, do you have even one single close friend that you would ask 8 months in advance to allow you to attend one of the most important events of your siblings life?! \n\nYou’re acting like people ask hobos off the street to babysit their kids. I’ve got about 6-7 friends (and all their husbands) that I could rely on with so much notice. Do you...not have any?!",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 19,
      "content": "YTA. Weddings in the summer, you haven’t even tried to find a babysitter. Your bro is upset that you aren’t even going to make an effort to go to his wedding. And he is right.",
      "id": 8,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 12,
      "content": "YTA. I’m going to agree with your brother. So you can’t miss one weekend with your kids for his wedding? Do you regularly work 6-7 days a week, 14 hours per day? I think you can spare ONE weekend out of their entire lives for his wedding.",
      "id": 9,
      "comments": [
        {
          "score": -5,
          "content": "It’s super shitty that he wants a kid free wedding when he has nieces/nephews.  We also don’t know what her monetary situation is and missing 3 days is a LOT of money gone.  It’s his choice to have a kid-free wedding and if he doesn’t like that people with kids don’t have the time or money to waste going to it - that’s on him.",
          "id": 10,
          "comments": [
            {
              "score": 9,
              "content": "[deleted]",
              "id": 11,
              "comments": [
                {
                  "score": -1,
                  "content": "It’s shitty because they are his sister’s kids, who are part of HIS family.  He doesn’t have to let them go to the ceremony, but she doesn’t have to go if she can’t bring her children.  It doesn’t make sense to make the wedding kid-free if you know your immediate family has children.  Why should she have to drop everything for his wedding when he says shit like “this is why I’m never having kids”?",
                  "id": 12,
                  "comments": [
                    {
                      "score": 1,
                      "content": "I would never take my child to an event with 100+ drinking adults, which is what weddings usually turn into. \n\nChild-free weddings are quite common?!",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9,
      "content": "INFO   Is this a destination wedding?  Or is it local?  Can you bring the kids to the location and get a babysitter for the main event?   Three hours of babysitting might be acceptable, whereas three days wouldn't be.",
      "id": 14,
      "comments": [
        {
          "score": 12,
          "content": "That's the point I think. Seems to me that OP didn't even try to find a way to attend the wedding and that's what's upsetting her brother.",
          "id": 15,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -4,
          "content": "We live NorCal and his wedding is in SoCal. I don’t know anyone there and don’t feel comfortable finding a sitter in a city in that I’m not familiar with. I actually don’t like using babysitter a lot and have been really lucky with a husband who can work from home a lot of the time.",
          "id": 16,
          "comments": [
            {
              "score": 33,
              "content": "[deleted]",
              "id": 17,
              "comments": [
                {
                  "score": 6,
                  "content": "This OP! Why not all go as a family and then your hubby and the kids can hang out while you attend the wedding!?",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 7,
      "content": ">  My brother then went on to say this is why he is never having children because they make you unreliable \n\n\"Unrealiable\" to whom?  To cater him?   You're not being \"unrealiable\" to your kids.  \n\n>  They are planning to have a child free wedding  \n\nIf they set certain conditions on their wedding, then they have to accept that there might be consequences which is what they will have to accept.  That's the grown-up way of thinking.   Not all their guests may want to or are able to get away from their kids for 3 days or however many days.   Thems the breaks. \n\nNTA.  They're the one who put restrictions on their wedding, so they're the ones who will have to accept the consequences.   They shouldn't get angry at their guests.  Instead they should be courteous and understanding.",
      "id": 19,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NTA - People can absolutely have child free weddings, but they need to understand that if they want their wedding child free some of the guests won't be able to attend. Why should someone have to look for/ vet and pay for a baby sitter for three days to attend a wedding? It's not your fault your brother has made it inconvenient for you to attend.   \n\n\n> My brother then went on to say this is why he is never having children because they make you unreliable and I got kinda defensive about comment. \n\nUnreliable because you're looking after your children. How awful of you.   \n\n\nThree days is a long time to have someone look after your kids, you'd have to fully trust them and I imagine that it'd cost a lot. I personally wouldn't be attending either under those circumstances.",
      "id": 20,
      "comments": [
        {
          "score": 1,
          "content": "Why does she need 3 days though? Even if it’s a few hours away, that’s a day and a half, max.",
          "id": 21,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 7,
      "content": "NTA - it's totally his right to have a child free wedding but he can't expect everyone to just drop their kids to come. If I was in this situation I would say the same thing and I'm currently on maternity leave so I'm with my kids 24/7. If he can't be understanding of your situation that's on him.",
      "id": 22,
      "comments": [
        {
          "score": 5,
          "content": "This isn’t an everyday event though. It’s a wedding, and she’s got 8-9 months advance notice. It’s not like he sprung the wedding on her for next weekend. He’ll (hopefully) never have another wedding again.",
          "id": 23,
          "comments": [
            {
              "score": -2,
              "content": "Okay and? If he really wants her to come he can make an exception for her kids if not then too bad. He literally said he resents her kids. I straight up wouldn't bother with him anymore after he said that.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "He’s not expecting everyone, he’s expecting his sister. That seems like a totally reasonable expectation.",
          "id": 25,
          "comments": [
            {
              "score": -2,
              "content": "He's the one choosing to have a child-free wedding while fully knowing that his sister has young kids.",
              "id": 26,
              "comments": [
                {
                  "score": 3,
                  "content": "Which again is a very reasonable, common decision.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 1,
                      "content": "As is not attending due to having children. Glad we're in agreement!",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "ESH.\n\nhe's right you could just get a baby sitter. missing a couple days of your kids life isnt going to kill them. they're young, i doubt they will remember anything. you will have plenty of time later to be with them. your brother's wedding is a one-time event.\n\nbut he is also an ass because of his comment about having kids. just because he doesn't want kids doesn't mean he gets to judge you for it.",
      "id": 29,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 5,
      "content": "NTA, this is 3 days away from your family. He can decide to have a child free wedding. He does not get to decide how a woman with a demanding profession and 2 children spends precious time off. If it were one evening/day local to you I would agree you should get a sitter.",
      "id": 30,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA. I completely understand that brides and grooms want childfree weddings, but THEY need to understand that it would mean certain guests would not be able to attend. One of my cousins wanted an adults only wedding then got upset when only 40 people RSVP'ed and attended (out of the 150 she invited). She was one of the younger cousins and many of us were already married with kids by the time she got married. We couldn't go to her wedding because our babysitters (the grandparents) were invited and wanted to go to wedding themselves. We still got her gifts and attended her wedding shower. Children were included at the shower and she had more people at her wedding shower than actual wedding and the kids were all well behaved.",
      "id": 31,
      "comments": [],
      "relation": "Support"
    }
  ]
}