{
  "post content": "I (22f) am getting married soon. Since my fiancé and I are childfree and because we plan to have alcohol at our wedding, we decided to have a childfree wedding with the age cutoff at 21. \n\nThis requirement so far has gone over well with most of our invitees (most of our invitees don’t even have kids anyway so it doesn’t make a difference for them). \n\nI do have one friend “Mel” (20f) that I had to exclude from the wedding. After realizing that pretty much everyone else from the same social circle had been invited except her, she confronted me and demanded to know why she wasn’t invited. \n\nI tried to explain that it wasn’t personal and that I just didn’t want to have to worry about underage drinking going on under my nose on my wedding day. \n\nBut Mel kept accusing me of being a bad friend. She argued that since we had drank together before it shouldn’t be such a big deal, but I told her that it was different since we were both underage at the time (I was 20 and she was 18-19ish when we started drinking together). Now as an adult, I feel like I have a responsibility to prevent underage drinking, and as the bride, I feel like I have the right to have a childfree wedding.\n\nMel is unconvinced and keeps talking bad about me behind my back to our mutual friends and making snarky comments about me feeling superior. I don’t see why she can’t just relax and let me have my wedding day the way I like. So Reddit, aita?",
  "id": 1,
  "comments": [
    {
      "score": 53825,
      "content": "It's weird that you would consider someone that is a year younger than you \"a child\"... yet think that YOU are old enough to get married ?! So close to being a child?!\n\nYTA. You wouldn't have to worry about underage drinking : the only person with that concern would be the barman.",
      "id": 2,
      "comments": [
        {
          "score": 14535,
          "content": "YTA and at this point she should consider herself lucky to have distance from you. The fact she can say these things in front of the others tells me they all agree but won't say it to your face because you're being a bridezilla.",
          "id": 3,
          "comments": [
            {
              "score": 9320,
              "content": "Or her other friends are equally ridiculous. \"Oh my we sophisticated 21-22 year old women of the world couldn't possibly associate with a 20 year old CHILD like you.  Go play with your dolls, dear.  You'll understand one day.  Specifically June 17th, your birthday\"",
              "id": 4,
              "comments": [
                {
                  "score": 2666,
                  "content": "That's my birthday lmao. Made me do a doubletake.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2299,
                      "content": "\\*sigh\\* It really is all about you with you 20-year-old children, isn’t it? You’ll look back at this and cringe from the great vantage point of being... lessee... 150 days older.",
                      "id": 6,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 17,
                      "content": "That was my mother’s birthday, and her name was June!",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 14,
                      "content": "My birthday is june, 17 too!!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "That's my birthday too!!! Hello fellow June 17th'er :)",
                      "id": 9,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Lmao also my birthday, also did a double take 🤝",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "My birthday also made me feal weird haha!",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 5,
                      "content": "Same ! And I will be 21 year old this 17th june, I was confused for a second ...",
                      "id": 12,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2043,
                  "content": "According to my favourite philosopher Taylor Tomlinson, you also shouldn't get married that young since your frontal lobe is still developing.\n\nAnd the hypocrisy of them underage drinking together just a few months ago. her friend is lucky she gets to see what a bridezilla she is.\n\nYTA",
                  "id": 13,
                  "comments": [
                    {
                      "score": 1433,
                      "content": "Don't you love that? She feels that now, as an *adult*, she has a responsibility to prevent underage drinking. That is both condescending, and absurd.",
                      "id": 14,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 14,
                      "content": "So much this. OP, you doing something so petty raises some very serious questions about whether you’re mature enough to get married. But don’t worry, she’ll probably be old enough to attend your second wedding…",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I’m wearing a Taylor Tomlinson sweatshirt right now 🙈 she’s my favorite philosopher!",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "It's kind of truth, I got married at 23 and I was still way too young.  Made it work, but I didn't know who I was yet.",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1292,
                  "content": "Honestly. OP saying they drank underage but being self-righteous about it after turning 21 is so hypocritical and weird. Like it’s just so clear that OP wanted to exclude this one friend and will find any reason to do it.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 441,
                      "content": "That’s exactly what it seems like. OP wants to exclude “Mel” for some reason and is using “no underage drinking” as the excuse. If that’s case OP should just be honest as to why they don’t want “Mel” there.",
                      "id": 19,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 300,
                      "content": "Would bet money that Mel is competition in the looks department.",
                      "id": 20,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 87,
                      "content": "both their frontal lobes are already damaged by drinking.",
                      "id": 21,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 21,
                      "content": "I want to know what region they are in.  Because yeah, my first thought was either Mel is pretty enough OP is concerned about being upstaged, or Mel is a different skin color. \n\nIt feels like a weird southern thing, like OP is marrying into an \"image,\" which is the only way the weird bit about having a responsibility to prevent underage drinking would fit in right after op stopped being an underage drinker herself.\n\nObviously all supposition here, but it feels like the excuses you make when you want someone to not be there and you need to legitimise it\n\nAnd if it's not clear, op is YTA. And a bad friend\n\nWell bad ex friend, as I can't see Mel putting up with this unless she really gets something out of the social connection",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 19,
                      "content": "It's such a weird cut-off too. 20 is not a child!\n\nWhere I live (UK) you can legally drink at home with parental supervision from the age of 5... Does that mean 5 year olds in the UK are adults according to OP's logic? (14 with food at a restaurant, 18 to buy from a bar/ off licence).",
                      "id": 23,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "My initial response was going to be “you’re not an ass hole but you’re very weird”",
                      "id": 24,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 385,
                  "content": "Everybody knows that at 00:00 on your 18th birthday (21 in the country that sends you to war to die and kill at 18) you automatically become enlightned, sofisticated and mature. /s",
                  "id": 25,
                  "comments": [
                    {
                      "score": 161,
                      "content": "I find it hilarious that at 18 in the USA you can go to war and die for your country but god forbid you have a beer. Such a joke.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Can’t buy smokes either until 21 now. But you can sign your soul to the government. Very logical indeed",
                      "id": 27,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 384,
                  "content": "It would be one thing if she was saying that she doesn't feel comfotable with anyone underage drinking because she feels legally responsible since she is renting the venue and providing the alcohol.  My anxiety is such that I would not feel comfortable with that even if under other circumstances I wouldn't care. But I dont think calling it a \"child free\" wedding is appropriate.",
                  "id": 28,
                  "comments": [
                    {
                      "score": 385,
                      "content": "You’re being as absurd as the OP. You are not legally responsible for under age drinking just because you rented the venue. And you’re not providing the alcohol – the venue is.\n\nDo yourself a favor and don’t get married until you grow up, too.",
                      "id": 29,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 12,
                      "content": "Sure. But that's not what was said. She actually said \"as an adult I have a responsibility to prevent underage drinking.\"",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 296,
                  "content": "My best friend's birthday is July 27 and mine is July 29, so every year for like 15 years now on his birthday he writes me a long facebook post about how now that he's so much older and more mature than me he doesn't see how we can hang out anymore, but maybe things will be different when I'm his age. It feels like OP is doing the same thing, except not a joke",
                  "id": 31,
                  "comments": [
                    {
                      "score": 43,
                      "content": "My husband is a year older than me, and we have been together since I was 25. Back then, my cutoff age for dating was 30 year olds. So every year after his birthday I kiss him, and say \"Oh my God, I can't believe I just made out with a 39 year old. You are THE oldest man I ever hooked up with\", in a teenage accent.   \nThis year, he will turn 40, which used to be the age after which my friends and I would think \"Gross\" and I am preparing my speech about that already...",
                      "id": 32,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 12,
                      "content": "I have a friend 5 days older and now that we're in our (gasp) 40s, I do the opposite \"I feel that I, as a young spring chick, I cannot be friends with a doddering old woman\" you know, friendship stuff lol",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I always tell my friend who is a day younger than me that I'm older and knows better. We both find that hilarious",
                      "id": 34,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 19,
                  "content": "OP is being such a child. Imagine having a cut off one year below your actual age and calling those people children? She is so condescending and self righteous as well. It is suddenly her duty to control her friends drinking habits. OP YTA and definitely still a child yourself, regardless of your age.",
                  "id": 35,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 12,
                  "content": "Lol if I had any awards I'd give you one. You nailed it",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I don’t know how op doesn’t realize how cray cray this sounds.",
                  "id": 37,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "This 28 yo woman would like a word… You’re not grown up yet. Y’all will be acting like high school drama queens into your mid 20’s. Also why on earth is underage drinking ok before but magically not at her wedding? I get the child free part. What I don’t get is exclusion of one friend who’s 1 year younger than the cut off. \n\nThis is right up there with another AITA where twins were invited but the age cut off was 18 years so one couldn’t go because she was born 5 or so minutes past midnight.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": "I literally ordered my first drink at 15 while at a wedding. The bartender chuckled and gave me the drink with almost an eye roll…\n\nWhat is OP, a child bride?",
              "id": 39,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 9,
              "content": ">you're being a bridezilla.\n\nA child-bride-zilla.  OP isn't old enough to rent a car or run for office.  And, most importantly, she's acting like a child.  \"Now that *I'm* 22, I realize how silly and immature those 20-year-olds all are!\"\n\nSomeone who acts like she knows how life is but really doesn't and lacks the experience or maturity to tell?  Yeah, good luck to her future husband.  But I guess that's what he gets for marrying a child.\n\n(Or maybe more accurately marrying a Britta.  \"She wants everyone to be honest, but she lies to herself. She's seen the world, but doesn't get it. She has more fights about stuff that doesn't matter than a YouTube comment section.\")",
              "id": 40,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 2498,
          "content": "You are massively immature in your thinking. You didn't magically become an adult at 21. You were already legally an adult since 18, you just gained the ability to legally drink. Your friend is not a child, she's legally recognized as an adult, just as you are. She's just acting like more of one that you are right now.",
          "id": 41,
          "comments": [
            {
              "score": 523,
              "content": "My favorite is the myth that theres suddenly a switch that flips on at age 25 because that’s “when your brain stops growing” which isn’t true and is used to infantilize literal adults",
              "id": 42,
              "comments": [
                {
                  "score": 70,
                  "content": "Oh god I’ve been seeing that trotted out on Reddit (usually this sub) a lot and it drives me nuts.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Agreed, very immature on OP's part. I don't know a single person that takes it upon themselves to prevent underage drinking, and I found that comment just really weird, like society expects that of her because she's an adult now? idk. Who doesn't want their friend there and would use stupid rules as a way to prevent them from being there? An asshole would. OP, YTA",
              "id": 44,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1960,
          "content": ">I told her that it was different since we were both underage at the time (I was 20 and she was 18-19ish when we started drinking together). *Now as an adult, I feel like I have a responsibility to prevent underage drinking*\n\nI'm dying over the sharp turn this took from drinking with her at 20, to calling herself an \"adult,\" and acting morally superior. I couldn't contain my laughter with how those sentences were back to back, yet OP claims she's surprised by the former friends reaction. \n\nHypocrisy, thy name is OP.",
          "id": 45,
          "comments": [
            {
              "score": 300,
              "content": "it’s genuinely hilarious. all of a sudden 2 years later you’re magically an adult? who says that someone being so close to a “child” is mature enough to be married 😂",
              "id": 46,
              "comments": [
                {
                  "score": 17,
                  "content": "Speaking from experience, I was hardly mature when I was drinking legally at 18 (because I'm not an American with their crazy 21), and I wasn't that much better at 22 either (I remember trying to climb the utility pipes in a cupboard I broke into in a Dance club at that age....)",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "I find myself wondering how old the fiance is, and if it has anything to do with why OP is trying so hard to push the \"responsible adult\" narrative.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Someone shockingly immature and probably shouldn’t be getting married …I mean …pre divorced",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Exactly. She was already an adult at that age now she's just a slightly older adult.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 211,
              "content": "And when it was illegal for both of them it’s fine, but now it’s not because she’s an”adult” of 22 and her friend is a “child” of 20.\n\nAlso, OP doesn’t understand what “child-free wedding” means. OP, it means that people can’t bring their kids, not that the bride’s friend who is two years younger should be excluded. YTA, BTW.",
              "id": 51,
              "comments": [
                {
                  "score": 29,
                  "content": "Honestly, if you're barring even a *16* year old from your wedding on the basis that it's \"*childfree*\" you're an asshole because the thing that makes children difficult at wedding and therefore reasonable to exclude don't extend to full of teens.",
                  "id": 52,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 15,
                  "content": "Probably not even two whole years.",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 82,
              "content": "Right? I was sure she was gonna go on a legal standpoint of it, that it's different drinking in your house vs at a public event with a bar, but noooooo she went the...whatever this is...route.",
              "id": 54,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Yeah, this part made me say \"what the fuck\" out loud to my cats (who had no further insight on the matter either). Can you even *imagine* the kind of holier-than-thou attitude of someone who says shit like this? \n\nHonestly seems like the whole friend group should drop OP, because I cannot imagine the kind of BS you'd have to put up with just hanging out with her!",
              "id": 55,
              "comments": [
                {
                  "score": 7,
                  "content": "Did you make sure to explain the full context to the cats? They probably didn't read the post themselves which is why they didn't have any further insight.",
                  "id": 56,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I thought people became adults at 18. Oops.",
              "id": 57,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 13,
              "content": "I know right! So OP has told this women \" it was ok for me to drink when I was 20 but you are far too immature at 20 to even be in the same room as alcohol!\" You have to imagine someone saying this in the most stereotypical haughty voice you can imagine. \n\nAnd of course all of her mature and fancy 21-22 year old friends will be the very idea of class and no one will get black out drunk on free booze! But this young child would not be able to handle this responsibility! - big YTA",
              "id": 58,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 1230,
          "content": "I was reading this and was going to be like \"Mel is definitely the AH if she thinks she think she's an exception and can bring her kid\".\n\nYou know most people debate whether child free starts at 13, 15 or the super strict say 18, right?  Stopping a 20yo?  I'm surprised the rest of your friend group even considers going.  If I found out you did this to one of our shared friends, they're not the one I'd be leaving out, you are.",
          "id": 59,
          "comments": [
            {
              "score": 604,
              "content": "Exactly. This is not just a childfree wedding, it's a 21 and up wedding. Seems like a weird way to distance herself from her friend because she thinks of herself as an adult now, not her friend, who is 20 fucking years old.",
              "id": 60,
              "comments": [
                {
                  "score": 145,
                  "content": ">who is 20 fucking years old.\n\nWho is no more than 3 years younger than her.  Possibly less than 2.",
                  "id": 61,
                  "comments": [
                    {
                      "score": 127,
                      "content": "It's less than 2!\n\n>I was 20 and she was 18-19ish",
                      "id": 62,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 19,
                  "content": "My cousin is having a child free wedding. She put the cut off at less than 14. Mostly because she wants my 14 year old there (and participating). She said realistically the cut off is 18. No one else she knows has a teenager.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "Kinda seems like she's not actually a friend after all...",
                  "id": 64,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "Seriously. OP YTA.",
                  "id": 65,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 404,
              "content": "I was skipping over the ages because I didn't think it mattered, was fully expecting YTA because OP should at least extend an invite to Mel and let her figure out if she can make arrangements for her kid. \n\nTook me a second to understand the what's going on, this is the dumbest thing I have read on here for a long time.",
              "id": 66,
              "comments": [
                {
                  "score": 108,
                  "content": "Same thoughts EXACTLY. I was like \"damn, OP is cold for not even giving her a chance to get a babysitt-- wait... the fuck??\"\n\nAnyone in their right mind would be upset in Mel's position.",
                  "id": 67,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "It'd be one thing if it was a friend group of 40 year olds and they said they didn't want your 20 year old son because there is no barman or something. But like... wtf? A 22 year old and a 20 year old are the same thing. Same age group, same friend group and all of that. Childfree is talking about the next generation, not your own.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "Right? I kept thinking there was going to be a wham line any moment where it turns out Mel wanted to bring her 3 y/o. Nope.",
              "id": 69,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Same. I couldn't believe it when I realized she meant the 20 year old as the \"child,\" not the 20-year-old's child lol. Holy condescension. \n\nAs the guy above you said, it's not her responsibility to worry about underage drinking anyways, but even it was, who really gives a shit? Let the 20 year old drink, holy hell. Almost every wedding I've been to has adults giving their 16-20 year old kids drinks, or the kids just ordering them themselves. It's a wedding. . . \n\nThe way she phrased the intro, \"we plan to have alcohol\" was super weird too. I'd hope so.",
              "id": 70,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "The weddings I went to that have been child free, still included anyone 12 plus or even 10 plus sometimes. They were really trying to keep the babies and toddlers out of the wedding because of how loud they could get/ how loud the wedding was. I've never heard of anyone calling a 20 year old a child before and I honestly think it is kind of hilarious, OP sounds unhinged. I'd never go to this wedding, what she is doing is wrong.",
              "id": 71,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "It’s just a matter of time. They’re still young. I tolerated a lot of shit from “friends” when I was younger that I wouldn’t now.",
              "id": 72,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "This! I consider child free for a wedding 13 and younger honestly. I am shocked this person is calling her 20 year old friend a child! OP is going to be embarrassed about this when she’s a “grown up” lol",
              "id": 73,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Honestly, anyone who thinks 'childfree' means they can exclude people under 18 are **insane.** That would be a \"Minor free\" wedding.\n\nA 16 year old isn't *a child*. They are *a minor.* Childfree weddings and events are reasonable because children require accommodation and change the vibe of an event. A 16 year old doesn't. A given 16 year old might *be disruptive*, but so can your 44 year old aunt Mary - that's just personal.",
              "id": 74,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 388,
          "content": "When she said now that she’s an adult I wanted to die laughing. Ah, the arrogance of youth.",
          "id": 75,
          "comments": [
            {
              "score": 6,
              "content": "Ikr. In my twenties I thought I knew everything. I actually knew fuck all. I was still a kid. Sorry (not sorry) OP. In my thirties, I thought I knew everything\nTurns out, I knew fuck all. Now I'm in my forties, I've finally realised...... I know everything.",
              "id": 76,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 300,
          "content": "The couple have a right to invite whomever they want to the wedding.  Mel isn’t entitled to an invite. \n\nBut man this is an YTA for sure because Mel is the only one in a friend group not invited because she is a “child” by their arbitrary chosen date. And misses the cut off by less than 12 months.",
          "id": 77,
          "comments": [
            {
              "score": 79,
              "content": "[removed]",
              "id": 78,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 87,
          "content": "I was ready to be on her side for the first half but damn, talk about getting too big for your britches. Is this a moral dilemma? Or you afraid of legal repercussions? If it’s one single 20 year old drinking no one’s going to notice, if it’s concern the barely legal underage person wont handle their liquor it would be fair to ask her to keep her wits to avoid a spectacle. But I feel like this is one of the times you should give an exception to this rule. Or expect her to not be a close friend anymore.",
          "id": 79,
          "comments": [
            {
              "score": 10,
              "content": ">Is this a moral dilemma? Or you afraid of legal repercussions? \n\nNeither. She doesn't like Mel. She found a way to exclude her that might fly with her friends. It isn't flying.",
              "id": 80,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 60,
          "content": "Just a guess… OP doesn’t really like Mel and was looking for an excuse so she made the cut-off 21 instead of 18…",
          "id": 81,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 17,
          "content": "Please rewind and remember the kinda wedding you’d have had at 22. There is no barman. I believe there is a cooler of Jungle Juice",
          "id": 82,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 16,
          "content": "This!! 100% \n\nI have been to a child free wedding, the bride/groom were 42 and 45 though, not one year older than the \"children\". Lmao.",
          "id": 83,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10275,
      "content": "I can't decide if you're an AH for the wedding itself because you're certainly within your rights to have only people of legal drinking age at your wedding, but YTA for referring to this as a \"childfree\" wedding. Your 20-year-old friend is not a child. Also, the whole \"now that I'm a whole 22 years old I feel a responsibility to stop 20-year-olds from drinking\" thing is coming off very condescending. \n\nIf you were having a childfree wedding, Mel would be invited. You're not doing that, and as a result you're excluding exactly one person from your friend group because you apparently don't even trust her enough to say \"Please don't drink at my wedding because I don't want to deal with any liabilities around underage drinking.\"",
      "id": 84,
      "comments": [
        {
          "score": 6475,
          "content": "I'm betting Mel is an attractive person that op is worried might take some of her shine. Whatever the reasoning, op YTA.",
          "id": 85,
          "comments": [
            {
              "score": 882,
              "content": "THIS! You’ve solved the mystery .",
              "id": 86,
              "comments": [
                {
                  "score": 206,
                  "content": "> most of our invitees don’t even have kids anyway\n\nYuuuuup",
                  "id": 87,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 101,
                  "content": "I bet it took OP a while to figure out a rule that would only exclude the one person",
                  "id": 88,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 654,
              "content": "This was my immediate thought too.   \n   \nWhen I think of someone having a childfree wedding, I assume they just don't want to deal with literal kids running around and extra guests. OP is jelly of Mel.",
              "id": 89,
              "comments": [
                {
                  "score": 458,
                  "content": "I always took child free to be more like under 13 not 18 or 21.",
                  "id": 90,
                  "comments": [
                    {
                      "score": 350,
                      "content": "[removed]",
                      "id": 91,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 32,
                      "content": "Yeah I’m having a child free wedding and all the “children” in my case are like…7 and under",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 439,
          "content": "It’s like OP is Smoky the Bear of alcohol but if Smoky had previously been starting forest fires",
          "id": 93,
          "comments": [
            {
              "score": 154,
              "content": "yes, he has a suspicious knowledge of how forest fires are prevented",
              "id": 94,
              "comments": [
                {
                  "score": 28,
                  "content": "And he's always shifting the blame, \"only you can prevent forest fires\" why can't Smoky help? Because he started the dang fire.",
                  "id": 95,
                  "comments": [
                    {
                      "score": 9,
                      "content": "All three of these Smokey the Bear comments are making me giggle so much.\n\nAnd OP, YTA. For every reason everyone has said.",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 12,
              "content": "Best analogy ive read all day",
              "id": 97,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "OMG! I cackled!💀",
              "id": 98,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "Yeah, this won’t be a child-free wedding because the bride sounds like a bratty immature child herself",
          "id": 99,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 9629,
      "content": "[deleted]",
      "id": 100,
      "comments": [
        {
          "score": 7974,
          "content": "\"now that it doesn't apply to me, I don't want anyone to underage drink\" is a hell of a take, though!",
          "id": 101,
          "comments": [
            {
              "score": 2985,
              "content": "A little hypocritical if you ask. “I could drink being underage and ENCOURAGE A 18yo to drink too but now I’m the big girl and I think it’s really inappropriate to do”.",
              "id": 102,
              "comments": [
                {
                  "score": 1062,
                  "content": "I could understand if the hypocrisy came from a good place.\n\n\"I was underage drinking and understood the harms it brought me. So now I do not condone it.\"\n\nLike if an ex-addict (or current addict) told you not to do drugs because he knows how life threatening it can be. \n\nBut this isnt the case. It clears she allows underage drinking...unless its her wedding! And dont even think about warning the bartender not to serve minors, just the fact her friend will be nearby alcohol...too dreadful to think about.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 496,
                      "content": "I agree! She is now superior because she can legally drink while Mel is still a little child. She even wrote the a misleading tittle, because it’s not about a childfree wedding. She can’t call a 20yo a child. \n\nHow would it make her look if other guests knew she did “provide” alcohol to a barely legal adult back then? \n\nOP just your an AH who doesn’t care about said friendship without excuses. You can invite her but warn her she won’t be able to drink alcohol, but you don’t want her there.",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": "She could even ask the friend to not drink at the wedding, but I would be surprised if she doesn’t regularly drink with the friend group.\n\nIt’s almost like op is using this as an excuse to prevent her from attending.",
                      "id": 105,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 7,
                      "content": "Wanna bet she gets absolutely shit faced at her own wedding?",
                      "id": 106,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 19,
              "content": "Next issue to tackle:  now that I’m married I need to do what I can to prevent premarital sex!",
              "id": 107,
              "comments": [
                {
                  "score": 7,
                  "content": "Please, don’t give her any ideas.",
                  "id": 108,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1017,
          "content": "Yes! \n\nCalling the wedding “childfree” when you’re excluding adults is so much more insulting too. I already think people use “childfree” too much when they just mean that they’re applying an age cut off, but it’s just condescending to apply an age cut off for adults and then sell that as “childfree.” It’s literally treating adults as children.\n\nIt’s fine if OP is worried about liability for underage drinking and wants to cut off guests rather than have the bartender worry about carding. But that doesn’t even seem to be her concern! She’s just being condescending about being older and playing dress up at being mature by excluding her one under 21 age friend.",
          "id": 109,
          "comments": [
            {
              "score": 563,
              "content": "I dislike that childfree gets extended to 18. Are people really worried that 16 and 17 year olds are going to disrupt the wedding? If anything, your 60 year old drunk uncle will disrupt things. Teenagers are old enough to care about people's weddings",
              "id": 110,
              "comments": [
                {
                  "score": 199,
                  "content": "Oh my 65 year old uncle would absolutely disrupt things way before any of my kid cousins. For SURE.",
                  "id": 111,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Yup, my 60 year old uncle screwed up my brothers wedding by bringing mj laced brownies! One brother in law passed out on the bathroom floor. Nobody danced because they were so stoned, my dad was the worst! From my perspective it was pretty funny, but the bride, my very wonderful sil was mortified.\n\nGood thing it was over 30 years ago!",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "The most disruptive guest at our wedding was over 70. My parents had to take him home before the speeches because he was that drunk.",
                      "id": 113,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 25,
                  "content": "Exactly.   I'm very adamantly childfree, but I'd set the cutoff point much lower.  If they're old enough to not shriek or have a tantrum, they're fine.",
                  "id": 114,
                  "comments": [
                    {
                      "score": 29,
                      "content": "Hell if not having a tantrum is the cut off then I’ve come across many 40+ year olds who wouldn’t qualify as adults haha",
                      "id": 115,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "for real. i was a junior bridesmaid at my cousin's wedding when i was almost 13 and i knew how to behave myself. i have nothing against child free weddings but teenagers deserve a little more credit.",
                  "id": 116,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I got excluded from my first cousin's wedding because I was 14 (almost 15) and my sister was 16. There were a bunch of second cousins that were 5 and under so they did a blanket under 18 ban. It was a bit insulting to group us teenagers together with toddlers. My sister and I were always the young kids at adult events because we're the youngest in our generation, which meant we've known how to behave since we were about 4 so it's not like we'd given them a reason to think we'd be disruptive",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 388,
              "content": "Imma have a child free wedding and no one under 35 allowed. If you can’t legally run for president, you cannot attend! /s",
              "id": 118,
              "comments": [
                {
                  "score": 141,
                  "content": "I turned 35 last year and this is the standard Im applying to all future events. A real sense of responsibility has come to me in the last year,  I really cannot be responsible for partying among any of those ungodly 34 year olds.",
                  "id": 119,
                  "comments": [
                    {
                      "score": 68,
                      "content": "I'm a 34 year old with a 4 month old. Just another case of babies having babies.",
                      "id": 120,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 161,
              "content": "And it's not like the bartender is going to skip carding people just because the bride says everyone is over 21...",
              "id": 121,
              "comments": [
                {
                  "score": 75,
                  "content": "I’ve never been carded at a wedding, or any private event in general. Either way her friends are literally adults, at that point they can make their own decisions.",
                  "id": 122,
                  "comments": [
                    {
                      "score": 6,
                      "content": "I was carded, as well as all other guests, at my little sister's wedding.  I also hooked up the legally adults but not treated as such under 21s to a small amount of alcohol for toasts, speeches, and the like.",
                      "id": 123,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 12,
                  "content": "I got skipped for champagne at a wedding once because the waitstaff (rightly) clocked me at under 21… two seats after they gave a glass to my sister, who is 2.5 years younger than me. I’d been used to it for years by then but I genuinely do wonder where it is that they’re carding people lol",
                  "id": 124,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "OP's title should've been \"AITA for excluding my 20 year old friend from my wedding, despite everyone else in our circle being invited?\" \n\nI legit thought maybe a friend of hers had a kid and wanted to bring the kid along or something, but no....her friend of several years is being excluded for the dumbest reason???\n\nYTA",
              "id": 125,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 7,
              "content": "She was fine with underage drinking when she was underage, but now she has a superiority complex.",
              "id": 126,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Is the bride even liable for underage drinking? Tons of all ages weddings have alcohol served. The liability is on the person serving the alcohol, I thought.",
              "id": 127,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 270,
          "content": "Maybe its because I'm not American but I've always thought a 21 y/o drinking age was ridiculous. A childfree wedding is okay but people who are 18, 19 and 20 are not children. \n\nAs somebody who is planning a childfree wedding myself my fiancee and I would consider guests as young as 16, and we're in our 30s. It seems weird excluding an adult friend who is only two years younger than you. YTA.",
          "id": 128,
          "comments": [
            {
              "score": 120,
              "content": "We had a 12 y/o cut off. Teenagers aren't crying and running around. They're bored on their phones.",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 41,
              "content": "I’m American, and I don’t get the 21 year old thing.",
              "id": 130,
              "comments": [
                {
                  "score": 17,
                  "content": "It is your freedom not to drink until you are 21",
                  "id": 131,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 24,
              "content": "My cousin’s wedding was last year and it was technically childfree, although I was 17 at the time and my other cousin was 19 (so not adults who can drink in the US) and we were still invited. When it was time to do the toast we told the waiter we were underage and he gave us sparkling cider instead of champagne, and then their open bar had nonalcoholic drinks as well (I got quite a few Shirley Temples that night). Childfree does not equal under 21. OP YTA",
              "id": 132,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "The US has a huge drunk driving problem because it is so car centric.   A significant portion of the these accidents and deaths were caused by those under the age of 21.  \n\nRather than deal with the drunk driving issue, they just upped the age limit for alcohol to 21, and it did decrease drunken driving among that age group.  \n\nWe still have a huge drunk driving issue with the rest of the adult population, though the culture has been slowly changing over the last 15ish years.",
              "id": 133,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Yeah every wedding I've been to (not in the US) there's wine out on all the tables and anybody can drink whatever they like. It's up to parents if their children drink wine.",
              "id": 134,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 111,
          "content": "Also makes me wonder when the OP is having the wedding and if the friend will be 21 by the time she has it.",
          "id": 135,
          "comments": [
            {
              "score": 26,
              "content": "Doesn't sound like it. Oh well, maybe Mel will be of age and still friends with OP by the time the divorce party arrives",
              "id": 136,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 19,
          "content": "I doubt the term “friend” still applies from Mel’s side anymore, so I guess it’s a moot point.",
          "id": 137,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 11,
          "content": "Exactly, and even if that was the case she should have spoken to the friend to let her know rather than the friend finding out she wasn't invited from others.",
          "id": 138,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Perfectly phrased. There’s nothing wrong with having a child-free wedding if that’s the bride and groom’s preference. But excluding one person from a friend group who’s a few months younger than the others in the group and using the child-free wedding thing as an excuse is totally an AH move.",
          "id": 139,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "If I were one of their mutual friends I wouldn’t attend to the party and do something with Mel, it’s not like OP values friendships anyway. She can be an AH on her own.",
          "id": 140,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 7,
          "content": "My cousin married a wealthy woman. They’re truly in love but her parents are self made immigrants and they wanted to their kid to the fairytale wedding she wanted. The wedding was huge and open bar. I had just turned 17 that day, the wedding was on my birthday lol everyone was passing me drinks casually. The father of the bride was like “the staff is getting paid either way, they aren’t watching and they don’t care” so like when in Rome I guess?",
          "id": 141,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 6,
          "content": "Childfree kinda doesnt seem ok when you're talking about 20 year-olds. Childfree means no people under 16 or 14 or smth like that, who considers a 20 year-old a child?",
          "id": 142,
          "comments": [
            {
              "score": 7,
              "content": "Condescending 22 year olds.",
              "id": 143,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 6926,
      "content": "YTA\n\n> Now as an adult, I feel like I have a responsibility to prevent underage drinking,\n\nOh come on! You're barely older than her.\n\n\nIf you don't want to invite her that's your decision but going around calling her a child and being a snob about underage drinking makes you an asshole.",
      "id": 144,
      "comments": [
        {
          "score": 2457,
          "content": "“Now as an adult, I will act like a high school mean girl”",
          "id": 145,
          "comments": [
            {
              "score": 402,
              "content": "Precisely. Just proving she is not yet actually an adult.",
              "id": 146,
              "comments": [
                {
                  "score": 158,
                  "content": "I'm so baffled that she keeps going on about how she's an adult and it's a 'childfree' wedding and she's excluding 'children'. Last time I checked, people who are 20 are adults. Just because she can't legally drink doesn't make her not an adult. Going on about the childfree thing is just so condescending and also wrong. What the hell. Who excludes their 20 y/o friend on account of them being a 'child'? If op can't even handle the responsibility of keeping one person sober they are NOT ready for the responsibility of getting married.",
                  "id": 147,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Not to mention how pretentious op must sound telling someone who's about a year younger than her, and who was a previous drinking partner, that she's a child and that op has developed some new morals on her last birthday. Op sounds like she lording her age over someone who is apparently like 8 months younger than her in the most eye-rollingly condescending way possible to prove what a grown up she is. It's the trifecta of immature, rude and petty.",
                      "id": 148,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "Exactly like I hope the poor fiancé(e) knows what they’re getting into here because op does not sound mature enough for this",
                      "id": 149,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 766,
          "content": "I came into this thread absolutely sure that I'd vote n-t-a because I'm also a childfree person planning a childfree wedding and to me \"your wedding, your rules\". But this holier-than-thou line is what did it for me. They used to underage drink together,  but now that she's \"aN aDuLt\" she has the responsibility to \"prevent underage drinking\"?? LOLOLOL  She's all of two years older than her friend but she thinks she's suddenly a responsible, all-knowing adult.  \n\n\nOP, YTA and a pretty insufferable one at that.",
          "id": 150,
          "comments": [
            {
              "score": 311,
              "content": "It’s like the adult version of the 13 y/o that won’t hang out with 10-12 year olds because “you’re a baby and I’m a teenager!” Except it’s the same stupid mentality.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 12,
              "content": "> They used to underage drink together, but now that she's \"aN aDuLt\" she has the responsibility to \"prevent underage drinking\"??\n\nHonestly, if she were unclear on the law and approached this from the perspective of \"I don't want to assume legal risk for allowing somebody underage to drink alcohol I paid for and provided,\" I could forgive that, even if the context makes it a bit absurd. But the way the OP chose to phrase it, you'd think she plans to around calling the cops on any college party she catches wind of, because that's just being a responsible adult.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "You seem reasonable. What age are you thinking for child free? In my head I would think like a 14 year old cousin would be fine. Just curious.",
              "id": 153,
              "comments": [
                {
                  "score": 9,
                  "content": "Typically it's somewhere between 7-13, depending on the setting of the wedding",
                  "id": 154,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 8,
              "content": ">I came into this thread absolutely sure that I'd vote n-t-a because I'm also a childfree person planning a childfree wedding\n\nI did the same thing.  but then I continued to read.  lord...",
              "id": 155,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "She thinks she is a “big girl”because she is getting married!",
          "id": 156,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "And can we talk about this part:\n\n\"After realising that pretty much everyone from the same social circle had been invited except her, she confronted me\"\n\nSo OP didn't even have the decency to pull her friend aside and say she wouldn't be invited due to a drinking age limit.\n\nYTA for this and for referirte this as a childfree wedding. As an actual adult who is childfree I find it extremely insulting.",
          "id": 157,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "They’re probably like 7mo apart or something lololol",
          "id": 158,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 6388,
      "content": "YTA. You’re 22 and you made the cutoff 21? That is not “childfree.”  Your wedding is Mel-free.",
      "id": 159,
      "comments": [
        {
          "score": 1387,
          "content": "Exactly.  She could just give a photo of Mel to the bartenders and say “don’t serve her” if she’s really worried.",
          "id": 160,
          "comments": [
            {
              "score": 701,
              "content": "I mean if OP is *that* concerned about liability I don’t know why they’re even serving alcohol. Underage drinking isn’t the worst that can happen. What if someone is over served and gets alcohol poisoning and dies? Op could be held liable.",
              "id": 161,
              "comments": [
                {
                  "score": 123,
                  "content": "If they're having the wedding at some sort of fixed venue, probably not. In that case, the venue would be the one with the liability. If it's some sort of ad-hoc event, then host responsibility laws might come into effect.",
                  "id": 162,
                  "comments": [
                    {
                      "score": 8,
                      "content": "Apparently it really can vary and there may be actions that can transfer liability.  However, you can buy event insurance to protect yourself.  Some venues require you to get event insurance but many don’t.\n\n(I read a post on Reddit where a family member fell due to their own actions and wasn’t hurt after the fall but later claimed to be.  She sued the bride and the venue…there was a claim that she slipped on something -can’t recall, maybe rice?- which the venue said the bride didn’t have permission to use - even though she actually was given permission and it wasn’t why she had slipped anyway - it cost the bride a lot in legal fees and was really ugly)",
                      "id": 163,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 8,
                  "content": "Have any of you people ever been to a wedding? I swear to god. I don't think I've been to a wedding where someone isn't over served.",
                  "id": 164,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "Honestly I feel like that would also be an AH move.  20 year olds drink all the time.  It's legal pretty much everywhere outside the US.  OP drank at 20.  It is highly unlikely OP would personally liable for Mel drinking at her wedding, and everyone else is going to be drinking so it would be a bit isolating for Mel to be the only one excluded from it.  If the venue IDs her and doesn't serve her, sure that's fine, but I think it would be a bit targeted for OP to specifically request the bartenders not serve Mel when all the other guests are literally one year older than her.",
              "id": 165,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "Yup.  Can smoke, vote, marry, get a job serving alcohol, obtain a mortgage, and defend her country but is just too darn young to attend a wedding where people will be drinking.\n\nMethinks the poster who guessed that Mel is attractive is probably on to something here.\n\n&#x200B;\n\nOP, YTA ...obviously.",
          "id": 166,
          "comments": [
            {
              "score": 8,
              "content": "Can't smoke in the US anymore at 20. The age now is 21.\n\n\n\nOp is YTA though.",
              "id": 167,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "I’m wondering if there’s some other reason she doesn’t want to invite Mel and is just using the drinking age thing as an excuse.",
          "id": 168,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2599,
      "content": "YTA\n\nYou can have a childfree wedding, but 20 is not a child and the bartenders at your wedding will be carding all of your young guests, so the underage drinking thing is bs also.\n\nYou can do WHATEVER you want with your wedding, but YTA for being a liar in this situation.",
      "id": 169,
      "comments": [
        {
          "score": 577,
          "content": "OP has no idea how to use the term childfree",
          "id": 170,
          "comments": [
            {
              "score": 369,
              "content": "Well if it was actually childfree, OP wouldn't be able to attend her own wedding.",
              "id": 171,
              "comments": [
                {
                  "score": 7,
                  "content": "Lol",
                  "id": 172,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "Lol the bartenders won’t be carding shit",
          "id": 173,
          "comments": [
            {
              "score": 11,
              "content": "Thank you. And it'll be fine. I feel like this sub is showing a massive indication that everyone here is under 25 and has never attended a wedding before.\n\nPeople under 21 drink all the times at weddings. Parents get their kids beers. 20 year olds walk up and just order drinks. \n\nAlso, people get hammered at weddings. Bartenders aren't cutting people off unless you're falling over, and people 18-20 are going to be able to drink with likely little difficult.",
              "id": 174,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "bartenders don’t even card at weddings they don’t care (speaking from personal experience)",
          "id": 175,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2169,
      "content": "YTA\n\nChild free weddings are fine, but:\n\nA 20 year old isn’t a child. Mel seems to be correct. That’s a pretty shitty thing to do to one of your “friends”. That’s pretty high horse you seem to have propped yourself up on, especially since you both used to drink together whilst underage.",
      "id": 176,
      "comments": [
        {
          "score": 358,
          "content": "She’s a complete hypocrite…",
          "id": 177,
          "comments": [
            {
              "score": 98,
              "content": "No no you’re getting this wrong! She’s an adult now! She’s being responsible! /s",
              "id": 178,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 11,
              "content": "What kills me is the fact that in other countries the legal drinking age is 18, not saying that no one should follow the law because of that, but giving perspective about how dumb shes acting over her friend being 20.",
              "id": 179,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 41,
          "content": "I think this is the first child free wedding post that matches the idiocy of the one where the bride had her wedding on her twin nieces' 18th birthday, except one twin was born after midnight so she wasn't allowed to come.",
          "id": 180,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 9,
          "content": "The way she said that most her friends don't have kids so they don't care, then go on you talk about excluding an adult friend from her circle is a wild \"had us in the first half\" turnaround",
          "id": 181,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2039,
      "content": "YTA, and I don't think you're old enough to be getting married if the drinking age is more important than your friends.",
      "id": 182,
      "comments": [
        {
          "score": 675,
          "content": "[deleted]",
          "id": 183,
          "comments": [
            {
              "score": 463,
              "content": "I think that’s quite generous. I highly doubt this is the only wedding detail she’s being obtuse about, they probably won’t even make it down the aisle. She’ll probably also be the type to alienate everyone who isn’t married because “they just don’t understand being grown up” then whine about having no friends.",
              "id": 184,
              "comments": [
                {
                  "score": 86,
                  "content": "Well, married people can *only* hang out with other married people. Single people just don’t understand married life.",
                  "id": 185,
                  "comments": [
                    {
                      "score": 25,
                      "content": "We fuse when we get married. Single people can’t fuse.",
                      "id": 186,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 206,
              "content": "She'll NEVER make it to 30.  And if this is how she treats a friend, believe me, it's not an isolated incident",
              "id": 187,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 110,
              "content": "25. Money on it.",
              "id": 188,
              "comments": [
                {
                  "score": 10,
                  "content": "sounds about right.\n\nwhen i was working in military, the person training me to replace him as Electrical Officer on the carrier invited me and my partner to visit him and his wife.\n\ni overheard this guy talking to others about his wife and it really sounded like he hated her... but i figured that was probably guy talk cos hey, why invite me if his family life was awful.\n\nso we get there, their one year old is in the high chair.  they look at each other with daggers, and their words are laced with poison.  my then partner, who was usually... not very observant about humans... looked visibly uncomfortable.  (i didn't warn them ahead of time as i hadn't taken seriously that the other couple had a toxic relationship).\n\nanyway, at the very first opportunity to leave, we left.  in the car they told me \"wow.  i've never seen a couple that hated each other so much.\"  the rest of the drive, both in shock, we were silent.\n\nThe officer's marriage didn't last to the child's second birthday.\n\nso yeah, given that this woman and that couple are probably equally toxic, 3 years sounds about right ;)\n\n(although i have a hard time believing that OP isn't trolling)",
                  "id": 189,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 13,
              "content": "I’m kind of hoping Mel ends up being her husband’s second wife.",
              "id": 190,
              "comments": [
                {
                  "score": 10,
                  "content": "Would be a better reason as to why she’s keeping Mel from attending the wedding. Doesn’t want a *speak now!* moment",
                  "id": 191,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 12,
              "content": "At 30? Lol i give her 1 year!",
              "id": 192,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "You give it that long?",
              "id": 193,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 9,
              "content": "Drunken Steve Buscemi:\n\n“They’ll be divorced in a year!”",
              "id": 194,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 261,
          "content": "22 is quite young to get married anyways. OP definitely is showing a lot of red flags of immaturity.",
          "id": 195,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 108,
          "content": "Forreal. Getting married at 22 is not the flex she thinks it is.",
          "id": 196,
          "comments": [
            {
              "score": 22,
              "content": "I was such a hot mess at 22. They let me teach children, what a joke. And they went home at 4. Married? Get out of here— I was a damn overgrown teenager with a salary",
              "id": 197,
              "comments": [
                {
                  "score": 26,
                  "content": "My oldest sister got married at 22 and divorced at 24. Bad life choices.",
                  "id": 198,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1247,
      "content": "What’s next, are you gonna ban her from going to Applebees with you and the squad because she isn’t old enough to drink? YTA, and this posturing as a mature adult isn’t going to make you an actual mature adult.",
      "id": 199,
      "comments": [
        {
          "score": 242,
          "content": "That is great wording. She really does seem to be playing adult.",
          "id": 200,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 197,
          "content": "Let's be real: OP getting married at 22 is her posturing as an adult. \n\nI know it can work, but OP is clearly not mature enough.",
          "id": 201,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 22,
          "content": "This exactly.  OP's \"I'm a big girl now\" attitude is actually showing the exact opposite of maturity.   Reminds me of junior high when 8th graders would act all snotty and be like \"we're 8th graders, we don't hang out with 7th graders\".",
          "id": 202,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1026,
      "content": "YTA and this is why 22 year-olds are too immature to get married lol.",
      "id": 203,
      "comments": [
        {
          "score": 368,
          "content": "Seriously, it’s hilarious how “mature” OP thinks she’s being",
          "id": 204,
          "comments": [
            {
              "score": 9,
              "content": "Well, now that she is legally an adult, she has to be mature, right?",
              "id": 205,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 235,
          "content": "The fact that she's judging a girl who's less than 2 years younger than her, is fucking hilarious.",
          "id": 206,
          "comments": [
            {
              "score": 132,
              "content": "Especially since they used to drink together (confirmed underaged but likely once she was 21 as well).",
              "id": 207,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "That's not even a different but overlapping set of cartoons like me and my four-year-younger sister lol.",
              "id": 208,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 12,
          "content": "As a 22 year old- I agree lmao. I’d also never ditch a friend who was 20 just bc they couldn’t drink",
          "id": 209,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "Ikr? The irony",
          "id": 210,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}