{
  "post content": "My 9yo son needed hip bone osteoma surgery and his mom and I scheduled it before his three week winter break. My ex and I share 50/50 but I get him on winter breaks so she could take him our of state to see her family in the summer.\n\nThe day before the surgery she asked me if Ry could stay at her place to recover from the surgery. I asked her why and all she said was that she just wanted to be there. I said no. Ry has never had surgery and it's a big deal for him. I don't want him to think that the first thing you when you face something scary is run to your mom and not your dad.\n\nI told her I was quite insulted by her request. Plus he was going to need help getting dressed, undressed and bathed for the first couple of days and I highly doubt that he'd be comfortable having his mom do that. She said her husband could do that.\n\nI told her no. He's having the surgery and I'm taking him to my house when he's released. I don't care if she's in the operating room. \n\nShe then asked if she could see him at my place and I said no. The agreement is that we have scheduled FaceTime with him when he's at the other parent's house. I don't want my ex wife in my home anymore than she wants me in hers. If the shoe was on the other foot then I'd understand whether I liked it or not. \n\nI held firm and things have been tense between us ever since. Personally I don't care because I'm not apologizing for not giving her what she wanted.\n\nEdit: No, my son doesn't get to decide who he gets to stay with and when and for how long. That's why there are custody agreements.",
  "id": 1,
  "comments": [
    {
      "score": 46761,
      "content": "YTA she's concerned about her son and you turned it into a power play",
      "id": 2,
      "comments": [
        {
          "score": 23966,
          "content": "Especially the part about not letting mom even visit.  How cold-hearted can a father be?  OP, for your son, THIS IS NOT TUESDAY.  It is fine for your son to stay with you, but to not let mom see him?  I thought I had seen everything by now, but OP has plumbed new lows.  YTA.",
          "id": 3,
          "comments": [
            {
              "score": 12134,
              "content": "When my stepsons just have colds, we always let their mom visit and drop off care packages and pamper them. This is just so sad. Poor baby is getting surgery and his dad can’t get over himself long enough to let him be comforted by both of his parents.\n\nWe also let our kids decide where they would be most comfortable. If they didn’t feel good and wanted mommy, they got mommy. \n\nYTA.",
              "id": 4,
              "comments": [
                {
                  "score": 5280,
                  "content": "Yes. But you’re not a vindictive jerk like this guy.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 4666,
                      "content": "YTA, what we are seeing right now is why, when something scary happens, you run to empathetic mummy instead of selfish dad.\n\nEnjoy making these decisions for him while you can, it’s a short period of time in the scheme of things, and then you lose all that power & respect in the long run if you abuse it.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1697,
                      "content": "The tone in his post comes off as angry, controlling and spiteful.",
                      "id": 7,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 15,
                      "content": "This is exactly how my son's father operates. YTA for not letting his MOTHER even see him during his recovery. Shame on you!",
                      "id": 8,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 627,
                  "content": "OP - THIS is a good parent. This is how co-parenting works. No unnecessary pressure or pain on the kids - and notice how there is no mention of animosity between any of the parents, even if they don’t actually get along. And the example is a cold!! Not surgery!!",
                  "id": 9,
                  "comments": [
                    {
                      "score": 291,
                      "content": "It's tough to put feelings aside for your kids, but as a parent it's your duty. My son's mom was HIGHLY abusive, violent, and not loyal at all (I've literally been diagnosed with PTSD due to domestic violence and other abuse). I have to put our kiddo's best interests ahead of my feelings on the subject all the time.",
                      "id": 10,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 228,
                      "content": "I can’t believe the poor stress this boy must be under, knowing he is going to have surgery and it’s a point of tension for his parents. \n\nAnd to be so cruel as to not suck it up, of course his mum wants to be around him after he has had surgery! I’d be very concerned if the mum just handed him over without a second thought. \n\nJust awful.",
                      "id": 11,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 456,
                  "content": "Exactly! OP son is only 9, kids that age still need mom when they don’t feel well or other times too. My oldest is 16 and he still needs me when he isn’t feeling well or is having a rough day.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 684,
                      "content": "Am I the only one finding the \"uncomfortable\" part with changing clothes weird at nine years old ? \n\nLike, I would rather have my mother, who fucking got me out of her womb after I stayed there rent free for nine months, help me to change than a supposed step father or any other man that is not my father ? I don't know, I could see it being akward once you're adolescent, but 9 years old ? Is it an american puritanism thing ?",
                      "id": 13,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 245,
                      "content": "I'm 41 and getting a much less scary surgery soon. I'm thrilled that my mom's coming out to take care of me!",
                      "id": 14,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 196,
                      "content": "I’m 38 and still want my mom. I’m having colon surgery and damn straight my parents will come check on me. \n\nAlso YTA OP this isn’t about you it’s about your kid having TWO or more (because step counts) loving parents that care about him.",
                      "id": 15,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 271,
                  "content": "Yes. NTA for keeping him at his house per the custody agreement.\n\nTotally YTA for not letting his mom come over after a surgery. Grow up and be a better coparent. Think about what your child needs.",
                  "id": 16,
                  "comments": [
                    {
                      "score": 87,
                      "content": "ah, but you may not have noticed this gem\n\n\nI don't want him to think that the first thing you when you face something scary is run to your mom and not your dad.\n\n\nhe doesn't care what his son wants lol\n\nhe just wants to feel like a \"big man\"",
                      "id": 17,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 253,
                  "content": "I can't get over that comment about not teaching his son to run to mom every time. He's 9 and just had major surgery. That's literally what mom's are for. I think the term toxic masculinity is overused but it's perfect in a situation like this. \n\nMy stepdaughter likes to invite her mom in to see this thing or that she's done to her room or whatever. Her mom and I haven't always gotten along (she used to bully me, mean girl  style), although we do now, and I don't particularly like her coming into my home, but it makes my SD happy so I shut my mouth. I can't imagine denying them access to each other.",
                  "id": 18,
                  "comments": [
                    {
                      "score": 79,
                      "content": "Oh man. I can’t tell you how many times I did NOT want my husband’s ex-wife in my house.  The dishes may not be done, I may be tired after a long day of work, maybe I’m feeling insecure and fat that day and don’t want to see her being all chipper and pretty in my living room, but I’ve always made an effort to welcome her with a smile anyway because those are her kids and maintaining that good relationship is just so important for everyone’s sanity and peace of mind. Tolerating a little bit of an imposition every now and then is so much better than constant conflict and you’re right it’s just not my place to keep a mother from her child.",
                      "id": 19,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 25,
                      "content": "For God's sake, soldier on battlefields cry out for their mothers. It is NORMAL to want a nurturing parent when you're afraid.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 13,
                      "content": ">I think the term toxic masculinity is overused but it's perfect in a situation like this.\n\nI'll give OP this - IMHO it's not toxic masculinity.  He's not saying he doesn't want his son to need anyone and man up.  He's saying he wants his son to understand that he can do anything Mom can for him, and it doesn't always have to be Mom, especially when the event is on his custodial time.  Sounds like he's desperate for son not to prefer Mom.  Actual surgery is *not* the time to flex about this issue - or anything.\n\nDon't get me wrong - he's still being a jerk - just not regarding toxic masculinity.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "It feels like the son loves his mom a little more and has a tendency to run to mum instead of OP. He's bitter about that, and that's why he's trying to force the mom out of this.",
                      "id": 22,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 126,
                  "content": "And you need your Mom and Dad especially for that extra coddling. Unless the Mom is contentious or something I am sure he probably would want to be with his Mom anyway. OP sounds like a control freak jerk. Bet you he didn’t ask his 9 yr old.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 10,
                      "content": "You can tell why they divorced just from this post.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "He did not. Said his son had no say in the matter.",
                      "id": 25,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 76,
                  "content": "[deleted]",
                  "id": 26,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 10,
                  "content": "I really don't like to comment on these because I'm sure there's a lot of detail we're not getting.\n\nBut holy shit.  If I ever have kids and my partner and I become separated, I hope beyond anything I won't turn into this guy. Imagine using your child's misery as a weapon against your ex.",
                  "id": 27,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "Yes! My ex husband and I rarely get along, but when my son had surgery for his broken ankle, we sucked it up. Mobility was an issue so we compromised for my son’s sake. We each extended his time with us in the beginning so he would be as comfortable as possible. We allowed one another to visit him whenever he/we wanted because it was about our son, not ourselves! OP, YTA.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 6,
                  "content": "That’s not true, this daddy did say that mom can be in the OR if she wants and that he has no problem with that. \n\nOP-  you’re not a kind human and it’s clear you’re not a kind dad. \n\nYTA. \n\nNow we know why she’s an ex. You even sound nasty while trying to get online supporters.",
                  "id": 29,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 1060,
              "content": "What gets me is the \"my son doesn't decide who he stays with and when and how long\" bit. Like under normal circumstances, sure don't let the kid decide yet, but this is not normal circumstances. OP is so heartless",
              "id": 30,
              "comments": [
                {
                  "score": 838,
                  "content": "Yea and the whole \"I don't want my son learning that when he's sick or facing something scary to run to mummy and not daddy\" like, what? It's natural when kids are sick or scared to want their mum, hell even grown adults when they are really sick, scared or in a lot of pain still want their mum.",
                  "id": 31,
                  "comments": [
                    {
                      "score": 768,
                      "content": "He’s jealous of the mom and the relationship she has with the son. He’s willing to hurt his son over this petty jealousy. It’s pathetic.",
                      "id": 32,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 176,
                      "content": "I'm 40 years old and my mom lives 2 hours away. When I had a really bad flu, I called her crying because I needed her and she came to be with me. \n\nI have an 11 year old son and all he wants to do when he's sick is cuddle with me.",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "Well, not really.  They want the parent that is most comforting and most associated with soothing them from birth.  It just usually works out to be mum, because most societies still leave the burden of childcare to women.  Especially true in a case where the father is like OP.\n\nI doubt OP spent dozens of hours awake all night with his sick infant/toddler cuddling them and trying fifty different things to make miserable situations less miserable.\n\nCould be wrong, maybe his son will want to cling to him like a koala, but I doubt it.",
                      "id": 34,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 8,
                      "content": "Hell as a grown woman I screamed \"mommy!\" when I was giving birth to my son. I mean, she wasn't there and didn't come til later but the point still remains. Poor kiddo is going to be recovering from surgery and his dad is so hell bent on having control that he won't even let his mom see him. Op, your ex isn't asking to move in. Just visit or have him stay at her house. He's going to want him mom. YTA",
                      "id": 35,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "That part made OP TA for me. \nWe don’t know the situation of the bio parents. not being together. \n\nA 9 year old is more than old enough to say what parent he wants helping him after surgery.\n\nListen to your kids.",
                  "id": 36,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 443,
              "content": "\"If the shoe was on the other foot I would understand\" mf is lying through his teeth. There is no situation that would exist like that because OP HIMSELF scheduled the appointment to his benefit. He made this situation and is trampling ex-wife with it. This is all about control.",
              "id": 37,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 390,
              "content": "Ohhhh you have no idea. I’m a family law attorney and it’s truly sad to see how many parents use their kids as pawns in a bid for power. In my experience, dad is going to win this battle of time with kid since he’s technically correct but he’ll lose the war in that his son will grow up and see that dad’s an AH. Kids want their parents to get along, they want to be able to feel heard and seen. Dad is really fucking up here imo.",
              "id": 38,
              "comments": [
                {
                  "score": 102,
                  "content": "The number of people that cared more about hurting the other partner and money than their actual children when I was worked with family law still disgusts me to this day.",
                  "id": 39,
                  "comments": [
                    {
                      "score": 12,
                      "content": "My mother went through this her entire life, and even though her parents have both passed away she continues to suffer daily from the trauma of that experience.  I hope the mother of this child has a good attorney that can help her get the custody agreement amended for this kind of exceptional circumstance in the future, if that's even possible.",
                      "id": 40,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 7,
                      "content": "Trust me when I say it’s only gotten worse. Family court is hell.",
                      "id": 41,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 5,
                      "content": "I had a court counsellor help me when my son was born.  My ex was more like the OP and spiteful. But one thing the counsellor said stuck with me and I kept it:  \"Just because he was TA, doesn't mean he can't be a good father.\"  I hung onto that and my son has a great relationship with both of us (he's an adult) and his father and I have a reasonably good relationship too. All because I refused to be spiteful when he was an AH.  I also refused to say why we separated saying that was between his dad and me.  I put my son first all the time.  And it paid off.  I also saw tearing your ex down only damages your relationship with your child.",
                      "id": 42,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Seriously. The custody agreement is for legal stuff. In practice it gets tossed aside all the freaking time for various reasons. You do what's best for the kid.",
                  "id": 43,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "This is my situation. My ex uses our kids as pawns and it hurts them deeply. It’s the only thing he can do to hurt me, and even though I’m controlled in my responses, he knows it. He just doesn’t care. They already see through him at a young age, and that’s also heartbreaking in a way. And I might be stuck in this divorce limbo forever, at this rate.",
                  "id": 44,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "My dad was just like OP. Guess who I don't visit anymore, I dare ya.",
                  "id": 45,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 300,
              "content": "YTA for the lack of visits.  Is that best for your son?  Or just kind of fun for you to torture your ex.  What a gross and selfish choice",
              "id": 46,
              "comments": [
                {
                  "score": 17,
                  "content": "Op should just say he hates his ex and go lol",
                  "id": 47,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 265,
              "content": "[removed]",
              "id": 48,
              "comments": [
                {
                  "score": 120,
                  "content": "[removed]",
                  "id": 49,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 103,
                  "content": "In his edit, he doesn't even give his son's wishes a second thought. What kind of human being, dude.",
                  "id": 50,
                  "comments": [
                    {
                      "score": 13,
                      "content": "He's just like my partners ex. She's a petty, controlling person too. Good grief yta",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 10,
                  "content": "Comment stolen from u/Poekienijn\n\nu/Still_Promise_1279 is a bot.",
                  "id": 52,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 263,
              "content": "BIGGEST YTA for \n\"No, my son doesn't get to decide who he gets to stay with and when and for how long. That's why there are custody agreements.\"\n\nGrow up! I get you are not a compassionate person. So let's try just acting like you are! If my parents acted the way some of the parents on these reddit stories did I would hate both of them! \nHuge YTA OP. My God your son has to be scared and wouldn't it be good if both his parents were there during his recovery! Your kid is 9....if it we're me as a kid and I want to be with my Mom you bet your bottom dollar I would be kicking and screaming at the hospital to go home with whichever parent allows the other parent to be there too!! I hope your kid does the same!",
              "id": 53,
              "comments": [
                {
                  "score": 16,
                  "content": "Yeah, I hope he enjoys his power trip because it won’t last for long.  The kid will be NC at 18 and the dad will be all “missing missing reasons” WHYYYYY IS MY SON NOT TALKING TO ME????\n\nOP, YTA",
                  "id": 54,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 9,
                  "content": "All of this, and I get the feeling that OP isn't going to be the most sympathetic person when it comes to his sons pain and discomfort.",
                  "id": 55,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 155,
              "content": "Seriously. It's surgery. It's a big deal and any reasonable person would know to make an exception to the custody agreement. Cold hearted, stubborn, power play, using son as a pawn. I get why they're divorced. 100% AH",
              "id": 56,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "If there ever comes time for a re-eval of custody, OP's antics are gonna backfire spectacularly. It's easily transparent that he's using his kid to hurt his ex, quite possibly to the detriment of the child.\n\nThen there's the part where he's 9. They're still compliant at age 9. Wait til kiddo becomes a teenager, realizes he's his own person and no longer wants anything to do with dad.\n\n(and wait until he finds out that he can't actually force a child themselves to adhere to a set custody schedule.)",
              "id": 57,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 16,
              "content": "Yeah, that’s what pushed me over. Not wanting to change calendar, ok. Refusing visits during major medical event of 9 y o child? What on God’s green earth nastiness is that?",
              "id": 58,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 713,
          "content": "OP is big time TA, turning his recovering child into a pawn. Don’t be surprised when Ry goes NC the second he’s able.",
          "id": 59,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 636,
          "content": "Still no word on who is taking care of him at your home, OP u/Unhappy-Front-5295?\n\nDid you put in leave to take care of your son, or is he alone at home all day watching TV while his dad works? Or how is his care during healing working?",
          "id": 60,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 627,
          "content": "He said his son doesn't get to decide! What a selfish thing to say.\n\nOP, get off your high horse and listen to your son's needs in a difficult time.",
          "id": 61,
          "comments": [
            {
              "score": 355,
              "content": "To be fair, counsellors are very clear that children do not have the capacity to take on this decision, it’s a big burden to kids to disappoint one parent or the other and having to choose between parents and be in the middle of a power play is very discouraged. This is why parent decide on a parenting schedule, including holidays and in sickness clauses. Parents can be the bad guys so kids do not have to be.\n\nTo think that you can put the decision on a 9yo who’s sick and going through surgery is quite unreasonable",
              "id": 62,
              "comments": [
                {
                  "score": 293,
                  "content": "[removed]",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 207,
                  "content": "It’s unreasonable to allow a scared little boy who is also in pain a visit from his mom? Sure ok..",
                  "id": 64,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 101,
                  "content": "I dont think this is a case of \"who's house do you want to recover at\" and more I case of \"I want to stay with mummy\" \nYou don't have to ask a kid to choose for him to show a preference  and the fact that he said he needs to learn he can't go running to mummy everytime he is hurt makes me think he already knows his mum is his safe space",
                  "id": 65,
                  "comments": [
                    {
                      "score": 10,
                      "content": "He can allow her to visit or drop off a care package. It's entirely a powerplay to stop that. Even the neighbour would be allowed to drop a care package.",
                      "id": 66,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 9,
                      "content": "Yep, totally agree. And the AH OP here doesn't care who his son prefers because it's his time per the custody agreement. It's not about how his son would be most comfortable. Sounds like he understands sometimes his son is going to be stuck with HIM and he wants to show him this now.   \nI honestly can't remember seeing a post this pathetic or spiteful/hateful in a long time. I feel bad for his ex-wife, but worse for his son.",
                      "id": 67,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 423,
          "content": "Absolutely turned it into a power play. \n\n>Personally I don't care because I'm not apologizing for not giving her what she wants.\n\nActually, objectively, you do care to a certain extent. Otherwise, you wouldn't have taken the time to post this on Reddit hoping others would agree with you so that you can justify your actions and make yourself feel better about it.",
          "id": 68,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 396,
          "content": "And she’s right to be concerned. This isn’t a simple hernia fix, these operations are painful. His son is going to be scared, in pain and in need of support by both parents. I agree stepdad isn’t the most appropriate to be washing and caring for the son but if there is a time to show a little bit of compassion now is the time to do it. This is going to be a key memory for his son moving forward and his parent’s actions are going to cause repercussions further down the line if they mishandle it",
          "id": 69,
          "comments": [
            {
              "score": 358,
              "content": "Mom can bathe her own son! He is 9 not 19 FFS.",
              "id": 70,
              "comments": [
                {
                  "score": 163,
                  "content": "I fully agree, I think OP is just using any reason to shoot her down.",
                  "id": 71,
                  "comments": [
                    {
                      "score": 15,
                      "content": "Op just hates his ex and is using his son to get “revenge”",
                      "id": 72,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "Even then.. if it was due to a medical issue or something where the person couldn't you can bet mother will be there to take care of their children regardless.",
                  "id": 73,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "Yes, I think she just suggested the step father to try and appease OP.",
                  "id": 74,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 105,
              "content": "Let's not give stepdads a bad rap just for being stepdads. This person could have been involved in the child's life since they were quite young.",
              "id": 75,
              "comments": [
                {
                  "score": 8,
                  "content": "This is a good point. I answered based on him just being “stepdad”. He might be a wonderful parental figure but OP is to self centred to have given us any real information into their relationship. If they’re close and his son is comfortable with being washed by step dad. Coming back from orthopaedic hip surgery I think he’ll be grateful for any care that comes from a loving family. I don’t feel like he’s going to get it here.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Honestly, it is OPs weird hang ups about the mom washing the kid that make me wonder what kind of person OP is.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "Stepdad is appropriate if that's who the son asks for and he is generally in a 'dad' role.",
              "id": 78,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 366,
          "content": "Dude's a freaking jackass with his edit. Of course this poor boy's parents got divorced. OP is *crazy controlling*! \n\nLike, kid's 9, not 3. He *should* have some say in where he goes to recover. He'll recover quicker in a place where he *wants* to be, not just with OP because OP cares about a custody agreement. \n\nYTA, OP. And a massive one.",
          "id": 79,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 221,
          "content": "YTA. Not for wanting to stick to the schedule, but for forbidding ex access at all to her son after this serious surgery. AND for not bothering to ask son what would make his recovery easier for HIM.",
          "id": 80,
          "comments": [
            {
              "score": 10,
              "content": "Yeah, he buried the lede there. I’d say N A H if both parents were trying to get custody of their kid for the period right after the surgery. The mom would be legally in the wrong and she would lose (and also if it’s 50/50 custody there’s a high chance that bio dad, who’s been in the kid’s life longer than stepdad, is a much better option for vulnerable things like cleaning), but I would understand both sides. But to *not let her visit?* There’s no way to know form what’s here but I wonder if she wouldn’t have tried to change the custody time if he wasn’t like this.",
              "id": 81,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 217,
          "content": "[removed]",
          "id": 82,
          "comments": [
            {
              "score": 82,
              "content": "YTA and a huge one!! You are making this all about your feeling about your ex and not about what is best for your son!! Your reasoning of not wanting him to run to mom instead of dad??  What a fucking crock!!! Plus she can’t even come into your house to see her son? News for you - your son is going to resent you big time if you can’t figure out co parenting now ESPECIALLY during times like this.",
              "id": 83,
              "comments": [
                {
                  "score": 7,
                  "content": "My dad is currently dying of cancer with both his children NC. The reason? He used us as pawns to get back at our mother, just like this, and even though I'm 41 years old, he is still giving my therapist a LOT of work.\n\nI hope getting back at the mom is worth eventually having a son who will resent him. THAT will own the kid's mom, for sure! /s",
                  "id": 84,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 42,
              "content": "[removed]",
              "id": 85,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 105,
          "content": "[removed]",
          "id": 86,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 18646,
      "content": "YTA.\n\nYou're thinking of yourself and not your kid.\n\nIt's your time to have him so taking him back to your place makes sense but not letting his mother come to visit him in person is a shitty thing to do, and the argument \"I have a penis so only I can help my son bathe and get dressed\" is BS. Your ex is his MOTHER. I'm ready to bet he wouldn't have an issue with it.\n\nGrow up.",
      "id": 87,
      "comments": [
        {
          "score": 3568,
          "content": "I have an 8 year old son who still jumps in the shower with me. I find it unlikely that a 9 year old would turn his nose up at getting help from his mum after surgery.",
          "id": 88,
          "comments": [
            {
              "score": 35,
              "content": "A lot of comments about how great moms are with sick kids, no disagreement there. Just wanted to jump in and play a little devil's advocate -- there's definitely dads out there who do a fan-fucking-tastic job taking care of sick babies/kids/SO's. This dad doesn't strike me as one of those, but as myself and others have commented, LET'S ASK THE KID. it's a novel idea...",
              "id": 89,
              "comments": [
                {
                  "score": 12,
                  "content": "Agreed. My husband is the one who mostly coddles and dotes on the kids, especially when they’re sick. He was infantry for 20 years, suffers from PTSD, but he’s the most loving, sensitive guy when it comes to his kids. And even with all that, when the kids are sick, they still ask for mommy. I can’t explain it, and he doesn’t take offense to it, it just is what it is. It’s like an instinct; you cover yourself when you’re cold, you eat when you’re hungry, and you want your mommy when you’re sick. Are there exceptions, of course!",
                  "id": 90,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Her point wasn't that a mother is better, it was about how a 9 year old boy wouldn't have an issue with getting help changing clothing from his mom just because they are different genders.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 25,
              "content": "My nine year old still runs around butt naked on her way to the shower",
              "id": 92,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I have an 11yo who has been showering and dressing and changing and toileting without wanting supervision or company or to talkmthrough the door, for about three years, but he'll absolutely ask me to come look (and tell him whether that's okay or what ointment to put on) if he has a flea bite on the inner thigh or a rash on his scrotum  and that's when I still happen to sometimes see his genitals, and it's not weird because I am his mother and I am SUPPOSED to teach him how to take care of his body and judging owies is a part of that.",
              "id": 93,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "My 7 year old son mostly showers himself but I still go in and make sure his hair is properly rinsed out & everything. He doesn’t care. I really doubt this kid does either",
              "id": 94,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "At 9 years old I very strongly didn’t want either of my parents seeing me naked, but I was an overly independent child. if I absolutely could not manage to get dressed on my own, I would’ve chosen my mum to help I think",
              "id": 95,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "i slept with my parents until i was around 9. now they both get daily phonecalls/texts and regular visits. i knew i was loved now so do they!",
              "id": 96,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 425,
          "content": "I had to have a mastectomy when I was 31. My dad helped take care of me and change my dressings. Because I needed help doing it and he cares about me and was the person who was available to help me. It wasn't weird because taking care of a sick child is something any parent should do, no matter how old. I can't imagine telling a mother she can't care for her 9 year old son(!!) because he's a boy and she's a woman. That's so weird.",
          "id": 97,
          "comments": [
            {
              "score": 138,
              "content": "I guess OP was the only one changing the kid's diapers and bathing the kid when he was still married to his ex... or not.",
              "id": 98,
              "comments": [
                {
                  "score": 87,
                  "content": "He really isn't coming across as the diaper changing sort of father",
                  "id": 99,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 371,
          "content": "Or, and hear me out on that one, recognize the gravity of the situation and (here comes the crazy part) ask the fucking child what he wants instead of picking fights!",
          "id": 100,
          "comments": [
            {
              "score": 228,
              "content": "Totally agree with you.\n\nBut, as I was reading, I was thinking : I'm not a parent but I can't imagine not seing your child for a week or two when he just had surgery. \n\nFacetime is great but it's not the same thing as getting hugged by your mother. And that doesn't mean that a father can't do the job. If it had been the mother who had refused the father to visit his kid, I would have had the same answer. The kid needs BOTH his parents after getting surgery.",
              "id": 101,
              "comments": [
                {
                  "score": 15,
                  "content": "I'm a Mom and my son is approx same age as OP. He would be in tears if I wasn't there when he woke up from surgery. He would lose his shit if I wasn't there to put him to bed at night. He knows I'm his Mommy and I put everything else 2nd to his needs. There are some fathers that do this, but OP isn't one of them.",
                  "id": 102,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 324,
          "content": "The showering/undressing thing was so bizarre. Like I’m sure she has seen her own son naked quite a lot. Its not inapproperiate unless you sexualize the kid. OP got some issues. \n\nHe’s also a big YTA. Let the boy have access to both parents in a scary time.",
          "id": 103,
          "comments": [
            {
              "score": 156,
              "content": "It's not bizarre when you see what she answered. \n\nHe's a jackass and must have been at least verbally abusive towards his ex. The answer most women would have given was : I gave birth to him and took care of him before. But she went to find another solution because she's that desperate. \n\nLegally, OP couldn't refuse the ex at the hospital and that's why she was there. Legally, he can stop her from coming to his house on his custody time.\n\nHe must be one of those parents who don't go to activities or school events when it's not his custody time and he must refuse to let his ex anywhere near the kid on his time. \n\nIt's sad the kid.",
              "id": 104,
              "comments": [
                {
                  "score": 4,
                  "content": "I just took that as a retort to OP: you think it should be a male, fine, I’ll have my current so do it. He can’t argue the gender aspect if she’s agreeing to have a male help. She’s making him find another excuse.",
                  "id": 105,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 16,
              "content": "> Its not inapproperiate unless you sexualize the kid. OP got some issues.\n\nI don't think he buys his own line there.  I think he's just using it as another excuse to keep the kid away from his mother.",
              "id": 106,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 14,
              "content": "While I think OP is being ridiculous about it, there are some kids that only want a certain parent to bath/dress them. My cousin stopped letting her dad dress her at a young age because \"I am a girl and he is a boy\" 😅\n\nI don't think that's the case here, though.",
              "id": 107,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "And it could really damage his relationship with both his parents: either he's going to think his mom didn't want to come and see him after a big, scary event or he's going to knows that his dad kept his mom from him.\n\nPick a day and let her come by for half an hour and all her to extend the same courtesy should the tables turn\n\nEdit: autocorrect",
          "id": 108,
          "comments": [
            {
              "score": 7,
              "content": "Also, many children have a favorite parent, get over it lol. Doesn't meant they don't love/need both.",
              "id": 109,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 10,
          "content": "I have an 8 year old that’s still not body shy gets me to dry him off and help him get dressed tell him to put clothes on he just giggles and is in no hurry. OP is full of shit.",
          "id": 110,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "I, 23M (22 when it happened), had surgery after a fall and couldn't wash myself. My mom helped my wash myself and I didn't mind, except for the fact that I couldn't do it myself). I see no reason why a 9yo old would have a huge issue with. A boy in puberty might have been a different case, but then only him could decide it as well and not the father.",
          "id": 111,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "My 9 y/o son prefers me over dad when he needs help with personal care tasks. Mom is gentler.",
          "id": 112,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 11344,
      "content": "YTA. All this \"what I want,\" and \"not giving her what she wanted.\"\n\nThe surgery is not about you or your ex-wife. It's about your son. Do either of you know what he wants? Will he want to see her while he recovers? Why can't you work together to make this the best experience possible for *him*?",
      "id": 113,
      "comments": [
        {
          "score": 5479,
          "content": "OP has directly stated in his edit that what his son wants doesn't matter. Major YTA, OP.",
          "id": 114,
          "comments": [
            {
              "score": 2077,
              "content": "He doesn’t want to ask his son because he will probably want to stay with his mom and that will hurt Dads ego. If he was truly concerned about his sons comfort it would be his #1 priority. YTA, OP.",
              "id": 115,
              "comments": [
                {
                  "score": 716,
                  "content": "100%. The way he typed this out it defenitly seems the 9 yr old has made the 'mom' choice over dad before.. hmm I wonder why..?",
                  "id": 116,
                  "comments": [
                    {
                      "score": 212,
                      "content": "Yep. Dad is attempting to force the kid to love him. And this kid is gonna *loathe* his father. I can feel it in the post.",
                      "id": 117,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 390,
                  "content": "The crazy thing is he doesn’t even have to ask his son if he wants to STAY with his mom. A simple “would you like your mom to come over for a little while you’re here?” is the least he could do. Of course his son will likely say yes and that should be okay. \n\nIt just feels like OP is acting like his child is a object he gets possession of. YTA, 100% OP.",
                  "id": 118,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Exactly, OP is from the parenting school of 'children are possessions and i have complete control over them'.\n\nChildren are whole human beings capable of thoughts, opinions and feelings and they deserve to be heard and listened to and respected as whole human beings and not accessories to play with like a fancy fucking watch, or a toy to fight over with an ex.",
                      "id": 119,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Ouff. As kids, my brother and I would often pick our mom and I know now how much it hurt our dad. Ofc he always let us go.",
                  "id": 120,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 427,
              "content": "Unless the custody agreement has a section on \"after surgery\" this shouldn't even fall under that agreement, it should be something worked out by two adults who love their kid and want him to heal in the best environment with the most support. YTA.",
              "id": 121,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 304,
              "content": "Meaning the son wants to stay with the mom. If he wanted to stay with dad, he would be gleefully telling us that. I hope this guy is ready for his son to go no contact with him when he's older.",
              "id": 122,
              "comments": [
                {
                  "score": 30,
                  "content": "I'm in my 40's and still remember my dad telling me I couldn't go out with friends on \"his time\", I couldn't call my mom on \"his time\", etc. I stopped going to his house the second I was legally able, and he was only allowed around my children once they got older because I didn't want them around toxic machismo. Thankfully he calmed down in his 50's.   \nI'm divorced and even though we have a custody agreement, I have always told our kids that they can choose wherever they want to be and it won't hurt my feelings. My daughter needs to study and our house is too loud, I offer to take her to her dad's where no one but her stepmom is home during the day. They have never once chosen their dad's house because they hate him and his wife, BUT, I always give them the option because that's what caring, rational parents do.",
                  "id": 123,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 11,
                  "content": "That's exactly what I thought too after reading all this.",
                  "id": 124,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 153,
              "content": "I think that OP is worried that his son will pick Mum over Dad. Or that he will set a new standard where son can go back to Mum’s house anytime Dad tries to enforce rules etc.\n\nI hope that OP is able to set aside his fears on this occasion.",
              "id": 125,
              "comments": [
                {
                  "score": 129,
                  "content": "OP knows their son will pick mom. Young children know an asshole when one abuses them.",
                  "id": 126,
                  "comments": [
                    {
                      "score": 11,
                      "content": "I was abused as a young child and I completely believed that there was something wrong with me and that I deserved it.  Clever abusers know how to make their targets blame themselves.",
                      "id": 127,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 121,
              "content": "Son really became the third wheel in his own surgery recovery",
              "id": 128,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "Makes be wonder if the ex wife doesn't trust him with her son during recovery for good reason.",
              "id": 129,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 6,
              "content": "OP about to be in a rude awakening when his son gets to the age where he can decide what he wants (without his father consequences) and can potentially decide not to see OP anymore and OP cant do a thing about it besides complain. \n\nOP making this about him instead of the kid is foul. His relationship with his ex-wife means zilch – they need to learn to co parent properly. Not to mention his reasoning about the exwife can't bathe/dress her OWN SON is weird because what does he think a single mother in this situation if needed??",
              "id": 130,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 5,
              "content": "Ugh gross. No wonder he has a EX wife.",
              "id": 131,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "I really hope his wife sees this and provides it to the court. This is the black and white evidence that could sway a court opinion, changing or amending a custody agreement.",
              "id": 132,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 259,
          "content": "YTA. \n\nThe first thing you want to make sure is that your son see you first instead of making sure his welfare come first? How about you ask your son directly",
          "id": 133,
          "comments": [
            {
              "score": 149,
              "content": "No, per OP's edit his son's feelings apparently matter less than the custodial agreement.",
              "id": 134,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 75,
          "content": "100% this. Has anyone bothered to ask son where/with whom he prefers to recover?",
          "id": 135,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 8912,
      "content": "You had me right up until you refused to let her visit. \n\nThink what you want about your ex. Your kid's health is the wrong place for this kind of flex.\n\nYTA",
      "id": 136,
      "comments": [
        {
          "score": 2205,
          "content": "I agree with this. Imagine your 9 yr old son going in for surgery and you’re not allowed to visit while he’s recovering.",
          "id": 137,
          "comments": [
            {
              "score": 1396,
              "content": "It will make him depressed \n\nShe could even take him back to court over this\n\nIt's parental alienation",
              "id": 138,
              "comments": [
                {
                  "score": 349,
                  "content": ">It's parental alienation\n\nNot unless he doesn't allow the schedule facetime calls or starts trying to fill the son's head with negative things about the mother. Sticking to the letter of the custody agreement cannot be used as evidence of parental alienation.\n\nOP is being a dick but he isn't alienating the other parent legally speaking.",
                  "id": 139,
                  "comments": [
                    {
                      "score": 368,
                      "content": ">I don't want him to think that the first thing you when you face something scary is run to your mom and not your dad.\n\nIf a good lawyer saw this, they could make a pretty good case for parental alienation.",
                      "id": 140,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 17,
                  "content": "Exactly. 50-50 custody does not mean keep the child away from the other parent during a very difficult time. I wouldn't be surprised if OP decided to not let his son know that his mom is forbidden from visiting, so he can push his agenda of further alienation by making the son think his mom doesn't want to see him while he recovers.",
                  "id": 141,
                  "comments": [
                    {
                      "score": 11,
                      "content": "Oh he won't but one day he and mummy will have a fight and he will say YOU DONT CARE ABOUT ME YOU DIDNT EVEN VISIT ME AT DADS WHEN I HAD MY SUGERY then the mother will reply I WANTED TO DARLING MORE THEN ANYTHING BUT YOUR AH FORBID ME ANS TOLD ME I WASN'T ALLOWED TOO. I ASKED YOUR DAD IF I COULD LOOK AFTER YOU WHILE YOU RECOVERED BUT HE USED YOU ASX\n A POWER PLAY TO HURT ME\n\nthat will go like a lead balloon",
                      "id": 142,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I have two boys, 11 and 8.  I would be absolutely beside myself if I could not visit them in person after a painful surgery.  The cruelty of this post is breaking my heart, for both the child and the mother.",
              "id": 143,
              "comments": [
                {
                  "score": 8,
                  "content": "The way he writes smacks of narcissism. That poor woman is tied to this man forever now. And the poor kid, imagine having that as your dad.",
                  "id": 144,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 15,
              "content": "Imagine being in pain from a frikkin hip surgery at 9 years old and not being able to get a hug from your mom.",
              "id": 145,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 676,
          "content": "He hates his ex more than he loves his son. Simple as that.",
          "id": 146,
          "comments": [
            {
              "score": 39,
              "content": "Yeah, this is all about winning. He doesn't care about how it affects his son at all as long as he can punish his ex.",
              "id": 147,
              "comments": [
                {
                  "score": 8,
                  "content": "It's really just sad. I have kids and I just cannot imagine purposely making them suffer out of spite. I don't think I'm a particularly great person and I really cannot understand that mentality. It's scary people like this guy exist.",
                  "id": 148,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 243,
          "content": "This. She should be able to visit, absolutely.\n\nContext - I’m a step mom. When my step kids were younger (and still today as they’re young adults living at home) we have their biomom over whenever we felt the kids needed it. A rough day, a recovery, a hard conversation… we brought her in for alone time with them and all together. \n\nYou kid needs to —and deserves to— know that, when it counts most, his parents drop anything difficult between themselves and come TOGETHER to support him. That’s what being a parent is. Period.\n\nETA: YTA",
          "id": 149,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 103,
          "content": "Agree whole heartedly. Why not let her visit? What is the harm? Think of the child, sheesh!",
          "id": 150,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 14,
          "content": "That's how I felt as well. She's concerned about her kid, she just wants to help him and check up on him. A facetime isn't enough. The kid probably will want her at some point as well. He'll never forget that when he was recovering his mum wasn't there. This is selfish of OP, it will cost him nothing for her to visit and mean a lot to his kid. YTA OP.",
          "id": 151,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "Yes this is what got me too! How do you stop a 9 year old from seeing their mom after a major surgery. Suck it up OP and let his mom come visit him! This is about your son not you. Your and his mom's feelings are not what matter at this time! Yta",
          "id": 152,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "This line stood out to me even before that:\n\n> I don't want him to think that the first thing you when you face something scary is run to your mom and not your dad.",
          "id": 153,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5452,
      "content": "YTA for denying her the ability to visit her son while he recovers. I get that you don’t want her in your house but sometimes coparenting is about putting your child before your own comfort.",
      "id": 154,
      "comments": [
        {
          "score": 961,
          "content": "Right? Does OP want to support his son or just lord it over his ex that he’s caring for the son she she can’t.  He’s 9, not 1. The son actually has autonomous feelings outside the dad’s construct here.",
          "id": 155,
          "comments": [
            {
              "score": 325,
              "content": "Which is exactly why he doesn’t want his son to have a say. OP knows (or at least fears) that his son would rather be with mom. And his fragile ego can’t handle that (as evidence by the whole “you shouldn’t run to your mother because what about *meee*?” Thing).",
              "id": 156,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 887,
          "content": "What’s extra sad to me is SHE scheduled the surgery date so it would line up with what was best for her SONS schedule so he could heal without missing school (winter break). She could’ve been petty and intentionally scheduled the surgery for a time she would have him. Mom obviously understands putting her son above her own needs and comfort edit: YTA",
          "id": 157,
          "comments": [
            {
              "score": 406,
              "content": "Yuuup I caught that too. There is a very clear reason OP is divorced",
              "id": 158,
              "comments": [
                {
                  "score": 173,
                  "content": "I hope when son starts to ask to see mom (because he will no doubt) OP swallows his pride and bitterness and let’s mom come visit",
                  "id": 159,
                  "comments": [
                    {
                      "score": 211,
                      "content": "I have a feeling that based on his edit, if his son asks for his mom he will probably tell him no. But I really, really hope he sees the light after this post and you are right.",
                      "id": 160,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 8,
                      "content": "I highly doubt it based of what he writes, it's about his control and his wishes no matter how it effects his child. \nWe all know parents like this, my mum was the same, went no contact 8 years ago, both my siblings are extremely low contact with one also considering no contact. Op will act so shocked when his son decides F you and cuts him off, but no doubt his ex will be to blame in his eyes.",
                      "id": 161,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 212,
          "content": "This OP does not sound like he coparents well at all. He sounds super bitter, which is not a good sign.\n\nYTA, OP. Hate your ex all you want, but do NOT take it out on your son. As someone from a broken home, this kind of shit happened all the time. Stop making it hard for your son like his opinion doesn’t matter. My father treated my half brother that way… turns out father dearest is a narcissistic, controlling asshole. I went no contact with him.\n\nThis is how you drive wedges into relationships. Telling us your son’s desires don’t matter is extraordinarily low of you. That shows not just a lack of compassion for your child, but that you’re selfish and severely emotionally immature and stunted.\n\nGrow up, OP. You’re raising a child. Quit acting like a petty one.",
          "id": 162,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 5,
          "content": "She might not deserve to visit her son. But her son deserves to be visited by his mother at the very least. What an asshole.",
          "id": 163,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 4,
          "content": "Exactly judge Judy says you gotta love your kids more than you hate your ex. Do right by them.",
          "id": 164,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3134,
      "content": "INFO: has anyone asked him what he wants and where he'd prefer to be?",
      "id": 165,
      "comments": [
        {
          "score": 2585,
          "content": "He stated in a comment that he doesn’t care what his son wants. I don’t even know why he posted here because he also doesn’t care that everyone here is telling him he’s wrong and YTA lol.",
          "id": 166,
          "comments": [
            {
              "score": 685,
              "content": "He’s probably too afraid that his son will choose to be with his mother more. Hence why his son doesn’t get to make a choice. \n\nSuch a terrible way of teaching physical/emotional boundaries.",
              "id": 167,
              "comments": [
                {
                  "score": 354,
                  "content": "His edit:\n\n>No, my son doesn't get to decide who he gets to stay with and when and for how long. That's why there are custody agreements.\n\nA judge says he doesn't have to give his son a choice so instead he treats him like property. So gross. He's using his son to play power games with his ex instead of treating him like a human being. Imagine being scared and in pain, wanting both your mom and dad (and maybe even the stepdad if they have a good relationship) but your dad won't let them even visit you.",
                  "id": 168,
                  "comments": [
                    {
                      "score": 35,
                      "content": "Because to him his son is property, specifically his son is a weapon",
                      "id": 169,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 26,
                      "content": "Bet if his son wanted to stay with dad , that’d be a big part of dads argument. But he doesn’t. So he says it doesn’t matter what he wants.",
                      "id": 170,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                },
                {
                  "score": 34,
                  "content": "IMO \"afraid\" of that would be asking about how to handle the situation.\n\nHis confidence says to me he already knows his son will choose to be with his mother more.",
                  "id": 171,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "Right that part stuck out to me. Being mad at the ex for reasons unknown to the point where he is inflexible I could kind of understand even if I don't agree but giving what the child wants 0 consideration ... what a dick.",
              "id": 172,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "He wanted us to validate his POV and got surprise pikachu’d instead",
              "id": 173,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        },
        {
          "score": 369,
          "content": "This!! Now is not the time to put your feelings or interests first.\n\nEdit: Since this is his first major medical procedure, wouldn't it be more reassuring to have both his parents around? It's cruel to forbid the mother from even visiting during his recovery.",
          "id": 174,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 185,
          "content": "I hope this dude enjoys the next 9 years before this kid goes NC with him, because there's no way this is the only case or even the worst instance of this complete AH, selfish behavior.",
          "id": 175,
          "comments": [
            {
              "score": 11,
              "content": "Legally kids get to decide which parent they want to live with at 14, so he's realistically only got 5 years left at this rate",
              "id": 176,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 25,
          "content": "And does OP remotely care about what’s best for his son who’s going to be in pain and terrified? No wonder his mum wanted him with her",
          "id": 177,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 11,
          "content": "He thinks that because of custody agreements, he doesn't have to consider his son's opinion.",
          "id": 178,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "It’s not about what my SON wants it’s about what ME AND THE COURTS want!",
          "id": 179,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2893,
      "content": "YTA.  I doubt you will admit it.  But I think you are very much enjoying the fact that your wife won’t be able to visit her child while he is recovering.",
      "id": 180,
      "comments": [
        {
          "score": 837,
          "content": "Absolutely! He is loving every minute of it. He furthermore enjoys the control over his son too as he keeps claiming, his son has no say in this at all.\n\nGives me serious narc vibes.",
          "id": 181,
          "comments": [
            {
              "score": 179,
              "content": "Yes, YTA OP. You don't sound like you sincerely care about your sons well being which includes his emotional wellbeing.",
              "id": 182,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 99,
              "content": "I would petition for parental alienation. 3 weeks of dad being able to say: see i care for you, but your mummy doesn't even come to visit",
              "id": 183,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Def a narc. He is so cocky that he actually thought reddit would validate him. He just found out we aren’t narc ego boosters here.",
              "id": 184,
              "comments": [
                {
                  "score": 10,
                  "content": "I mean, these posts with dads and custody agreements really do go either way on here. I’ve seen many that are reasonable (either for or against dad’s side, such as here), and some where the dad is clearly in the wrong, but the incels/MGTOWS get ahold of it first and take dads side. So he’s not entirely off base, thinking he might get some sympathy. It is Reddit, after all.",
                  "id": 185,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "40 years later\n\n\"Son, why won't you visit me on my death bed.\"\n\n\"It's Mom's week.\"",
              "id": 186,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 4,
              "content": "Listening to your kids wants and needs? Nyet",
              "id": 187,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 182,
          "content": "I can see why they got divorced.  OP is big on the power trips",
          "id": 188,
          "comments": [
            {
              "score": 9,
              "content": "And embracing the victimhood.",
              "id": 189,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 148,
          "content": "_\"No, my son doesn't get to decide who he gets to stay with and when and for how long.\"_\n\n_\"That's not his choice to make. He's 9 not 14.\"_\n\n_\"I don't want him to think that the first thing you when you face something scary is run to your mom and not your dad.\"_\n\n_\"FaceTime does count per the agreement she signed.\"_\n\nThis is 100% a powerplay for OP and he is intentionally being cruel to his kid and his ex. He makes it clear that he doesn't care how his kid feels or what his kid wants, and it sounds like OP knows that his son would rather be with his mom during his recovery. Sadly, OP is using this as a means to hurt his ex. It is an unforgiveable move to ban this child from seeing his mother when he is in pain and wants comfort, either in person or via a video call. This is just horrid, and hildren are smarter than we give them credit for. This kid will probably see right through OP's facade and will probably end up resenting him... If this child is upset by OP's selfish/callous behaviour, I hope that his mother goes back to court and they take this kid's feelings into consideration.",
          "id": 190,
          "comments": [
            {
              "score": 20,
              "content": "> \"I don't want him to think that the first thing you when you face something scary is run to your mom and not your dad.\"\n\nSo while the kid is recovering it will not only be stuck at his dads place knowing his mother is literally *banned* from visiting just because its not \"her day\" - *and* will need to appease his fathers wild mix of wanting to be close with his son with some toxic masculinity sprinkled in. \n\nThat kids gonna be in pain and feel like he needs to please his dads expectations for how exactly this should be father-son-bonding.",
              "id": 191,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 20,
              "content": "I hope OP gets dragged over the coals by a family court judge for this nonsense.",
              "id": 192,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "Oh maaaaann this is so true.  You can see it in his tone.  I get the desire to stick it to your ex, but damn your kid is 9, take it easy on the spite for a bit.",
          "id": 193,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 6,
          "content": "The only opinion his son has in the matter that he cares about is that he doesn’t want to shower with his mom or stepdad. Interesting that he cares about that opinion and it aligns with what he wants.",
          "id": 194,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 4,
          "content": "Honestly, I hope she takes him to court over this and gets visitation rights amended.",
          "id": 195,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1929,
      "content": "I think it most important to ask the son how and where he wants his recovery to be, so that he can be most comfortable. This isn’t about you or his mom. It’s about your fucking kid, dude. Let HIM decide",
      "id": 196,
      "comments": [
        {
          "score": 194,
          "content": "He doesn’t care!   He actually said, it doesn’t matter.",
          "id": 197,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1310,
      "content": "YTA\n\nNot for wanting him with you. If you have the time and means to take care of him while he recovers, that's not a problem. \n\nBut have you asked your son where HE prefers to stay during this time? A lot of kids prefer their mother when they are sick or hurt. That has nothing to do with how good a parent you are, that's just how it is. And if he is happy enough to stay with you, have you considered he might want or even need to also see his mum? \n\nNowhere in your post do you consider your son's needs and wishes, only your own. Can you not for 3 weeks set your on ego aside in the interest of your kid? Can you not arrange he stays with you, and set a few days and times where his mum can come over while you go do the shopping or whatever? If you don't want her alone in your home can you not ask a friend of family member to be in the house in a different room during that time?\n\nIf you don't care about your ex wife's feelings that's fine. But you are hurting you son if you don't take what HE wants into account. So ask yourself: is making your stand and your ego more important than the wellbeing of your son?",
      "id": 198,
      "comments": [
        {
          "score": 148,
          "content": "Even our dog prefers “mommy” when he’s sick.  \n\nYTA - ask your son what he prefers",
          "id": 199,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 974,
      "content": "YTA. Ever heard of the word 'compromise' before? He is having major surgery and you WON'T LET HER SEE HER SON? (Facetime does NOT count) Who do you think you are, just because he is scheduled at this time to visit you doesn't mean you get to dictate everything.",
      "id": 200,
      "comments": [
        {
          "score": 77,
          "content": "It seams so unnecessarily cruel",
          "id": 201,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 26,
          "content": "It’s not even that he won’t let her see her son, he won’t let a 9 year old see his mother while recovering from surgery. Won’t let him have a hug from his mum while he is in pain, that’s a special level of AH.",
          "id": 202,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 8,
          "content": "This guy probably equates compromise with weakness.",
          "id": 203,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    }
  ]
}