{
  "post content": "\nSo, I (f23) am a full time college student. Right now I'm living with my sister \"Claire\" and her husband \"Thomas\" while I get through my current semster.\n\n\nI don't work so I don't have everything I need for my daily skin/hair routine so I borrow stuff from Claire. Claire didn't have an issue in the beginning but then started complaining about me randomly walking into her room but I go in there looking for the stuff I asked for. She gave me a hard time just because I walked in on Thomas half naked to get the eye shadow I borrowed from her. and then that other time when I walked in late at night. She told me I nedded to get her permission to enter the room before I take anything but I figured this would make things complicated. It's enough that I have to ask to borrow an item.\n\n\nSo, last night at around 10pm I went upstairs and into her bedroom to grab the hair dryer. I walked it and woops, I saw them in an intimate position together in bed. I had NO IDEA they're were doing it, especially since Claire told me that Thomas has been feeling sick the past 2 days. She lashed out at me yelling that I get out. I quickly grabbed the hair dryer then walked out and shut the door.\n\n\nminutes later, She came downstairs in her robe and went off on me saying she was done with me repeatedly disrespecting and violating hers and her husband's privacy. I told her it was cool, no big deal. and that I needed the dryer but didn't have time to ask for permissin. She got even louder saying I had no business barging into her marital space and embarrassing her and her husband like this. I told her that I was sorry but she really overreacted to this whole thing. This made her more pissed she went on about how I'm living here rent free and yet not being respectable enough. I stopped arguing and went to my room.\n\n\nThis morning, Thomas left the house early amd Claire ignored me on breakfast. Still upset saying I don't get to say wether she overreacted or not and that my behavior was inappropriate. She even wants me to apologize to her husband for making last night \"awkward\".",
  "id": 1,
  "comments": [
    {
      "score": 47223,
      "content": "YTA - I am honestly baffled that you are even asking. She specifically requested that you not go into her room without asking. And you ignored that, because…you didn’t feel like asking. And then you validated her concerns by walking in on them.  How do you not see that you are in the wrong?",
      "id": 2,
      "comments": [
        {
          "score": 17434,
          "content": "[deleted]",
          "id": 3,
          "comments": [
            {
              "score": 6099,
              "content": "You said what I left unsaid. I am suspicious, too, but I tend to give the benefit of the doubt on here in case the person actually needs advice.",
              "id": 4,
              "comments": [
                {
                  "score": 5806,
                  "content": "deleted",
                  "id": 5,
                  "comments": [
                    {
                      "score": 1427,
                      "content": "This seems more likely, I agree.",
                      "id": 6,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 296,
                      "content": "This doesn't sound too unnatural to me. Some people grow up being taught \"what's yours is mine\" with their siblings, so as adults don't realize that they aren't just entitled to their family's stuff. And college students don't really need to be embarrassed about not working. \n\nI do see posts in this sub all the time that make me think it's a flipped post because the narrative is wrong, but I think this perspective is believable.",
                      "id": 7,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 34,
                      "content": "That’s exactly what I thought: not necessarily fake but not written by the sister they say they are. The wording and detail of the post make it so clear that OP is in the wrong and that her sister has perfectly valid reasons for being upset. She goes into more detail about how the sister feels than how she feels, which makes sense if she IS the sister.\n\nIf this is the case, I doubt hearing this same story from the actual OP would change my judgement much, but it could paint the story in a different light. Younger sister is the AH for barging in the room, older sister is at least a bit of an AH for going to Reddit with a biased and flipped story just to prove a point.",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2131,
              "content": "Unfortunately there are a lot of people like this. My husband and I let my younger brother live in our home for a while and he claims we traumatized him. How, you may ask? We talked to him about how our water bill had almost doubled since he moved in and could he please stop taking 45 minute showers. Our infant’s crying was really hard for him to deal with. And my favorite, I went off on him because he changed the oil in his car, then left the full oil pan, along with oily rags, in our basement, near the furnace. So yeah, people can be this rude and oblivious.",
              "id": 9,
              "comments": [
                {
                  "score": 799,
                  "content": "My brother was a 100 times worse than that but I don't think this comment section is prepared for the novel I could write about him. Some people really are this selfish and think they're entitled to everything and anything they want.",
                  "id": 10,
                  "comments": [
                    {
                      "score": 399,
                      "content": "I’m interested. \n\nI have family living with my wife and I, make me appreciate them please.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 24,
              "content": "Having lived with this type of boundary-less person, I can believe it.",
              "id": 12,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 23,
              "content": "Oh, people are like this. My ex's sister lived with us and would do this ALL THE TIME. We finally started locking it but then she'd stand outside and bang on it until we finally gave in and answered. It was absurd. I was beyond ecstatic when she moved out. \n\nYTA OP.  Nobody should even have to ask you to ask permission before entering someone's personal space. My kids knew this rule at 3 years of age. You are, purposefully, barging in and you know it. Start acting like a grown-up and ask permission or, even better, learn to freaking knock. What BS.",
              "id": 13,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 690,
          "content": "Especially because she walked in on them and instead of immediately closing the door and running away, OP *kept going* into the room to get the hair dryer. OP seems to have trouble with normal social boundaries and acceptable behavior. YTA, to a worrying degree",
          "id": 14,
          "comments": [
            {
              "score": 44,
              "content": "I'm extra confused at \"I didnt have time to ask.\" Like wtf was she doing at 10pm that she never had time to ask?",
              "id": 15,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 30,
              "content": "Yeah, this one had me wanting to scream : Can't you just knock like a normal person??? I mean, I had this conversation with my brother when I was like 12 and going through puberty and I didn't want him to come into my room while I was changing. I was 12, he was 10. The sum of our ages didn't add up to 23... massive YTA ...",
              "id": 16,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 88,
          "content": "The worse is, she still went into the room to get the hairdryer 😂she wasn’t even embarrassed to walk in on them like that.",
          "id": 17,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "More importantly who walks into someone’s bedroom at 10pm when they’re home?\n\nCommon sense is to KNOCK first….I would have kicked you out for sure",
          "id": 18,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 15192,
      "content": "YTA, you are **always** TA if you walk into someone's room without knocking and getting permission to enter.",
      "id": 19,
      "comments": [
        {
          "score": 5607,
          "content": "And then even after being told to get out, OP still walked over to grab the hair dryer while her sister and BIL were still in a compromising position.",
          "id": 20,
          "comments": [
            {
              "score": 3231,
              "content": "That's the creepiest part. It's almost as if she enjoyed embarrassing them or didn't mind watching. Super fucking weird.",
              "id": 21,
              "comments": [
                {
                  "score": 1537,
                  "content": "Okay, glad I’m not the only one thinking that OP likes making people uncomfortable and violating boundaries",
                  "id": 22,
                  "comments": [
                    {
                      "score": 554,
                      "content": "I was thinking OP just doesn't see other people as people.",
                      "id": 23,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 126,
                      "content": "Or maybe is hoping to see the husband in a state of undress? Whatever the reasons, I'd put her out on her ass.",
                      "id": 24,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 24,
                      "content": "I feel like she wanted to ogle her BIL...for unknown motives.",
                      "id": 25,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 21,
                      "content": "I am starting to think OP posted here specifically to see people cringe.",
                      "id": 26,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 35,
                  "content": "I got this vibe too, like she enjoys walking in on them or is one of those people who enjoys violating boundaries or making people uncomfortable.",
                  "id": 27,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Yeah - hopefully the husband left early this morning to swing by the hardware store to get a lock for their door.",
                  "id": 28,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 18,
                  "content": "Yea to me it almost seems like she WAS trying to walk in on them or at least the husband anyway.",
                  "id": 29,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 35,
          "content": "YTA.  Who walks into a couples room at 10pm without knocking and then continues after they realize they made a massive error unless they wanted to shut the sex time down.  You should be given walking papers.",
          "id": 30,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "Hell, even if the door is wide open, I'll usually say *something* to announce I might come in. Knock on the door frame, say their name, ask to come in, do a little dance, *something.* And if they make no signal for me to enter, *I don't enter.*",
          "id": 31,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 10366,
      "content": "\"She told me I nedded to get her permission to enter the room before I take anything but I figured this would make things complicated. It's enough that I have to ask to borrow an item.\" \n\nIt's not about you - she established a very reasonable boundary and you refuse to adhere to it. People are allowed to dictate who enters their personal space. \n\nYTA",
      "id": 32,
      "comments": [
        {
          "score": 2198,
          "content": "All of this. \"She told me exactly what I need to do, but I decided I'm not going to do it...\" The generosity of OP's sister to continue allowing OP to live there and still use her belongings is incredible.\n\nYTA",
          "id": 33,
          "comments": [
            {
              "score": 506,
              "content": "I hope sis kicks her out for repeatedly barging in. I would have soooo much anxiety living with her. YTA, you don't deserve the kindness of your sister.",
              "id": 34,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 203,
              "content": "I have a feeling the silent treatment means the generosity won’t be extended much longer. My sister is 12 years older than me and was married with a baby by the time I was in middle school. Somehow at 11 years old, I knew without being told not to go into her personal space without permission. Finger crossed this is fake.",
              "id": 35,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1469,
          "content": "I feel like we're all glossing over the statement \"it's enough that I have to ask to borrow an item\" too easily. \n\nThat sentence is *dripping* with entitlement, like she thinks it's a fucking inconvenience that she has to ask permission to use her sisters shit\n\nI literally stopped reading for a sec to make sure I was understanding that statement correctly. \n\nOP, you're absurdly entitled and obviously YTA",
          "id": 36,
          "comments": [
            {
              "score": 231,
              "content": "[deleted]",
              "id": 37,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 129,
              "content": "No. Not glossing over it. I also had look up when I read that. The embarrasment OP isn't feeling its sitting like a brick in my stomach.",
              "id": 38,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 37,
              "content": "This is what got me -- like, YEAH, you should be asking!!!! It's NOT YOUR STUFF!!!",
              "id": 39,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 27,
              "content": "Since OP is \"borrowing\" stuff - in my world, you have to return the stuff you borrow. I don't think OP plans on ever even thanking her sister for basically providing her with all the skin care products she needs.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 21,
              "content": "That's the first thing I thought of too, like obviously you have to ask to borrow an item! If you don't get permission to borrow an item then it's not borrowing, it's stealing!",
              "id": 41,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 23,
          "content": "Fr. You have to ask because the items aren't yours and you aren't entitled to them. Get a fucking job and get your own shit if it's that inconvenient. YTA",
          "id": 42,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "OP, you need to buy your own shit. I'm sure you have some spending money from somewhere. Budget some of it for functional products that you can afford. \nThere's literally no reason to borrow make up when you could get a $20 palette and have it for months, just with limited color options. Same with all the other stuff. Get products that are functional, not luxury. Ffs, you can buy a hair dryer pretty cheap too.",
          "id": 43,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 5918,
      "content": "Cant you fucking knock?\n\nEdit: if most of us believe she is A why there are 1600 comments",
      "id": 44,
      "comments": [
        {
          "score": 2014,
          "content": "At ten pm she shouldn’t be knocking. I can’t imagine a life or death hairdryer situation.",
          "id": 45,
          "comments": [
            {
              "score": 811,
              "content": "Apparently someone is really selfish and need the hairdryer immediately",
              "id": 46,
              "comments": [
                {
                  "score": 673,
                  "content": "I 100% believe that the hair dryer was just the excuse to walk in on her sister and husband.",
                  "id": 47,
                  "comments": [
                    {
                      "score": 281,
                      "content": "YTA OP.\n\nMaybe OP has a little crush on the BIL. Maybe her sis needs to consider kicking her out.",
                      "id": 48,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 85,
                      "content": "This would be a pretty insane thing to do though, I can’t imagine an outcome from this that doesn’t involve OP eventually being asked to move out or banned from using her items.",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 20,
                      "content": "for sure. she’s a fucking creep.",
                      "id": 50,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Yes! And she walked in on the husband dressing before that. I def think it was on purpose. And to her it was like no big deal, does she watch people have sex all the time?! Now she’s used to it lol",
                      "id": 51,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 325,
              "content": "She still got the dryer. She walked in on them boning THEN quickly got the dryer and left...what the actual fuck 😂",
              "id": 52,
              "comments": [
                {
                  "score": 38,
                  "content": "Oh man I didn’t even really register that. That’s straight up depraved lol",
                  "id": 53,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 18,
          "content": "She \"doesn't have time\" she's super busy with not having a job (or needing to pay rent) and her hair is not as dry as she needs it to be, immediately",
          "id": 54,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4409,
      "content": "YTA. Omg so badly the AH. \n\nYou're lucky enough to be housed by your sister and her partner rent free, and get to use her things for free!!! \n\nAnd you can't even respect the rules that you're not allowed in their bedroom.\n\nI'd have kicked you out for your entitled behaviour.",
      "id": 55,
      "comments": [
        {
          "score": 463,
          "content": "Right! YTA OP. I would probably kick you out at this point. Don't be surprised if your sister tells you that you need to find somewhere else to live.",
          "id": 56,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 111,
          "content": "I'm surprised that her sister haven't kicked her out yet. OP sounds creepy and perverted.",
          "id": 57,
          "comments": [],
          "relation": "Attack"
        },
        {
          "score": 18,
          "content": "OP is just taking a big old dookie on her sister’s and her sister’s husband’s boundaries. \n\nHey OP, here’s a thought: since you’re living there free, which is saving you money, how about you use some of that money to get your own shit. Or will that wont do because if you get you’re own stuff you wont be able to use “I was just getting my sister’s stuff” as an excuse to to see your sister’s husband naked anymore? \n\nYTA",
          "id": 58,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 3429,
      "content": "YTA for everything, but especially for walking in on them being intimate and STILL GRABBING THE HAIRDRYER before you left. That’s the point of no return when it comes to not thinking about anyone but yourself",
      "id": 59,
      "comments": [
        {
          "score": 785,
          "content": "So glad somebody called this out! She walked in on them AND KEPT GOING. YTA OP",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 176,
          "content": "Part of me thinks she wants to bang her brother in law or it's a total troll.",
          "id": 61,
          "comments": [
            {
              "score": 62,
              "content": "Or was the golden child that never ever learned boundaries. I have met a couple people like this but usually they end up in therapy because they destroy all their relationships with their behavior",
              "id": 62,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 21,
          "content": "I thought this same thing too.",
          "id": 63,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 17,
          "content": "Right??? Lol! No sense of decency at all!  Still grabbing the hair dryer and even wondering why they are doing anything while he’s sick lol",
          "id": 64,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 2503,
      "content": "This is so embarrassing to read! You’re 23 years old. A grown ass woman living for free and you can’t even respect what you’re sister asks of you? YTA and a leech.",
      "id": 65,
      "comments": [
        {
          "score": 404,
          "content": "But she's a *full-time college student*, how could she possibly have a job?! /s",
          "id": 66,
          "comments": [
            {
              "score": 381,
              "content": "“It’s already bad enough that I have to borrow her stuff. Now she wants me to ask permission to go get it, too??”",
              "id": 67,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 32,
              "content": "I wonder if she's even bothered to lift a finger to search for college living options. I seriously doubt she has.",
              "id": 68,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 30,
          "content": "And a creep too.",
          "id": 69,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1371,
      "content": "Info: when are you being told to move out by?",
      "id": 70,
      "comments": [
        {
          "score": 122,
          "content": "No kidding",
          "id": 71,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 28,
          "content": "Honestly. I hope sis reads this too & kicks OP the fuck out.",
          "id": 72,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1247,
      "content": "YTA, I wouldn’t dream of walking into my child’s room without getting permission, let alone a couples room. You’re living with them for free, sponging your sisters skin care and walking in unannounced? The YTA trifecta, plus thinking she overreacted? I’d be looking for another apartment because, times up on this one.",
      "id": 73,
      "comments": [
        {
          "score": 29,
          "content": "props to you for respecting your child's privacy my parents could learn from you",
          "id": 74,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 1082,
      "content": "Yes, YTA.\n\nThis is not your house.  You are living, rent-free, with two married adults.  You don't borrow shit without asking, and  you do *not* violate their ONE private space in the whole damn house.  You lack a significant amount of boundaries.  You and your sister are not teenagers living under your parents' roof and jacking each others' belongings anymore.  Learn to be respectful of space that you have absolutely *no claim to* or you'll probably find yourself homeless.",
      "id": 75,
      "comments": [
        {
          "score": 80,
          "content": "Exactly this. OP and sister are grown ass adults and aren't living with their parents anymore. OP needs to act like it.",
          "id": 76,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "I would add that even if it were OP's house and sister and hubby were living with OP,  she should still knock before entering their room!",
          "id": 77,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    }
  ]
}