{
  "post content": "Hiya Reddit! I made an account for the sole purpose of asking this so here we go!\n\nI rent an apartment with 3 other people. They’re awesome and I have no qualms living with them except for this one thing.\n\nI have a few guinea pigs in my room that are my beloved pets. They have a super cool custom enclosure that I designed myself. My roomies are cool with the piggies... a little too cool with them, actually!\n\nMy roommates had a bad habit of taking my guinea pigs out without permission. Sometimes I would come into my room to find one of my roomies hanging out with the pigs. Which is all fine and dandy, but it kinda bothered me that they didn’t ask me first. They would also take them out when I wasn’t home home or take them out to show guests.\n\nI had no problem with my roommates wanting to interact with my pigs, but I wanted them to ask me first. I told them this and they didn’t really listen, and continued to play with my piggies without asking me. I asked them several more times to please not take the pigs out without asking or letting me know, especially when I wasn’t home. Didn’t work.\n\nI decided to put my foot down. I now have a lock on my bedroom door and don’t let my roomies interact with my guinea pigs anymore. They started asking me politely if they could see them/started asking permission, but imo too little too late. I have effectively banned my roommates from seeing the guinea pigs.\n\nMy roommates are pissed and this has caused a huge rift between us. They are arguing that they “share” their pets (which is true — I frequently hang out with the cats in the household), and that they have a bond with my guinea pigs. They say it is unfair of me to ban them since 1) they now love the piggies and 2) they don’t ban me from playing with their pets.\n\nI understand that my piggies are lovable but I had to put my foot down! I gave them the chance to just ask me and they didn’t respect that. \n\nMy friend group has been calling me a jerk, saying I’m being rude and creating unnecessary drama, and they are siding with my roommates.\n\nIn retaliation, I am now banned from interacting with the cats in the house which sucks but whatever. \n\nMy roomies and friends say I’m a grade A asshole and should lift the pig ban so that the house isn’t a tense dramafest but I’m not budging. It’s created such a horrible atmosphere in the apartment that being home sucks.\n\nAITA, Reddit?",
  "id": 1,
  "comments": [
    {
      "score": 59,
      "content": "ESH.  Going into your room and not asking isn't cool, you fixed the problem with the lock.  It really should have ended there.  They would need to ask, and then you could either okay it or decline.  Banning them from all interaction with your pets and causing house drama was unnecessary.",
      "id": 2,
      "comments": [
        {
          "score": 52,
          "content": "Wait what? Remove the fact that the piggies are pets, if we had OP here saying they have an issue with their housemates coming into their room and taking their property out and using it, going in and showing random guests op's stuff we'd be telling them to put a lock on the door and look to move out. \n\n\nThis is no difference. They are no entitled to the guinea pigs. They under the law are considered the property of op and they have abused that trust. \n\nNTA Op",
          "id": 3,
          "comments": [
            {
              "score": 1,
              "content": "So animals aren't just property, until it's convenient?\n\nAlso, OP can be right and still an asshole. Yes, he had to put his foot down to get his point across. Now, he's just being an asshole. And the only ones suffering are his guinea pigs.",
              "id": 4,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 36,
      "content": "ESH\nThey're wrong for not asking, but you've also already solved the problem. So continuing to drive this wedge in serves nobody.",
      "id": 5,
      "comments": [
        {
          "score": 1,
          "content": "why? why should she trust them with her pets when they have proven that they don't give a fuck about what she as their owner wants? \n\nLike, they are literally only asking now because they HAVE to not because they respect OP which is a pretty fucking bad sign and poor form on their part to say the least.",
          "id": 6,
          "comments": [
            {
              "score": 1,
              "content": "I already answered in my original reply.",
              "id": 7,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 28,
      "content": "NTA. They should've asked permission, as you requested. However, now that you've made your point, lift the ban. Leave the lock, though, because they don't really need to mess with them if you're not there. If you want to continue to room with these guys, you're going to have to meet in the middle somewhere.",
      "id": 8,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 20,
      "content": "ESH. They shouldn't be in your room.\n\nBut seriously if they're good with the piggies, ease the hell up. I had GPs for years and they're sturdy little critters who adore attention, and it sounds like your roomies love them back. And you come off sounding like you love the wrong kind of attention and are jealous that your pets get love from anyone but you. Not healthy.\n\nAnd listen, good roomies are are to find. Like, leprechaun riding a unicorn hard to find. Do you really want to screw this whole thing up (because you really, really are) over your piggies getting love and attention from other people?? Move the cage to the living room and knock off the power trip.",
      "id": 9,
      "comments": [
        {
          "score": 8,
          "content": "Can’t move the piggies because of the cats :(\n\nThank you for the input.",
          "id": 10,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 1,
          "content": "They aren't good room mates.\n\nThey can't be expected to do basic ass shit like not go into OPs room and miss with her animals without her permission.\n\nThey suck.",
          "id": 11,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 13,
      "content": "I mean technically I'm going NAH here. It's your right to do what you want with your pets, and theirs to do with their pets. But is this really a hill worth dying on? If they're willing to ask your permission first now, it seems like going forward they understand and will abide by your boundaries. It's tough to find roommates you get along with, this sure doesn't seem like a fight worth having to me.",
      "id": 12,
      "comments": [
        {
          "score": 3,
          "content": "The safety and well-being of a pet is *absolutely* a hill to die on. They're also in OP's room without permission when they aren't even home which is a huge deal-breaker for most roommates. Edit: OP has confirmed the cats are a safety issue in the comments.",
          "id": 13,
          "comments": [
            {
              "score": 18,
              "content": "where did OP say their pets were unsafe?",
              "id": 14,
              "comments": [
                {
                  "score": -2,
                  "content": "I think my mind goes there because of their size / likelihood to get hurt over a cat or dog. If there are cats in the house, it's very possible for an accident to happen if the door or enclosure is left open. If I was OP I imagine I would be anxious wondering whether everyone forgot to close the cage, etc, when out. Either way, I wouldn't be comfortable with my roommates habitually going in my room without permission - especially when I'm not home. To me that makes them the assholes, regardless of the pet situation.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 10,
                      "content": "this sounds incredibly paranoid. OP gave no indication the other animals in the house posed any type of threat.",
                      "id": 16,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 10,
      "content": "are they harming the animals? are they mistreating them? are they stressing them out? are they over feeding them or feeding them things that are or could be bad for them?\n\nif no to all of these things then what's the issue? animals - especially ones that live in cages - need interaction. and that's exactly what it sounds like your roommates were providing. now they're locked alone in a room where the people who used to spend time with them and play with them can't see them.\n\nESH because sure, whatever, if they're in your bedroom then that's your personal space. but if they're not mistreating them in any way then all you're accomplishing here is depriving your animals of necessary human and animal interaction.",
      "id": 17,
      "comments": [
        {
          "score": 1,
          "content": "Thank you for your input. Rest assured my piggies get lots of human interaction regardless, but I see where you are coming from.",
          "id": 18,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 4,
      "content": "Refusing to let them see the guinea pigs is petty, but not as petty as your roommates are being. Like, it's not their pet, they need to grow up.\n\nI feel like what you're doing is kinda mean, but you're still NTA.",
      "id": 19,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "YTA for letting it get this far. You sound petty as fuck and its weird that you're willing to let your pets get so much less socialization due to your issues. \n\n\nI'm also very close with my friends and wouldn't really care about them being in my room to play with my pets though.",
      "id": 20,
      "comments": [],
      "relation": "Attack"
    },
    {
      "score": 2,
      "content": "NTA.  If they want to play with guinea pigs whenever they want, they should get their own.",
      "id": 21,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 2,
      "content": "INFO. What type of permission were you looking for here? An ask if it's ok to do in general and they can do it at their leisure after you say ok, or were you actually expecting to be asked for permission every single time they wanted to hang out with the pigs, even when you are not home? If you were not home, were you expecting a text every time? A call? Also, was there something they did that made you not trust them with the pigs? Any sort of issues like forgetting about them and they got into things they shouldn't have?",
      "id": 22,
      "comments": [
        {
          "score": 10,
          "content": "Well... asked for permission every time, because I don’t really like people in my room randomly.\n\nOnly safety concern is the cats since roomies aren’t careful to close the door and make sure the cats can’t get in the room when the pigs are out, though I have reminded them it’s not safe for the cats to be around them.",
          "id": 23,
          "comments": [
            {
              "score": 5,
              "content": "Needing to be asked for permission every single time makes me think that you are just not ok with it; sounds like there are trust issues. It seems like you are concerned with them being in your room and for the safety of you pigs. Therefore, I would tell them that they can only interact with the pigs when you are home. If they don't like it and continue to push the issue, you might want to consider a different place to leave the next time your lease is up.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "No"
        },
        {
          "score": 3,
          "content": "That’s exactly what I would want.",
          "id": 25,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}