{
  "post content": "\nI am (25f) deeply connected to my childhood years and I consider them the best years of my life so far. My toys are the pride of my childhood.\n\nMy family house (owned by father) was rented out by my uncle which is okay for me as I live overseas and I am sincerely happy someone is residing currently and looking after the property. Issue being he did not provide notice and moved my belongings without my input. **EDIT** To clarify the living situation, the house is partitioned into 3 spaces within the one building, my grandma living in one, my uncle in another, and myself and mum living in the last before we moved out, and the whole house including the 3 spaces is owned by my dad. My uncle had no authority to rent out my place and if he did so at least he should have done a proper job respecting my items. Mind you I am not getting a single penny for my house being rented out. The rental happened in secret and I could no longer return to gather my stuff as I was waiting for citizenship. Property belongs to my father and he did not consent to the rental at all. We all considered our family home as our safe place left unattended we would eventually return to.\n\nIssue being.. my uncle left my childhood toys in the rented out family house **with strangers**. As a result my toys were lost overtime. His excuse ? Not enough room. I told him if one wants to make room they can. My family are hoarders they have so much trash. I said if it was your stuff you would go above and beyond to keep them safe. \n\nPeople who transferred my stuff  are my mother and uncle. At that time I was overseas and was not allowed to go back home for bureaucratic reasons. My mother assured me she did not throw anything out and could not enter our family house as strangers were residing at that time and did not want to disturb them. My uncle admitted he left my stuff under my old bed and asked the tenants if the stuff bother them. They said no. But since then many tenants have changed. \n\nI was heartbroken and kept crying hysterically looking through storage rooms, under some stairs and a seperate room. It did hurt me that my stuff were not in a single place but rather scattered here and there. I felt like I was tirelessly collecting my pieces trying to reclaim control and keep my cool at the same time. \n\n I was relieving past trauma as years ago my step mother tore apart childhood photos which included my mom. I wasn’t present at that time. I found out when I last visited my family house. All my photos and even baptism pictures were placed in a little hole at the back of the house. It’s not an attic. (It’s legit just a hole at the back of the house that’s far far up. I had to climb there like a cat). That’s really bad as the moisture can severely damage my belongings. That happened years ago and again I was tirelessly collecting my pieces together. The hole where the pictures were placed is not safe at all to reach as one can easily fall and break their bones. I felt excluded from my own family. My dad did nothing to stop this. He has poor boundaries and wants to please the new wife.\n\nThis happened ages ago with my pictures  and now my toys..\n\nIt is not easy to travel to my family house as I literally have to travel 20 hours. Last time I visited the house was not rented out yet and my childhood toys were still under my bed. I wish I made room to take them with me at that time.\n\nSo AITA for trying to negotiate with my uncle to pay for my lost toys?",
  "id": 1,
  "comments": [
    {
      "score": 23,
      "content": "> I said if it was your stuff you would go above and beyond to keep them safe.\n\nWise words that you should have heeded yourself. If something's important for you, make sure to keep them safe, not in a place you cannot control.\n\nNAH.",
      "id": 2,
      "comments": [
        {
          "score": 1,
          "content": "They were safe stored properly in one place under my bed before I knew my place would be rented out. The rental was unexpected and happened while I was overseas without my authority but my uncles. Place is legally owned by my father and my father did not consent to the rental. This was a safe place to one day return to. Everyone in life has some place they don’t visit as often where they keep valuables. That was mine. How is that different from everyone else’s? I have changed countries but that is still my home where I grew up.",
          "id": 3,
          "comments": [
            {
              "score": 2,
              "content": "They evidently weren't safe.",
              "id": 4,
              "comments": [
                {
                  "score": 2,
                  "content": ":( sadly. That is not something I could possibly foresee.",
                  "id": 5,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "How old were you when you moved out?",
              "id": 6,
              "comments": [
                {
                  "score": 0,
                  "content": "I was 18. I had to remain in the new country several years before gaining citizenship.",
                  "id": 7,
                  "comments": [
                    {
                      "score": 3,
                      "content": "But did you move out because you were old enough and wanted your own life? Or did you move for some other reason? Either something beyond your control or study?",
                      "id": 8,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 8,
      "content": "I don't think you are the asshole, but paying for them won't achieve anything. I don't know if they really didn't care about your stuff or not, maybe they just forgot or didn't think it was a big issue. I get getting attached to something from your childhood, but if you didn't express your interest to protect these toys at the time, there is little you can do now. I will say, however, that destroying pictures and hiding them is a very asshole and childish move from your step mother, and to me that is miles worse than just forgetting about some toys that they left in the rented house.",
      "id": 9,
      "comments": [
        {
          "score": 2,
          "content": "Thank you for your compassion.",
          "id": 10,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 6,
      "content": "Unfortunately, it really is your responsibility to make sure your important items are stored properly where they couldn't get lost or damaged, and not expect to leave them with family for an indefinite amount of time. But, I am not going to call you the AH because life gets the better of us sometimes and it is clear that you have been dealt a lot of abuse by some of the adults in your life.\n\nI hope you are able to salvage as much as possible and are able to find a safe place to keep what you can. NTA",
      "id": 11,
      "comments": [
        {
          "score": 4,
          "content": "I didn’t leave my stuff with family. House was unattended and my uncle randomly decided to rent it out without our input. Property belongs to father and father was furious. This was our safe space for one day to eventually return to. Thank you for your compassion tho. It hurts and I hope to create my very own safe space.",
          "id": 12,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": ">it really is your responsibility to make sure your important items are stored properly where they couldn't get lost or damaged, and not expect to leave them with family for an indefinite amount of time.\n\nIf someone agrees to store something for you, why isn't that fulfilling your responsibility to make sure they're properly stored where they can't get lost or damaged? If a family member agrees to store something for a relative and they don't set an end-date on that, it's the responsibility of the family member to inform the relative if/when they need to move things, with a reasonable notice period.",
          "id": 13,
          "comments": [],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "NTA but sounds like you and your dad have good reason to sue your uncle. He made money by renting something that was not his, without the owner’s consent.  The money he made as well as any damages (which would include your missing toys) should be paid for by him.  Uncle is the AH here.",
      "id": 14,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 4,
      "content": "I don't comment super often on these but i disagree with almost every comment I've seen here. NTA at all. I do agree that money won't \"solve\" anything as it cannot replace the memories, etc. but that doesn't mean it isn't an appropriate solution. Your uncle broke into the home OWNED BY YOUR FATHER and rented out the space without your father's permission. Anything that occurs as a result of that is his fault and responsibility. If a teenager throws a party at their parent's house without permission and several memorable keepsakes were misplaced or stolen by attendees, I have no doubt everyone would agree that the teenager should face consequences. While there is little expectation for safety with an unattended house for a long period of time, there is the expectation that your uncle would not rent out a space he has no authority to rent and make money off it. Even if it was a simple case of theft by a stranger, they would still be responsible for the monetary value of the stolen items. I'm very sorry you lost your childhood toys, I hope that there are enough of your childhood belongings remaining for you to cherish and protect. While it isn't your fault this happened, I urge you to better secure the remaining items you may have, seeing as you cannot trust some of your family.",
      "id": 15,
      "comments": [
        {
          "score": 3,
          "content": "Thank you for your compassion and understanding. Most comments carry the logic of “thieves broke into the home? YOUR FAULT.” I am trying not to take it seriously. I know my situation better and I know most people here would change their minds if this happened to them. I found one item which is my first toy, an electronic pc toy called “alphabyte” Oregon scientific. Thankfully most of my family photos are intact so I will try to take most stuff with me on the plane and sent the rest by post. I will try to reclaim my identity one way or the other. Take care and thank you again for taking the time to better understand. You are a decent person.",
          "id": 16,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 3,
      "content": "INFO: Who actually owns the home? You say it’s a “family home” and then later it’s “my house”.\n\nEdited to add judgement: NTA for being upset but asking for money isn’t going to replace the memories.",
      "id": 17,
      "comments": [
        {
          "score": 2,
          "content": "It’s my dads legally speaking. My dad was unhappy our place was rented out and this happened in secret without his input. Had I known beforehand the place would be rented out I would have taken my toys. My uncle even promised that nobody would enter my room and it would be locked away not to be accessed by tenants.",
          "id": 18,
          "comments": [
            {
              "score": 1,
              "content": "So you left things in your dad’s house that got lost or damaged in the years you were away. That part makes sense now. \n\nDoes your dad not live in his house? How was in rented in secret???",
              "id": 19,
              "comments": [
                {
                  "score": 2,
                  "content": "My dad lives overseas too. Different country. \nMy uncle (dads brother) rented it out in secret as in my dad was unaware. When I found out my uncle reassured my room (where I kept my belongings) was out of reach from the tenants. I hope this clarifies things, apologies it sounds confusing my fam story is complicated.",
                  "id": 20,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Gotcha.\n\nOkay, so you have every right to be upset about the toys. But getting money from your uncle won’t replace the memories you made with those toys. It sounds like your dad’s house was basically abandoned, since no one noticed that your uncle was renting it out, and the toys weren’t locked up. Anything could have happened to them at any time after you left.",
                      "id": 21,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 2,
      "content": "NTA. People who are commenting on this about how it's 'your responsibility' to make sure that your items are properly stored seem to be missing the part where the homeowner allowed you to leave your items there in storage, and then another tenant essentially illegally rented your separate unit out. Take away the family labels and what happened was that someone broke into the space that was still essentially reserved for you and your mother and rented it out, and your belongings were damaged/stolen. Has your dad demanded that your uncle pay him the rent he was making off of his property?\n\nI do agree with the comments about how you're not likely to actually get proper compensation for these items, though. I'm sorry about that, but sentiment doesn't come with a price tag.\n\nBTW, it seems like your mom doesn't want you to do anything about it because she helped move it, and if you can just forgive your uncle and let it go, then she doesn't have to feel guilty for her role in things. She's trying to avoid her own culpability by telling you you'd be TA to pursue this.",
      "id": 22,
      "comments": [
        {
          "score": 2,
          "content": "Ugh yes, I came back to this post to check if anyone had any sense in the comments this time and I'm so glad to see at least one person taking the information provided about property ownership into account. I almost never comment on these sorts of posts, I tend to lurk but I was so frustrated that so many people jumped on OP about how they shouldn't expect the items to be protected when they didn't! They simply expected that, should no illegal actions occur regarding their father's property and the items left there, that they would remain there because the property is unattended but owned by someone they could trust. It is insane to blame someone for the illegal actions of another person who had no right or authority to enter the residence, rent it out, or allow anyone to touch OP's belongings. While it is true that OP should not expect total protection, it would be entirely reasonable to expect that their uncle would not have done the things that he did and to hold him accountable for any damages (unfortunately, only for the monetary value of the items, despite their sentimental value) that occurred as a result of his ILLEGAL ACTIONS.",
          "id": 23,
          "comments": [
            {
              "score": 1,
              "content": "I can maybe part-way excuse some of the earlier ones, because prior to the edit it sort of reads like it’s the uncle’s house (although even if it were, if he’d given OP permission to store stuff there indefinitely, he should have taken more care with it when it was time to move). But once OP clarified the situation, it’s weird that some people decided to dig their heels in that OP must be in the wrong and kept jumping on her for it.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1,
      "content": "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Action took “Demanding for monetary compensation for the stress involved and the value of my toys that were lost” why I think I will be judged negatively ? “My mother would be so mad at me because she wants to keep the peace with everyone and is telling me I am overreacting over some toys.” My uncle did not have a very positive response to my suggestion. He insists he did not lose my belongings.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
      "id": 25,
      "comments": [],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "ESH - Yes, you shouldn't have left them after the pics were holed away.  Your uncle was negligent, true but you had a hand as well by not securing them when you realize what happened to the pics.  And what compensation are you looking for something that is truly irreplaceable?",
      "id": 26,
      "comments": [
        {
          "score": 1,
          "content": "I could not realistically take everything with me \n:( only the pictures were affected I did not think my toys would be one day too because no one touched them at that time.",
          "id": 27,
          "comments": [],
          "relation": "No"
        }
      ],
      "relation": "No"
    },
    {
      "score": 1,
      "content": "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nI am (25f) deeply connected to my childhood years and I consider them the best years of my life so far. My toys are the pride of my childhood.\n\nMy family house was rented out by my uncle which is okay for me as I live overseas and I am sincerely happy someone is residing currently and looking after the property. \n\nIssue being.. my uncle left my childhood toys in the rented out family house **with strangers**. As a result my toys were lost overtime. His excuse ? Not enough room. I told him if one wants to make room they can. My family are hoarders they have so much trash. I said if it was your stuff you would go above and beyond to keep them safe. \n\nPeople who transferred my stuff  are my mother and uncle. At that time I was overseas and was not allowed to go back home for bureaucratic reasons. My mother assured me she did not throw anything out and could not enter our family house as strangers were residing at that time and did not want to disturb them. My uncle admitted he left my stuff under my old bed and asked the tenants if the stuff bother them. They said no. But since then many tenants have changed. \n\nI was heartbroken and kept crying hysterically looking through storage rooms, under some stairs and a seperate room. It did hurt me that my stuff were not in a single place but rather scattered here and there. I felt like I was tirelessly collecting my pieces trying to reclaim control and keep my cool at the same time. \n\n I was relieving past trauma as years ago my step mother tore apart childhood photos which included my mom. I wasn’t present at that time. I found out when I last visited my family house. All my photos and even baptism pictures were placed in a little hole at the back of the house. It’s not an attic. (It’s legit just a hole at the back of the house that’s far far up. I had to climb there like a cat). That’s really bad as the moisture can severely damage my belongings. That happened years ago and again I was tirelessly collecting my pieces together. The hole where the pictures were placed is not safe at all to reach as one can easily fall and break their bones. I felt excluded from my own family. My dad did nothing to stop this. He has poor boundaries and wants to please the new wife.\n\nThis happened ages ago with my pictures  and now my toys..\n\nIt is not easy to travel to my family house as I literally have to travel 20 hours. Last time I visited the house was not rented out yet and my childhood toys were still under my bed. I wish I made room to take them with me at that time.\n\nSo AITA for trying to negotiate with my uncle to pay for my lost toys?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
      "id": 28,
      "comments": [],
      "relation": "No"
    }
  ]
}