{
  "post content": "My boyfriend(32m) and I(35f) have been together for 1 year. I haven't got any kids. He has got a 4-year-old son who lives with his mom(my bf's ex). My boyfriend fetches his son every weekend. He has recently introduced me to his son. We get along really well. He's sweet & very talkative. \nI have helped raise my nieces & nephews, so I think that I  am good with kids. I don't believe in hitting kids. We talk things through. This has been my approach with my bf's son, too.\n\nHe is always up to something, taking things apart or pressing buttons, but that's because he's curious. I always speak to him calmly & have started explaining things to him. So now, he asks me questions like, \"What does this do?\" \"What is this?\", and we explore things together (less things being broken). \n\n I recently received a call from the mother of my boyfriend son, a⁸sking me to stop using all these \"new age phrases\" on her child. She said that my \"funny things\" are interfering with her parenting style. Apparently, the boy said, \"Don't shout, Mommy. Speak soft like Auntie.\" He also said,\"ok. take a deep breath, mommy, \" whenever she would raise her voice at him. At first, I told her that I wasn't trying to interfere with her parenting style, but that that is how I deal with children. She told me to \"go make my own kids and then teach them shit.\" That hurt me, and I told her that maybe her parenting style needs an update. \n\nNow, she refuses to let the child be around me. She is starting to refuse my bf access to his son because of my interference. My friend thinks that I shouldn't have told her that her parenting needs an update & let my bf handle this instead. I feel terrible. Am I the ass hole?\n\nEdit: \nJust an update. My bf & I are moving in together, so we had to resolve this. The three of us had dinner together and talked things through. I apologised for telling her to upgrade her parenting style, and she apologised for what she said. All of us want what is best for the child, so we've decided that should any issues arise, she is to talk directly to my bf & not me. \nMy bf has also consulted with a family lawyer & they  are in the process of drawing up a custody agreement.",
  "id": 1,
  "comments": [
    {
      "score": 10930,
      "content": "NTA\n\nShe's being ridiculous. Assuming that there's an actual visitation agreement, she cannot unilaterally just do that.",
      "id": 2,
      "comments": [
        {
          "score": 2836,
          "content": "ex is being pissy. this is the type that will allow a child to be destroyed just to get back at the ex ..for whatever reason. of course, she is probably demonstrating all the reasons she is an ex as well.",
          "id": 3,
          "comments": [
            {
              "score": 1035,
              "content": "My parents divorced when I was one, and used me to hurt each other my entire life.  Can confirm that none of this behavior is going to be good for the child.",
              "id": 4,
              "comments": [
                {
                  "score": 515,
                  "content": "I was 5, my mom tried to use my little sister and I to hurt my dad and essentially extort him to pay an absurd amount of money. \n\nJokes on her though, I moved in with my dad full time at 11 and became an attorney because I was so angry at what she had done. 😂\n\nNTA, OP. Ex is being super petty and your parenting style sounds like mine. My son is 3. He's an intelligent and curious little person trying to figure out the world. Patience is a must with small children and you sound like a wonderful friend/stepmom!",
                  "id": 5,
                  "comments": [
                    {
                      "score": 145,
                      "content": "It's funny how things that happen to us as children can effect so much of who we become and what we value in the future.\n\nDefinitely learned some valuable lessons of what NOT to do when watching my mom and dad.  Also knew that I never wanted my son to have to experience two parents that hate each other, so I really put a lot of work and emphasis in maintaining a strong relationship with my wife.  My son is getting to experience what a happy household with two parents that love each other looks like, and I can only hope that he aspires to have the same for himself one day.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 30,
                      "content": "Not only that, but OP isn't trying to parent him. She is being a good role model. Parenting involves disciplining a child, and unless OP has left some things out, her way of interacting with her BFs child doesn't involve disciplining but actually uses communication to solve problems like instead of yelling at him for breaking things OP made it clear that they can learn about things together without destruction.\n\nNTA, but I would talk to your boyfriend about this and maybe apologise that he is being punished for you trying to get to know his kid and have a good relationship with them. Make it clear that you know they are a package deal and were trying to build a relationship with the kid, not undermine any parenting.",
                      "id": 7,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "I’m getting divorced and I can see my stbxh is already using them to hurt me. I can’t do that. I told myself I would continue to love them and care for them as I do. That I can’t control how he treats them how he talks about me. All I can do is love them care for them and create a safe environment when their with me. Then let the chips fall where they may and accept it for whatever it is. When their older they will known they may not say it to me but hopefully they will see that wow mommy never said a bad thing about daddy. Which is so hard to do already!!",
                  "id": 8,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 114,
              "content": "EX can't stand that OP is a better parent than she is. Apparently, she's yelling a lot along with the threats. It might be time to rethink the visitation schedule if she's going to blackmail the boyfriend. Start writing things down to build a case, as long as your bf is on board. She thinks she gets to control every interaction her child has. She has no right to tell you how to speak with a child, especially since she sounds controlling and borderline abusive. NTA",
              "id": 9,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -10,
              "content": "[removed]",
              "id": 10,
              "comments": [
                {
                  "score": 16,
                  "content": "I think that u/One_Satisfaction3376 is a rather complex rewording bot, because this doesn't make much sense in context, but really is just a thesaurus running over u/RibbitRabbitRobit's comment.",
                  "id": 11,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 896,
          "content": "Plus if your 4 yearold kid needs to tell you take a deep breath then you're probably obnoxious af.",
          "id": 12,
          "comments": [
            {
              "score": 270,
              "content": "Reminds me of an ex. His mom was telling a story about how one time when he was 4 and getting on her nerves she \"jacked him up against the wall\". She was laughing and saying \"I guess I'm the one who needed a time out! Haha\" \n\nThat explained a few things to be honest. Some people should not be parents.",
              "id": 13,
              "comments": [
                {
                  "score": 17,
                  "content": "I agree with you, except it should be \"a lot of people should not be parents\". I'm amazed on a daily basis at what a shoddy job so many people do raising their kids",
                  "id": 14,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 223,
              "content": "We tell our kids to \"smell the flowers and blow out the candles\" when they're overly upset and I can't remember what happened but I was upset about something (I think during my third pregnancy) and my son said \"smell the flowers mommy\"",
              "id": 15,
              "comments": [
                {
                  "score": 321,
                  "content": "My three year old recently told me, \"good deep breaths, Mommy\" and it was simultaneously hilarious and the most obnoxious thing she's ever done. I NEED THESE DEEP BREATHS BECAUSE OF YOU, LITTLE STINKER!",
                  "id": 16,
                  "comments": [
                    {
                      "score": 197,
                      "content": "My best friend said she was crying while on the toilet because she never gets to pee alone anymore and her toddler was petting her hair telling her it was ok - she said the same thing - so sweet and yet so annoying lol",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 10,
                      "content": "That is adorable hahaha",
                      "id": 18,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 135,
                  "content": "Yeah, I talk about squeezing a pillow or taking a deep breath when we have *big feelings* or are frustrated.\n\nA couple months later I offhandedly said ‘oh, that’s frustrating’ (in response to another adult’s recent paperwork issue) and heard a few of the kids chirp up ‘squeeze a pillow!’ and ‘take big breaths jexorcist!’.\n\nKids like teaching and giving advice too, they want to use and share the ‘adult’ skills they’ve learned.",
                  "id": 19,
                  "comments": [
                    {
                      "score": 41,
                      "content": "Hah! Not on the subject of controlling feelings, but -- when my nephew (now 24) was, I dunno, 2? 3? I mentioned in his presence, talking to the other adults, that I speculated that I was the shortest of a short family because when I was 13-16 or so and should have been going through a growth spurt I was eating truly pathological quantities of sugar, (stealing money to support my habit!) and blood sugar swings mess with growth hormone release.  \n\n\nMaybe 18 months later, I said something in passing about being short. My nephew said, \"That's 'cause you ate too much sugar as a kid!\" They are \\*always\\* listening.",
                      "id": 20,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 33,
                  "content": "We do the same. Even painted a flower and candle together to put on the wall. Works so freaking well.",
                  "id": 21,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 7,
                  "content": "This is wonderful. I have no kids but will remember this.",
                  "id": 22,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 53,
              "content": "My 5yo does this to me. \n\nTbf, I am obnoxious af and I’m working on it. \n\nThe shame in having my kid help me through deep breathing exercises is real. And a palpable force. \n\nFor good, it seems.",
              "id": 23,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 37,
              "content": "Ok, if a 4 year old has better emotional regulation than you do as their parent, it's time to reassess. The ex is big mad that her child isn't putting up with those old school, played out tactics that scare kids into obedience without helping them grow.\n\nYou have to be living under a rock to think yelling and spanking your kids is the way to go.",
              "id": 24,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I was thinking that the child is acting like an adult, and the adult is acting like a child, in relation to the mom.  She is upset that her young son is showing more maturity than she can muster.",
              "id": 25,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 7,
              "content": "In a parent-child dynamic probably yes.  But this is also a common tactic (usually used against women) to invalidate their feelings and only leads to more anger/frustration.  Obviously the 4 year old isn’t doing that intentionally to his mom, and as the parent she has the responsibility to temper her emotions around her child.\n\n\nRegardless, it sounds like OP is being a good parent to this kid and definitely NTA.",
              "id": 26,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 69,
          "content": "[removed]",
          "id": 27,
          "comments": [
            {
              "score": 12,
              "content": "This comment is copied word-for-word from another comment below.",
              "id": 28,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 42,
          "content": "Exactly. Lawyer time.",
          "id": 29,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 22,
          "content": "NTA, you are a better role model than BF's mom. Who has custody anyway? If she has custody maybe it is time to get the custody agreement changed. And where is your BF's support in this matter?",
          "id": 30,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 20,
          "content": "[removed]",
          "id": 31,
          "comments": [
            {
              "score": 60,
              "content": "Because she knows that her style of parenting is wrong at some level but can't face it, so she needs to deflect.",
              "id": 32,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 33,
              "content": "My coparent was mad that I, the bonus mom, was not utilizing punishment styles that specifically exclude our words (carefully worded to avoid breaking the rules, so I hope you get my gist)  \n\n\nLike ANGRY angry, to where she wouldn't talk to me for over 6 months after I said no.",
              "id": 33,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 8,
          "content": "I'd say abusive.",
          "id": 34,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "You'd be surprised the shit primary custody parents can get away with when it comes to ignoring a court order.",
          "id": 35,
          "comments": [
            {
              "score": 1,
              "content": "Yeah I love the optimism here of taking her to court if she tries limiting access…likely scenario is the court either doesn’t care or just further reduces access anyway. Fathers are not well looked upon in family courts",
              "id": 36,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 0,
          "content": "[removed]",
          "id": 37,
          "comments": [
            {
              "score": 4,
              "content": "Partial comment stolen from u/Thegreenestofpeas\n\nu/mutedgfhs is a bot.",
              "id": 38,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 0,
          "content": "Not only can she not do that, but it could backfire on her if she’s interfering in healthy relationships for her son and in any being cruel or abusive with him.",
          "id": 39,
          "comments": [
            {
              "score": 3,
              "content": "Can you imagine her standing in front of a family court judge arguing that she wants to limit OP’s access to her son bc OP doesn’t yell at him? That’s a winner, for sure.",
              "id": 40,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 5412,
      "content": "Sounds like the 4y/o is more mature than his mother, and she doesn't like being reminded of that fact (*by the kid*) when she loses her temper.\n\nYour boyfriend needs to go to court and get a proper custody arrangement in place, because his ex just \"deciding\" he doesn't get to see his son anymore ain't it.\n\nNTA.",
      "id": 41,
      "comments": [
        {
          "score": 1360,
          "content": "That would be a fun one. Mother declaring that the father can't see his kid anymore, because his gf doesn't scream to it.",
          "id": 42,
          "comments": [
            {
              "score": 916,
              "content": "Can you imagine telling the judge you want to change things because the \"new\" girlfriend is speaking to your child respectfully and (gasp) explains things to them.",
              "id": 43,
              "comments": [
                {
                  "score": 427,
                  "content": "That kind of curiosity should be cultivated. OP just found a non-destructive way to do it, and it sounds like he loves it. Sounds like he also appreciates not being screamed at for something. I mean, he’s fucking 4 years old, mistakes are gonna happen, and yelling or “spanking” doesn’t teach him anything, except maybe that it’s ok to yell and hit when you’re mad. Most judges would laugh at the ex.",
                  "id": 44,
                  "comments": [
                    {
                      "score": 106,
                      "content": "Yeah, OP sounds like a fantastic aunt! She’s encouraging curiosity while minimizing damage, and it also sounds like he’s learning healthy anger management strategies. That’ll benefit him his entire life!",
                      "id": 45,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 26,
                      "content": "Imagine if every kid who had the desire to take things a part were taught how to accurately put things back together. We’d have a society of engineers and technicians. It’s honestly a sign of deep thought that people pass over because they’re mad their things were taken apart",
                      "id": 46,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 6,
                      "content": "I teach kids and almost invariably when I have an aggressive kid, they come from a home with an aggressive parent.",
                      "id": 47,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 81,
                  "content": "I for one, would love to see her explain to the judge that OP is a bad influence because now her son asks her to calm down and not to scream at him any more.",
                  "id": 48,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 59,
                  "content": "I know, that's what I thought too - it would make her look terrible in court (and she sounds like she is terrible).",
                  "id": 49,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "If I were a judge and someone wanted to limit their kids time because of the ex’s SO’s “new age bullshit” I’d probably assume like not wanting the kid vaccinated or using essential oils or ignoring a doctors orders or something else that would qualify as new age bs. \n\nIt would definitely be a fucking shock to realize that they actually meant the ex’s SO was using words to describe feelings for big emotions and finding non-destructive ways to explore. I think I’d probably lower that persons time with the kid and increase the ex’s time because that would absolutely be in the best interest of the child.",
                  "id": 50,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "[removed]",
                  "id": 51,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 3,
                  "content": "Right?  \"Your honor, my kid now expects me to explain things to him instead of just yelling no at him!\"",
                  "id": 52,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 72,
              "content": "I'd love to see that happen at court.  \n\nThis is why formal custody agreements are so important.",
              "id": 53,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 45,
              "content": "\"Your honor, my ex is currently dating some woman who treats my son like a well-trained, caring kindergarten teacher, HOW DARE SHE!\" /s\n\nNTA OP",
              "id": 54,
              "comments": [
                {
                  "score": 2,
                  "content": "Oh and he thinks my girlfriend is his auntie. That shouldn't matter too much. Right?",
                  "id": 55,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 73,
          "content": "[removed]",
          "id": 56,
          "comments": [
            {
              "score": 0,
              "content": "That is not the question on which a judgement is asked.",
              "id": 57,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": 54,
          "content": "This. NTA. The ex sounds like she’s in need of anger management courses, and is infuriated that her own child recognizes her anger issues and is setting boundaries at just 4yo, asking her to speak calmly to him. Good for him, BTW!",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "It's definitely some difficult humble pie to choke down when your little child is being more appropriate in the situation than you are. It's also vitally important to be able to do so (and continue working to improve). Most parents will end up yelling, saying something mean, or otherwise behaving badly at some point, being human. The important thing is for the parent to apologize and model restitution/work to not to do it again.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "It made me laugh. 😂😂 The boy talks like a psychologist and he's only 4!",
          "id": 60,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -7,
          "content": "[removed]",
          "id": 61,
          "comments": [
            {
              "score": 8,
              "content": "[deleted]",
              "id": 62,
              "comments": [
                {
                  "score": 3,
                  "content": "Good bot",
                  "id": 63,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 2132,
      "content": "You know you‘re NTA for treating a child with respect and understanding, right?",
      "id": 64,
      "comments": [
        {
          "score": 34,
          "content": "[removed]",
          "id": 65,
          "comments": [
            {
              "score": 19,
              "content": "Stolen comment. u/apprehensivebug9950 is a bot.",
              "id": 66,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "No"
        },
        {
          "score": -89,
          "content": "That's not what this is about though. It's about OP saying something to provoke the ex and now it's causing drama for her BF.",
          "id": 67,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -612,
          "content": "[removed]",
          "id": 68,
          "comments": [
            {
              "score": 473,
              "content": "The ex contacted her and insulted her first? What was she supposed to do, just say, \"alright, from now on I'll ignore the kid and scream at him to keep the parenting consistent\"?\n\nThe ex was the one who reached out and got what she was asking for.\n\nNTA",
              "id": 69,
              "comments": [
                {
                  "score": 172,
                  "content": "Exactly my thoughts. You’re never the AH for caring for a child.",
                  "id": 70,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": -350,
                  "content": "[removed]",
                  "id": 71,
                  "comments": [
                    {
                      "score": 250,
                      "content": "Why do I feel like you’re the ex here? 😂",
                      "id": 72,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 149,
                      "content": "She did not choose the fight, the ex did. The ex was the asshole here; see, OP tried to deescalate by having a reasonable conversation about the situation, but the instigating ex chose to start a fight when she snapped back with something completely uncalled for. Quite frankly, if somebody says \"go make your own kids and teach them shit\" to you when you've been nothing but kind and respectful to a child, they threw the first stone and fuck their feelings. OP worded her response a lot more kindly than some would have.",
                      "id": 73,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 93,
                      "content": "Are you the ex?",
                      "id": 74,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 89,
                      "content": ">She CHOSE to start drama\n\nStart? You keep using that word. I do not think it means what you think it means.",
                      "id": 75,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 75,
                      "content": ">She CHOSE to start drama.\n\nWrong. That was the ex.",
                      "id": 76,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 54,
                      "content": "How many children do you have and are you a co-parent?",
                      "id": 77,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 44,
                      "content": "Momster is this you? 😂 maybe if the mom didn’t have such a short fuse her young child wouldn’t be having to teach her calm down tactics used for kids ☠️",
                      "id": 78,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 26,
                      "content": "And her ex could have had the same reaction to being hung up on... \n\nMany would also consider that rude / dramatic.",
                      "id": 79,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 19,
                      "content": "She literally apologized lmao what are you on about",
                      "id": 80,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 18,
                      "content": "Found the ex",
                      "id": 81,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 147,
              "content": "But the ex IS a bad parent. How bad does it have to be that a freaking 4 year old knows how you talk to people and a grown adult can’t comprehend that.\n\nShe might have her views on parenting- I get that (well as she’s beating and screaming at him not really tho) but she cannot force the father and his new gf to be just as abusive.\n\nOP didn’t do anything except defend herself and did not speak badly about the mother in front of the child. \n\nSo why are you projecting 🥴",
              "id": 82,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 42,
              "content": "The ex cannot just unilaterally decide to cut contact between the child and his dad. \n\nOP has a right to become part of \"the family\" and as such communication with the ex will at times be necessary. She obviously loves the kid, and is a much better role model for him. \n\nTelling someone to go make their own kids because they can't deal with their insecurity as a shitty parent is what's \"stirring up drama\"; the ex started this, not OP\n\nWhy are you defending someone who's mean to a child?",
              "id": 83,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 26,
              "content": "The mom/ex called op so no the ex is the asshole get it right",
              "id": 84,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 8,
              "content": "Ex contacted her first, your argument falls flat there.",
              "id": 85,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 3,
              "content": "This comment reads as a personal bias against an ex’s new girl, tbh\n\nThe ex engaged with OP first and insulted her. NTA",
              "id": 86,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": -157,
              "content": "Exactly!  \nEven though her technique is working (that's a good thing, indeed and makes her N T A,) it doesn't give her the right to tell the child's mother that she's doing a shitty job of raising her son. That right there = YTA.",
              "id": 87,
              "comments": [
                {
                  "score": 138,
                  "content": "People who think explaining concepts to kids and speaking calmly to them is “woke” ARE bad parents and should be told so lmao. Becoming pregnant/impregnating someone doesn’t make you a good parent. Just makes you a parent. I’m glad OP was there so the kid could learn some kindness.",
                  "id": 88,
                  "comments": [
                    {
                      "score": 41,
                      "content": "This. 👏🏻 All. 👏🏻 Day. 👏🏻 Long! 👏🏻",
                      "id": 89,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -59,
                      "content": "I agree that children should be taught kindness, and i think it's good of.the OP to do so. But you can't do that then turn around and be rude to someone else. That's just the complete opposite.\n\nIf I was still working in child care, I'd get fired for mouthing off to a bad parent.",
                      "id": 90,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 31,
                  "content": "\"Maybe your parenting style needs an update\" is about as polite as it freaking gets in those circumstances. \n\nYou're being ridiculous.",
                  "id": 91,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1835,
      "content": "NTA. \"Go make your own kids and then teach them shit\", has to be one of the most ignorant things I've ever read. Keep helping that kid. Teach him everything. One day he'll thank you, regardless of what garbage the ex is feeding him.",
      "id": 92,
      "comments": [
        {
          "score": 491,
          "content": "What's funny is it doesn't even seem like OP is actively \"teaching\" the child rather that the child is learning healthy habits from the OP and wants to include the productive mechanisms for communicating in other relationships. \n\nI.e.... NTA. lol",
          "id": 93,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 83,
          "content": "probably because ex is an ignorant nasty individual.",
          "id": 94,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 12,
          "content": "[deleted]",
          "id": 95,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "This parent is going to be a nightmare when the kid goes off to school.",
          "id": 96,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "Bet she's the type of parent who gets upset when the school teacher isn't teaching the kids everyday stuff that they should learn at home.",
          "id": 97,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": -8,
          "content": "[deleted]",
          "id": 98,
          "comments": [
            {
              "score": 182,
              "content": "That's not how custody agreements work. The mother could potentially have it amended to include that stipulation, but she can't just make a rule like that up unilaterally.",
              "id": 99,
              "comments": [
                {
                  "score": 17,
                  "content": "Exactly, I don't see how that could be legal unless it was in the custody agreement, and to be added to the custody agreement there would have to be a reason other than she speaks softly and tells him to take deep breaths if he's upset...",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 9,
                  "content": "Why do you assume there is a custody agreement? Lots of people co-parent without an agreement. So if the boyfriend isn't on the birth certificate, she can keep him away until he goes to court.",
                  "id": 101,
                  "comments": [
                    {
                      "score": 50,
                      "content": "Why are you ASSuming that the boyfriend isn't on the birth certificate?",
                      "id": 102,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 3,
                      "content": "are you dense? Just because he's not on the birth certificate means nothing if he's the father he can go to court asking for a DNA test and something tells me evidence knowingly lying to the judge about paternity to fudge custody agreements won't turn out well",
                      "id": 103,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -165,
          "content": "[removed]",
          "id": 104,
          "comments": [
            {
              "score": 96,
              "content": "She didn’t insult, she informed. She said that her parenting needs an update after she got HEAVLY insulted for taking care in a more nurturing way. I start thinking that YOU‘re the AH in this thread.",
              "id": 105,
              "comments": [
                {
                  "score": 15,
                  "content": "The more they comment the more convinced I am that's the ex lol",
                  "id": 106,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I came here to say exactly this. Please take my upvote.",
                      "id": 107,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 80,
              "content": "Imagine defending a mom screaming at a 4 year old kid or laying hands on him.\n\nThat is you. You just defended that behaviour.\n\nAlso, if there is a visit agreement, you just defended shredding that too.\n\nSee yourself out to the nearest dixi.",
              "id": 108,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": 37,
              "content": "Refraining from abusing kids is being on a high horse? Yikes.",
              "id": 109,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 15,
              "content": "Yes, we should all stand up for every parent’s right to yell at their young children.  /s",
              "id": 110,
              "comments": [],
              "relation": "No"
            },
            {
              "score": 7,
              "content": "But you are OK with the mother insulting the girlfriend?",
              "id": 111,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 706,
      "content": "NTA. If anything his behavior got better. Think mom is just jealous bc the kid likes you and listens to you (bc you respect him)",
      "id": 112,
      "comments": [
        {
          "score": 286,
          "content": "Yep. Your 4 year old asking that you be more like your ex's new GF would be a bitter pill to swallow and she's choosing to throw the blame out externally rather than look a little closer to home.",
          "id": 113,
          "comments": [
            {
              "score": 72,
              "content": "Especially since she gets the difficult days (morning routine, get him ready for kindergarten in a limited amount of time, miss him all day, pick him up, limited time for evening bonding and bedtime routine) and dad gets the easy weekend days.",
              "id": 114,
              "comments": [
                {
                  "score": 25,
                  "content": "4 years old going to kindergarten? Doubtful. Maybe daycare, but we don't have any info on that situation. Also that does not excuse excuse insulting OP.",
                  "id": 115,
                  "comments": [
                    {
                      "score": 10,
                      "content": "Both my kids started at 3.5.",
                      "id": 116,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 6,
                      "content": "Don't they? I'm pretty I was 4 turning 5 when I went to kindergarten. I'm pretty sure I even had classmates going in at the age of 3 turning 4. Could be different on other countries but that's how I remember it here in the Philippines. We also have kindergarten 1 and kindergarten 2.",
                      "id": 117,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 31,
          "content": "Exactly. He sounds like a very sweet little boy. I’m so impressed that he’s able to communicate those things with his mom. And good for OP for being calm and sweet to this child.",
          "id": 118,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 422,
      "content": "NTA.  Your bf needs to talk to his lawyer if she is refusing him access to his kid.  As for dealing with the mother, it sounds like you're just going to have a contentious relationship with her.  It sucks, but you're doing nothing wrong.  It's a shame that the mother can't see this, because whatever you're doing seems to be getting through to the kid.    \n\n\nMother needs to chill out some.  If either of my kids (6 and 3) said something like that (\"Okay, take a deep breath\"), I'd be laughing.",
      "id": 119,
      "comments": [
        {
          "score": 78,
          "content": "Good advice. If BF is in the US and doesn’t have a parenting plan with the ex and doesn’t get a lawyer to file for one in the courts his parental rights could be terminated if he doesn’t see his son within a certain amount of time. Saying “she wouldn’t let me see child” might not be enough to fight termination if BF doesn’t take legal measures. Best consult an experienced family lawyer for specific laws in his area.",
          "id": 120,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 16,
          "content": "Also, I would like some more info on the bf’s opinion on this. How is this OPs parenting style and not both of theirs? Does the bf not do anything or is the ex so blind to OPs bf being a good parent too that she immediately blamed OP?",
          "id": 121,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 200,
      "content": "Oh honey, not an AH in general. Sounds like you are a fantastic human. But in the specific case of telling mom anything about her parenting methods, its an ESH.\n\nSo....yah, you should not have said that to her. You haven't changed every diaper, stayed up in the middle of the night countless times, fed her every day, watched her grow every day. Commenting from the outside on her parenting style is just mean. We women can be so terrible to one another when it comes to parenting. Everything is a problem and no-one is respectable when it comes to watching other people parent. It's a sad state in society that I would urge you not to participate in.\n\nBut the reality is that she's a bit unhinged and this custody thing is going to be a problem.\n\nEvery divorce has a custory arrangement. If she denies Dad his time with the child, he needs to bring her to court. She'll likely bend when she realizes that it's being brought to court, but if she doesn't, the likely result will be that he ends up with full custody. Courts take child estrangement and not following the divorce agreement very seriously.  \n\n\nEdit. I changed my mind, looking at the options, and went from YTA to ESH. That's a better fit. Hopefully, no one has commented below this yet.",
      "id": 122,
      "comments": [
        {
          "score": 395,
          "content": "The bio mother called to tell OP she shouldn't treat the kid respectfully, but yell at him like she does.\nHow on earth is one supposed to react to that?",
          "id": 123,
          "comments": [
            {
              "score": 48,
              "content": "Ideally? “I’m sorry that you feel I was transgressing, that wasn’t my intention. I’ll talk to BF about this because I don’t want to come between you two. Have a nice day,” and hang up. Don’t let a pig pull you into the mud and all that.\n\nI think the individual you’re responding to is pretty clear that OP is overall in the right here, but choosing ESH to highlight the fact that OP’s statement - while correct and imo justified - I absolutely the tipping point here. If OP would like to prevent further drama, they shouldn’t say things like that (though I think they would be perfectly justified in believing that one just has to live honestly and let others react how they will).",
              "id": 124,
              "comments": [
                {
                  "score": 59,
                  "content": "I've lived on a farm with pigs and if they really want to, they will drag you into the mud no matter what you do.\n\nSame thing with the ex. If she has determined OP to be the problem, she will drag OP through the mud no matter how OP responds. The moment the little boy compared his mom and OP, I'm betting the mom was determined to put OP in her place and nothing OP could've said would have salvaged the situation.",
                  "id": 125,
                  "comments": [
                    {
                      "score": -1,
                      "content": "Sounds like you would agree with my final parenthetical 🤷‍♂️ As I say, I think that’s a perfectly justifiable choice, though it is one that accepts as given that the BF is going to go through some shitty custody drama. I don’t see any reason to assume they wouldn’t be, but I hope OP is ready for that.",
                      "id": 126,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 48,
                  "content": "I disagree. Children deserve to be stood up for when they are being mistreated. Even if it's by a parent.",
                  "id": 127,
                  "comments": [
                    {
                      "score": 12,
                      "content": "Especially when it’s by a parent",
                      "id": 128,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 1,
                      "content": "And now the party who is mistreating is keeping control of the child and the child doesn’t get a break from mom anymore.\n\nGreat result!",
                      "id": 129,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -9,
                      "content": "I’m not sure where exactly our disagreement is.",
                      "id": 130,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "[removed]",
              "id": 131,
              "comments": [
                {
                  "score": 4,
                  "content": "Partial comment stolen from u/SaraRF\n\nu/hauntsdgh is a bot.",
                  "id": 132,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 1,
              "content": "We're only getting OPs out of this story\n\nI very seriously doubt bio mom got this upset over what she told us in the post\n\nDefinitely getting the leaving things out feeling from this",
              "id": 133,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 277,
          "content": "No amount of diaper changing or sleepless nights entitles you to scream at your child and lose your temper with them.",
          "id": 134,
          "comments": [
            {
              "score": -38,
              "content": "It doesn't entitle a parent to it, but it's certainly understandable if it happens occasionally.\n\nHonestly, though, I'm on the ESH train. While OP's comment wasn't incorrect, it basically obliterated any chance that the kid's mom might have been willing to tolerate OP. Not that the odds were good to start with, but that comment definitely hurt things.",
              "id": 135,
              "comments": [],
              "relation": "Attack"
            },
            {
              "score": -50,
              "content": "[deleted]",
              "id": 136,
              "comments": [
                {
                  "score": 50,
                  "content": "I don’t know what kind of persecution complex you have that makes you think lifelong trauma is an even trade for doing your job as a parent, and I don’t care to hear about it. Have the day you deserve",
                  "id": 137,
                  "comments": [
                    {
                      "score": -41,
                      "content": "Lifelong trauma because your parent yells at you once? Oh please. Call me when you have kids.",
                      "id": 138,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 16,
                  "content": "Children are humans. You wouldn’t want to be yelled at and belittled so why would you do it to a child that will then grow up thinking that’s how you treat people",
                  "id": 139,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "We aren’t talking about “ever” we are talking about general discipline and communication styles. This isn’t a one time thing. It’s common enough that the mom of the kid called OP and threatened to change the custody agreement lol. Clearly she is not a level headed, respectful individual.\n\nAlso if you lose your temper and scream at your child, you need to apologize and work on better communication/frustration outlets, just like you would with any other person.",
                  "id": 140,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 164,
          "content": ">Everything is a problem and no-one is respectable when it comes to watching other people parent\n\nI think mainly just hitting and yelling at children instead of raising them with care and respect is a problem. OP's parenting style sounds great. The kid's mom's sounds horrible, but unfortunately common. OP you're NTA.",
          "id": 141,
          "comments": [
            {
              "score": 20,
              "content": "[deleted]",
              "id": 142,
              "comments": [
                {
                  "score": 58,
                  "content": "It sounds like OP is helping this child regulate. You’d be amazed how quickly kids pick this stuff up and then apply it. My not even 2 year old will grab my hand if I’m giving my dog butt pats and make me stroke them while saying his baby version of “gentle” because that’s how we make him interact with them. \n\nKids are tiny little mirrors of what they see around them. The kid knows he doesn’t like how it feels when he’s angry, and he knows he doing like how mommy sounds, and he knows that “auntie” helps him by prompting him to take deep breaths- so he’s just mirroring that behavior. \n\nIt sounds like mom doesn’t have the self-regulation skills to stay in control of herself when she’s frustrated. And I get it, it’s tough to stay calm when a kid is tearing up your house. But it’s a skill just like any other that can be learned if you want to. Also, if she thinks “take some deep breaths” is “new age”, I’m willing to bet she’s a shouter.",
                  "id": 143,
                  "comments": [
                    {
                      "score": 11,
                      "content": "[deleted]",
                      "id": 144,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "\"New age phrases\" sounds like someone who has medieval views on child-rearing and probably everything else, not someone responding to genuine interference from someone who is acting in bad faith. \n\nKids parrot what people tell them. If she tells him to take a deep breath when he's upset, why wouldn't he do the same for his mom? You're reading bad intentions into this based on very weird things.",
                  "id": 145,
                  "comments": [],
                  "relation": "Attack"
                },
                {
                  "score": 8,
                  "content": "\"Take a deep breath\" helps you understand children when they are having high key emotions, like hurting themselves, nightmare, being excited or happy.\n\nIt's a wonderful hack that everyone should be aware of and try to use.",
                  "id": 146,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yup, she is totally the AH. A child never acts the same around mom vs with strangers.",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 0,
                  "content": "It does not sound “coached”, that would mean she told the kid to say it to his mom. It sounds like a very reasonable thing that she has said to the kid/her partner/herself in moments when someone is upset and having a bad reaction. The kid realized that taking a breath makes him feel better when he’s upset, so he mimicked the phrasing to try to help his mom feel more calm when she was agitated \n\nCoached smh",
                  "id": 148,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": -1,
                  "content": "You seem like a nasty human being and an awful parent. It’s VERY clearly implied that someone is hitting the child. I’m guessing it isn’t directly stated due to potential legal issues.\nIt’s obvious that you have children. I’m sorry that you don’t like your kids or regard them as human beings, but that doesn’t validate your awful opinions. Get therapy for yourself and get your kids therapy. Please. We all have to deal with the consequences of your choices unfortunately.",
                  "id": 149,
                  "comments": [
                    {
                      "score": 2,
                      "content": "Absolutely dead wrong. No implications of hitting are in this post.",
                      "id": 150,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 107,
          "content": ">Everything is a problem and no-one is respectable when it comes to watching other people parent. It's a sad state in society that I would urge you not to participate in.\n\nIf more people called out shitty parents where they saw them we would have a lot less abused kids growing up in terrible households.",
          "id": 151,
          "comments": [
            {
              "score": 27,
              "content": "Thank you! I wish someone would have stepped in for me. Yelling/screaming was a daily thing in our house and to make it worse I have something wrong with my auditory processing. I'm now a mom too and only yell not scream if its for safety reasons. I sit my child down and talk to them instead of raising my voice and she and I have a lot of respect for one another. It really makes me angry when I hear someone yelling at their child, its just wrong.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 102,
          "content": "I'm sorry but I have to disagree with the sentiment that you shouldn't tell other people how to parent. If yelling at your child is a regular part of your parenting then you are doing a bad job and need to be called out. I'm not saying you should *never* yell but this mom seems to be shouting at her son constantly. That is just unproductive and harmful.",
          "id": 153,
          "comments": [
            {
              "score": -26,
              "content": "I parent much like what the OP is explaining, but I disagree. She doesn't have a right to tell the mom how to parent. It's no one's place to do that, but OP doesn't really know much about how the OP parents. She doesn't actually say mom is hitting him, and we don't know that mom even yells. She may raise her voice a bit or just be loud.",
              "id": 154,
              "comments": [
                {
                  "score": 45,
                  "content": "That's WILD.\n\nIt's no one's place to tell someone how to raise a child?\n\nI wish someone had told my mother how to raise me, what with her history of abuse and neglect. But, it was no one's place to I guess.",
                  "id": 155,
                  "comments": [
                    {
                      "score": -16,
                      "content": "Sorry you had a bad mom but Sweet little kids don’t just pop up outta nowhere. Somebody gotta raise them. Being a Aunt/Uncle isn’t raising kids.\n\nMom was outta pocket for calling her and she’s outta line for making things harder for her boyfriend cause she’s not a parent.",
                      "id": 156,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Attack"
                }
              ],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "How many diapers do you have to change before you can scream at toddlers? 100? 1000? Just want to know where your number is",
          "id": 157,
          "comments": [
            {
              "score": 24,
              "content": "I changed thousands of my younger siblings diapers, so when I have my first kid I get to scream at her right away!",
              "id": 158,
              "comments": [
                {
                  "score": 6,
                  "content": "This is the way. /s",
                  "id": 159,
                  "comments": [
                    {
                      "score": 14,
                      "content": "No trial. No nothing.\n\nWe have the best kids, because screaming.",
                      "id": 160,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 65,
          "content": "I'm a parent and I'm going to come right out and say that people who treat their kids as if they were property instead of human beings with feelings don't deserve to have them. Anyone can slip and yell, parenting and especially what amounts to single parenting is tough and kids are really good at pushing buttons, but yelling and hitting are NOT a valid baseline parenting style and this is the hill I will die on.\n\nBio mom sounds awful and bf sounds like a \"don't rock the boat\" type of person, which is not ideal. He needs to stop outsourcing his discomfort with the situation on OP and put it where it belongs: on bio mom. He owes it to his kid to push for his rights instead of letting bio mom get away with this shit.",
          "id": 161,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 43,
          "content": "Yeah but what mom screams at a 4 year old and the ex called op so I think op has every right to say that the ex Is the asshole in this story",
          "id": 162,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 32,
          "content": "Someone has no idea what child abuse actually looks like behind closed doors.\n\nNot judging poor parents is foolish as fuck.",
          "id": 163,
          "comments": [
            {
              "score": -5,
              "content": "You're not being asked to not judge. You are being asked to act in the best interest of the child, who has to live with a crazy mom, instead of just aiming to be \"right.\"",
              "id": 164,
              "comments": [
                {
                  "score": 6,
                  "content": "What a complete misunderstanding of my comment.",
                  "id": 165,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 20,
          "content": "Disagree. \n\nThere is a category of parenting style that is documented to just be bad.  People who use it often were patented that way and also are stretched thin. \n\nParenting in a healthy way is exhausting. Taking the time to deal with a child who is misbehaving calmly takes a lot more time and energy than screaming or hitting. But screaming and hitting is not a good way to parent. \n\nDo I think people need to back off of women for things like breastfeeding vs bottle, and potty training styles, etc.? Yes, absolutely, women should do that how they want. \n\nBut we shouldn't find it to be ok to just stand by when adults in distress default to the worst possible way to parent as if it's a lifestyle choice to respect.",
          "id": 166,
          "comments": [
            {
              "score": 2,
              "content": "Who is hitting the kid? OP said she doesn’t believe in hitting. I think I missed where the kid was getting hit?",
              "id": 167,
              "comments": [
                {
                  "score": 2,
                  "content": "I was calling it out as an exception to your statement. Wasn't applying to OP specifically.",
                  "id": 168,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Attack"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 149,
      "content": "ESH. You are overstepping. She is a single parent and you are not respecting the difficulty of that. \n\nYou have the support of your bf, so you don't know what it's like to be left on your own to manage everything and parent. \n\nYou aren't the Judge and Jury on her parenting and you are not a reliable source, as every girlfriend of the dad believes him when he says his ex is crazy. \n\nStep back. If you were the person who actually does take the high road, you would have Apologized before it even got to the point of telling her the mean stuff. \n\nSo we are supposed to believe you are teaching the kid peaceful living, while you say mean things and make war with his mom? \n\nYou and your bf should read Coparenting books.\n\nSigned, a teacher of 13 years who does teach kids at an expert level and doesn't ruin relationships with their moms while doing it.",
      "id": 169,
      "comments": [
        {
          "score": 95,
          "content": "This. It's really easy to criticize someone else's parenting when the only \"parenting\" you've ever had to do is caring for a child minimally part-time with the full support of a loving partner. It's easy to be endlessly patient when you're not the one single parenting 24 hours a day with no backup, feeling exhausted, touched out, and there is no break nor another parent to pick up the slack if you aren't feeling well, are overtired, etc. \n\nThere's nothing wrong with OP's parenting methods, but her deeply self-righteous attitude grates. It's easy to say, \"You should never yell at your child.\" It's also easy to be the perfect parent when you've never had to parent around the clock, by yourself . . . and have it made WORSE by a co-parent's new partner shaming you for being human and fallible. \n\nAnd I say this as someone who was a lot like OP. I don't have kids of my own, but I've worked with young kids for over 30 years, and helped raise my niblings as well. And I used to be just as self-righteous about parents I thought were \"harsh\" and \"not patient enough\" . . . until I grew up a little and REALLY STARTED WATCHING AND LISTENING to my sister, the actual parent. And she was really smart when she gently pointed out to me that as wonderful as I was with her kids, and as much as she appreciated all that I did (including bedtimes, school runs, sick days . . . all the tough stuff), I didn't have to do it 24/7/365. I didn't have to take care of the sick kids when I was also really sick and trying not to vomit; I didn't have to do the school run if I was too exhausted. This other mother may not always be \"gentle parenting\" and she may lose her temper sometimes . . . but she's doing everything herself, and doing the best she can.\n\nOP is a massive, self-important AH, and if she thinks she's a better parent who has any right to say anything because she \"helped raise\" someone else's kids, she needs to pay closer attention.",
          "id": 170,
          "comments": [
            {
              "score": 26,
              "content": "Phew I tell you, this comment needs a major boost and is the best well rounded response that addresses a lot of the holes OP has left out or not considered. I also find it interesting that she praises her bf for his superb parenting skills of which he does...only on the weekends. Like come on. 🙄 You can't place the entirety of parenting blame on the primary parent and none on the weekend only parenting parent. The mother is naturally defensive and now wants to control any interaction her son gets with his father (not that I agree, but of course that is her defense response) but my bigger question is why isn't he looking into shared custody. Equal weight, equal distribution, equal say in parenting.",
              "id": 171,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Please take my poor person award 🥇 \n\nI was a single parent for a long time to a medically needy child. I tried my best at all times but as a human, there were days when I snapped and/or raised my voice loud enough people thought I was shouting at him. But I always tried my best and it didn’t happen very often. It happens to the best of us especially when we are solo parents who are really trying to make the best of the situation we were given. No one has ever said that I am a horrible parent when I snapped at or raised my voice at my son. I always apologize and say what I did was wrong and that I hope I can be forgiven. It is also so easy to judge everything without knowing the whole story",
              "id": 172,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 6,
              "content": "These are all solid points! My eyes rolled so far in the back of my head reading OP's background. I would love to know why OP's boyfriend isn't disciplining his own child and therefore leaving OP to do it. And that also begs the question as to how much time he is *supposed* to be spending with **his** child and is instead having OP take it over.  If she thinks it's cute to fight her boyfriend's battles, well, joke is on her.\n\nThe mom put OP in her rightful place and OP's friend was right to point out that OP is a YTA for overstepping. OP functions as a built-in babysitter. That's it.",
              "id": 173,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 77,
          "content": "What great points. Funny how OP’s “conflict resolution skills” flew out the window the moment conflict occurred. \n\nThe mature thing would have been to apologize to the mother for any perceived overstepping, no matter how she personally felt about the situation, and defer to the bf. Coparenting is a delicate balancing act, and this is coming from a mother of two 8 year olds, who lives this balancing act daily.",
          "id": 174,
          "comments": [
            {
              "score": 10,
              "content": "“I’m sorry, I didn’t realize respecting your child conflicted with your parenting style.”",
              "id": 175,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 58,
          "content": ">She is a single parent and you are not respecting the difficulty of that\n\nSingle parenthood is not an excuse to yell at a good at a 4 yo.",
          "id": 176,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 44,
          "content": ">She is a single parent and you are not respecting the difficulty of that. \n\n>You have the support of your bf, so you don't know what it's like to be left on your own to manage everything and parent. \n\n\nNone of these are valid excuses for her being a shitty mother.",
          "id": 177,
          "comments": [
            {
              "score": -4,
              "content": "Which isn’t really the point. Shitty or not - she’s the mother and the parents need to agree on how to co-parent.\n\nThe relatively new girlfriend needs to stay the duck out of this.\n\nHard as it may be I the moment -OP should have politely ended the conversation and redirected to the father.\n\nIt’s YTA bordering on ESH - as the mother should have had the discussion. With the dad instead as well.",
              "id": 178,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 36,
          "content": "What's funny is it doesn't even seem like OP is actively \"teaching\" the child rather that the child is learning healthy habits from the OP and wants to include the productive mechanisms for communicating in other relationships. \n\nAlso, if she is yelling at and \"spanking\" her child, then it sounds like she needs a new opinion. I'm not gonna say \"spanking is abuse\", I get the idea behind it and the history. But that stems from abusive, unproductive behavior that should not continue. Period. There's no amount of \"being the actual biological parent\" can excuse unproductive, abusive behavior and also clearly bad communication. \n\nBeing a parent doesn't actually make you an expert in being a parent, See reference: bad parents.",
          "id": 179,
          "comments": [
            {
              "score": 10,
              "content": "Since you won’t say it I will — spanking is physical abuse \n\nAnd yelling is verbal abuse",
              "id": 180,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 26,
          "content": "> If you were the person who actually does take the high road, you would have Apologized before it even got to the point of telling her the mean stuff.\n> \n> So we are supposed to believe you are teaching the kid peaceful living, while you say mean things and make war with his mom?\n\nStanding up for the child *is* taking the high road. OP is NTA for not apologizing for treating a child with basic decency despite its own mother’s wishes. Frankly, the mom sounds bonkers and deserves to have been told everything she was by OP and worse.",
          "id": 181,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 25,
          "content": "This. Parenting decisions need to be made by the parents, not a relatively new girlfriend who was only recently allowed to meet the child. OP's boyfriend needs to be the one to decide how this situation should be handled.",
          "id": 182,
          "comments": [
            {
              "score": 22,
              "content": "She didn't make a \"parenting decision\". She took care of the kid her way and then the kid's mom took issue with it.",
              "id": 183,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 11,
          "content": "And looks like dads only a weekend dad at that \n\nI’d be pretty annoyed if the girlfriend of the guy who only sees he’s kid one week a month was acting like they should be in charge",
          "id": 184,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "She’s a single person, not a single parent. Dad is in the picture.",
          "id": 185,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 4,
          "content": "Agreed. I’m also a teacher. I teach 4 year olds as well. Has the OP actually heard the mom yell at the boy? Or is the child saying he gets yelled at? I once asked a student to clean a mess in a stern voice, and she went home and told her mom I yelled at her. No way did that happen, but kids often don’t have the language to say what exactly happened. OP overstepped without really knowing her parenting.",
          "id": 186,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 118,
      "content": "ESH\n\nYou getting in the middle of telling her that her parenting sucks was out of bounds. That needed to be between your BF and the ex as the PARENTS.\n\nBut her parenting sucks and she's also weaponizing the kid by being an AH about it. BF needs to protect his visitation rights, she should not be blocking that.",
      "id": 187,
      "comments": [
        {
          "score": 134,
          "content": "She deserved to have her parenting be chastised. In no circumstances is it appropriate to yell at a four year old and if your child is asking you to calm down then you need to take a step back and find out what's wrong.",
          "id": 188,
          "comments": [
            {
              "score": 42,
              "content": "Which is why the BF needed to handle it",
              "id": 189,
              "comments": [
                {
                  "score": 58,
                  "content": "No she needed to be called out for this bs. It is actively damaging an innocent child to scream at them. We as a people should not accept that just because she birthed this child. She should be called out constantly for that and by everyone. It does not matter that they are the parent when they aren't properly loving their child and it is disgusting.",
                  "id": 190,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Okay but OP specifically calling her out is not something she was ever going to listen too and now she’s trying to mess with their custody.",
                      "id": 191,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 76,
          "content": "She didn't 'get' in the middle though she was put there by the kids mum",
          "id": 192,
          "comments": [],
          "relation": "No"
        },
        {
          "score": 37,
          "content": "I agree, OP should have ended the conversation & let her bf handle it",
          "id": 193,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 21,
          "content": "Shitty parents must be told how shitty they are.",
          "id": 194,
          "comments": [
            {
              "score": 4,
              "content": "She doesn’t know if the actual mom is a shitty parent.",
              "id": 195,
              "comments": [],
              "relation": "Attack"
            }
          ],
          "relation": "Attack"
        },
        {
          "score": 0,
          "content": "I agree with this, ESH. OP should continue to set a good example with the boy but there’s no way that bio mom is going to listen to a woman who’s known her son less than a year and has never had kids tell her she’s a bad parent. I’m sure bio mom is a bad parent, but being called out on it by her ex’s gf isn’t going to help. Where OP can make a difference is pushing her bf to speak up.",
          "id": 196,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Attack"
    },
    {
      "score": 70,
      "content": "ESH.\n\nYou are obviously teaching the child to maintain being calm and composed in high stress situations, which I think is great personally. I don't understand why the kids mom would be so upset by this.\n\nHowever, you were in the wrong by telling her to \"upgrade her parenting style\". That's not your kid, and that's not your place. \n\nShe may be irrational, but you overstepped. I think you should apologize and try to make things right so your boyfriend can see his child.",
      "id": 197,
      "comments": [
        {
          "score": 29,
          "content": "She only responded with that after being told to “go and make your own kids and teach them shit.” That was a low blow.\n\nShe was a lot politer than I would have been in that scenario.",
          "id": 198,
          "comments": [
            {
              "score": 4,
              "content": "I agree it was a low blow. \n\nStill, ESH.",
              "id": 199,
              "comments": [
                {
                  "score": -3,
                  "content": "If you stand by e s h, you are truly an idiot. Seek help.",
                  "id": 200,
                  "comments": [
                    {
                      "score": 0,
                      "content": "I'm not an idiot, I just have a different opinion than you.\n\nHave the day you deserve.",
                      "id": 201,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 6,
          "content": "You are a bystander that let's children be abused. You are the asshole yourself",
          "id": 202,
          "comments": [
            {
              "score": 2,
              "content": "I was literally abused as a child. Respectfully, you don't know what you're talking about.",
              "id": 203,
              "comments": [
                {
                  "score": 0,
                  "content": "I was too lol",
                  "id": 204,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "Support"
    }
  ]
}