{
  "post content": "My daughter is 24 years old. For her entire life, she has neglected her teeth. Her dental hygiene is nonexistent, she would refuse to brush or floss her teeth at all, wouldn’t even use mouthwash. My first thought was that she may be suffering from depression or some sort of mental health issue, so I immediately took her to professionals. However, even after years of doctors, therapists, medication, and specialists, my daughter still refused to take care of her teeth.\n\nI got multiple opinions from multiple professionals — they all said the same thing: “We don’t know why she won’t brush her teeth,  try xyz, there’s nothing more we can do for you.”\n\nI spent years crying, begging, bargaining, and screaming at her in an attempt to get her to take it seriously. She never did, but under my care she’d at least brush her teeth occasionally (2-3x a week). I kept trying up until she reached adulthood and moved out. At that point there was nothing more I could do for her and I assume she completely stopped caring for her teeth at that point.\n\nRecently, she went to the dentist because of severe pain after putting it off for years. They discovered her teeth were pretty much completely ruined. She had to have most of them pulled. \n\nShe called me crying about how ugly she felt, and she begged me to pay for her to get crowns/veneers.\n\nI refused for several reasons. One, it would be incredibly expensive, we’re talking upwards of 10k. Two, she got herself into this mess by not taking care of her teeth, despite me warning her throughout her entire life and doing all I could to help her. Three, she has yet to show she can maintain proper dental hygiene and without proper maintenance she will likely ruin the crowns/veneers anyways. I told her as much and said she’ll have to figure it out herself.\n\nShe’s obviously furious and thinks I’m a huge a-hole. She is saying I’m a horrible mother and betraying her by not paying for it. It’s honestly starting to get to me and I’m doubting my decision. I can technically afford it, but I would have to use money from my retirement fund.\n\nSo, here I am, asking for opinions from the Internet. AITA?",
  "id": 1,
  "comments": [
    {
      "score": 6116,
      "content": "NTA\n\nYou tried to get her to look after her teeth. What did she think was going to happen? \n\nShe is an adult - Dont help her. She dug herself this hole and she needs to get herself out.",
      "id": 2,
      "comments": [
        {
          "score": 2052,
          "content": "NTA, and you said she hasn't actual changed her hygiene habits, so the underlying issue is still unresolved. You'll spend what, $10-$12k and be back to square one in a year or two? Don't do it.",
          "id": 3,
          "comments": [
            {
              "score": 616,
              "content": "Yep. If she really wants it, she'll earn that money and actually take care of her teeth because she'll have to match her words with her wallet\n\nEdit: In the words of Jackie Aina, \"Veneers ain't cheap, sweetie!\"",
              "id": 4,
              "comments": [
                {
                  "score": 227,
                  "content": "Even more so, if OP would pay she would very likely not take care of it because it was \"free\". People are usually more careful with things they had to pay for themselves, because they learned the value. Best thing to help his daughter is probably to let her pay herself, because in the long run it will benefit her.",
                  "id": 5,
                  "comments": [
                    {
                      "score": 2,
                      "content": "This.",
                      "id": 6,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Veneers also have to be bonded to a tooth. If she had a bunch pulled, she might need implants which are closer to $25k for a full set.",
                  "id": 7,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 162,
              "content": "Yup once you get crowns you have to be super vigilant of flossing and making sure to get rid of bacteria because you have a foreign object in your mouth that your gums want to fight against and more bacteria forms which can lead to gum disease and then having periodontal surgery.\n\nI had 2 crowns put it in and I have to floss, use a water pick and an anti bacterial solution everyday and still having issues with my gums, if the daughter won’t even brush, her gums will probably get infected.\n\nEdit: since the comment is getting some traction I would like to clarify that I’m not telling everyone with a crown needs to have my routine. I do think it’s a disservice to patients to not educate them on why preventative care such as daily flossing is important after you get a crown put in , and I am glad I had a dentist that sat me down and showed me a video about how bacteria can form plaque in areas around the crown if I don’t floss in the area well enough. \n\nMy comment was to drive the point that if OP’s daughter got to the point where she is losing all of her teeth, she probably has other dental issues as well that would make her be extremely vigilant if she gets crowns put in, which won’t be worth it because she can’t bother to brush her teeth more than twice a week.\n\nLet’s be real here being super vigilant for most people would mean actually flossing well everyday, most people don’t floss.",
              "id": 8,
              "comments": [
                {
                  "score": 91,
                  "content": "I had to get a crown at 14-ish, was never really warned about being extra vigilant. At 20 I had a case of periodontitis, which caused my gums to recede by a LOT. For the most part there was no permanent damage, at least to my teeth specifically, and my gums healed up almost entirely. The only place my gums did not fully heal was around my crown. I was fully shocked until I thought about it and was like \"Yeah, duh, foreign object\".",
                  "id": 9,
                  "comments": [
                    {
                      "score": 38,
                      "content": "Damn I’m sorry you weren’t taught that. My dentist was super firm and strict about making sure I understood why I needed to be more vigilant about bacteria.",
                      "id": 10,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 8,
                      "content": "Gum recession doesn’t “heal.” It stays that way forever unless you get grafts.",
                      "id": 11,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 39,
                  "content": "Are you sure you don't have some other issue going on?  I have two crowns, and all I do is brush twice a day.  I never floss unless I have something stuck between my teeth that won't come out by any other method, and haven't used a water pick since I was a kid.  I've also never used an antibacterial solution in my mouth.  I've never had any issues with my gums, before or after getting the crowns.  My dentist has never recommended any additional or special steps to my oral care as a result of getting the crowns.",
                  "id": 12,
                  "comments": [
                    {
                      "score": 26,
                      "content": "When was the last time you had your gums measured? like I don’t bleed or anything but more bacteria does generate and if you don’t floss where the crowns are you may have some issues. \n\nMy BIL is a periodontal surgeon, he tells me some people are just lucky to not develop some sort of gum issues, maybe your saliva has a higher pH than average, etc. I go to the dentist every 4 months and I don’t have any other issues, I was told the pH in my saliva is too acidic(low), which makes it a bit worse but it’s not the main reason why. The only issue with my gums that I have are in the area where the crowns are put in the rest are perfect. I guess it also depends at what stage you had your root canal.",
                      "id": 13,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "I have both a crown and an implant. That routine sound more  like what you have to do if you have an implant than a crown. Minus the antibacterial solution, that was just the first week after they put in the implant. You don't want gingivitis around an implant because it can soften the bone, which will make the implant wiggle, which will crush the bone. So that's why I have to floss around the damned thing all the time.",
                      "id": 14,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 20,
                  "content": "I have multiple crowns (and two temp ones at the moment), and have never been told I needed to care for them more than the usual. I mean, it makes sense, but this is not something that is common knowledge, based on other comments here.",
                  "id": 15,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I was told the temporary crowns are when you have to be extra careful",
                      "id": 16,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 2,
                      "content": "Your dentist is doing you a disservice, mine showed me a video they made about it. And my BIL who is a periodontal surgeon also talked to me about the same thing.  \n\nMake sure you floss deep in the gums where the crowns are put in, if they are redder and the rest aren’t it’s a sign of a potential issue",
                      "id": 17,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "Came her to say the same. I have two dental implants and the oral surgeon said over and over that hygiene is crucial and failure of implants is caused by one of two things, 1) not keeping them clean and 2) too much biting force/biting hard foods on them. You need to be compliant with two things all day every day to ensure they don’t break or get infected. You are talking implants not veneers (veneers cover existing teeth)and you need a healthy mouth and bone going in. She is likely not even a candidate. Mine cost $7000 per tooth and each took a year from extraction to implant. Lastly the same thing happened to my niece. She refused to brush all through her teens and started loosing teeth in her 20’s and has constant dental pain.",
                  "id": 18,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 379,
          "content": " NTA. As someone who worked in an oral surgery office, let me just say the dental work she’ll need is ridiculously expensive. And dental insurance, specifically oral surgery (assuming you’re in the US) is LAUGHABLE. It doesn’t cover shit, and if they decide to cover crowns they partially (more like barley) cover it every 4-6 years depending on the policy. Then you have to get stuff like a panoramic image, bone graft, laughing gas, etc. and guess what! Your insurance will say they aren’t necessary to the procedure so THEY WONT PAY!!! And a single crown can be upwards of 10k....for A SINGLE crown....it’s overall super expensive and a long ass process and I don’t blame you at all for not wanting to pay. Especially if this is something you’ve stressed to her in the past. Dental hygiene is the one thing everyone should take seriously and for her to ignore it for no apparent reason, it’s her problem now.",
          "id": 19,
          "comments": [
            {
              "score": 168,
              "content": "I had to get one single dental implant last year and spent almost 4 grand out of pocket. That's with \"good\" insurance. Healthcare in America is a joke.",
              "id": 20,
              "comments": [
                {
                  "score": 63,
                  "content": "Holy crap, I had to have a crown inserted last year and it would have cost me about 1100USD, but since health coverage here (European country) is kind of amazing it was first reduced to 500USD because I'd had some other dental work done and reached the capped cost ceiling. \n\nThen, because the ER screwed up when I was there, I was awarded 500 USD in what I guess you could call a malpractice payout (fell on my bike, tooth went through my bottom lip before disintegrating. They didn't clean up the wound which left a lot of tooth fragments in my lip which I had to get surgery to remove a couple of months later).\n\nSo, all in all, got a crown for free.",
                  "id": 21,
                  "comments": [
                    {
                      "score": 8,
                      "content": "I think realistically she’ll need to wait until travel restrictions have opened and get them done abroad. I don’t know what the US equivalent is, but for anything that intensive UK residents tend to go somewhere like Turkey or Hungary.",
                      "id": 22,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 43,
                  "content": "Four grand? That's all?! I'm walking around with the equivalent of a gently used mid-size sedan at number 32.",
                  "id": 23,
                  "comments": [
                    {
                      "score": 24,
                      "content": "My wife is just finishing a 10-year project to reconstruct her mouth (full implants), and we could have sent a kid to Harvard paying full tuition for a year for what it's costing. (The cause is childhood neglect on the part of her parents.) And that's with basically a volume discount from the periodontist and oral surgeon. And yes, of course we're in the US. /:-(",
                      "id": 24,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 0,
                      "content": "Why?  Why would you pay to get a crown on a wisdom tooth?",
                      "id": 25,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 23,
                  "content": "Same. I had to get a tooth pulled and put in another fake one and that costed me a few thousand dollars with good insurance too. It sucked and that was my first actual dental experience as an adult that I had to pay for myself and it rocked my world lol. I always knew dental work was expensive but I didn’t realize it was THAT expensive",
                  "id": 26,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 21,
                  "content": "Yep, same here.  My dentist & oral surgeon were able to schedule things so that part went on one year's deductible and part hit the next year's but I still paid several thou out of pocket.  \n\nThey both commented that my dental insurance was \"better than usual\" and it STILL cost me a small fortune.",
                  "id": 27,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Australian here, for some reason half of my teeth (baby and adult) never existed so after braces to move the very spread out teeth, I wore dentures until I was 30. I went on to get implants (6 implants supporting 12 crowns) and was lucky that my parents had saved up since I was a kid and paid for it. \n\nPrivate Health covered about $2000, Medicare most of the hospital and anaesthesia) but that was nothing compared to out of pocket - I'm talking $75k.\n\nTwo years prior I had to have a complete jaw restructure/rebuild and with the complications the total cost of that procedure, hospital, bone grafts etc came to about $450k. Thankfully it was considered lifesaving so I was fully covered by Medicare. \n\nI have a half a million dollars invested with a face full of metal. None of it came cheap. Dental work is the worst.",
                      "id": 28,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 13,
                  "content": "In what countries is dental covered under universal healthcare?\nA crown has never costed 10,000. A dental implant doesn't cost that. Maybe in beverly hills. \nNTA OP. Sounds like her problems were mostly preventable.",
                  "id": 29,
                  "comments": [
                    {
                      "score": 26,
                      "content": "In the UK, dental work is covered by the NHS - free if you are under 16 or in education up to 19 and if you are older than that then there are payment caps for the treatment.  The most you will pay is a couple of hundred pounds.  [**https://www.nhs.uk/nhs-services/dentists/dental-costs/how-much-will-i-pay-for-nhs-dental-treatment/**](https://www.nhs.uk/nhs-services/dentists/dental-costs/how-much-will-i-pay-for-nhs-dental-treatment/)",
                      "id": 30,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 14,
                      "content": "In the US, even with dental insurance, my bf paid over $3k for a tooth implant when his real tooth exploded. That's not counting the cost of removal, bone grafts and the bridge he had to have while the bone graft and gum healed enough to be able to take the implant. From what the OP is describing, this will be mostly implants not crowns, as they've already removed teeth.",
                      "id": 31,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 4,
                      "content": "[It looks like the lowest cost per implant is probably $3K](https://somersworth-dentist.com/procedures/dental-implants-2/)",
                      "id": 32,
                      "comments": [],
                      "relation": "No"
                    },
                    {
                      "score": 2,
                      "content": "I used to have good dental when I was teaching in South Korea. I had a molar crack in half and break off during lunch one day. I had a gold crown put in for, maybe $500.00. (This was back in 2007 or so before gold prices shot through the roof.)",
                      "id": 33,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I had a crown almost 30 years ago in Buffalo (a.k.a one of the cheapest cities in the US, and it still cost almost 2k.",
                  "id": 34,
                  "comments": [
                    {
                      "score": 4,
                      "content": "In GA here. I had a restructure and crown for less than $200. Double dental insurance. My job and my wife's.",
                      "id": 35,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "I live in the UK, Scotland to be exact. Recently our dentists have been closed due to COVID but when they were allowed to reopen I had to get a tooth pulled out and it cost me absolutely nothing.\n\n&#x200B;\n\nThe US system absolutely terrifies me",
                  "id": 36,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Here in the UK for private (no practices near me are taking on NHS at the moment) I am looking at £300 for a root canal on one tooth!",
                  "id": 37,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 2,
                  "content": "My dad ended up getting dental work done in India since the same procedure would be 10x as much in the US. Healthcare in America is overpriced for no reason at all.",
                  "id": 38,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "I had a literal gold crown and it cost me £100 in the UK.",
                  "id": 39,
                  "comments": [],
                  "relation": "Attack"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 28,
              "content": "0.o are you serious? Thats like 5 times what a crown costs in AUS. they are 1.5K to 2K on average, before healthcare and medicare.... \n\n&#x200B;\n\nand on that note. NTA. Parents can only do so much.",
              "id": 40,
              "comments": [
                {
                  "score": 9,
                  "content": "My crown all in all was OnLy $3250 without insurance in US.",
                  "id": 41,
                  "comments": [
                    {
                      "score": 20,
                      "content": "Where are people finding these dentists?  Implants are crazy expensive but crowns are much more reasonable.\n\nI paid $600 with average insurance, June.",
                      "id": 42,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 5,
                  "content": "Yeah, $1,200 for my recent crown - and that's Ozzie $\n\n&#x200B;\n\nNTA",
                  "id": 43,
                  "comments": [
                    {
                      "score": 9,
                      "content": "My friend here in Australia gets dental work done when on holiday in Bali, as even with flights it ends up being cheaper for things like a root canal. I hadn’t realised that was a thing, but there you go.",
                      "id": 44,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 1,
                  "content": "UK here, also gobsmacked at the figures!",
                  "id": 45,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "I've never had a simple crown approach 10k, even one where I needed a root canal before the crown was done. \n\nI suspect you mean implant rather than crown - at least I hope so.",
              "id": 46,
              "comments": [
                {
                  "score": 8,
                  "content": "Yeah, I had to pay for a root canal and crown out of pocket two years ago, and it was like $700. $10k is extreme.",
                  "id": 47,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "I'm in the process of getting a crown now including a root canal (in the US),  The whole thing was about $1,600, which I have to pay $400 out of pocket. \n\nMy cousin recently got an implant that was somewhere around $5k.",
                  "id": 48,
                  "comments": [
                    {
                      "score": 2,
                      "content": "This is insane. I live in Canada. Had a root canal and crown done, and only ended up paying around $50 out of pocket after insurance. I couldn’t imagine spending thousands. How do Americans survive!!",
                      "id": 49,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "Yeah.  My one implant was around $4k 10 years ago, including extraction and crown.  But I didn't need to do anything like a sinus lift with it, which would have increased the price about $3k. So, $7k in 2010, cost of living increases, possibly a higher cost of living area, I could see that getting to $10k for an implant, perhaps.",
                      "id": 50,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Yep. I had to have five teeth surgically extracted a few years ago, and the insurance insisted that it could be done with nothing more than local anaesthetic and that sedation wasn't necessary despite the oral surgeon telling them that he would NEVER do an extraction with only local. He was livid and I had to pay out of pocket for that part.",
              "id": 51,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "10k for a single crown???  Has the cost gone up significantly in the last 5 or so years??  I have two crowns that are about 5 years old.  They were about 1k-ish each, and my insurance paid 50%.",
              "id": 52,
              "comments": [],
              "relation": "No"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 197,
          "content": "You did everything you could've. She is an adult and therefore this falls on her",
          "id": 53,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 162,
          "content": "And if OP did take care of this, she wouldn't learn or change. I am sorry to say it, but if she has to suffer for a year or two while she saves, she won't want to go through that again. It may be the only thing that can force her to do better.",
          "id": 54,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 5,
          "content": "Agreed, she is an adult now, but it was neglectful parenting to allow a small child to get by with only brushing their teeth twice a week. OP needed to step up back then and be a responsible adult. Supervise her and make her brush her teeth. You can easily force kids to do things like this with the proper incentives and punishments.",
          "id": 55,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 3,
          "content": "Am I the only one that thinks that this wouldn't be an issue if OP had taught their daughter how to take care of her teeth at a young age?",
          "id": 56,
          "comments": [
            {
              "score": 3,
              "content": "Yep!!! I wasn't taught to brush my teeth at a young age and nobody ever made it a habit in my family. So now I struggle with forming the habit!",
              "id": 57,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "damn my 3 y.o. don't want cavities, she cry if she forgot to brush her teeths.... I can't understand why this person let herself go that way.",
          "id": 58,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "Agree with you completely. \n\nOP, you are NTA. You did what you could. You educated her, encouraged her, sought out medical and psychological help for her. She's now an adult, suffering the consequences of her choices. \n\nMy SO's parents chose not to provide him with much needed orthodontic care as a child. We had to pay for his braces, which he needed to correct some pretty serious issues, before they caused him irreparable damage. Even though the responsibility was on his parents when he was a child, since they neglected that care, we paid for it ourselves as adults. We never even considered asking them for the money needed to cover his orthodontic work.",
          "id": 59,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 1237,
      "content": "NTA - she can apply for dental credit to pay for it",
      "id": 60,
      "comments": [
        {
          "score": 931,
          "content": "O man, as someone who worked at a dental office, don't!  They have fine print saying if you miss or are ever late, the interest goes up to 24.99%, pretty much the highest it can legally be.",
          "id": 61,
          "comments": [
            {
              "score": 365,
              "content": "I had to take out one for 10k for dental implants. You better believe I did everything in my power NOT to miss a payment. Paid it off in 1yr so I had 0 interest. I was lucky enough to have someone explain very clearly how CareCredit works.",
              "id": 62,
              "comments": [
                {
                  "score": 94,
                  "content": "We had to do that when my daughter needed some serious dental work, the dentist that came recommended for the procedure was (natch) out of network, and our dental insurance at the time was an even bigger joke than most so it wouldn't cover ANYTHING.  The cost wasn't anything approaching 10K, but you better believe I was making payments every month like clockwork to avoid the interest.",
                  "id": 63,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 16,
                  "content": "Yeah, I was always REALLY REALLY clear that if they miss or are late even once they are totally boned",
                  "id": 64,
                  "comments": [
                    {
                      "score": 2,
                      "content": "I’m sure you saved a lot of people a lot of money!",
                      "id": 65,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 98,
              "content": "Yeah, 26.99 is what the highest is now generally, though I think they can go higher. But you're right on that. Even that extra 2% is extra killer.",
              "id": 66,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 11,
              "content": "Is it Care Credit? We have folks use it at our veterinary office and I border on harpy-level nagging when I hand them the receipt and go over payment terms. Thankfully it's rare that we run a charge over a few hundred dollars, but I think that puts us in the very small minority when it comes to the average transaction.",
              "id": 67,
              "comments": [
                {
                  "score": 5,
                  "content": "Yes, I think Care Credit is what it was called.  I always thought the name was ironic.",
                  "id": 68,
                  "comments": [
                    {
                      "score": 6,
                      "content": "To be fair, a year with zero interest is really helpful when faced with an unexpected bill. You just need to understand that and make sure to pay it off on time",
                      "id": 69,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "Don't a lot of dental offices offer in house payment plans?  When I got my braces the orthodontist offered a 5% discount if you paid up front, otherwise you put a certain amount down (I can't remember the percentage) and paid the remainder off over the course of your treatment. \n\nEither way, if necessary, she *should* take out a high interest dental loan.  I paid 6 grand out of pocket for my braces (my parents couldn't afford braces when I was a teen so I got them at 30 years old) and I am extremely vigilant about wearing my retainer and taking care of my teeth.  When it's your money and your credit on the line, you suddenly become *very* responsible.  I can't say 13 year old me would have kept track of a retainer or wouldn't have slacked on wearing it, at the least.  But when I had to come up with 6 grand in 18 months, you bet your butt I'm going to make those payments and make the money worth it.",
              "id": 70,
              "comments": [
                {
                  "score": 2,
                  "content": "The office I worked in did- we were part of the hospital so the billing dept handled that. But not all do. My dentist doesn't.  My dads dentist does. My moms dentist doesn't.  My mom's doesnt take any insurance bc the paperwork is such a hassle.  But he's awesome so he always has a full schedule.",
                  "id": 71,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 110,
          "content": "NTA in normal times, I’d suggest going somewhere like Thailand or Mexico to have expensive dental work done. (You get excellent care and a vacation for far less than the cost of the procedure in the US.) \nBut none of that will matter if she can’t come up with the motivation to care for her teeth afterward. \nNot to mention that traveling is bad right now",
          "id": 72,
          "comments": [
            {
              "score": 23,
              "content": "I'd believe Thailand, but Mexico kind of surprises me, but maybe they have a medical tourism industry that you don't hear much about.",
              "id": 73,
              "comments": [
                {
                  "score": 40,
                  "content": "I saw news report on CBS Sunday morning about the rise of dental tourism in Mexico. In fact I mentioned it to my uncle and he's planning on going to Mexico to get some dental work done.",
                  "id": 74,
                  "comments": [
                    {
                      "score": 9,
                      "content": "When I was a kid, I remember my mom driving us down to Mexico (this was before passports were really necessary) so she could get some dental work done.",
                      "id": 75,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 32,
                  "content": "Costa Rica is popular for US dental tourism. It was my original purpose for going to Thailand a few years back.  I was able to send x-rays taken by my dentist for estimates in advance. I met two couples at my hotel that were there for dental care.",
                  "id": 76,
                  "comments": [
                    {
                      "score": 23,
                      "content": "I live in Costa Rica, can confirm. Dental (and medical in general) tourism is big here. Dental professionals are great, and their services are waaaaay cheaper than in the US, ans several other countries.",
                      "id": 77,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 15,
                  "content": "Mexico absolutely has a medical tourism industry - a lot of Americans (especially in the southern states) will go there for medical care, because it costs less than American health care even if they have insurance. A lot of Canucks go to Mexico for elective surgeries as well (gastric bypass, breast enhancement, etc.), I know more than a few folks who’ve done it.",
                  "id": 78,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 10,
                  "content": "I just had a tooth pulled in Cancun for $15.",
                  "id": 79,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 4,
                  "content": "As someone who lives next to the border, if you can't afford a dentist on this side, 90% of people don't have a problem crossing the border to get a root canal etc. Etc. Plus my city is so underserved with dentists that not a single dentist on town does wisdom tooth extractions anymore. We need at least 2 more dental practices to open to even try to be competitive with mexico's quickness let alone the prices.",
                  "id": 80,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 3,
                  "content": "Dental tourism in Mexico is huge along the border.  People in Arizona and southern California can just make it a day trip out of it.  Pharmacies are a big draw as well.",
                  "id": 81,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "No"
    },
    {
      "score": 982,
      "content": "NTA\n\nIf she hasn't started taking proper care of the teeth she has, paying for crowns or veneers would only delay the inevitable.  The tooth matter below the crown or veneer would rot away.",
      "id": 82,
      "comments": [
        {
          "score": 290,
          "content": "Time to get all the teeth pulled and wear dentures.",
          "id": 83,
          "comments": [
            {
              "score": 200,
              "content": "[deleted]",
              "id": 84,
              "comments": [
                {
                  "score": 90,
                  "content": "I had bad dental hygiene, I would brush them however but the problem with mine was when my body weight reached a point were I started to get my period. I wound up throwing up a day or two, not even water would stay down. I was told that it was normal for some woman. So that on top of my already bad hygiene and inheriting my dads genes when it came to teeth, I now have dentures. They can work, and can take some getting used to. The problem is the cream is sticky and you can spend twenty minutes trying to get the gunk off your gums.  I did this to myself, I take full responsibility, and I did try to keep brushing, but every month, for a day or two, throwing up everything I eat or drink? There was only so much I could take mentally. That being said.\n\nOPs daughter has shown she is neglectful on purpose. I went to the dentists ( mind you one of them was not kind in how she talked to me about my dental hygiene and destroyed my trust in her ability to treat with me in an appointment were she made it clear in her regard to my feelings meaning jack shit to her. My last appointment with here I left right after she numbed my mouth and said some comment that sent me out of the office sobbing ) but I went to them. My problem was stomach acid can destroy enamel over time and my doctor at the time suggested we wait for my body to acclimate to the whole of my period. \n\nOP is NTA in my opinion. It will be an up hill battle for OP to get there Daughter to get something like dentures or for the Daughter to pay for the procedures herself.",
                  "id": 85,
                  "comments": [
                    {
                      "score": 44,
                      "content": "Ooh I felt that. I had Covid last spring and coughed until I threw up every day for like 2 weeks, went to the dentist a month of so after to hear “your enamel is breaking down” 🙃",
                      "id": 86,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 11,
                      "content": "I’ve had severe health problems my entire life and terrible genetics when it comes to teeth, I am 33 and I have upper dentures, to be honest of course I was ashamed but I had so many years of incredible pain and agony I just wanted them gone and honestly no one can tell. I don’t have the horrible pain and I’m used to it. I know I’m going to have to get my bottom one is taken care of but the pandemic put a hold on that, \n\nI just want anyone that reads this to know that please please please take care of your teeth and please take care of your children’s teeth! My mom was never on it with us",
                      "id": 87,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 530,
      "content": "NTA since you did try for what, 24 years or so? But only slight. \n\nThere are other neurotypes besides depression that can make oral hygiene quite difficult either due to sensory or executive issues. For example, I’m autistic and good oral hygiene has always been a challenge for me, though fortunately the most I’ve ever needed was a deep clean, nothing as extreme as what you described. Autism is also frequently under diagnosed in women as women tend to mask a lot better. So that’s one explanation why it might be difficult for her.",
      "id": 88,
      "comments": [
        {
          "score": 366,
          "content": "I was thinking this at first too, but OP seemed willing to try *anything* that would help and her daughter was unwilling to negotiate at all. Like, I think a damp tissue run across the teeth would have been acceptable if the daughter told her that's all she could do. Or, like, chewing a twig or whatever. But the daughter outright refused, which is different than being unable.\n\n(That said, screaming is never helpful)",
          "id": 89,
          "comments": [
            {
              "score": 281,
              "content": "No one seems to want to admit that the daughter might just be straight up lazy 😂",
              "id": 90,
              "comments": [
                {
                  "score": 76,
                  "content": "I mean, it’s possible, but I prefer to give everyone the benefit of the doubt.",
                  "id": 91,
                  "comments": [
                    {
                      "score": 61,
                      "content": "No one ever wants to give parents the benefit of the doubt that she did all she could. My SD is neurotypical and it is a complete chore to get her to do her hygiene things. But she knows how to apply her eyeliner perfectly. Keep telling her you can look as beautiful as a princess but if you smell like a sewer no one will want to be around you anyway. \n\nI'm not that worried because she's still young. If I get this call in 12 years, though? Nah.",
                      "id": 92,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 43,
                  "content": "There are so many people who are considered lazy, but the reality is that they have undiagnosed executive dysfunction issues. I wish we could just do away with the term lazy...",
                  "id": 93,
                  "comments": [
                    {
                      "score": 87,
                      "content": "No, I’m sorry but this person is 24 and able to articulate their needs and problems. They would have been able to express some basic reason ie a fear or sensory issue (doesn’t feel good) for OP to go on. Sometimes people simply refuse to do what they don’t want to do and there’s no underlying issue except their character. It’s ok to say it.",
                      "id": 94,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 13,
                      "content": "Laziness as a word exists because it describes a real and observed phenomenon.",
                      "id": 95,
                      "comments": [],
                      "relation": "Attack"
                    },
                    {
                      "score": 2,
                      "content": "humanparts.medium.com/amp/p/3af27e312d01",
                      "id": 96,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 13,
                  "content": "Fighting with your parents all the time over this would be more exhausting.\n\nThere was a guy that months ago wrote about how dental health had been a challenge for him all his life until he found toothpaste with kids flavors. The problem, that he hadn’t realized because it had been a problem forever, was that he hated the mint flavor. He now brushes his teeth 3 times a day, no problem. This kind of behavior is rarely laziness.",
                  "id": 97,
                  "comments": [
                    {
                      "score": 3,
                      "content": "Ever seen how much energy a kid will put into arguing with their parents over throwing their clothes on the hamper as opposed to on the floor, even though the added effort to put the clothes in the hamper is only marginally more than the floor? If I had to guess about OP’s daughter, I would say a combination of laziness and defiance. It started with laziness as a child, then became a way to buck the system/defy her mom, now as an adult it’s back to “well I’ve been this way for forever, no sense changing now”, which again circles back into laziness.",
                      "id": 98,
                      "comments": [],
                      "relation": "Attack"
                    }
                  ],
                  "relation": "Support"
                },
                {
                  "score": 5,
                  "content": "Yeah but this doesn't sound lazy this sounds crazy. Who the f only brushes their teeth 2 times a week? Crazy people",
                  "id": 99,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 4,
                  "content": "It's just very unlikely for someone to be *that* opposed to tooth brushing from a young age without a stronger reason than laziness. Medical professionals can be terrible at seeing any issues (particularly with women) that aren't really clear cut, so never having ID'd a particular issue to cause her aversion doesn't mean there isn't one.",
                  "id": 100,
                  "comments": [],
                  "relation": "Support"
                },
                {
                  "score": 2,
                  "content": "Or have control issues. I know two girls who use their lack of eating as a tool to control their parents and family members who babysit them. One has terrible teeth because she started so young.",
                  "id": 101,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 43,
              "content": "It might not be a gag reflex or discomfort so much as executive issues, IE the part of the brain that says, “Apply paste to toothbrush and brush, spit, brush, wash.” The series of tasks might seem trivial, but it can definitely be a challenge!",
              "id": 102,
              "comments": [
                {
                  "score": 22,
                  "content": "And it...only presents for teeth brushing. No other hint of executive dysfunction anywhere else. \n\n Nah.",
                  "id": 103,
                  "comments": [
                    {
                      "score": 18,
                      "content": "Well, that's why it's weird, right? If this person is otherwise together, doesn't it seem weird that she absolutely won't brush her teeth?",
                      "id": 104,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": 18,
                      "content": "Says who? executive functioning disorders often go undiagnosed in women. Even if they do go see a psych it's often misdiagnosed as something else. It's entirely possible that she went to multiple psychs and they all missed it if she has coping mechanisms and masking in place for the more obvious symptoms.",
                      "id": 105,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 19,
              "content": "> Or, like, chewing a twig or whatever. \n\n*~snickers~*",
              "id": 106,
              "comments": [
                {
                  "score": 50,
                  "content": "Technically that is a thing! It's called miswak, it's a twig taken from a tree with antimicrobial bark & has been used for something like 7,000 years, obviously predating the invention of the modern toothbrush by quite a bit. Not that that help's OP's daughter much at this point lol, but we've consistently had multiple different options for oral hygiene available for millennia.",
                  "id": 107,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": -31,
              "content": ">but OP seemed willing to try *anything* that would help\n\nAnything except make actual dental appointments, it seems. Years of doctors, therapists, medication, and specialists, but no mention of dentists.\n\nThis seems like an issue that started way, way back in childhood and was never properly resolved then and has now spiraled out of control with the daughter now being an adult.",
              "id": 108,
              "comments": [
                {
                  "score": 81,
                  "content": "We went to dentists and orthodontists to clarify, multiple times. I included it under doctors sorry for not specifying",
                  "id": 109,
                  "comments": [
                    {
                      "score": 31,
                      "content": "You didn't have to, it is very clear that doctors mean dentists in this context. Also NTA.",
                      "id": 110,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 55,
                  "content": "Don’t dentists count as doctors?",
                  "id": 111,
                  "comments": [
                    {
                      "score": 13,
                      "content": "Yes, they earn a DDS (in the US) and are referred to as Dr.",
                      "id": 112,
                      "comments": [],
                      "relation": "Support"
                    },
                    {
                      "score": -2,
                      "content": "Really awkward semantic hill to die on. How many times did you have a dental appointment that you solely referred to it as a doctors appointment? Exactly. You didn't because nobody does that. Not every last technicality is worth pointing out.",
                      "id": 113,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                },
                {
                  "score": 9,
                  "content": "I guarantee you they went to a dentist, that's probably who the doctor's were -- dentists and orthodontists.",
                  "id": 114,
                  "comments": [],
                  "relation": "No"
                },
                {
                  "score": 6,
                  "content": "Fair enough observation. I concede to that.",
                  "id": 115,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 78,
          "content": "I have never liked brushing my teeth, ever since childhood. The foaming while brushing, the flavours, the poking of the brush. It has taken me years to start caring for my teeth. It always made me feel like throwing up. Now I can brush with water or a tiny amount of toothpaste (still gag-inducing) and then floss and rinse with non-flavoured fluoride (strong prescription kind that doesn't taste like anything at all).\nIt can be hard getting even to that point.",
          "id": 116,
          "comments": [
            {
              "score": 53,
              "content": "One of the things I was thinking as I read the post was the the daughter might have an exceptionally strong gag reflex. I have a moderately strong gag reflex (I can’t brush my tongue and sometimes taking meds makes me gag) so I can see how someone with a stronger reflex would be miserable. \n\nOr, like you (and my dad), brushing is a downright miserable sensory experience for the daughter.",
              "id": 117,
              "comments": [
                {
                  "score": 4,
                  "content": "I gag every time I brush my teeth with an elec toothbrush in the morning. Dunno why but I switched to manual toothbrush for the morning. Gag reflex is pretty annoying",
                  "id": 118,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 22,
              "content": "Have you ever tried \"natural\" toothpaste? I switched to Tom's after someone told me toothpaste is sweetened like diet soda. At first it tasted like nothing (which I loved) and now it's just a very mild flavor. The few times I've used regular toothpaste since then it has knocked me over with how strong tasting it is, it's so sweet it's like candy.",
              "id": 119,
              "comments": [
                {
                  "score": 11,
                  "content": "I have tried a toothpaste called Salutem a long time ago that was unflavoured but instead had a weird texture like brushing your teeth with ointment with a mild flavour of nothingness/medical.",
                  "id": 120,
                  "comments": [
                    {
                      "score": 0,
                      "content": "Just don’t use toothpaste. \n\nI haven’t used it for years. It’s advertising hype.",
                      "id": 121,
                      "comments": [],
                      "relation": "No"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 17,
              "content": "I never minded the toothpaste but my teeth always felt sensitive after and I hated it, then along with just being forgetful as hell I probably never really developed good habits. Luckily enough didn't really get cavities besides when I had braces because they kept getting issues and they kind of screwed up my teeth even with my trying to be careful with them, and now as I'm getting older I'm getting more pain problems with my nerves and jaw so trying to brush can be painful. \n\nBut still trying to remember to get more in a habit of more often brushing, even if it's just a quick brush with just water because it's still better than nothing. Or take a tissue or cloth and rub shit off my teeth if I'm not at home (I should get those little things I can toss)  because again better than nothing. \n\nMy dentists can still definitely tell I have a sweet tooth though, even if I'd managed to mostly avoid cavities until more recently.\n\nBut it's just annoying as hell because I'm not \"refusing\" to brush my teeth. Just between aches/pain, sensory issues, and literally just forgetting to,  don't brush as often as I should. (Hell sometimes I dont even eat because trying to open my mouth much makes my jaw hurt like hell. Yawning? Oh shit oh fuck I messed up and now everything hurts. Why would I brush my teeth right now?)\n\nAnd hell if I had a parent SCREAMING at me about it, PRETTY sure that'd put me off on it too. \n\nBut see nothing for why kid is \"refusing\".  Are they actually refusing or does parent just see it as that and doesn't accept any explanations? Has she tried soft brushes? Kid brushes? Water flossing? Etc",
              "id": 122,
              "comments": [
                {
                  "score": 7,
                  "content": "I never got holes in my teeth until I turned 18. Then they came as a big wave group.",
                  "id": 123,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 9,
              "content": "If it's making you gag press your left forefinger into your left thumb. It can supress your gag reflex temporarily. Indinthis when brushing my tongue and it works.",
              "id": 124,
              "comments": [
                {
                  "score": 4,
                  "content": "You can also try digging your left thumbnail into your left forefinger. That's the only thing that gets my pills down some days.",
                  "id": 125,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 8,
              "content": "If the foaming is a problem, try toothpaste without sodium laureth sulfate. That's the foaming agent in most hygiene products, and it has nothing to do with the actual cleaning of the teeth (or hair, or skin, it just foams, and is very dehydrating).\n\nMost new environmental friendly toothpastes don't have SLS in them, which can take some getting used to to most people, but it might be ideal for people who has a problem with the foam. It can also help people who have a problem with afte (ulcers in the mouth).",
              "id": 126,
              "comments": [
                {
                  "score": 4,
                  "content": "Sensodyne has a good range of SLS free toothpastes. SLS gives me mouth ulcers, so I try to avoid it, and there’s loads more options on the market nowadays.",
                  "id": 127,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "If you’re in the UK or EU, Marvis that does a ton of different flavours, Sensodyne for sensitive teeth has a mild flavour, my dentist always recommended a French brand called Elmex (sensitive) that protects and supplements your tooth enamel. Also, toothpaste commercials lie to you, you don’t need that much toothpaste on your brush, a little goes a long way, and always on a dry brush. An electric toothbrush might also be the way to go, they usually only brush for as long as recommended and then turn off and do a more efficient job than manuals.",
              "id": 128,
              "comments": [
                {
                  "score": 2,
                  "content": ">always on a dry brush\n\nWhy?",
                  "id": 129,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": 49,
          "content": "I'm autistic and I struggle with dental hygiene. So I get it. I've tried a lot of things over the years and found a way to endure brushing my teeth once a day. I'm still gagging and it feels horrible, but I'm doing it anyway. I floss regularly and I hate it.\nDental problems can actually cause serious physical and mental problems, so I'm working hard to maintain my dental care.\nI go to dentist appointments and see a oral hygienist twice a year. It stresses me out and I sometimes have a meltdown.\nIt sucks.\n\nHowever, even if OP's daughter was autistic or has another issue that can cause her problems with dental hygiene; OP has done everything to help her. \nThe daughter knew it would cause problems in the long run, it's her responsibility now. \n\nNTA",
          "id": 130,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 13,
          "content": "It sounds like she explored a lot of different routes and solutions. But taking your point, if there is some neurotype at play here it's undiagnosed and the daughter still isn't taking care of her teeth. Spending thousands of dollars isn't going to help and OP will need to pay for expensive dental treatments for the rest of her life. \nNTA",
          "id": 131,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 9,
          "content": "Autistic son here, self-cleaning is very difficult for areas like teeth and hair. He absolutely hates it. He spends about 5 seconds brushing his teeth under coercion. Was autism ever a diagnosis or on the cards at all?",
          "id": 132,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 8,
          "content": "Also as someone with ADHD (which is also under diagnosed and often symptoms present differently in women) it makes it hard to brush my teeth. I was really bad it at for years. A lot of times I stayed up until I'm too tired and want to go bed or I'll simply forget. Sometimes I'll also think \"what's one time skipping going to do\" and then half a week would go by without brushing.",
          "id": 133,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 1,
          "content": "As someone whose sister was also diagnosed with autism at 18 (and me, who wasn’t diagnosed with adhd until I was nearly 25), isn’t that kind of the fault of the medical/psychological professionals? \n\nAt least OP was considerate enough to recognise it may be psychiatric condition and take her daughter to try to get professional help.",
          "id": 134,
          "comments": [
            {
              "score": 2,
              "content": "There’s so much unknown and most research that gets attention is bafflingly wrong and conducted by distinctly not autistic people. And it’s generally overlooked in women since what is known is biased towards how men tend to exhibit.",
              "id": 135,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        },
        {
          "score": -19,
          "content": "my teeth are an absolute mess. I'm autistic and my mom decided my slightly crooked teeth were monstrous and i got 4 years of braces. it was horrible. uncomfortable, painful, traumatic-depending on the procedure (the dental molds oh god the molds). i can barely make myself eat sometimes, and it's a real struggle to brush even once a day. for a long time i couldn't stand to brush at all. you're nta for being unwilling to pay, but yta for screaming at your kid. cuz that aaaallllllways works out really great to get kids to do what you want",
          "id": 136,
          "comments": [
            {
              "score": 17,
              "content": "The molds! I felt like vomiting every time they did the molds when I had braces. Ugh, sorry you were forced to go through that",
              "id": 137,
              "comments": [
                {
                  "score": 5,
                  "content": "i was definitely not the only kid who sobbed and gagged their way through the molds. i don't care how helpful it might be, i could absolutely never put a kid through that, let alone 5-10 every single day.",
                  "id": 138,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 14,
              "content": "Is she meant to bodily carry her daughter to the dentist? Or pin her down to brush her teeth even when she's eight years old plus? The daughter has to take responsibility for the fact her teeth are wrecked because of her own fault.",
              "id": 139,
              "comments": [
                {
                  "score": -21,
                  "content": "a of all, did i say that op should have done that?\n\nand b of all, did she ever try to find out why? or did she just punish? but we see it a lot in this sub: parents ignore, yell at, deny when their kids actually flat out state when something is a problem. did you see the one where the kid was asking if she did a bad thing by calling the nanny to watch her siblings because she felt sick, and it turned out her appendix was rupturing? mom's first reaction was to tell her she was wrong, that she wasn't feeling what she said she was. \n\nI'm only saying that people don't usually make choices like this \"just because.\" nobody sits down and says \"ok i know from many many sources that improper dental hygiene will damage my teeth, but i don't care! brushing sucks!\" people don't just decide randomly out of the blue to never speak to their fathers again. they don't decide to blow up a marriage of multiple decades just for funsies. op can't go back in time to find out the root cause (no pun intended), but maybe it'll help someone else, or maybe it'll motivate her to seek out a solution with her daughter that doesn't involve decimating her savings.",
                  "id": 140,
                  "comments": [
                    {
                      "score": 45,
                      "content": "I do want to clarify as well that I never ignored her or only punished her for this issue. I myself struggle with mental health issues and autism is a route we also explored during her childhood and teen years. We tried many different methods, even the chewable toothpaste tablets, soft brushes, and cloth. She went to many specialists and I talked to her many times to get to her root issue but all she could tell me is she didn’t want to brush her teeth. I want to make clear that I never once ignored how she felt or got angry with her (just frustrated out of concern for her well-being, and I agree yelling is never a good idea, I felt so lost and helpless).\n\nDoctors gave her multiple diagnosis, we tried many medications, we tried different methods but at the end of the day I can’t force her to take care of her dental hygiene. I live in regret for not being able to figure out why",
                      "id": 141,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "Attack"
            },
            {
              "score": 13,
              "content": "Something that I have done is used kids toothbrushes, the bristles are softer and the smaller head works better on my teeth. I have a hard time making myself brush my teeth, I say “do it” then I just don’t. \nBut I keep up with the 6 month appointments. I like my dentists now but as a kid I absolutely hated the one I saw, I now know that my entire family did, but it mostly had to do with the fact that I had a number of baby teeth and 4 permanent teeth pulled before I was 14. Genetics! I have relatively good teeth, but I think it’s because I didn’t start losing any of them until I was almost 9 years old. \nSome people have said that if toothbrushes hurt too much, a washcloth with toothpaste works too. And you can always buy kids tooth paste, buy any flavor you like. Hello makes a watermelon one.",
              "id": 142,
              "comments": [
                {
                  "score": 7,
                  "content": "i do what i can, but it can be hard to win out over the trauma. i had been great about taking care of my teeth before the braces. now, i just do what i can, and hope for the best. nobody in my area wanted new medicaid patients, and then covid hit, and when i finally go in its gonna be an absolute nightmare. dealing with various dental insurances and their bs means i never judge anyone about their teeth anymore. i swear they make it as horrible as possible so you just don't go and they don't have to pay.",
                  "id": 143,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 485,
      "content": "NAH. This could have been written by my mother. I'm in the same situation as your daughter, and very close to her age coincidentally. I'll admit I put myself here with my depression. I spent many years never expecting to make it past 18, never had ambitions/dreams/hobbies, nothing mattered except getting messed up and hurting myself, so my teeth weren't exactly something I cared about. Now of course I'm an adult with a partner, a full time career, and the knowledge of how bad tooth pain can really get. With the right support system I've just recently in the last couple years started getting things done. And in my awful reality,  I don't get veneers. I don't get partial dentures. I don't get caps. My insurance covers next to nothing and the surgeries alone have been hundreds. I'm currently walking around with missing front teeth, I constantly get asked if I smoke crack, I don't smile or laugh in groups of people I don't know very well, and every time I look in the mirror I want to smash it because that's actually my mouth and my screwed up teeth and my mistakes. My options when eating these days are breakfast essentials smoothies or mashed potatoes because I will cut my gums where my teeth used to be. I get where she's coming from. This existence is brutal, and it hurts. She shouldn't be freaking out on you, or demanding money, but I can't call her an AH for feeling desperate and ugly and afraid. I also don't believe she actually thinks you're a horrible mother, she's likely lashing out because she's realized how bad things really are and feels backed into a corner. This is not an excuse - but something to take into consideration. You're not an AH for standing firm on refusing to pay, at all. I really think the two of you should sit down together and maybe you can help her look at her options going forward, maybe somewhere nearby has payment options or maybe there are things in her budget that could be cut out and instead put into a savings towards getting whatever work she needs done. Sorry for the essay. This one spoke to me. Good luck to both of you, I truly hope she starts taking care of herself and can find peace with her current reality.",
      "id": 144,
      "comments": [
        {
          "score": 303,
          "content": "Thank you for this comment, it really got to me. I can’t imagine how hurt and upset she is. If she calms down and wants to talk I will gladly help her figure out options. I hope you are well",
          "id": 145,
          "comments": [
            {
              "score": 70,
              "content": "Just a slight addition - \n\nI hate brushing my teeth. I hate, hate, hate it. If there were no side effects, I would have dentures already. I was like, sixteen years old, when I did the research and discovered the downsides. I am praying for the day when we can upgrade humans to the point where I can just throw the damn things in the dishwasher with the other eating utensils. \n\nI still try, because dental pain is painful, but the first thing to go out the window when my mental health takes a dip is dental hygiene. \n\nIt's 100% irrational hate. And not doing it consistently makes it worse because then gums bleed and teeth yellow so it feels both painful and pointless to do anything about it.\n\nI guess the point I wanted to make is that the dental hygiene itself doesn't have to be a symptom of anything. Hating the whole process is something shockingly many people feel, according to my dentist. If there's anything to be looked into, though, it might be the lack of awareness of the consequences, despite your attempts to make her aware. Are there other areas of her life where she seems unaware of consequences? Very \"that would never happen to me\" mentality? \n\nNTA, btw.",
              "id": 146,
              "comments": [
                {
                  "score": 8,
                  "content": "That's interesting. I guess it's an inherently sensitive part of you so even without hypersensitivities or mental health issues lots of people are going to have some aversion.\n\nThe daughter is extreme enough that I find it difficult to believe it's *not* a symptom of something, but that's an interesting idea about feeling immune to consequences.",
                  "id": 147,
                  "comments": [],
                  "relation": "Support"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 18,
              "content": "OP, just wanted to tack on here. First of all, NTA, but I believe the poster above has got a lot right. I’m going through something similar with my husband right now, although his teeth aren’t where your daughter’s are yet. He has anxiety to begin with, but his teeth are an additional source, as is the pain he is in right now. This can make him lash out. When we lived in Colorado, there was an AMAZING dental practice that was top notch, inexpensive, and offered easy-to-keep-up-with payment plans. I don’t think I’m allowed to name them here but if you want the name, PM me and I will send. Also—I have a client who swears by medical (specifically dental) tourism. I DO NOT know anything about this, but he is a 45 y/o man who makes a very modest living, has no dental coverage, and has great teeth. AGAIN, I’m not an expert but maybe others have experience here, it may be something to look into (post pandemic I guess).\nETA: I just looked up the dental practice—they are national! Anyone who needs info please send a pm!",
              "id": 148,
              "comments": [
                {
                  "score": 2,
                  "content": "Would you mind DM-ing me the name? I know someone who also has lot of similar issues",
                  "id": 149,
                  "comments": [],
                  "relation": "No"
                }
              ],
              "relation": "Support"
            },
            {
              "score": 10,
              "content": "Adding my 2 cents here, if you feel you want to help your daughter, maybe you could do it on condition of regular check-ups. Like you'll pay, but she has to commit to a dental inspection every 3 months to ensure she looks after her new teeth, and she can pay you back in installments or something later.. NTA btw... \n\nJust a thought...",
              "id": 150,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 3,
              "content": "OP, I know you mentioned getting her tested for depression and etc, but has she ever been tested for ADHD? ADHD in women is often overlooked because the symptoms are presented differently than in boys. I used to have similar problems with my teeth as your daughter and my mother used to get on me the same way as you did (only she didn’t try to get me diagnosed with anything, just thought I was lazy and gross). I didn’t get diagnosed until late last year and it explained so much. It might be worth exploring for her to see if that could be a cause. \n\nIf you end up changing your mind, maybe give her the condition of getting tested (though depending on where you are and insurance/provider) it might take a bit as well as committing to regular cleanings.",
              "id": 151,
              "comments": [],
              "relation": "Support"
            },
            {
              "score": 2,
              "content": "Initially I would have said NTA, she needs to pay for them herself in order to appreciate them enough to not just destroy them by not brushing again. However after reading this comment, maybe you could come to a compromise? Pay a few thousand, not for the full work but for the minimum to make her look OK? Like if she's missing her front teeth, pay to fix what's most noticeable and then the rest is up to her.",
              "id": 152,
              "comments": [],
              "relation": "Support"
            }
          ],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 217,
      "content": "**NTA**. \n\nShe will care for her new teeth more if she has to find a way to pay for them herself.",
      "id": 153,
      "comments": [
        {
          "score": 41,
          "content": "I agree. I only really started being strict about my dental hygiene after I turned 18 and had to start paying for the dentist. Avoiding costs is a great motivator.",
          "id": 154,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 199,
      "content": "NTA. As is often said on this site, do not set yourself on fire to keep her warm.\n\nYou did everything you could to prevent this. She is reaping what she sowed",
      "id": 155,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 183,
      "content": "Please don't use your retirement fund for this.  You have been a good parent and tried to teach her good dental hygiene and how to take care of her body.  She refused to listen.  She is experiencing the consequences and there is nothing you can do about that.  If you are near a dental school,  she can apply to have her work done at reduced rates there by students supervised by their teachers.  I hope this helps.",
      "id": 156,
      "comments": [],
      "relation": "Support"
    },
    {
      "score": 102,
      "content": "You didn’t have to write any more than “my daughter is 24...” NTA and I’m sad for you that you thought you did something wrong :(",
      "id": 157,
      "comments": [
        {
          "score": 7,
          "content": "Exactly what I thought.\nNTA",
          "id": 158,
          "comments": [],
          "relation": "Support"
        },
        {
          "score": 2,
          "content": "...my parents have helped me pay for dental care while I'm unemployed. I had a tooth literally break apart and had to get a new crown because of it. Granted it had been root filled (not native English speaker) a few years prior but still. The very same spring I needed a wisdom tooth removed through surgery. While dental care is subsidied in my country it was still too much money for me to pay myself. And it had to be done. So, my parents helped me.",
          "id": 159,
          "comments": [],
          "relation": "Support"
        }
      ],
      "relation": "Support"
    },
    {
      "score": 63,
      "content": "Info: Does she have other issues? Other than the lack of dental hygiene, is she generally neglectful of herself?",
      "id": 160,
      "comments": [
        {
          "score": 97,
          "content": "Only with her teeth. As I said in the post we’ve been to many specialists and doctors to no avail. The doctors had no advice for me and exhausted all avenues of treatment with us",
          "id": 161,
          "comments": [
            {
              "score": 45,
              "content": "[deleted]",
              "id": 162,
              "comments": [
                {
                  "score": 82,
                  "content": "Yes, though as she got older it became harder because she started to refuse. As a younger child she went 2x a year",
                  "id": 163,
                  "comments": [
                    {
                      "score": 65,
                      "content": "Is there anything that happened at one of those checkups/cleanings that may have traumatized her? When I was around 7yo, I had to have teeth pulled and the novacaine they gave me didn't work, and I have had a hard time taking care of my teeth ever since. Im in my 20s and I've only just recently been able to start up an oral hygiene routine.",
                      "id": 164,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "No"
                }
              ],
              "relation": "No"
            },
            {
              "score": 39,
              "content": "Have you tested her for drug use? Heroine and meth can contribute to tooth decay, which may be likely if your daughter is this young and losing her teeth.",
              "id": 165,
              "comments": [
                {
                  "score": 72,
                  "content": "This is an option I hadn’t considered. I will definitely look into this. If it is the case I will use the money she wants for her teeth to help her into rehab instead",
                  "id": 166,
                  "comments": [
                    {
                      "score": 23,
                      "content": "Yeah. Because it's pretty insane that she'd lose her teeth so young. It's especially uncommon in women (Of any age) with it being around 3% in the population. Meth, Heroine, Ecstasy, Cocaine, and even Marijuana can cause dry mouth, which impacts saliva production, leading to decay. \n\nMeth and Heroine are particularly bad (My brother did meth most of the time and found his stashes, but we also found syringes suggesting heroine), and meth is acidic, and heroine is similar in nature. Both lead to severe decay and loss of teeth. He was 26 when he had to have 6 teeth pulled from his mouth from severe decay and infection. He was VERY lucky to not lose more, but his gums and other teeth are still discolored from the drug use.\n\nPeople who abuse drugs are also less likely to care for there teeth or get regular check ups and cleanings with a dentist (Because dentists know what to look for, and it's hard to hide meth mouth from a dentist, let alone someone who's seen it before), which might explain her later dismissal of hygienic practices like cleaning her teeth and going to see a dentist later on.",
                      "id": 167,
                      "comments": [],
                      "relation": "Support"
                    }
                  ],
                  "relation": "Support"
                }
              ],
              "relation": "No"
            }
          ],
          "relation": "No"
        }
      ],
      "relation": "No"
    }
  ]
}